[
    {
        "author": "FatDickGreg",
        "body": "Imagine believing there’s a microchip in a vaccine and mango will be reinstated on Friday",
        "created_utc": 1628470513,
        "id": "h88enqv",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628499313.0
    },
    {
        "author": "10153--35101",
        "body": "Dude just get the jab. All the cool kids are doing it. You don't even notice the microchip after a while.",
        "created_utc": 1629730302,
        "id": "ha1e7y5",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1629759102.0
    },
    {
        "author": "ImAMaaanlet",
        "body": "Mrna vax in japan contaminated with a \"metal\" aka A MICROCHIP BILL GATES IS TRACKING YOU",
        "created_utc": 1630345682,
        "id": "haydj8o",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1630374482.0
    },
    {
        "author": "-B-H-",
        "body": "You convinced me.   I had some money left from cashing out half of my crypto yesterday.   I put most into the microchip/semiconductor industry.   I was looking for a wildcard dark horse.",
        "created_utc": 1629381409,
        "id": "h9j7i03",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1629410209.0
    },
    {
        "author": "MilitaryFuneral",
        "body": "Why are microchip stocks dropping? I thought they were the next hot thing and went all in last week",
        "created_utc": 1628604249,
        "id": "h8etd15",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1628633049.0
    },
    {
        "author": "SuperPwnerGuy",
        "body": "Still in the middle of a silicone microchip shortage.....",
        "created_utc": 1629731452,
        "id": "ha1gwgl",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629760252.0
    },
    {
        "author": "elomariwest",
        "body": "Is there a microchip ticker that is often touted in here? I cannee remember if and what ..\n\n&amp;#x200B;\n\nThank you please",
        "created_utc": 1630162866,
        "id": "haotg1t",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630191666.0
    },
    {
        "author": "GYSTBishes",
        "body": "Back then we were begging for bill Xbox or Steve apple to make some kind of microchip to put in us to act like a fucking homing pigeon…my how opinions changed 🤣🤣🤣",
        "created_utc": 1628655179,
        "id": "h8hws1y",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628683979.0
    },
    {
        "author": "ThinBlueMoose",
        "body": "The world has been lagging on chips. As chips are starting to be needed for next to everything, these microchip companies will have to keep up. That’s why AMD did well. They’ve been hustling out there to have better production and also upped their guidance for next quarter. Same will probably happen with nvidia. More production power to sell more chips means more profit. One of the reasons AMD went up nicely is because the future sales for chips. But then there is TSM… which didn’t do much on their earnings report…",
        "created_utc": 1629165665,
        "id": "h98kojv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629194465.0
    },
    {
        "author": "gafana",
        "body": "Typically I'd agree but with EUV, it's a bit different.  ASML spent 20 years and billions of dollars investing in this technology.  Every other major manufacturer of photolithography equipment either never tried to do EUV, thought it couldn't be done for mass market, or tried to do it but gave up after years of research and billions in R&amp;D.  ASML is the only one that stuck through it and ended up bringing an EUV device to market and are the only ones to have done so.  Literally every new microchip that is around 7nm or smaller uses ASML's EUV equipment.  Even Intel has been talking about giving in and buying ASML's gear to build their next generation chips.  It's actually a major reason why intel fell behind AMD in performance. AMD switched to EUV 2-3 years ago and as a result their chips have been superior to Intel.  Intel has been stuck at the technological wall everyone knew they would hit unless something new came out.  So this isn't a buzzword thing.  ASML is legit and their market cap is over $300B thanks to this.  The question isn't whether ASML is dominating the microchip market...the question is how long it will take for anyone else to even match their EUV machines.  Until then, ASML will continue to dominate and grow because if anyone wants to build chips that are any faster than what was coming out about 2-3 years ago, they HAVE to use ASML's EUV machines.",
        "created_utc": 1629447609,
        "id": "h9n01dw",
        "score": 2,
        "subreddit": "investing",
        "created": 1629476409.0
    },
    {
        "author": "gafana",
        "body": "Thats hard to say.  It's been blowing up in value....up over 600% in the last 5 years.  However, there is a legit reason.\n\nASML spent 20 years and billions of dollars investing in this technology.  Every other major manufacturer of photolithography equipment either never tried to do EUV, thought it couldn't be done for mass market, or tried to do it but gave up after years of research and billions in R&amp;D.  ASML is the only one that stuck through it and ended up bringing an EUV device to market and are the only ones to have done so.  Literally every new microchip that is around 7nm or smaller uses ASML's EUV equipment.  Even Intel has been talking about giving in and buying ASML's gear to build their next generation chips.  It's actually a major reason why intel fell behind AMD in performance. AMD switched to EUV 2-3 years ago and as a result their chips have been superior to Intel.  Intel has been stuck at the technological wall everyone knew they would hit unless something new came out.  So this isn't a buzzword thing.  ASML is legit and their market cap is over $300B thanks to this.  The question isn't whether ASML is dominating the microchip market...the question is how long it will take for anyone else to even match their EUV machines.  Until then, ASML will continue to dominate and grow because if anyone wants to build chips that are any faster than what was coming out about 2-3 years ago, they HAVE to use ASML's EUV machines.",
        "created_utc": 1629447696,
        "id": "h9n04z1",
        "score": 2,
        "subreddit": "investing",
        "created": 1629476496.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 18th of August\n\n\n\n## Upcoming events for Wednesday, August 18th\n\n - Expected earnings:\n\n  ADI, APOP, BBWI, BLRX, CAAP, CSAN, CSCO, CTIB, DGLY, DLO, DQ, EAT, EBR, EBR.B, ELTK, GRIL, GRIN, HEPA, HOOD, IMNM, INDP, JBSS, KEYS, KLTR, LITB, LITE, LOW, MBT, METX, NCNA, NNDM, NVDA, OSIS, PLCE, PNRG, PTNR, RRGB, SFL, SINT, SMED, SNPS, SPTN, SQM, STG, TGT, TJX, TUYA, UAMY, UUU, VINP, VIPS, VNET, VSCO, WB, WLMS, YY, ZIM, ZTO\n\n - Ex-div:\n\n  ADTN, APO, AVA, BG, BWXT, CLPR, CVX, DFS, DHT, GFF, HE, HTBI, LFUS, MAC, MAV, MHI, MSFT, NLSN, NRP, PHD, PHT, RMD, SBSI, SUNS, SWCH, VCIF, WD\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.890%)\n    - Building Permits (consensus: 1.610M, previous: 1.594M)\n    - Building Permits (previous: -5.3%)\n    - Crude Oil Imports (previous: -0.796M)\n    - Crude Oil Inventories (consensus: -1.055M, previous: -0.447M)\n    - Cushing Crude Oil Inventories (previous: -0.325M)\n    - Distillate Fuel Production (previous: 0.008M)\n    - EIA Refinery Crude Runs  (previous: 0.277M)\n    - EIA Weekly Distillates Stocks (consensus: 0.276M, previous: 1.766M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.2%, previous: 0.5%)\n    - FOMC Meeting Minutes\n    - Gasoline Inventories (consensus: -1.671M, previous: -1.400M)\n    - Gasoline Production (previous: -0.190M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Housing Starts (consensus: 1.600M, previous: 1.643M)\n    - Housing Starts (previous: 6.3%)\n    - MBA 30-Year Mortgage Rate (previous: 2.99%)\n    - MBA Delinquency Rates (previous: 6.38%)\n    - MBA Mortgage Applications (previous: 2.8%)\n    - MBA Purchase Index (previous: 252.0)\n    - Mortgage Market Index (previous: 754.8)\n    - Mortgage Refinance Index (previous: 3,684.3)\n\n## Upcoming events for Thursday, August 19th\n\n - Expected earnings:\n\n  ACY, AMAT, ARCE, ATGE, AZRE, BFRA, BILI, BJ, BLND, BTBT, BVXV, BZUN, CALT, CANG, CATO, CBMB, DAO, DESP, EL, EYES, FEDU, FLGC, FRSX, FTCH, GHG, GSMG, HMG, HMLP, HOLI, HUIZ, INM, ISIG, KOSS, KSS, LFVN, LIZI, LYTS, M, MNSO, MSGS, MYSZ, NM, NNA, NTES, NUZE, OIBR.C, PALI, PAQC, PAX, PDEX, PFGC, QFIN, QIWI, RDHL, REDU, ROST, SINO, SJ, SQBG, STVN, SUPV, TPR, TUEM, VEON, WOOF, WVFC, YRD, YTRA, ZEPP, ZIVO\n\n - Ex-div:\n\n  ACP, AGD, AKO.A, AKO.B, AOD, ARDC, ASGI, AWP, BBSI, BBWI, CBFV, CCOI, CGNX, CMI, CORE, CTSH, DEX, EVRG, FDBC, FSS, FWRD, GSK, HCI, HCSG, HMPT, HNI, HSBC, HSY, IBOC, IEP, IGR, MCHP, MCO, MGPI, MGU, MIXT, MNRL, MTRN, MTX, NMRK, OBNK, OTIS, PBI, PCF, PCSB, PFC, PRI, PUK, RPRX, RTX, RXN, SBLK, SNA, SWM, TEL, THQ, THW, TKR, TTEK, UMPQ, USLM, USPH, WBA\n\n - Economic events and announcements:\n\n    - 30-Year TIPS Auction (previous: -0.040%)\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.055%)\n    - Continuing Jobless Claims (consensus: 2,800K, previous: 2,866K)\n    - Initial Jobless Claims (consensus: 363K, previous: 375K)\n    - Jobless Claims 4-Week Avg. (previous: 396.25K)\n    - Natural Gas Storage (consensus: 49B, previous: 49B)\n    - Philadelphia Fed Manufacturing Index (consensus: 23.0, previous: 21.9)\n    - Philly Fed Business Conditions (previous: 48.6)\n    - Philly Fed CAPEX Index (previous: 41.20)\n    - Philly Fed Employment (previous: 29.2)\n    - Philly Fed New Orders (previous: 17.0)\n    - Philly Fed Prices Paid (previous: 69.70)\n    - US Leading Index (consensus: 0.8%, previous: 0.7%)\n\n## Upcoming events for Friday, August 20th\n\n - Expected earnings:\n\n  AHPI, AIM, ATXI, AVCO, AZRX, BHAT, BKE, BRFS, BRID, CARV, CDZI, CIDM, CIG, CJJD, CNET, CNNB, CREG, CXDC, CYTH, DE, DSS, ENVB, FL, FRD, FSEA, FTFT, GASS, GB, GLG, GNLN, HUSA, INTG, JP, KULR, MBOT, MSN, MVST, MYMD, NXTD, OSAT, PBFS, PED, PFSW, POLA, PTIX, PVL, QLGN, RLX, RVP, SCX, SFUN, SGRP, SHG, SNFCA, TAIT, TAYD, TDAC, TKAT, TTNP, UI, UNAM, VERY, VWE, WORX\n\n - Ex-div:\n\n  AATC, AEIS, AFT, AIF, AOMR, ATO, BGH, DLX, DX, FGB, FHB, FMN, GAIN, GLAD, GOOD, GSL, HL, HVT, HVT.A, IGIC, JBT, LAND, LTC, MFD, MMM, NATH, NCMI, NLOK, OGN, R, RDN, TIPT, TSCO, UGP, UPS\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.3K)\n    - CFTC Copper speculative net positions (previous: 29.0K)\n    - CFTC Corn speculative net positions (previous: 321.6K)\n    - CFTC Crude Oil speculative net positions (previous: 400.4K)\n    - CFTC Gold speculative net positions (previous: 168.4K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -13.3K)\n    - CFTC Natural Gas speculative net positions (previous: -143.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 23.1K)\n    - CFTC Silver speculative net positions (previous: 24.5K)\n    - CFTC Soybeans speculative net positions (previous: 122.4K)\n    - CFTC Wheat speculative net positions (previous: 43.6K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 387)\n    - U.S. Baker Hughes Total Rig Count (previous: 491)\n\n^^^^2021-08-18",
        "created_utc": 1629280814,
        "id": "h9e5h7d",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1629309614.0
    },
    {
        "author": "Seekingaloha",
        "body": "I heard They don’t get paid until microchip and pay wave installed on shots 2 and 3. Shot one is their loss leader.",
        "created_utc": 1629954279,
        "id": "hae0b87",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629983079.0
    },
    {
        "author": "manalexicon",
        "body": "Constrained microchip supply and access to the limited supply available is the problem in this sector. Tough to sell software if there’s nothing to put it on.",
        "created_utc": 1628004663,
        "id": "h7k98hj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628033463.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  3rd of August\n\n\n\n## Upcoming events for Tuesday, August  3rd\n\n - Expected earnings:\n\n  ACOR, ADCT, AENZ, AFG, AHH, AIZ, AKAM, ALNY, ALTO, AME, AMGN, ANDE, ANIX, APAM, APEN, APRN, APT, APTO, AQST, AQUA, ARC, ARNC, ARVN, ATEC, ATI, ATKR, ATOM, ATVI, AVID, AVNS, AY, AYX, BABA, BEN, BGFV, BHC, BHG, BKEP, BKH, BLD, BLKB, BNFT, BNL, BP, BRY, BXC, BYFC, CAR, CDEV, CDLX, CDXC, CECE, CEIX, CERS, CFBK, CGBD, CHCT, CHSCP, CIX, CLDT, CLSK, CLX, CMI, CNR, COHR, COP, COUR, CPE, CPSI, CPSS, CRD.A, CRD.B, CRIS, CRK, CRNC, CRSR, CRVL, CSLT, CTSO, CW, CWEN, CWEN.A, CWH, CZR, DCPH, DD, DEA, DEI, DENN, DISCA, DISCB, DISCK, DK, DKL, DNB, DS, DSKE, DSX, DVA, DVN, EC, EDU, ELVT, ENLC, EPZM, ESPR, ET, ETN, ETRN, EVTC, EXPD, EZPW, FCNCA, FI, FICO, FIS, FMC, FNF, FNHC, FOE, FRG, FSP, FSTR, GBL, GBT, GDOT, GECC, GHL, GIC, GLDD, GLRE, GLT, GLTO, GMRE, GNW, GRBK, GTE, H, HEES, HEP, HLF, HLI, HLNE, HPP, HSC, HSIC, HSKA, HST, HY, HZN, IAA, ICFI, ICHR, IDN, IDRA, IGT, INCY, INFN, INGR, INN, INSP, INVE, IOSP, IPGP, IT, ITIC, IX, J, JAX, JAZZ, JBGS, KAI, KAR, KFRC, KKR, KLDO, KNSA, KOPN, KTOS, KWR, LCII, LDI, LDOS, LEU, LGIH, LHX, LIND, LLY, LPG, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, LYV, MANT, MAR, MCHP, MCRB, MCY, MDNA, MDXG, MEC, MGRC, MGY, MIC, MIME, MKL, MNOV, MNR, MNTX, MRCC, MRCY, MTCH, MTRN, MUFG, MYGN, NBIX, NCR, NCSM, NDLS, NE, NEWR, NKLA, NMIH, NNN, NPO, NPTN, NR, NRC, NSA, NVST, NVT, NVTA, OAS, OCFT, OCN, OI, OKE, OMI, OMP, ONCR, OPCH, OPTN, OSUR, OXY, PAA, PACB, PAGP, PAYC, PBI, PCRX, PEAK, PEG, PERI, PKOH, POWL, PRIM, PRO, PRU, PSA, PSB, PSX, PSXP, PTRS, PUMP, PVAC, QTS, QUAD, RCKY, RCM, RDN, RGA, RHP, RIBT, RIGL, RL, RM, RMRM, RNG, ROCK, RPAI, RRD, RVPH, RYAM, RYTM, SABR, SAGE, SATS, SEB, SEE, SHO, SKLZ, SKT, SKY, SKYT, SLRC, SND, SONY, SPT, SPWR, SQNS, SRC, SRNE, STAR, STIM, STLA, SUN, SUNS, TACT, TALO, TBPH, TCS, TDG, TISI, TNC, TRTX, TSLX, TSQ, TTEC, TX, UA, UAA, UBOH, UFPT, UNM, USAC, USCR, UTL, VAL, VECO, VERI, VNTR, VREX, VRSK, VVNT, WAT, WBT, WEC, WEYS, WHLR, WK, WLK, WLKP, WLTW, WMC, WMG, WRN, WSR, WTI, WTTR, XFOR, XHR, XP, XPER, XYL, ZBH, ZBRA\n\n - Ex-div:\n\n  ATR, BBD, BBDO, BCBP, EIG, ETRN, HFWA, MKTX, NTIC, SHEN\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.000%)\n    - API Weekly Crude Oil Stock (previous: -4.728M)\n    - Durables Excluding Defense (previous: 1.0%)\n    - FOMC Member Bowman Speaks\n    - FOMC Member Clarida Speaks\n    - Factory Orders (consensus: 1.0%, previous: 1.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 54.3)\n    - Redbook (previous: 16.0%)\n    - Total Vehicle Sales (previous: 15.40M)\n\n## Upcoming events for Wednesday, August  4th\n\n - Expected earnings:\n\n  AAU, ABC, ABIO, AC, ACA, ACAD, ACEL, ACIU, ACLS, ACR, ADMA, ADPT, ADT, ADTN, AEIS, AERI, AFIN, AGL, ALB, ALE, ALG, ALIM, ALKT, ALL, ALLO, ALNA, ALRN, ALTM, AMED, AMOT, AMPE, AMPY, AMSC, ANGI, ANSS, APA, APO, ARLO, ARTNA, ASMB, ASTE, ASYS, ATO, ATRA, ATRC, ATTO, AVA, AXGN, BBSI, BCLI, BCOR, BCSF, BCYC, BDC, BDSI, BE, BFAM, BGCP, BKNG, BKTI, BLPH, BLUE, BNGO, BOOT, BRSP, BTG, BVH, BWA, CAMT, CCMP, CCRN, CCU, CDAY, CDW, CENT, CENTA, CENX, CFMS, CHNG, CIA, CIB, CIGI, CIM, CKPT, CLH, CLVS, CLW, CMLS, CMP, CPA, CPK, CPS, CRL, CRTO, CSGS, CSII, CSTE, CSWI, CUTR, CVGI, CVRX, CVS, CYAD, DAR, DCP, DFIN, DGII, DHC, DLHC, DMTK, DNOW, DOC, DOX, DRTT, DVAX, DXC, EA, ECPG, EDIT, EDRY, EGHT, ELF, EMKR, EMR, ENBL, EOG, EOLS, EQH, EQX, ERJ, ERO, ETR, ETSY, EVH, EVOP, EVRI, EXC, EXPI, EYPT, FATE, FCPT, FDP, FENC, FLMN, FLOW, FLT, FLXN, FOX, FOXA, FPI, FRGI, FRT, FSLY, FTDR, FUN, FVE, GDDY, GEL, GEO, GGB, GHC, GLAD, GLBZ, GM, GMED, GNK, GPRK, GRP.U, GRTS, GTHX, HARP, HBB, HCC, HDSN, HFC, HHC, HI, HMC, HNGR, HR, HRTX, HUBS, HWM, HYMC, HZNP, IAC, IAG, ICD, ICUI, IIPR, IMXI, INGN, INMB, INSG, IO, IONS, ISEE, ISSC, IVC, IVR, JACK, JLL, JRVR, KBAL, KE, KHC, KIN, KLIC, KRO, KRTX, KUKE, KW, KZR, LAND, LESL, LHCG, LILA, LILAK, LL, LMND, LMRK, LNC, LPI, LUMN, MAC, MASS, MAXR, MBI, MCK, MCS, MDCA, MDU, MED, MET, MFC, MGLN, MGM, MGPI, MIDD, MLR, MLVF, MNKD, MNRL, MNTV, MOD, MPC, MPLX, MRO, MTG, MTOR, MVIS, MWA, NC, NEPH, NESR, NEWT, NEX, NHTC, NI, NL, NMFC, NMR, NODK, NP, NSPR, NSTG, NTEC, NUS, NVRO, NWPX, NXST, NYT, OCDX, ODP, OESX, ONEM, OPRX, OR, ORA, ORCC, ORIC, OSPN, OTIC, OYST, PACE, PARR, PCSA, PDCE, PETQ, PFLT, PING, PIRS, PLMR, PLTK, PLUS, PLYA, PNNT, PROF, PSN, PSNL, PTVE, PW, QNST, QRVO, QTWO, QUIK, RCII, RCKT, RCL, REGI, RESN, RGR, RKT, RMAX, RMNI, RNWK, ROKU, RPD, RPT, RTLR, RVI, RVLV, RYI, RYN, SAFT, SALM, SANA, SBGI, SBOW, SBRA, SCU, SD, SENEA, SENEB, SGRY, SITE, SITM, SJI, SLCT, SLF, SLGL, SLNG, SMFG, SMG, SMP, SMSI, SPNS, SPR, SRDX, SRI, SRPT, SSRM, SSSS, STAA, STKL, STN, SUM, SUP, SUPN, SWM, TELL, TGB, TGI, TLC, TNDM, TPC, TPVG, TRC, TREC, TRMB, TRNO, TS, TSE, TT, TTGT, TUP, TVTY, TWNK, TWO, TXG, TXMD, UBER, UE, UFCS, UFI, UGI, UHAL, UIHC, ULCC, UMH, UPLD, URG, URGN, USDP, USWS, UTHR, UVV, VCEL, VIRT, VMC, VRCA, VRDN, VTOL, VVV, VWTR, VZIO, WCN, WDC, WLFC, WLL, WTS, WU, WYNN, XNCR, XPL, YELL, ZYME\n\n - Ex-div:\n\n  AWI, CATC, CCK, DKL, FELE, IBTX, IDA, KBH, MATX, NEP, NWBI, OFED, OPBK, SIMO, STBA, TGP, VBTX, VLO, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.000%)\n    - API Weekly Crude Oil Stock (previous: -4.728M)\n    - Durables Excluding Defense (previous: 1.0%)\n    - FOMC Member Bowman Speaks\n    - FOMC Member Clarida Speaks\n    - Factory Orders (consensus: 1.0%, previous: 1.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 54.3)\n    - Redbook (previous: 16.0%)\n    - Total Vehicle Sales (previous: 15.40M)\n\n^^^^2021-08-03",
        "created_utc": 1627984814,
        "id": "h7jaqb2",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1628013614.0
    },
    {
        "author": "indigoismyfavourite",
        "body": "I guess you could compare it to when every phone manufacture had their own operating systems before the iPhone came out\n\nAlthough this is a lot more like being the Android of the car world - except that the entire car runs off and is controlled by Apple's microchip hardware and OS\n\nThe car's mechanics, batteries, motors all stay with the car companies",
        "created_utc": 1628556382,
        "id": "h8crqf8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628585182.0
    },
    {
        "author": "VariationAgreeable29",
        "body": "GM is temporary due to microchip shortage. That goes away and this stock flies.",
        "created_utc": 1629262021,
        "id": "h9djyk1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629290821.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the 19th of August\n\n\n\n## Upcoming events for Thursday, August 19th\n\n - Expected earnings:\n\n  ACY, AMAT, ARCE, ATGE, AZRE, BFRA, BILI, BJ, BLND, BTBT, BVXV, BZUN, CALT, CANG, CATO, CBMB, DAO, DESP, EL, EYES, FEDU, FLGC, FRSX, FTCH, GHG, GSMG, HMLP, HOLI, HUIZ, INM, ISIG, KOSS, KSS, LFVN, LIZI, LYTS, M, MNSO, MSGS, NM, NNA, NUZE, PALI, PAQC, PAX, PDEX, PFGC, QFIN, QIWI, RDHL, REDU, ROST, SINO, SJ, SQBG, STVN, SUPV, TPR, TUEM, VEON, WOOF, WVFC, YRD, YTRA, ZEPP, ZIVO\n\n - Ex-div:\n\n  ACP, AGD, AKO.A, AKO.B, AOD, ARDC, ASGI, AWP, BBSI, BBWI, CBFV, CCOI, CGNX, CMI, CORE, CTSH, DEX, EVRG, FDBC, FSS, FWRD, GSK, HCI, HCSG, HMPT, HNI, HSBC, HSY, IBOC, IEP, IGR, MCHP, MCO, MGPI, MGU, MIXT, MNRL, MTRN, MTX, NMRK, OBNK, OTIS, PBI, PCF, PCSB, PFC, PRI, PUK, RPRX, RTX, RXN, SBLK, SNA, SWM, TEL, THQ, THW, TKR, TTEK, UMPQ, USLM, USPH, WBA\n\n - Economic events and announcements:\n\n    - 30-Year TIPS Auction (previous: -0.040%)\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.055%)\n    - Continuing Jobless Claims (consensus: 2,800K, previous: 2,866K)\n    - Initial Jobless Claims (consensus: 363K, previous: 375K)\n    - Jobless Claims 4-Week Avg. (previous: 396.25K)\n    - MBA Delinquency Rates (previous: 6.38%)\n    - Natural Gas Storage (consensus: 31B, previous: 49B)\n    - Philadelphia Fed Manufacturing Index (consensus: 23.0, previous: 21.9)\n    - Philly Fed Business Conditions (previous: 48.6)\n    - Philly Fed CAPEX Index (previous: 41.20)\n    - Philly Fed Employment (previous: 29.2)\n    - Philly Fed New Orders (previous: 17.0)\n    - Philly Fed Prices Paid (previous: 69.70)\n    - US Leading Index (consensus: 0.8%, previous: 0.7%)\n\n## Upcoming events for Friday, August 20th\n\n - Expected earnings:\n\n  AHPI, ATXI, AVCO, AZRX, BHAT, BKE, BQ, BRID, CARV, CDZI, CIDM, CIG, CJJD, CNNB, CREG, CXDC, DE, DSS, ENVB, FL, FRD, FTFT, GASS, GB, INTG, JP, MBOT, MSN, MVST, MYMD, NXTD, PBFS, PED, PFSW, POLA, PVL, RLX, SCX, SFUN, SHG, TAIT, TAYD, TDAC, TKAT, TTNP, UI, VERY, VWE, WORX\n\n - Ex-div:\n\n  AATC, AEIS, AFT, AIF, AOMR, ATO, BGH, DLX, DX, FGB, FHB, FMN, GAIN, GLAD, GOOD, GSL, HL, HVT, HVT.A, IGIC, JBT, LAND, LTC, MFD, MMM, NATH, NCMI, NLOK, OGN, R, RDN, TIPT, TSCO, UGP, UPS\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.3K)\n    - CFTC Copper speculative net positions (previous: 29.0K)\n    - CFTC Corn speculative net positions (previous: 321.6K)\n    - CFTC Crude Oil speculative net positions (previous: 400.4K)\n    - CFTC Gold speculative net positions (previous: 168.4K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -13.3K)\n    - CFTC Natural Gas speculative net positions (previous: -143.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 23.1K)\n    - CFTC Silver speculative net positions (previous: 24.5K)\n    - CFTC Soybeans speculative net positions (previous: 122.4K)\n    - CFTC Wheat speculative net positions (previous: 43.6K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 387)\n    - U.S. Baker Hughes Total Rig Count (previous: 491)\n\n^^^^2021-08-19",
        "created_utc": 1629367211,
        "id": "h9ijw4b",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1629396011.0
    },
    {
        "author": "El_eSHO",
        "body": "Same man. Told people to load up on calls yesterday and got comments like “but the microchip shortage” and “the price hasn’t moved in years”. Calls were up 107% at some point yesterday and it’s looking good right now premarket.",
        "created_utc": 1629804100,
        "id": "ha5d4b5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629832900.0
    },
    {
        "author": "Godkun007",
        "body": "I am wondering what people think of lithium producing companies. I have then as a small part of my portfolio, but I am considering buying a little more over time. \n\nMy logic is that lithium seems to be one of the major bottlenecks in battery production, and as demand for batteries for things like electric cars, renewable energy, and general household devices increases, it will likely lead to the price of lithium rising over time. \n\nOf course, this is still a bit of a risky play as it can easily be disrupted by new technology, and the higher the price goes, the more money will be put into research for alternatives. It just seems that once the microchip shortage lessens a bit, this will quickly be the new bottleneck for production of electric cars. \n\nSo far, my stake in lithium has been profitable, which is why I am considering it. I am going to do far more research before I invest any significant amount of money here, but does anyone have any insight here?",
        "created_utc": 1630183988,
        "id": "haq5shx",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1630212788.0
    },
    {
        "author": "shad0wtig3r",
        "body": "AAPL, even more dumb lol. \n\n&gt;And also, GE is an easy short because of the microchip shortage. I shall see you at the bottom lil fella.\n\nHaha why do you think the chip shortage has a impact on GE?",
        "created_utc": 1630082360,
        "id": "hakq9sf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630111160.0
    },
    {
        "author": "mickeys_dead",
        "body": "Microchip shortage happened right before the vaccine was released 🤔",
        "created_utc": 1627834761,
        "id": "h7bswv1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627863561.0
    },
    {
        "author": "Professional-Bear543",
        "body": "seriously? it has a microchip in it that makes you a sheeple.",
        "created_utc": 1628024589,
        "id": "h7ll450",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628053389.0
    },
    {
        "author": "BossGandalf",
        "body": "btw does anyone know which broker i can use in europe to invest every month in an ETF composed of several Integrated Circuits and AI companies? I would like to invest in one of this list:\n\n* SOXX (iShares Semiconductor ETF)\n* SMH (VanEck Vectors Semiconductor ETF)\n* SOXL (Direxion Daily Semiconductor Bull 3x Shares)\n* PSI (Invesco Dynamic Semiconductors ETF)\n* USD (ProShares Ultra Semiconductors)\n\nyou can consult the reports/data of these various ETFs [here](https://etfdb.com/etfs/industry/semiconductors/).\n\nI really believe that in the long run it will give me a lot of profits, ie integrated circuits, cpus, gpus, sensors and hardware accelerators are our past, present and will be our future !! These ETFs have shares of AMD, Nvidia, Xilinx, NXP, Microchip, Texas Instruments, Maxim Integrated, ASML, TSMC, qorvo, STMicroeletronics...",
        "created_utc": 1628889342,
        "id": "h8u0bno",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1628918142.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 17th of August\n\n\n\n## Upcoming events for Tuesday, August 17th\n\n - Stock splits:\n\n    - LEMLF @ **1:10**\n    - MNNFF @ **1:5**\n    - PTSI @ **2:1** (Payable date: 08/16/2021)\n\n - Expected earnings:\n\n  A, ACXP, AENZ, AFMD, AIT, ALC, AMCR, ARKR, AUVI, BBIG, BBL, BDL, BEST, BON, BTCM, BYFC, CDK, CHSCP, CMCM, COGT, CREE, CRESY, CRMT, CVM, CWCO, DNUT, ECC, FLNG, FORTY, GDS, GNPX, GOGL, GRCL, GRUB, HCDI, HD, HUYA, INST, JAX, JKHY, LX, LZB, MNDY, NETI, NOAH, NRBO, NVIV, OB, ONE, OZON, PINC, PRAX, QUIK, REE, RERE, RHE, RVPH, SE, SRNE, STNE, SVFD, THCA, TIGR, VTEX, WHLR, WMT\n\n - Ex-div:\n\n  ADM, ADX, AFL, AGO, AMAL, AMOT, BKH, CRD.A, CRD.B, CSL, CXE, CXH, DMB, ED, EQIX, ESXB, FDP, FMBH, FOF, GGB, HRZN, ICL, JACK, L, LDP, MCR, MIN, MMT, MPC, MRO, ORA, PBR, PBR.A, PCAR, PEO, PFLT, PHI, POWL, PSF, PSX, PTA, RNP, RQI, SEM, SGC, SHYF, SSSS, SXC, TGT, UTF, VMC\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -0.816M)\n    - Business Inventories (consensus: 0.8%, previous: 0.5%)\n    - Capacity Utilization Rate (consensus: 75.7%, previous: 75.4%)\n    - Core Retail Sales (consensus: 0.1%, previous: 1.3%)\n    - FOMC Member Kashkari Speaks\n    - Fed Chair Powell Speaks\n    - Industrial Production (consensus: 0.5%, previous: 0.4%)\n    - Industrial Production (previous: 9.80%)\n    - MBA Delinquency Rates (previous: 6.38%)\n    - Manufacturing Production (consensus: 0.6%, previous: -0.1%)\n    - NAHB Housing Market Index (consensus: 80, previous: 80)\n    - Redbook (previous: 16.2%)\n    - Retail Control (consensus: -0.1%, previous: 1.1%)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Retail Sales (consensus: -0.3%, previous: 0.6%)\n    - Retail Sales (previous: 17.98%)\n    - Retail Sales Ex Gas/Autos (previous: 1.1%)\n\n## Upcoming events for Wednesday, August 18th\n\n - Expected earnings:\n\n  ADI, AIHS, APOP, BBQ, BBWI, BLRX, CAAP, CSAN, CSCO, CTIB, DLO, DQ, EAT, EBR, EBR.B, ELTK, GHSI, GRIL, GRIN, HEPA, HGSH, HOOD, IMNM, INDP, JBSS, KEYS, KLTR, LITB, LITE, LOW, MBT, METX, NAOV, NCNA, NNDM, NVDA, OSIS, PLCE, PNRG, PTNR, RRGB, SFL, SINT, SMED, SNPS, SONM, SPTN, SQM, STG, TGT, TJX, TUYA, UAMY, UUU, VINP, VIPS, VNET, VSCO, WB, WLMS, YY, ZIM, ZTO\n\n - Ex-div:\n\n  ADTN, APO, AVA, BG, BWXT, CLPR, CVX, DFS, DHT, GFF, HE, HTBI, LFUS, MAC, MAV, MHI, MSFT, NLSN, NRP, PHD, PHT, RMD, SBSI, SUNS, SWCH, VCIF, WD\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.890%)\n    - Building Permits (consensus: 1.610M, previous: 1.594M)\n    - Building Permits (previous: -5.3%)\n    - Crude Oil Imports (previous: -0.796M)\n    - Crude Oil Inventories (consensus: -1.259M, previous: -0.447M)\n    - Cushing Crude Oil Inventories (previous: -0.325M)\n    - Distillate Fuel Production (previous: 0.008M)\n    - EIA Refinery Crude Runs  (previous: 0.277M)\n    - EIA Weekly Distillates Stocks (consensus: -0.217M, previous: 1.766M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.2%, previous: 0.5%)\n    - FOMC Meeting Minutes\n    - Gasoline Inventories (consensus: -1.800M, previous: -1.400M)\n    - Gasoline Production (previous: -0.190M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Housing Starts (consensus: 1.602M, previous: 1.643M)\n    - Housing Starts (previous: 6.3%)\n    - MBA 30-Year Mortgage Rate (previous: 2.99%)\n    - MBA Mortgage Applications (previous: 2.8%)\n    - MBA Purchase Index (previous: 252.0)\n    - Mortgage Market Index (previous: 754.8)\n    - Mortgage Refinance Index (previous: 3,684.3)\n\n## Upcoming events for Thursday, August 19th\n\n - Expected earnings:\n\n  AG, AMAT, ARCE, ATGE, BFRA, BILI, BJ, BLND, BTBT, BVXV, BZUN, CATO, COCP, DESP, EL, ELOX, ENTX, EPIX, FEDU, FLGC, FRSX, FTCH, GSMG, HMLP, HUIZ, ISIG, KOSS, KSS, LFVN, LORL, LVTX, LYTS, M, MNSO, MSGS, NM, NNA, NUZE, PAQC, PAX, PDEX, PFGC, QFIN, QIWI, ROST, SJ, SLDB, STVN, SUPV, TPR, TUEM, VEON, VQS, WOOF, WVFC, YRD, YTRA, ZEPP\n\n - Ex-div:\n\n  ACP, AGD, AKO.A, AKO.B, AOD, ARDC, ASGI, AWP, BBSI, BBWI, CBFV, CCOI, CGNX, CMI, CORE, CTSH, DEX, EVRG, FDBC, FSS, FWRD, GSK, HCI, HCSG, HMPT, HNI, HSBC, HSY, IBOC, IEP, IGR, MCHP, MCO, MGPI, MGU, MIXT, MNRL, MTRN, MTX, NMRK, OBNK, OTIS, PBI, PCF, PCSB, PFC, PRI, PUK, RPRX, RTX, RXN, SBLK, SNA, SWM, TEL, THQ, THW, TKR, TTEK, UMPQ, USLM, USPH, WBA\n\n - Economic events and announcements:\n\n    - 30-Year TIPS Auction (previous: -0.040%)\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.055%)\n    - Continuing Jobless Claims (consensus: 2,800K, previous: 2,866K)\n    - Initial Jobless Claims (consensus: 363K, previous: 375K)\n    - Jobless Claims 4-Week Avg. (previous: 396.25K)\n    - Natural Gas Storage (consensus: 49B, previous: 49B)\n    - Philadelphia Fed Manufacturing Index (consensus: 23.0, previous: 21.9)\n    - Philly Fed Business Conditions (previous: 48.6)\n    - Philly Fed CAPEX Index (previous: 41.20)\n    - Philly Fed Employment (previous: 29.2)\n    - Philly Fed New Orders (previous: 17.0)\n    - Philly Fed Prices Paid (previous: 69.70)\n    - US Leading Index (consensus: 0.8%, previous: 0.7%)\n\n## Upcoming events for Friday, August 20th\n\n - Expected earnings:\n\n  AVCO, BKE, BRID, BTX, CDZI, CNNB, DE, ENSC, FL, GASS, GB, GNLN, INTG, JP, KULR, LMFA, MVST, PFSW, PVL, RLX, SCX, SHG, TAYD, TDAC, TKAT, UI\n\n - Ex-div:\n\n  AATC, AEIS, AFT, AIF, AOMR, ATO, BGH, DLX, FGB, FHB, FMN, GAIN, GLAD, GOOD, GSL, HL, HVT, HVT.A, IGIC, JBT, LAND, LTC, MFD, NATH, NCMI, NLOK, OGN, R, RDN, TIPT, TSCO, UGP, UPS\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.3K)\n    - CFTC Copper speculative net positions (previous: 29.0K)\n    - CFTC Corn speculative net positions (previous: 321.6K)\n    - CFTC Crude Oil speculative net positions (previous: 400.4K)\n    - CFTC Gold speculative net positions (previous: 168.4K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -13.3K)\n    - CFTC Natural Gas speculative net positions (previous: -143.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 23.1K)\n    - CFTC Silver speculative net positions (previous: 24.5K)\n    - CFTC Soybeans speculative net positions (previous: 122.4K)\n    - CFTC Wheat speculative net positions (previous: 43.6K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 387)\n    - U.S. Baker Hughes Total Rig Count (previous: 491)\n\n^^^^2021-08-17",
        "created_utc": 1629194413,
        "id": "h99s9at",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1629223213.0
    },
    {
        "author": "ThePonderosaPress",
        "body": "Lmao Ford has been trading sideways for decades.  With the microchip shortage, an incredibly slow purposed rollout for the Lightning, and I very real risk of a market correction I'd stay far away from Ford leaps.",
        "created_utc": 1629965917,
        "id": "haefn6r",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1629994717.0
    },
    {
        "author": "proud_lasagna_eater",
        "body": "Short MCHP?",
        "created_utc": 1629943048,
        "id": "hadf6to",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629971848.0
    },
    {
        "author": "Ok-Initial-6047",
        "body": "Any thoughts on MCHP (Microchip Technology) in this space?\n\n&amp;#x200B;\n\nSome analysts have this as a $200 stock and it is trading around $160 right now.  I have NVDA since January and am up 54% already.\n\n&amp;#x200B;\n\nMCHP Profile:\n\nMicrochip Technology, Inc. engages in the provision of semiconductor products. It operates through the Semiconductor Products and Technology Licensing segments. The Semiconductor Products segment involves in the designing, developing, manufacturing, and marketing microcontrollers, development tools and analog, interface, mixed signal, connectivity devices, and timing products. The Technology Licensing segment offers license fees and royalties associated with technology licenses for the use of SuperFlash embedded flash and Smartbits one time programmable technologies. The company was founded on February 14, 1989 and is headquartered in Chandler, AZ.",
        "created_utc": 1630080736,
        "id": "hakm63h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630109536.0
    },
    {
        "author": "Ok-Initial-6047",
        "body": "According to Yahoo their EBITDA is increasing each quarter.\n\n[https://finance.yahoo.com/quote/MCHP/financials?p=MCHP](https://finance.yahoo.com/quote/MCHP/financials?p=MCHP)",
        "created_utc": 1628128818,
        "id": "h7r6li1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628157618.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  2nd of August\n\n\n\n## Upcoming events for Monday, August  2nd\n\n - Stock splits:\n\n    - GE @ **1:8**\n\n - Expected earnings:\n\n  ACHC, ADUS, AIV, ALX, AMRC, ANET, APPF, ARAV, ARCB, ARGO, ASLN, AWK, AWR, BCC, BRKR, BRX, BSBK, BSM, BVN, BWXT, CINR, CLAR, CLNN, CLR, CNA, COLM, CORR, CRNT, CSR, CSWC, CVI, CX, DAC, DBVT, DSPG, DZSI, EARN, EML, EMN, EVER, FANG, FNCB, FREY, FRPT, GAIA, GAIN, GOOD, GPN, GPP, GPRE, GSMG, HAYW, HLIT, HMN, HSBC, IMUX, IPI, ITUB, IVAC, JELD, KDNY, KMT, KNBE, KRG, L, LEG, LU, LUB, METC, MFIN, MG, MOS, NERV, NETI, NPK, NSP, NXPI, O, OGS, OHI, ON, OTTR, PBHC, PEBK, PLOW, PXD, RACE, RADA, RARE, REKR, REYN, RGCO, RIG, RMBL, RMBS, SANM, SBAC, SBT, SCM, SEDG, SFST, SGU, SIBN, SPG, SPNE, STRL, SYKE, TA, TCMD, TCPC, TGTX, TKR, TREX, TSEM, TTI, TTWO, UAN, UCTT, UIS, UNVR, USAU, UTI, VMD, VNO, VNOM, VRNS, VTVT, WILC, WMB, WMK, WWD, XTNT, ZI\n\n - Ex-div:\n\n  BANR, CAG, CAPL, CBAN, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, IGD, ITUB, LMRK, SAFM, SHLX, SPH, SRCE, SRLP, WBS, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.050%)\n    - 6-Month Bill Auction (previous: 0.050%)\n    - Construction Spending (consensus: 0.4%, previous: -0.3%)\n    - ISM Manufacturing Employment (previous: 49.9)\n    - ISM Manufacturing New Orders Index (previous: 66.0)\n    - ISM Manufacturing PMI (consensus: 60.9, previous: 60.6)\n    - ISM Manufacturing Prices (previous: 92.1)\n    - Investing.com Gold Index (actual: 58.5%, previous: 58.2%)\n    - Investing.com S&amp;P 500 Index (actual: 47.3%, previous: 42.2%)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 63.1, previous: 62.1)\n    - Total Vehicle Sales (previous: 15.40M)\n\n## Upcoming events for Tuesday, August  3rd\n\n - Expected earnings:\n\n  ACOR, ADCT, AENZ, AFG, AHH, AIZ, AJX, AKAM, ALNY, ALTO, AME, AMGN, ANDE, ANIX, APAM, APEN, APRN, APT, APTO, AQST, AQUA, ARC, ARNC, ARVN, ATEC, ATI, ATKR, ATOM, ATVI, AVID, AVNS, AY, AYX, BABA, BEN, BGFV, BHC, BHG, BKEP, BKH, BLD, BLKB, BNFT, BNL, BP, BRY, BXC, BYFC, CAR, CDEV, CDLX, CDXC, CECE, CEIX, CERS, CFBK, CGBD, CHCT, CHSCP, CIX, CLDT, CLSK, CLX, CMI, CNR, COHR, COP, COUR, CPE, CPSI, CPSS, CRD.A, CRD.B, CRIS, CRK, CRNC, CRSR, CRVL, CSLT, CTSO, CW, CWEN, CWEN.A, CWH, CZR, DCPH, DD, DEA, DEI, DENN, DISCA, DISCB, DISCK, DK, DKL, DNB, DS, DSKE, DSX, DVA, DVN, E, EC, EDU, ELVT, ENIA, ENLC, EPZM, ESPR, ET, ETN, ETRN, EVC, EVTC, EXPD, EZPW, FCNCA, FI, FICO, FIS, FMC, FNF, FNHC, FOE, FRG, FSP, FSTR, GBL, GBT, GDOT, GHL, GIC, GLDD, GLRE, GLT, GLTO, GMRE, GNW, GRBK, GTE, H, HEES, HEP, HLF, HLI, HLNE, HPP, HSC, HSIC, HSKA, HST, HY, HZN, IAA, ICFI, ICHR, IDN, IDRA, IGT, INCY, INFN, INGR, INN, INSP, INVE, IOSP, IPGP, IT, ITIC, IX, J, JAX, JAZZ, JBGS, KAI, KAR, KFRC, KKR, KLDO, KNSA, KOPN, KTOS, KWR, LCII, LDI, LDOS, LEU, LGIH, LHX, LIND, LLY, LPG, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, LYV, MANT, MAR, MCHP, MCRB, MCY, MDNA, MDXG, MEC, MGRC, MGY, MIC, MIME, MKL, MNOV, MNR, MNST, MNTX, MRCC, MRCY, MTCH, MTRN, MUFG, MYGN, NBIX, NCR, NCSM, NDLS, NE, NEWR, NKLA, NMIH, NNN, NPO, NPTN, NR, NRC, NSA, NVST, NVT, NVTA, OAS, OCFT, OCN, OI, OKE, OMI, OMP, ONCR, OPCH, OPTN, OSUR, OXY, PAA, PACB, PAGP, PAYC, PBI, PCRX, PEAK, PEG, PERI, PKOH, POWL, PRIM, PRO, PRU, PSA, PSB, PSX, PSXP, PTRS, PUMP, PVAC, QTS, QUAD, RCKY, RCM, RDN, RGA, RHP, RIBT, RIGL, RL, RM, RMRM, RNG, ROCK, RPAI, RRD, RVPH, RYAM, RYTM, SABR, SAGE, SEB, SEE, SHO, SKLZ, SKT, SKY, SKYT, SLRC, SND, SONY, SPT, SPWR, SQNS, SRC, SRNE, STAR, STIM, STLA, SUN, SUNS, SWI, TACT, TALO, TBPH, TCS, TDG, TISI, TNC, TRTX, TSLX, TSQ, TTEC, TX, UA, UAA, UBOH, UFPT, UNM, USAC, USCR, UTL, VAL, VECO, VERI, VNTR, VREX, VRSK, VVNT, WAT, WBT, WEC, WEYS, WHLR, WK, WLK, WLKP, WLTW, WMC, WMG, WRN, WSR, WTI, WTTR, WYNN, XFOR, XHR, XP, XPER, XYL, ZBH, ZBRA\n\n - Ex-div:\n\n  ATR, BBD, BBDO, BCBP, EIG, ETRN, HFWA, MKTX, NTIC, SHEN\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.000%)\n    - API Weekly Crude Oil Stock (previous: -4.728M)\n    - Durables Excluding Defense (previous: 1.0%)\n    - FOMC Member Bowman Speaks\n    - Factory Orders (consensus: 1.0%, previous: 1.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 54.3)\n    - Redbook (previous: 16.0%)\n\n## Upcoming events for Wednesday, August  4th\n\n - Expected earnings:\n\n  AAU, ABC, ABIO, AC, ACA, ACAD, ACEL, ACIU, ACLS, ACR, ADMA, ADPT, ADT, ADTN, AEIS, AERI, AFIN, AGL, ALB, ALE, ALG, ALIM, ALKT, ALL, ALLO, ALNA, ALRN, ALTM, AMED, AMOT, AMPE, AMPY, AMSC, ANGI, ANSS, ANVS, APA, APO, ARLO, ARNA, ARTNA, ASMB, ASTE, ASYS, ATO, ATRA, ATRC, ATTO, AVA, AXGN, BBSI, BCLI, BCOR, BCSF, BCYC, BDC, BDSI, BE, BFAM, BFIN, BGCP, BKNG, BKTI, BLPH, BLUE, BNGO, BOOT, BRSP, BTG, BWA, CAMT, CCMP, CCRN, CCU, CDAY, CDW, CENT, CENTA, CENX, CFMS, CHNG, CIA, CIB, CIGI, CIM, CKPT, CLH, CLLS, CLVS, CLW, CMLS, CMP, CPA, CPK, CPS, CRL, CRTO, CSGS, CSII, CSTE, CSWI, CUTR, CVGI, CVRX, CVS, CYAD, DAR, DCP, DFIN, DGII, DHC, DLHC, DMTK, DNOW, DOC, DOX, DRTT, DVAX, DXC, EA, ECPG, EDIT, EDRY, EGHT, ELF, EMKR, EMR, ENBL, EOG, EOLS, EQH, EQX, ERJ, ERO, ETR, ETSY, EVH, EVOP, EVRI, EXC, EXPI, EYPT, FATE, FCPT, FDP, FENC, FLMN, FLOW, FLT, FLXN, FOX, FOXA, FRGI, FRPH, FRT, FSLY, FTDR, FUN, FVE, GDDY, GEL, GGB, GHC, GLAD, GLBZ, GM, GMED, GNK, GPRK, GRP.U, GRTS, GTHX, HARP, HBB, HCC, HDSN, HFC, HHC, HI, HMC, HNGR, HR, HRTX, HUBS, HWM, HYMC, HZNP, IAC, IAG, ICD, ICUI, IIPR, IMXI, INGN, INMB, INSG, IO, IONS, ISEE, ISSC, IVC, IVR, JACK, JLL, JRVR, KBAL, KE, KHC, KIN, KLIC, KRO, KRTX, KUKE, KW, KZR, LAND, LESL, LEVL, LHCG, LILA, LILAK, LL, LMND, LMRK, LNC, LPI, LUMN, MAC, MASS, MAXR, MBI, MCK, MCS, MDCA, MDU, MED, MET, MFC, MGLN, MGM, MGPI, MIDD, MLR, MLVF, MNKD, MNRL, MNTV, MOD, MPC, MPLX, MRO, MTG, MTOR, MVIS, MWA, NC, NEPH, NESR, NEWT, NEX, NHTC, NI, NL, NMFC, NMR, NODK, NP, NSPR, NSTG, NTEC, NUS, NVRO, NWPX, NXST, NYT, OCDX, ODP, OESX, ONEM, OPRX, OR, ORA, ORCC, ORIC, OSPN, OTIC, OYST, PACE, PARR, PCSA, PDCE, PETQ, PFIE, PFLT, PING, PIRS, PLMR, PLTK, PLUS, PLYA, PNNT, PROF, PSN, PSNL, PTVE, PW, QNST, QRVO, QTWO, QUIK, RCII, RCKT, RCL, REGI, RESN, RGR, RKT, RMAX, RMNI, RNWK, ROKU, RPD, RPT, RTLR, RVI, RVLV, RYI, RYN, SAFT, SALM, SANA, SBGI, SBOW, SBRA, SCU, SD, SENEA, SENEB, SGMO, SGRY, SITE, SITM, SJI, SLCT, SLF, SLGL, SLNG, SMFG, SMG, SMP, SMSI, SPNS, SPR, SRDX, SRI, SRPT, SSRM, SSSS, STAA, STKL, STN, SUM, SUP, SUPN, SWM, TELL, TGB, TGI, TIPT, TLC, TNDM, TPC, TPVG, TRC, TREC, TRMB, TRNO, TS, TSE, TT, TTGT, TUP, TVTY, TWNK, TWO, TXG, TXMD, UBER, UE, UFCS, UFI, UGI, UHAL, UIHC, ULCC, UMH, UPLD, URG, URGN, USDP, USWS, UTHR, UVV, VCEL, VGR, VIRT, VMC, VRCA, VRDN, VTOL, VVV, VWTR, VZIO, WCN, WDC, WLFC, WLL, WTS, WU, XNCR, XPL, YELL, ZYME\n\n - Ex-div:\n\n  AWI, CATC, CCK, DKL, FELE, IBTX, IDA, KBH, MATX, NEP, NWBI, OFED, OPBK, SIMO, STBA, TGP, VBTX, VLO, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 700K, previous: 692K)\n    - Crude Oil Imports (previous: -0.616M)\n    - Crude Oil Inventories (previous: -4.089M)\n    - Cushing Crude Oil Inventories (previous: -1.268M)\n    - Distillate Fuel Production (previous: -0.163M)\n    - EIA Refinery Crude Runs  (previous: -0.132M)\n    - EIA Weekly Distillates Stocks (consensus: -0.435M, previous: -3.088M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.4%, previous: -0.3%)\n    - FOMC Member Clarida Speaks\n    - Gasoline Inventories (consensus: -0.916M, previous: -2.253M)\n    - Gasoline Production (previous: 0.649M)\n    - Heating Oil Stockpiles (previous: 0.108M)\n    - ISM Non-Manufacturing Business Activity (previous: 60.4)\n    - ISM Non-Manufacturing Employment (previous: 49.3)\n    - ISM Non-Manufacturing New Orders (previous: 62.1)\n    - ISM Non-Manufacturing PMI (consensus: 60.4, previous: 60.1)\n    - ISM Non-Manufacturing Prices (previous: 79.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.01%)\n    - MBA Mortgage Applications (previous: 5.7%)\n    - MBA Purchase Index (previous: 251.7)\n    - Markit Composite PMI (previous: 59.7)\n    - Mortgage Market Index (previous: 737.9)\n    - Mortgage Market Index (previous: 737.9)\n    - Mortgage Refinance Index (previous: 3,570.4)\n    - Services PMI (previous: 59.8)\n\n^^^^2021-08-02",
        "created_utc": 1627898416,
        "id": "h7evcd0",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1627927216.0
    },
    {
        "author": "Traditional-Cattle62",
        "body": "What color microchip was in the shot?",
        "created_utc": 1628183403,
        "id": "h7tvisu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628212203.0
    },
    {
        "author": "dupont2021",
        "body": "Long term guy here.\n\nWhat do you think? I believe some need to be freed up as there isn't much movement.\n\nBABA\n\nGM\n\nVFC\n\nKTB\n\nMRO\n\n\\------------------------------------------\n\nPIOE\n\nMCHP\n\nQQQ\n\n\\-------------------------------------------\n\nFLEX\n\nBCOR\n\nORCL",
        "created_utc": 1628271231,
        "id": "h7yjfyn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628300031.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 16th of August\n\n\n\n## Upcoming events for Monday, August 16th\n\n - Stock splits:\n\n    - URVNF @ **1:10**\n\n - Expected earnings:\n\n  ACRX, ACTG, ADMP, AESE, AIV, AKU, ALAC, AREC, ARKR, ATAI, ATCX, AYTU, BHP, BIOC, BITF, BKYI, BLDE, BLIN, BPT, BRCN, CBAT, CBLI, CHCI, CIH, CLSK, CNSP, COMS, CREX, CRKN, CRT, CRTD, CTEK, CTK, CVV, CYRN, DLPN, DNMR, DOYU, DPW, DRIO, DTST, EDR, ELYS, ETON, EVLV, FBIO, FBRX, FENG, FN, FTRP, FUV, GALT, GAN, GBRG, GERN, GLBE, GNOG, GOEV, GVP, GWGH, HHR, HIPO, IDEX, IKT, IMMR, IMPL, INPX, INVO, ISUN, JAN, JOB, JOBS, KBNT, KNTE, LIQT, LIVE, LMNL, LOV, LRFC, LUB, MBII, MBIO, MICT, MINM, MITC, MLSS, MMAT, MNTK, MVO, NAT, NES, NIU, NKSH, NMRD, NRXP, NVGS, NYMX, OBCI, OEG, OMEX, ONDS, OSMT, OTLY, OVID, OXBR, PBT, PHGE, PLAG, PLX, PME, POWW, PRCH, PSFE, PTPI, PYR, QRHC, QSI, RAIL, RBLX, REKR, RIOT, RKDA, RMED, RMO, RMTI, SACH, SBS, SCOB, SCYX, SGBX, SJT, SLHG, SMFR, SMTI, SNAX, SRAX, SSKN, SSL, STAF, STRS, SUMR, SUNL, SVVC, SWKH, TBLT, TENX, TLGT, TLK, TLS, TME, TOMZ, TSHA, TSRI, UAVS, UCL, USAS, UWMC, VBLT, VEI, VERB, VET, VISL, VOC, VYNT, WF, WILC, WYY, XSPA, YOU, ZEV, ZH\n\n - Ex-div:\n\n  AMGN, APAM, CORR, DYFN, ETH, FINS, GDV, GNK, GNT, GPRK, GUT, GWRS, HNNA, HP, ITUB, IVH, JRSH, LNN, MCFE, NHTC, NVO, OPP, OXLC, OXSQ, PACW, PGZ, PTMN, REYN, RFM, RFMZ, RGA, RIV, RMAX, RMI, RMM, RSF, SBRA, SCU, SMM, SOR, SPOK, SWKS, XFLT\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.050%)\n    - 6-Month Bill Auction (previous: 0.050%)\n    - Investing.com Gold Index (actual: 51.2%, previous: 59.4%)\n    - Investing.com S&amp;P 500 Index (actual: 43.3%, previous: 46.6%)\n    - NY Empire State Manufacturing Index (consensus: 29.00, previous: 43.00)\n    - Overall Net Capital Flow (previous: 105.30B)\n    - TIC Net Long-Term Transactions (previous: -30.2B)\n    - TIC Net Long-Term Transactions including Swaps (previous: -63.60B)\n    - US Foreign Buying, T-bonds (previous: -93.40B)\n\n## Upcoming events for Tuesday, August 17th\n\n - Stock splits:\n\n    - PTSI @ **2:1** (Payable date: 08/16/2021)\n\n - Expected earnings:\n\n  A, ACXP, AENZ, AFMD, AIT, ALC, AMCR, AUVI, BBIG, BBL, BDL, BEST, BON, BTCM, BYFC, CDK, CHSCP, CMCM, COGT, CREE, CRESY, CRMT, CVM, CWCO, DNUT, ECC, FLNG, FORTY, FURY, GDS, GNPX, GOGL, GRCL, GRUB, HCDI, HD, HUYA, INST, JAX, JKHY, LX, LZB, MNDY, NETI, NOAH, NRBO, NVIV, OB, ONE, OZON, PINC, PRAX, QUIK, REE, RERE, RHE, RVPH, SA, SE, SFL, SOLY, SRNE, STNE, SVFD, THCA, TIGR, VTEX, WHLR, WMT\n\n - Ex-div:\n\n  ADM, ADX, AFL, AGO, AMAL, AMOT, BKH, CRD.A, CRD.B, CSL, CXE, CXH, DMB, ED, EQIX, ESXB, FDP, FMBH, FOF, GGB, HRZN, ICL, JACK, L, LDP, MCR, MIN, MMT, MPC, MRO, ORA, PBR, PBR.A, PCAR, PEO, PFLT, PHI, POWL, PSF, PSX, PTA, RNP, RQI, SEM, SGC, SHYF, SSSS, SXC, TGT, UTF, VMC\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -0.816M)\n    - Business Inventories (consensus: 0.8%, previous: 0.5%)\n    - Capacity Utilization Rate (consensus: 75.7%, previous: 75.4%)\n    - Core Retail Sales (consensus: 0.2%, previous: 1.3%)\n    - Fed Chair Powell Speaks\n    - Industrial Production (consensus: 0.5%, previous: 0.4%)\n    - Industrial Production (previous: 9.80%)\n    - MBA Delinquency Rates (previous: 6.38%)\n    - Manufacturing Production (consensus: 0.6%, previous: -0.1%)\n    - NAHB Housing Market Index (consensus: 80, previous: 80)\n    - Redbook (previous: 16.2%)\n    - Retail Control (consensus: 0.1%, previous: 1.1%)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Retail Sales (consensus: -0.2%, previous: 0.6%)\n    - Retail Sales (previous: 17.98%)\n    - Retail Sales Ex Gas/Autos (previous: 1.1%)\n\n## Upcoming events for Wednesday, August 18th\n\n - Expected earnings:\n\n  ADI, AIHS, APOP, BBQ, BBWI, BLRX, CAAP, CSAN, CSCO, CTIB, DLO, DQ, EAT, EBR, EBR.B, ELTK, GHSI, GRIL, GRIN, HEPA, HGSH, HOOD, IMNM, INDP, JBSS, KEYS, KLTR, LITB, LITE, LOW, MBT, METX, NAOV, NCNA, NNDM, NVDA, OSIS, PLCE, PNRG, PTNR, RRGB, SFL, SINT, SMED, SNPS, SONM, SPTN, SQM, STG, TGT, TJX, TUYA, UAMY, UUU, VINP, VIPS, VNET, VSCO, WB, WLMS, YY, ZIM, ZTO\n\n - Ex-div:\n\n  ADTN, APO, AVA, BG, BWXT, CLPR, CVX, DFS, DHT, GFF, HE, HTBI, LFUS, MAC, MAV, MHI, MSFT, NLSN, NRP, PHD, PHT, RMD, SBSI, SUNS, SWCH, VCIF, WD\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.890%)\n    - Building Permits (consensus: 1.610M, previous: 1.594M)\n    - Building Permits (previous: -5.3%)\n    - Crude Oil Imports (previous: -0.796M)\n    - Crude Oil Inventories (previous: -0.447M)\n    - Cushing Crude Oil Inventories (previous: -0.325M)\n    - Distillate Fuel Production (previous: 0.008M)\n    - EIA Refinery Crude Runs  (previous: 0.277M)\n    - EIA Weekly Distillates Stocks (previous: 1.766M)\n    - EIA Weekly Refinery Utilization Rates (previous: 0.5%)\n    - FOMC Meeting Minutes\n    - Gasoline Inventories (previous: -1.400M)\n    - Gasoline Production (previous: -0.190M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Housing Starts (consensus: 1.602M, previous: 1.643M)\n    - Housing Starts (previous: 6.3%)\n    - MBA 30-Year Mortgage Rate (previous: 2.99%)\n    - MBA Mortgage Applications (previous: 2.8%)\n    - MBA Purchase Index (previous: 252.0)\n    - Mortgage Market Index (previous: 754.8)\n    - Mortgage Refinance Index (previous: 3,684.3)\n\n## Upcoming events for Thursday, August 19th\n\n - Expected earnings:\n\n  AG, AMAT, ARCE, ARDX, ATGE, BFRA, BILI, BJ, BLND, BLRX, BTBT, BVXV, BZUN, CATO, COCP, DESP, EL, ELOX, ENTX, EPIX, FEDU, FLGC, FRSX, FTCH, GSMG, HMLP, HUIZ, ISIG, KOSS, KSS, LFVN, LORL, LVTX, LYTS, M, MNSO, MSGS, NM, NNA, NUZE, PAQC, PAX, PDEX, PFGC, QFIN, QIWI, ROST, SJ, SLDB, SPRT, STVN, SUPV, TPR, TUEM, VEON, VQS, WOOF, WVFC, YRD, ZEPP\n\n - Ex-div:\n\n  ACP, AGD, AKO.A, AKO.B, AOD, ARDC, ASGI, AWP, BBSI, BBWI, CBFV, CCOI, CGNX, CMI, CORE, CTSH, DEX, EVRG, FDBC, FSS, FWRD, GSK, HCI, HCSG, HMPT, HNI, HSBC, HSY, IBOC, IEP, IGR, MCHP, MCO, MGPI, MGU, MIXT, MNRL, MTRN, MTX, NMRK, OBNK, OTIS, PBI, PCF, PCSB, PFC, PRI, PUK, RPRX, RTX, RXN, SBLK, SNA, SWM, TEL, THQ, THW, TKR, TTEK, UMPQ, USLM, USPH, WBA\n\n - Economic events and announcements:\n\n    - 30-Year TIPS Auction (previous: -0.040%)\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.055%)\n    - Continuing Jobless Claims (consensus: 2,800K, previous: 2,866K)\n    - Initial Jobless Claims (consensus: 360K, previous: 375K)\n    - Jobless Claims 4-Week Avg. (previous: 396.25K)\n    - Natural Gas Storage (consensus: 49B, previous: 49B)\n    - Philadelphia Fed Manufacturing Index (consensus: 25.0, previous: 21.9)\n    - Philly Fed Business Conditions (previous: 48.6)\n    - Philly Fed CAPEX Index (previous: 41.20)\n    - Philly Fed Employment (previous: 29.2)\n    - Philly Fed New Orders (previous: 17.0)\n    - Philly Fed Prices Paid (previous: 69.70)\n    - US Leading Index (consensus: 0.8%, previous: 0.7%)\n\n^^^^2021-08-16",
        "created_utc": 1629108013,
        "id": "h95092i",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1629136813.0
    },
    {
        "author": "AuctorLibri",
        "body": "Microchip manufacturers, certainly.",
        "created_utc": 1628645700,
        "id": "h8heydt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628674500.0
    },
    {
        "author": "LrdHabsburg",
        "body": "How do you envision the Fed fixing the microchip issue? I think JPow is doing fairly well with the levers at his disposal given how fast everything has been moving. Small business are extremely reliant on the low rates and favorable terms banks are lending on, it sounds like you're proposing limiting support for the credit market. That would hurt small business further",
        "created_utc": 1630087085,
        "id": "hal25dc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630115885.0
    },
    {
        "author": "NefariousnessSome142",
        "body": "I'm bullish on the semis space but don't know too much about MCHP. Why have their profit margins been consistently decreasing over the years? That seems concerning.",
        "created_utc": 1628118868,
        "id": "h7qljo8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628147668.0
    },
    {
        "author": "kuprenx",
        "body": "going to get vaccined today. Which makers microchip schould i get? Pfizer or modern? the fact that you are shareholders of this company does give you better side effect?",
        "created_utc": 1629099716,
        "id": "h94qefa",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1629128516.0
    },
    {
        "author": "-B-H-",
        "body": "I bought more TSM yesterday along with some AMAT, LRCX, SMH, SXD.  Car manufacturers are having a hard time producing cars because of a microchip shortage, the hospital I work at is slow to buy more computers for charting for the same reason.   Someone is going to make money off this supply/demand problem.  I am a very amateur investor who buys stocks that I see a societal need for what they are offering.  I admittedly don't grind out on researching company fundamentals.  It's worked out for me so far.  \n\nAGFY has been the stock that has been the most kind to me recently.   I got in pretty deep at $7.50.",
        "created_utc": 1629379795,
        "id": "h9j40ho",
        "score": 0,
        "subreddit": "stocks",
        "created": 1629408595.0
    },
    {
        "author": "deca-d",
        "body": "don't forget the dark pool money Gates pays them out of his pocket to insert his microchip - that can't be cheap.",
        "created_utc": 1628673683,
        "id": "h8ik2rk",
        "score": -3,
        "subreddit": "wallstreetbets",
        "created": 1628702483.0
    },
    {
        "author": "InspectorDabbit87",
        "body": "I'm not even saying there is a microchip but yeah, very funny\n\nI just don't want to be bothered to get something I personally won't die from\n\nDon't really care if your grandma dies, tbh",
        "created_utc": 1629730360,
        "id": "ha1ecqq",
        "score": -5,
        "subreddit": "wallstreetbets",
        "created": 1629759160.0
    },
    {
        "author": "LongComparison",
        "body": "Phew I got in at 38 and sold at 65 after it hit 80. It was really hard to do that once it hit 80. It felt like I was losing money to hit the sell button, but in reality I made a great profit and locked it in. I still have a ton to learn. It shouldn't have been that hard. If it was in the 90s right now I probably wouldn't even be having these thoughts, which is scary in itself.\n\nI guess this is why it's important to have an exit strategy and execute it? Just thinking out loud.",
        "created_utc": 1628088376,
        "id": "h7ollek",
        "score": 277,
        "subreddit": "wallstreetbets",
        "created": 1628117176.0
    },
    {
        "author": "cowboys5xsbs",
        "body": "Clov is coming back any day now it just needed to get cigarettes",
        "created_utc": 1628035090,
        "id": "h7m812m",
        "score": 223,
        "subreddit": "wallstreetbets",
        "created": 1628063890.0
    },
    {
        "author": "surfsoccerstocks",
        "body": "I made a ton of unrealized profits but never sold and now I made of ton of unrealized losses",
        "created_utc": 1628140127,
        "id": "h7rr6t8",
        "score": 125,
        "subreddit": "pennystocks",
        "created": 1628168927.0
    },
    {
        "author": "Verix19",
        "body": "I've been out of any Chinese stocks for about 6 months now, too much can happen, most of it involves you losing all or part of your investment.",
        "created_utc": 1628029569,
        "id": "h7lwdyt",
        "score": 123,
        "subreddit": "stocks",
        "created": 1628058369.0
    },
    {
        "author": "ReasonHound",
        "body": "People getting paid more to stay on unemployment. Don’t blame them. Wages aren’t keeping up with inflation. An entire generation of people are getting screwed. Also now you have record level home prices. The best thing I ever did my entire life was buy a house after the housing crash. I was able to transfer that equity into a better house and not be royally screwed by high home prices because I could sell high.",
        "created_utc": 1628083108,
        "id": "h7oa3xa",
        "score": 80,
        "subreddit": "stocks",
        "created": 1628111908.0
    },
    {
        "author": "LossStunning239",
        "body": "Imagine working for a bank on Wall St. busting your ass 100hrs/week for years building your career.\n\nAnd you have less money than some inbred troglodyte who YOLO’d some options on WSB and hit a couple hundred baggers. Now he just shitposts on WSB all day cuz he’s rich and retired and you’re still slaving away. Hard work is for chumps 🥴😳",
        "created_utc": 1628074164,
        "id": "h7nvr1t",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1628102964.0
    },
    {
        "author": "iwashwindows",
        "body": "You and me both buddy! I pulled out half of my 17k to pay off all debt except for mortgage and I put the $8500 left into something that immediately turned it to $5500🤣 sometimes you win big like I did in February and then you make crap impatient decisions and lose. But now it’s all play money so hopefully I’m patient and start to make some back to pay off the mortgage!",
        "created_utc": 1628135933,
        "id": "h7rk78x",
        "score": 54,
        "subreddit": "pennystocks",
        "created": 1628164733.0
    },
    {
        "author": "MarginCarl",
        "body": "I get from your SEC link that:\n\nRobinhood only has 81B assets under custody (AUC).  For context Schwab has 6.69 Trillion AUC.  \\~39B vs \\~127B market cap for the two companies.\n\nRobinhood had less than 1B in total net revenues in 2020, yet their market cap is now 40 B?\n\nThat valuation is totally absurd. People mock Tesla's valuation but for context Tesla had 31.5B in revenue in 2020 and it's market cap is 702B.  Robinhood's market cap is about 40x 2020 revenue while Tesla is closer to 22x 2020 revenue.\n\nThis is not investment advice.",
        "created_utc": 1628068696,
        "id": "h7npary",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1628097496.0
    },
    {
        "author": "sannitig",
        "body": "I would agree but gold seems to not be acting like it used to. It could be one of those things where currently it's acting differently, but when the stuff hits the fan people go back to their old ways and gold will skyrocket. And if you took a picture of gold right now you would expect it to be skyrocketing during the pandemic which it's not, which is why I made the statement of gold is not acting like it should",
        "created_utc": 1628083714,
        "id": "h7obc4o",
        "score": 44,
        "subreddit": "CanadianInvestor",
        "created": 1628112514.0
    },
    {
        "author": "kkB1airs",
        "body": "Biggest EV battery sleeper on the market right now. Wake the fuck up Adam, you dipshit. \n \n720 shares @ &amp;13.17",
        "created_utc": 1628138164,
        "id": "h7ro0go",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1628166964.0
    },
    {
        "author": "thelonelyteaparty",
        "body": "For me, I pumped $2000 into TSLA in 2019, right before their Annual General Meeting, knowing that they'd have some big news to share. In one year it grew about 150% and that was huge for me as a new investor, in fact I had even created a brokerage account just to buy TSLA. Might not be a penny, but right now I'm hoping to do the same with MBH Corp.",
        "created_utc": 1628130119,
        "id": "h7r995u",
        "score": 40,
        "subreddit": "pennystocks",
        "created": 1628158919.0
    },
    {
        "author": "ReasonHound",
        "body": "Who the fuck is dumb enough to buy a car right now instead of waiting a year.",
        "created_utc": 1628083385,
        "id": "h7oao6k",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1628112185.0
    },
    {
        "author": "Gardenho1",
        "body": "Thank you Stock Market and WSB!  I used to lay awake at night reading political shit so I could argue with friends and coworkers.  Now I lay awake staring at futures and reading WSB and I have no job or friends.",
        "created_utc": 1628142506,
        "id": "h7ruqk4",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1628171306.0
    },
    {
        "author": "AxlToTheMaxl",
        "body": "He now rates it a buy with a $900 PT",
        "created_utc": 1628033115,
        "id": "h7m3y2e",
        "score": 35,
        "subreddit": "SPACs",
        "created": 1628061915.0
    },
    {
        "author": "BiznezManDoBiznez",
        "body": "HAHAHAHAHAHA. **WHAT THE FUCK BRO**\n\nBut for real, take a break, save some cash, maybe YOLO it into 0DTE OTM SPY calls on a dip and you'll bounce right back. I lost $180k of gains, burning it all down to a negative margin call of $769. It sucks being this red, this deep, I know how you feel as I've been there. But use it as a point to learn what went wrong and educate yourself. That's what I did. It's the best investment you can make right now going forward. $10k is nothing in the grand scheme of things. Take care of yourself buddy, and as the legend Bill Hwang would say -Hwang in there!",
        "created_utc": 1628032220,
        "id": "h7m22a3",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1628061020.0
    },
    {
        "author": "PeterBernsteinSucks",
        "body": "AMD is a meme stock now?  What?",
        "created_utc": 1628101646,
        "id": "h7phqr4",
        "score": 33,
        "subreddit": "investing",
        "created": 1628130446.0
    },
    {
        "author": "Dyslexic_Engineer88",
        "body": "XEQT - is an exchange-traded fund (google ETF), that invests 100% equity (stocks) from all market secetors.\n\nWS SRI - is WealthSimple invest own Social Responsible Investing ETF portfolio. WealthSimple is a Robo-advisor.\n\nRESP - Registered Education Saving Plan. A federal program that basically gives you some free money tax-free growth to save for a child's education.\n\nRRSP -  (Registered Retirement Saving Plan), RRSP is federal a tax-deferred retirement saving program, pay less tax now and have more money to save and grow, it is worth it if you income will be less in retirement than it is now.\n\nSRRSP - Spousal RRSP is just an RRSP that your spouse owns but contributes to so you get the tax benefit. in retirement the money and growth are theirs.\n\nThere is a lot of arguments against RRSP but  I am basically the Ideal candidate for RRSP. my tax bracket in retirement is guaranteed to be less than half what it is now because I will be splitting it 50/50 with my wife, who has a much lower earning potential.\n\nI keep my Joint accounts the RESP and SRRP in WealthSimple invest because the WealthSimple trade doesn't support joint accounts. My wife and i both contribute to the RESP and the SRRSP has to be held in my wife's name but i need to contribute to it.\n\nI choose socially responsible (SRI) because I believe long-term they will be a better return. this is debatable and many people argue that SRI is likely to do worse long term, but I don't agree with them.\n\nI use Wealthsimple trade for my personal RRSP because it has lower fees than wealth simple invest, and gives me more flexibility for my investments. I choose XEQT because it has lower fees and offers diversification away from the SRI portfolio I have for my other investments. Similar alternatives would be VEQT for all equities,  and VGRO, XGRO, for a more conservative investor.",
        "created_utc": 1628087885,
        "id": "h7okgkx",
        "score": 32,
        "subreddit": "CanadianInvestor",
        "created": 1628116685.0
    },
    {
        "author": "Thejayster03",
        "body": "Thank you thank you I'm basically stock god now",
        "created_utc": 1628091465,
        "id": "h7osvk7",
        "score": 32,
        "subreddit": "StockMarket",
        "created": 1628120265.0
    },
    {
        "author": "shortyafter",
        "body": "Cathie Wood must be popping some champagne for Jesus right now.",
        "created_utc": 1628085335,
        "id": "h7oerpo",
        "score": 29,
        "subreddit": "stocks",
        "created": 1628114135.0
    },
    {
        "author": "Jordansgood",
        "body": "I think the fear is overblown. Great company, growing, investing back into the company and increased their buy back to $15 billion per year. They know the stock is cheap right now. Also boosted my confidence in the ADR since that is what they are buying themselves with the buy back. Be prepared for volatility but I believe it's a winner long term",
        "created_utc": 1628144502,
        "id": "h7rxiiw",
        "score": 27,
        "subreddit": "ValueInvesting",
        "created": 1628173302.0
    },
    {
        "author": "CalyShadezz",
        "body": "PSA - Wear sunscreen, I'm 38 and just found out I have skin cancer today.\n\nI'm fine, getting that shit handled in a few weeks, but I really feel like I should tell people to wear sunscreen now.",
        "created_utc": 1628037125,
        "id": "h7mc6g7",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1628065925.0
    },
    {
        "author": "Karl___Marx",
        "body": "Intel is a smoldering dumpster fire for years now.\n\nYou had Brian Krzanich, a literal numbers guy, running them straight into the ground as he was fondling his secretary the whole time (the [reason](https://www.nytimes.com/2018/06/21/technology/intel-ceo-resigns-consensual-relationship.html) why he left by the way). \n\nThey've made ZERO progress on producing a new architecture and node for the past \\~**20 years.**\n\nThey made gigantic acquisitions like Mobileye, that have produced fuck all to date....\n\nHow the fuck can anyone be so confused to call them a well run company????",
        "created_utc": 1628139744,
        "id": "h7rqld4",
        "score": 23,
        "subreddit": "stocks",
        "created": 1628168544.0
    },
    {
        "author": "Professional-Bear543",
        "body": "[https://www.nytimes.com/2021/07/28/opinion/covid-eviction-moratorium.html?utm\\_source=pocket-newtab](https://www.nytimes.com/2021/07/28/opinion/covid-eviction-moratorium.html?utm_source=pocket-newtab)\n\napproximately 10-15% of renters are behind on their rent, nationwide\n\nthere's about 43 million renters, so about 6.45 million are behind on rent\n\nassume 10% of those renters are in such dire straits that they become homeless\n\nthat gives you 645k new homeless people\n\nthere's about 500k now\n\n100% increase coming in homelessness\n\ncalls on shopping carts",
        "created_utc": 1628130751,
        "id": "h7raih9",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1628159551.0
    },
    {
        "author": "AnEagleNamedBigGov",
        "body": "I go in and out of numbness from shell shock and rage / sadness that scams like this are allowed on the markets. I started trading last year with stimmy checks and got really lucky on some big plays, so that makes it easier to cope with the loss, but I haven't increased my spending in life and live very modestly so it hurts a lot when I think about how much I could've helped my family with this money and now it's just gone",
        "created_utc": 1628098040,
        "id": "h7p911a",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1628126840.0
    },
    {
        "author": "Brizz3252",
        "body": "Meme stocks now have  a category. That’s most intriguing.",
        "created_utc": 1628075638,
        "id": "h7nxouc",
        "score": 21,
        "subreddit": "Wallstreetbetsnew",
        "created": 1628104438.0
    },
    {
        "author": "goldenmorgue",
        "body": "They're obviously being bought out soon. That's why they're mentioning Microsoft now. Hiring Drew Markham was the point where it became obvious.",
        "created_utc": 1628150012,
        "id": "h7s4cc1",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1628178812.0
    },
    {
        "author": "snkbrdng",
        "body": "Sometime between now and the end of the year each XLNX share will convert to 1.7234 AMD shares. If this converted today you would get $204 worth of AMD for $140. 🧠🧠🧠🧐🧐🧐",
        "created_utc": 1628091881,
        "id": "h7otw1c",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1628120681.0
    },
    {
        "author": "theothermatthew",
        "body": "TBH, China hasn’t been Communist since the 1970s. Authoritarian, absolutely, but it’s basically a mixed economy right now.",
        "created_utc": 1628083667,
        "id": "h7ob8q7",
        "score": 21,
        "subreddit": "stocks",
        "created": 1628112467.0
    },
    {
        "author": "whynotallin",
        "body": "This is the biggest sleeper stock in the market right now. I’m virtually all in on this right now. Keep in mind we’re on the brink of an EV industrial revolution and this company is positioning itself to be one of the key players in it. For Christ’s sake QS is worth 10 billion (4x what were worth) and they don’t even have a product or revenue till 2025 (best case). Oh and don’t forget we’re also developing solid state in our new Florida r&amp;d plant but no one prices that in",
        "created_utc": 1628044593,
        "id": "h7mrcei",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1628073393.0
    },
    {
        "author": "tiesmo",
        "body": "so everyone was hyped about shorting HOOD and now everyone FOMO buying",
        "created_utc": 1628029117,
        "id": "h7lvety",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1628057917.0
    },
    {
        "author": "FFaddict13",
        "body": "My acct was down 97% back in June, but I'm only down 93% now. Watchout mfk'ers.",
        "created_utc": 1628029634,
        "id": "h7lwj2y",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1628058434.0
    },
    {
        "author": "non_ducor_duco_",
        "body": "Same. I was incredibly lucky to be in the position to become a first time homebuyer in 2011, when I was in my 20s. Still in that house, sitting on insane equity right now. Honestly thinking of selling and buying some acreage at this point so we can build houses for my kids on the property as they get older and start families.",
        "created_utc": 1628084297,
        "id": "h7ocjmh",
        "score": 20,
        "subreddit": "stocks",
        "created": 1628113097.0
    },
    {
        "author": "spyaintnobitch",
        "body": "Was bashing HOOD last week but I like money so we're friends now",
        "created_utc": 1628100717,
        "id": "h7pfinr",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1628129517.0
    },
    {
        "author": "frala",
        "body": "So in the last 54 weeks, price is essentially flat.  Again, so what?  The thesis of this post seems to be that the existence of mining companies is a reason to buy them.   Newmont has been mining gold for over a century.  We're supposed to buy it now because...?",
        "created_utc": 1628086685,
        "id": "h7ohqqq",
        "score": 20,
        "subreddit": "investing",
        "created": 1628115485.0
    },
    {
        "author": "WampaSteve",
        "body": "Oh itll be back. It’s a trillion dollar company that is hated right now because the street is idiotic. Reminds me of the “sell Tesla” articles that were en Vogue back in 2012/2013.",
        "created_utc": 1628136080,
        "id": "h7rkgip",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1628164880.0
    },
    {
        "author": "Slut_Spoiler",
        "body": "I could really use an announcement from GME right about now, but it's a shares play, so I am not worried. I understand the fundamentals of what's making it go yo yo, just gotta give it more time.",
        "created_utc": 1628095442,
        "id": "h7p2m8l",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1628124242.0
    },
    {
        "author": "chimp-to-the-moon",
        "body": "Im gonna buy in on Hood now. Can you all promise not to sell?",
        "created_utc": 1628103002,
        "id": "h7pkzuf",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1628131802.0
    },
    {
        "author": "dbgtboi",
        "body": "a lot of you are new here, and never saw a market without 100+ billion of QE a month, i remember the days where really good news would pump a stock 1-2%, now we see 20-100% days on no news regularly\n\nthat was what it was like before jerome powell became head of the fed, those were dark times and you boys aren't gonna know what hit ya when those printers turn off one day when his term eventually ends",
        "created_utc": 1628032492,
        "id": "h7m2mtt",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1628061292.0
    },
    {
        "author": "GreatsquareofPegasus",
        "body": "1. Etsy ain't going anywhere - Etsy is NOT like Amazon nor does it pretend to be.\n2. Earnings were better than expected -  negative catalyst is temporary FUD that will slowly dissipate over the next few days/weeks.\n3. Etsy had been growing since before the pandemic - although slower.\n4. With Etsy's power boost of online sales and activity because of the pandemic, Etsy is now at a much better position to continue growing - mainly their ad revenue ventures.\n5. Etsy is a solid company that is not likely to crash anytime soon.\n6. This isn't advice, it is MY OPINION based on experience as a trader. Yes I have skin in the game but YOU DON'T HAVE TO. I am happy to report the outcome of my trade if you wish.\n\n&amp;#x200B;\n\n\\- Do not buy the stock if you don't have the tolerance for the waters. The market eats novice sailors as a pastime.",
        "created_utc": 1628140033,
        "id": "h7rr1px",
        "score": 18,
        "subreddit": "stocks",
        "created": 1628168833.0
    },
    {
        "author": "TSLATrader",
        "body": "And now it’s 52. 36% just thrown away.",
        "created_utc": 1628043273,
        "id": "h7mop6f",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1628072073.0
    },
    {
        "author": "Th3MrPancake",
        "body": "Good PT from an analyst: nothing happens\n\nBad PT from an analyst: absolute fucking disaster \n\nI just don't get it, i've lost so much money the last couple of weeks godamm \n\nHope everyone is okay, one day we laugh about this, but for now i have to say goodbye to my plans of going to japan next year and back to work",
        "created_utc": 1628080278,
        "id": "h7o4tvb",
        "score": 18,
        "subreddit": "SPACs",
        "created": 1628109078.0
    },
    {
        "author": "BoomBoomMansena",
        "body": "yall hear about delta+? delta variant upgrade now with live sports and hbo",
        "created_utc": 1628087910,
        "id": "h7okiqt",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1628116710.0
    },
    {
        "author": "space_dadddy",
        "body": "CNBC is pretty much WSB-TV now.",
        "created_utc": 1628093546,
        "id": "h7oxxqs",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1628122346.0
    },
    {
        "author": "HeavyweightDoxxer",
        "body": "So I have considered this but a big possible downside is there in the form of environmental legislation. There’s been a push lately to make it harder to create new golf courses because they take up a bunch of space and don’t promote biodiversity. \n\nNow before you say to yourself “fuck this treehugger” know that there is also an upside to this. If they are successful in making it hard/prohibitively expensive to form a new golf course, the existing ones are gonna get more expensive. \n\nTl;dr  putts on minigolf",
        "created_utc": 1628097952,
        "id": "h7p8t5x",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1628126752.0
    },
    {
        "author": "STUURNAAK",
        "body": "I have 50% more amc shares now, thanks to Robin Hood. Wanted to sell at $80 but wasn’t quick enough so I sold at 68$... still all that in 15 minutes was satisfying. Like a „we are sorry“-present for disabling the buy option.\nStill won’t use their app.",
        "created_utc": 1628090774,
        "id": "h7or7ut",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1628119574.0
    },
    {
        "author": "RockeManTT",
        "body": "Market at all time highs. But 2 biggest companies AAPL and AMZN are being outperformed by Russell 2000 this year by 20%. SPY calls free money since 2020, buying the dip never fails, if you’re a buy and hold investor you’re getting your ass beat in this market by the guy buying HOOD the day AFTER it pops 25%. Just unreal. If you can’t beat em join em.. I’m gonna start playing momentum now. I don’t care if the stock is liquid shit.. if it’s up 25% in 1 day I’m buying 🤷🏻‍♂️🐷",
        "created_utc": 1628077285,
        "id": "h7o00k6",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1628106085.0
    },
    {
        "author": "fugatorio",
        "body": "So I have an observation to share.\n\nTwo years ago, wsb made fun of Mango Man all the time, from his antics against China and Bezos that crashed AMZN to his 3am twits pumping spy. Seriously wsb used to shitpost all the time while Donnie Pump had press conferences and made fun of gay bears.\n\nNow you can't comment anything about our current president (Buyden, sleepy market, etc) without retards screaming NO POLITICAL TALKARINO MODS BAN THIS GUY. \n\nI mean what gives? Are some people here that new? Wsb is about making money, not feeling sensitive and defending whoever politicians you voted.",
        "created_utc": 1628082259,
        "id": "h7o8fy3",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1628111059.0
    },
    {
        "author": "zombiehiro",
        "body": "It used to be, we banned banks from doing this and now a different type of financial organization has the capital to pull this off that are exempt from this law.",
        "created_utc": 1628038008,
        "id": "h7mdyjy",
        "score": 16,
        "subreddit": "StockMarket",
        "created": 1628066808.0
    },
    {
        "author": "LeoFireGod",
        "body": "It’s my birthday as of now. All I Want for my bday is a green stock day for my portfolio. \n\nAnd a BJ.",
        "created_utc": 1628055231,
        "id": "h7n9cpo",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1628084031.0
    },
    {
        "author": "JamboreeJoseph",
        "body": "Oh would you look at that, the options button is available now on $HOOD… 😏",
        "created_utc": 1628082383,
        "id": "h7o8otr",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1628111183.0
    },
    {
        "author": "Capable_Ape_69",
        "body": "Hey man, I’m at little older than you at 39.  I lost a little more than this, but remember what got you here and learn from it.  It hurt really bad for me because I’m first generation refugee and I worked really hard for my money and lost lots of it, but I am also I’m very thankful for everything else that’s good in my life that money can’t buy (grew up under Saddam’s rule).  This will eat at you for a while and it really sucks because you likely won’t share it with lots of people personally due to shame, but remember…even with this loss, you’re still more lucky  than lots of other people I know…you can still see, you can still hear, you can still taste a good steak, you can still wipe your own ass and  hopefully you can still have sex with a pretty girl. This experience will make you more careful with future money that you earn, but for now… focus on enjoying your life! Money comes and goes..that’s just life!",
        "created_utc": 1628065149,
        "id": "h7nle4k",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1628093949.0
    },
    {
        "author": "xjayroox",
        "body": "Ugh gonna need to listen to HOOD bagholders for weeks now",
        "created_utc": 1628087337,
        "id": "h7oj75y",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1628116137.0
    },
    {
        "author": "ArionIV",
        "body": "The way I see it, timing can't be predicted accurately because the system and people running the system are perpetually engaged in actions that help delay such fallouts of their bad actions and the air of denial that is maintained by them also delays reactions from the market or general public which would derail their own plans of mitigation and/or riding out the crisis on their own terms. \n\nWhat posts like yours or predictions by Michael Burry serve to do is help people watch out for warning signs. It's a person calling out a dam burst and there's no way you can time it or convince enough people in time to prevent it from happening. I myself believe in the things you say and have been expecting a crash for a long time now. None of these highs make sense or look sustainable in the long run. I am greatly concerned that the people do not understand that each subsequent crisis or string of bubbles is adding more dimensions to the unpredictable nature of the problem. Further, us folk not being accurate seers is enough to discredit our views.",
        "created_utc": 1628142281,
        "id": "h7ruev0",
        "score": 15,
        "subreddit": "stocks",
        "created": 1628171081.0
    },
    {
        "author": "Cadash_Thaig",
        "body": "Oh cmon now. It's a two sided war but America is just incompetent...",
        "created_utc": 1628085256,
        "id": "h7oelm7",
        "score": 15,
        "subreddit": "stocks",
        "created": 1628114056.0
    },
    {
        "author": "meatmask",
        "body": "Tell her real sweet like, \"baby I used to fuck alot of whores now I only fuck one.\"",
        "created_utc": 1628043853,
        "id": "h7mpvby",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1628072653.0
    },
    {
        "author": "shutupdigit",
        "body": "I’m fucking forgot to refill ambien. Fuck my week right now.",
        "created_utc": 1628040991,
        "id": "h7mk240",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1628069791.0
    },
    {
        "author": "MasterYI",
        "body": "I’m making so much damn money from AMD right now",
        "created_utc": 1628088738,
        "id": "h7omel5",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1628117538.0
    },
    {
        "author": "plague__8",
        "body": "i’m depressed and thinking about how much time i devote to losing money.  i have better hobbies than this shit, but now i’m too deep to leave.  i wish i never started investing on my own outside of mutual funds",
        "created_utc": 1628040814,
        "id": "h7mjozt",
        "score": 14,
        "subreddit": "SPACs",
        "created": 1628069614.0
    },
    {
        "author": "Appropriate_Tap_7045",
        "body": "Now i know why Cathie jumped on HOOD before SOFI. Chases lottos just like us degenerates",
        "created_utc": 1628095670,
        "id": "h7p36fd",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1628124470.0
    },
    {
        "author": "sharist_DIY_bio",
        "body": "Also, I know it is a pain in the ass, but if you look at Zy's S-1 and you look at SRNG's s-4's it is a world of difference. Folks, I know you don't want to plow through the SEC filings and nit pick them. But you really have to. Zy had already been borrowing massively from the dubious Perspective Credit Holdings II, **second line** in their s-1. When a company tells you it is in trouble, believe them. They RUSHED to IPO, with no revenue in Covid, because they were going to have to fork over everything to their creditors unless they had a big cash raise. They had a 100 million credit facility on December 31, 2020. They had liens on substantially all their assets when they IPO'd. Perceptive Credit Holdings will own every patent of ZY within days, now. Read your SEC docs, folks. Rely on teams with great lawyers and auditors that provide us with well crafted SEC filings in a timely manner. Edit: I mean it could still be salvageable because they raised about 548Mil in the IPO to service their debt, but the evidence was in the s-1s. And the analysts have only downgraded to hold, left them with a $12 instead of a $54. lol. who knows. My point is related to the SPAC vehicle and the SEC filings. Follow your teams and follow the quality, and please don't compare ZY to $DNA, they really do not match.",
        "created_utc": 1628077710,
        "id": "h7o0np6",
        "score": 14,
        "subreddit": "SPACs",
        "created": 1628106510.0
    },
    {
        "author": "ProOrlando",
        "body": "Never understood how people in Germany went along with the Third Reich until now. Just whip people into a fear filled frenzy about an 'enemy' and let 'er rip. Society will take care of everything else.",
        "created_utc": 1628044322,
        "id": "h7mqt33",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1628073122.0
    },
    {
        "author": "AltPossum",
        "body": "I didn’t buy HOOD because IPOs are death.\n\nHowever, I am strongly considering FOMOing into it now, because I am retarded.",
        "created_utc": 1628075566,
        "id": "h7nxlcn",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1628104366.0
    },
    {
        "author": "WickedSensitiveCrew",
        "body": "Time to get in was when everyone was calling it crap and laughing at Cathie Wood for buying on Day 1. You have way more downside risk now.",
        "created_utc": 1628104795,
        "id": "h7pp9ya",
        "score": 13,
        "subreddit": "stocks",
        "created": 1628133595.0
    },
    {
        "author": "ITypeStupdThngsc84ju",
        "body": "Tritium makes charging hardware and is going public under the DCFC ticker symbol (SPAC). I know very little about them.\n\nCHPT - Chargepoint - Their business model relies on the sales of cloud services to partners that provide colorful reports on charger utilization. The partner provides the power and in many cases the maintenance as well. Each charger nets them at least $300/year in revenue, with more if the customer buys a maintenance plan.\n\nEVGo - EVGo builds the infrastructure and pays for the power, and profits based upon how they bill customers. Their primary revenue source is customers using the network. Their prices are a bit high, but they are working on getting really valuable locations.  \n\n\nBLINK - They revenue share with the site hosting the charger and are mostly installing low-reliability chargers at usage prices that make gas look dirt cheap. Without a major change in their business model, I don't see this going far, but the upside is that low information site hosts (often in the hospitality industry) find them appealing.\n\nVOLTA - Advertising based free charging. The way I see it, these guys have figured out a way to buy billboard space in high traffic areas for &lt;$100/month in operational costs. Its a really clever business model. Not sure how sustainable it is, but maybe?\n\nElectrify America &amp; Tesla Superchargers - Automaker subsidiaries, so not independently traded. Probably closest business model-wise to EVGo, though with slightly different pricing strategies.\n\nI've probably left out some other charge equipment manufacturers, but I can't think of them right now.",
        "created_utc": 1628096031,
        "id": "h7p42lb",
        "score": 13,
        "subreddit": "investing",
        "created": 1628124831.0
    },
    {
        "author": "ChickennShawarma",
        "body": "Should I buy AMD now or is too high?",
        "created_utc": 1628089911,
        "id": "h7op5lt",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1628118711.0
    },
    {
        "author": "Summebride",
        "body": "Technically now up 100% in 3 days.",
        "created_utc": 1628093371,
        "id": "h7oxifo",
        "score": 13,
        "subreddit": "stocks",
        "created": 1628122171.0
    },
    {
        "author": "Kotoyoto",
        "body": "Patiently waiting for spy to dip 2-3% so I can buy calls... any time you're ready mr spy anytime now....",
        "created_utc": 1628034095,
        "id": "h7m5zg1",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1628062895.0
    },
    {
        "author": "Crazy95jack",
        "body": "I like that stock alot. Been buying it for 7 months now. Its my new saving account.",
        "created_utc": 1628096595,
        "id": "h7p5gxz",
        "score": 13,
        "subreddit": "stocks",
        "created": 1628125395.0
    },
    {
        "author": "slammerbar",
        "body": "We need a massive DA like right now!!",
        "created_utc": 1628082608,
        "id": "h7o94es",
        "score": 13,
        "subreddit": "SPACs",
        "created": 1628111408.0
    },
    {
        "author": "EatMeatPeeps",
        "body": "Being a land lord  used to be a good source of passive income. Now it’s a joke. You have to pay taxes, insurance, and maintenance just to not get paid. \n\nYou finally get that tenant out. Because of your lost revenue and hesitancy about another situation arising similar to the last one, you decide to raise rent. You get slapped with a fine because of rent control. \n\nPuts on real estate investment. Everyone being entitled is going to wreck it.",
        "created_utc": 1628045753,
        "id": "h7mtkh0",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1628074553.0
    },
    {
        "author": "fickdichdock",
        "body": "fuck it now I'm all in HOOD",
        "created_utc": 1628100220,
        "id": "h7pebst",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1628129020.0
    },
    {
        "author": "rotflolmaomgeez",
        "body": "Except you don't know when the deal will go through, China can potentially delay it for up to a year from now.",
        "created_utc": 1628032381,
        "id": "h7m2egj",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1628061181.0
    },
    {
        "author": "Spartacas23",
        "body": "Feel like I've been hearing about a silver squeeze for a while now",
        "created_utc": 1628030641,
        "id": "h7lyp7h",
        "score": 12,
        "subreddit": "pennystocks",
        "created": 1628059441.0
    },
    {
        "author": "wallstreetbeatmeat",
        "body": "Kind of ironic that Robinhood is now the one halted...",
        "created_utc": 1628084230,
        "id": "h7ocekm",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1628113030.0
    },
    {
        "author": "V0ODO0616",
        "body": "It’s been dead. It’s just bag holder against bag holder now.",
        "created_utc": 1628089271,
        "id": "h7onnnp",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1628118071.0
    },
    {
        "author": "1foxyboi",
        "body": "I've seen a dozen of these posts lately and literally no one is mentioning the fact that AMD has to maintain its value to make money. If you by 1 share of XLNX at 145 and the next day AMD drops to 50 (exaggeration to make my point), then it doesn't fkn matter if you get 1.7 shares because you would be down.\n\nSure, if you buy XLNX right now and the merger is approved and happens immediately then you'd make 42% arbitrage, but I repeat, that gain is completely dependent on AMDs share value from the time of the XLNX buy to the date of the merger closing.",
        "created_utc": 1628131691,
        "id": "h7rcc2l",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1628160491.0
    },
    {
        "author": "KantStopTheCot",
        "body": "Anytime SJA! Been following your plays for a while and dabbling in a few, including CLF. I’m still holding on to wayyyy to much BARK (wooooof 😑). Stoked for Christmas Dong 2.0. Curious if you’re spending company time writing it as you go along or just going to hammer it out Christmas Eve?\n\nPs- now that were best friends “cAn I hAve SoMe MoNeY oR yOuR nExT pLaY?”",
        "created_utc": 1628095052,
        "id": "h7p1nqz",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1628123852.0
    },
    {
        "author": "RichieWOP",
        "body": "Right now it just needs to grow into its valuation, after that it'll start its climb back to 45, then 50, 60 and so on. Over the long term I think it will be a massive winner.",
        "created_utc": 1628029250,
        "id": "h7lvp3z",
        "score": 11,
        "subreddit": "stocks",
        "created": 1628058050.0
    },
    {
        "author": "thewaterb0yyyy",
        "body": "HOOD is free money, it makes perfect sense. Vlad saved wall street by killing the memes in January now wall street is going pay his ass thru stonks now that he went public.",
        "created_utc": 1628047218,
        "id": "h7mwa6v",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628076018.0
    },
    {
        "author": "Extremely-Bad-Idea",
        "body": "Last week the Robinhood haters were laughing when HOOD's price dipped immediately after the IPO.  Now that HOOD is surging, they look confused.\n\nI was allocated HOOD shares through the IPO.  Over 300,000 other Robinhood customers got HOOD the same way last week.  I am feeling good, thanks for asking.    : )",
        "created_utc": 1628092286,
        "id": "h7ouvrh",
        "score": 11,
        "subreddit": "stocks",
        "created": 1628121086.0
    },
    {
        "author": "PappyGrant",
        "body": "Yep, at the end of the day: all investments are return mechanisms.\n\nYou lay out money today (principal) to get a return over time.\n\nTherefore, when the 10 year is at 1.2%, it doesn't even make sense to invest in bonds so people have been heavily investing in equities because the current S&amp;P earnings yield is around 3.3% (The S&amp;P PE ratio OP provided does not include Q2 earnings which means the real S&amp;P PE right now I think is between 29-30)\n\nA return of 3.3% with the ability to reinvest itself compared to 1.2% which is stagnant... not a hard decision to make there.\n\nThis is incredibly simplifying things but this is the general view that Buffett and Munger hold with investing. It's all about opportunity cost, and the benchmark they largely compare investments to (and discount future cash flows with) is the risk-free rate of return, which is the 10-year note.\n\n**EDIT:** The kicker of this highly unusual market is that many investors, like Buffett, seek 10% returns. If you see above, the TTM earnings of the S&amp;P is far from 10%, even with expected growth priced into the equation. BUT by pure investing standards, when the S&amp;P TTM earnings yield is over double the return of the 10-year yield... equities are without question the smarter investment. BUT (x2) is a 3.3% yield today (probably 4.5% by January 2022) a return you want to lock yourself in for the long term?.. BUT! (x3) Sitting in cash, or even government bonds, you're guaranteed to lose money with inflation..\n\nTLDR: The market is both objectively cheap and historically expensive. Some people call it a \"logical bubble\". Only time will tell what will happen, but remember the job of the investor is to not get sidetracked by macro factors and instead continue to assess the earning power of companies for the long term.",
        "created_utc": 1628089149,
        "id": "h7onddf",
        "score": 11,
        "subreddit": "ValueInvesting",
        "created": 1628117949.0
    },
    {
        "author": "DragonInPajama",
        "body": "spread is now saying 30% chances of it succeeding. I see this as a more temporal inefficiency of the market than a correct pricing in of the chances of the merger happening.",
        "created_utc": 1628095769,
        "id": "h7p3fai",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628124569.0
    },
    {
        "author": "notherday11",
        "body": "How is Moderna profiting off the deaths, though? Right now they’re just a company that makes vaccines, right?",
        "created_utc": 1628078639,
        "id": "h7o23en",
        "score": 11,
        "subreddit": "stocks",
        "created": 1628107439.0
    },
    {
        "author": "StonkerGraduation",
        "body": "Who ever buys HOOD now is equally retarded as me buying magic internet money at 55k! Do with this info what you want! \nEdit: I suppose to be on Bali but in stead I am stuck bag holding this shiet, dont be me and dont buy hood at 51, you retards",
        "created_utc": 1628035309,
        "id": "h7m8h6u",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628064109.0
    },
    {
        "author": "realister",
        "body": "Did you know that you can download the whole Wikipedia archive? 🤓\n\nThe whole sum of human knowledge for the last 20,000 years will fit on a $5 SD card. (size about 20GB compressed)\n\nCould be useful in an apocalyptic scenario, you can recreate human society with just this archive.\n\nYes I am very high right now.",
        "created_utc": 1628137329,
        "id": "h7rmlia",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628166129.0
    },
    {
        "author": "walter1021",
        "body": "Keep a minimum of 10g of blow in the house at all times voila your slum lord trap house is now a high class drug den",
        "created_utc": 1628133478,
        "id": "h7rfq8y",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628162278.0
    },
    {
        "author": "zutrasimlo",
        "body": "Many (including myself) missed the first big sell off. I was up 130%+ at one point and now back to slight profit. Ironically nothing has changed about the thesis. Trials are still on track. So like others are saying it’s a long play.",
        "created_utc": 1628146876,
        "id": "h7s0k82",
        "score": 11,
        "subreddit": "pennystocks",
        "created": 1628175676.0
    },
    {
        "author": "lMDB_Scammed",
        "body": "Whoever bought $HOOD at the top, you can come out now we won't judge",
        "created_utc": 1628130072,
        "id": "h7r95r0",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628158872.0
    },
    {
        "author": "smohk1",
        "body": "You can trade options on HOOD now...at least in the RH app",
        "created_utc": 1628093790,
        "id": "h7oyj9f",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628122590.0
    },
    {
        "author": "ryanryans425",
        "body": "The best time to buy HOOD was at IPO, the next best time is NOW",
        "created_utc": 1628097206,
        "id": "h7p6yxl",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628126006.0
    },
    {
        "author": "whynotallin",
        "body": "I actually respect that he said he has to do his research on them still. I’m hoping that means he comes back on the show in a few days and gives an educated opinion on them now. Maybe this post will stumble across his desk and he’ll see what a better company they are compared to QS",
        "created_utc": 1628135757,
        "id": "h7rjw6z",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628164557.0
    },
    {
        "author": "mikeJawesome",
        "body": "People in this sub selling mvst now.  Time for it to go up.",
        "created_utc": 1628068821,
        "id": "h7npfv1",
        "score": 11,
        "subreddit": "SPACs",
        "created": 1628097621.0
    },
    {
        "author": "Small_Guava_8545",
        "body": "I heard real estate is on fire so much even the homeless are out there selling homes now.",
        "created_utc": 1628039672,
        "id": "h7mhckq",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628068472.0
    },
    {
        "author": "stck123",
        "body": "Not a spac, but I just noticed that AMD is now officially 10x from when I sold it in 2018 or so. Another 80k of would have could have. This active trading shit is going to haunt me forever.\n\nAt least I can tell myself I was part of their success, having used their CPUs over Intel in the 1990s.",
        "created_utc": 1628089094,
        "id": "h7on8q7",
        "score": 11,
        "subreddit": "SPACs",
        "created": 1628117894.0
    },
    {
        "author": "SpartanNYC",
        "body": "Adding $SOFI. HOOD resetting valuation of peers. SOFI is super cheap now.",
        "created_utc": 1628098403,
        "id": "h7p9x4z",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628127203.0
    },
    {
        "author": "Three_Little_Birds_",
        "body": "I don’t like drama, but I do like friends and it seems many are missing now. I don’t know what happened but I hope things work out for everyone involved on all sides, I just want everyone to get along and be happy and have fun. Life is hard and I believe most people are just trying their best.",
        "created_utc": 1628104937,
        "id": "h7ppm3y",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628133737.0
    },
    {
        "author": "hungbigandthick",
        "body": "HOOD Volume is crazy this stock will end big today I would get in under 70 now why you still can!",
        "created_utc": 1628102900,
        "id": "h7pkqys",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628131700.0
    },
    {
        "author": "Bulevine",
        "body": "This is the way.  \n\n-50k now...  \n+200,000,000 in the future.",
        "created_utc": 1628087631,
        "id": "h7ojvem",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1628116431.0
    },
    {
        "author": "oregon_forever",
        "body": "I thought you guys were all going to short HOOD. Now everyone is acting as if they actually bought calls. Classic WSB.",
        "created_utc": 1628096549,
        "id": "h7p5cvp",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1628125349.0
    },
    {
        "author": "rotflolmaomgeez",
        "body": "We don't know.\n\nMajor signs point to the end of the year, however China's antitrust regulators can delay their decision up to a year from now.\n\nMy position has Jan 22 calls.",
        "created_utc": 1628036495,
        "id": "h7mawjr",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1628065295.0
    },
    {
        "author": "greytoc",
        "body": "It depends on the type of institutional holder and size of the company. I generally favor companies with high percentage of institutional holders and lower percentage of insiders. I.e. $aapl, $msft, $fisv are examples.\n\nPart of my reasoning is that if a company cannot attract institutional investors, there could be something wrong fundamentally with the business.",
        "created_utc": 1630943329,
        "id": "hbtja49",
        "score": 5,
        "subreddit": "investing",
        "created": 1630972129.0
    }
]