[
    {
        "author": "AgyleArgyle",
        "body": "History of the largest companies in the world\n1980 IBM, AT&amp;T, Exxon, Standard Oil\n1990 Nippon Telegraph, Bank of Tokyo, Industrial Bank of Japan, Sumitomo Mitsui Bank\n2000 Microsoft, GE, NTT DoCoMo, Cisco\n2010 PetroChina, Exxon, Microsoft, ICBC\n\nThis hopefully shows that just bc you are the largest company at the start of one decade, it isn’t a guarantee you’ll be the largest the next.",
        "created_utc": 1622227950,
        "id": "gzsh4hb",
        "score": 85,
        "subreddit": "stocks",
        "created": 1622256750.0
    },
    {
        "author": "dect60",
        "body": "Investing titan Jeremy Grantham made prescient calls about the bursting of bubbles in 2000 and 2008.\n\n\nIn an interview, he said the current market was eerily reminiscent of the dot-com bubble.\n\n\nHe also shared the four indicators that have lined up for the biggest wipeout of value. \n\n\n\nWhen Jeremy Grantham declared in January that \"the long, long bull market\n\nsince 2009 has finally matured into a fully fledged epic bubble,\" he said he knew there would be \"a substantial increase in crazy behavior\" before it all came crashing down. \n\nThe cofounder of Boston's Grantham, Mayo, van Otterloo &amp; Co. is famous for having made prescient calls about the bursting of the 1989 Japanese asset-price bubble, the 2000 tech bubble, and the 2008 real-estate bubble.\n\n\"The thing about a bubble is if you can find more money and more crazy investors, it can keep going,\" he told Insider. \n\nAs it played out, what Grantham saw in the fourth quarter as \"extreme overvaluation, explosive price increases, frenzied issuance, and hysterically speculative investor behavior\" escalated into even more remarkable events in the first quarter of this year. \n\nFrom the epic short squeeze in GameStop to the stratospheric rally of Dogecoin, the latest bout of market euphoria has even taken the spotlight away from special-purpose acquisition companies, which have raised $101.5 billion this year and secured $83.4 billion last year — more than the previous seven years combined. \n'This is eerily like 2000'\n\nTo Grantham, the tales of frenzy and mania today are eerily reminiscent of the tech bubble, but signs of cracks are already appearing in the SPAC market, where a sentiment shift, an oversupply, and regulatory scrutiny have led the IPOX SPAC Index down 23% from its February peak. \n\nGrantham, a Model 3 owner, said Tesla's price slump was another sign of the mania unwinding. The electric-vehicle maker's stock, which rose nearly eightfold in 2020, has fallen about 24% from its peak in January despite having delivered \"brilliant\" earnings results for the past two quarters.\n\n\"So this is eerily like 2000,\" he said. \"It doesn't mean it might end tomorrow or just be a blip.\"\n\n\nIn his view, the bursting of bubbles comes slowly and then all at once. For example, in 2000, the downfall started with Pets.com in March and then migrated to more respected small tech companies in April before hammering away midcap companies in June and Cisco — briefly the largest company — in July. \n\nBy September, the tech sector, which had been 30% of the market, was down about 50%. But the S&amp;P 500 was unchanged, and investors started to dismiss what had transpired as a healthy rotation, Grantham said. \n\n\"What it was really is the lack of confidence began to leak, not surprisingly, from those areas with the craziest amount of confidence where people had lost touch completely with any underlying fundamentals,\" he said. \"And then that spread through the system to merely enthusiastic stocks and finally reached the major market.\"\n\nEventually, the music stopped entirely. In September, the 70% of the market that had not been affected rolled over and dropped 50% in the following two years. \n\n\"It's like the termites that were nibbling away and working their way down,\" he said. \"When they covered enough ground slicing away like that, they stopped slicing and went for the rest of the market en masse.\"\n4 indicators have lined up \n\nThis time, the combination of the massive fiscal-stimulus program and the effective rollout of vaccinations is likely to push the bubble to last longer, according to Grantham. \n\nBut he doesn't think it will change the outcome where asset prices revert to a more reasonable level and investors enter a more pessimistic phase. \"What it means is the higher you go, the bigger the fall,\" he said. \n\nGrantham used the classic example of Japan, which inflated the biggest stock-market bubble of any developed country in the 1980s.\n\n\"At the time, everyone believed it was 65 times earnings,\" he said of the price-to-earnings ratio on the Nikkei. \"So that was just massive. The consequence is we are now 32 years later and the market is still not back where it was in 1989 in Japan.\"\n\nSimilar to how Japan suffered from a \"lost decade\" of economic stagnation following the collapse of the asset-price bubble in 1991, another thing to consider in a bubbly environment is the negative-wealth effect, Grantham said. \n\nWhile the burst of the dot-com bubble dragged down the stock market, the net drag on the American economy was over pretty quickly. By comparison, the 2008 financial crisis affected not only Americans with stock portfolios but also ordinary homeowners who were sucked into the real-estate bubble. \n\nThe housing market has become dangerously overheated once again, with multiple gauges of housing-market activity resembling their pre-2008 levels.\n\n\"Looking at the inventory of housing and looking at the availability of money sloshing around in the system,\" Grantham said, \"it is almost certain that, in the next few months, the US the housing market will pass the previous all-time high of 2006 and will establish a new high multiple of family income.\"\n\nAnother indicator flashing warning signals is the bond market, which has become perhaps more expensive than stocks as a material chunk of global sovereign debt has negative yields, meaning that investors pay to lend governments their money. \n\nAside from stocks, bonds, and real estate all being prohibitively expensive, commodities are also flashing warning signs. Driven by a global supply-chain shortage, commodities such as lumber, copper, steel, wheat, and cotton have all experienced huge price surges to reach multiyear highs. West Texas Intermediate crude oil had bounced back from minus $38 per barrel to about $65 as of Friday in just over a year. \n\nWhen commodity prices soar to record highs, the economy is vulnerable to a sharp contraction as consumers become more reluctant to make purchases and lofty prices of raw materials erode the margins of manufacturers. Specifically, surging oil prices were followed by recessions in every decade from the 1970s through the 2000s. A case in point is the 2008 oil shock, when oil prices hit $140 a barrel in the summer of 2008 from just $50 a barrel in early 2007.\n\nTo be sure, similar signs of asset-price bubbles are shooting up around the world, but \"in America, we have the real McCoy, we've got everything lined up,\" Grantham said.\n\nAs the \"craziest, most overconfident, and overpriced stocks\" such as Tesla start to show weaknesses while the rest of the market continues to go up as it did in 2000, the end might just be in sight, he added. \n\n\"This is pretty bad on a very broad front,\" he said. \"We will have to live, potentially, possibly, with the biggest loss of perceived value from assets that we have ever seen.\"",
        "created_utc": 1620788701,
        "id": "gxt7qs0",
        "score": 67,
        "subreddit": "SecurityAnalysis",
        "created": 1620817501.0
    },
    {
        "author": "Dadd_io",
        "body": "Tesla has reached their maximum share price in my lifetime and I am 50.  They cannot and will not grow into that PE before their stock price drops back to 100 and all cars are electric (or I guess hydrogen).  They are the Cisco of the 2020 growth stock bubble.  Cisco is a great technology company who hit their all-time high on March 1 of 2000 and still haven't gotten back to it.  That will be Tesla in 20 years, still not back their all-time high.",
        "created_utc": 1620102839,
        "id": "gwvdgat",
        "score": 46,
        "subreddit": "ValueInvesting",
        "created": 1620131639.0
    },
    {
        "author": "DotComBomb1999",
        "body": "It feels a lot like Feb 2000, when the dot com bubble was about to burst. I was in the thick of it... I was running a startup hoping to IPO, and I had dozens of friends who were paper millionaires with their stock options, and most wound up worthless. I started with $5k in 1998, and by 2000, I had over $200k in my Schwab account. I thought I had cracked the code, and I was feeling pretty invincible.\n\nIn Feb 2000, I shorted some tech stocks, then bailed when they kept going up and took my losses. As the bubble started to burst, I put all my money in \"safe\" profitable tech stocks (Cisco, Oracle, Network Solutions and Intel). A month later the bottom fell out. It was a roller coaster ride, with enough ups to make you think it was coming back. My \"safe\" stocks lost a bundle. I rode two companies into the ground, and lost 90% on others. \n\nToday, Cisco and Oracle are worth less than they were 21 years ago. Despite consistent earnings increases, they never grew into those valuations. (Yes, I wish I had put everything in AAPL, GOOG and AMZN instead).This market feels \"frothy\" (to quote someone smarter than I am). There will always be winners and losers, but when the market loses its collective mind every time someone says \"inflation\" or \"tightening\" it's concerning. I'm still long, but it seems like it's time to think about taking some chips off the table soon.",
        "created_utc": 1620450516,
        "id": "gxcwry6",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1620479316.0
    },
    {
        "author": "keldarepew",
        "body": "They just aren’t in fashion anymore, they have to make room for the new flashy stocks on the street like cisco and ibm.",
        "created_utc": 1622049523,
        "id": "gzjbwl4",
        "score": 18,
        "subreddit": "stocks",
        "created": 1622078323.0
    },
    {
        "author": "Peshhhh",
        "body": "I was looking at dot-com bubble history and noticed something sort of interesting. When you compare some of the biggest tech companies back then against some of the most hyped up companies today, you can find pretty similar patterns in the price action. \n\n[For instance, here are two charts of price history (taken from Macrotrends).](https://imgur.com/a/coW0mAd) One is Tesla since just before the pandemic crash. One is Cisco since near the start of the rapid growth of the dot-com bubble until just before the crash. I've removed the axes. Can you tell which is which?",
        "created_utc": 1621025300,
        "id": "gy56sdg",
        "score": 14,
        "subreddit": "stocks",
        "created": 1621054100.0
    },
    {
        "author": "FinnaLoseThisOneToo",
        "body": "Cisco is the same way. Old ass dinosaurs that only survive on the glacial momentum of the behemoths they are",
        "created_utc": 1621220694,
        "id": "gyeg8mq",
        "score": 11,
        "subreddit": "stocks",
        "created": 1621249494.0
    },
    {
        "author": "LavenderAutist",
        "body": "It's not a gain until you sell.\n\nBut you do you.\n\nMy grandparents told me about how they were up 200% on Cisco at some point until the crash.\n\nIt took them years to get back to even.",
        "created_utc": 1620898290,
        "id": "gxyjq0u",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1620927090.0
    },
    {
        "author": "ryry1237",
        "body": "But if you bought say Cisco at the top (which seemed like a bright promising company back in the dot com era), you'd still be sitting in the negatives right now. Heck even if you bought Cisco at the bottom you'd have underperformed compared to a simple index fund. And Cisco is a company that was one of the survivors.",
        "created_utc": 1621969132,
        "id": "gzfa68b",
        "score": 9,
        "subreddit": "investing",
        "created": 1621997932.0
    },
    {
        "author": "Beowoulf355",
        "body": "I have Cisco stock from the 90's that still hasn't recovered.",
        "created_utc": 1620295591,
        "id": "gx4tcha",
        "score": 8,
        "subreddit": "stocks",
        "created": 1620324391.0
    },
    {
        "author": "butteryhippo",
        "body": "Do any of you clowns even post plays/positions anymore?\n\nGonna sell my sweet little CSCO 5/21 50P’s at open probably. Betting this SPY 5/21 416C is itm by lunchtime",
        "created_utc": 1621479802,
        "id": "gys1po1",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1621508602.0
    },
    {
        "author": "Muboi",
        "body": "Tesla is very similiarly valued to Cisco or Qcom during the dotcom bubble.  \nDownvote to the left",
        "created_utc": 1621026095,
        "id": "gy58ig5",
        "score": 7,
        "subreddit": "stocks",
        "created": 1621054895.0
    },
    {
        "author": "ChickenRanger2",
        "body": "Cisco, Intel, Pfizer come immediately to mind. There are a lot of dividend-paying stocks out there.",
        "created_utc": 1622130582,
        "id": "gzndaoc",
        "score": 7,
        "subreddit": "investing",
        "created": 1622159382.0
    },
    {
        "author": "ReadStoriesAndStuff",
        "body": "Tracked overtime, buying at or close to ATH beats most strategies.  Its a double down on winners when the winners are running.  You do have to pick companies/sectors with room to run, but this counterintuitive strategy makes sense when you consider companies/sectors roaring set ATH  over and over for multiple quarters (see Microsoft last year, Cisco for almost all of the 1990’s, commodities sector during the China super-cycle early 2000’s, etc.).\n\nThe key is to cut them fast when they lose steam, which your mother is doing.",
        "created_utc": 1622417627,
        "id": "h00yobp",
        "score": 6,
        "subreddit": "investing",
        "created": 1622446427.0
    },
    {
        "author": "80Kid",
        "body": "IBM, CISCO, JDS",
        "created_utc": 1620847260,
        "id": "gxw1s5p",
        "score": 6,
        "subreddit": "investing",
        "created": 1620876060.0
    },
    {
        "author": "GreedySpeculator",
        "body": "this is QQQ you retard. TSLA is the 4th stock and is part of the nasdaq 100\n\nSP Tech sector very valid proxy for QQQ earnings. i don't have access to NQ earnings right now. \n\n&amp;#x200B;\n\n |                Ticker               | Holdings | +-------------------------------------+----------+ |          AAPL - Apple Inc.          |  11.08%  | |     MSFT - Microsoft Corporation    |  9.65%   | |       AMZN - Amazon.com, Inc.       |  8.61%   | |           TSLA - Tesla Inc          |  4.13%   | |     GOOG - Alphabet Inc. Class C    |  3.98%   | |     FB - Facebook, Inc. Class A     |  3.95%   | |    GOOGL - Alphabet Inc. Class A    |  3.58%   | |      NVDA - NVIDIA Corporation      |  2.80%   | |      PYPL - PayPal Holdings Inc     |  2.30%   | | CMCSA - Comcast Corporation Class A |  2.03%   | |          ADBE - Adobe Inc.          |  1.85%   | |       INTC - Intel Corporation      |  1.82%   | |         NFLX - Netflix, Inc.        |  1.75%   | |      CSCO - Cisco Systems, Inc.     |  1.68%   | |         PEP - PepsiCo, Inc.         |  1.56%   | +-------------------------------------+----------+",
        "created_utc": 1620304066,
        "id": "gx552lg",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620332866.0
    },
    {
        "author": "incorrectlyseized",
        "body": "Oracle and Cisco stocks are shit because to companies don’t have a product future, just lawyers and gangsters fleecing the exisiting client base.",
        "created_utc": 1620476101,
        "id": "gxdp6dz",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620504901.0
    },
    {
        "author": "Mail_Order_Lutefisk",
        "body": "Just like in '99 and 2000, there is some game changing tech out there. \n\nThis one might ring some bells, but I think Netflix is on the path to being the next AOL. Maybe that's an exaggeration, but I wouldn't touch the stock. There are deep content pools that legacy studios are putting together that will really eat into Netflix, including, ironically enough, the assets of TimeWarner formerly owned by AOL which are now the bundle that is HBOMax. \n\nAny company that isn't an existing conglomerate (like Amazon) that has the word \"cloud\" in its short description worries me. Don't get me wrong, the so-called \"cloud\" is really cool, but I suspect it will be like the old telcos that spent tens of billions burying fiber. Of course, in the long haul that fiber was needed and it was critical for rolling out the data hungry streaming model, but a huge percentage of it got placed and then sat dormant. It absolutely buried companies that were high fliers (you have to understand it wasn't just a dot com bubble, there was an entire telecom bubble as well). A lot of stuff with \"cloud\" in it will probably find a similar fate. There will be winners just like Amazon eventually gained the title of internet commerce king, but the carcasses of the dead will lay across Wall Street only to be forgotten in a few years. \n\nOne that I remember thinking was a turd was PLUG. Look at the max chart on that thing. I still wouldn't buy that. Maybe I'm totally wrong, maybe not. I think TSLA is also overvalued. I'm not saying it's a bad company or anything, but its valuation metrics are way out of whack. \n\nYou have to understand in that era guys would go on CNBC and talk about some new internet IPO was worth x billion because it had y million \"eyeballs.\" I'm not exaggerating. They would multiply page views by 2 and use it as a metric for valuation. That whole thing to me felt like the bigger idiot theory taken to the extreme, but even that feels more reputable than the people who push crypto on CNBC. \n\nI have cash. I want to deploy it because of inflation risks, but there's virtually nothing I want to touch right now so I've just been nibbling on Boomer stocks and swing trading SPY options. \n\nOh, and one other thing. Funds. Back then Janus Twenty was all the rage. They had closed it to new investors. People would brag that they were in it. It had all the high flyers. AOL, Cisco, JDSUniphase, Intel, Microsoft and Oracle. That reminds me of that ARK fund or whatever it is called. Again, not everything in the J20 was a terrible company, but valuations got so out of whack that things like INTC have never returned to their highs and MSFT and ORCL, while good companies, were dead money for over a decade. I think a company like TSLA has the chance to find itself in that sort of company where the stock takes a decade plus to touch its ATH again.",
        "created_utc": 1620788642,
        "id": "gxt7ms3",
        "score": 6,
        "subreddit": "stocks",
        "created": 1620817442.0
    },
    {
        "author": "bschmidt25",
        "body": "IT guy here. Wildcard is supply chain issues but Dell seems to be handling it way better than others. (HPE and Cisco for example)",
        "created_utc": 1621883072,
        "id": "gzazo1s",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1621911872.0
    },
    {
        "author": "DPX90",
        "body": "I don't really want to argue your main point, but this made me laugh:\n\n&gt;...and the winners of the dot com crash , like Apple, Microsoft and Amazon, have outperformed everything...\n\nI mean dude, you deliberately use survivorship bias as an argument. Like Petsdotcom, Webvan or even Cisco didn't exist.\n\nSome of the really high quality companies like Google or Amazon will most likely not \"collapse\", they will either just correct or have very little returns if you buy them at their current prices. But even this is not sure. Cisco was and is a great company, yet it has never recovered to pre-dotcom levels, and you were in the red with Amazon too for like a decade if you bought at highs before the collapse.\n\nFor shittier companies that are valued to tens of billions of dollars without making a single dime of profit, there will be a rude awakening, or at least for their investors.\n\nAddressing your last paragraph, I might be relying on \"outdated financial discipline viewpoints\", whatever the fuck that is (it sounds like you're essentially saying the \"this time it's different\" bs), but at least I'm not relying on hindsight bias and survivorship bias to formulate my models.",
        "created_utc": 1619872379,
        "id": "gwj8xi0",
        "score": 5,
        "subreddit": "investing",
        "created": 1619901179.0
    },
    {
        "author": "NathanGorgeous",
        "body": "Your metaphor of the dog's passing isn't really relevant whatsoever. The dog died, so did you sell? The saying is helping investors to *refrain* from selling, so this is a false equivalency... *kind of?*... because it's also just not relevant in the least. \n\nYou've heard this saying, so I'm sure you've also heard that the two types of people who make the most money in the market are those that are either dead or forgot their passwords. Time in the market is always the best strategy regardless of the price movements of a stock. Of course, this is assuming you invest in quality businesses. \n\nIn the 90s/00s, my aunt took around $20,000 and invested in a bunch of different tech companies. This included Apple, Microsoft, Cisco, and Amazon. Obviously, there was a big loser in there: Cisco. She finally recouped her initial investment on Cisco in 2017, though, so imagine if she had sold? But then there's Amazon. She could have panic sold on the fall from $100 in the dot-com bubble -- but she didn't. And she still hasn't sold. There was about a decade where she could have sold and taken a loss, but she didn't. Now she's obviously massively up on that investment.\n\nLastly, it's obvious you're a new investor and got burned based on A) this post and B) your post history. There's nothing wrong with that, and frankly, it's a good thing probably that you got burned and learned early on. It just sucks that you think timing the market is at all a legitimate strategy for investing, so hopefully you sort that out sooner rather than later.",
        "created_utc": 1620595264,
        "id": "gxjf46z",
        "score": 5,
        "subreddit": "stocks",
        "created": 1620624064.0
    },
    {
        "author": "lattiboy",
        "body": "Logitech, Microsoft, GAP, and Cisco. Also grabbed options on Simon Property Group as earnings are tonight and I think it’s probably the single best “re opening” play out there.",
        "created_utc": 1620845681,
        "id": "gxvxnnr",
        "score": 5,
        "subreddit": "stocks",
        "created": 1620874481.0
    },
    {
        "author": "Tomzassy",
        "body": "Hahaha no sir, buy maybe sometime in the future. I'm very long, so these prices make no difference. I'm hoping it'll be a 300b mktcap company one day, similar to a company like cisco, revenue and eval wise.",
        "created_utc": 1620741127,
        "id": "gxq912t",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620769927.0
    },
    {
        "author": "Soybeanrice",
        "body": "XOM, X, LMT, CSCO. Get your boomer stonks for this month",
        "created_utc": 1620316624,
        "id": "gx5w1sm",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620345424.0
    },
    {
        "author": "51Charlie",
        "body": "It's a PR push. Carriers are working to dump Nokia. Nokia is about as bad of a company as Cisco for its customers.",
        "created_utc": 1621224132,
        "id": "gyenhlz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1621252932.0
    },
    {
        "author": "talm0",
        "body": "Why, Cisco, why did I get ever get my CCNE? You taught me nothing about the market and your stock just bankrupted me.",
        "created_utc": 1621467002,
        "id": "gyrcgbj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1621495802.0
    },
    {
        "author": "claytondpark",
        "body": "were likely going to see spx make new aths next week along with ndx heading back up to it's highs...\n\nIMO, rally will be lead by big caps, faang, boomer shit like financials, boomer tech like ibm/csco/orcl, shit like dow stocks, etc...\n\nGrowth stocks, spacs, evs, small caps, etc.. will bounce but won't sustain the rallies keeping them within a consolidation range until some catalyst breaks them out or breaks them down to their next support levels...",
        "created_utc": 1620335394,
        "id": "gx75gfg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620364194.0
    },
    {
        "author": "ThePelvicWoo",
        "body": "It can still be a problem with investing.\n\nLots of people thought they were getting a great deal with CISCO at $50 in 2000",
        "created_utc": 1620838685,
        "id": "gxvgngt",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620867485.0
    },
    {
        "author": "Material-Medicine-58",
        "body": "Copy pasta my old comment:\n\n\"Nokia is only western company which offers complete end to end solutions. When huawei gets foothold positions in western telecom companies it pushes other industry to make own private networks. Whats the best place to buy your equipment for that? :) nokia has double digit grow for private networks.\n\nBonus thing is that there is major movement to stop huawei's western expansion. Very bullish for long term investment in nokia imho. (I have 1871 shares).\"\n\nAlso nokia offers fastest inhouse switch fabric (FP4) and competitors have nothing to compete against that. Nokia is gaining market share from cisco etc. Because of this chip. Google \"Nokia and Elisa push network boundaries with world’s first 1T deployment\". Theres this line: \"Most networks are still operating a multitude of 100GE ports, with 400GE on the horizon. Nokia’s trial with Elisa is proving out terabit interfaces today.\"\n\nI personally work in telecom industry and I see Nokia as great investment for atleast next 10 years. It has been bashed for a reason before and because of that Nokia has negative weight of history. We can use that for our longterm gain.",
        "created_utc": 1621619486,
        "id": "gyyuqz8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1621648286.0
    },
    {
        "author": "reddituserzerosix",
        "body": "Got some CSCO to day trade",
        "created_utc": 1621432682,
        "id": "gyp42p1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1621461482.0
    },
    {
        "author": "Laakhesis",
        "body": "$INTC, $IBM, $CSCO and $T",
        "created_utc": 1620830813,
        "id": "gxuxhae",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1620859613.0
    },
    {
        "author": "PutsOnYourWife",
        "body": "A friend of mine told me to stick to oracle IBM and Cisco back in January 2021....\n\nI sticked to THCB, PLTR, EXPC, PLUG",
        "created_utc": 1620326569,
        "id": "gx6k0qz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620355369.0
    },
    {
        "author": "RssnGopnik",
        "body": "Stick to what you know. PayPal, Cisco, T-Mobile, visa, master card, Apple, amd, Intel, nvidia",
        "created_utc": 1620097858,
        "id": "gwv553v",
        "score": 3,
        "subreddit": "options",
        "created": 1620126658.0
    },
    {
        "author": "ThheeeNeWGUy",
        "body": "Damn Cisco beats earnings estimates and then just friggen DUMPS man. This market is nuts!",
        "created_utc": 1621454861,
        "id": "gyqkzw2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1621483661.0
    },
    {
        "author": "Dmoan",
        "body": "Let’s laugh at all the boomers who chased value stock and dumped 🍎 for Cisco. Good luck bag holding a company that hasn’t done anything in couple decades.",
        "created_utc": 1621455981,
        "id": "gyqnmza",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1621484781.0
    },
    {
        "author": "BigBrianBrand",
        "body": "This isn't a \\[completely\\] fair comparison to 2000.\n\nRegarding SPACs and the IPO craze this past year, you are right that those are reminiscent of 2000.\n\nHowever, the established players such as big tech (FAANG + M) are not the same as Cisco, Microsoft, and Intel back in 2000. FAANG + M is much more profitable, and has earnings rates (20+%) that has justified larger valuations. On top of interest rates being half of what they were in 2000 (5-6% interest rate, 20 years ago).\n\nFor reference, the NASDAQ had a PE of 200 in 2000 at its peak. Currently it is around a PE of 40, despite being in a lower rate environment.",
        "created_utc": 1621895482,
        "id": "gzbqnbl",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1621924282.0
    },
    {
        "author": "Dadd_io",
        "body": "I hear what you're saying, though back in 2000, Microsoft, Intel, and Cisco all fell that much or more.",
        "created_utc": 1620359107,
        "id": "gx8gxff",
        "score": 3,
        "subreddit": "investing",
        "created": 1620387907.0
    },
    {
        "author": "reddituserzerosix",
        "body": "Big F for CSCO",
        "created_utc": 1621461228,
        "id": "gyr0q9l",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1621490028.0
    },
    {
        "author": "longtrout-snout",
        "body": "Not unless with absolute conviction he knew it was going to happen.\nNor mention the tweets he put out in regards to TSLA tanking then had a visit and was boo’d off Twitter.\nI have to side with Burry more than anything especially once I jump off here and read the TSLA chart is performing identically to CSCO of 2000-2001…TSLA immediately after a confident earnings call loses their buyer for credits, China weighs in, production slowed by chip delays, etc.\nBeauty of human psychology, it always tends to repeat itself",
        "created_utc": 1621465692,
        "id": "gyr9wjv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1621494492.0
    },
    {
        "author": "Zachjsrf",
        "body": "Ohhhhh the $52p leg of my CSCO strangle gonna print tomorrow",
        "created_utc": 1621455048,
        "id": "gyqlfmf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1621483848.0
    },
    {
        "author": "RssnGopnik",
        "body": "Allocate 80% of your portfolio to passive income stocks if you need side cash (PTY yields about 10-11%). They hold corporate bonds AA and some BBs and pay pretty well. Otherwise tech sector such as PayPal, Cisco, T-Mobile, Verizon, Apple, nflx, etc",
        "created_utc": 1620092625,
        "id": "gwuuymp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620121425.0
    },
    {
        "author": "lib3rty47",
        "body": "This can be true and apple can still be way overbought at the same time you know. \n\nFor example look at cisco, great growth company in the 90s and early 20s then the dot com bubble happened in 00. In 21 years they have been included in the NASDAQ, DOW and sp500, enterprises still use them to connect to the internet and they have beaten earnings every year, generates around 11 billion NET income making them a  220 billion company. Cementing them the worlds most valuable internet network company.\n\nBut still even after 21 years, those that bought at the top in 00 have yet to see all time highs again. Not saying apple is stagnant I'm saying good companies don't necessarily mean good investments depending when you bought and at what price you brought. Companies can be overvalued despite being great companies because the market is not the economy.",
        "created_utc": 1621684990,
        "id": "gz1q7kj",
        "score": 2,
        "subreddit": "stocks",
        "created": 1621713790.0
    },
    {
        "author": "RichSteps",
        "body": "This post mentions: **$LUX, $ABML, $BNGO, $ESG, $ACCYY, $RAMP, $HEPA, $ZOM, $MVIS, $RAAS, $CPA, $PNG, $BAA, $CAGR, $GHG, $ESQ, $CSCO, $GRNBF, $CHRLF, $ETFM, $EIC, $PV, $ILED, $ALPP, $PVDG, $TSNP**\n\nOn /r/pennystocks, /u/IcyRag3 has previously mentioned:\n\n||||||||||||||||||||||||||||\n|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-\n**ticker**|**ZOM**|**TSNP**|**RAMP**|**RAAS**|**PVDG**|**PV**|**PNG**|**MVIS**|**LUX**|**ILED**|**HEPA**|**GRNBF**|**GHG**|**ETFM**|**ESQ**|**ESG**|**EIC**|**CSCO**|**CPA**|**CHRLF**|**CAGR**|**BNGO**|**BAA**|**ALPP**|**ACCYY**|**ABML**\n**mentions**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**|**1**\n\n/u/IcyRag3's account was created **2 years ago**. It has **147** comment karma and **25** link karma.\n\n-----\n\n^You ^may ^see ^tickers ^you ^didn't ^mention ^-- ^I'm ^casting ^a ^wide ^net ^because ^y'all ^don't ^always ^$TAG ^your ^ticker ^symbols.\n\n^This ^was ^an ^automated ^response. ^If ^you ^have ^feedback, ^please ^reply ^to ^this ^comment ^or [^(send me a message)](https://www.reddit.com/message/compose?to=RichSteps&amp;subject=bot%20feedback)^.",
        "created_utc": 1620423725,
        "id": "gxbljel",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1620452525.0
    },
    {
        "author": "GeezWhizGuys",
        "body": "the ones that have good fundamentals and not with sky high price/sales will always be a thing.  Beaten down stocks like CSCO are better than AYX rn, and I have both",
        "created_utc": 1620495662,
        "id": "gxepijq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620524462.0
    },
    {
        "author": "vancityace",
        "body": "As others mentioned, it depends on the underlying properties within the REIT. Which is why it's very important to go to the REIT's website to see exactly what you are investing into.\n\nRegarding wfh, I'm with a multi-national finance company. Prior to covid, we were already on a hybrid wfh set up. For my region, it was 2 to 3 days wfh and 3 to 2 days in the office. They were also slowly trying to get rid of extra floors. We were also used to having video/audio conferences (I refuse to day virtual meeting) via Cisco for meetings with other regions and countries, so there's that. \n\nI know some companies, are so hung up on having an office, that they will disregard KPIs or feedback. Or the leaders are very old fashioned and keep muting themselves during meetings.",
        "created_utc": 1620678305,
        "id": "gxnf54g",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1620707105.0
    },
    {
        "author": "notapersonaltrainer",
        "body": "Money works different than most assets. The bigger it gets the more valuable it is. It has upside convexity. People get confused using stock models which mean revert and it keeps going up. I think there are more relevant models like monetary theory, network effects, portfolio theory, asset comparison, and/or commodity models. \n\nLong term you can compare it to [assets](https://cdn.howmuch.net/articles/bitcoin-money-economy-in-perspective-7dd6.jpg) it disrupts and adjust for its specific [money properties](https://imgur.com/a/chbFIp5) strengths &amp; weaknesses. \n\nShort term you can target prices based on [stock-to-flow](https://imgur.com/a/GjHaCTM), like some commodities. \n\nThen there is the pure portfolio theory [Sharpe Ratio](https://imgur.com/a/eUHYmaQ) argument. Something can have value purely for its price movement properties just like trading volatility (which is literally nothing but price movement potential). \n\nYou can also focus on the network aspect. Use [metcalfe's law](https://www.technologyreview.com/2018/03/29/67091/how-network-theory-predicts-the-value-of-bitcoin/) to value it like a FAANG/telecom/fintech network (which are consistently the most valuable and exponential entities) except with the added potential of being completely [open](https://www.cnet.com/news/how-much-is-the-internet-of-everything-worth-cisco-says-19-trillion/). \n\nNothing's going to be perfect for a new asset class that didn't exist a decade ago but these are the models behind the various price projections you've seen.",
        "created_utc": 1620916867,
        "id": "gxze2u2",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620945667.0
    },
    {
        "author": "WoodpeckerAlarmed239",
        "body": "IBM is very interesting now that they are making very very small chips. The first to make 2nm chips.\n\nINTC and CSCO are good too. I think with the cyber security issues, new networks will be put into place to isolate from outside threats. (The oil pipeline that just got hacked as an example.) I'm not a tech head but I would imagine that being sort of a solution, make systems like that totally independent from the www.",
        "created_utc": 1620840451,
        "id": "gxvkykg",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620869251.0
    },
    {
        "author": "neothedreamer",
        "body": "Target exit around $22- 23 or does it depend on price action?\n\nOpened a small short on Csco today that is a little positive. Thoughts?",
        "created_utc": 1620782771,
        "id": "gxsw8qp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620811571.0
    },
    {
        "author": "SideWalkGum-sticky",
        "body": "The stock ticket was the warning. Literally gave you a heads up...good luck fellow idiot, I bought CSCO at peak.",
        "created_utc": 1620261192,
        "id": "gx3f3zr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620289992.0
    },
    {
        "author": "Puzzleheaded-Ad8266",
        "body": "I think it sounds like a really promising and fantastic company. However, that doesn't mean it's a good investment. It's trading at such high multiples that it's left almost no room for growth in share price, particularly given that all metrics for share valuations are more than likely to reduce in the future, google Cisco for an extreme example of this principle (is Tesla the new Cisco?).",
        "created_utc": 1621664594,
        "id": "gz14itb",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1621693394.0
    },
    {
        "author": "SKT_T1_eSports",
        "body": "Imagine if you were a boomer and owned Cisco would take years to recover from this",
        "created_utc": 1621458433,
        "id": "gyqu3fo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1621487233.0
    },
    {
        "author": "Zachjsrf",
        "body": "CSCO suspense is killin me",
        "created_utc": 1621454668,
        "id": "gyqkjh0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1621483468.0
    },
    {
        "author": "us1549",
        "body": "Picked up a ton of FSLY at $42. Solid company IMHO and there was even talk of Cisco buying them out a few months back",
        "created_utc": 1620492485,
        "id": "gxeiy2e",
        "score": 2,
        "subreddit": "investing",
        "created": 1620521285.0
    },
    {
        "author": "OBX-BlueHorseshoe",
        "body": "Currently hold AMZN, MSFT, CSCO, INTC, PFE, MPW, BAC, AGNC, PCAR and BRK.B\n\nI have have D, O, VZ, NEE on my watch list.",
        "created_utc": 1620491428,
        "id": "gxegtho",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620520228.0
    },
    {
        "author": "rally4cancer",
        "body": "Except your analysis is fundamentally flawed - BB is valued at a far lower P/S for many many reasons. It hasn't got anywhere near the revenue growth of a company like crowdstrike. BB revenue between FY20 - 21 dropped 10%, Crowdstrike grew 80%, Zscaler grew 46%, PNW 18%, Sailpoint 27%. You're comparing a declining company with booming companies and expecting them to share the same valuation.\n\nNot to mention - you're either unaware, or not mentioning the **actual** competitors to BB. Blackberry's Cylance/UEM is more comparable to VMware, or Cisco. Both of which have P/S of around 5, like BB. Companies like Zscaler and SPT don't really have endpoint management or security software, and Crowdstrike's tech blows BB out of the water. Tbh most UES/M companies tech blows BB out of the water - Microsoft, Symantec, VMware etc. PNW UES isn't the best - but they've got a myriad of fantastic enterprise security products besides that, and they don't trade at multiples like Crowdstrike. Don't just lump all companies at the same valuations because they're in the cybersec space - that shows a serious lack of information about the nuances of the industry.\n\nAnd BB isn't really a serious company when talking about cybersec. This is popular misinformation spread around this sub - when companies are talking seriously about enterprise security, at the top of their minds isn't BB.\n\nAlso it's a plain lie to say BB has a moat on all its products. They're barely a competitor on UEM/S. The only moat is QNX, which is an incredibly low revenue product - literally like 4$ or less per car per year.\n\nSaying Chen takes his compensation primarily in stock is also stupid. Most CEOs take their compensation primarily in stock - it's how boards and shareholders enforce that share price is a priority to CEOs. Chen also has sold millions upon millions of stock - he's clearly not forseeing some huge price increase.",
        "created_utc": 1620418658,
        "id": "gxbaul6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620447458.0
    },
    {
        "author": "dudetalking",
        "body": "Its a catch 22 in technology. Amazon and Alibabas model is to enter markets in anticipation of competition, even if its  loss leader.\n\nThis is why Buffett avoids technology, because its almost impossible to predict what technology business can sustain itself for decades, unlike say Coke or Gillette.\n\nApple was almost done in the 90s as a company, Microsoft had a lost decade. IBM ruled technology for 50 years, Cisco had its days, Oracle, Sun Microsystem, on and on.\n\nToo many people think FAANG will be around a decade from now, because they can't envision the next disruptor but that is precisely how tech works. The business that will disrupt FAANG will probably be created 2-3 years before they begin doing damage to them.\n\nYahoo was founded in 1994 it IPOed in 1996, and by 2000 was the number 1 internet site in the world.  Google did not go live until 1998, and did not IPO until 2004.",
        "created_utc": 1620137658,
        "id": "gwwqbkq",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620166458.0
    },
    {
        "author": "SideWalkGum-sticky",
        "body": "Bought Glu for 4-6 and it just got purchased by EA for 12.5, GT at 7.30 and is currently around 18, OCGN at .25 lol, DIS at 132 and is 185. \n\nDon’t let this distract you from the fact that I also have bought CSCO at 32, CGC at 34. \n\nThere will be ups and downs so regulate your happiness when you’re up and remember that if you’re down but the stock is still good, it’s an opportunity to “think” about buying and lowering your cost basis. \n\nGood luck out there!",
        "created_utc": 1620062656,
        "id": "gwt0gdv",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620091456.0
    },
    {
        "author": "gavelTree",
        "body": "Lol imagine buying CISCO *today*",
        "created_utc": 1621425628,
        "id": "gyop4ud",
        "score": 2,
        "subreddit": "stocks",
        "created": 1621454428.0
    },
    {
        "author": "Zachjsrf",
        "body": "Who else got CSCO puts today?",
        "created_utc": 1621458055,
        "id": "gyqt0hk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1621486855.0
    },
    {
        "author": "redderper",
        "body": "A lot of stocks never recovered fully from the dot com bubble, probably the majority of them. Even solid ones like Cisco",
        "created_utc": 1620994951,
        "id": "gy3b0nm",
        "score": 2,
        "subreddit": "stocks",
        "created": 1621023751.0
    },
    {
        "author": "ADCinTN",
        "body": "Im investing in CISCO",
        "created_utc": 1621260934,
        "id": "gyg3yu8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1621289734.0
    },
    {
        "author": "BoyW1thADragonTattoo",
        "body": "This has bene mine issue with the man, I really respect what he's doing and he's managed to lay the groundworks for the EV revolution. However, like with Oil, it isn't always the companies that are in first which end up dominant in the long run. Even if Tesla retains a big market share (let's say 10-15%) I just can't see it maintaining this valuation price. **I could fully see Tesla winning,** but that just not being good enough to maintain it's current price. Basically, a second cisco.",
        "created_utc": 1620946357,
        "id": "gy1ab3f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620975157.0
    },
    {
        "author": "j455b",
        "body": "Market on easy mode. A CSCO 52c was an easy 25 bagger. I sold my 50cs like a retard at 20%...",
        "created_utc": 1621526750,
        "id": "gyu4zy5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1621555550.0
    },
    {
        "author": "donttazemebro4",
        "body": "I gotcha. The problem is some of my favorite companies in tech like Google, Microsoft, FB, Apple, etc are still overpriced (but perhaps not atrociously compared to most others). \n\nFrom a pure valuation perspective, I’ve also been shying away from tech in general. However, in the long term I think you’d do fine with the ones I mentioned above as I think they are all likely to continue growing their businesses with success. \n\nIf you’re looking for pure value plays, I have a small position in IBM and am waiting for CSCO and INTC to drop a tad before jumping in. Coincidentally, all 3 actually offer decent dividends for ya. \n\nBest of luck!",
        "created_utc": 1621814075,
        "id": "gz7vc2j",
        "score": 2,
        "subreddit": "stocks",
        "created": 1621842875.0
    },
    {
        "author": "Dadd_io",
        "body": "1) your point on treasuries is completely valid.\n2) the SP500 growth companies in 2000 had huge profits -- Microsoft was one, Intel was in every personal computer, and Cisco was building the internet backbone.  AOL was getting $25 a month from millions for email and their captured content environment.\n3) Interestingly, the value stocks had a HIGHER PE in 2000.  Pfizer had a PE around 50 (thanks to their new drug viagra), and PG had a PE around 40 as well.",
        "created_utc": 1620657403,
        "id": "gxm1tmc",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620686203.0
    },
    {
        "author": "derprondo",
        "body": "There are CSCO bag holders from 1999 that still haven’t broken even.",
        "created_utc": 1620656227,
        "id": "gxlz7n4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620685027.0
    },
    {
        "author": "knawlejj",
        "body": "Tech exec here. Zoom is more than just a meeting software that most people aren't aware of. It's instant messaging is simple and easy to use, their hosted phone platform is just as good if not better than Microsoft's, and their integration partner network continues to grow without alienating it's competition. \n\nI think it comes down but don't count them out, they are capitalizing where they can while they are a household name.\n\nEdit: I have no positions but am a Zoom customer at the enterprise level. Also a Cisco and MS customer.",
        "created_utc": 1621092525,
        "id": "gy81yh9",
        "score": 2,
        "subreddit": "stocks",
        "created": 1621121325.0
    },
    {
        "author": "NdSeIr",
        "body": "CSCO gonna dump after hours right?",
        "created_utc": 1621449651,
        "id": "gyq8u6v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1621478451.0
    },
    {
        "author": "Zachjsrf",
        "body": "CSCO gonna do one of two things this afternoon. Fly or crash. Got a strangle for both outcomes.",
        "created_utc": 1621440486,
        "id": "gypmsc2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1621469286.0
    },
    {
        "author": "Illustrious-Access29",
        "body": "Cisco it’s trying to rebound in the after market hours does not believe it!!!!!",
        "created_utc": 1621481533,
        "id": "gys4ype",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1621510333.0
    },
    {
        "author": "ryry1237",
        "body": "Don't forget old tech (IBM, CSCO, HPQ). Old tech has been outperforming lately.",
        "created_utc": 1621282543,
        "id": "gyhjm1d",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1621311343.0
    },
    {
        "author": "M4A-is-OK",
        "body": "It is nice to see GE breaking out after consolidating here for awhile.  I bought it for $13.29 at the end of March and watched it go nowhere for awhile - looks like some patience is finally paying off.\n\nA few days ago Jim Cramer had this to say [about GE](https://www.thestreet.com/jim-cramer/market-recap-with-jim-cramer-buy-ge-ralph-lauren-cisco-tesla): \"GE is starting to get some traction in aerospace — they’re getting some orders. Healthcare has been very strong, but orders for aircraft parts are very significant for them. I think you buy GE right here\"\n\nI know many on Reddit aren't big fans of Cramer, but all I'll say is I'm a long-time viewer and he has worked for me.",
        "created_utc": 1622148659,
        "id": "gzoju2q",
        "score": 2,
        "subreddit": "stocks",
        "created": 1622177459.0
    },
    {
        "author": "TheBarnacle63",
        "body": "Heavens, I can think of so many.  I would definitely focus on dividend paying stocks; especially those that have a history of rising payouts. I look for a 2% yield.  Here we go:\n\n* Home Depot ($HD)\n* Lockheed Martin ($LMT)\n* Tyson Foods ($TSN)\n\nNow, there are those companies that payback through stock buybacks.  I would consider VMW ($VMW) for that.\n\nI have a dear friend who is a whizz at true buy-and-hold investing.  He insists on financially sound companies that pay at least 2%.  Using his style, I would look at:\n\n* Cisco Systems ($CSCO)\n* Fastenal ($FAST)\n* Hormel Foods ($HRL)\n\nMay I change the rules, and just buy all of these for the next five years?",
        "created_utc": 1622403711,
        "id": "h0085vy",
        "score": 2,
        "subreddit": "stocks",
        "created": 1622432511.0
    },
    {
        "author": "Pathbauer1987",
        "body": "19% since july 2020. Winners VOO, VBR,VWO, MTUM, QQQ, CSCO. Traded AIRN and BA @20% gain. Loosers ICLN and EDV @-20% to -25%.",
        "created_utc": 1619979659,
        "id": "gwoz1fd",
        "score": 1,
        "subreddit": "investing",
        "created": 1620008459.0
    },
    {
        "author": "pml1990",
        "body": "The way I think about this is that all the fad, growth, trendy speculative assets (GME, dogecoin, AMC) are only obvious on hindsight. People look at the self-selective group who post 500% gain on those assets and think that they could have been in those assets too. But that is survivorship bias. \n\nHype eventually died down. Hype and trend investors are, by definition, fickle and change their minds constantly. If you choose to invest with them, you have to follow their sentiment. All the while remember that the fees from a high number of transaction cut away your profit. An analogy to speculative trading is poker: poker becomes a negative sum game the longer the game goes on because as the number of transactions (hands) increase in the game, the higher the sum of cost of the game to all participant is (time spending on DD, transaction, dealer's fee). The pie becomes increasingly smaller the more hands are played. Sure, a small percent of players do earn a living, but compared that to the opportunity cost of had they engaged in some other profession like IT, law, or medical, and it's not clear that the time spent on trading/playing is worth the cost, at least not until you have a sizable portfolio (say, 10 mil+).\n\nSome of these traders think that their hyped picks will become an AMAZON. But what people fail to realize is for every AMAZON winner, there's 10 CISCO losers. It's dangerous to bet that you will be in the lucky 10% of ANYTHING to make a profit. For me, value investing is because the fundamentals of a company is solid enough that, even if that particular company never becomes a meme, I can still put my entire portfolio and come out ahead, if only by the natural growth of the company. I can easily put my life savings into value company such AAPL, but the same cannot be said for TSLA or GME.",
        "created_utc": 1621703566,
        "id": "gz2n6e7",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1621732366.0
    },
    {
        "author": "TheMajorMedic",
        "body": "Couple of good ones with decent dividends and decent growth potential for the long-term: KR, KHC, CSCO, PM",
        "created_utc": 1622331486,
        "id": "gzx85ch",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622360286.0
    },
    {
        "author": "dr-scanlon",
        "body": "Quarterly CSCO earnings runup has commenced today, hop in",
        "created_utc": 1620323466,
        "id": "gx6cgt5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620352266.0
    },
    {
        "author": "RichSteps",
        "body": "This post mentions: **$LUX, $ABML, $BNGO, $ESG, $ACCYY, $RAMP, $HEPA, $ZOM, $MVIS, $RAAS, $CPA, $PNG, $BAA, $CAGR, $GHG, $ESQ, $CSCO, $GRNBF, $CHRLF, $ETFM, $EIC, $PV, $ILED, $ALPP, $PVDG, $TSNP**\n\n/u/IcyRag3's account was created **2 years ago**. It has **147** comment karma and **25** link karma.\n\n-----\n\n^You ^may ^see ^tickers ^you ^didn't ^mention ^-- ^I'm ^casting ^a ^wide ^net ^because ^y'all ^don't ^always ^$TAG ^your ^ticker ^symbols.\n\n^This ^was ^an ^automated ^response. ^If ^you ^have ^feedback, ^please ^reply ^to ^this ^comment ^or [^(send me a message)](https://www.reddit.com/message/compose?to=RichSteps&amp;subject=bot%20feedback)^.",
        "created_utc": 1620423444,
        "id": "gxbkykd",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1620452244.0
    },
    {
        "author": "2CommaNoob",
        "body": "The only hold forever is the index ETFs or mutual funds.  Good companies have long lure periods of no stock movement.  Apple, MSFT, IBM, Intel, Qcom, F, GM, Xom, Cisco etc all have years long periods where the stock did absolutely nothing or even lost money.\n\nUnless you got into KO/JPM/BAC/Xom in the 70s; you are underperforming the general market.  It doesn't mean you can't hold individual stocks; you can do both.  Hold some ETFs and trade some stocks that you like.",
        "created_utc": 1620641061,
        "id": "gxlb4sc",
        "score": 1,
        "subreddit": "investing",
        "created": 1620669861.0
    },
    {
        "author": "night117hawk",
        "body": "My hospital still uses beepers from CSCO.",
        "created_utc": 1620649857,
        "id": "gxlmue8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620678657.0
    },
    {
        "author": "candidly1",
        "body": "MRK-CAT-JNJ-CSCO-PRU-MET.\n\nLike now. Never going to double overnight, but even an outright crash wouldn't kill me. Steady capital appreciation and divs. Boring.",
        "created_utc": 1620657923,
        "id": "gxm309b",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620686723.0
    },
    {
        "author": "krevtrading",
        "body": "There is a difference between making one chip and making 1 million chips, I would be careful making my investmentcase based off of that, I like their cloud computing though\n\nIt is hard measuring a company that is going to loose market share in the long run. I like INTC for paying dividends but I would like them even more if they wouldnt struggle so much on 7 and 5 nm chips. \n\nI do like CSCO alot, looks like they did alot better waking up from their deep sleep in comparison to others, though their software solutions seems no where near MSFT\n\nI like Belden too",
        "created_utc": 1620849262,
        "id": "gxw6r1d",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1620878062.0
    },
    {
        "author": "throwaway_jawpain",
        "body": "If your talking about individual stocks, yes! People lost their retirement. Look at Cisco and GE. People get shit on for saying don’t put your eggs in one basket but it’s true.",
        "created_utc": 1620849407,
        "id": "gxw73w1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620878207.0
    },
    {
        "author": "Rich265",
        "body": "Brokeback Mountain 2: The SPY Crash of 2021. \n\nCritics say: \"SPY, I wish I knew how to quit you.\"\n\nCisco &amp; Ebay gave it 2 thumbs up yours!",
        "created_utc": 1620831350,
        "id": "gxuyqzb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620860150.0
    },
    {
        "author": "swiss_watch",
        "body": "CSCO",
        "created_utc": 1620743151,
        "id": "gxqdk30",
        "score": 1,
        "subreddit": "investing",
        "created": 1620771951.0
    },
    {
        "author": "lyleberrycrunch",
        "body": "Except Cisco lol but yes in general this is true. Just DCA the entire time and reinvest dividends and you’ll basically always come out on top",
        "created_utc": 1621352475,
        "id": "gykwxis",
        "score": 1,
        "subreddit": "investing",
        "created": 1621381275.0
    },
    {
        "author": "boopymenace",
        "body": "Ok, was going to forget this thread then you start just talking out your ass. I don't get why you would make claims about consumers or everyday joe with this company? What are you even talking about?   \nNothing about 3d systems has anything to do with \"consumers\" nor \"everyday joe\" - Nothing they make is for \"home\" use and a most of their processes were not around 20 years ago. \n\nBreakthrough metallurgic technologies for example.   \n[https://www.3dsystems.com/case-studies](https://www.3dsystems.com/case-studies) \\- They have partnerships with tons of industries and the technology is in infancy. Implants, prototypes, glass printing, metal printing, dentistry, maps, models, cooling systems, remote manufacturing. It's all brand new. Partnerships with Lotus, Cisco, Airbus, Hankook, Daimler, Black &amp; Decker, Emirates, Nissan and tons more. It's applied tech and there are mutliple types of \"3d printing\", it's not just nerds making dnd figurines out of plastic. Gonna be left in the dust if you think it has anything to do with \"everyday joe\" or thinking it's the infancy it was 20+ years ago.   \n\n\n\\-- I just simply bought the stock at too high of a price.   \nI don't get why do people like you just make claims about stuff you clearly have no idea about. Why even speak at all about stuff when you just talk random junk that's totally off base? Never understood this type of thinking and behavior.",
        "created_utc": 1621378650,
        "id": "gymnl3g",
        "score": 1,
        "subreddit": "stocks",
        "created": 1621407450.0
    },
    {
        "author": "DividendJohn713",
        "body": "Hard to say the best stocks because every week option premiums change one week a stock can be good and then crap for the next 2 weeks.  But one I was checking out today is CSCO (Cisco) if you have 6k to play around with you can buy 100 shares under your budget and sell weekly covered calls.  I think the premiums on this stock at the moment are ok.",
        "created_utc": 1621478514,
        "id": "gyrz7nq",
        "score": 1,
        "subreddit": "options",
        "created": 1621507314.0
    },
    {
        "author": "Heavy-Busch",
        "body": "I have CSCO calls and boy did I choose death.",
        "created_utc": 1621506082,
        "id": "gyt0q5b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621534882.0
    },
    {
        "author": "Zachjsrf",
        "body": "That's why I played CSCO earnings today",
        "created_utc": 1621459479,
        "id": "gyqwvew",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621488279.0
    },
    {
        "author": "F10andTheHotKeys",
        "body": "u OK csco?",
        "created_utc": 1621461495,
        "id": "gyr1b5h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621490295.0
    },
    {
        "author": "pml1990",
        "body": "True. If you look at all the subs on each of the hype stock, everything is a screaming buy at every level of price. They cannot all be right. Everythingmoney's premise is you take a lot of risk investing in a high PE ratio for future gains that might never come. If AMZ's growth never materialized, you would have never heard about it from the investors who would have lost money. And for every AMZ who made it, there are 10 Cisco whose value are still below their ATH back in 2000. \n\nI don't think people on this sub remember how close AMZ were on the verge of bankruptcy from 2000-2004 and Ebay was dominant. Are people seriously thinking that they would have been able to hold AMZ through that period? Gimme a break.\n\nPoint is, you can't make investing decision, or any decisions for that matter, based on hindsight. Because, based on hindsight, going all in using margin on GME in Jan 2021 and sell at $500 would have been the best decision ever. Recommending against AMZ was the right decision from a value perspective (and probably is still correct, again, based on value).",
        "created_utc": 1621103783,
        "id": "gy8pebn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1621132583.0
    },
    {
        "author": "PijamaTrader",
        "body": "&gt;bears will be sorry. Tesla is Apple 20 years ago\n\nWith this comment is very clear that you have never worked with Cisco dinosaurs if you have the ball to put their name in the same sentence with Testa.",
        "created_utc": 1621111403,
        "id": "gy94iod",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621140203.0
    },
    {
        "author": "stillyoinkgasp",
        "body": "Cisco, Fortinet, Palo Alto, Crowdstrike, Cambium Networks, OKTA",
        "created_utc": 1621117524,
        "id": "gy9g7xq",
        "score": 1,
        "subreddit": "investing",
        "created": 1621146324.0
    },
    {
        "author": "futureIsYes",
        "body": "That is also what I am thinking. I am not trying to exit all at a loss. I was just trying to see which ones are not worth holding for a long time. Even companies like CISCO, which are greatly profitable companies, have yet to recover from the dot com bubble. So what are the chances that a company like EXPI will recover from this, considering it s still like 450% up from a year ago.",
        "created_utc": 1620986270,
        "id": "gy2yte9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1621015070.0
    },
    {
        "author": "Panther4682",
        "body": "If you brought and held Cisco at the top of the 2000 boom... you are still waiting to break even... time the market does have something to do with it. Buy cheap, sell high, park your emotions. Volatility only works for one group... insurance sellers.",
        "created_utc": 1620958922,
        "id": "gy1yd74",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620987722.0
    },
    {
        "author": "The_Folkhero",
        "body": "Don't get me wrong, I own Apple too, in equal weighting in my portfolio. But you hit upon it, % return wise there are better plays. Because isn't it % returns that we are chasing in stocks?! And I am willing, and have, been putting down a larger % on the smaller cap players.. That's why I am not overweight  Apple and am overweight smaller cap companies such as the \"baby FAANGs of Adobe, Salesforce, Intuit, and especially, out of FAANG, Facebook (which is not even at a trillion market cap). The Apple trees don't grow to the sky and stock physics apply. And great companies don't always get bigger - just look at the dead money that Microsoft was for a decade. Cisco is another company that was one of the largest stocks back in the day and today it is a relic of what it once was.",
        "created_utc": 1620828176,
        "id": "gxurjey",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620856976.0
    },
    {
        "author": "kpruhs",
        "body": "I would invest in a diverse collection of stocks that have a proven record of paying dividends. I'd look at the financial sector-banks and insurance (BMO, TD, CM, MCY, PRU, BAC, C, MA, CMA, BOH, MET, etc), utilities and fuel (KMI, MMP, NEP, BEP, XOM, D, SO, DUK, CVX, ED, PSX, ENB, PSX, RDSA, etc), technology (INTC, CSCO, IBM, IRM, T, CMCSA, VZ, ALGM, VOD, etc), bio pharma and health care (ABBV, GSX, BMY, CHCT, CVS, WBA, HCAT, JNJ, OHI, NHI, WELL, etc), and others from consumer products, entertainment, REITS, and business development.\n\nThere are a lot of good solid companies out there to provide secure returns. Unfortunately we often look for the next big thing that will turn $100 into $10,000 over night. We end up throwing a lot of money into longshots that never pay off.",
        "created_utc": 1620250567,
        "id": "gx2sfuq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620279367.0
    },
    {
        "author": "neothedreamer",
        "body": "Just started following you this last week.  I was doing great last week and then got kicked in the teeth on Shop, Zm, Amzn etc.  Down about 23%.\n\nAdded some Clne positions will add more next week if it looks like it has found a bottom but down 50% on Sept $12s.\n\nJumped into Pltr $22C for May 14th and 21st.  Bleeding.  I should have put stoplosses on it but thought it would go up more the next day.  Saw the exit at about 15% gain but let it ride next day. Lesson learned, always stoploss to secure profit, minimize loss. Hoping for a solid Monday or I will have to cut losses.\n\nAlready been in Baba for a while running PMCC, going to expand position and be careful of how far otm the CC are in case it runs.\n\nSame with Aapl.\n\nAdded some CAT today.  Going to set stoploss on Monday and see if it will run anymore.  Saw that you just exited. Even right now.\n\nAdded KMI, seems to be solid.  PMCC on this one because is seems to be a tortoise stock (slow and steady) with good gains already.\n\nOn the wrong side with Tsla, TSM, Pton, Twtr (after drop).  Looking to exit about where you want to short it. TSM seems to be a good PMCC stock because it just hangs around $115 to $122.\n\nPlanning to add ON Long and some shorts on PCG, Dash, Bynd, Afrm, Cisco, QS next week.\n\nAlso saw a comment earlier that ZM is a buy under $300 but I have been bleeding on it the last week just got out yesterday. Looks like it is in a downward trend down.  Also tech and market hates tech right now, any thoughts? Enter a long position with tight stoploss?",
        "created_utc": 1620450506,
        "id": "gxcwrfx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620479306.0
    },
    {
        "author": "Saucy_mattsi",
        "body": "As long as you don’t buy the very tip of an extremely overpriced bubble (msft or Cisco or Amazon in 2000) you will recoup after 3-4 years at most. So yeah overall time in market &gt; timing market",
        "created_utc": 1620161989,
        "id": "gwy4tba",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620190789.0
    },
    {
        "author": "antiproton",
        "body": "Big numbers in a vacuum are meaningless. Amazon has a PE of 65. Apple, Microsoft and Google have PEs around 30. \n\nA company can make a lot of money and still be overvalued.",
        "created_utc": 1619906242,
        "id": "gwlbzss",
        "score": 25,
        "subreddit": "investing",
        "created": 1619935042.0
    },
    {
        "author": "Mattya929",
        "body": "Microsoft isn’t a FAANG but their cloud business (Azure) still has huge room to grow. IT services is a $5 trillion industry and is going to grow at 5-10% annually for the foreseeable future. Cloud specifically is expected to grow at 20% annually. Microsoft and Amazon with AWS still have huge room for growth over the next 10 years.",
        "created_utc": 1619873127,
        "id": "gwja085",
        "score": 22,
        "subreddit": "investing",
        "created": 1619901927.0
    },
    {
        "author": "ReadStoriesAndStuff",
        "body": "Apple dropped like a rock after the initial climb after hours on announcement to much lower.  Its down from 137 to 131.  Microsoft dropped from 262 to 251.",
        "created_utc": 1619973021,
        "id": "gwogpkt",
        "score": 21,
        "subreddit": "investing",
        "created": 1620001821.0
    },
    {
        "author": "Fantastic98",
        "body": "I'm definitely looking to add more Microsoft and Apple.",
        "created_utc": 1619921512,
        "id": "gwm4k84",
        "score": 20,
        "subreddit": "stocks",
        "created": 1619950312.0
    },
    {
        "author": "daynightcase",
        "body": "It is, but Microsoft deserves to be in that list more than Netflix. Netflix has peaked. I think most will agree with that.",
        "created_utc": 1619919971,
        "id": "gwm1vvz",
        "score": 19,
        "subreddit": "stocks",
        "created": 1619948771.0
    },
    {
        "author": "Summebride",
        "body": "It's actually not.  That's the biggest myth in the industry, created and indoctrinated by those who want you to think active participation and awareness are impossible and bad... and so you just close your eyes and trust them instead.  For a fee.  And if they fail, don't blame them, because... \"You can't time the market!\"\n\nNotice that every bank, mogul, institution, fund, billionaire, millionaire, pension, sovereign, university, muni, hedge, family office, farmer, corporation, money manager, insurer on earth devotes most of their resources and personnel to spending 24x7x365 timing the market.  Yet they tell you \"it doesn't work\".\n\nIt's nonsense.  Even the lemmings who believe and spread it don't accept the myth in any other aspect of their existence.  They time the market looking for Black Friday sales.  They sell their house when the market is hot, and they try to buy a snow shovel in the spring when it goes on clearance.  The farmer keeps his crop in a silo waiting on the peak price, and the car buyer tries to grind for a better deal near month end when the dealer is supposedly more motivated.  When soup goes on sale, we buy a bunch of extra cans.  \n\nLiterally everything in our life is governed by \"timing the market\" yet we're supposed to believe it doesn't work when it comes to the actual, literal market?  \n\nHogwash.  \n\nIt was more than possible to time the market when Disney stock dropped under $80 and MSFT dipped to $130.  And it was pretty obvious when Palantir popped to $45 during the GME frenzy, it was appropriate to \"time the market\" and cash that in.\n\nTiming the market absolutely does work.",
        "created_utc": 1619911192,
        "id": "gwlm0dd",
        "score": 14,
        "subreddit": "stocks",
        "created": 1619939992.0
    },
    {
        "author": "Calichurner",
        "body": "His investment managers did that. He still doesn't understand technology. He had great access to MSFT and INTC top guys right from the beginning and still missed out on great opportunities. Maybe Bill Gates didn't do a good job of explaining about his company to Warren. \n\nAs Peter Lynch said, Bill could have told \"Warren, computers are like cars and the operating system is like the gas station and I own all the gas stations in the world.\" That would have done it :)",
        "created_utc": 1619924783,
        "id": "gwma1dz",
        "score": 13,
        "subreddit": "SPACs",
        "created": 1619953583.0
    },
    {
        "author": "michael_curdt",
        "body": "2020 was pretty much free money. Please don’t get used to that. That said, I am really sorry to admit that your picks are below average at best. Stock picking is not for everybody, especially if you are new to the game. If I were you, I would sell them and pick up quality companies so I can sleep better at night. \n\n“What exactly should I buy?”\n\nWhy not the big tech? AAPL, AMZN, MSFT, FB. That’s a portfolio you will be proud of come rain or shine. \n\n“But those are boring household names. I want to pick somewhat riskier stuff in hopes of better returns.”\n\nEven in this case, I suggest you diversify 60% of your portfolio in large companies with solid fundamentals and take meaningful risks with the remaining 40%. \n\n“I lost faith in individual stocks. It’s not my cup of tea”\n\nFine, roll with ETFs! SPY, QQQ, XLY, VNQ etc. They contain hundreds of good companies within them, so you will fall and rise with the market. Won’t be your fault anymore. \n\nWhy not a mix of everything above? \n\nFrom your picks it appeared like you are into penny stocks. That’s a big no-no in my books. Don’t be afraid to purchase few shares of an expensive stock. You want to own good companies, not a lot of shares of junk. \n\nJust keep in mind that anything that goes up quickly will fall back as quickly. So don’t give into hype. Slow and steady will win you the race. \n\nThat said, I am glad to see that you started investing at the age of 20. I wish I did that. Good days are ahead of you. All the best!",
        "created_utc": 1619995898,
        "id": "gwpx2zk",
        "score": 12,
        "subreddit": "investing",
        "created": 1620024698.0
    },
    {
        "author": "ThedanishDane",
        "body": "Straigth out the gate, i'm honestly undecided/unsure on whether you or OP will end being right.   \nHowever, the difference between now and 1999 is that the growth companies of today actually make money, and A LOT of it. Facebook, Apple, Microsoft, Amazon, Google and the likes have shown that they either are, or have proven that they can be, hugely profitable compared to essentially all other companies of the past.   \nAnd because we have seen these examples, in the case of interest rate hikes, investors will be much more patient with their investments in \"zombie-companies\". I mean sure, several would collapse and we would see some retraction from specific companies like Wework, Uber and the like. I don't think interest rate hikes would cause the massive crash that many people seem to think.   \n\n\nBut i'm honestly conflicted, because i feel like there's some aspect to theories above that i haven't heard, or more likely don't understand. I'm also much more worried (from an investor standpoint) about government regulation as i feel a increasingly growing sentiment to regulate data privacy and to a lesser extent monopoly/oligopolies.",
        "created_utc": 1619864441,
        "id": "gwizez3",
        "score": 11,
        "subreddit": "investing",
        "created": 1619893241.0
    },
    {
        "author": "NotMeUsOrBust",
        "body": "Microsoft was in my mutual funds along with Monster and Best Buy - value and large cap managed ones.  Those funds  were underperforming for a while but in the past few years they all seemed to have their day and ‘catch up’.",
        "created_utc": 1619871812,
        "id": "gwj859r",
        "score": 11,
        "subreddit": "investing",
        "created": 1619900612.0
    },
    {
        "author": "Account917",
        "body": "BUY SONY at $100 or i could buy the supplier who makes the parts for sony and appl for a far cheaper price.  Foxconn $8.16.   AKA:  HNHPF also makes the parts for XBOX (MSFT).  and they are positioning themselves for 5G with patents.   True they are not listed on NYSE, you have to buy GDR through TD Ameritrade.  All true.  but i like the stock that makes the parts for the APPL iphone, and the parts for SONY playstation, and parts for MSFT xbox, many others, etc...  I have been holding a 100 share position for a long time. Finally seeing some movement. +17% YTD.",
        "created_utc": 1620016683,
        "id": "gwqx9dn",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1620045483.0
    },
    {
        "author": "Waitwhonow",
        "body": "If ANYTHING we have learnt in this market in the past 4 months.\n\nIf it rises fast- it will fall faster( most low/mid cap stocks are totally crushed and still havent recovered- and these companies actually make Atleast ‘ something’  tangible)\n\nCrypto is not going to be any different.\n\nIts on its own cycle- but it will happen.\n\nAlso- the Mega cap companies like Amazon, msft are now calling for Crypto regulation- to combat the ransomware problem.\n\nIt will be a hard hard drop when that happens( and its a matter of WHEN- no IF)\n\nElon is responsible for this shitcoin rally.",
        "created_utc": 1619919290,
        "id": "gwm0o80",
        "score": 10,
        "subreddit": "StockMarket",
        "created": 1619948090.0
    },
    {
        "author": "BetweenCoffeeNSleep",
        "body": "“Significant” is subjective, which can contribute to variance in answers. There is more money entering the markets now than ever, with most of it still going to stocks. As of right now, Bitcoin and Ethereum combine to be about 1.5 trillion in market cap, which makes them  less valuable in total than Microsoft. I offer that primarily for scale perspective, though the explosive growth of the crypto space is noteworthy.",
        "created_utc": 1620044355,
        "id": "gwrvwgu",
        "score": 9,
        "subreddit": "stocks",
        "created": 1620073155.0
    },
    {
        "author": "financialsfyi",
        "body": "Top stock mentions on r/wallstreetbets in the last 24 hours (Not investment advice)\n\nCharts:\n\n* Breakdown by flair: [https://i.imgur.com/xMxA437.png](https://i.imgur.com/xMxA437.png)\n* Price change percentage: [https://i.imgur.com/LR0uNzc.png](https://i.imgur.com/LR0uNzc.png)\n* Trading Volume: [https://i.imgur.com/l1rGgV9.png](https://i.imgur.com/l1rGgV9.png)\n\n|Symbol|Total Mentions|Price &amp; Change|Trading Volume|Market Cap|\n|:-|:-|:-|:-|:-|\n|GME|218|173.59 -1.48%|4.43M|12.29B|\n|MVIS|190|15.25 -15.28%|74.01M|2.41B|\n|BTX|126|49.80 +45.53%|54.57M|148.24M|\n|SPY|105|417.30 -0.66%|85.53M|361.16B|\n|CLOV|93|9.85 -3.15%|17.44M|4.34B|\n|AMD|86|81.62 -2.73%|46.6M|99.17B|\n|TSLA|71|709.44 +4.79%|40.76M|683.43B|\n|AAPL|59|131.46 -1.51%|109.84M|2.19T|\n|PLTR|57|23.04 -1.41%|24.72M|40.37B|\n|RKT|45|22.45 -1.97%|3.73M|2.59B|\n|AMC|45|10.03 -1.67%|27.74M|4.52B|\n|NIO|33|39.84 +2.18%|116.73M|62.11B|\n|NOK|32|4.68 +0.21%|67.01M|26.56B|\n|VIAC|30|41.02 -1.16%|20.59M|26.67B|\n|OCGN|28|12.67 +5.94%|164.4M|2.38B|\n|VXRT|28|10.78 +17.05%|112.22M|1.27B|\n|AMZN|26|3,467.42 -0.11%|7.01M|1.75T|\n|BB|21|8.83 -2.54%|6.14M|4.99B|\n|PSFE|21|13.80 -0.29%|4.01M|2.02B|\n|APHA|20|15.38 -0.45%|16.31M|4.87B|\n|CLNE|18|11.00 -3.00%|3.46M|2.2B|\n|TWTR|18|55.22 -15.16%|88.38M|44.1B|\n|CRSR|14|33.18 -3.21%|941.25K|3.05B|\n|COIN|13|297.64 +0.97%|4M|77.77B|\n|MSFT|13|252.18 -0.13%|30.95M|1.9T|\n|TLRY|13|18.34 -1.66%|19.25M|3.29B|\n|QQQ|12|337.99 -0.66%|38.26M|163.18B|\n|BABA|12|230.95 -1.38%|9.33M|624.87B|\n|DKNG|10|56.66 -1.39%|10.67M|22.53B|",
        "created_utc": 1619889436,
        "id": "gwk8mck",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1619918236.0
    },
    {
        "author": "AutoAdviceSeeker",
        "body": "Just print it out off Microsoft word lol and give them the info to access the stock",
        "created_utc": 1619923299,
        "id": "gwm7lm8",
        "score": 8,
        "subreddit": "stocks",
        "created": 1619952099.0
    },
    {
        "author": "Troflecopter",
        "body": "It’s all about the differences in expectations.\n\nFor example: Everyone knew Microsoft and apple were doing great, so the solid earnings reports didn’t do anything for them. In fact, people who were even more optimistic and looking for a quick pop sold instead.",
        "created_utc": 1619972849,
        "id": "gwoga9o",
        "score": 8,
        "subreddit": "stocks",
        "created": 1620001649.0
    },
    {
        "author": "Niceguyy81",
        "body": "Msft, F, AMD this week 🚀",
        "created_utc": 1620030021,
        "id": "gwrcunp",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620058821.0
    },
    {
        "author": "Historical-Egg3243",
        "body": "hope this is the bottom for MSFT....",
        "created_utc": 1620039084,
        "id": "gwrnkzo",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620067884.0
    },
    {
        "author": "LibraryUserOfBooks",
        "body": "Seems like Netflix is easily replaceable (Amazon video, Disney +, Paramount, etc).\n\nEvery internet search begins with Google. And YouTube tells me how to do everything.\n\nEveryone buys everything from Amazon.\n\nWhen you use computers and phones, it is going to be Apple, Microsoft or Chrome/Android.\n\nPlus all the other stuff they do.\n\nI don’t get Facebook/ Instagram / WhatsApp as irreplaceable.  Snapchat, Twitter, and TikTok sort of show that there are lots of other social media things that can come along and take people’s attention away.\n\nI dunno.  For me it is MAG I guess or GAM.  \n\nAm I missing something?",
        "created_utc": 1619932709,
        "id": "gwmlyd1",
        "score": 6,
        "subreddit": "stocks",
        "created": 1619961509.0
    },
    {
        "author": "Even-Function",
        "body": "MSFT",
        "created_utc": 1619859899,
        "id": "gwiutwy",
        "score": 6,
        "subreddit": "stocks",
        "created": 1619888699.0
    },
    {
        "author": "Palantaylor-swift",
        "body": "Obligatory «calls on msft»",
        "created_utc": 1619993384,
        "id": "gwps5ud",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620022184.0
    },
    {
        "author": "CadetCovfefe",
        "body": "Buffett keeps lamenting that Berkshire's size makes it difficult to move the needle. When they finally backed up the truck with Apple, it was a HUGE success for Berkshire. Not sure why Buffett would want to sell any of it. Buffett also has behemoths, money making machines like Amazon, Alphabet and Microsoft available for Berkshire to deploy some of their cash with. IIRC Buffett said he won't invest in Microsoft because of his friendship with Gates, but that still leaves Amazon and Alphabet. They have only a very tiny position in Amazon. Something like Costco is available as well. For some reason after 20 years of ownership Buffett actually sold that one recently.",
        "created_utc": 1619904852,
        "id": "gwl8iiz",
        "score": 6,
        "subreddit": "stocks",
        "created": 1619933652.0
    },
    {
        "author": "shiverstar",
        "body": "Aapl and Microsoft",
        "created_utc": 1619890482,
        "id": "gwkb6cu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1619919282.0
    },
    {
        "author": "Investing8675309",
        "body": "Do the printing of a fake certificate and put the certificate number on it. If they lose the actual certificate it is a massive and expensive headache to replace (just went through this with MSFT). You want the brokerage or holding company to hold the book shares.",
        "created_utc": 1619924748,
        "id": "gwm9z9n",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619953548.0
    },
    {
        "author": "ChestyMenace",
        "body": "I'm not a cybersecurity expert, but I am a software engineer working for a Fortune 50 company, so I do have a little insight as it pertains to my job. To my knowledge, we do not use any of the products mentioned thus far. The only thing we do use related to this space would be Fastly, but I don't expect that to last. We have many dedicated teams that produce and create their own tools, phasing out the need for 3rd-party solutions. There is a ton of competition in this space and I'm not aware of anything that sets one apart from the other besides simple name recognition. Someone willing to do a lot more DD could easily refute me, but I don't believe any of these companies have much of a moat and even so, they are one failure away from dropping off a cliff. MSFT will survive the recent hack. SolarWinds maybe not so much. Shell, Kroger and a number of others were hacked, they will all survive, but the cyber security company Accelion who is responsible for the vulnerability, who knows. Cybersecurity investment comes with a lot of speculation, and I would caution you against investing in any of these companies long term.",
        "created_utc": 1619873510,
        "id": "gwjakj5",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619902310.0
    },
    {
        "author": "DPX90",
        "body": "I don't really want to argue your main point, but this made me laugh:\n\n&gt;...and the winners of the dot com crash , like Apple, Microsoft and Amazon, have outperformed everything...\n\nI mean dude, you deliberately use survivorship bias as an argument. Like Petsdotcom, Webvan or even Cisco didn't exist.\n\nSome of the really high quality companies like Google or Amazon will most likely not \"collapse\", they will either just correct or have very little returns if you buy them at their current prices. But even this is not sure. Cisco was and is a great company, yet it has never recovered to pre-dotcom levels, and you were in the red with Amazon too for like a decade if you bought at highs before the collapse.\n\nFor shittier companies that are valued to tens of billions of dollars without making a single dime of profit, there will be a rude awakening, or at least for their investors.\n\nAddressing your last paragraph, I might be relying on \"outdated financial discipline viewpoints\", whatever the fuck that is (it sounds like you're essentially saying the \"this time it's different\" bs), but at least I'm not relying on hindsight bias and survivorship bias to formulate my models.",
        "created_utc": 1619872379,
        "id": "gwj8xi0",
        "score": 5,
        "subreddit": "investing",
        "created": 1619901179.0
    },
    {
        "author": "Kramer-Melanosky",
        "body": "Microsoft definitely is not trading at a low multiple.",
        "created_utc": 1619950261,
        "id": "gwn4zuw",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619979061.0
    },
    {
        "author": "therealcosmicl",
        "body": "My msft calls can only fucking hope.",
        "created_utc": 1619950868,
        "id": "gwn5mp8",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1619979668.0
    },
    {
        "author": "OliveGardenSalad",
        "body": "MSFT $255 eod please?",
        "created_utc": 1620046328,
        "id": "gwrzixd",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620075128.0
    },
    {
        "author": "dharde1",
        "body": "How about the only one not affected by the Solar Winds and Microsoft hacks, BB! Or the one that protects the most critical governmental infrastructure - man did they need to spend money on marketing...",
        "created_utc": 1619873036,
        "id": "gwj9vbc",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619901836.0
    },
    {
        "author": "DerpFackingValue",
        "body": "Good boomer stock? Do you think boomer stock means a stock that might boom? It doesn’t. It means a stock that is old fashioned and reliable. Like apple or Microsoft.",
        "created_utc": 1619999155,
        "id": "gwq3520",
        "score": 5,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1620027955.0
    },
    {
        "author": "illusiveab",
        "body": "Many reasons: run-up, profit-taking, risk management, AAPL's pending lawsuits. No one is looking at a company like AAPL and wondering if it's incredibly sensitive or overvalued to one multiple. No one cares, cash flow is king and AAPL crushes that aspect. The same thing happened to MSFT, which has more secure debt than the US Gov. It's just a part of the market's ebb and flow, buy the fuckin dip.",
        "created_utc": 1619887466,
        "id": "gwk3wxn",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1619916266.0
    },
    {
        "author": "Cowhead32",
        "body": "Microsoft was oversold fyi",
        "created_utc": 1620012589,
        "id": "gwqr4da",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620041389.0
    },
    {
        "author": "goldencroc",
        "body": "This is a very dynamic industry atm and stock cases can change dramatically. Eg. Solarwinds. \n\nBut as an I.T professional the companies I  see used in real life are CrowdStrike and Zscaler. I would also add Microsoft to the list too. \n\nI personally own some Crowdstrike, alot of Microsoft and rest are in cybersecurity etfs",
        "created_utc": 1619860412,
        "id": "gwivcbw",
        "score": 4,
        "subreddit": "stocks",
        "created": 1619889212.0
    },
    {
        "author": "poopiegrowz",
        "body": "you should buy the top 10 stocks on the S&amp;P 500 to maximize your potential returns.\nAAPL\nMSFT\nAMZN\nFB\nGOOGL\nTSLA\nBRK.B\nJPM\nJNJ",
        "created_utc": 1619913966,
        "id": "gwlr3u5",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1619942766.0
    },
    {
        "author": "Dowdell2008",
        "body": "Definitely max out your 401k!  And then open ROTH Ira and max that out as well at $6k/yr. \n\nI am in the same boat as you with index funds. Staying away from APPL and MSFT and making some other pays on European energy companies.  Not saying that’s the smart thing to do. Just getting a bit maxed out with Apple.",
        "created_utc": 1619967780,
        "id": "gwo3cw4",
        "score": 4,
        "subreddit": "stocks",
        "created": 1619996580.0
    },
    {
        "author": "Deep-fucking-values",
        "body": "Space out your money. I’d say $250 in 4 companies. Like apple. Microsoft etc. good stable companies to keep your money safe while you learn more",
        "created_utc": 1619988547,
        "id": "gwpigqw",
        "score": 4,
        "subreddit": "RobinHood",
        "created": 1620017347.0
    },
    {
        "author": "Reduntu",
        "body": "We use microsoft teams except for large gatherings where we want everyone on camera, then its zoom. So like 99% teams.",
        "created_utc": 1620009888,
        "id": "gwqml0b",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620038688.0
    },
    {
        "author": "Pikachu87",
        "body": "Sold PLTR and it went green for 4 days in a row. Bought back in and it instantly turned red.\n\nBought MSFT and it dipped too. 🤡🤡",
        "created_utc": 1620043609,
        "id": "gwruojn",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620072409.0
    },
    {
        "author": "Broad_Remote499",
        "body": "The concept of margin of safety involves having a margin between price and value in case your calculations of value are incorrect. For instance, if you see a company priced at $90 and you think it’s true value is $100, there’s not much margin of safety (if you were slightly off and it’s true value is actually $90 instead of $100, you aren’t getting a deal). On the other hand, a company priced at $10 which you see as worth $100 has a huge margin of safety. Even if you were off dramatically and it’s true value is $50, you have bought the company at a great price.\n\nPrice to book ratio uses tangible assets, which in the early 20th century America (think Ben Graham) was highly correlated with earning power due to the American economy being more industrial than it is today. Think of companies like Microsoft, Facebook, or Google which need relatively little tangible assets to generate revenues via online advertising, selling subscriptions, etc. Business value is generally accepted to be the present value of future cash flows, so the value of tangible assets today are very dependent on the industry in which a company operates.",
        "created_utc": 1619981161,
        "id": "gwp2zm5",
        "score": 4,
        "subreddit": "ValueInvesting",
        "created": 1620009961.0
    },
    {
        "author": "bobbycaldwellskid",
        "body": "No big secret and nothing special. My biggest is Qqq. Also have MDYG, SLYG, ARKK, SMH, SCHE. Large positions (relative to my portfolio) in Amazon, Apple, Microsoft, Nividia. I have no plans on selling anytime soon. Just hold and continue to put in my monthly amount.",
        "created_utc": 1619961901,
        "id": "gwnquik",
        "score": 4,
        "subreddit": "investing",
        "created": 1619990701.0
    },
    {
        "author": "Lifeiscrazy101",
        "body": "Manulife is one that is very boring but is priced fairly right now. \n\n\nApple, Google, Microsoft are all boring for alot of people.",
        "created_utc": 1619924298,
        "id": "gwm99e3",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1619953098.0
    },
    {
        "author": "drdois",
        "body": "Apple and Microsoft",
        "created_utc": 1619925240,
        "id": "gwmarrl",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619954040.0
    },
    {
        "author": "consultant_25",
        "body": "Start -&gt; All Programs -&gt; Microsoft Office -&gt; Microsoft Excel",
        "created_utc": 1620006314,
        "id": "gwqg630",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620035114.0
    },
    {
        "author": "Karnes",
        "body": "&gt;\"The brand and the product, it's an incredible product. It's a huge, huge bargain to people. I mean the part it plays in their lives is huge.\n\nThis is the kind of thinking that US lawmakers have to understand.  Positions like Josh Hawley that want to hamstring AAPL/MSFT/GOOG/etc. by preventing them from acquiring new companies does nothing but give companies outside the US a MASSIVE ADVANTAGE.  \n\nShould large companies have free-reign... Absolutely not.  But if you stick them on a 2 inch leash everyone gets hurt.  Had a policy like that been around at the dawn of APPL and the others the US would now be behind the rest of the world on the technology front, rather than the leader.  And we'd probably all still be flip-phones.",
        "created_utc": 1619919399,
        "id": "gwm0vcz",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619948199.0
    },
    {
        "author": "therealcosmicl",
        "body": "Listen im not asking for anything crazy, just msft 300 eow. Maybe ill ask nancy to buy some",
        "created_utc": 1619998869,
        "id": "gwq2m57",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620027669.0
    },
    {
        "author": "yeti_man82",
        "body": "Maybe DE, NVDA, MSFT, SQ, and PYPL.",
        "created_utc": 1619994790,
        "id": "gwpux6q",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620023590.0
    },
    {
        "author": "turkeychicken",
        "body": "The problem is trying to guess which companies are going to outperform \n\na. your index funds\n\nb. AAPL, MSFT, GOOG, etc\n\nIf you own something like VOO, AAPL is currently its largest holding at under 6%.  If AAPL stock goes on a run, VOO is going to rise considerably less than straight up owning AAPL.\n\nThe main question you need to ask yourself is if you think you can pick the next AAPL, GOOG, AMZN, MSFT, etc.  If the answer is yes, then it might be better to sell off your current positions in AAPL and MSFT and invest in those.  \n\nIn my opinion, AAPL and MSFT are very safe bets for the time being.  The market is really whacky right now and I would be hesitant to sell those in favor of some other small or mid cap stock that you hope might one day join the ranks of the big boys.",
        "created_utc": 1619960746,
        "id": "gwnojde",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619989546.0
    },
    {
        "author": "CCYCN",
        "body": "161% cumulative over 3 years, 76% over 1 year.\n\nUsed margin a bit to leverage up in March last year.  Most of the returns were from tech (MSFT/AMZN/GOOG/SPOT/TCEHY/etc) but my biggest winner was going all in on Berkshire when it dropped below $180 last June.",
        "created_utc": 1619963107,
        "id": "gwntbjj",
        "score": 3,
        "subreddit": "investing",
        "created": 1619991907.0
    },
    {
        "author": "Filler9000",
        "body": "Sometimes I'm in a big house and crossing a bridge inside the house. I'm being chased but I know the person. It's this cat and mouse if that person is trustworthy or trying to murder me. But like I know I'm dreaming but if I get murdered I won't wake up. I can like chant wake up and on the 4th try it works. And then I wake up and write in my dream journal: \"buy more msft calls\" And that's how I'm in this mess.",
        "created_utc": 1619953434,
        "id": "gwnalyt",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619982234.0
    },
    {
        "author": "Pikaea",
        "body": "He never invested in MSFT as people would assume Bill Gates is letting him know non-public information.",
        "created_utc": 1619953670,
        "id": "gwnb9y6",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1619982470.0
    },
    {
        "author": "Josefstalion",
        "body": "Depends on your risk tolerance.  I'm 24 and just started with QS, I'm looking to go a little \"riskier \"but my portfolio is looking something like 20% VGRO, which is basically VEQT but with 20% bonds for security, then 80% stocks/ETFs.\n\nSome Canadian ETFs I like are: \n\nDATA.TO, it's a cloud computing ETF whose main holdings are Amazon, Google, and Microsoft, among others\n\nBTCC/ETHH, bitcoin and ethereum ETFs that directly track price, with the exception of management fees\n\nZCLN, clean energy index ETF\n\nI don't hold too many Canadian stocks, the ones I do are small-cap healthcare and weed companies, so I'm not sure if those are to your liking",
        "created_utc": 1619911528,
        "id": "gwlmms6",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1619940328.0
    },
    {
        "author": "NoGameNoLyfe1",
        "body": "Yes I strongly believe this as well. MSFT endpoint detection and response is very impressive. They have launched a new admin dashboard that is less complicated and combines many of their security related features into one; the endpoint manager. They have good data sources to take advantage of their AI ML cloud stuff for detecting malicious activities. Very bullish on them personally",
        "created_utc": 1619865315,
        "id": "gwj0bve",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619894115.0
    },
    {
        "author": "daynightcase",
        "body": "Apple has the lowest R&amp;D spend among big tech. I am not kidding, look it up\n\nQ2 2020 numbers\nAAPL- $4.8 (7% of their recenue)\nMSFT - $5.2 (14% of their revenue)\nGOOG - $6.2 (16% of their revenue)\n\ni have to look up amazon numbers but AAPL has spent so much cash on stock buy backs its nuts. They are the least risk taker in this industry. Call me crazy but thats how you lose dominance over time. Their ecosystem is thriving beyond any measure so they feel comfortable\n\nWe will see how that pays off. I am more bullish on MSFT, AMZN and GOOG who are not afraid to take risk and throw shit at wall until something sticks.",
        "created_utc": 1619970983,
        "id": "gwobiwt",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619999783.0
    },
    {
        "author": "RelevantPound1",
        "body": "There was a point that Microsoft couldn’t get past $200, now y’all am can’t believe it won’t hit $260",
        "created_utc": 1620012708,
        "id": "gwqrb7h",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620041508.0
    },
    {
        "author": "prasithg",
        "body": "Hey man really appreciate this writeup and the work this must have took.  You've done a great rundown of the tech and I agree it is appealing but what about the 800lb gorilla in the room AWS (and the 100lb ones GOOG/MSFT).\n\nAWS has Route53 and Cloudfront and have been taking lots of marketshare from cloudflare of late.  I can anecdotally confirm from my tech peers.  Also many large companies prefer one vendor and AWS is also cheaper to boot.\n\nAs you know Managers/Execs aren't often tech-savvy and many wouldn't even understand the benefits of Fastly and simply go with AWS.  I do like Fastly and will probably pick some up but i'm not sure how they will do in a tech downturn combined with competitive pressure from the gorillas.  Thoughts?",
        "created_utc": 1619990749,
        "id": "gwpmxu8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620019549.0
    },
    {
        "author": "new_pr0spect",
        "body": "Yea man you need some stalwarts in there like MSFT, maybe Visa?  \n\n\nAs far as growth picks, you don't have to pick the most speculative ones to make good money, PayPal for example is on track to double revenue by 2025 to 50 billion from the 20 billion range it has currently, so there's a good example of a well established company that oozes money and will be doing so more and more.  \n\n\nCommodity plays are tough and I consider shrooms/weed as commodities.",
        "created_utc": 1619966423,
        "id": "gwo05g1",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1619995223.0
    },
    {
        "author": "djb25",
        "body": "“Just in case our plan to compete with Microsoft and Sony in the online game delivery business doesn’t play out, we’re also going head-to-head with Facebook.”",
        "created_utc": 1620006584,
        "id": "gwqgnxw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620035384.0
    },
    {
        "author": "deca-d",
        "body": "AMD, AAPL, and MSFT. A 20% increase in food stamps is like $7237 nation-wide. people still and always will get new phones, the world needs chips, and Microsoft is basically a virus on every single piece of hardware that exists.",
        "created_utc": 1620003711,
        "id": "gwqbhao",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620032511.0
    },
    {
        "author": "95Daphne",
        "body": "To be very fair, those times had other things going on. Election Week followed the last week of October and during late January volatility was a complete mess because of memapalooza. Like I told somebody else, Microsoft likely would have jumped after their January earnings report, but instead we had a market selloff that cancelled their jump because volatility was a complete mess.\n\nThere wasn't a heck of a lot going on with this case last week (at this point with the same thing being repeated for months, FOMC isn't much of an event), outside of maybe the market makers getting a big win in mostly crushing all of the options. \n\nMaybe we will see a move higher though, it'd make sense as it'd be the move that nobody expects.",
        "created_utc": 1620005099,
        "id": "gwqdz9x",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620033899.0
    },
    {
        "author": "Successful-fail-bro",
        "body": "Don’t forget Microsoft",
        "created_utc": 1619877229,
        "id": "gwjgkpe",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619906029.0
    },
    {
        "author": "LeSeanMcoy",
        "body": "I don't know if anecdotal evidence is the best way to choose who you invest in haha.\n\nThat would be like having Windows crash on you and saying \"ahh, Microsoft is a bad stock. I'm never investing.\"",
        "created_utc": 1619909308,
        "id": "gwlij9i",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619938108.0
    },
    {
        "author": "Pmbolly",
        "body": "Apple, Microsoft, Amazon, Google, Disney, Nike, Coke",
        "created_utc": 1619855555,
        "id": "gwiqdzc",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619884355.0
    },
    {
        "author": "UsefulReplacement",
        "body": "Microsoft has a big elephant in the room and that is the fact that their Desktop OS market share in the US has declined every year for the last 10 years and they never had any success with mobile. Went from 90% Windows to 60% within the decade.\n\nI feel like many people are sleeping on that one when they talk about MSFT as a long term hold. Sure, it's diversified, but how comfy are you about their future prospects if their leading product goes from 60% to 30% within the next decade?",
        "created_utc": 1619876642,
        "id": "gwjfiim",
        "score": 2,
        "subreddit": "investing",
        "created": 1619905442.0
    },
    {
        "author": "VictorDanville",
        "body": "Do you still expect big tech to outperform the market? Apple isn't going up from earnings anymore. It seems like only EV development would move it up at this point. Who knows how much more Google and Microsoft will go up.",
        "created_utc": 1619899091,
        "id": "gwkutm8",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619927891.0
    },
    {
        "author": "BestUdyrBR",
        "body": "Same. Unless something changes with the fundamentals that I'm very bullish on, I'm pretty sure stocks like Microsoft and Amazon won't crash. Robinhold blocking buying on a handful of stocks for two days makes no impact on me.",
        "created_utc": 1619901406,
        "id": "gwl03rq",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619930206.0
    },
    {
        "author": "CryptoDealerrrr",
        "body": "I’m gonna try to invest the money i can for now on into safer Index Funds and stuff since i’m loaded up on actual equity stocks rn, it’s all high market cap tho like APPL, MSFT, TSLA, DIS, etc, those make up a decent chunk, but i feel like if i start focusing on index funds for a while I’ll have that kind of a moderate risk portfolio where if one of those stocks runs i’ll be happy with over moderate returns, but if it falls ill be okay with manageable losses.",
        "created_utc": 1619904132,
        "id": "gwl6om9",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619932932.0
    },
    {
        "author": "notbrokemexican",
        "body": "Thanks. Sometimes it's just a matter of paying attention to competitive environments to catch these kinds of things. Some other things I really believe will attempt to happen:\n\n- Fastly acquired by google \n- Pinterest acquired by Apple (microsoft has integrated Pinterest into Edge)\n- Apple attempts to acquire Roblox\n- Roblox attempts to acquire a major toy manufacturer\n- Square acquires Soundcloud or enters housing markets.",
        "created_utc": 1619924559,
        "id": "gwm9ofs",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619953359.0
    },
    {
        "author": "grizzlytalks",
        "body": "I understand your scope now. Thanks.\n\nI know a lot of truck guys and yes... they only like their favorites and everything else is crap. I hope they are smart enough to not let emotions like that affect their investments.\n\nI am a 40 year Unix guy who went Linux a long time ago. Solaris, SunOS, DGUX AIX, Sco. BDS, SVr4. You name the Unix I’ve been familiar with it. I hated Microsoft for what I considered legitimate reasons. I still like my Linux.\n\nI bought my first Microsoft shares on the dip last week. I liked the deal at that price. All my Linux friends are shocked I would do something like that. I want to make some money and I think I can with the that play. Simple as that.",
        "created_utc": 1619974553,
        "id": "gwokm98",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620003353.0
    },
    {
        "author": "EvilUmpire",
        "body": "Like FAANG alumni Netflix before it, I don't see Amazon lasting on this index. \n\nLike Netflix, there's nothing proprietary about what Amazon does. Everyone and anyone is creating their own online marketplaces, and if you haven't used Amazon lately, it's become a completely shit-pile of dodgy products and scam marketing.\n\n2 years ago, 90% of my online purchases were with Amazon. Now? Maybe 50%.....I go direct to the seller, use Wal-Mart, use a Shopify enabled market, etc. \n\nSame goes for their cloud and streaming services.....nothing proprietary, just like Netflix. \n\nGoogle has the biggest moat in my opinion. It's not getting replaced anytime soon. \n\nMicrosoft is #2 for me. It will forever be ingrained in 90% of business and personal computing.\n\nApple is #3. I am a tad concerned that so much of their revenue is derived from a single product, but their management is impressive. \n\nFacebook is #4, but is also the one I'm least certain about, one way or another. Their product seems to have become a bastion for bat-shit crazies. Basically, every uninformed person I know is a heavy facebook user.....completely roped into their local groups and trendy conspiracy theories. These people like their echo-chambers, so I suspect user retention, and trust in the platform, to remain high. However, as witnessed by TikTok, a younger generation could conceivably ditch fb in an instant for something more in tune with their zeitgeist.",
        "created_utc": 1620003783,
        "id": "gwqblzd",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620032583.0
    },
    {
        "author": "Qwertyforu",
        "body": "Square - 10%\n\nTarget - 9%\n\nApple - 9%\n\nMicrosoft - 9%\n\nPayPal - 8%\n\nStarbucks - 8%\n\nDisney - 7%\n\nBlackRock - 6%\n\nAbbVie - 5%\n\nGeneral Motors - 5%\n\nGenerac - 4.5%\n\nCatalent - 4.5%\n\nDeere &amp; Company - 4%\n\nGoldman Sachs - 3.5%\n\nThe Trade Desk - 2.5%\n\nUnited Rentals - 2%\n\nRest: Cash",
        "created_utc": 1620006066,
        "id": "gwqfps0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620034866.0
    },
    {
        "author": "gorays21",
        "body": "Just invest in mad!\n\nM - Microsoft \n\nA - Apple\n\nD - Disney",
        "created_utc": 1620041367,
        "id": "gwrr030",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620070167.0
    },
    {
        "author": "aeaccount",
        "body": "Agreed. I absolutely hate using Microsoft Teams.",
        "created_utc": 1620009988,
        "id": "gwqmr5k",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620038788.0
    },
    {
        "author": "ChuckMayr",
        "body": "Microsoft = safe play, I consider that to be similar in performance and risk to an ETF, no mooning, but also no bankruptcy\n\nGoogle = not sure how much more they can charge for ads, and how many more there can be on YT videos before people just gtfo\n\nAmazon = most undervalued imo, their growth is insane, here in EU there is no alternative. but they should diversify faster into grocery shopping and stuff like that, that's where competition is coming in right now.\n\nApple = my biggest position, they have all the cash to diversify into new fields and the brand helps to push sales on even very unremarkable products (Airpods Max)\n\nFacebook = can't justify investing in them right now, even though that's probably not very wise\n\nNetflix = no go for me, just like with Spotify, the business model has no moat and all the big players are just copying them right now but have billions and billions more to spend - they are gonna lose longterm to DIS, AMZN, AAPL\n\n&amp;#x200B;\n\nI hold all except FB and N.   \nI expect DIS, AMD and NVDA to be referred to as similar cash cows as FAANG soon.",
        "created_utc": 1619956437,
        "id": "gwngg4o",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619985237.0
    },
    {
        "author": "hristopetrovv",
        "body": "let we buy an island , and all of us moving overthere , we will give DFV the microsoft and crashing this world economy for 2nd time hahahahaha",
        "created_utc": 1619880648,
        "id": "gwjnual",
        "score": 2,
        "subreddit": "Wallstreetbetsnew",
        "created": 1619909448.0
    },
    {
        "author": "Smidday90",
        "body": "Bitch please, I got a whole £0.03 that’s like $0.041 I’m buying Microsoft",
        "created_utc": 1619860605,
        "id": "gwivj90",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1619889405.0
    },
    {
        "author": "Amerlis",
        "body": "Aapl, Dis, msft, hd holding green. Waiting to see how tgt and cost do :)",
        "created_utc": 1620041833,
        "id": "gwrrquw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620070633.0
    },
    {
        "author": "tristinr1",
        "body": "Just buy it directly from the Microsoft store you tard",
        "created_utc": 1619980498,
        "id": "gwp1a51",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620009298.0
    },
    {
        "author": "DBroker1997",
        "body": "The thing is, the companies really carrying the index (Apple, Facebook, Microsoft, amazon, google) aren’t really expensive, quite the opposite is the case. They are actually cheap on a historic basis. As long as they don’t break down the market doesn’t break down. And if they break down, it’s the chance of your lifetime to pour money into these stocks",
        "created_utc": 1619979297,
        "id": "gwoy350",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620008097.0
    },
    {
        "author": "KingSoggy",
        "body": "correct about me making an assumption about how the stock market would react. but i suppose thats the senario i would want to pose for this question regarding real assets.\n\ni overall agree with investing in good ceos / business. i only feel confident atm with MSFT and BAM meeting that criteria. what are the 8 stocks you mentioned that you have?",
        "created_utc": 1620017351,
        "id": "gwqy6s6",
        "score": 2,
        "subreddit": "investing",
        "created": 1620046151.0
    },
    {
        "author": "Shaun8030",
        "body": "Apple , MSFT , amzn and GOOG are pretty boring mega cap blue chips",
        "created_utc": 1619919216,
        "id": "gwm0jeq",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1619948016.0
    },
    {
        "author": "Potatoe42069",
        "body": "I sold half my TSLA before earnings and plan to buy back in Monday since it's holding steady now, but I wouldn't do this with relatively lower PE stocks like MSFT or AAPL.\nIt's really about reducing risk, not scalping a blip in price from good earnings",
        "created_utc": 1619878803,
        "id": "gwjjpxg",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1619907603.0
    },
    {
        "author": "Lord_Fusor",
        "body": "How long have they been working with Microsoft? Six months ago this stock was $1-2 if they didn't see the value in a buyout at $1.50 why would they buy it at 10x that?\n\nBest in Class is a marketing gimmick used by Mvis . They say iit but who agrees? No one else seems to think its \"best in class\" \n\nWhat class are they best in?\n\nAfter 30 years of being a company they made 500k in revenue this year, that Microsoft contract doesn't seem to be all that lucrative.",
        "created_utc": 1619880968,
        "id": "gwjok8b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619909768.0
    },
    {
        "author": "GreatUsername7",
        "body": "Taxable Brokerage Account 12,997.40\n\nINTC 24.06 %\n\nHD 24.05 %\n\nVZ 11.83%\n\nDFS 9.05%\n\nCWEN 8.58 %\n\nMSFT 7.19 %\n\nNEE 5.67 %\n\nI have a margin account so I have been selling puts to generate income\n\n2 JBLU May 21st 19 dollar puts\n\n1 CRSR June 18 30 dollar put\n\n&amp;#x200B;\n\nRoth IRA 962.18\n\nSCHG 100%\n\n18 years old about to be 19 started investing June of last year (this is my entire net worth besides 6,000 in savings/checking)",
        "created_utc": 1619928598,
        "id": "gwmg2x1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619957398.0
    },
    {
        "author": "GeneralRenegade1",
        "body": "I see FREE MARKET &amp; FREE ENTERPRISE TO SKYROCKET!\nSPACEX-OCCUPIE MARS!\nOCCUPIE MOON!\nSPACESTATIONS!\nSPACECASSINO-INFINITY-X\nROCKET TO THE NEW ADVENTURES!\n (CAPITALISM! RULES!)=$$BANK$$\nTRUST THE TRUST!\nGOLD STANDARD!\nSTOCKS, BONDS, CDS, 401K! \nTURN THE HEAT UP! FIRE THEM ENGINES UP! \nITS TO THE RACES! \nADDRILLIANATOR! \nBIG FOOT! \nMONSTER CRUSH IT! \nHULK SMASH! \nRAGE ON THE MACHINE!\nIMAGINE DRAGONS!\nMORTAL KOMBAT!\nTHE MATRIX!\nCALL TO DUTY!\nEA!\nFALLOUT:NEW FREEDOM!\nMICROSOFT GAMES!\nPC POWER TO THE GAMER! PC GAMERZ RULES!\n(ASSISSINS CREED:NEW GENERATION)\nPCGAMER MAG!\nCHEATCC.COM!\nNEWEGG.COM\nTESLA INC(FORMALY:TESLA MOTORS CO). \nSPACEX\nCREWDRAGON!\nIM ON FIRE!!!!! LIGHT EM UP!!!!\nDISCOVERY NETWORK!\nFACEBOOK-IM THE REAL BIG BOSS!\nI RULE!!!!!\nWASTELANDER!-FALLOUT76 SERIES GAME!\nITS UNREAL ENGINE TECH! \nITS THE SPACEAGE JUNK ROCKETSHIP! \n\nROCKET STOCKS! HOLD THE HELL OUT OF THEM! U OWN A VARY-VARY=SMALL \"%\" OWNERSHIP TO STOCKHOLDERS RIGHTS! \nDEMAND DEMAND FOR THE BEST! \nDEMAND FOR MAKE THE MONEY! \nI SPEAK ONLY MONEY! NOT JEDI MIND TRICKS!\nWHAT MOVIE DID THAT LINE I WROTE BY THE WAY!!!\nI MAY KNOW ALOT! HEE HEE HEE\nOOH RAH! SEMPER FI!\nKEEPING IT SIMPLE STUPID! \nMAKE DATE MAKE MONEY!\nMAKE DA MONEY!\nTHE \"DUH\" MONEY!\n\"THE SIMPSONS\"\nTUNE IN FOR MORE!\nDO YOU WANT TO KNOW MORE?-ITS A BUG PLANET! KILL, KILL THEM ALL! \nWHAT CAN YOU DO FOR PART? SMASHEM BUGS!\nITS A BUG PLANET! \nRAT CHEKS ROUGHNECKS! \nSTARSHIP TROOPERS!!!!!\nMAKE DA MONEY!\nI ONLY SPEAK MONEY!-JEDI MASTER KNOWS. \nYODA THE MASTER!\nGURU! THE MANDALORIAN=IT IS THE WAY!\n\nMAKE MONEY! MORE WAYS THAN 1 TO SKIN THAT CATZ! CATZA CLAWS! \n\nMARVEL STUDIOS!!!!!\nI AM IRONMAN!!!!!!",
        "created_utc": 1619867924,
        "id": "gwj37nc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619896724.0
    },
    {
        "author": "Eliran1991",
        "body": "By whom? Microsoft? Nvidia? Google? Apple? Ford? General Motors? More fake big names? all debunked.  \n\n\nI don't think you truly believe that yourself by now.",
        "created_utc": 1619872482,
        "id": "gwj92u1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619901282.0
    },
    {
        "author": "melchior4242",
        "body": "Yeah MSFT really took a dump this week",
        "created_utc": 1619872638,
        "id": "gwj9ao2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619901438.0
    },
    {
        "author": "RollThePoint",
        "body": "Lol, that's as helpful as saying sometimes stocks go up and sometimes they go down. From what I have read, dividends and value are what folks like during times of inflation and economic uncertainty. Warren buffet invests in value and it stands the test of time. Growth is basically what we have been in after the 2000 bubble recovery, pretty much big gains as the US shifted from industry to tech (Microsoft, apple, google, amazon leading the s&amp;p 500 funds). Time in the market and time period trends are what matters here IMO. Long term/far from retirement = more risk/growth funds, short term during times of uncertainty/closer to retirement = value/dividends/cash. If you are not an active investor and are close to retiring value and dividend are attractive because risk is lower. Could be wrong though, I just read crap on the internet, lol.",
        "created_utc": 1620011618,
        "id": "gwqpjeh",
        "score": 1,
        "subreddit": "investing",
        "created": 1620040418.0
    },
    {
        "author": "F1shB0wl816",
        "body": "I don’t think you understand people stop holding volatile assets when they don’t have the time to wait it out. You’re pretending people hold boomer stocks until they die, yet it’s widely agreed that it’s safer and smarter to invest more and more into bonds or the likes, than to have your money in volatile assets that could take a much bigger hit in the time frame you need it. That has nothing to do with believing or disbelieving in the market, that’s taking financial security seriously.\n\nJust because you don’t have a reason to sell doesn’t mean you can speak for the mind of millions. After all, if you intend to enjoy the fruits of your investments, you sell. \n\nThat’s not the difference between investing and trading. You just come across like a smart ass, implying meanings where there are none. Investing and trading aren’t mutually exclusive, you can have both, one or neither. There’s no hard rule like you’re stating. \n\nI never stated what the major players are doing. I’m sensible and don’t speak for millions on data that doesn’t exist because I feel some type of way. The burden of proof falls on those who are making the claim, which is you, me asking for proof is not me arguing for opposite. It’s me arguing to back up your point with facts which you don’t have. \n\nEverything you state is like it’s some black and white opinion. Everything has to be this or that. Numbers don’t speak for beliefs. But what do I expect from someone who doesn’t understand volatility and that sometimes people need to protect themselves from the risk of loss. That volatile investments make for better short term trades, just as you always see volumes spike on massive volatility movements. When Microsoft starts going 20% in a night, than see if your statement holds true. Look at any volatile asset and look at its comparable trade volume. Btc has rose more than 10x Microsoft the past 3 months, if you want short term or big gains, where’s your better chance? And ones beliefs have nothing to do with capitalizing on cryptos appreciation. \n\nFunny how you think you’re educating anyone, but you lacked the knowledge to know you don’t invest money you need immediately and was to worried about buying at the wrong time because you have no apparent ability to do an research on what you could guesstimate to be a fair price and target. From someone who infers useless data to go on about points they know nothing about, while not even understand the concept of volatility and millions of reasons why one could realize gains. \n\nHave a good one. I’ll smack my head on the wall before I give you anymore time out of my day. I proved my point and that was that you couldn’t back shit. The very fear mongering, fud I speak of that’s nothing more than someone’s else ignorant opinion.",
        "created_utc": 1619994865,
        "id": "gwpv2jo",
        "score": 1,
        "subreddit": "investing",
        "created": 1620023665.0
    },
    {
        "author": "Verb0182",
        "body": "😂 you know it’s double 2020 “royalties” because they were selling so little they gave MSFT the production and now get royalties instead of production revenue??",
        "created_utc": 1619899557,
        "id": "gwkvue0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619928357.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I hold 20% cash.  Sometimes I get  fomo, but remind myself that if and when we crash or correct it'll be better to buy things like googl and MSFT.  But things can always go up instead.  No easy answer.",
        "created_utc": 1619903428,
        "id": "gwl4yk3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619932228.0
    },
    {
        "author": "DelphiCapital",
        "body": "It's probably not a good sign that their most direct competitor is called Box. And their other competitors are Google, Amazon, Microsoft and Apple.",
        "created_utc": 1620000970,
        "id": "gwq6gpz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620029770.0
    },
    {
        "author": "Administrative-Tap93",
        "body": "Yeah I don’t buy it. If Microsoft and Mercedes likes your product then you have more than $500K a quarter.",
        "created_utc": 1620001138,
        "id": "gwq6rry",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620029938.0
    },
    {
        "author": "ThisIsWhoIAm78",
        "body": "The card converts to current exchange rates. Same way as when purchasing something internationally under a different fiat currency. \n\n\nMicrosoft, Newegg, PayPal, Tesla, Home depot, blah blah...lots of companies take it. One of my apps/websites recently offered Bitcoin as a new payment option, though I honestly can't remember which one. You can look it up if you want to find more, those are just off the top of my head. China is talking about accepting it as a real currency - the IRS views it as such, and you have to declare it now on your taxes. To think it is suddenly going to disappear at this point after a decade is foolish. I'm just pissed I dismissed it when it first came out, because I could be a millionaire now. Oh well. I did buy when it was around $7000, so at least there's that!",
        "created_utc": 1620003075,
        "id": "gwqabma",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620031875.0
    },
    {
        "author": "Investing8675309",
        "body": "Just buy VT if you can from the UK. If you don’t like ETFs I’m confident you will do okay over the next five years buying Microsoft and Amazon as you mentioned (just don’t touch it). I’m biased though since those are my two highest conviction positions.",
        "created_utc": 1619876691,
        "id": "gwjfli6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619905491.0
    },
    {
        "author": "Miles_Adamson",
        "body": "Can't wait for VIAC to beat earnings then go down like AAPL and MSFT and make me sad",
        "created_utc": 1619910561,
        "id": "gwlkuhf",
        "score": 1,
        "subreddit": "options",
        "created": 1619939361.0
    },
    {
        "author": "Filler9000",
        "body": "Think Malibu's most wanted meets Steve Urkel. Not satire just unoriginal. Buy msft if you wanna be 😎",
        "created_utc": 1619910826,
        "id": "gwllbyn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619939626.0
    },
    {
        "author": "MediumIntroduction96",
        "body": "Oh i dont short TSLA that would lose me money.\n\n\nYeah people have been guessing it's fall for forever.I'd suggest of we ever had an actual bear markrt it would lose a tonne of value. Mainly because its no different than other bubble assets who stories all ended the same. In the .com bubble AT&amp;T and MSFT were the heavy hitters,  went into the hundreds easily and now worth half rhe price to even less. Whole in 2008 AIG took a massive hit. It was worth a 1000$ these days they had to be bailed out by governmemt and are now privatised. I don't feel this type of event is evem possible right now because of pensions and savings would be wiped out. So the Fed will bail the markets out at the drop of a hat.",
        "created_utc": 1619860135,
        "id": "gwiv2g1",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1619888935.0
    },
    {
        "author": "kids_eat_drugs",
        "body": "Hey,\n\nGot a question regarding 401k vs personal portfolio allocations. My 401k investments go into a few index funds, mainly in tech / mid cap companies / consumer staples / etc. At the moment, my personal RobinHood portfolio has positions in overlapping companies like AAPL, MSFT. I’m wondering if it would be a wise idea to do something like this\n\n•\t⁠sell my overlapping stock positions in my RobinHood portfolio and use the equity gained to invest in growth stocks that aren’t in my 401k funds.\n•\t⁠up my 401k contribution since I’m only doing 4% which my employer then matches with a specific percentage\n\nI just feel like it’s somewhat dumb to invest in overlapping companies in two accounts. I might as well buy them only in the 401k since I’m not even taxed there whereas my salary gets taxed before I can load funds into RobinHood. What do you guys think?",
        "created_utc": 1619946614,
        "id": "gwn1ajb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619975414.0
    },
    {
        "author": "iamrubberyouareglue9",
        "body": "My Puts on PINS, MSFT, AAPL, TQQQ were all less than $1 ITM and were assigned.",
        "created_utc": 1619958643,
        "id": "gwnkhwv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619987443.0
    },
    {
        "author": "qwertyWarrior77",
        "body": "Wait wait wait you’re telling me that in the fine print they stated the right to do this and in all reality a broker can NOT offer the purchase of a security. Damn I was just about to sue the balls off fidelity for not letting me yolo into MicroCaps with no fillings but I guess it all adds up now.",
        "created_utc": 1619878372,
        "id": "gwjiv9f",
        "score": 169,
        "subreddit": "stocks",
        "created": 1619907172.0
    },
    {
        "author": "starhockey36",
        "body": "Do you know how many people blew up accounts thinking this market has way overrun reality? Everyone in the whole world knows equities are not sustainable at these levels right now. \n\nMy point is you may want to consider extending the date.",
        "created_utc": 1619939324,
        "id": "gwmtosi",
        "score": 157,
        "subreddit": "wallstreetbets",
        "created": 1619968124.0
    },
    {
        "author": "sling1221",
        "body": "SPCE on May 10th now",
        "created_utc": 1619874841,
        "id": "gwjcl5y",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1619903641.0
    },
    {
        "author": "salfkvoje",
        "body": "Bezos as new GME CEO immediately issues a 10:1 split, everyone has 10x more shares, shorters shit themselves now responsible for covering 10x their position, price at 17 immediately gets bought up by everyone back up to 200+\n\nAnd then weed becomes legal so my APHA and GRWG fucking print, and then also so do CLF and SMH for unknown reasons\n\nThen my dad comes home after 20 years and my ex remembers how much she loves me, also I can turn invisible (and back visible) at will",
        "created_utc": 1619954269,
        "id": "gwncs7r",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1619983069.0
    },
    {
        "author": "wiggle-le-air",
        "body": "I've made like 10 plays and hevent made a cent 😎\nGuess I'm a long-term investor now",
        "created_utc": 1619951216,
        "id": "gwn60ry",
        "score": 70,
        "subreddit": "StockMarket",
        "created": 1619980016.0
    },
    {
        "author": "AvenDonn",
        "body": "Nice call sweep.\n\nNow watch it trade sideways for another month",
        "created_utc": 1619940557,
        "id": "gwmv0uv",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1619969357.0
    },
    {
        "author": "fxrky",
        "body": "Cant wait to see the loss porn a week from now",
        "created_utc": 1619860798,
        "id": "gwivq85",
        "score": 62,
        "subreddit": "pennystocks",
        "created": 1619889598.0
    },
    {
        "author": "lcastill1",
        "body": "Very bad... but it’s still on sale so it’s not too late for him to get back in now",
        "created_utc": 1619893209,
        "id": "gwkholu",
        "score": 59,
        "subreddit": "StockMarket",
        "created": 1619922009.0
    },
    {
        "author": "McNultyLikesJameson",
        "body": "Sorry, you're now signed up to participate in a HUMANCENTiPAD.",
        "created_utc": 1619882420,
        "id": "gwjrx75",
        "score": 57,
        "subreddit": "stocks",
        "created": 1619911220.0
    },
    {
        "author": "MoonrakerRocket",
        "body": "Good time to mention all the quantitive easing the world has done (especially the US)? I mean, y’all printed like, 40% of the dollars in existence in the last 12 months which obviously isn’t good for managing future inflation. However, wouldn’t that also mean that extreme valuations aren’t really that high because the dollar is quickly becoming worth less and less? \n\nI mean, if Apple is worth $2T and that seems high to you, could it not just be that it now takes $2T to be worth c.$1.5T pre-pandemic? From overseas is kinda seems like it’s priced in. \n\nI suppose the counter argument could be that a LOT of the stimulus went into the market and is tied up. But that would also mean taking profits and crashing the market while also leading to greater cash in circulation, worsening inflation of day-to-day goods, or having inflated valuations and not seeing hyperinflation in the real world \n\nI don’t know how this shit works, I’m retarded. 🤔",
        "created_utc": 1619940735,
        "id": "gwmv7n7",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1619969535.0
    },
    {
        "author": "Desenski",
        "body": "Dying game company. That's a good one. Are you sure we're talking about the same company? They've paid off all debt, raised an additional $551m (they now have just under $1b in on hand cash) lead by an ecommerce genius.",
        "created_utc": 1619894824,
        "id": "gwklfqq",
        "score": 48,
        "subreddit": "StockMarket",
        "created": 1619923624.0
    },
    {
        "author": "PerestroikaPal",
        "body": "Lol no, I don't have 11k shares of GME. I have bought/sold a total of 11k shares during my GME shenanigans. Right now I own 300 shares. 100 were called away yesterday :(",
        "created_utc": 1619894828,
        "id": "gwklg4o",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1619923628.0
    },
    {
        "author": "PerestroikaPal",
        "body": "I'll keep writing for now. The premium has definitely dropped but getting $1k for a weekly or $2k for a couple weeks out is still very much worth it to me. I miss those $9k covered calls though",
        "created_utc": 1619898597,
        "id": "gwktqu1",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1619927397.0
    },
    {
        "author": "Cheapsuittt",
        "body": "Lesson 2 is more of the same except now there's two people kicking you in the balls from the front and back",
        "created_utc": 1619880364,
        "id": "gwjn6q8",
        "score": 39,
        "subreddit": "SPACs",
        "created": 1619909164.0
    },
    {
        "author": "stothel",
        "body": "with interest rate so low, it's not worth too much mental energy trying to maximize tax savings or yield on cash.\n\nI prefer short-term high quality corporate bond funds right now as cash equivalent holdings.  Be careful with bond funds that have non-trivial management fees though\n\nVCSH",
        "created_utc": 1619886087,
        "id": "gwk0o6y",
        "score": 38,
        "subreddit": "investing",
        "created": 1619914887.0
    },
    {
        "author": "oxyelevated",
        "body": "Man, I transferred my entire account to Schwab and wouldn’t you know, they failed to move over all my cash and certain shares. So I tried it again. Same thing.  I’ve tried 3x now to withdraw my cash (not shares) and the transaction continues to fail.",
        "created_utc": 1619891646,
        "id": "gwkdz3h",
        "score": 35,
        "subreddit": "stocks",
        "created": 1619920446.0
    },
    {
        "author": "HugeHungryHippo",
        "body": "Michael Burry waited years. I’m calling it now: major correction will happen in the next few years. \n\nMods, please give me a Nostradamus flare if I’m right!",
        "created_utc": 1619946537,
        "id": "gwn17p9",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1619975337.0
    },
    {
        "author": "Faelinor",
        "body": "You've sold enough to pay down the loan right and are just playing with your winnings now right? \n\nOr is this the wrong group for even a little bit of common sense lol",
        "created_utc": 1619951679,
        "id": "gwn6s1g",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1619980479.0
    },
    {
        "author": "SnooPineapples4548",
        "body": "I think they had a PP deal at 1.20. I’m at 1.25 now and considering averaging down. I think they’re on a good track and it will get better as the plastics ban takes effect. Price target around 1.60. I feel like there’s been a downtown lately among micro caps. All that said do your own DD.",
        "created_utc": 1619907431,
        "id": "gwlextq",
        "score": 26,
        "subreddit": "CanadianInvestor",
        "created": 1619936231.0
    },
    {
        "author": "DjMDMAPhd",
        "body": "If my child ever asks what times were like when I was young, I'll show him this and say, \"son, this is everything you'll ever need to know. Now I'm going out for a pack of smokes.\"",
        "created_utc": 1619952319,
        "id": "gwn7rds",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1619981119.0
    },
    {
        "author": "wab_AZ",
        "body": "RKT is no joke right now. Every mortgage company is beating earnings and short sellers still control the stock. It could go to 40+ all over again.",
        "created_utc": 1619887555,
        "id": "gwk44mc",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1619916355.0
    },
    {
        "author": "ConvergenceMan",
        "body": "Gotta love when people cherry pick price increases for certain items that have *known shortages* and then scream HYPERINFLATION.\n\nLumber, rhodium, steak, real estate in San Francisco, and now chicken wings - it's always the same pattern.\n\nLike a month ago, people were bitching in the news that bacon went up at Costco by $1, saying \"inflation is here!\"  Then last week I picked up high quality bacon from the local store for $2.99 / lb.\n\nIt's almost like epic, global supply chain issues caused by COVID lockdowns don't enter people's minds as a possible explanation of higher prices.",
        "created_utc": 1619922357,
        "id": "gwm5zqv",
        "score": 24,
        "subreddit": "investing",
        "created": 1619951157.0
    },
    {
        "author": "NrdRage",
        "body": "So this is interesting in theory.  Some flaws though:\n\n&amp;#x200B;\n\n1:  That would represent a historic collapse of the markets in a time which there is more money flowing into the markets than ever\n\n&amp;#x200B;\n\n2:  It also ignores the fact that the IB's have been TRYING to crash the market for 2 months now, but retail has been holding them off at the pass (look at the outflow from IB's - they've been selling like mad, but it keeps getting bought up)\n\n&amp;#x200B;\n\n3:   And it pains me to say it, because this acknowledges the market is currently completely broken, but technicals and oscillators on a market wide level presently don't work because of how much manipulation is going on.\n\n&amp;#x200B;\n\n4:  It ignores the fact that the Fed is willing to print any amount of your great-great-great-grandchildrens' money to keep this economy propped up.\n\n&amp;#x200B;\n\nWhat you're going to see is a channeled market, not a crashed on.",
        "created_utc": 1619943138,
        "id": "gwmxr6f",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1619971938.0
    },
    {
        "author": "psmithrupert",
        "body": "Well first of all, the car market internationally is still growing quite quickly (think China, India, Latin America) secondly the regulatory landscape as it is and as it seems to evolve into the future, will more or less force everyone to go electric. A few of the big names are not going to do so well in the transition ( at least one of the big Americans or maybe one the french would be my best guess). That’s a lot of market share that’s up for grabs. And if you think, well that’s going to go to Tesla or any of the newer names like Nio or whoever they are, well maybe, but selling a car is complicated, it involves a lot of logistics and maintenance is also a question.. so the big names  that are going to make it are in a pretty good position. And lastly, some of those companies make an insane amount of money already so they are a pretty safe investment for now. Volkswagen for example made 10 Billion$ profit last year. That’s after taxes. In a year that was generally considered bad for car makers...",
        "created_utc": 1619893736,
        "id": "gwkiwur",
        "score": 24,
        "subreddit": "stocks",
        "created": 1619922536.0
    },
    {
        "author": "Odin1367",
        "body": "Basically, I bought OCGN as a yolo with my dads entire portfolio that I manage for him back in December, started with 2K he gave me, flipped it to 3200 in oil stonks and then yolo’d that to OCGN at 2.60 a share for 1240 shares, been riding the rocket ever since and only now are people noticing it here lmao",
        "created_utc": 1619878415,
        "id": "gwjiyew",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1619907215.0
    },
    {
        "author": "Lahym",
        "body": "Love this stock right now, so much upside potential.  \n\n\nBought 2000 shares on Thursday and now I'm chillin in tendie town   [😋](https://emojipedia.org/face-savouring-delicious-food/) \n\n###",
        "created_utc": 1619896113,
        "id": "gwkoan0",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1619924913.0
    },
    {
        "author": "rkrum",
        "body": "I'm bullish on GDNP. I have only 1600 shares for now (around 5% of my current portfolio), but I'm planning on increasing my shares to at least 4000 while it's below $1.10.\n\nThe greatest catalyst for their growth will be the plastics ban. But considering our current scenario, the company has been steadily growing, announcing more sales and new products.\n\nI've been mainly focusing my small cap investment funds into sustainable areas, and I honestly love their product. There is a huge market for them, and considering we'll have the single-use plastic ban in the near future, I think it's a great company to invest in this year.\n\nBut hey, I'm just a common guy trying to invest in sustainable ideas and getting wealthier in the process. I'm no financial advisor, nor ultra-expert in investing. So, do your own dd :)",
        "created_utc": 1619911664,
        "id": "gwlmvqo",
        "score": 20,
        "subreddit": "CanadianInvestor",
        "created": 1619940464.0
    },
    {
        "author": "Powerofenki",
        "body": "10 Million now.",
        "created_utc": 1619880609,
        "id": "gwjnr3k",
        "score": 19,
        "subreddit": "stocks",
        "created": 1619909409.0
    },
    {
        "author": "PerestroikaPal",
        "body": "I started selling GME options in late mid-February after the second big spike that sent GME from $40 to $200. I did get some tendies on the initial squeeze in late January, so my entire 65k gain is from late January to now.",
        "created_utc": 1619895445,
        "id": "gwkmukq",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1619924245.0
    },
    {
        "author": "R-E-L-4-X",
        "body": "Friend, shortage in B2C supply started last year. Manufacturing is seeing the pinch now in certain channels. Raw materials are already scarce and the list grows each day. We will see a delayed ripple from all aforementioned posts. Too be clear I’m no bear, however we’re in for a ride at some point. The best monetary policy in history can only hope to soften the blow at best. And we’re talking more fiscal spending. It’s truly insanity.",
        "created_utc": 1619950723,
        "id": "gwn5h1i",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1619979523.0
    },
    {
        "author": "Davrotti",
        "body": "It is extremely difficult to point out from which part of the system the next crisis will emerge. I think that we can not know at this stage but that we can only argue that valuations are now relatively high.",
        "created_utc": 1619864823,
        "id": "gwizt71",
        "score": 17,
        "subreddit": "investing",
        "created": 1619893623.0
    },
    {
        "author": "spider2544",
        "body": "In that instance robinhood would be on the hook for so much cash in paper trades you had better believe they would pull every trick in the book to not go tits up. Vlad would be downstairs dumping coffee on servers just to get a service outage to be like “ohh shit we dont know this this could have happened, weird, well be back up shortly soon as we can figgure out the cause of the outage”\n\nThey now have a proven track record of fucking over people with accounts on their platform because the people trading on robinhood arent their customers, they are the product. Never keep money with a company whose intrests aren’t aligned with you as a customer.",
        "created_utc": 1619950439,
        "id": "gwn56ks",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1619979239.0
    },
    {
        "author": "Riverdragon32",
        "body": "Absolutely. I spent the last 5 years watching AMZN, questioning its high valuation, and wondering if it could maintain its growth and competitiveness. I bought my first shares of AMZN in 2020, with about a ~$3050 cost basis. If anything I would like to add more even at this current price. Because it's grown its earnings so much, it actually trades cheaper right now than at nearly any other point for the past 5 years on a P/E basis.",
        "created_utc": 1619908988,
        "id": "gwlhxry",
        "score": 17,
        "subreddit": "investing",
        "created": 1619937788.0
    },
    {
        "author": "StocksRGei",
        "body": "What the fuck are these r/investing comments? \n\nGet the fuck out of here pussies, if you cant handle risk go cry in the bonds markets. \n\nIts his money, he made a bet. Now fuck off.",
        "created_utc": 1619944917,
        "id": "gwmzl59",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1619973717.0
    },
    {
        "author": "robertleeblairjr",
        "body": "I doubt because of the post. I had hear about this a week or so back. Thought it was a joke at first. I was wrong. This is where our society is right now. Approaching our very own Idiocracy. *I like money. I like sex. Hey, I got an idea.*",
        "created_utc": 1619922118,
        "id": "gwm5lbk",
        "score": 16,
        "subreddit": "StockMarket",
        "created": 1619950918.0
    },
    {
        "author": "TheDevilintheDark",
        "body": "60% of my portfolio is now COIN so I can tell folks I run my own ARK ETF. \n\nSoon to be named ARK-Poor",
        "created_utc": 1619876139,
        "id": "gwjeoas",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1619904939.0
    },
    {
        "author": "kemar7856",
        "body": "Gamestop doesn't even sell video games anymore go to their store its all funkco and toys now. The employee's hair are also cotton candy colors",
        "created_utc": 1619866441,
        "id": "gwj1jbn",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1619895241.0
    },
    {
        "author": "Geoffs_Review_Corner",
        "body": "I'm right there with you. It used to be my favorite sub on Reddit. Now I check it occasionally just to see what they're up to.",
        "created_utc": 1619902787,
        "id": "gwl3ekf",
        "score": 16,
        "subreddit": "stocks",
        "created": 1619931587.0
    },
    {
        "author": "ImReellySmart",
        "body": "Growth in what form... they sell cars now and they sell cars in 5 years... nothing changes the way I see it.\n\nI understand that naturally the companies may grow but I'm talking about investors who are specifically investing in these companies now as the companies enter the EV market.",
        "created_utc": 1619891453,
        "id": "gwkdgfh",
        "score": 15,
        "subreddit": "stocks",
        "created": 1619920253.0
    },
    {
        "author": "TODO_getLife",
        "body": "Offtopic, but what happened to this sub? Used to be very active and now there's 1-2 new posts a day? Kinda confused.\n\nIt used to be a nice place with some balance compared to /r/stocks and them sometimes being pushy of certain narratives/stocks.",
        "created_utc": 1619902300,
        "id": "gwl26gu",
        "score": 15,
        "subreddit": "investing",
        "created": 1619931100.0
    },
    {
        "author": "BiGGAYCAREBEAR",
        "body": "Hi, my name is Warren Buffett. I’ve been around since the stock market first started trading. Due to inflation I am now worth billions. Thank you.",
        "created_utc": 1619887268,
        "id": "gwk3ffw",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1619916068.0
    },
    {
        "author": "anders9000",
        "body": "He's basically said there's nothing that can be bought for a fair price right now.",
        "created_utc": 1619893872,
        "id": "gwkj870",
        "score": 15,
        "subreddit": "StockMarket",
        "created": 1619922672.0
    },
    {
        "author": "EffectiveWar",
        "body": "I’m seeing a lot of people talking about how much money they have lost in the market. First, I am a boomer. I have over $9mm invested in boomer stocks And am up about 13% on those stocks. But I also have about $250,000 I gamble with from ideas I get from this sub. I am down on those stocks. But have had many hours of fun losing it on the YOLOing haha!\nI hope you youngsters are keeping your retirement funds separate from your gambling money. What am I saying, you have no retirement!\n\nThere is no shame in investing in boomer stocks kids. You just needed to do it 40 years ago. But the second best time is today!\n\nCiao for now!",
        "created_utc": 1619877386,
        "id": "gwjgw37",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1619906186.0
    },
    {
        "author": "badnewsbearass",
        "body": "I lost all my money on GME and now I’m living in a van down by the river",
        "created_utc": 1619882975,
        "id": "gwjt977",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1619911775.0
    },
    {
        "author": "kdundurs",
        "body": "We’ve been seeing growth selloff for a while now, nothing new about it. It’s already 50% off ath, so even if dips into $19 for a brief moment, it won’t stay there for more than a few minutes, unless they completely fail to impress earnings. It’s quite clear $20 is a hard floor and it will almost certainly never even touch close to $15 lmao. But you know what they say about broken clocks being right twice a day.. Keep preaching.",
        "created_utc": 1619867006,
        "id": "gwj25gz",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1619895806.0
    },
    {
        "author": "chill_cat_character",
        "body": "NrdRage, don't listen to this guy. I've been following you for a while now, and I have yet to find much better DD. You have made me a good amount of money so far. Keep doing you, you beautiful person!",
        "created_utc": 1619918842,
        "id": "gwlzvkt",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1619947642.0
    },
    {
        "author": "llamajake",
        "body": "I've had plans all week to hangout with this girl today, right? Well, she texts me saying she needs flexibility because now she's got errands and things to do today. Where does that leave me? Stuck in this fucking thread wishing for a red day instead of being stood up.",
        "created_utc": 1619890103,
        "id": "gwka950",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1619918903.0
    },
    {
        "author": "JiraSuxx2",
        "body": "I was bagholding some vaxart then woke up one day and it was +50% in my portfolio. Now I am going to be too greedy to sell and ride it back into the red.",
        "created_utc": 1619878162,
        "id": "gwjig21",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619906962.0
    },
    {
        "author": "tonufan",
        "body": "Yeah, people used to give me shit for using boomer broker Vanguard, then the Robinhood shit happened and now it's one of the best and most reliable (besides the shitty layout/UI).",
        "created_utc": 1619899533,
        "id": "gwkvsf6",
        "score": 13,
        "subreddit": "stocks",
        "created": 1619928333.0
    },
    {
        "author": "PieBig7670",
        "body": "wsb is now full of bots and fake posts",
        "created_utc": 1619885697,
        "id": "gwjzo0h",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619914497.0
    },
    {
        "author": "korismon",
        "body": "The pandemic actually helped increase interest as well,   so many of my friends who never played video games have gotten into them in a big way since then,  its cool cause they actually play games with me now",
        "created_utc": 1619854608,
        "id": "gwipebr",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619883408.0
    },
    {
        "author": "Excess0_2",
        "body": "because hendge funds run this sub now",
        "created_utc": 1619870368,
        "id": "gwj67i9",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619899168.0
    },
    {
        "author": "Ken385",
        "body": "Your contracts will now trade under the symbol TLRY1.  Each contract will deliver 83 shares of TLRY.  Over time, these options may become less liquid then regular TLRY options as most people won't be opening new contracts in these adjusted options.  Some brokers may also restrict opening transactions in adjusted options.\n\nThis change takes place Monday. There is a chance that you may have a problem trading them the first day.\n\nHere is the OCC memo on the merger.\n\n[https://infomemo.theocc.com/infomemos?number=48654](https://infomemo.theocc.com/infomemos?number=48654)",
        "created_utc": 1619872946,
        "id": "gwj9qmw",
        "score": 13,
        "subreddit": "options",
        "created": 1619901746.0
    },
    {
        "author": "PragmaticBoredom",
        "body": "The GameStop thing went from funny to fun to scary cult-like obsession in a matter of weeks. \n\nThe facts barely mattered when this started, but now they don’t even want to hear about reality. Just rocket emojis and conspiracy theories.",
        "created_utc": 1619901148,
        "id": "gwkzhoy",
        "score": 13,
        "subreddit": "stocks",
        "created": 1619929948.0
    },
    {
        "author": "YurMotherWasAHamster",
        "body": "The problem with inflation is that when it spikes, investors run from the market and store their money in other assets like treasuries, gold, and now crypto. It's more about where the capital flows than the valuation of companies.",
        "created_utc": 1619944382,
        "id": "gwmz1ib",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619973182.0
    },
    {
        "author": "Xerpy",
        "body": "Most crypto contrarians argue that crypto isn’t really being widely used as a currency right now and is really only a “store of value” and a pretty volatile one. A good amount of the volume is most likely speculative in an attempt to make money, fiat money.\n\nNot many merchants take crypto as payment, I can’t walk down to any mom and pop store and buy toilet paper by transferring some btc from my wallet. And really that’s the crux of the argument. Crypto or BTC specifically, was a reaction to the financial crisis and how the government effectively exercised MMT tactics and bailed out large financial institutions and wealthy risky gamblers at the expense of the every day people. The purpose was to replace a fiat currency with this decentralized currency but that won’t ever happen. I won’t get side tracked on political theory and the monetary system but for now cryptos are gaining traction because there’s money to be made, money that will most likely be converted back to fiat so people can buy things and live their life.\n\nAll that being said it’s not to say some people aren’t diehard believers, who hold almost all their wealth in crypto. I’d say it’s a rarity but don’t really have any of the data to back that up.",
        "created_utc": 1619893491,
        "id": "gwkic7u",
        "score": 13,
        "subreddit": "StockMarket",
        "created": 1619922291.0
    },
    {
        "author": "TheRandomnatrix",
        "body": "Self driving is still so far away as to be basically irrelevant right now.  Even if we had completely proven technology that was 100% safe TODAY there's so much fucking red tape we wouldn't see it for at least another ten years",
        "created_utc": 1619898116,
        "id": "gwkspra",
        "score": 13,
        "subreddit": "stocks",
        "created": 1619926916.0
    },
    {
        "author": "Silver-Tune6829",
        "body": "The big question is where is the short interest now? We had over 160 million shares of short volume April 16 and 17th. And a fair amount of daily Short volume after that. Could we be over 100 millions shares shorted right now ? 💎🙌",
        "created_utc": 1619912383,
        "id": "gwlo7kd",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619941183.0
    },
    {
        "author": "partially__derived",
        "body": "The generation that birthed the first meme lords are now discovering the financial world. This phenomenon will continue until it becomes the norm, and soon our grandkids will be reminiscing on days when Netflix only cost 7 Icy Dragons a month. \n\nThe future is now, old man.",
        "created_utc": 1619924251,
        "id": "gwm96pq",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1619953051.0
    },
    {
        "author": "alfapredator",
        "body": "It's a long term investment now",
        "created_utc": 1619857173,
        "id": "gwis26f",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1619885973.0
    },
    {
        "author": "Desenski",
        "body": "Go listen to the latest earnings report. 300% increase in ecommerce YoY. Q1 was profitable even through covid. The stores they shut down were low performing stores to reduce overhead. \n\nIn less than a year they went from owing a lot of money and on the verge of bankruptcy, to paying off all debt, have almost $1b in cash, and has replaced a large number of high end executives with well known and top performing people in their fields from very successful companies such as Chewy and Amazon. And let's also add in there that these executives' pay is now 100% stock based. Meaning their personal pay is directly related to the success of the company. No free rides collecting nice pay checks.",
        "created_utc": 1619900205,
        "id": "gwkx97j",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1619929005.0
    },
    {
        "author": "NrdRage",
        "body": "Still waiting on the terms of your bet /u/zeffy.\n\nIf you've got enough conviction to try and write a hit piece based on the dumbest \"dirt\" possible, you should have the conviction to stand behind it and put your money where your mouth is.\n\nThis isn't mainstream media, you don't get to write a hidden retraction three weeks from now.",
        "created_utc": 1619919992,
        "id": "gwm1x6e",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1619948792.0
    },
    {
        "author": "quiethandle",
        "body": "TurboTax only still exists because the IRS has been barred from providing the exact same service on the IRS website. It would be *easy* for the IRS to do that, and save everyone a ton of money and time, but they've been stopped by outside forces (mostly lobbying). In other words, TurboTax still exists because it's not a free market (specifically, the gov't has been kept out of the game).\n\nMost of the structure of the real estate process is based on extremely old and legacy factors. Old regulations, laws, and legacy banking that were all invented before computers, let alone the internet. But all of that can be streamlined and automated with technology - and it's happening now.\n\nThe expertise factor for real estate agents is needed only because you have to deal with the paperwork, rules, regulations, and critically, other people (the people who own the house you want to buy, or the people who want to buy your house). But if Zillow becomes the middle man, then as a user, you don't need to know or care about the other parties. You don't sell your house to another person, you sell it to Zillow. You don't buy your house from a person, you buy it from Zillow. Zillow owns the inventory of houses that are on the market for sale.\n\nZillow could become *the* US housing market.",
        "created_utc": 1619878958,
        "id": "gwjk1g9",
        "score": 12,
        "subreddit": "options",
        "created": 1619907758.0
    },
    {
        "author": "Humble_Ad_3832",
        "body": "I feel so attacked right now haha",
        "created_utc": 1619955123,
        "id": "gwne845",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1619983923.0
    },
    {
        "author": "FistyGorilla",
        "body": "You should see what’s happening in India right now.",
        "created_utc": 1619888425,
        "id": "gwk69fn",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1619917225.0
    },
    {
        "author": "UpToMyKnees1004",
        "body": "No hate. Just frustrating. \n\nHe's a smart guy and obviously saw value where I didn't. Seems the state of the market is leaving a lot of people scratching their heads right now.",
        "created_utc": 1619921798,
        "id": "gwm51mk",
        "score": 11,
        "subreddit": "StockMarket",
        "created": 1619950598.0
    },
    {
        "author": "krootzl88",
        "body": "Oh yes, certainly. \n\n* payed off their dept\n* sitting on about $700 million\n* has a solid revenue ($8Bn - 10$Bn/ year)\n* huge brand value (most talked about company)\n* increasing TAM (gaming and eSports)\n* customer base ready for online purchases\n* online retail transition already happening\n\nLast but certainly not least:\n\n* SOLID board of directory with legit superstars poached from $AMZN, Google and Chewy (including Ryan Cohen, of course)\n\nAll the above for a $11Bn market cap. My 100% based on logic evaluation sits around $35Bn now. NOT including any squeeze.",
        "created_utc": 1619936202,
        "id": "gwmq5ui",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1619965002.0
    },
    {
        "author": "BrazenBull",
        "body": "We doing penny stocks here now?",
        "created_utc": 1619905007,
        "id": "gwl8wgd",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1619933807.0
    },
    {
        "author": "ThedanishDane",
        "body": "Straigth out the gate, i'm honestly undecided/unsure on whether you or OP will end being right.   \nHowever, the difference between now and 1999 is that the growth companies of today actually make money, and A LOT of it. Facebook, Apple, Microsoft, Amazon, Google and the likes have shown that they either are, or have proven that they can be, hugely profitable compared to essentially all other companies of the past.   \nAnd because we have seen these examples, in the case of interest rate hikes, investors will be much more patient with their investments in \"zombie-companies\". I mean sure, several would collapse and we would see some retraction from specific companies like Wework, Uber and the like. I don't think interest rate hikes would cause the massive crash that many people seem to think.   \n\n\nBut i'm honestly conflicted, because i feel like there's some aspect to theories above that i haven't heard, or more likely don't understand. I'm also much more worried (from an investor standpoint) about government regulation as i feel a increasingly growing sentiment to regulate data privacy and to a lesser extent monopoly/oligopolies.",
        "created_utc": 1619864441,
        "id": "gwizez3",
        "score": 11,
        "subreddit": "investing",
        "created": 1619893241.0
    },
    {
        "author": "Rontheking",
        "body": "Saw a guy mention is in the daily thread a few days ago, checked it out when it was at around 20/30 ish and decided not to get in. Feels so fucking bad now lol",
        "created_utc": 1619863156,
        "id": "gwiy2xa",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1619891956.0
    },
    {
        "author": "AJ_LA1313",
        "body": "The only dips that are going to occur now are very short-term, desperate slams down by shorts, which will quickly be bought back up by longs. This company's absolute base is 300, it's all just a bunch of corruption and we're trying to ride the wave.",
        "created_utc": 1619905249,
        "id": "gwl9i3q",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1619934049.0
    },
    {
        "author": "Pepe_anon",
        "body": "I did the same put strategy for income too, but got greedy for higher premiums and now one of my put is in deep red territory.",
        "created_utc": 1619853921,
        "id": "gwioo3p",
        "score": 11,
        "subreddit": "options",
        "created": 1619882721.0
    },
    {
        "author": "MattGeiger",
        "body": "chip shortage hurting a lot of stocks right now.",
        "created_utc": 1619947450,
        "id": "gwn24yl",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1619976250.0
    },
    {
        "author": "FrankOBeans_1",
        "body": "Naked is the way, buy in now or play catchup later. Not even looking at selling till triple digits!",
        "created_utc": 1619887873,
        "id": "gwk4w9n",
        "score": 11,
        "subreddit": "Wallstreetbetsnew",
        "created": 1619916673.0
    },
    {
        "author": "BigBeezy905",
        "body": "Handjobs are now encouraged in all AMC theaters",
        "created_utc": 1619894375,
        "id": "gwkkejn",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619923175.0
    },
    {
        "author": "mauisponger",
        "body": "All you need to do is take NVAX for example. Then just think about a pill vaccine getting funding. There’s a chance you get caught holding but this price right now is superb regardless of blow up next week or not",
        "created_utc": 1619920313,
        "id": "gwm2i2t",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619949113.0
    },
    {
        "author": "UsernameIWontRegret",
        "body": "Okay I’ll give it a go. \n\nP/E ratios have been swinging out further and further over the past couple of decades. This is because the only way for growth stocks to make money is to increase the price of the stock. People may be fine now with overextended P/E ratios, but eventually most investors are not going to be okay with a stock that has the next 30, 40, 50, or 60 years priced in. They’re going to see that as a risk and choose not to invest. Then the “growth” of the growth stocks will either slow dramatically or come crashing down. \n\nWe are at the top left portion of an upside down parabola.",
        "created_utc": 1619870214,
        "id": "gwj60ae",
        "score": 10,
        "subreddit": "investing",
        "created": 1619899014.0
    },
    {
        "author": "NrdRage",
        "body": "Write a 5000 word post.\n\nThen control c it, and paste it into another post box.\n\nDo that about 30 times and see what the spacinh looks like after all those copies.\n\nNow you know what every Friday post entails doing as I hunt for whatever words are triggering auto delete",
        "created_utc": 1619916762,
        "id": "gwlw5yz",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619945562.0
    },
    {
        "author": "mishka__",
        "body": "Starting to feel like the markets are now just about either swing trading SPY or trying to time P&amp;D tickers. Fundamentals have completely gone out the window.",
        "created_utc": 1619884511,
        "id": "gwjwv47",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619913311.0
    },
    {
        "author": "loadmanagement",
        "body": "Before you consider GME, you'll want to hear this.\n\nInvesting legends and Motley Fool Co-founders David and Tom Gardner just revealed what they believe are the 10 best stocks for investors to buy right now...",
        "created_utc": 1619886710,
        "id": "gwk23r2",
        "score": 10,
        "subreddit": "options",
        "created": 1619915510.0
    },
    {
        "author": "rogue_shorter313",
        "body": "Nice work! Now transfer all that to fidelity! 💎 👐 🚀",
        "created_utc": 1619891435,
        "id": "gwkdf1u",
        "score": 10,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1619920235.0
    },
    {
        "author": "Walden_Walkabout",
        "body": "Well, they have trillions in assets and capital to work from stable clients that aren't blowing money on memes with while Robinhood has a fraction of that and has people trading way more than they should. \n\nRegardless, some of these brokers did put restrictions on GME, but they didn't need to go nearly as far as RH.\n\n https://www.marketwatch.com/story/gamestop-amc-trading-is-now-being-restricted-at-td-ameritrade-11611769804",
        "created_utc": 1619897615,
        "id": "gwkrmhr",
        "score": 10,
        "subreddit": "stocks",
        "created": 1619926415.0
    },
    {
        "author": "StatikSquid",
        "body": "There's like 5 new subs for GME right now",
        "created_utc": 1619904570,
        "id": "gwl7sxb",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619933370.0
    },
    {
        "author": "StonkWonker",
        "body": "Now this is a fact",
        "created_utc": 1619891495,
        "id": "gwkdjmx",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619920295.0
    },
    {
        "author": "CallsOnAlcoholism",
        "body": "Posting my sports bets because it’s the weekend shitposting and we need action:\n* RED SOX -1.5, 1u - Sox are on a heater and the Rangers are trash\n* Hornets -7.5, 3u - Pistons are putting out their farm team today. This looks like a lock\n* Steph Curry o35.5 points, 2u - if it ain’t broke, don’t fix it\n* Warriors -8.5, 1u - Dubs need every win they can get. Expecting them to ball out here\n* Wizards +4, 2u - Wizards are playing amazing ball right now and keep beating the spread. Again, if it ain’t broke...\n* Grizzlies TT o115.5, 1u - slightly worried about a blow-out here, but I’m tailing a guy in the sportsbook POTD thread who generally crushes it\n\ncc u/FannyPackPhantom",
        "created_utc": 1619909417,
        "id": "gwliqjh",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619938217.0
    },
    {
        "author": "Walt826",
        "body": "I’ve been watching AMZN’s P/E ratio for years now. It keeps going down, while the stock price keeps going up. I always figured they haven’t split the stock due to its high P/E in the past — waiting until it gets to 30-50 range. We are soon there and indeed there was a recent rumor a split will be coming soon. Likely this year.",
        "created_utc": 1619911502,
        "id": "gwlml2n",
        "score": 10,
        "subreddit": "investing",
        "created": 1619940302.0
    },
    {
        "author": "irresponsible_owl",
        "body": "An S&amp;P 500 fund is essentially a managed fund. Stocks are added and removed multiple times a year, like you said, by a committee. It's not an algorithm that chooses the stocks, it's a group of humans.\n\nThe S&amp;P 500, by its nature, will \"buy high\" and \"sell low\" because a company already needs to be successful to be added to the index and they remove unsuccessful companies.\n\nThere was a study a while ago that found that if you invested in the original list of companies in the S&amp;P 500 and didn't follow the index,  you'd outperform the index by a wide margin. That's because the index has a history of removing companies while they're down and later adding them back when they recover. If you simply held on to the companies, you'd have done better. And that even accounts for the fact that many of the original companies no longer exist.\n\nThe index was meant to track the state of the market, not provide the best returns. The fact that it's now a major investment is something the original designers of the index never intended.",
        "created_utc": 1619911643,
        "id": "gwlmudo",
        "score": 10,
        "subreddit": "stocks",
        "created": 1619940443.0
    },
    {
        "author": "Z0mbies8mywife",
        "body": "Nah man beeps and boops are so 2020 now days the kids put the little \"BluhBlehs\" in there. It's like a bleep and a bloop had a baby but there's a possibility that wompwomp might actually be the father.",
        "created_utc": 1619912154,
        "id": "gwlns7u",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619940954.0
    },
    {
        "author": "Waitwhonow",
        "body": "If ANYTHING we have learnt in this market in the past 4 months.\n\nIf it rises fast- it will fall faster( most low/mid cap stocks are totally crushed and still havent recovered- and these companies actually make Atleast ‘ something’  tangible)\n\nCrypto is not going to be any different.\n\nIts on its own cycle- but it will happen.\n\nAlso- the Mega cap companies like Amazon, msft are now calling for Crypto regulation- to combat the ransomware problem.\n\nIt will be a hard hard drop when that happens( and its a matter of WHEN- no IF)\n\nElon is responsible for this shitcoin rally.",
        "created_utc": 1619919290,
        "id": "gwm0o80",
        "score": 10,
        "subreddit": "StockMarket",
        "created": 1619948090.0
    },
    {
        "author": "ryanryans425",
        "body": "If you’re not getting into PSFE right now you’re a dumbass.  Most undervalued stock on the market, $40 by end of year easily.",
        "created_utc": 1619927880,
        "id": "gwmez0l",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1619956680.0
    },
    {
        "author": "ForeverYonge",
        "body": "The Amazon store is trash now. AWS and maybe prime content is where they are good. \n\nThe last book I ordered arrived mangled and they had to resend it. No way they made money on that. \n\nStore is full with cheap clones, some of which are Dropshipped from China. Inventory commingling means quality is always a wildcard. \n\nThe only time I still use Amazon is when I want a no questions asked return policy. For cheap stuff, I go to Ali express to get it much cheaper. For expensive stuff, buying from more official retailers is worth the slightly higher price.",
        "created_utc": 1619901573,
        "id": "gwl0hgc",
        "score": 9,
        "subreddit": "investing",
        "created": 1619930373.0
    },
    {
        "author": "adjacent-analyst",
        "body": "fuck \n\nnow we riot",
        "created_utc": 1619885346,
        "id": "gwjyu15",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1619914146.0
    },
    {
        "author": "conncurr24",
        "body": "Former PLTR bull here. PLTR is going to under $20 after earnings. Get out now unless you’re a part of the “$200 stock in 3-5 years” cult. Not financial advise just common sense lol.",
        "created_utc": 1619896140,
        "id": "gwkocuv",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1619924940.0
    },
    {
        "author": "Illier1",
        "body": "WSB users have been brigading subs for a while now and its kinda exhausting how little they know about the system",
        "created_utc": 1619917075,
        "id": "gwlwpzk",
        "score": 9,
        "subreddit": "stocks",
        "created": 1619945875.0
    },
    {
        "author": "green9206",
        "body": "You are right, market will see a correction later in the year(probably not in the summer) but the reasons are not because markets are overvalued. Market will correct due to a reason which is as of now currently unknown. Remember that markets always require a reason to correct, it doesn't matter what the reason is. The reason isn't important but the behaviour of the correction is far more important.\n\n I personally do not think the correction will be more than 20-25% so you can pretty forget about a big sized one because markets will never give you another such big opportunity to buy stocks at cheap prices because markets are not stupid. You will get cheaper prices, but not the prices you may still be satisfied with\n\n. Yes anything can happen in markets but I'm gonna go out on a limb and say its almost literally impossible for correction to be 40-50% range unless some country starts a war with usa or something or some huge volcano erupts and kills half of united states or some crazy shit like that.",
        "created_utc": 1619943732,
        "id": "gwmydh0",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1619972532.0
    },
    {
        "author": "gandhithegoat",
        "body": "If you’re not watching Warren buffet and Charlie munger right now at the Berkshire Hathaway annual meeting you’re wasting your weekend. Learnt more about the Automobile industry in two mins than i ever could.",
        "created_utc": 1619892076,
        "id": "gwkf10f",
        "score": 9,
        "subreddit": "SPACs",
        "created": 1619920876.0
    },
    {
        "author": "sharist_DIY_bio",
        "body": "Hmm, all the sector based threads have been dead for a while, if they ever were popping. I like how the mods think we are all going to dive in there now because they are highlighted in yellow. I mean, in theory, it was a good idea way back when. Now, maybe not so much, just not enough volume anywhere with the exception of ticker threads.",
        "created_utc": 1619870570,
        "id": "gwj6gx6",
        "score": 9,
        "subreddit": "SPACs",
        "created": 1619899370.0
    },
    {
        "author": "871643",
        "body": "Well, we're entering a period of high inflation (it's happening right now and isn't debatable). Soon (probably sooner than expected) the Fed will taper its QE and raise interest rates, which will eat into future earnings of companies who are unable to pass on the cost of rising commodity prices to consumers. The last period of high inflation was the 70s. I wasn't alive then and I'd wager that a huge percentage of you reading this weren't either. We don't have personal experience of high inflation. Everything is getting more expensive, and unless some of this inflation hits salaries (lol) we're going to see an outflow of capital from the stock market. \n\nPersonally, I'm looking at real estate, REITs, gold, uranium and will be dabbling in other asset classes which, historically, have done well during inflationary periods.",
        "created_utc": 1619867434,
        "id": "gwj2n9y",
        "score": 9,
        "subreddit": "investing",
        "created": 1619896234.0
    },
    {
        "author": "battlejac_74",
        "body": "If the dollar goes to shit.. ie:the depression.. all that paper, trust or whatever else you wanna call it, goes to shit.. and you now have a ton of Firestarter.  However,  the online imaginary numbers we all have, God knows where that goes. Another thought. When my dad was in his 30s (he is 60 now) some whack job \"boomer\" use to tell him \"you best get into gold while you can\". Dad, laughed, as did everyone else bc  it was just a metal of ancient days gone by such as the gold rush, and there's absolutely no way it will be worth buying... so, no one did. That man who suggested this also use to dig through the dumpsters at the AFB and take out scrap gold wire. Long story short... that mans son is friggin loaded.  He is dead but still, bc he had a hunch, and bought \"worthless metal\" instead of buying trusts &amp; bonds (the winners back then) he quadrupled his money. A) metal will continue to go up... slowly but ALWAYS goes up with the dollar where as the dollar may not. B) sometimes nutcase bear boomers are right C) GME is not always the answer. \nYes... I too am stupid.. yes, I have metal. Yes, one day, I see us going into another depression.",
        "created_utc": 1619920811,
        "id": "gwm3d7v",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1619949611.0
    },
    {
        "author": "NrdRage",
        "body": "2001 was a targeted correction that only significantly affected one sector.\n\n2008 was a broad correction that could not be solved by QE - only completely wiping out debt could have stopped that.\n\nOur problem right now is neither debt (well, I mean...it is, but nobody believes it) nor sector-specific froth.",
        "created_utc": 1619944183,
        "id": "gwmyu6y",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1619972983.0
    }
]