[
    {
        "author": "X-Boozemonkey-X",
        "body": "Im a SOXL bull. Here's my take. NVDA at some point will take a breather. AMD has room to run but is not a big part of SOXL. TSM has room to run. LRCX, AVGO, INTC, TXN, ADI, SOXX, and MU are near all time highs.\n\nThere is no doubt in my mind that the demand for chips is through the roof amd will remain high. Every industry thats booming needs them. The shortage is a positive thing for us. Demand is high. We dont want a glut. We want to operate at a slight shortage. That said, we will need perfect numbers to start the next leg up or a breather to let things cool off. Ive been hoarding shares on the dips and am selling covered calls and cash secured puts and then putting the money towards more shares.",
        "created_utc": 1618499142,
        "id": "gum1eqs",
        "permalink": "/r/wallstreetbets/comments/mrbmfj/daily_discussion_thread_for_april_15_2021/gum1eqs/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618527942.0
    },
    {
        "author": "RADIO02118",
        "body": "The top 5 most shorted stocks by hedgies at the end of last quarter are TSLA, AMD, IBM, ADI and VIAC. All industry leaders. \n\nGo get em boys.",
        "created_utc": 1617896403,
        "id": "gttkxaa",
        "permalink": "/r/wallstreetbets/comments/mmog6c/daily_discussion_thread_for_april_08_2021/gttkxaa/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617925203.0
    },
    {
        "author": "deSeingalt",
        "body": "  NXPI ADI MU",
        "created_utc": 1617884431,
        "id": "gtsvs97",
        "permalink": "/r/wallstreetbets/comments/mmog6c/daily_discussion_thread_for_april_08_2021/gtsvs97/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617913231.0
    },
    {
        "author": "edwinshereen",
        "body": "Teradyne. they were initially a stock I looked at because they took a big hit during the pandemic but after doing research into the company I saw that they were a very consistent company in terms of revenue and profit.  Their high-profile customers include Samsung, Qualcomm, Intel, Analog Devices, Texas Instruments and IBM. I see this is an indication that they will be around for quite a while. Also since the pandemic, they have been steadily and consistently increasing in price.",
        "created_utc": 1618852096,
        "id": "gv3oug0",
        "permalink": "/r/stocks/comments/mts4ne/what_under_the_radar_stock_have_you_been_buying/gv3oug0/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618880896.0
    },
    {
        "author": "kkInkr",
        "body": "There are bunch of chip companies, why just focus on AMD, NVDA, INTC, TSM.\n\nADI, AMAT, ASML, ATEYY, AVGO, KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI, QCOM, QRVO, SIMO, SWKS, TER.\n\nThere's also some small ones: Pixelworks, Himax.\n\nThere's also the design part: CDNS, SNPS.",
        "created_utc": 1617547643,
        "id": "gtcnpap",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtcnpap/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617576443.0
    },
    {
        "author": "Guero3663",
        "body": " Just did the math and came out with the same results. Wish i Would have read beforehand. 3am on the west coast and my Adi hasn’t kicked in yet.",
        "created_utc": 1617620361,
        "id": "gtfvttw",
        "permalink": "/r/wallstreetbets/comments/mkh6uy/gamestop_announces_preliminary_sales_results_for/gtfvttw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617649161.0
    },
    {
        "author": "X-Boozemonkey-X",
        "body": "Nvdia, avgo, lrcx, amd, txn, adi. Were all down about 20% in February/ March. FB, MSFT, and GOOGl arnt the only tech stocks in the nasdaq imfao",
        "created_utc": 1617924304,
        "id": "gtvccoj",
        "permalink": "/r/wallstreetbets/comments/mn04vf/what_are_your_moves_tomorrow_april_09_2021/gtvccoj/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1617953104.0
    }
]