[
    {
        "author": "fufm",
        "body": "❌ Get sleep so I dont show up to my office looking like Edward Norton halfway thru fight club\n\n✅ Stare at futures charts all night without even trading them or having any live positions on the regular market because I’m a degenerate",
        "created_utc": 1632205190,
        "id": "hdotsip",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1632233990.0
    },
    {
        "author": "mitttttch",
        "body": "Anyone have any insight on the relatively new Cybersecurity company IronNet? The CEO, Keith Alexander, has an extensive resume working in the NSA, DOD and Army Intelligence.\n\nAnyone think they have a chance to compete with say, Fortinet, Sophos, Symantec, Kaspersky, Crowdstrike, Zscaler, and other majors??\n\n\"Founded in 2014 by GEN (Ret.) Keith Alexander, IronNet Cybersecurity is a global cybersecurity leader that is transforming how organizations secure their networks by delivering the first-ever Collective Defense platform operating at scale. Employing a high number of former NSA cybersecurity operators with offensive and defensive cyber experience, IronNet integrates deep tradecraft knowledge into its industry-leading products to solve the most challenging cyber problems facing the world today.\"",
        "created_utc": 1631568921,
        "id": "hcqql4d",
        "score": 5,
        "subreddit": "stocks",
        "created": 1631597721.0
    },
    {
        "author": "marioistic",
        "body": "On top of all those you mentioned I like S, NLOK, CYBR, SAIL\n\nRPD is doing well and still pretty cheap to get in \n\nFTNT and NET are probably one of the most robust cybertech companies but they’ve had a huge run up recently",
        "created_utc": 1630623638,
        "id": "hbdl6ml",
        "score": 4,
        "subreddit": "investing",
        "created": 1630652438.0
    },
    {
        "author": "ArmlessRetard",
        "body": "Selling into any morning rally boys.    \n\nWill APPLE take a huge dump today?   Or Is it *REALLY* going to pop on some magic announcement that will run everyone out to buy their new gadgets?  Tune in today and find out.\n\nAPPL apparently fixed some security vulnerability .. what the hell is going on there?   They forget to put Norton on there?   People can hack your phone silently by raising their eyebrows the right way or something?    What was that about?    Just a little mention by the press.  nothing to see there.  🤣\n\nThese assets that cannot be named are pooping  the bed too.   What's going on here?  \n\nI will buy an assload more of HOOD if drops below 38.",
        "created_utc": 1631620117,
        "id": "hct4p65",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631648917.0
    },
    {
        "author": "satmadan",
        "body": "Great flick. Edward Norton crushes it",
        "created_utc": 1631406710,
        "id": "hci3rsg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631435510.0
    },
    {
        "author": "Stupid-Dummy",
        "body": "Yup - Well-run company with an effective next-generation endpoint product.  All of the talented sales folks at the legacy companies have long ago departed for CRWD and others that are moving in the right direction so there is little headwind from the installed base of legacy solutions like McAfee, Symantec, etc.  That's why they've grown as large as they are so quickly.\n\nIn short, good products + well-run company = quality stock\n\nThe better investment - especially for option YOLO action is $S (SentinelOne)\n\nIf $CRWD is Hertz, then $S is Avis and the market needs at least 2 major players so there is tons of room for S1 to grow quickly.  The stock has been drifting down over the last few days so I've been scaling into Dec 60 and Dec 70 calls.  Earnings are early December and a rise back to 70 is a given and I'd not be surprised to see it tickle $100 before January.\n\nPositions\n\n2000 shares\n\n10 x Dec 60 calls\n\n10 x Dec 70 calls\n\n&amp;#x200B;\n\nNot financial advice.  I am an idiot.",
        "created_utc": 1632827967,
        "id": "hekz2dh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632856767.0
    },
    {
        "author": "AbjectDrink3276",
        "body": "Well hope it turns around cause I’m feel like es Norton in American history x right about now",
        "created_utc": 1631656306,
        "id": "hcvhxno",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631685106.0
    },
    {
        "author": "CallsOnAlcoholism",
        "body": "I saw a NLOK commercial so that is bullish for my LEAPS",
        "created_utc": 1631840644,
        "id": "hd5guwl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631869444.0
    }
]