[
    {
        "author": "sonofalando",
        "body": "Been eyeing ACN. Info tech company out of Ireland who had a massive quarter 8 PE up from 4 quarters around the 1 range . On a bearish pattern right now after hitting ATH, but just acquired new technology org. Tits deep many areas of infotech and utilities. Not a ton of debt, costs as much as GME, and has been above the 200SMA YOY. Only 600m outstanding shares, not much short float, 74% institutional ownership. Seems like it could be a value play though entry is a bit spendy. Downside is debt taken on acquiring said company, but could also offer future upside.\n\nWent on a bearish trend for a day and now seems to have entered a sideways volatile pattern with support in the 240 range. \n\nThoughts from anyone else? Seems like a good value play. What am I missing?",
        "created_utc": 1612256278,
        "id": "glplvzv",
        "permalink": "/r/stocks/comments/laqopg/rstocks_daily_discussion_technicals_tuesday_feb/glplvzv/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1612285078.0
    },
    {
        "author": "Impressive-Swimmer36",
        "body": "KE is one of the biggest parties in China. They mainly operate in China where their biggest competitor is E-House. It's better to compare it to the market in China instead of comparing it to Zillow or Rightmove. They want to improve the efficiency in China with their ACN operating system. Due to this system housing customers at different locations can be efficiently matched through collective efforts propelled by ACN.",
        "created_utc": 1612303435,
        "id": "glsdy5y",
        "permalink": "/r/investing/comments/lb2ztq/dd_on_ke_holdings_beke/glsdy5y/",
        "score": 1,
        "subreddit": "investing",
        "created": 1612332235.0
    },
    {
        "author": "OverRatedRaptor",
        "body": "You should be able to access the BB Terminal with Citrix, so it is available for Mac as well.",
        "created_utc": 1612208314,
        "id": "gln0i1s",
        "permalink": "/r/wallstreetbets/comments/labst6/gme_and_amc_short_data_taken_from_bloomberg/gln0i1s/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1612237114.0
    },
    {
        "author": "Overall-Situation-41",
        "body": "its most likely a remote connection through citrix",
        "created_utc": 1612208387,
        "id": "gln0oy4",
        "permalink": "/r/wallstreetbets/comments/labst6/gme_and_amc_short_data_taken_from_bloomberg/gln0oy4/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1612237187.0
    },
    {
        "author": "1sttimeverbaldiarrhe",
        "body": "Work From Home &gt; VPN &gt; RDP/CITRIX &gt; Office PC running Bloomberg.",
        "created_utc": 1612208818,
        "id": "gln1s0c",
        "permalink": "/r/wallstreetbets/comments/labst6/gme_and_amc_short_data_taken_from_bloomberg/gln1s0c/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1612237618.0
    },
    {
        "author": "RollingGreens",
        "body": "Do you use Schwab's Streetsmart Edge? I agree their online platform is pretty bland but SSE you can launch through citrix on mac or download a desktop version on PC. It's pretty good for what I use it for.",
        "created_utc": 1612188173,
        "id": "gllkffw",
        "permalink": "/r/wallstreetbets/comments/la0n4z/daily_discussion_thread_for_february_01_2021/gllkffw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612216973.0
    },
    {
        "author": "Gooberbober",
        "body": "Even with that benefit of the doubt, it would still mean NPR doesn't do even the most basic basic due dillegence to verify their sources.\n\nIt isn't like it takes an expert to F5 a subreddit and see what is going on.",
        "created_utc": 1612201316,
        "id": "glmi4ze",
        "permalink": "/r/wallstreetbets/comments/la5650/its_very_interesting_to_see_how_much_targeted/glmi4ze/",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1612230116.0
    },
    {
        "author": "AsIWit",
        "body": "This was back when i would pray u/haupt91 had some free time that day rather than shitting my pants spamming f5 because DFV hadn't posted yet 8 min after close.",
        "created_utc": 1612236747,
        "id": "glotj7t",
        "permalink": "/r/wallstreetbets/comments/lal1g7/courtesy_of_uterribletraderig_this_is_the_caliber/glotj7t/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1612265547.0
    },
    {
        "author": "BowlFullOfDeli_bird",
        "body": "Guy who just took wife to hospital for first child update:\n\nShe’s good but is being induced. Gives me time to smash F5 and see how this all plays out. \n\nHOLD THE LINE! DONT SELL! BUY THE DIP! SLV IS A CON! 🦍🦍🦍 STRONG TOGETHER!!!\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "created_utc": 1612194286,
        "id": "gllzveh",
        "permalink": "/r/wallstreetbets/comments/la5s8i/gme_discussion_thread_for_february_01_2021_part_2/gllzveh/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1612223086.0
    },
    {
        "author": "18minstothinkofaname",
        "body": "I HAVE BEEN HAVING AN EXTRAMARITAL AFFAIR WITH THE F5 BUTTON FOR A FEW WEEKS PEOPLE WONT AGREE BUT WE'LL SHOW THE DOUBTERS AND HATERS THIS A LOVE AFFAIR THAT AINT STOPPING UNTIL IT REACHES THE MOON 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "created_utc": 1612972857,
        "id": "gmttywe",
        "permalink": "/r/wallstreetbets/comments/lgrxxk/gme_reeee_consolidation_zone_210/gmttywe/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1613001657.0
    },
    {
        "author": "ShawarmaOrigins",
        "body": "As of 9:35:  **Short Interest** 78.46\n\n[https://imgur.com/a/GGqHFQj](https://imgur.com/a/GGqHFQj) \n\nIt keeps flipping between that and 226. Ctrl+F5 a few times and you'll see what i mean.",
        "created_utc": 1612924848,
        "id": "gmruxng",
        "permalink": "/r/wallstreetbets/comments/lgb0h7/tonights_si_report/gmruxng/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1612953648.0
    },
    {
        "author": "eat_snacky_smores",
        "body": "I dont even know why im F5'ing like a weirdo. Im not selling.",
        "created_utc": 1612287452,
        "id": "glr95sx",
        "permalink": "/r/wallstreetbets/comments/layuxv/daily_discussion_thread_for_february_02_2021_part/glr95sx/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1612316252.0
    },
    {
        "author": "dalepmay1",
        "body": "1. Install a VPN\n2. Open Microsoft Outlook\n3. Open VBA editor\n4. Insert a module\n5. Enter the following code in that module:\n\n&amp;#8203;\n\n    Sub SendItToTheMoon()\n        Dim m As MailItem, counter As Double\n        \n        counter = 1 ' Change this to however many times you want to send this email\n        \n        While counter &gt; 0\n            Set m = CreateItem(olMailItem)\n            m.BodyFormat = olFormatHTML\n            \n            m.Subject = \"Active Market Manipulation [15 U.S.C.A. § 78i]\"\n            m.HTMLBody = \"&lt;html&gt;&lt;body&gt;Dear SEC and President Biden,&lt;br&gt;&lt;br&gt;\" &amp; _\n                        \"&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;I am calling on you today, pursuant to 15 U.S.C.A. § 78i, titled Manipulation of Security Prices, to prohibit manipulative and deceptive tactics that artificially depresses the price of GME and AMC securities in contravention of the laws of the United States.&lt;br&gt;&lt;br&gt;\" &amp; _\n                        \"&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;Section 78i(a) clearly states that 'It shall be unlawful for any person, directly or indirectly, by the use of the mails or any means or instrumentality of interstate commerce, or of any facility of any national securities exchange, or for any member of a national securities exchange -- (2) To effect, alone or with 1 or more other persons, a series of transactions in any security registered on a national securities exchange, any security not so registered, or in connection with any security-based swap or security-based swap agreement with respect to such security creating actual or apparent active trading in such security, or raising or depressing the price of such security, for the purpose of inducing the purchase or sale of such security by others.&lt;br&gt;&lt;br&gt;\" &amp; _\n                        \"&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;Currently, GME and AMC stock prices are actively being manipulated using a mechanism called 'short ladder attacks' to depress the price of these stocks in contravention of 15 U.S.C.A. § 78i. 'Short ladder attacks' occur when large institutions in possession of the aforementioned stocks sell them for just less than market value in rapid succession between one another in order to drive the price down.&lt;br&gt;&lt;br&gt;\" &amp; _\n                        \"The fact that short ladder attacks exist is apparent from on-going market activity that can be seen here&lt;br&gt;\" &amp; _\n                        \"https://www.reddit.com/r/wallstreetbets/comments/la682h/visual_representation_of_a_short_ladder_attack_4/&lt;br&gt;\" &amp; _\n                        \"https://i.gyazo.com/d33d2d9346092b3c041c54fc394225c3.png&lt;br&gt;&lt;br&gt;\" &amp; _\n                        \"(Check this from the huge dip last Thursday. No volume but still an enormous dip in price)&lt;br&gt;\" &amp; _\n                        \"https://preview.redd.it/nmiqx27md4e61.jpg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=f3e61c081b3332670eaa8b972c309c6d56177e33 https://www.reddit.com/r/wallstreetbets/comments/l71yxn/ladder_selling_explained/&lt;br&gt;&lt;br&gt;\" &amp; _\n                        \"&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;Such blatant attacks readily establishes prima facie case of market manipulation and must be investigated by the SEC immediately. Further silence from the SEC on this matter, which can be investigated quite quickly, not only encourages further market manipulation but also further diminishes public trust and faith in the U.S. Government.&lt;br&gt;&lt;br&gt;\" &amp; _\n                        \"&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;Finally, section 78i(f) makes it clear that 'Any person who willfully participates in any act or transaction in violation of subsections (a), (b), or (c) of this section, shall be liable to any person who shall purchase or sell any security at a price which was affected by such act or transaction.&lt;br&gt;&lt;br&gt;\" &amp; _\n                        \"&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;I am calling on you to do your job. The direct manipulation of GME and AMC stock prices is an on-going crisis that directly hurts the public interest and is AGAINST THE LAW. You must act now before it is too late.&lt;br&gt;&lt;br&gt;\" &amp; _\n                        \"Sincerely,&lt;br&gt;&lt;br&gt;\" &amp; _\n                        \"Your Average Retail Investor&lt;/body&gt;&lt;/html&gt;\"\n            m.Recipients.Add \"help@sec.gov\"\n            m.Send\n            counter = counter - 1\n        Wend\n        \n    End Sub\n    \n\n1. Change the \"1\" in the line \"counter = 1\" to however many times you want the message to be sent.\n2. Press F5, or click the green play button up top.\n3. Sit back and watch your Sent Items folder fill up.",
        "created_utc": 1612229974,
        "id": "glofm6b",
        "permalink": "/r/wallstreetbets/comments/laferl/15_usca_78i_the_illegality_of_short_ladder/glofm6b/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1612258774.0
    },
    {
        "author": "GiantPandammonia",
        "body": "The only stock I've ever bought is gme. I've never sold a stock in my life.  I'm not sure if my hands are turning to diamond or if it's carpel tunnel from hitting F5. I also don't know how to make emojis.",
        "created_utc": 1612301573,
        "id": "gls9aod",
        "permalink": "/r/wallstreetbets/comments/lb6aiq/what_are_your_moves_tomorrow_february_03_2021/gls9aod/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1612330373.0
    },
    {
        "author": "JimEasy",
        "body": "Idk, I’m new here. I just went ahead and set an alert my phone for significant moves in price and stopped watching the ticker constantly. Rapidly hitting F5 doesn’t do anything. New short positions come out tomorrow from my understanding. I’ll check back in then. \n\nStill holding 45 GME @ $328 and ~500+ AMC at $13-14. 💎👐",
        "created_utc": 1612817943,
        "id": "gmmfzpq",
        "permalink": "/r/wallstreetbets/comments/lfi8ck/the_last_retard/gmmfzpq/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1612846743.0
    },
    {
        "author": "Tigerman456",
        "body": "Shift + f5 will clear your cache. Otherwise open an incognito window",
        "created_utc": 1612924513,
        "id": "gmruadd",
        "permalink": "/r/wallstreetbets/comments/lghaex/gme_and_amc_short_interest_data/gmruadd/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1612953313.0
    },
    {
        "author": "surprised-duncan",
        "body": "google's stock page keeps giving me captchas cuz i'm hitting f5 too much lol\n\nyeah i could let it refresh on its own, but that's no fun for my 💎🙌",
        "created_utc": 1612286694,
        "id": "glr78bm",
        "permalink": "/r/wallstreetbets/comments/laujs5/gme_thread_for_2221/glr78bm/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1612315494.0
    },
    {
        "author": "foeplay44",
        "body": "I can't stop hitting F5",
        "created_utc": 1613085726,
        "id": "gmzxfky",
        "permalink": "/r/SPACs/comments/lf3ojp/cciv_mega_thread_for_the_week_of_feb082021/gmzxfky/",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1613114526.0
    },
    {
        "author": "22134484",
        "body": "iirc, ctrl+F5 works for that, or shift+F5, i dont know",
        "created_utc": 1612937428,
        "id": "gmsg1rn",
        "permalink": "/r/wallstreetbets/comments/lgk1ef/the_squeeze_has_not_yet_sqouze_lets_discuss/gmsg1rn/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1612966228.0
    },
    {
        "author": "Max_Banhammer",
        "body": "I'll be sitting at work F5-ing this sub for chuckles while holding strong with my diamond asscheeks.",
        "created_utc": 1612299996,
        "id": "gls5483",
        "permalink": "/r/wallstreetbets/comments/lb6aiq/what_are_your_moves_tomorrow_february_03_2021/gls5483/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1612328796.0
    },
    {
        "author": "kawangkoankid",
        "body": "Shift + f5 refreshes the page and cache",
        "created_utc": 1612937951,
        "id": "gmsgq7g",
        "permalink": "/r/wallstreetbets/comments/lgk1ef/the_squeeze_has_not_yet_sqouze_lets_discuss/gmsgq7g/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1612966751.0
    },
    {
        "author": "acididica",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613753557,
        "id": "go0uein",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0uein/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1613782357.0
    },
    {
        "author": "TryToGiveADuck",
        "body": "To the moon!!\n\n MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754095,
        "id": "go0vmmy",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0vmmy/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613782895.0
    },
    {
        "author": "nvrsmr1",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613752905,
        "id": "go0swu9",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0swu9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613781705.0
    },
    {
        "author": "NuclearReactions",
        "body": "I also like MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613753291,
        "id": "go0tsl7",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0tsl7/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613782091.0
    },
    {
        "author": "NowLickIt",
        "body": "I'm a big fan of these stocks for no other reason than the letters look good together\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613753061,
        "id": "go0t9jn",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0t9jn/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613781861.0
    },
    {
        "author": "DroneCone",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613753360,
        "id": "go0tyaj",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0tyaj/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613782160.0
    },
    {
        "author": "realbeats",
        "body": "I like, AEW, WCW, NWA, NWO, ECW, WWE, WWF, BWO, NJPW, NGW, WOW, LOL and FTW but Im also fond of\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613755165,
        "id": "go0y1b3",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0y1b3/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613783965.0
    },
    {
        "author": "RyanHatesReddit",
        "body": " Check out the stonks I like. \n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nI am not a financial advisor nor am I giving any financial advice. I simply like these stocks.",
        "created_utc": 1613754151,
        "id": "go0vr4d",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0vr4d/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613782951.0
    },
    {
        "author": "TronicCronic",
        "body": "Cached info if you still see 226. Hold ctrl and hit f5 to refresh the page with un-cached info.",
        "created_utc": 1612925370,
        "id": "gmrvxu4",
        "permalink": "/r/wallstreetbets/comments/lgk1ef/the_squeeze_has_not_yet_sqouze_lets_discuss/gmrvxu4/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1612954170.0
    },
    {
        "author": "PointlessSquare",
        "body": "I put $ signs in front of em all incase they look for that instead :)   \n\n\n$MMM, $ABT, $ABBV, $ABMD, $ACN, $ATVI, $ADBE, $AMD, $AAP, $AES, $AFL, $A, $APD, $AKAM, $ALK, $ALB, $ARE, $ALXN, $ALGN, $ALLE, $AGN, $ADS, $LNT, $ALL, $GOOGL, $GOOG, $MO, $AMZN, $AMCR, $AEE, $AAL, $AEP, $AXP, $AIG, $AMT, $AWK, $AMP, $ABC, $AME, $AMGN, $APH, $ADI, $ANSS, $ANTM, $AON, $AOS, $APA, $AIV, $AAPL, $AMAT, $APTV, $ADM, $ARNC, $ANET, $AJG, $AIZ, $ATO, $T, $ADSK, $ADP, $AZO, $AVB, $AVY, $BKR, $BLL, $BAC, $BK, $BAX, $BDX, $BRK.B, $BBY, $BIIB, $BLK, $BA, $BKNG, $BWA, $BXP, $BSX, $BMY, $AVGO, $BR, $BF.B, $CHRW, $COG, $CDNS, $CPB, $COF, $CPRI, $CAH, $KMX, $CCL, $CAT, $CBOE, $CBRE, $CDW, $CE, $CNC, $CNP, $CTL, $CERN, $CF, $SCHW, $CHTR, $CVX, $CMG, $CB, $CHD, $CI, $XEC, $CINF, $CTAS, $CSCO, $C, $CFG, $CTXS, $CLX, $CME, $CMS, $KO, $CTSH, $CL, $CMCSA, $CMA, $CAG, $CXO, $COP, $ED, $STZ, $COO, $CPRT, $GLW, $CTVA, $COST, $COTY, $CCI, $CSX, $CMI, $CVS, $DHI, $DHR, $DRI, $DVA, $DE, $DAL, $XRAY, $DVN, $FANG, $DLR, $DFS, $DISCA, $DISCK, $DISH, $DG, $DLTR, $D, $DOV, $DOW, $DTE, $DUK, $DRE, $DD, $DXC, $ETFC, $EMN, $ETN, $EBAY, $ECL, $EIX, $EW, $EA, $EMR, $ETR, $EOG, $EFX, $EQIX, $EQR, $ESS, $EL, $EVRG, $ES, $RE, $EXC, $EXPE, $EXPD, $EXR, $XOM, $FFIV, $FB, $FAST, $FRT, $FDX, $FIS, $FITB, $FE, $FRC, $FISV, $FLT, $FLIR, $FLS, $FMC, $F, $FTNT, $FTV, $FBHS, $FOXA, $FOX, $BEN, $FCX, $GPS, $GRMN, $IT, $GD, $GE, $GIS, $GM, $GPC, $GILD, $GL, $GPN, $GS, $GWW, $HRB, $HAL, $HBI, $HOG, $HIG, $HAS, $HCA, $PEAK, $HP, $HSIC, $HSY, $HES, $HPE, $HLT, $HFC, $HOLX, $HD, $HON, $HRL, $HST, $HPQ, $HUM, $HBAN, $HII, $IEX, $IDXX, $INFO, $ITW, $ILMN, $IR, $INTC, $ICE, $IBM, $INCY, $IP, $IPG, $IFF, $INTU, $ISRG, $IVZ, $IPGP, $IQV, $IRM, $JKHY, $J, $JBHT, $SJM, $JNJ, $JCI, $JPM, $JNPR, $KSU, $K, $KEY, $KEYS, $KMB, $KIM, $KMI, $KLAC, $KSS, $KHC, $KR, $LB, $LHX, $LH, $LRCX, $LW, $LVS, $LEG, $LDOS, $LEN, $LLY, $LNC, $LIN, $LYV, $LKQ, $LMT, $L, $LOW, $LYB, $MTB, $M, $MRO, $MPC, $MKTX, $MAR, $MMC, $MLM, $MAS, $MA, $MKC, $MXIM, $MCD, $MCK, $MDT, $MRK, $MET, $MTD, $MGM, $MCHP, $MU, $MSFT, $MAA, $MHK, $TAP, $MDLZ, $MNST, $MCO, $MS, $MOS, $MSI, $MSCI, $MYL, $NDAQ, $NOV, $NTAP, $NFLX, $NWL, $NEM, $NWSA, $NWS, $NEE, $NLSN, $NKE, $NI, $NBL, $JWN, $NSC, $NTRS, $NOC, $NLOK, $NCLH, $NRG, $NUE, $NVDA, $NVR, $ORLY, $OXY, $ODFL, $OMC, $OKE, $ORCL, $PCAR, $PKG, $PH, $PAYX, $PAYC, $PYPL, $PNR, $PBCT, $PEP, $PKI, $PRGO, $PFE, $PM, $PSX, $PNW, $PXD, $PNC, $PPG, $PPL, $PFG, $PG, $PGR, $PLD, $PRU, $PEG, $PSA, $PHM, $PVH, $QRVO, $PWR, $QCOM, $DGX, $RL, $RJF, $RTN, $O, $REG, $REGN, $RF, $RSG, $RMD, $RHI, $ROK, $ROL, $ROP, $ROST, $RCL, $SPGI, $CRM, $SBAC, $SLB, $STX, $SEE, $SRE, $NOW, $SHW, $SPG, $SWKS, $SLG, $SNA, $SO, $LUV, $SWK, $SBUX, $STT, $STE, $SYK, $SIVB, $SYF, $SNPS, $SYY, $TMUS, $TROW, $TTWO, $TPR, $TGT, $TEL, $FTI, $TFX, $TXN, $TXT, $TMO, $TIF, $TJX, $TSCO, $TDG, $TRV, $TFC, $TWTR, $TSN, $UDR, $ULTA, $USB, $UAA, $UA, $UNP, $UAL, $UNH, $UPS, $URI, $UTX, $UHS, $UNM, $VFC, $VLO, $VAR, $VTR, $VRSN, $VRSK, $VZ, $VRTX, $VIAC, $V, $VNO, $VMC, $WRB, $WAB, $WMT, $WBA, $DIS, $WM, $WAT, $WEC, $WFC, $WELL, $WDC, $WU, $WRK, $WY, $WHR, $WMB, $WLTW, $WYNN, $XEL, $XRX, $XLNX, $XYL, $YUM, $ZBRA, $ZBH, $ZION, $ZTS",
        "created_utc": 1613755180,
        "id": "go0y2ij",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0y2ij/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613783980.0
    },
    {
        "author": "Frosty-Salamander",
        "body": "MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613755084,
        "id": "go0xuqf",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0xuqf/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613783884.0
    },
    {
        "author": "Snoo-1802",
        "body": "stocks I like - for the hedge funds buying tech to track this 🚀 🚀 🚀 MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754212,
        "id": "go0vvv1",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0vvv1/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613783012.0
    },
    {
        "author": "Jimbob2010",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754075,
        "id": "go0vl26",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0vl26/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613782875.0
    },
    {
        "author": "splicklick",
        "body": " MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613753891,
        "id": "go0v620",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0v620/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613782691.0
    },
    {
        "author": "zipitrealgood",
        "body": "There wasn’t a need in the first place. Your mom’s been tapping F5 for me when the market is open, and in return I tap that ass until the German markets open.",
        "created_utc": 1613060495,
        "id": "gmyaols",
        "permalink": "/r/wallstreetbets/comments/lhk9iv/gme_211/gmyaols/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613089295.0
    },
    {
        "author": "Kac985",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613751459,
        "id": "go0pkyk",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0pkyk/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613780259.0
    },
    {
        "author": "Kac985",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613751444,
        "id": "go0pjnb",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0pjnb/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613780244.0
    },
    {
        "author": "RobbedByALadyBoy",
        "body": "I’ve yolo’d my kids college fund into these stocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613753973,
        "id": "go0vcru",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0vcru/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613782773.0
    },
    {
        "author": "Mezzoski",
        "body": "I fully support you in yor sentiment for:  \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM,  ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO,  AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH,  ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET,  AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX,  BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR,  BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE,  CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI,  XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA,  CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI,  CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS,  DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC,  EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS,  EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX,  FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA,  FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS,  GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE,  HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO,  ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ,  IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY,  KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS,  LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO,  MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET,  MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI,  MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE,  NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY,  OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT,  PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR,  PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O,  REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC,  SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX,  STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL,  FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR,  ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO,  VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA,  DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN,  XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754187,
        "id": "go0vtvs",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0vtvs/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613782987.0
    },
    {
        "author": "g3neraL5",
        "body": "stocks I like - for the hedge funds buying tech to track this\n🚀 🚀 🚀 \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613753989,
        "id": "go0ve31",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0ve31/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613782789.0
    },
    {
        "author": "Kac985",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613751468,
        "id": "go0plpi",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0plpi/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613780268.0
    },
    {
        "author": "SickenedVendetta",
        "body": "Let the record show, these are my official positions:\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS\n\nTo the moon!",
        "created_utc": 1613754976,
        "id": "go0xly8",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0xly8/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613783776.0
    },
    {
        "author": "you_gain_a_life",
        "body": "THATS NUTS! I also happen to like the stocks MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS! too much in common!",
        "created_utc": 1613755038,
        "id": "go0xqym",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0xqym/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613783838.0
    },
    {
        "author": "bakebakingbaked",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754781,
        "id": "go0x61w",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0x61w/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613783581.0
    },
    {
        "author": "BigYoda69",
        "body": "I too like the following stocks \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754799,
        "id": "go0x7hh",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0x7hh/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613783599.0
    },
    {
        "author": "Daxty",
        "body": " \n\ncopy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754742,
        "id": "go0x2qp",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0x2qp/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613783542.0
    },
    {
        "author": "SteelChuck86",
        "body": "Cause there's like 4 million retarded apes spamming f5 on that same page morons",
        "created_utc": 1612301864,
        "id": "glsa1t1",
        "permalink": "/r/wallstreetbets/comments/lb6jld/gme_yolo_update_feb_2_2021/glsa1t1/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612330664.0
    },
    {
        "author": "SparksAndSpyro",
        "body": "Try Shift + F5 to clear browser cache",
        "created_utc": 1612933091,
        "id": "gms9pfu",
        "permalink": "/r/wallstreetbets/comments/lghaex/gme_and_amc_short_interest_data/gms9pfu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612961891.0
    },
    {
        "author": "IDONTCARE1234577777",
        "body": "I too like these stocks:\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754974,
        "id": "go0xlqe",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0xlqe/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613783774.0
    },
    {
        "author": "Hot_Loaf",
        "body": "There is a chance that I hold or like some of these stocks: \n\n MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS   ![gif](emote|free_emotes_pack|poop)",
        "created_utc": 1613754852,
        "id": "go0xbu2",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0xbu2/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613783652.0
    },
    {
        "author": "Snoo-32720",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754943,
        "id": "go0xj86",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0xj86/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613783743.0
    },
    {
        "author": "DominicTullipso",
        "body": "They pay me to sit and work on a computer all day, i just have a chrome open and hit F5 every now and then.",
        "created_utc": 1612199921,
        "id": "glmeiuk",
        "permalink": "/r/wallstreetbets/comments/la8cyt/guys_please_listen_to_this_smart_guy_in_times/glmeiuk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612228721.0
    },
    {
        "author": "luptonite",
        "body": "I too like these specific stocks\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613753650,
        "id": "go0um6q",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0um6q/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613782450.0
    },
    {
        "author": "Factitiously_Real",
        "body": "🦍 are probably banging on F5... Thanks though.\n\nF",
        "created_utc": 1612278996,
        "id": "glqlunh",
        "permalink": "/r/wallstreetbets/comments/lauvug/monday_market_opening_attack_explained_how/glqlunh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612307796.0
    },
    {
        "author": "eldryanyy",
        "body": "I envy your f5... I lost focus AH and took a nap. Woke up and this already popped",
        "created_utc": 1612317550,
        "id": "glt8b4g",
        "permalink": "/r/SPACs/comments/lbad18/israeli_startup_ree_said_to_plan_merger_with_10x/glt8b4g/",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1612346350.0
    },
    {
        "author": "beauchh",
        "body": "F5'ing your posts [like](https://i.kym-cdn.com/photos/images/original/000/643/028/442.jpg)",
        "created_utc": 1612749092,
        "id": "gmjb2f6",
        "permalink": "/r/wallstreetbets/comments/lezurx/a_totally_bs_gme_prediction/gmjb2f6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612777892.0
    },
    {
        "author": "bigwill44",
        "body": "God damn TLRY I swore to myself I would not watch the stock market and work today!!! Here we go again with the F5",
        "created_utc": 1612874589,
        "id": "gmows5p",
        "permalink": "/r/weedstocks/comments/lg0pdm/tilray_announces_agreement_with_grow_pharma_to/gmows5p/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1612903389.0
    },
    {
        "author": "KapteeniJ",
        "body": "The curious thing is, if the post was up only for 5min, how did they find it? Even if you have your interns go through the subreddit, every post, you'd still miss it unless you were 24/7 spamming F5 every minute or so. Or, if they had made the post themselves.",
        "created_utc": 1613727092,
        "id": "gnzo46m",
        "permalink": "/r/wallstreetbets/comments/lmvqyw/gamestop_congressional_hearings_part_2/gnzo46m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613755892.0
    },
    {
        "author": "MonkeyBrawler",
        "body": "Here are some great stocks i like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754443,
        "id": "go0wef8",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0wef8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613783243.0
    },
    {
        "author": "CooldudeXD",
        "body": " \n\nI copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754573,
        "id": "go0wp1x",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0wp1x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613783373.0
    },
    {
        "author": "Vlietinho",
        "body": "lol, undoable. Luckily it's 17:00 local time now, so F5 it is",
        "created_utc": 1612973800,
        "id": "gmtw5ra",
        "permalink": "/r/weedstocks/comments/lgrbyh/daily_discussion_thread_february_10_2021/gmtw5ra/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1613002600.0
    },
    {
        "author": "koosley",
        "body": "Agreed on the paper trading front. I could not tell the difference between a paper account from my FFIV Gil balance. It basically turns into a video game and no feeling associated with making or losing $1000. My first call I wrote made me $17 and I was happy with that.\n\nIts easier to start small and work your way up as your risk tolerance goes up. I was fortunate to dump 10k into the market in March when it was down so present day I can lose 5000ish learning before a 2% ally bank savings account would have a better return.",
        "created_utc": 1613323642,
        "id": "gnfxgqv",
        "permalink": "/r/options/comments/ljc0l1/can_one_make_a_living_with_just_basic_options/gnfxgqv/",
        "score": 1,
        "subreddit": "options",
        "created": 1613352442.0
    },
    {
        "author": "Alv2Rde",
        "body": "F5 season",
        "created_utc": 1612375274,
        "id": "glvytxx",
        "permalink": "/r/StockMarket/comments/lboola/gme_strategy_wednesday_23/glvytxx/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1612404074.0
    },
    {
        "author": "ShawarmaOrigins",
        "body": "wtf... mine flipped to 78.46%, and i refreshed now after seeing your reply and it's back to 226. \n\nMust be some cache issue going on. Weird. \n\nHit Ctrl+F5 a few times and it'll flip back and forth between those two numbers. \n\nJust took this screenshot: [https://imgur.com/a/GGqHFQj](https://imgur.com/a/GGqHFQj)",
        "created_utc": 1612924587,
        "id": "gmrufjf",
        "permalink": "/r/wallstreetbets/comments/lgb0h7/tonights_si_report/gmrufjf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612953387.0
    },
    {
        "author": "daneathen25",
        "body": "or yeah shift-f5. it's 15",
        "created_utc": 1612927356,
        "id": "gmrzofe",
        "permalink": "/r/Wallstreetbetsnew/comments/ld3hji/gme_and_amc_live_thread/gmrzofe/",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1612956156.0
    },
    {
        "author": "MulhollandMaster121",
        "body": "Yeah that is a worry of mine too however we have seen how the government bends over and opens wide for the airlines time and time again. No matter what they always seem to skate by. \n\nI’ve never fucked with LEAPs before but I’m trying to plant some seeds that will hopefully blossom down the road. F5 days have aged me like a decade lol",
        "created_utc": 1612837376,
        "id": "gmnjaun",
        "permalink": "/r/wallstreetbets/comments/lflpoz/what_are_your_moves_tomorrow_february_09_2021/gmnjaun/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612866176.0
    },
    {
        "author": "euro-fighter",
        "body": "Shit, I broke my F5 button.",
        "created_utc": 1612969087,
        "id": "gmtle9u",
        "permalink": "/r/weedstocks/comments/lgrbyh/daily_discussion_thread_february_10_2021/gmtle9u/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1612997887.0
    },
    {
        "author": "bigwill44",
        "body": "Repeat after me : I wont press f5 all day long",
        "created_utc": 1612966376,
        "id": "gmtfq26",
        "permalink": "/r/weedstocks/comments/lgrbyh/daily_discussion_thread_february_10_2021/gmtfq26/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1612995176.0
    },
    {
        "author": "Harushs",
        "body": "Check out msos etf and yolo etf. Let everyone panicking and f5 all day while you sit back and enjoy ;)",
        "created_utc": 1613044323,
        "id": "gmxg1ki",
        "permalink": "/r/weedstocks/comments/lhifci/daily_discussion_thread_february_11_2021/gmxg1ki/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1613073123.0
    },
    {
        "author": "Pma2kdota",
        "body": "MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, HEY, SU, CK, MY, NUTS, MEL, VIN, CAP, IT, AL, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, WE, LI, KE, THE, STO, CK, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613751658,
        "id": "go0q1so",
        "permalink": "/r/wallstreetbets/comments/lnjmb1/fuck_all_the_hedge_funds_keeping_track_of_stocks/go0q1so/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613780458.0
    },
    {
        "author": "PolyDjent",
        "body": "F5, F9 F9 F9",
        "created_utc": 1613740311,
        "id": "go03jys",
        "permalink": "/r/wallstreetbets/comments/ln32q3/ctrlz_ctrlz_ctrlz_ctrlz_ctrlz/go03jys/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613769111.0
    },
    {
        "author": "iwoketoanightmare",
        "body": "Shoulda bought an F5 with your tendies",
        "created_utc": 1612280677,
        "id": "glqqht1",
        "permalink": "/r/wallstreetbets/comments/lauvug/monday_market_opening_attack_explained_how/glqqht1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612309477.0
    },
    {
        "author": "murphysclaw1",
        "body": "lol yeah i bet they're scared as opposed to sat on here hitting f5 and laughing",
        "created_utc": 1612880293,
        "id": "gmp64id",
        "permalink": "/r/wallstreetbets/comments/lg0mn2/gme_29/gmp64id/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612909093.0
    },
    {
        "author": "Sars250",
        "body": "I'm a big fan of the following stocks:\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613751665,
        "id": "go0q2dx",
        "permalink": "/r/wallstreetbets/comments/lnjmb1/fuck_all_the_hedge_funds_keeping_track_of_stocks/go0q2dx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613780465.0
    },
    {
        "author": "bigwill44",
        "body": "Holy jesus APHA 20% premarket. My boss is gonna hate me. Here we go again for an F5 day smh.",
        "created_utc": 1612957562,
        "id": "gmt24l2",
        "permalink": "/r/weedstocks/comments/lgrbyh/daily_discussion_thread_february_10_2021/gmt24l2/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1612986362.0
    },
    {
        "author": "Redman2009",
        "body": "Really thought about yoloing my entire savings today but I got high and f5’d most of the day instead",
        "created_utc": 1612994985,
        "id": "gmva9nc",
        "permalink": "/r/wallstreetbets/comments/lh3qli/what_are_your_moves_tomorrow_february_11_2021/gmva9nc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613023785.0
    },
    {
        "author": "yaboiRich",
        "body": "Hennessey Venom F5",
        "created_utc": 1613271607,
        "id": "gncbfvf",
        "permalink": "/r/wallstreetbets/comments/likmpp/weekend_discussion_thread_for_the_weekend_of/gncbfvf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613300407.0
    },
    {
        "author": "gnnr25",
        "body": "You need to do a Shift + F5 in your browser and bypass your browser's cache to get the actual updated website",
        "created_utc": 1612930007,
        "id": "gms4hk5",
        "permalink": "/r/Wallstreetbetsnew/comments/ld3hji/gme_and_amc_live_thread/gms4hk5/",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1612958807.0
    },
    {
        "author": "Fizban2",
        "body": "shift F5 does nothing for me just a normal screen refresh",
        "created_utc": 1612930068,
        "id": "gms4lic",
        "permalink": "/r/Wallstreetbetsnew/comments/ld3hji/gme_and_amc_live_thread/gms4lic/",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1612958868.0
    },
    {
        "author": "TicTicB00M",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.  \n\n\nEdit: i am not a financial professional...i don't lose enough money to be considered one yet",
        "created_utc": 1613750102,
        "id": "go0miti",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0miti/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613778902.0
    },
    {
        "author": "jherndon22",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613752229,
        "id": "go0rd38",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0rd38/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613781029.0
    },
    {
        "author": "LoserMoron312",
        "body": "Too slow.\n\n*F5 F5 F5*",
        "created_utc": 1613584975,
        "id": "gnsfiz1",
        "permalink": "/r/pennystocks/comments/llw65v/before_you_panic_sell_today_please_note/gnsfiz1/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613613775.0
    },
    {
        "author": "zomahd",
        "body": "OH WAIT NO THAT ONE RETARD THAT OFFED HIMSELF BECAUSE HE COULDNT HIT F5",
        "created_utc": 1613675258,
        "id": "gnx2k9v",
        "permalink": "/r/wallstreetbets/comments/lm7n51/congressional_hearings_dfv_gme_etc_megathread/gnx2k9v/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1613704058.0
    },
    {
        "author": "Silent-Difficulty175",
        "body": "Today AMC GME FLT BB SNDL all in. Knuckles down!!! 🔨🔨🔨🔨🚀🚀🚀🚀",
        "created_utc": 1612364962,
        "id": "glv9gm7",
        "permalink": "/r/wallstreetbets/comments/lbl62i/daily_discussion_thread_for_february_03_2021/glv9gm7/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1612393762.0
    },
    {
        "author": "barbarkbarkov",
        "body": "I feel like 4 out of 5 stocks are down today...red everywhere. Not worries for TAKOF/FLT. I legitimately believe we will be in double digits EOY",
        "created_utc": 1613075471,
        "id": "gmzaloq",
        "permalink": "/r/pennystocks/comments/lht8yp/takof_drone_delivery_canada_about_to_takeoff/gmzaloq/",
        "score": 19,
        "subreddit": "pennystocks",
        "created": 1613104271.0
    },
    {
        "author": "Stompede",
        "body": "It did...and there will be many others. Please beware of FOMO. Play safe. I am looking at DSS, HITI and NBY as a long term play. FLT may also be on the steady rise to something great with all of the drone talk. I'm thinking of a new strategy to watch halts and jump in, but sounds risky.",
        "created_utc": 1612827010,
        "id": "gmmza1d",
        "permalink": "/r/pennystocks/comments/lfown8/ocgn_ocugen_inc_200/gmmza1d/",
        "score": 13,
        "subreddit": "pennystocks",
        "created": 1612855810.0
    },
    {
        "author": "Andrewbharris_1994",
        "body": "Anyone else holding FLT(TAKOF) for the long-haul(flight)? Drone delivery is going to seriously take off in 2021 I think🛸",
        "created_utc": 1612326172,
        "id": "gltpgv7",
        "permalink": "/r/CanadianInvestor/comments/lb6ajz/after_hours_discussion_thread_for_february_02_2021/gltpgv7/",
        "score": 13,
        "subreddit": "CanadianInvestor",
        "created": 1612354972.0
    },
    {
        "author": "poggersSpongebob",
        "body": "Flt on the new York stock exchange is $261 a share and I was like holy shit you've had this since .60. \n\nMust be different ticker here lol",
        "created_utc": 1612972465,
        "id": "gmtt1zb",
        "permalink": "/r/stocks/comments/lgw6bh/why_flt_canadian_stock_tsx_is_the_next_stock_to/gmtt1zb/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1613001265.0
    },
    {
        "author": "sporadicjesus",
        "body": "FLT/TAKOF . They are dominating the market before there is a market.\n\nBy the time anyone catches up to them, everyone will already be with DDC.\n\nSaid it before, where do you order online? AMAZON. DDC will be the amazon of drone delivery. \n\nBtw! I made a sub so people can post their r/myplaysandpositions",
        "created_utc": 1613074684,
        "id": "gmz8qvw",
        "permalink": "/r/pennystocks/comments/lht8yp/takof_drone_delivery_canada_about_to_takeoff/gmz8qvw/",
        "score": 7,
        "subreddit": "pennystocks",
        "created": 1613103484.0
    },
    {
        "author": "Tavarez360",
        "body": "Sold profits of $FLT an $UAMY  to scoop up more $FIRE 🙌",
        "created_utc": 1612977886,
        "id": "gmu5s8t",
        "permalink": "/r/pennystocks/comments/lgx6hw/sprwf_or_fireto_cad_an_undervalued_cannabis_stock/gmu5s8t/",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1613006686.0
    },
    {
        "author": "kevlorneswath",
        "body": "TAKOF and FLT are the same Company :D \n\n🚀 🍌  🦍 🌚",
        "created_utc": 1613064766,
        "id": "gmyl0vd",
        "permalink": "/r/wallstreetbets/comments/lhooz1/bbamzn_speculation_blackberry_ivy_for_the/gmyl0vd/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1613093566.0
    },
    {
        "author": "kevlorneswath",
        "body": "FLT another canadian drone company",
        "created_utc": 1613062647,
        "id": "gmyfwn8",
        "permalink": "/r/wallstreetbets/comments/lhooz1/bbamzn_speculation_blackberry_ivy_for_the/gmyfwn8/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613091447.0
    },
    {
        "author": "nickedgar7",
        "body": "FLT",
        "created_utc": 1612999137,
        "id": "gmvj9xa",
        "permalink": "/r/wallstreetbets/comments/lh3qli/what_are_your_moves_tomorrow_february_11_2021/gmvj9xa/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613027937.0
    },
    {
        "author": "teacoat___",
        "body": "FLT is going to announce finalization of contract with Air Canada to finalize air space rights, while also rumored to have a gov. contract for delivering covid vaccines to remote areas. I'm expecting it to at least double in the next month.",
        "created_utc": 1613066283,
        "id": "gmyoqmw",
        "permalink": "/r/wallstreetbets/comments/lhifig/daily_discussion_thread_for_february_11_2021/gmyoqmw/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613095083.0
    },
    {
        "author": "DepressedVeganDad",
        "body": "FLT on the Toronto Stock Exchange.",
        "created_utc": 1612891772,
        "id": "gmpvkx7",
        "permalink": "/r/smallstreetbets/comments/lg89e0/thoughts_on_flt/gmpvkx7/",
        "score": 4,
        "subreddit": "smallstreetbets",
        "created": 1612920572.0
    },
    {
        "author": "OgSachh",
        "body": "I was going to sell my FLT tomorrow but I guess I’ll buy more tomorrow",
        "created_utc": 1613016828,
        "id": "gmwi34w",
        "permalink": "/r/wallstreetbets/comments/lhc36u/takof_drone_delivery_canada_about_to_rocket_dd/gmwi34w/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613045628.0
    },
    {
        "author": "wr3cksh0p",
        "body": "FIRE, FLT, HITI and FAF all down for me today!",
        "created_utc": 1613057979,
        "id": "gmy4sye",
        "permalink": "/r/pennystocks/comments/lhfw7o/daily_plays_february_11_2021/gmy4sye/",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1613086779.0
    },
    {
        "author": "Moneydumper",
        "body": "FLT.WT, FLT or DFLY.",
        "created_utc": 1613022263,
        "id": "gmwqs2z",
        "permalink": "/r/pennystocks/comments/lhd5z5/i_love_talking_to_you_guys_another_one_for_ya/gmwqs2z/",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1613051063.0
    },
    {
        "author": "tjmg",
        "body": "FLT up 18% today with over 5mil volume. Pumping?",
        "created_utc": 1612895201,
        "id": "gmq3nv5",
        "permalink": "/r/wallstreetbets/comments/lg0h70/daily_discussion_thread_for_february_09_2021/gmq3nv5/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1612924001.0
    },
    {
        "author": "RiiiickySpanish",
        "body": "Drone Delivery Canada (FLT) is on OTC markets in the US under TAKOF",
        "created_utc": 1612978487,
        "id": "gmu77h1",
        "permalink": "/r/pennystocks/comments/lgw566/why_flt_canadian_stock_tsx_is_the_next_stock_to/gmu77h1/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1613007287.0
    },
    {
        "author": "blompersv2",
        "body": "I think the calm is happening soon but volatility is just too high. Invest in something with a brighter future like FLT (Drone Delivery Canada). Shooting up this week steadily like crazy",
        "created_utc": 1612974956,
        "id": "gmtyvf7",
        "permalink": "/r/stocks/comments/lgvprq/gme_valuation/gmtyvf7/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1613003756.0
    },
    {
        "author": "WelcometoHale",
        "body": "I see it at $260 when I search “FLT Stock”\n\nFleetCor Technologies?",
        "created_utc": 1612195673,
        "id": "glm3lb3",
        "permalink": "/r/pennystocks/comments/la65xc/investing_in_flt/glm3lb3/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1612224473.0
    },
    {
        "author": "boffyflow",
        "body": "I got in FLT at around 0.70. I think the value of their company is not the actual UAVs, but rather the ecosystem (software, navigation, etc.) they built around it. I feel they may be a good buy out candidate (AC or CJT perhaps?). Holding on for now and waiting for earning reports and/or guidance.",
        "created_utc": 1612374769,
        "id": "glvxilf",
        "permalink": "/r/CanadianInvestor/comments/lbl647/daily_discussion_thread_for_february_03_2021/glvxilf/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1612403569.0
    },
    {
        "author": "iBangNoobz",
        "body": "HITI is actually doing fine. I posted that comment when the ticker dropped by 25% lol. Yeah it definitely had to do with the hype from Reddit. I personally am in weed stocks and phsyceddelics. FLT being my other",
        "created_utc": 1612987870,
        "id": "gmutn5m",
        "permalink": "/r/pennystocks/comments/lgovvi/daily_plays_february_10_2021/gmutn5m/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1613016670.0
    },
    {
        "author": "hobs1110",
        "body": "Any Canadian investors interested in FLT? I’ve noticed that they are popping off, and they’re very financially healthy. I also really like what they do, drone delivery is pretty interesting. Would anyone recommend buying?",
        "created_utc": 1612884803,
        "id": "gmpfhp5",
        "permalink": "/r/wallstreetbets/comments/lg0h70/daily_discussion_thread_for_february_09_2021/gmpfhp5/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1612913603.0
    },
    {
        "author": "LowAd5299",
        "body": "Anyone looking for cheap stocks on the move take a look at HPQ and FLT!🚀🚀",
        "created_utc": 1613002053,
        "id": "gmvp4q3",
        "permalink": "/r/smallstreetbets/comments/lgprdo/daily_market_discussion_thread/gmvp4q3/",
        "score": 3,
        "subreddit": "smallstreetbets",
        "created": 1613030853.0
    },
    {
        "author": "dixybugs",
        "body": "In for 1000 shares at $1.79 \n\nCanadian ticker $FLT.",
        "created_utc": 1612972251,
        "id": "gmtsk6o",
        "permalink": "/r/pennystocks/comments/lgtexs/takof_blowing_up_and_rising_fast_in_premarket_dd/gmtsk6o/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1613001051.0
    },
    {
        "author": "WelcometoHale",
        "body": "No problem! \n\nI was confused because FleetCor also is in transportation haha",
        "created_utc": 1612196992,
        "id": "glm7100",
        "permalink": "/r/pennystocks/comments/la65xc/investing_in_flt/glm7100/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1612225792.0
    },
    {
        "author": "Danoleno1",
        "body": "GDNP has been very good to me. Got in at 0.17 in Sept and now it's sitting at 1.07 cad. They are a Bioplastic company that makes plant based packaging. Plastics will be banned at restaurants in Canada in 2022 and many places throughout the states. These guys have already started cashing in on this and I think they will go up big time once the current lockdown is lifted and restaurants reopen.\n\nAlso FLT (drone delivery Canada) is moving up. First big news and this thing will fly.",
        "created_utc": 1612250380,
        "id": "glpf39s",
        "permalink": "/r/pennystocks/comments/lanccb/the_lounge_thoughts_noob_stuff_low_effort_brokers/glpf39s/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1612279180.0
    },
    {
        "author": "straidurgang",
        "body": "Source 1: https://www.practicalecommerce.com/8-commercial-drone-delivery-companies\n\nSource 2: https://www.prnewswire.com/il/news-releases/storedot-demonstrates-worlds-first-5-minute-charge-of-a-commercial-drone-making-continuous--fully-autonomous-drone-delivery-a-reality-301102250.html\n\nSource 3: https://hse-uav.com/the-future-of-drone-technology-wireless-drone-charging-stations/\n\nSource 4: https://dronedeliverycanada.com/resources/drone-delivery-canada-announces-plans-to-integrate-ai-into-its-disruptive-drone-solution/\n\nSource 5: https://dronedeliverycanada.com/resources/drone-delivery-canada-named-to-2021-otcqx-best-50/\n\nSource 6: https://www.law.cornell.edu/cfr/text/14/part-107\n\nSource 7: https://ca.finance.yahoo.com/news/drone-delivery-canada-tsx-flt-213038615.html\n\nSource 8: https://www.statista.com/chart/17201/commecial-drones-projected-growth/\n\n$TAKOF youtube channel (check their latest video, it discusses drone business and overview of 2020): https://www.youtube.com/channel/UCc_3XCRUn8lJlnPQDk3z6mQ",
        "created_utc": 1612989177,
        "id": "gmuwq0k",
        "permalink": "/r/pennystocks/comments/lh2yrd/takof_upcoming_droneplay_694_potential_gain/gmuwq0k/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1613017977.0
    },
    {
        "author": "RapsFanLJ",
        "body": "Been in this early since $0.64.  Have a bunch of shares and do believe in the company.  That said, has anyone checked out the competition?  $DFLY is a strong competitor.  I've been in it for a while as well at $0.88.  You can see what happens when sales start happening.  I can see DDC passing them tho.  Go FLT!",
        "created_utc": 1613079378,
        "id": "gmzjptc",
        "permalink": "/r/pennystocks/comments/lht8yp/takof_drone_delivery_canada_about_to_takeoff/gmzjptc/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1613108178.0
    },
    {
        "author": "sporadicjesus",
        "body": "FLT/TAKOF is the hold of a lifetime. They are dominating the market before there is a market.\n\nBy the time anyone catches up to them, everyone will already be with DDC.\n\nSaid it before, where do you order online? AMAZON. DDC will be the amazon of drone delivery.",
        "created_utc": 1613026628,
        "id": "gmwwihj",
        "permalink": "/r/pennystocks/comments/lhes5i/hitif_is_on_fire_and_is_getting_ready_to_takof/gmwwihj/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1613055428.0
    },
    {
        "author": "Andycoco89",
        "body": "SU / CNQ / TD / CNR / ATCO / TELUS \n\nset up with drip and hold for life\n\n\nSpeculation\n\nLong on the following\nFLT \nQYOU \nNUMI",
        "created_utc": 1612276095,
        "id": "glqe3dr",
        "permalink": "/r/CanadianInvestor/comments/lamrup/what_are_some_buy_and_hold_growth_stocks_you_guys/glqe3dr/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1612304895.0
    },
    {
        "author": "Punisher_skull",
        "body": "Amazon already has it's own drones. There is no reason for them to buy flt",
        "created_utc": 1612977665,
        "id": "gmu59cd",
        "permalink": "/r/stocks/comments/lgw6bh/why_flt_canadian_stock_tsx_is_the_next_stock_to/gmu59cd/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1613006465.0
    },
    {
        "author": "samwiseg1",
        "body": "Apharia XLY FLT big gains from these stocks for me this week!!",
        "created_utc": 1612988131,
        "id": "gmuu90p",
        "permalink": "/r/wallstreetbets/comments/lgrc39/daily_discussion_thread_for_february_10_2021/gmuu90p/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613016931.0
    },
    {
        "author": "sporadicjesus",
        "body": "FLT/TAKOF is a lifetime hold bro. They are dominating the market before there is a market.\n\n By the time anyone catches up to them, everyone will already be with DDC.\n\n Said it before, where do you order online? AMAZON. DDC will be the amazon of drone delivery.",
        "created_utc": 1613026227,
        "id": "gmww0vs",
        "permalink": "/r/pennystocks/comments/lhbta3/nakd_uamy_gsat_flt_wmd/gmww0vs/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1613055027.0
    },
    {
        "author": "Solid-Tomato5744",
        "body": "None. Probably more FLT.",
        "created_utc": 1613094252,
        "id": "gn0e1b7",
        "permalink": "/r/pennystocks/comments/li0kg3/what_are_you_buying_tommorow/gn0e1b7/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1613123052.0
    },
    {
        "author": "Thecatsong",
        "body": "Honestly! The FLT stock has been on my watchlist for a year. Definitely not a lot of info. I am THINKING (just my own thought) that some other corporation is going to buy them and or get a contract from UPS or FedEx for deliveries to remote communities.",
        "created_utc": 1613258270,
        "id": "gnbcgc7",
        "permalink": "/r/pennystocks/comments/ljazsw/my_concerns_on_drone_delivery_canada_flttakof/gnbcgc7/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1613287070.0
    },
    {
        "author": "Mman222",
        "body": "FLT and averaging down HITI. \n\nHITI set to release annual numbers on March 1. Grab the discount before it's over!",
        "created_utc": 1613662424,
        "id": "gnw7k7c",
        "permalink": "/r/pennystocks/comments/lmp911/the_markets_down_overall_what_are_you_picking_up/gnw7k7c/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1613691224.0
    },
    {
        "author": "Fexyguy",
        "body": "Take a look at BES and FLT",
        "created_utc": 1613003566,
        "id": "gmvs59i",
        "permalink": "/r/wallstreetbets/comments/lh3qli/what_are_your_moves_tomorrow_february_11_2021/gmvs59i/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613032366.0
    },
    {
        "author": "mak_marin",
        "body": "Happy to help!\n\nIn general the OTC Foreign seems to often (always?) have an 'F' at the end of the stock ticker, but there is not necessarily any correlation between the stock tickers of the same company on different exchanges. As an example, \"Drone Delivery Canada\" have the ticker $FLT in Canada and $TAKOF in the US.",
        "created_utc": 1612982311,
        "id": "gmugg9e",
        "permalink": "/r/pennystocks/comments/lgmu5k/the_reason_you_find_it_hard_to_find_some_of_the/gmugg9e/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1613011111.0
    },
    {
        "author": "chuni9",
        "body": "Yeah theyre almost at 2$ I bought in at 1.27 and kept buying more till 1.80. I think there's gonna be a small crash so Imma stock up on more FLT then. Drone related businesses gonna be huge in a few years",
        "created_utc": 1612819392,
        "id": "gmmj7cz",
        "permalink": "/r/wallstreetbets/comments/lf9rdy/gme_megathread_for_mon_28/gmmj7cz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612848192.0
    },
    {
        "author": "Unhappy-Ad-3683",
        "body": "I don’t have much stomach for penny stock volatility, personally. I dabble in FLT and BABY because I can’t help myself, but they’re both a tiny percentage of my portfolio.",
        "created_utc": 1612263558,
        "id": "glpu1jy",
        "permalink": "/r/CanadianInvestor/comments/lamrsm/penny_or_mid_range_companies/glpu1jy/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1612292358.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  2nd of February\n\n\n\n## Upcoming events for Tuesday, February  2nd\n\n - Expected earnings:\n\n  ABG, ALGM, AMCR, AMGN, AMZN, APAM, AQUA, ARCB, ARTW, ATGE, ATHM, ATKR, ATO, BABA, BDN, BEN, BHB, BP, BPY, BR, BRKS, CB, CFBK, CLCT, CMG, CNXN, COP, CRVL, CTLT, DLHC, DOX, EA, EMR, ENTG, EPAY, ETN, FBHS, FEYE, GAIN, GBL, GL, GLDG, GNW, GOOG, GOOGL, GPK, HAE, HCA, HLNE, HMN, HOG, HUBB, IBA, ICHR, IDXX, IESC, IMO, IPHI, ITI, LARK, LFVN, LII, LITE, LPG, LU, MAN, MANH, MCK, MDC, MFGP, MHO, MKL, MLI, MMP, MPC, MPLX, MRCY, MTCH, MUFG, OCFT, PBI, PFE, PINC, PJT, PKI, POWI, POWL, PTRS, RACE, RCL, SALT, SANM, SCSC, SIRI, SMCI, SNE, ST, STE, SWI, SYY, TAK, TCS, TDG, TECH, TENB, TRNS, UPS, UTL, VBFC, VIAV, VRTS, VTOL, WAT, WDR, WVFC, XOM\n\n - Ex-div:\n\n  AM, AMRB, BBD, BBDO, BCBP, CFG, ETRN, FAST, MCBS, NTIC, PNM\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -5.272M)\n    - FOMC Member Mester Speaks\n    - FOMC Member Williams Speaks\n    - IBD/TIPP Economic Optimism (previous: 50.1)\n    - ISM NY Business Conditions (previous: 61.3%)\n    - ISM-New York Index (previous: 817.6)\n    - Redbook (previous: -2.0%)\n    - Redbook (previous: 3.9%)\n    - Total Vehicle Sales (previous: 16.30M)\n\n## Upcoming events for Wednesday, February  3rd\n\n - Expected earnings:\n\n  ABBV, ADTN, AFG, AFL, AGTC, ALGN, ALGT, ALL, AMSC, ANGI, APO, APPS, APTV, ASH, AVB, AVNW, AVTR, AVY, AXTA, BBD, BBDO, BCLI, BIIB, BIP, BSMX, BSX, CCMP, CENT, CENTA, CHKP, CHNG, CHT, CLDB, CNHI, COFS, COHR, COTY, CPRI, CSGS, CSII, CTSH, CTVA, CUB, DGII, DHT, DT, DTE, EBAY, ECHO, ELF, EMKR, ENSG, EPD, EPM, EVR, FMAO, FORM, FSFG, FUNC, GEOS, GLAD, GLUU, GRUB, GSK, GWW, HI, HOFV, HUM, HWM, IAC, IEC, IEX, INGR, INOV, INVA, IO, ISSC, IVAC, JVA, KE, KLAC, KLIC, LAD, LCI, LCNB, LFUS, LGND, LNC, MAA, MDU, MET, MHH, MIME, MSGS, MTOR, MUSA, MWA, MXL, NEU, NMCI, NTGR, NVO, PAHC, PATI, PFGC, PGC, PLUS, PW, PYPL, PZN, QCOM, QNST, QRVO, RGLD, RYN, SAN, SAVE, SC, SENEA, SENEB, SGU, SIMO, SITM, SLAB, SMG, SNDR, SNEX, SPOT, SRDX, STC, SU, SUM, TBI, TGI, THG, TSE, TTMI, TYME, UGI, UHAL, UWMC, VNE, VVV, WNC, WTM, YUMC\n\n - Ex-div:\n\n  BANR, FELE, FUL, GHC, HESM, KBH, NWBI, VBTX, WLKP\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 45K, previous: -123K)\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: -2.085M)\n    - Crude Oil Inventories (consensus: 0.367M, previous: -9.910M)\n    - Cushing Crude Oil Inventories (previous: -2.281M)\n    - Distillate Fuel Production (previous: -0.011M)\n    - EIA Refinery Crude Runs  (previous: -0.039M)\n    - EIA Weekly Distillates Stocks (consensus: -0.400M, previous: -0.815M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.4%, previous: -0.8%)\n    - Gasoline Inventories (consensus: 1.633M, previous: 2.470M)\n    - Gasoline Production (previous: -0.212M)\n    - Heating Oil Stockpiles (previous: 0.055M)\n    - ISM Non-Manufacturing Business Activity (consensus: 57.3, previous: 60.5)\n    - ISM Non-Manufacturing Employment (previous: 48.7)\n    - ISM Non-Manufacturing New Orders (previous: 58.6)\n    - ISM Non-Manufacturing PMI (consensus: 56.8, previous: 57.7)\n    - ISM Non-Manufacturing Prices (previous: 64.4)\n    - MBA 30-Year Mortgage Rate (previous: 2.95%)\n    - MBA Mortgage Applications (previous: -4.1%)\n    - MBA Purchase Index (previous: 334.2)\n    - Markit Composite PMI (previous: 58.0)\n    - Mortgage Market Index (previous: 907.6)\n    - Mortgage Refinance Index (previous: 4,261.5)\n    - Services PMI (previous: 57.5)\n\n## Upcoming events for Thursday, February  4th\n\n - Stock splits:\n\n    - GNTY @ **110:100** (Payable date: 02/12/2021)\n\n - Expected earnings:\n\n  ABB, ABC, AGCO, AINV, AIV, ALCO, ALXN, AME, AMRK, ANIX, AOSL, APD, APDN, ARNC, ARRY, ARW, ARWR, ATVI, AVXL, BAX, BCE, BCO, BDX, BEP, BHE, BILL, BLL, BMY, BRBR, BRT, BSAC, BSBK, BSGM, BSIG, BTU, BV, CARR, CCS, CDR, CG, CI, CLX, CMI, CMS, COLM, COR, CPT, CRC, CSL, CTHR, CURO, CZNC, DB, DD, DECK, DGX, DHX, DLX, DSPG, DX, DXC, DYN, EIGI, ENTA, ENVA, EQNR, ESS, EURN, EVBN, EXPO, F, FARM, FFG, FLT, FOUR, FTNT, FTV, GHL, GILD, GLOG, GLOP, GLT, GOOS, GPI, GPRO, GTIM, HIG, HIMX, HL, HSY, HUBG, ICE, IMKTA, IMRA, ING, IP, IRMD, JHG, KBAL, KN, KYMR, LANC, LBRT, LEA, LEE, LGF.A, LGF.B, LPLA, LPTH, LQDT, LSPD, LTRN, MCHP, MDP, MEIP, MLVF, MMS, MNR, MOD, MPW, MPWR, MRK, MSGN, MSI, MSON, MTD, MTX, MYGN, NBIX, NEWR, NFG, NGL, NGVC, NICK, NJR, NKSH, NLOK, NMR, NNA, NOK, NOV, NRZ, NS, NWS, NWSA, NYT, OCSI, OCSL, ODFL, OESX, OFC, OHI, ONEW, ONTO, ORIC, OTEX, PBH, PCTY, PDEX, PENN, PFPT, PFSI, PH, PINS, PIPR, PLT, PM, PMT, POST, PRO, PRU, PTEN, PTON, PXLW, PZG, RDS.A, RDS.B, RFP, RGS, RL, SBH, SKX, SKYW, SNA, SNAP, SOGO, SOHU, SPH, SQFT, SR, STLA, SVM, SXC, SXI, SYNA, TDC, THFF, THR, TKR, TM, TMUS, TNAV, TOT, TPL, TPR, TRNO, TW, TWST, U, UEPS, UL, ULBI, ULH, UNM, USAK, USAT, UTI, VREX, VRTU, VSAT, VSTO, WD, WEC, WERN, WLL, WMS, WWE, WYNN, XYL, YRCW, YTRA, YUM, ZEN\n\n - Ex-div:\n\n  AFB, AMSWA, BKEP, BMRC, BPFH, BRO, CADE, CEQP, CFFN, CIT, CMCO, CMS, COST, DCOM, DCP, DHF, FCBC, FCF, FE, FFWM, FHI, FRAF, GMLP, GPP, HOPE, IBCP, IBOC, IDA, JBHT, LBC, LW, MET, MMLP, MMP, NBLX, NEA, NEP, NSC, NYCB, PNFP, PPBI, RELL, SSSS, SYF, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.065%)\n    - Challenger Job Cuts (previous: 77.030K)\n    - Continuing Jobless Claims (consensus: 4,700K, previous: 4,771K)\n    - Durables Excluding Defense (previous: 0.5%)\n    - FOMC Member Daly Speaks\n    - Factory Orders (consensus: 0.7%, previous: 1.0%)\n    - Factory orders ex transportation (previous: 0.8%)\n    - Initial Jobless Claims (consensus: 830K, previous: 847K)\n    - Jobless Claims 4-Week Avg. (previous: 868.00K)\n    - Natural Gas Storage (consensus: -136B, previous: -128B)\n    - Nonfarm Productivity (consensus: -2.8%, previous: 4.6%)\n    - Unit Labor Costs (consensus: 3.9%, previous: -6.6%)\n\n## Upcoming events for Friday, February  5th\n\n - Expected earnings:\n\n  ADNT, ALUS, AON, ASX, ATLO, AYRO, BBU, BERY, BH.A, BRID, CAH, CBOE, CIVB, CSWI, CWBC, DJCO, EAF, EL, FE, FGBI, GRC, HMC, HRC, IBN, IHT, INTG, ITW, JOUT, LAZ, LIN, LIVX, NATH, OIIM, PFIS, RBKB, REGN, ROAD, SKM, SMMF, SNY, SPB, TT, UI, VIVO, ZBH\n\n - Ex-div:\n\n  AAPL, AROC, ARTNA, ASRV, AWK, BCO, BX, CSV, CWT, EBTC, ET, GAM, GLOP, GLP, GROW, GWW, HAFC, HBCP, HBT, INTC, LBAI, MATW, MPLX, MRLN, NATI, NS, NSEC, OCFC, OHI, PCTI, PEBO, PZZA, RBNC, SJW, STND, SUN, WABC, WVFC, X\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 5.1%, previous: 5.1%)\n    - Average Hourly Earnings (consensus: 0.3%, previous: 0.8%)\n    - Average Weekly Hours (consensus: 34.7, previous: 34.7)\n    - CFTC Aluminium speculative net positions (previous: 3.2K)\n    - CFTC Copper speculative net positions (previous: 70.3K)\n    - CFTC Corn speculative net positions (previous: 547.7K)\n    - CFTC Crude Oil speculative net positions (previous: 504.6K)\n    - CFTC Gold speculative net positions (previous: 257.5K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 39.7K)\n    - CFTC Natural Gas speculative net positions (previous: 11.6K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -28.4K)\n    - CFTC Silver speculative net positions (previous: 54.5K)\n    - CFTC Soybeans speculative net positions (previous: 236.4K)\n    - CFTC Wheat speculative net positions (previous: 36.2K)\n    - Consumer Credit (consensus: 12.00B, previous: 15.27B)\n    - Government Payrolls (previous: -45.0K)\n    - Manufacturing Payrolls (consensus: 30K, previous: 38K)\n    - Nonfarm Payrolls (consensus: 50K, previous: -140K)\n    - Participation Rate (previous: 61.5%)\n    - Payrolls Benchmark (previous: -514.00)\n    - Payrolls Benchmark, n.s.a. (previous: -173.00K)\n    - Private Nonfarm Payrolls (consensus: 45K, previous: -95K)\n    - Trade Balance (consensus: -65.70B, previous: -68.10B)\n    - U.S. Baker Hughes Oil Rig Count (previous: 289)\n    - U.S. Baker Hughes Total Rig Count (previous: 378)\n    - U6 Unemployment Rate (previous: 11.7%)\n    - Unemployment Rate (consensus: 6.7%, previous: 6.7%)\n\n^^^^2021-02-02",
        "created_utc": 1612263635,
        "id": "glpu4y9",
        "permalink": "/r/RobinHood/comments/lat3vw/daily_discussion_thread_february_2nd_2021/glpu4y9/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1612292435.0
    },
    {
        "author": "TeamChevy86",
        "body": "I'm %100 getting into some more HITI tomorrow, then equal parts GBML and PLTR. Others worth watching are EFL, FLT, KEP, NOVN, SOLR and TTOO.",
        "created_utc": 1612745082,
        "id": "gmj2rna",
        "permalink": "/r/pennystocks/comments/ley5f6/what_are_you_guys_bullish_on_for_next_week/gmj2rna/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1612773882.0
    },
    {
        "author": "RagingBullFI",
        "body": "I'm long on FLT with 4000 @ 0,78 cents. It has been interesting month for the stock but fair value is hard to guess since this is basically still looking for real revenue..",
        "created_utc": 1612891379,
        "id": "gmpundb",
        "permalink": "/r/pennystocks/comments/lbzovf/takof_drone_delivery_canada_dd/gmpundb/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1612920179.0
    },
    {
        "author": "IsThisMyPlanet",
        "body": "Tomorrow: FLT 🚀🚀🚀$$$🚀🚀🚀\nAnd everyday!",
        "created_utc": 1613442161,
        "id": "gnlp5ek",
        "permalink": "/r/wallstreetbets/comments/lkn19o/what_are_your_moves_tomorrow_february_16_2021/gnlp5ek/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613470961.0
    },
    {
        "author": "davin_bacon",
        "body": "These fucking boomers are trying to figure this shit out on the flt via internet explorer.",
        "created_utc": 1613672640,
        "id": "gnww0v4",
        "permalink": "/r/wallstreetbets/comments/lm7n51/congressional_hearings_dfv_gme_etc_megathread/gnww0v4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613701440.0
    },
    {
        "author": "IsThisMyPlanet",
        "body": "Drone Delivery Canada (FLT). Great day to buy!",
        "created_utc": 1613661614,
        "id": "gnw5rz8",
        "permalink": "/r/stocks/comments/lml6u6/rstocks_daily_discussion_options_trading_thursday/gnw5rz8/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1613690414.0
    },
    {
        "author": "Paraplan",
        "body": "Nah. FD is. Followed by HITI and FLT. HIVE is 4th",
        "created_utc": 1613648225,
        "id": "gnvjizb",
        "permalink": "/r/wallstreetbets/comments/lmdc6i/can_we_please_stop_using_short_interest_as_the/gnvjizb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613677025.0
    },
    {
        "author": "iBangNoobz",
        "body": "Glad to see my TAKOF/FLT, HITIF and MMED. No NUMI though 😐",
        "created_utc": 1613339091,
        "id": "gngwmx3",
        "permalink": "/r/pennystocks/comments/ljuceq/215_most_discussed_penny_stocks_in_last_48_hours/gngwmx3/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613367891.0
    },
    {
        "author": "CDNStageaDude",
        "body": "FLT. Can't upload a screen grab, but damn is it moving. Already up 20% since I bought in last week. Kinda new to this, anything I should be wary of?",
        "created_utc": 1613366735,
        "id": "gni8mmm",
        "permalink": "/r/wallstreetbets/comments/likmpp/weekend_discussion_thread_for_the_weekend_of/gni8mmm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613395535.0
    },
    {
        "author": "IsThisMyPlanet",
        "body": "I like FLT and NLC. Both doing well, and good gains lately. I think both will do really well this year, reaching double digits. Here’s a couple obligator 🚀🚀to show my enthusiasm!!",
        "created_utc": 1613402741,
        "id": "gnjhv9v",
        "permalink": "/r/stocks/comments/lkfblr/rstocks_discuss_overlooked_stocks_monday_feb_15/gnjhv9v/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1613431541.0
    },
    {
        "author": "chalia321",
        "body": "Halted but why? https://www.newswire.ca/news-releases/iiroc-trading-resumption-flt-888320653.html",
        "created_utc": 1613062849,
        "id": "gmygef3",
        "permalink": "/r/StockMarket/comments/lgwzx4/why_flt_canadian_stock_tsx_is_the_next_stock_to/gmygef3/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1613091649.0
    },
    {
        "author": "wahidshirin",
        "body": "Sure, those are all the ones that wanted to sell or partner up. If, for any reason, FLT doesn't want that, Amazon will make their own or buy another one and improve it, driving FLT down to nothing. This is something they're known for.",
        "created_utc": 1612972277,
        "id": "gmtsmar",
        "permalink": "/r/wallstreetbets/comments/lgw7bg/why_flt_canadian_stock_tsx_is_the_next_stock_to/gmtsmar/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613001077.0
    },
    {
        "author": "Puzzleheaded_Cash_49",
        "body": "Buy flt tsxv. Great potential.",
        "created_utc": 1612192909,
        "id": "gllvy56",
        "permalink": "/r/pennystocks/comments/l9uow1/the_lounge_thoughts_noob_stuff_low_effort_brokers/gllvy56/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1612221709.0
    },
    {
        "author": "Puzzleheaded_Cash_49",
        "body": "Buying namaste stock, Flt tsxv- has given multi bagger potential by fools and business idea is also unique and demanding. Next is healthcare- DOC tsxv as covid situation is still ongoing. All are multibaggers.",
        "created_utc": 1612229948,
        "id": "glofk6f",
        "permalink": "/r/pennystocks/comments/laivpb/what_are_your_plays_for_tomorrow/glofk6f/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1612258748.0
    },
    {
        "author": "HalifaxGrandPoobah",
        "body": "Yes FLT on the Toronto Stock Exchange.",
        "created_utc": 1612891802,
        "id": "gmpvniz",
        "permalink": "/r/smallstreetbets/comments/lg89e0/thoughts_on_flt/gmpvniz/",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1612920602.0
    },
    {
        "author": "tjmg",
        "body": "FIRE and FLT",
        "created_utc": 1612964575,
        "id": "gmtcduz",
        "permalink": "/r/smallstreetbets/comments/lgprdo/daily_market_discussion_thread/gmtcduz/",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1612993375.0
    },
    {
        "author": "iBangNoobz",
        "body": "HITIF and FLT!",
        "created_utc": 1613054573,
        "id": "gmxx5n3",
        "permalink": "/r/pennystocks/comments/lhfw7o/daily_plays_february_11_2021/gmxx5n3/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613083373.0
    },
    {
        "author": "KPbeGaming",
        "body": "Use Google. $FLT is a solid stock.",
        "created_utc": 1613001281,
        "id": "gmvnlns",
        "permalink": "/r/pennystocks/comments/lgw566/why_flt_canadian_stock_tsx_is_the_next_stock_to/gmvnlns/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613030081.0
    },
    {
        "author": "DrinkMoreFluoride",
        "body": "In the US, look up $TAKOF in the OTCQX International market - it's the same company as $FLT",
        "created_utc": 1612981659,
        "id": "gmueue1",
        "permalink": "/r/stocks/comments/lgw6bh/why_flt_canadian_stock_tsx_is_the_next_stock_to/gmueue1/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1613010459.0
    },
    {
        "author": "AutoModerator",
        "body": "Your post with title \"$FLT$ (TSX) looking pretty good today, who else is on it?\" has been automatically removed from r/PennyStocks for being low-effort/spam. (Low word count) probably by u/automod \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/pennystocks) if you have any questions or concerns.*",
        "created_utc": 1612972368,
        "id": "gmtstx5",
        "permalink": "/r/pennystocks/comments/lgwjqq/flt_tsx_looking_pretty_good_today_who_else_is_on/gmtstx5/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613001168.0
    },
    {
        "author": "neilnijjar",
        "body": "I thinl GDNP and FLT have tons of space to grow.\n\nThe other 3 will also grow, but you are correct they have ran a ton already",
        "created_utc": 1613193794,
        "id": "gn56wky",
        "permalink": "/r/pennystocks/comments/litvdp/what_are_you_favorite_100m_to_1bn_cap_stocks_i/gn56wky/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613222594.0
    },
    {
        "author": "Icognito_022",
        "body": "APHA, TLRY, FLT to the moooooon",
        "created_utc": 1612799595,
        "id": "gmlb41t",
        "permalink": "/r/weedstocks/comments/lf9hp9/daily_discussion_thread_february_08_2021/gmlb41t/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1612828395.0
    },
    {
        "author": "Danoleno1",
        "body": "#GDNP is moving. Plant based bioplastic company. Bioplastics will be huge this year with all of the plastic bans going on. This is nearing record highs and ready to break through.  \n#FIRE is a great cheap cannabis play. Hot stock, hot sector.\n#FLT is a drone delivery company that is starting to gain momentum. This will be a giant industry real soon. \nDo your research. I like all 3 of these for quick gains and long term huge growth.",
        "created_utc": 1612371387,
        "id": "glvp0qz",
        "permalink": "/r/pennystocks/comments/lbiofa/daily_plays_february_03_2021/glvp0qz/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1612400187.0
    },
    {
        "author": "superfunexcitement7",
        "body": "RTON, HITI, FLT, GDNP, HPQ, EXRO",
        "created_utc": 1613620448,
        "id": "gnujsgt",
        "permalink": "/r/pennystocks/comments/llw65v/before_you_panic_sell_today_please_note/gnujsgt/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613649248.0
    },
    {
        "author": "leekenan",
        "body": "[$GME](https://twitter.com/search?q=%24GME&amp;src=cashtag_click) short interest is $11.20B; 57.83M shares shorted; 113.31% of Float; 53.12% S3 SI% Flt; 29% fee &amp; easing. Shares shorted down -5.08M shares, worth $983 million, -8.07%, last week. Shorts down -$19.75B in 2021 mark-to-market losses; down -$7.83B on today's +70% move.   so your **grandmother will stable hold GME.**",
        "created_utc": 1612278687,
        "id": "glql0k6",
        "permalink": "/r/wallstreetbets/comments/lavgj3/my_102_year_old_grandmother_bought_gme_in_august/glql0k6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612307487.0
    },
    {
        "author": "RagingBullFI",
        "body": "I think FLT is literally flying under the radar. They got The first commercial deal and should they continue on the right path I see real potential Jere..",
        "created_utc": 1612282862,
        "id": "glqwqb6",
        "permalink": "/r/investing/comments/kmstcx/drone_stocks/glqwqb6/",
        "score": 1,
        "subreddit": "investing",
        "created": 1612311662.0
    },
    {
        "author": "IamCanadian11",
        "body": "Flt wouls be a long long term hold imo",
        "created_utc": 1612819033,
        "id": "gmmiens",
        "permalink": "/r/wallstreetbets/comments/lf9rdy/gme_megathread_for_mon_28/gmmiens/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612847833.0
    },
    {
        "author": "kevlorneswath",
        "body": "I might do a small line up of AEZS, VXRT,  FLT ADMP \n\nI'll do some market research on the the guys you suggest",
        "created_utc": 1612838716,
        "id": "gmnlwpa",
        "permalink": "/r/Wallstreetbetsnew/comments/lforx9/what_are_your_moves_tomorrow_february_09_2021/gmnlwpa/",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1612867516.0
    },
    {
        "author": "Shwaabb",
        "body": "FLT is the future!",
        "created_utc": 1612372510,
        "id": "glvrtqc",
        "permalink": "/r/wallstreetbets/comments/lbl62i/daily_discussion_thread_for_february_03_2021/glvrtqc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612401310.0
    },
    {
        "author": "jayce_on_my_feet",
        "body": "Its on the cdnx as FLT it should be available in canada",
        "created_utc": 1613161386,
        "id": "gn3ikx6",
        "permalink": "/r/pennystocks/comments/licp3p/plays_for_the_long_weekend/gn3ikx6/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613190186.0
    },
    {
        "author": "jedinachos",
        "body": "Drone Delivery Canada - $FLT TSX exchange",
        "created_utc": 1613327687,
        "id": "gnga8q6",
        "permalink": "/r/wallstreetbets/comments/layhm1/canada_drone_delivery_stocks_will_shoot_up_by/gnga8q6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613356487.0
    },
    {
        "author": "Amasan89",
        "body": "&gt;FLT \n\n as in FleetCor Technologies?\n\n#",
        "created_utc": 1613066513,
        "id": "gmypau9",
        "permalink": "/r/wallstreetbets/comments/lhifig/daily_discussion_thread_for_february_11_2021/gmypau9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613095313.0
    },
    {
        "author": "Jaloosk",
        "body": "Hahaha I did this too! Meant to buy FLT bought FLY instead /dumbass",
        "created_utc": 1613084950,
        "id": "gmzvtqe",
        "permalink": "/r/pennystocks/comments/lhww20/misspelled_a_ticker_and_bought_the_wrong_stock/gmzvtqe/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613113750.0
    },
    {
        "author": "IsThisMyPlanet",
        "body": "I like FLT and NLC. Both look very promising, both are gonna have a good week. IMO 🚀🚀",
        "created_utc": 1613453924,
        "id": "gnm9emn",
        "permalink": "/r/stocks/comments/lkj2m9/rstocks_daily_discussion_monday_feb_15_2021/gnm9emn/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1613482724.0
    },
    {
        "author": "AutoModerator",
        "body": "Your post with title \"What about FLT and FLT.Wt? Showed steady increases today?\" has been automatically removed from r/PennyStocks for being low-effort/spam. (Low word count) probably by u/automod \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/pennystocks) if you have any questions or concerns.*",
        "created_utc": 1613022008,
        "id": "gmwqehf",
        "permalink": "/r/pennystocks/comments/lhe0dl/what_about_flt_and_fltwt_showed_steady_increases/gmwqehf/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613050808.0
    },
    {
        "author": "Tuscam",
        "body": "I'm digging FLT right now.  Drone Delivery Canada.  Just started last week but I'm already up more than 50% because of it!!",
        "created_utc": 1613018354,
        "id": "gmwko3o",
        "permalink": "/r/wallstreetbets/comments/lgy5z7/1100_on_tlry_calls_i_used_to_be_retarded_but_now/gmwko3o/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613047154.0
    },
    {
        "author": "superfunexcitement7",
        "body": "Did you have reservations about FLT? If so, why?",
        "created_utc": 1613018581,
        "id": "gmwl1ge",
        "permalink": "/r/pennystocks/comments/lh1n7s/i_one_time_wrote_a_caution_against_a_penny_stock/gmwl1ge/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613047381.0
    },
    {
        "author": "Adventurous_Tear648",
        "body": "I’m in with 2,500 shares of FLT! Expecting big things!",
        "created_utc": 1613010068,
        "id": "gmw56rk",
        "permalink": "/r/stonks/comments/lgyi5y/why_flt_canadian_stock_tsx_is_the_next_stock_to/gmw56rk/",
        "score": 1,
        "subreddit": "stonks",
        "created": 1613038868.0
    },
    {
        "author": "wr3cksh0p",
        "body": "DN, FLT, FAF today.",
        "created_utc": 1612981491,
        "id": "gmuefcm",
        "permalink": "/r/pennystocks/comments/lgovvi/daily_plays_february_10_2021/gmuefcm/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613010291.0
    },
    {
        "author": "AmbitiousGarlic1792",
        "body": "It's drone delivery Canada... FLT on some platforms and TAKOF on others. Doing great so far! Got in on the American AG Eagle Aerial at $6.50. gonna be holding both for the long long term.",
        "created_utc": 1612979283,
        "id": "gmu94ki",
        "permalink": "/r/StockMarket/comments/lgwzx4/why_flt_canadian_stock_tsx_is_the_next_stock_to/gmu94ki/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1613008083.0
    },
    {
        "author": "blompersv2",
        "body": "FLT - Drone Delivery Canada",
        "created_utc": 1612977974,
        "id": "gmu5zpc",
        "permalink": "/r/StockMarket/comments/lgykfe/hey_i_finally_created_a_charles_schwab_account/gmu5zpc/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1613006774.0
    },
    {
        "author": "lordeqai",
        "body": "Hey I cant see it on RobinHood when I type in TAKOF, and when I type in FLT i see a $260 stock. Any suggestions,? ty!",
        "created_utc": 1612979774,
        "id": "gmuaayn",
        "permalink": "/r/StockMarket/comments/lgwzx4/why_flt_canadian_stock_tsx_is_the_next_stock_to/gmuaayn/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1613008574.0
    },
    {
        "author": "notathrowaway5001",
        "body": "Do you have the option to use a regular stop limit that doesn't expire? (Usually good for 90 days).  I use wealthsimple (Canada) and they don't allow actual trailing stop limits so I set my own and just adjust it as the price goes up.  Just don't set it too close or a small dip will cash you out.   (Looking at you $FLT).  I'm still learning though.",
        "created_utc": 1613063549,
        "id": "gmyi2z0",
        "permalink": "/r/pennystocks/comments/lgej4s/repost/gmyi2z0/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613092349.0
    },
    {
        "author": "blompersv2",
        "body": "Surprised no one has mentioned TAKOF or FLT",
        "created_utc": 1613074060,
        "id": "gmz7anm",
        "permalink": "/r/wallstreetbets/comments/lhtazu/as_requested_heres_a_visualization_of_which/gmz7anm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613102860.0
    },
    {
        "author": "LIL0N3420",
        "body": "FLT is going to be big",
        "created_utc": 1613216982,
        "id": "gn6zmim",
        "permalink": "/r/pennystocks/comments/liyik7/currently_holding_three_pennystocks/gn6zmim/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613245782.0
    },
    {
        "author": "LIL0N3420",
        "body": "FLT gas so much potential (imo)",
        "created_utc": 1613198609,
        "id": "gn5dafx",
        "permalink": "/r/pennystocks/comments/liudrq/i_took_a_hit_this_week_s/gn5dafx/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1613227409.0
    },
    {
        "author": "here4aguydtime",
        "body": "Is it FLT on wealth simple ?",
        "created_utc": 1612965065,
        "id": "gmtd98j",
        "permalink": "/r/pennystocks/comments/lgtexs/takof_blowing_up_and_rising_fast_in_premarket_dd/gmtd98j/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1612993865.0
    },
    {
        "author": "stretch1327",
        "body": "FLT drone delivery is a good one to buy now guys, just broke $2 a share today and bound to boom",
        "created_utc": 1612899867,
        "id": "gmqenfb",
        "permalink": "/r/wallstreetbets/comments/lg0h70/daily_discussion_thread_for_february_09_2021/gmqenfb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612928667.0
    },
    {
        "author": "Instro_Mental",
        "body": "Or FLT \n\nSad face I sold SCR at .87",
        "created_utc": 1612811807,
        "id": "gmm2dd9",
        "permalink": "/r/wallstreetbets/comments/lf9huy/daily_discussion_thread_for_february_08_2021/gmm2dd9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612840607.0
    },
    {
        "author": "Twiens156",
        "body": "Looks like it’s actually the same company, but TAKOF is the American ticker.  FLT is Canadian",
        "created_utc": 1612819977,
        "id": "gmmkhm6",
        "permalink": "/r/pennystocks/comments/lfm1uz/cheap_drone_stock_options_and_dd_tips/gmmkhm6/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1612848777.0
    },
    {
        "author": "IsThisMyPlanet",
        "body": "FLT and NLC are looking good this week. 🚀🚀",
        "created_utc": 1613453670,
        "id": "gnm914i",
        "permalink": "/r/stocks/comments/lkj2m9/rstocks_daily_discussion_monday_feb_15_2021/gnm914i/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1613482470.0
    },
    {
        "author": "nickedgar7",
        "body": "FLT had a decent recovery hopefully we can close green",
        "created_utc": 1613594160,
        "id": "gnt06o8",
        "permalink": "/r/wallstreetbets/comments/llrzit/daily_discussion_thread_for_february_17_2021/gnt06o8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613622960.0
    },
    {
        "author": "blompersv2",
        "body": "Buy FLT- Drone delivery canada and never look back",
        "created_utc": 1612978277,
        "id": "gmu6pch",
        "permalink": "/r/StockMarket/comments/lgypfw/i_just_turned_18_and_my_parents_gave_me_some/gmu6pch/",
        "score": 0,
        "subreddit": "StockMarket",
        "created": 1613007077.0
    },
    {
        "author": "HalifaxGrandPoobah",
        "body": "FLT\n\nThis isnt financial advice, do your own DD.",
        "created_utc": 1612809741,
        "id": "gmlxqad",
        "permalink": "/r/smallstreetbets/comments/lfbtqo/good_stocks_under_5_with_options/gmlxqad/",
        "score": 0,
        "subreddit": "smallstreetbets",
        "created": 1612838541.0
    },
    {
        "author": "OhRThey",
        "body": "How have they changed the calculation?  Look back at all of [Ihor's tweets, he is always reporting both the traditional SI% flt and the S3 SI% flt calculations](https://twitter.com/ihors3/status/1346217712297648132?s=20) (that's a tweet from Jan 4th!).  the S3 SI% of float is ALWAYS a lower calculation.",
        "created_utc": 1612286853,
        "id": "glr7n62",
        "permalink": "/r/wallstreetbets/comments/lavc35/s3_is_intentionally_using_misleading_numbers_to/glr7n62/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1612315653.0
    },
    {
        "author": "athomas238",
        "body": "Anyone at all looking at FLT? The Canadian drone delivery? they are booming today and i am wondering why.",
        "created_utc": 1612372262,
        "id": "glvr7en",
        "permalink": "/r/wallstreetbets/comments/lbl62i/daily_discussion_thread_for_february_03_2021/glvr7en/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1612401062.0
    },
    {
        "author": "Celtic-fit",
        "body": "More into FLT the future of logistics, playing for the long game i urge people to hop on board, but in just a retard.",
        "created_utc": 1612995048,
        "id": "gmvaeub",
        "permalink": "/r/wallstreetbets/comments/lh3qli/what_are_your_moves_tomorrow_february_11_2021/gmvaeub/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1613023848.0
    },
    {
        "author": "Wildfan2",
        "body": "Just reposting why is FLT shooting to the moon the last couple weeks? What’s happening",
        "created_utc": 1612205701,
        "id": "glmtpfq",
        "permalink": "/r/wallstreetbets/comments/la75n9/daily_discussion_thread_2_for_february_1_2021/glmtpfq/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1612234501.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  3rd of February\n\n\n\n## Upcoming events for Wednesday, February  3rd\n\n - Expected earnings:\n\n  ABBV, ADTN, AFG, AFL, AGTC, ALGN, ALGT, ALL, AMSC, ANGI, APO, APPS, APTV, ASH, AVB, AVNW, AVTR, AVY, AXTA, BBD, BBDO, BCLI, BIIB, BIP, BSMX, BSX, CCMP, CENT, CENTA, CHKP, CHNG, CHT, CNHI, COHR, COTY, CPRI, CSGS, CSII, CTSH, CTVA, DGII, DT, DTE, EBAY, ECHO, ELF, EMKR, ENSG, EPD, EPM, EVR, FMAO, FORM, FUNC, GEOS, GLAD, GRUB, GSK, GWW, HI, HOFV, HUM, HWM, IAC, IEC, IEX, INGR, INOV, INVA, IO, IVAC, KE, KLAC, KLIC, LAD, LCI, LFUS, LGND, LNC, MAA, MDU, MET, MIME, MSGS, MTOR, MUSA, MWA, MXL, NEU, NMCI, NTGR, NVO, PAHC, PATI, PFGC, PLUS, PW, PYPL, PZN, QCOM, QNST, QRVO, RGLD, RYN, SAN, SAVE, SC, SENEA, SENEB, SGU, SIMO, SITM, SLAB, SMG, SNDR, SNEX, SPOT, STC, SU, SUM, TBI, TGI, THG, TSE, TTMI, TYME, UGI, UHAL, UWMC, VNE, VVV, WNC, WTM, YUMC\n\n - Ex-div:\n\n  BANR, FELE, FUL, GHC, HESM, KBH, NWBI, VBTX, WLKP\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 49K, previous: -123K)\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: -2.085M)\n    - Crude Oil Inventories (consensus: 0.446M, previous: -9.910M)\n    - Cushing Crude Oil Inventories (previous: -2.281M)\n    - Distillate Fuel Production (previous: -0.011M)\n    - EIA Refinery Crude Runs  (previous: -0.039M)\n    - EIA Weekly Distillates Stocks (consensus: -0.429M, previous: -0.815M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.1%, previous: -0.8%)\n    - FOMC Member Bullard Speaks\n    - FOMC Member Harker Speaks\n    - FOMC Member Kaplan Speaks\n    - FOMC Member Mester Speaks\n    - Gasoline Inventories (consensus: 1.134M, previous: 2.470M)\n    - Gasoline Production (previous: -0.212M)\n    - Heating Oil Stockpiles (previous: 0.055M)\n    - ISM Non-Manufacturing Business Activity (consensus: 57.3, previous: 60.5)\n    - ISM Non-Manufacturing Employment (previous: 48.7)\n    - ISM Non-Manufacturing New Orders (previous: 58.6)\n    - ISM Non-Manufacturing PMI (consensus: 56.8, previous: 57.7)\n    - ISM Non-Manufacturing Prices (previous: 64.4)\n    - MBA 30-Year Mortgage Rate (previous: 2.95%)\n    - MBA Mortgage Applications (previous: -4.1%)\n    - MBA Purchase Index (previous: 334.2)\n    - Markit Composite PMI (previous: 58.0)\n    - Mortgage Market Index (previous: 907.6)\n    - Mortgage Refinance Index (previous: 4,261.5)\n    - Services PMI (previous: 57.5)\n\n## Upcoming events for Thursday, February  4th\n\n - Stock splits:\n\n    - GNTY @ **110:100** (Payable date: 02/12/2021)\n\n - Expected earnings:\n\n  ABB, ABC, AGCO, AINV, AIV, ALCO, ALXN, AME, AMRK, AOSL, APD, APDN, ARNC, ARRY, ARW, ARWR, ATVI, AVXL, BAX, BCE, BCO, BDX, BEP, BHE, BILL, BLL, BMY, BRBR, BRT, BSAC, BSBK, BSGM, BSIG, BTU, BV, CCS, CDR, CG, CI, CLX, CMI, CMS, COLM, COR, CPT, CRC, CSL, CTHR, CURO, CZNC, DB, DECK, DGX, DHX, DLX, DSPG, DX, DXC, DYN, EIGI, ENTA, ENVA, EQNR, ESS, EURN, EVBN, EXPO, F, FARM, FFG, FLT, FOUR, FTNT, FTV, GHL, GILD, GLOG, GLOP, GLT, GOOS, GPI, GPRO, GTIM, HIG, HIMX, HL, HSY, HUBG, ICE, IMKTA, IMRA, ING, IP, IRMD, JHG, KBAL, KN, KYMR, LANC, LBRT, LEA, LEE, LGF.A, LGF.B, LPLA, LPTH, LQDT, LSPD, LTRN, MCHP, MDP, MEIP, MLVF, MMS, MNR, MOD, MPW, MPWR, MRK, MSGN, MSI, MSON, MTA, MTD, MTX, MYGN, NBIX, NEWR, NFG, NGL, NGVC, NICK, NJR, NKSH, NLOK, NMR, NNA, NOK, NOV, NRZ, NS, NWS, NWSA, NYT, OCSI, OCSL, ODFL, OESX, OFC, OHI, ONEW, ONTO, ORIC, OTEX, PBH, PCTY, PDEX, PENN, PFPT, PFSI, PH, PINS, PIPR, PLT, PM, PMT, POST, PRO, PRU, PTEN, PTON, PXLW, PZG, RDS.A, RDS.B, RFP, RGS, RL, SBH, SKX, SKYW, SNA, SNAP, SOGO, SOHU, SPH, SQFT, SR, STLA, SVM, SXC, SXI, SYNA, TDC, THFF, THR, TKR, TM, TMUS, TNAV, TOT, TPL, TPR, TRNO, TW, TWST, U, UEPS, UL, ULBI, ULH, UNM, USAK, USAT, UTI, VREX, VRTU, VSAT, VSTO, WD, WEC, WERN, WLL, WMS, WWE, WYNN, XYL, YRCW, YTRA, YUM, ZEN\n\n - Ex-div:\n\n  AFB, AMSWA, BKEP, BMRC, BPFH, BRO, CADE, CEQP, CFFN, CIT, CMCO, CMS, COST, DCOM, DCP, DHF, FCBC, FCF, FE, FFWM, FHI, FRAF, GMLP, GPP, HOPE, IBCP, IBOC, IDA, JBHT, LBC, LW, MET, MMLP, MMP, NBLX, NEA, NEP, NSC, NYCB, PNFP, PPBI, RELL, SSSS, SYF, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.065%)\n    - Challenger Job Cuts (previous: 77.030K)\n    - Continuing Jobless Claims (consensus: 4,700K, previous: 4,771K)\n    - Durables Excluding Defense (previous: 0.5%)\n    - FOMC Member Daly Speaks\n    - Factory Orders (consensus: 0.7%, previous: 1.0%)\n    - Factory orders ex transportation (previous: 0.8%)\n    - Initial Jobless Claims (consensus: 830K, previous: 847K)\n    - Jobless Claims 4-Week Avg. (previous: 868.00K)\n    - Natural Gas Storage (consensus: -136B, previous: -128B)\n    - Nonfarm Productivity (consensus: -2.8%, previous: 4.6%)\n    - Unit Labor Costs (consensus: 4.0%, previous: -6.6%)\n\n## Upcoming events for Friday, February  5th\n\n - Expected earnings:\n\n  ADNT, AENZ, ALUS, AON, ASX, ATLO, AYRO, BBU, BERY, BH.A, BHAT, CAH, CBOE, CIVB, CSWI, DJCO, EAF, EL, FCCY, FE, FGBI, GENC, GRC, GROW, HMC, HRC, IBN, INTG, ITW, JOUT, LAZ, LIN, LIVX, NATH, OIIM, RBKB, REGN, ROAD, SCX, SKM, SMFG, SNY, SPB, TCFC, TT, UI, VIVO, ZBH\n\n - Ex-div:\n\n  AAPL, AROC, ARTNA, ASRV, AWK, BCO, BX, CLAR, CSV, CWT, EBTC, ET, FBIZ, FBK, GAM, GLOP, GLP, GROW, GWW, HAFC, HBCP, HBT, INTC, LBAI, MATW, MPLX, MRLN, NATI, NS, NSEC, OCFC, OHI, PCTI, PEBO, PZZA, RBNC, SJW, STND, SUN, WABC, WVFC, X\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 5.0%, previous: 5.1%)\n    - Average Hourly Earnings (consensus: 0.3%, previous: 0.8%)\n    - Average Weekly Hours (consensus: 34.7, previous: 34.7)\n    - CFTC Aluminium speculative net positions (previous: 3.2K)\n    - CFTC Copper speculative net positions (previous: 70.3K)\n    - CFTC Corn speculative net positions (previous: 547.7K)\n    - CFTC Crude Oil speculative net positions (previous: 504.6K)\n    - CFTC Gold speculative net positions (previous: 257.5K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 39.7K)\n    - CFTC Natural Gas speculative net positions (previous: 11.6K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -28.4K)\n    - CFTC Silver speculative net positions (previous: 54.5K)\n    - CFTC Soybeans speculative net positions (previous: 236.4K)\n    - CFTC Wheat speculative net positions (previous: 36.2K)\n    - Consumer Credit (consensus: 12.00B, previous: 15.27B)\n    - Government Payrolls (previous: -45.0K)\n    - Manufacturing Payrolls (consensus: 30K, previous: 38K)\n    - Nonfarm Payrolls (consensus: 50K, previous: -140K)\n    - Participation Rate (previous: 61.5%)\n    - Payrolls Benchmark (previous: -514.00)\n    - Payrolls Benchmark, n.s.a. (previous: -173.00K)\n    - Private Nonfarm Payrolls (consensus: 60K, previous: -95K)\n    - Trade Balance (consensus: -65.70B, previous: -68.10B)\n    - U.S. Baker Hughes Oil Rig Count (previous: 289)\n    - U.S. Baker Hughes Total Rig Count (previous: 378)\n    - U6 Unemployment Rate (previous: 11.7%)\n    - Unemployment Rate (consensus: 6.7%, previous: 6.7%)\n\n^^^^2021-02-03",
        "created_utc": 1612350021,
        "id": "gluke83",
        "permalink": "/r/RobinHood/comments/lbl608/daily_discussion_thread_february_3rd_2021/gluke83/",
        "score": 0,
        "subreddit": "RobinHood",
        "created": 1612378821.0
    },
    {
        "author": "blompersv2",
        "body": "Tilray is definitely too high, FLT (TSX) is up next just check the graphs",
        "created_utc": 1612974615,
        "id": "gmty2su",
        "permalink": "/r/stocks/comments/lgslv4/is_tlry_and_apha_the_freeest_money_of_all_time/gmty2su/",
        "score": -2,
        "subreddit": "stocks",
        "created": 1613003415.0
    }
]