[
    {
        "author": "JackB4Ucryptostonkrs",
        "body": "Bezos been a talking head for years, now that Andy Jassy running the company the stock got a good pop, similar to when John Chambers left CSCO, Gates and idiot Balmer left softy. Nothing would happen to AmZn stock if Bezos just drifted into oblivion. But yeah, your asking if ONE crashed and if Branson went down in a blaze of glory so would SPCE",
        "created_utc": 1625947213,
        "id": "h4qgvk9",
        "score": 92,
        "subreddit": "stocks",
        "created": 1625976013.0
    },
    {
        "author": "FancyGonzo",
        "body": "well 20 years ago Microsoft, GE, and Cisco were the 3 biggest companies by market cap so things can change quickly",
        "created_utc": 1625903875,
        "id": "h4ojnya",
        "score": 48,
        "subreddit": "stocks",
        "created": 1625932675.0
    },
    {
        "author": "Chippopotanuse",
        "body": "One reason is that they aren’t static indexes. They are dynamic survivor bias indexes. What does that mean? \n\nIt means they replace losers with winners. Go look at the Dow or S&amp;P components from 1980 and see how the castoffs have fared. \n\nFor the Dow, changes used to be VERY rare. From 1959-1976 there were ZERO changes. \n\nNow? It changes its components several times\na year. \n\nIf it didn’t keep doing this, it wouldn’t “perform”\nNearly as well.\n\nLook at how shitty GE has done over the past three years. They used to be THE corporate bellwether of the US economy. But GE’s plunge didn’t hurt the Dow at all. It was removed as a component in the middle of 2018. \n\nIn March of 2015 the Dow added Apple to replace AT&amp;T (once so big and fearful it had to be busted up by regulators, but is now a dogshit dividend stock). That one change alone did wonders for the Dow average. \n\nIn Sept 2013, Nike, Goldman Sachs, and Visa replaced such dogs as Hewlett-Packard and Alcoa.\n\nIn 2009, Cisco Systems replaced GM.\n\nAnyways, you get the point. The Dow and S&amp;P, by definition, will always go up over time. They will simply drop dog sticks with no future and replace them with up and coming stalwarts. \n\nI’ve often looked, but have never found, a report that would show how the Dow and S&amp;P would have performed if they didn’t modify their components and always stack the decks. \n\nTLDR: the Dow and S&amp;P change the component stocks to always contain far more winners than losers. They will rise over time. They don’t reflect the more broad stock market as a whole, nor do they reflect how the average American family is doing economically. They just reflect a basket of “winning” stocks.",
        "created_utc": 1626608826,
        "id": "h5md3jc",
        "score": 47,
        "subreddit": "stocks",
        "created": 1626637626.0
    },
    {
        "author": "kneeil",
        "body": "I would be careful about TSLA as a long-term play right now for 3 reasons:\n\n1) it’s fairly unclear if Tesla will be able to retain their lead in EV. Many other automakers are entering EV. For instance, Toyota claims to have game-changing solid-state battery tech in the works. If this is true, then Toyota could potentially be the leader in EV (especially if you combine game-changing tech with their already-stellar reputation and market share). Or maybe some other car company. Who knows?\n2) Tesla is currently very expensive. At a valuation of 600B, Tesla’s current price tag is on par with the largest, most successful, and highest-profit companies in the world. To buy now means you expect them long-term to continue going up on top of this already-massive valuation. Possible, but definitely risky (especially for a company that is very new, has relatively low profits, and isn’t very diversified).\n3) currently, tesla’s valuation relies a lot on expectation of future earnings (nothing wrong with that; I like this style of investing). If the overall market takes a significant downturn before tesla can become very profitable, then their stock price will probably plummet (once the stock price goes down, people/institutions on margin need to sell, causing the price to go even lower, causing a cycle the way down; speculative stocks tend to get hit worst when this happens). Could be similar to Cisco circa 2000. Note that if this does happen, this might actually be a good time to buy shares for cheap if you do still believe in the long-term for tesla\n\nThese are just my thoughts. Not financial advice. I personally own put options on tesla (but also own shares of tesla in an account that someone else manages for me)",
        "created_utc": 1625352621,
        "id": "h3ytg1v",
        "score": 38,
        "subreddit": "stocks",
        "created": 1625381421.0
    },
    {
        "author": "Safe_Blueberry",
        "body": "I'm presuming you're American.\n\nA lot of Canadian energy-related stocks are inexpensive, like CNQ, PBA, ENB, and TRP. The only thing that I want to point out is that there is a 15% dividend withholding tax if these stocks are not held in a retirement account.\n\nThere are a lot of good and inexpensive UK stocks, like LGGNY, BTI, RDS.B, and BBL. The only things that I want to point out is that British stocks tend to pay biannually, not quarterly, and there is no dividend withholding tax.\n\nOther places without a dividend withholding tax include Hong Kong and Singapore. These two companies pay biannually and have caught my eye - SUHJY and UOVEY.\n\nInexpensive American dividend stocks include BEN, PFE, MO, WBA, VZ, and CSCO.\n\nIf you're interested in more American dividend stocks, I recommend looking at VYM's holdings. VYM is Vanguard's High Dividend Yield ETF.",
        "created_utc": 1625260339,
        "id": "h3up7qc",
        "score": 37,
        "subreddit": "stocks",
        "created": 1625289139.0
    },
    {
        "author": "EitherToe",
        "body": "We are all in here for money, not for political garbage on what's right or wrong. Ignore the Reddit stupidity of \"HurRrH Durrrrr, cHIna BAd\" therefore stock go down. We see JP Morgan pull \"I did not take a bribe\" but here we are betting on them or some other unethical company. Didi even has Goldman Sachs, Apple and Uber buy-in/management/oversight. Alibaba has big names like Charlie Munger buying stock, most people wouldn't bet against these people/companies.\n\nBig tech USA is never going to win in Asia, this makes no sense. People here who think the Chinese government is going to let AWS or Microsoft run its software have done no research. A market of 1.4 billion, expecting to reach a greater GDP in 5 or so years is going to open its legs for the US? Let that sink in for a moment, the richest people in the US are owners of large US companies and supported by the US government. Is China dumb enough to let Amazon in and give them a free business that can't be controlled? Huawei failed outside of China but it's going to be building Chinese IoT infrastructure just like Cisco, Salesforce, AWS etc. \n\nChina already has its big tech equivalent, some of them turning volumes higher than their US counterparts. I won't push people to either side, just present some arguments. You bet on what you think will actually make you money given your risk tolerance.",
        "created_utc": 1626708070,
        "id": "h5rf1bs",
        "score": 28,
        "subreddit": "stocks",
        "created": 1626736870.0
    },
    {
        "author": "left_turn_signal",
        "body": "\"The bulk of the Pelosis' money comes from investments in stocks and real estate. Operating through Financial Leasing Services, his San Francisco investment firm, Paul Pelosi owns stock in companies including Microsoft, AT&amp;T, Cisco Systems, Disney, Johnson &amp; Johnson and a variety of tech stocks.\nReal estate investments include a four-story office building at 45 Belden St. in the Financial District, office buildings on Battery and Sansome streets near the Embarcadero, a building housing a Walgreens drugstore near Ocean Beach and other commercial property in San Anselmo.\nOther investments include a St. Helena vineyard worth between $5 million and $25 million, a $1 million-plus townhome in Norden (Nevada County), and minority interests in the Auberge du Soleil resort hotel in Rutherford, the CordeValle Golf Club in San Martin, and the Piatti Italian restaurant chain.\"\n\nLook at the date of that article 2007. \n\n(https://www.sfgate.com/politics/article/Pelosi-s-husband-prefers-a-low-profile-2660253.php)",
        "created_utc": 1625593216,
        "id": "h49df75",
        "score": 12,
        "subreddit": "options",
        "created": 1625622016.0
    },
    {
        "author": "ogstepdad",
        "body": "Do you only make idiotic plays and follow dumb meme companies? My voo, spy, msft,spyg,most tech (google, cisco, apple,Amazon) are all green. The market is not all like this. Are you new to wsb? Where like, you only play the gme and other meme stocks?",
        "created_utc": 1625676449,
        "id": "h4ddxh8",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1625705249.0
    },
    {
        "author": "slickshoes_",
        "body": "I wouldn't say it's necessarily a dying a company but it feels like it's heading in the same way that IBM, Cisco &amp; Oracle are currently.\n\nMore stagnant than dying, but they are in an industry that is expected to grow long term, so it gives they impression that they are dying compared to the projected growth of their competition.",
        "created_utc": 1627295711,
        "id": "h6km4z8",
        "score": 10,
        "subreddit": "stocks",
        "created": 1627324511.0
    },
    {
        "author": "BakerStreetBoys221B",
        "body": "Cough, cisco. 2000 wasn't kind",
        "created_utc": 1627091719,
        "id": "h6bjmef",
        "score": 6,
        "subreddit": "stocks",
        "created": 1627120519.0
    },
    {
        "author": "FeedHappens",
        "body": "Recommending AAPL today is like recommending General Electric, Cisco or AOL 20 years ago.",
        "created_utc": 1625403713,
        "id": "h40p3kh",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625432513.0
    },
    {
        "author": "Theerix218",
        "body": "Cisco calls cheapies",
        "created_utc": 1625527131,
        "id": "h46ggpu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625555931.0
    },
    {
        "author": "thisispoopoopeepee",
        "body": "I'd say stocks with a wide global reach, because international revenue and investors will counterbalance USD inflation.\n\n\nSo yeah big tech will be fine.\n\nProcter &amp; Gamble, Cisco, hell even ford has large amounts of exports.",
        "created_utc": 1626112479,
        "id": "h4y1ih6",
        "score": 5,
        "subreddit": "investing",
        "created": 1626141279.0
    },
    {
        "author": "metallica11",
        "body": "yeah and cisco/yahoo/aol were obvious plays in the late 90s.",
        "created_utc": 1625604308,
        "id": "h4a2eef",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625633108.0
    },
    {
        "author": "greenbayva",
        "body": "What do you think jpows soundtrack is while he is in his basement cranking out sheets of 100s? I like to think of him covered in green ink, pelvis thrusting to the thong song by Cisco at 3am.",
        "created_utc": 1626398420,
        "id": "h5cfrkv",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1626427220.0
    },
    {
        "author": "FinndBors",
        "body": "&gt; This ain’t like 2000\n\nIn a ton of valuation metrics they are worse than any other time in history other than 2000. And when people think of 2000, they think of pets.com being ridiculous. Those shit companies were not in any index and pets.com was 300-400 million market cap at its peak (which it held for a very short time). You can equate pets.com to companies like NKLA which make gravity powered trucks. NKLA was ~ 30B market cap at its peak -- and it's still worth 5B+. Pets.com actually had a business / revenue, tons of SPACs are little more than post series A companies, all of them worth well over a billion.\n\nThe \"real\" megacap tech companies of 2000 were hewlett packard, microsoft, ibm, csco, intel, sun, compaq, etc. Their P/E ratios are much closer to the FAANGs of today. And most of the peak P/E ratios happened after a series of bad earnings.\n\nThe only thing that is legitimately different now than before is low interest rates. Which is why inflation / fed reaction is a genuine serious fear.",
        "created_utc": 1626571480,
        "id": "h5kueqq",
        "score": 4,
        "subreddit": "stocks",
        "created": 1626600280.0
    },
    {
        "author": "Gareaugorille69",
        "body": "MU-SPCE-LI-CSCO ⬆️",
        "created_utc": 1625169972,
        "id": "h3q03g4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625198772.0
    },
    {
        "author": "greytoc",
        "body": "I'm still waiting for CSCO to get back to their ATH.",
        "created_utc": 1626376909,
        "id": "h5b6piq",
        "score": 3,
        "subreddit": "investing",
        "created": 1626405709.0
    },
    {
        "author": "hahdbdidndkdi",
        "body": "Did it apply to Cisco and intel and unysis in 1999?",
        "created_utc": 1625496979,
        "id": "h44tvav",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625525779.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  1st of July\n\n\n\n## Upcoming events for Thursday, July  1st\n\n - Expected earnings:\n\n  ADIL, AFMD, APOP, AYI, CCEP, CIH, CKX, CSAN, DYAI, EBR, EBR.B, FRSX, GHG, GNFT, GNPX, LNN, MACK, MKC, MKC.V, MYSZ, NUZE, PTIX, RYB, SBSW, SFUN, SMPL, TC, TDAC, UTSI, WBA\n\n - Ex-div:\n\n  AFB, AXP, BMY, DOC, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, GD, GL, HASI, HBNC, HLIO, HNP, IAE, IDE, IGA, IGD, IHD, IRT, ITUB, LEN, LEN.B, MFNC, NRZ, RBC, SPG, SYY, THO, UBA, UBP, VIV, WIRE, WSR\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.050%)\n    - Challenger Job Cuts (previous: 24.586K)\n    - Construction Spending (consensus: 0.4%, previous: 0.2%)\n    - Continuing Jobless Claims (consensus: 3,382K, previous: 3,390K)\n    - ISM Manufacturing Employment (previous: 50.9)\n    - ISM Manufacturing New Orders Index (previous: 67.0)\n    - ISM Manufacturing PMI (consensus: 61.0, previous: 61.2)\n    - ISM Manufacturing Prices (consensus: 86.5, previous: 88.0)\n    - Initial Jobless Claims (consensus: 390K, previous: 411K)\n    - Jobless Claims 4-Week Avg. (previous: 397.75K)\n    - Manufacturing PMI (previous: 62.6)\n    - Natural Gas Storage (consensus: 68B, previous: 55B)\n    - OPEC Meeting\n    - Total Vehicle Sales (previous: 17.00M)\n\n## Upcoming events for Friday, July  2nd\n\n - Expected earnings:\n\n  AIRT, ANAT, AZRX, BRID, CBLI, EH, GB, GTT, GWGH, HUSA, IRCP, MARPS, MDLY, MMAT, MSN, MTR, MYMD, PALI, SQBG, TMBR, TPST, XIN, XPL\n\n - Ex-div:\n\n  A, ANDE, BBD, BBDO, BKSC, BRX, BST, CSCO, CUZ, DG, EIX, ERIE, GFED, IVR, JPM, JW.A, JW.B, KFY, KMF, KYN, LMNR, PKBK, QADA, QADB, SCS, SCVL, UBFO, WERN\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 3.7%, previous: 2.0%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.5%)\n    - Average Weekly Hours (consensus: 34.9, previous: 34.9)\n    - CFTC Aluminium speculative net positions (previous: 2.6K)\n    - CFTC Copper speculative net positions (previous: 7.7K)\n    - CFTC Corn speculative net positions (previous: 388.4K)\n    - CFTC Crude Oil speculative net positions (previous: 526.2K)\n    - CFTC Gold speculative net positions (previous: 166.2K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -10.4K)\n    - CFTC Natural Gas speculative net positions (previous: -105.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 59.3K)\n    - CFTC Silver speculative net positions (previous: 39.9K)\n    - CFTC Soybeans speculative net positions (previous: 180.9K)\n    - CFTC Wheat speculative net positions (previous: 25.8K)\n    - Durables Excluding Defense (previous: 1.7%)\n    - Factory Orders (consensus: 1.6%, previous: -0.6%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Government Payrolls (previous: 67.0K)\n    - Manufacturing Payrolls (consensus: 28K, previous: 23K)\n    - Nonfarm Payrolls (consensus: 700K, previous: 559K)\n    - Participation Rate (previous: 61.6%)\n    - Private Nonfarm Payrolls (consensus: 600K, previous: 492K)\n    - Trade Balance (consensus: -71.40B, previous: -68.90B)\n    - U.S. Baker Hughes Oil Rig Count (previous: 373)\n    - U.S. Baker Hughes Total Rig Count (previous: 470)\n    - U6 Unemployment Rate (previous: 10.2%)\n    - Unemployment Rate (consensus: 5.7%, previous: 5.8%)\n\n^^^^2021-07-01",
        "created_utc": 1625133613,
        "id": "h3nzj63",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1625162413.0
    },
    {
        "author": "clb909909",
        "body": "I do read a lot yahoo, fidelity, schwab... also stockcharts, finviz, investopedia... and on and on and on... found lots of really good stocks... most are up in the stratosphere ... still trying to figure out exactly what a \"good entry point\" is.. i've jumped into a few that have done ok.. csco, hpq, msft, dhr ( only bought 1 share and don't remember why i thought it was risky ), others, not so well.. bb ( what was i thinking?!), cpng, coin (ugh!) . Hoping to make better choices. So much to learn... so little time. Thanks for your input.. appreciate it",
        "created_utc": 1626134736,
        "id": "h4zbwi7",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1626163536.0
    },
    {
        "author": "curatingFDs",
        "body": "Seriously you need to look at Cisco. Literally hasn’t moved in years",
        "created_utc": 1626346223,
        "id": "h59enbh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626375023.0
    },
    {
        "author": "GeezWhizGuys",
        "body": "I own ZS, Crowdstrike and CSCO even though its not pure cybersecurity. I need to circle back to Fortinet to see what it's doing.",
        "created_utc": 1626726407,
        "id": "h5sluxn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626755207.0
    },
    {
        "author": "LambdaLambo",
        "body": "&gt; Those shit companies were not in any index and pets.com was 300-400 million market cap at its peak (which it held for a very short time). You can equate pets.com to companies like NKLA which make gravity powered trucks. NKLA was ~ 30B market cap at its peak -- and it's still worth 5B+\n\nThat kinda helps my point though. NKLA tanked but it has no correlation to the overall stock market, and the whole stock market went up in fact. Same with the entire SPAC bubble. Yes it was a bubble, but it popped and the market moved on its way without missing a beat. \n\n&gt; The \"real\" megacap tech companies of 2000 were hewlett packard, microsoft, ibm, csco, intel, sun, compaq, etc. Their P/E ratios are much closer to the FAANGs of today. And most of the peak P/E ratios happened after a series of bad earnings.\n\nEven then the PE ratios are not the same. MSFT in it's peak in 1999 had a PE ratio of ~82, it now has a PE ratio of ~35. \n\nI'm not gonna say that *every* company today is fine. Many are not (including NKLA). But the 2000 was endemic throughout the market (i.e. say \"internet\" and stock 10x'd at ipo). Today the market is much more varied and plenty of companies trading at high multiples do so because they're growth is very real.\n\nSorta unrelated but I personally believe tech got an insane boost from covid which is/will be driving huge digitalization efforts and  accelerate growth for many saas/cloud centric companies.",
        "created_utc": 1626578182,
        "id": "h5l7hzl",
        "score": 2,
        "subreddit": "stocks",
        "created": 1626606982.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Friday, the  2nd of July\n\n\n\n## Upcoming events for Friday, July  2nd\n\n - Expected earnings:\n\n  AIRT, ANAT, BRID, CBLI, EH, GB, GTT, GWGH, HUSA, IRCP, MARPS, MDLY, MMAT, MSN, MTR, MYMD, PALI, SQBG, TMBR, TPST, XIN, XPL\n\n - Ex-div:\n\n  A, ANDE, BBD, BBDO, BKSC, BRX, BST, CSCO, CUZ, DG, EIX, ERIE, GFED, IVR, JPM, JW.A, JW.B, KFY, KMF, KYN, LMNR, PKBK, QADA, QADB, SCS, SCVL, UBFO, WERN\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 3.7%, previous: 2.0%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.5%)\n    - Average Weekly Hours (consensus: 34.9, previous: 34.9)\n    - CFTC Aluminium speculative net positions (previous: 2.6K)\n    - CFTC Copper speculative net positions (previous: 7.7K)\n    - CFTC Corn speculative net positions (previous: 388.4K)\n    - CFTC Crude Oil speculative net positions (previous: 526.2K)\n    - CFTC Gold speculative net positions (previous: 166.2K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -10.4K)\n    - CFTC Natural Gas speculative net positions (previous: -105.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 59.3K)\n    - CFTC Silver speculative net positions (previous: 39.9K)\n    - CFTC Soybeans speculative net positions (previous: 180.9K)\n    - CFTC Wheat speculative net positions (previous: 25.8K)\n    - Durables Excluding Defense (previous: 1.7%)\n    - Factory Orders (consensus: 1.6%, previous: -0.6%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Government Payrolls (previous: 67.0K)\n    - Manufacturing Payrolls (consensus: 28K, previous: 23K)\n    - Nonfarm Payrolls (consensus: 700K, previous: 559K)\n    - Participation Rate (previous: 61.6%)\n    - Private Nonfarm Payrolls (consensus: 600K, previous: 492K)\n    - Trade Balance (consensus: -71.40B, previous: -68.90B)\n    - U.S. Baker Hughes Oil Rig Count (previous: 373)\n    - U.S. Baker Hughes Total Rig Count (previous: 470)\n    - U6 Unemployment Rate (previous: 10.2%)\n    - Unemployment Rate (consensus: 5.7%, previous: 5.8%)\n\n## Upcoming events for Monday, July  5th\n\n - Expected earnings:\n\n  ATXI, BPT, BSGM, CIDM, CREG, CXDC, CYCN, ENIC, ENOB, FRD, FTFT, GSMG, HEPA, HJLI, NAOV, NEXT, ONVO, OPTT, PME, PSTI, PVL, THCA, THCB, TPHS, VLON, ZIVO\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.050%)\n    - 6-Month Bill Auction (previous: 0.055%)\n    - Total Vehicle Sales (previous: 15.40M)\n    - United States - Independence Day\n\n^^^^2021-07-02",
        "created_utc": 1625220015,
        "id": "h3sdafg",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1625248815.0
    },
    {
        "author": "Ninswitchsu",
        "body": "Workplace technology. Holding some calls on $ORCL and $CSCO.",
        "created_utc": 1625689917,
        "id": "h4e8o9h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625718717.0
    },
    {
        "author": "TownDrunkerd",
        "body": "Good call! I hold a little bit myself. I also hold a little TDIV. My thought being that the future dividend growth behemoths will likely be largely based in the tech industry. QCOM, CSCO and the likes are heavily weighted there as well.",
        "created_utc": 1625674081,
        "id": "h4d8iti",
        "score": 2,
        "subreddit": "investing",
        "created": 1625702881.0
    },
    {
        "author": "T0asterFork",
        "body": "How is collective defense any different than how antivirus companies and email gateways (think Cisco SMA, for one) already operate? Not saying you're wrong but I'm not sure how it's a game changer",
        "created_utc": 1625493989,
        "id": "h44oeqo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625522789.0
    },
    {
        "author": "Soybeanrice",
        "body": "csco is much better with xom runner up only because oil is volatile atm",
        "created_utc": 1626700264,
        "id": "h5qyl5d",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626729064.0
    },
    {
        "author": "BlackDahliaMuckduck",
        "body": "I like PGR and ALL. I also have minor positions in CSCO, AMD, &amp; HII.",
        "created_utc": 1625871860,
        "id": "h4n82xi",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1625900660.0
    },
    {
        "author": "hup_hup",
        "body": "Just cause a company is great and it has a bright future doesn't mean it's a good investment. Cisco in 2000 is always a good example to keep in mind.",
        "created_utc": 1625795526,
        "id": "h4jlmz2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625824326.0
    },
    {
        "author": "Chickensxyz",
        "body": "Robinhood news and Bezinga say we’re doing something with CSCO, what’s the word? I’m already in that pretty deep 👀",
        "created_utc": 1625869759,
        "id": "h4n461l",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625898559.0
    },
    {
        "author": "Threeaway411",
        "body": "Wat. Cisco has webex and Microsoft has teams…both very competitive",
        "created_utc": 1626702410,
        "id": "h5r2q05",
        "score": 2,
        "subreddit": "stocks",
        "created": 1626731210.0
    },
    {
        "author": "RememberSLDL",
        "body": "Thinking about CISCO puts after reading through a few reports and Chinese press releases. I was unaware, until today that is, that foreign computers, and electronic systems, were being phased out in China. Furthermore, the deadline for this change is set for 2022.",
        "created_utc": 1627215850,
        "id": "h6gu4qy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627244650.0
    },
    {
        "author": "Theerix218",
        "body": "CSCO calls 7-16 55.5 .08",
        "created_utc": 1625243435,
        "id": "h3tlsxa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625272235.0
    },
    {
        "author": "liqui_date_me",
        "body": "Some things will definitely NOT change. The internet in its current form is here to stay, which means all the infrastructure companies that power the internet are here to stay. This means companies like Amazon (AWS), Microsoft (Azure), Oracle and Google (GCP) will stay around. Cisco will be around for networking and server hardware, as will CDN providers like Akamai.",
        "created_utc": 1625956001,
        "id": "h4qxc2m",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625984801.0
    },
    {
        "author": "hearsatwo",
        "body": "Agreed I think of NFLX as the modern Cisco. One day they'll pop and will never truly recover.",
        "created_utc": 1625990546,
        "id": "h4sezcv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626019346.0
    },
    {
        "author": "LiqCourage",
        "body": "You are missing the other obvious drawback, which is that the company doesn't have a better use for the capital for some reason.  This has been all the rage with certain stocks, but the questions for the investor should be: why weren't they investing it in R&amp;D and bringing out better products ?  why aren't they improving production? why aren't they using it to purchase growth by buying other companies?  $CSCO for instance did a lot of share buy backs since 2000 and still haven't recovered their previous market high.",
        "created_utc": 1626271300,
        "id": "h55l9ho",
        "score": 1,
        "subreddit": "investing",
        "created": 1626300100.0
    },
    {
        "author": "kn1f3party",
        "body": "CSCO of all stocks helping keep me flat.",
        "created_utc": 1626273645,
        "id": "h55q8dk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626302445.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$CSCO, look at that old fart start to make some traction! If it keeps steam into next week, my tight little cheap options are gonna make some fat returns!",
        "created_utc": 1625856943,
        "id": "h4mdxe3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625885743.0
    },
    {
        "author": "throwaway_jawpain",
        "body": "Definitely.. but in individual stocks that are a small percent of your portfolio.. just in case. My uncle was balling out of control with Cisco back in the late 90s and he never recovered. Shit happens.",
        "created_utc": 1625676995,
        "id": "h4df68z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625705795.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$CSCO has got to be over its bottom of the day. Weirdly volatile in a way, gonna try to swing trade some options. 100 $53.5c 7/23",
        "created_utc": 1625586558,
        "id": "h48ygxu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625615358.0
    },
    {
        "author": "GlobalOwl3",
        "body": "Love this analysis. Buy CSCO CRM HLT as they are #1s from last few years?",
        "created_utc": 1626349354,
        "id": "h59iwxb",
        "score": 1,
        "subreddit": "options",
        "created": 1626378154.0
    },
    {
        "author": "townerino",
        "body": "Look at a chart of GE or CSCO over the last 20 years",
        "created_utc": 1626668150,
        "id": "h5psl46",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626696950.0
    },
    {
        "author": "ThePelvicWoo",
        "body": "This sounds great until you do something like buy CISCO in 2000. Now you're trapped in a loser and it takes a decade to get your money back.\n\nSure, your winrate would be pretty high doing this, but the problem with not having stops is that if you're wrong once, you're fucked. You'll be wrong eventually. Everyone is",
        "created_utc": 1627563221,
        "id": "h6y8dy1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627592021.0
    },
    {
        "author": "Theerix218",
        "body": "Cisco calls seem super cheap",
        "created_utc": 1625239454,
        "id": "h3tbpp5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625268254.0
    },
    {
        "author": "ThePandaRider",
        "body": "CSCO - Pretty solid balance sheets and more cash on hand than debt.",
        "created_utc": 1625266434,
        "id": "h3v1p5h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625295234.0
    },
    {
        "author": "Rich265",
        "body": "You mean like Cisco that crashed from $77 to $10? Yeah they had no fundamentals and were barely operational. Or Intel from $74 to $16? Yeah, they were all startups. No market crash here.",
        "created_utc": 1625304646,
        "id": "h3wl029",
        "score": 1,
        "subreddit": "investing",
        "created": 1625333446.0
    },
    {
        "author": "GeraltofOuterHeavia",
        "body": "None. It's not a metric I consider for investing. Long term, it basically always lags the market unless you're constantly getting lucky with picking exactly *the* revolutionary company, every single time. Unlikely, and not even the most successful active investors pick their stocks that way. \n\nIt's just too easy to, for every dollar to put into Amazon or Apple in 1999, to also put into pets.com or Cisco.",
        "created_utc": 1625707314,
        "id": "h4f9hqz",
        "score": 1,
        "subreddit": "investing",
        "created": 1625736114.0
    },
    {
        "author": "merlinsbeers",
        "body": "You shorted all of this at once? Why not just buy a VIX call?\n\nTop 10 Holdings (66.93% of Total Assets)\n\nName Symbol % Assets  \nApple Inc AAPL 21.46%  \nMicrosoft Corp MSFT 20.38%  \nNVIDIA Corp NVDA 4.98%  \nVisa Inc Class A V 3.95%  \nPayPal Holdings Inc PYPL 3.42%  \nMastercard Inc A MA 3.19%  \nAdobe Inc ADBE 2.80%  \nIntel Corp INTC 2.26%  \nSalesforce.com Inc CRM 2.26%  \nCisco Systems Inc CSCO 2.23%",
        "created_utc": 1626062315,
        "id": "h4vuq7a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626091115.0
    },
    {
        "author": "forthetorino",
        "body": "DG and CSCO can absolutely suck it.",
        "created_utc": 1625583937,
        "id": "h48ssyd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625612737.0
    },
    {
        "author": "Awkward-Painter-2024",
        "body": "Wait, it's not happening right now???? My $CSCO is down 1.90%!!!!!!!!!!!!!!",
        "created_utc": 1625591447,
        "id": "h499gwf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625620247.0
    },
    {
        "author": "RennieDelano",
        "body": "35 MSFT 19.7%\n56 AAPL 17%\n25 SQ 12.8%\n100 NIO 9.5%\n50 AMD 9.5%\n35 ABBV 8.6%\n52 O 7.5%\n100 TTCF 4.2%\n34 CSCO 3.8%\n41 PFE 3.4%\n31 AFL 3.4%\n20 VTRS 0.5%",
        "created_utc": 1625857081,
        "id": "h4me838",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625885881.0
    },
    {
        "author": "filtervw",
        "body": "Don't be so sure, just look at IBM, Cisco,ATT and image how many people where happy to have brought the dip in 2013. 😆 Even Buffet got burned with IBM working on hopium.",
        "created_utc": 1625933203,
        "id": "h4ppd92",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625962003.0
    },
    {
        "author": "Rand_alThor__",
        "body": "Cisco too. Looked unstoppable.",
        "created_utc": 1625465926,
        "id": "h43qbp7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625494726.0
    },
    {
        "author": "hahdbdidndkdi",
        "body": "It applies to the broad market. Ie broad index funds, such as a s&amp;p funds or global funds. Hence the 'market' in the quote.\n\nIt doesn't really apply to stock picking. Because it's really easy to pick wrong, again see Intel, unysis, and Cisco as just a few of many examples. Had you picked them at their peak in 1999/2000 you'd still be looking to get back to even 20+ years later.\n\nAnd I'm sure plenty of research at the time would have suggested they were great picks for future returns.",
        "created_utc": 1625499336,
        "id": "h44yel1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625528136.0
    },
    {
        "author": "kn1f3party",
        "body": "I C U CSCO.",
        "created_utc": 1626284329,
        "id": "h56enli",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626313129.0
    },
    {
        "author": "Eggsor",
        "body": "All I read was buy Cisco LEAPS 🚀",
        "created_utc": 1626285513,
        "id": "h56hd04",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626314313.0
    },
    {
        "author": "pigsgetfathogsdie",
        "body": "I had friends who became paper multi-millionaires from a fukkin greetingcard.com company…then…poof…lost it all.\n\nMultiply the above by a few thousand totally shady tech IPOs.\n\nFrom Wiki…was totally mental…\n\nBetween 1995 and its peak in March 2000, the Nasdaq Composite stock market index rose 400%, only to fall 78% from its peak by October 2002, giving up all its gains during the bubble. During the crash, many online shopping companies, such as Pets.com, Webvan, and Boo.com, as well as several communication companies, such as Worldcom, NorthPoint Communications, and Global Crossing, failed and shut down.\n\nSome companies, such as Cisco, whose stock declined by 86%, Amazon.com, and Qualcomm, lost a large portion of their market capitalization but survived.",
        "created_utc": 1627681007,
        "id": "h74ss00",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627709807.0
    },
    {
        "author": "Healthy_Smell8396",
        "body": "Cisco",
        "created_utc": 1627655235,
        "id": "h7348s3",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1627684035.0
    },
    {
        "author": "jonfromdelocated",
        "body": "Yes on everything but the painkillers. That’s shit is seriously dangerous bro. Cheap wine too, but fuck it. Is it Cisco? Better not be Cisco.",
        "created_utc": 1627435117,
        "id": "h6rzrrx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627463917.0
    },
    {
        "author": "thri54",
        "body": "Put another way, Apple's Iphone revenue is more than the total revenue of the Home Depot or Costco.  \n\nIt's more than the revenue of Cisco, Intel, AMD, and Nvidia combined.  \n\nIt's more than Microsoft's total revenue.  \n\nIt's... a really big number.",
        "created_utc": 1627440689,
        "id": "h6sauqu",
        "score": 1,
        "subreddit": "investing",
        "created": 1627469489.0
    },
    {
        "author": "uset223",
        "body": "Ok but you can own part of GE or CSCO and make have negative returns fir years. Buy ETFs and you spread out the risk and make decent returns. This is a game of singles &amp; doubles once in a while you hit a home run.",
        "created_utc": 1625417636,
        "id": "h41fq08",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625446436.0
    },
    {
        "author": "boyinahouse",
        "body": "Nah, the other 20 could have been Exxon, Cisco, General Electric, Citibank, IBM, and other \"amazing\" companies :)",
        "created_utc": 1625601805,
        "id": "h49wl32",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625630605.0
    },
    {
        "author": "Bab_Tastic",
        "body": "Appl applied materials and Cisco",
        "created_utc": 1625811465,
        "id": "h4kb5ur",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625840265.0
    },
    {
        "author": "filtervw",
        "body": "Don't be so sure, just look at IBM, Cisco,ATT and image how many people where happy to have brought the dip in 2013. 😆 Even Buffet got burned with IBM working on hopium.",
        "created_utc": 1625933191,
        "id": "h4ppc8w",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625961991.0
    },
    {
        "author": "HouseHead7111",
        "body": "I live in Crested Butte Colorado and this past week Coca Cola was unable to deliver to our local restaurants. The Cisco delivery guy said they’re out of coke at the facility. Lol",
        "created_utc": 1625929931,
        "id": "h4pigup",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625958731.0
    },
    {
        "author": "pml1990",
        "body": "Horrible advice. **This only works for market-wide ETFs in the US** (so not ARK, not emerging markets, not Japan, not Europe), not individual stocks. If people had followed this advice and hold CISCO in 2000, they would still have not recovered their money after 20 years.",
        "created_utc": 1625963261,
        "id": "h4ra6fy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625992061.0
    },
    {
        "author": "bragghy",
        "body": "The mechanics are pretty similar to the 90s. From what I read there were people on Yahoo message boards talking about how high CISCO could go. My point is: is the magnitude similar? Were there really 20% of young americans trading stocka during the late 90s like they are today?",
        "created_utc": 1625553507,
        "id": "h47mvhy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625582307.0
    },
    {
        "author": "wooderboy1",
        "body": "Cisco",
        "created_utc": 1626139046,
        "id": "h4zk3vu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626167846.0
    },
    {
        "author": "lululuminminmin",
        "body": "Long holds? CRWD has been bouncing around for a minute. CSCO kinda ate it today",
        "created_utc": 1626735323,
        "id": "h5t5krb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626764123.0
    },
    {
        "author": "DarthTrader357",
        "body": "So what happened to you is called \"getting stopped out\" and it's a dumb risk that you never have to expose yourself to. I had fun in my last post but I'll explain more about what you ***probably should do.***\n\n1. Buy 100 shares @ reasonable stock and price. If you like Amazon, CSCO may be reasonable alternative though it's in the 50s price range. Tech sector - strong - good dividend. Yatta yatta.\n2. Sell a covered call @ strike price  you're willing to sell. Ideally put it in the expected move range. Delta = About 30. Or if you think the stock will go down (hence you want to sell out of it), sell a call at a strike somewhere in the money.\n3. use the covered call to buy a put.\n4. Using JPM as an example: Sell a covered call at $150 strike for $275 and buy a put for $117 dollars. You get paid $158 dollars to lock in a price between now and $149.\n5. If the price is going to drop below $149 you simply buy back the covered call (Buy to Close) which will now be cheaper or if it falls out of the money you don't even need to worry about it, it expires worthless.\n6. Exercise the put and sell your shares for $149, a price close to the top you wanted to sell out at anyway.\n\nVoilla - a collar, in a nutshell.\n\nYou literally got paid to **EXIT** a stock when **YOU** wanted to.",
        "created_utc": 1626977403,
        "id": "h65kdve",
        "score": 1,
        "subreddit": "investing",
        "created": 1627006203.0
    },
    {
        "author": "Smart_Trade_Buy_Now",
        "body": "Poly result is today. Since POLY headsets sales depends on peripheral sales like MSFT Teams, which grew drastically example MSFT Teams sales grew from 150 Million active users to 250 Million active users. Likewise Cisco, zoom etc. Today we will see great jump in Poly shares after Bell….",
        "created_utc": 1627567458,
        "id": "h6ygxx3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627596258.0
    },
    {
        "author": "smokexhash",
        "body": "Look it's Cisco from central city lol",
        "created_utc": 1627606312,
        "id": "h70z1di",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627635112.0
    },
    {
        "author": "UltimateTraders",
        "body": "Aapl adapts they have several times\nGe aol csco have not\n\nPc business, ipod, iphone, software...aapl",
        "created_utc": 1625403970,
        "id": "h40phs4",
        "score": 0,
        "subreddit": "stocks",
        "created": 1625432770.0
    },
    {
        "author": "EitherToe",
        "body": "Tech is a dangerous area to invest in. I find these discussions really hit or miss and should come with a big warning. Tech like medical fields have enormous issues imo, you got companies lending money at 1-2% to anyone out there which should be illegal and imo will be soon enough. Uber is basically something that skirts labour laws and wants to be a monopoly. Medical breakthroughs on news are mostly lies/held by red tape (which it should be). \n\nYeah, you got Apple and such, but these companies actually proved their worth on the balance sheet. China will (at least I strongly believe) have a great tech industry, but if you knew what they were, you wouldn't be here, you would be in some big boys club getting told what they are and aren't. Tech is an industry where the government boosts you up (lets be honest, the US heavily backs people like Cisco or Microsoft) or you do something that is a real breakthrough. But for every success story, there is another 10 failures, even though on paper it worked, you got people like Msft bashing your door with lawyers.",
        "created_utc": 1626935802,
        "id": "h63lh2g",
        "score": 0,
        "subreddit": "stocks",
        "created": 1626964602.0
    },
    {
        "author": "IvanThinking",
        "body": "You buy low and sell high. This is when you buy fellas. Whatever stocks your DD has lead you to buy, it's on discount today.\n\nI'm personally buying $WKHS\n\nWKHS is clearly growing as it is hiring a ton of engineers. https://recruiting.paylocity.com/Recruiting/Jobs/All/df0f8067-2068-443e-a66a-7c50cd057385/Workhorse-Technologies-Inc\r  \n\r  \n• Debt free, $250 Million cash on hand\r  \n• The WKHS C-650 will likely start shipping this month\r  \n• 32 C-1000’s built in April alone.\r  \n• Estimates from the last ER- 100 vehicles projected for Q2, 300 for Q3 and 600 for Q4\r  \n• Dr. Rob Wilson PhD COO / NASA fellow is working on refrigerated vehicles (likely have already built some). Rob worked for Cisco.. WKHS would be first to market with a 1000 cubic ft refrigerated truck.\r  \n• Pride Group launched their webpage Pride\r  \n• Pritchard launched their webpage Pritchard\r  \n• JB Poindexter website launched JB\r  \n• Patents for one piece composite body that bolts to skateboard (huge advantage for fleets and light) and for a removable one piece power terrain. (Quick to remove any engine and back on the road)\r  \n• The Horsefly drone should be get FAA approval this year. FAA approved truck launched autonomous drones.. WKHS owns this patent. UPS has been testing for 5 years. Come and get it Amazon.\r  \n• Orders:\r  \n1-Started with 1200 from UPS\r  \n2-Prichard ordered 500 spaced out quarterly, expecting more\r  \n3-Pride’s initial order is 120, Then 600 each through FY 2023. Followed by 5000 through the next 3 years- thought to be structured that way to ensure Canada’s infrastructure is in order.\r  \n\r  \n•\r  \n• $15B in EV infrastructure in current bi-partisan agreement for infrastructure, Biden admin pushed for $174B. This is the infrastructure and the government credits which make the EV delivery market much more attractive to buyers.\r  \nElectric vehicle infrastructure gets $15 billion in new US bipartisan proposal, new EV rebate to come later - Electrek",
        "created_utc": 1626696764,
        "id": "h5qsn7p",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1626725564.0
    },
    {
        "author": "TurtleRocket9",
        "body": "Loading up on sofi calls through earnings. Gap &amp; csco get a lil action too",
        "created_utc": 1626807607,
        "id": "h5wpolp",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1626836407.0
    },
    {
        "author": "NoyC111",
        "body": "Lol, time to ban Apple, Facebook, Google, Microsoft, AMD, Intel, Cisco, Nvidia, Samsung, Xiaomi, Amazon, Ebay and literally almost every big tech company because they all have R&amp;D centers in Israel.\nGood luck tho!",
        "created_utc": 1626812650,
        "id": "h5x1mlg",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1626841450.0
    },
    {
        "author": "Bobyjoyride",
        "body": "I agree at current price levels the PE is insane, waiting for the dip. This is the Cisco of 2001. Right now Intel is a much better long term strategy PE : 12.76 ~ then again most people here are shorterm thinking",
        "created_utc": 1625441584,
        "id": "h42q8b2",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1625470384.0
    },
    {
        "author": "RecklessWiener",
        "body": "SMH - semiconductors \n\nTop holdings:\n\nTSM\n\nNVDA \n\nASML \n\nINTC\n\nLRCX",
        "created_utc": 1625235808,
        "id": "h3t36xp",
        "score": 41,
        "subreddit": "investing",
        "created": 1625264608.0
    },
    {
        "author": "coolcomfort123",
        "body": "AMAT, LRCX, SWKS and QRVO.",
        "created_utc": 1625697144,
        "id": "h4ep9ez",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625725944.0
    },
    {
        "author": "GeezWhizGuys",
        "body": "That was me. Didn't check today, but NVDA and LRCX cooked my balls.  \n\nEDIT: oh fuck you!",
        "created_utc": 1626472781,
        "id": "h5g62sh",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1626501581.0
    },
    {
        "author": "apooroldinvestor",
        "body": "MSFT GOOGL AMZN AAPL NVDA LRCX ASML PYPL UNH .... Have beat the market for many years.\n\nUNH has returned 21% a year since 2000.  21 years it has beat the market.",
        "created_utc": 1625179706,
        "id": "h3qlq1c",
        "score": 6,
        "subreddit": "stocks",
        "created": 1625208506.0
    },
    {
        "author": "reddit-is-sus666",
        "body": "MU, ASX, QCOM, SWKS, AMAT, LRCX, AMD, and a few other that are around the 30 or less PE are all going to see strong growth. The sector of semiconductors has a lot of companies but they can all be successful and have huge business due to the size of the market. Semiconductors/microchips whatever you wanna call them are literally in everything we buy now except food/water (hopefully? Lol). \n\n\n\nI'm long Gas/Oil (XOM, COP) and Semiconductors the next couple years. Steel is a great play too, my favorite being CLF or NUE. I know the hype with electric vehicles but there are so many more aspects to oil/gas than cars. Gas/oil is going to be needed in large quantities for a decent amount of time ahead of us.",
        "created_utc": 1626364897,
        "id": "h5aeiwo",
        "score": 5,
        "subreddit": "options",
        "created": 1626393697.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Yeah but if you're long term 10+ years MSFT NOW is cheap as are most good companies.\n\nI like ASML and LRCX and NVDA of course.  PYPL and also UNH HUM and scientific medical companies.  Healthcare is great. People are living longer and healthcare is a huge expense that will only make more and more money as years go by.",
        "created_utc": 1625425912,
        "id": "h41wkuj",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625454712.0
    },
    {
        "author": "Beagleoverlord33",
        "body": "Abbv is probably my favorite dividend  stock that pays a higher yield. Plenty of good choices if you want smaller yield with some growth. I like AMAT LRCX LOW MSFT AAPL QSR FANG",
        "created_utc": 1625262711,
        "id": "h3uu9iu",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625291511.0
    },
    {
        "author": "apooroldinvestor",
        "body": "MSFT NVDA GOOGL AAPL AMZN LRCX ASML CRWD. You just buy and hold, dont sell.",
        "created_utc": 1626316358,
        "id": "h589i75",
        "score": 4,
        "subreddit": "stocks",
        "created": 1626345158.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Not if you buy MSFT AAPL PYPL GOOGL NVDA UNH HD LRCX ASML etc ....",
        "created_utc": 1625954361,
        "id": "h4qu9j4",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625983161.0
    },
    {
        "author": "coolcomfort123",
        "body": "TSM, AMD, LRCX, AMAT, SWKS and QRVO are good long term semi stocks.",
        "created_utc": 1625512368,
        "id": "h45o6vx",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625541168.0
    },
    {
        "author": "ajandl",
        "body": "They are both equipment suppliers (so same as ASML and AMAT) and have each of them supply first in class solutions to critical steps.\n\nAMAT and LRCX are often considered direct competitors, along with TEL (but that's listed on the Nikkei).",
        "created_utc": 1626346651,
        "id": "h59f6tr",
        "score": 3,
        "subreddit": "investing",
        "created": 1626375451.0
    },
    {
        "author": "omarc1492",
        "body": "650C on LRCX",
        "created_utc": 1626093522,
        "id": "h4wwtq3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626122322.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "hahah holy shit you're insane\n\ni'm going to go off top of my head\n\nCRWD, NET, ZS\n\nTGT, NKE, SBUX (its in your username!), GPS, LB, RH, DPZ, MCD, list goes on...\n\nNVDA is big tech but lets go with MU, LRCX, AMAT\n\nlol",
        "created_utc": 1626209167,
        "id": "h52v8o0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626237967.0
    },
    {
        "author": "apooroldinvestor",
        "body": "MSFT NVDA UNH HD PYPL LRCX to name a few.  You don't need Vanguards help.",
        "created_utc": 1625179967,
        "id": "h3qm9i0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625208767.0
    },
    {
        "author": "puregoblinvomit",
        "body": "My absolute fav, LRCX is more than 50% of my portfolio now, not on purpose but it just absolutely killed it last year. Also demand for NAND memory is only going to get stronger this year into next.",
        "created_utc": 1625435720,
        "id": "h42frb8",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625464520.0
    },
    {
        "author": "reddit-is-sus666",
        "body": "There's aren't many undervalued Semiconductor stocks based on the avg PE ratio in the sector, but AMAT is one of them. The others I have picked out are:\n\nASX\n\nII-VI\n\nKLAC\n\nLRCX\n\nMU\n\nQCOM\n\nSWKS\n\nTER\n\nTSM\n\n\n\n\nAMD is my favorite overall but after the recent run I'd wait for a better entry/try to swing some puts since it has never stayed up after a run",
        "created_utc": 1626018054,
        "id": "h4tfu9c",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1626046854.0
    },
    {
        "author": "georgiosauce",
        "body": "ASML only makes one type of machine really. Applied materials and lam research are the biggest companies for the rest of the fabrication process. KLA Tencor makes a lot of metrology equip for fabs as well. There are other big players but I don’t think they’re public, if they are they might be held by other companies",
        "created_utc": 1625428784,
        "id": "h4228ud",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625457584.0
    },
    {
        "author": "APComet",
        "body": "Nvda? Doubt. Idk about lrcx so no comment",
        "created_utc": 1625902770,
        "id": "h4oihid",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625931570.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I don't.  I believe that FANMAG will continue to perform well.  As will semiconductor equipment stocks ASML LRCX etc.  Healthcare UNH .\n\nMost stocks appreciate long term.",
        "created_utc": 1625625772,
        "id": "h4b8lo1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625654572.0
    },
    {
        "author": "jaw0",
        "body": "Lam Research (LRCX) &amp; ASML make the machines that make the chips.",
        "created_utc": 1625147156,
        "id": "h3oke6p",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625175956.0
    },
    {
        "author": "CrimsonKindle",
        "body": "LRCX has been on a tear and they keep revising guidance upwards",
        "created_utc": 1625684412,
        "id": "h4dw3an",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625713212.0
    },
    {
        "author": "apooroldinvestor",
        "body": "20 stocks only. $10k into LRCX ASML NVDA from 2000 etc would be worth millions now.",
        "created_utc": 1625603112,
        "id": "h49zkbv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625631912.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Doesn't embarrass me! I'm right. $10k in NVDA LRCX ASML SHW etc have produced WAY more than the sp500! Check out portfolio visualizer.\n\nDid you see how tech did again today?",
        "created_utc": 1625618157,
        "id": "h4au4x0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625646957.0
    },
    {
        "author": "apooroldinvestor",
        "body": "How about ASML and LRCX?!",
        "created_utc": 1625511211,
        "id": "h45lw9l",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625540011.0
    },
    {
        "author": "greenappletree",
        "body": "&gt;LRCX &amp; ASML\n\nPerformance these two companies seems to be very similar.  However, ASML looks like its more focus, more moat?  I like both though.",
        "created_utc": 1625150494,
        "id": "h3orlat",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625179294.0
    },
    {
        "author": "apooroldinvestor",
        "body": "You need MSFT AAPL PYPL NVDA ASML LRCX GOOGL.",
        "created_utc": 1625414263,
        "id": "h418tth",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1625443063.0
    },
    {
        "author": "Quirky-Touch7616",
        "body": "Applied materials \nAsml \nTsmc \nLam research",
        "created_utc": 1625451123,
        "id": "h435blm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625479923.0
    },
    {
        "author": "smokeyjay",
        "body": "yeah, I sold off my TSM and consolidated my semi play into LRCX in order to trim my portfolio.  LRCX has greater room for growth imo.\n\nHaving multiple semi names seems excessive.  Go buy an ETF in that case.",
        "created_utc": 1625687851,
        "id": "h4e3yh5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625716651.0
    },
    {
        "author": "ajandl",
        "body": "Don't forget LRCX and KLA",
        "created_utc": 1626315777,
        "id": "h588dtz",
        "score": 1,
        "subreddit": "investing",
        "created": 1626344577.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Bonds are terrible investments NOW.  There are better alternatives like MSFT JNJ PG etc.\n\nEven solid semiconductor equipment companies like LRCX and ASML.\n\nThere's risk of losing money and also risk from losing potential return.  Risk is how you see it.",
        "created_utc": 1625512222,
        "id": "h45nwch",
        "score": 0,
        "subreddit": "stocks",
        "created": 1625541022.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Why etfs? What if I hold a percentage in good stocks like LRCX PYPL MSFT etc? I don't consider good companies gambling really. LRCX and ASML make equipment that fascilitate semiconductors which are here to stay and to me will continue growing and growing.",
        "created_utc": 1625957820,
        "id": "h4r0lr7",
        "score": 0,
        "subreddit": "stocks",
        "created": 1625986620.0
    },
    {
        "author": "s0uly",
        "body": "AMD, NVDA, TSM, ON, AMAT, ASML, LRCX, MU\n\nOr SMH/SOXX",
        "created_utc": 1625720270,
        "id": "h4fw2nh",
        "score": 0,
        "subreddit": "stocks",
        "created": 1625749070.0
    },
    {
        "author": "apooroldinvestor",
        "body": "MSFT is the best along with NVDA LRCX ASML CRWD.  I'm also into healthcare stocks like UNH.  And I have a medical equipment mutual fund doing well in my IRA.  \n\nDon't listen to negative people.  The market always goes up regardless of corrections.",
        "created_utc": 1625507849,
        "id": "h45f9uu",
        "score": 0,
        "subreddit": "stocks",
        "created": 1625536649.0
    },
    {
        "author": "smokeyjay",
        "body": "Great comment.  I hold lrcx because i expect the semi demand to extend for a few more years but whose to say when it goes bust.\n\nDo you own any semis?",
        "created_utc": 1625735617,
        "id": "h4gdzrn",
        "score": 0,
        "subreddit": "stocks",
        "created": 1625764417.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Cause you don't know how to invest. Msft Google nvda ASML LRCX etc.",
        "created_utc": 1626548863,
        "id": "h5jn1iy",
        "score": -2,
        "subreddit": "stocks",
        "created": 1626577663.0
    },
    {
        "author": "dafazman",
        "body": "AAPL, MSFT, AMZN, NVDA, LRCX",
        "created_utc": 1625870972,
        "id": "h4n6fvi",
        "score": -2,
        "subreddit": "stocks",
        "created": 1625899772.0
    },
    {
        "author": "VATruckerJJ",
        "body": "So basically, short CHPT, PLUG, BLNK, MPWR. Because it make sense that it would go up, gotta apply the wsb inversion",
        "created_utc": 1625267587,
        "id": "h3v3xjq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625296387.0
    },
    {
        "author": "zdonowitz",
        "body": "Sell the profit so you are back to your initial investment. Do whatever u want with the profits. But i have to say, there’s really no reason to sell Apple or Microsoft ever",
        "created_utc": 1625526060,
        "id": "h46eiwq",
        "score": 743,
        "subreddit": "stocks",
        "created": 1625554860.0
    },
    {
        "author": "Philanthropy-",
        "body": "I’m so close to giving up and just putting everything (with the exception of amazon and Microsoft) into an S&amp;P 500 index fund bc I have come to the conclusion that there is no way I can beat the market",
        "created_utc": 1625543377,
        "id": "h4799a0",
        "score": 195,
        "subreddit": "stocks",
        "created": 1625572177.0
    },
    {
        "author": "Machiavelli127",
        "body": "My version of MAGA: MSFT, AMZN, GOOG, AAPL",
        "created_utc": 1625441999,
        "id": "h42qx94",
        "score": 183,
        "subreddit": "stocks",
        "created": 1625470799.0
    },
    {
        "author": "amg-rx7",
        "body": "Apple Amazon Microsoft Nvidia PayPal Square Costco Walmart plus a few good EFTs",
        "created_utc": 1625437049,
        "id": "h42i7nt",
        "score": 172,
        "subreddit": "stocks",
        "created": 1625465849.0
    },
    {
        "author": "Yo_IDK_Dude",
        "body": "Without putting any thought into this at all… Microsoft",
        "created_utc": 1625265002,
        "id": "h3uyved",
        "score": 145,
        "subreddit": "stocks",
        "created": 1625293802.0
    },
    {
        "author": "Isunova",
        "body": "$MSFT is a stock a hold forever.",
        "created_utc": 1625431503,
        "id": "h427m94",
        "score": 138,
        "subreddit": "stocks",
        "created": 1625460303.0
    },
    {
        "author": "BrandedStrategy",
        "body": "I am not disagreeing with you but I would like to ask when do we consider a stock ethical? Here are a few examples...\n\nNike, Mars, Kraft, Apple, Google, Microsoft and Tesla (just to name a few) have all been accused and used child labour to keep operating costs low and profits high.\n\nTesla was accused of instigating a coup in Bolvia for their lithium.\n\nThe US government + energy companies invade countries, mine the oceans and frack the country to keep oil prices low.\n\nBig Pharma (in the US) monopolize life-saving drugs i.e. insulin, inhalers preventing many people from being able to afford healthcare. \n\nMcdonalds + Big sugar investing in studies to convince people that their products are not bad for you. Obesity is a huge problem, heart disease is one of the biggest killers.",
        "created_utc": 1625485732,
        "id": "h44caz7",
        "score": 115,
        "subreddit": "stocks",
        "created": 1625514532.0
    },
    {
        "author": "AyyyyyyyLemao",
        "body": "Pentagon plans to divide the work between Amazon and Microsoft per Bloomberg",
        "created_utc": 1625592687,
        "id": "h49c8n1",
        "score": 105,
        "subreddit": "stocks",
        "created": 1625621487.0
    },
    {
        "author": "discovery999",
        "body": "VUG, VOO, AAPL, GOOGL, MA, IEP, MSFT, AMZN, FB",
        "created_utc": 1625432475,
        "id": "h429j4f",
        "score": 90,
        "subreddit": "stocks",
        "created": 1625461275.0
    },
    {
        "author": "Oraclequest",
        "body": "$MSFT is great investment, great dividend, better returns.\n\nIt's a long term bet for sure.",
        "created_utc": 1625432396,
        "id": "h429dmd",
        "score": 89,
        "subreddit": "stocks",
        "created": 1625461196.0
    },
    {
        "author": "gupbiee",
        "body": "Make it free is my general policy. But with stocks like AAPL and MSFT I'd just hold cuz at the moment they're kinda too big to fail (or tank for the immediate future)",
        "created_utc": 1625537450,
        "id": "h46z84g",
        "score": 87,
        "subreddit": "stocks",
        "created": 1625566250.0
    },
    {
        "author": "FlameoHotman-_-",
        "body": "This has to be an unpopular opinion...and for the record, I distrust the CCP as much as the next person, but these crackdowns may not be entirely bad. Let's look at some examples:\n\n\\- So in this case, Didi's operation got suspended because \"Didi had illegally collected users' personal data.\"\n\n\\- Alibaba got fined because of monopolistic practices.\n\n\\- Ant Group's IPO got slashed because the CCP wanted to regulate Ant Group like an actual bank.\n\nTo be honest, these sound pretty reasonable to me. Facebook was in trouble for collecting data without content too. Remember the whole Cambridge Analytica scandal? But now everyone is hot for FB stocks.\n\nMicrosoft has been fined millions by the EU for monopolistic practices as well. But everyone loves Microsoft stocks nonetheless. \n\nAnd as to Ant Group, they are a massive financial service company that can offer customers credit. How come they don't get to be regulated like a bank? My point is that these actions make sense and good regulations is beneficial for investors too in the long run.",
        "created_utc": 1625412759,
        "id": "h415r1e",
        "score": 76,
        "subreddit": "investing",
        "created": 1625441559.0
    },
    {
        "author": "FaatmanSlim",
        "body": "Been holding MSFT For a while now. While it goes through periods like last week, where the stock pops 1-2% a day, this stock is a bit more of a slow burn. If you look back at the past 4-5 years, it as beaten other FAANG stocks at how fast it has grown, but at times, its growth can seem downright glacial.\n\nThis is not a \"get rich quick\" stock, but I feel it's definitely a long-term growth stock if you look out a few years into the future.",
        "created_utc": 1625432788,
        "id": "h42a4ii",
        "score": 65,
        "subreddit": "stocks",
        "created": 1625461588.0
    },
    {
        "author": "quickclickz",
        "body": "That was public information in March and then in May...\n\nhttps://www.bloomberg.com/news/articles/2021-03-05/microsoft-s-10-billion-pentagon-deal-at-risk-amid-amazon-fight\n\nhttps://www.fool.com/investing/2021/05/10/pentagon-considers-dropping-microsoft-jedi-effort/\n\nshe made her purchase in May.... when the information was already public.",
        "created_utc": 1625597132,
        "id": "h49m3tb",
        "score": 64,
        "subreddit": "options",
        "created": 1625625932.0
    },
    {
        "author": "Jr4044",
        "body": "Surprised MSFT takes so much scrolling to find",
        "created_utc": 1625442974,
        "id": "h42sk27",
        "score": 63,
        "subreddit": "stocks",
        "created": 1625471774.0
    },
    {
        "author": "BGoode348",
        "body": "Msft for sure.",
        "created_utc": 1625274503,
        "id": "h3vgk3w",
        "score": 59,
        "subreddit": "stocks",
        "created": 1625303303.0
    },
    {
        "author": "one8e4",
        "body": "Lawyers will win. \n\nTime to see if the law firms Amazon and Microsoft use are listed",
        "created_utc": 1625591358,
        "id": "h4999pr",
        "score": 55,
        "subreddit": "stocks",
        "created": 1625620158.0
    },
    {
        "author": "Dav1d13",
        "body": "AAPL/MSFT/GOOGL/AMZN and go back to my daily life, knowing that I am in good shape!",
        "created_utc": 1625160913,
        "id": "h3pf3j1",
        "score": 51,
        "subreddit": "stocks",
        "created": 1625189713.0
    },
    {
        "author": "360NoScopeDropShot69",
        "body": "The legend of Joco the shrimp man, Bry drinks his piss if Spy closes green, Chinese dam puts, Microsoft 200, Tesla battery day \n\nThere's a ton",
        "created_utc": 1625441327,
        "id": "h42pseo",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1625470127.0
    },
    {
        "author": "BornAcanthocephala10",
        "body": "Microsoft",
        "created_utc": 1625279465,
        "id": "h3vp4dw",
        "score": 45,
        "subreddit": "stocks",
        "created": 1625308265.0
    },
    {
        "author": "warrior5715",
        "body": "Yes, msft is enron.... “Bingo”",
        "created_utc": 1625448901,
        "id": "h432072",
        "score": 39,
        "subreddit": "stocks",
        "created": 1625477701.0
    },
    {
        "author": "Spork_Warrior",
        "body": "Just because they are advertising for a job that leverages Microsoft doesn't mean that's the only platform they use.\n\nCompanies like Palantir tend to have agreements with all major cloud providers and they have expertise in multiple platforms.",
        "created_utc": 1625251198,
        "id": "h3u4e34",
        "score": 39,
        "subreddit": "stocks",
        "created": 1625279998.0
    },
    {
        "author": "Dgarciarieckhof23",
        "body": "MSFT no doubt",
        "created_utc": 1625280295,
        "id": "h3vqhn6",
        "score": 38,
        "subreddit": "stocks",
        "created": 1625309095.0
    },
    {
        "author": "KyivComrade",
        "body": "DAAMN has been treating me well so far. \n\n\n\nDisney, Apple, Amazon, Microsoft and Netflix.",
        "created_utc": 1625562586,
        "id": "h47wy88",
        "score": 38,
        "subreddit": "stocks",
        "created": 1625591386.0
    },
    {
        "author": "Podcastsandpot",
        "body": "Apple, Tesla, Nvidia, Amazon, Microsoft, Square",
        "created_utc": 1625436337,
        "id": "h42gwdm",
        "score": 37,
        "subreddit": "stocks",
        "created": 1625465137.0
    },
    {
        "author": "The0Walrus",
        "body": "NVDA, DIS, MSFT",
        "created_utc": 1625442442,
        "id": "h42robt",
        "score": 37,
        "subreddit": "stocks",
        "created": 1625471242.0
    },
    {
        "author": "JaegerBrick",
        "body": "She sits on relevant committees that affect choosing vendors for various government contracts. There is no law punishing insider trading for US government officials. She likely did nothing criminal under the current law. She also made a ton on $MSFT a few months ago. We can say her husband made the trades, but at the end of the day she is the one on the relevant budget committees and her name is on the trades.",
        "created_utc": 1625591570,
        "id": "h499qm8",
        "score": 37,
        "subreddit": "options",
        "created": 1625620370.0
    },
    {
        "author": "cen0812",
        "body": "AAPL, MSFT, and VOO.",
        "created_utc": 1625438093,
        "id": "h42k3xl",
        "score": 36,
        "subreddit": "stocks",
        "created": 1625466893.0
    },
    {
        "author": "Sik-Kunt",
        "body": "She bought before the split was announced and before the government cancelled the MSFT Jedi contract. As if she already knew. Because she did.",
        "created_utc": 1625599335,
        "id": "h49qz6s",
        "score": 34,
        "subreddit": "options",
        "created": 1625628135.0
    },
    {
        "author": "financiallyanal",
        "body": "Gates has argued tech companies deserve a lower multiple due to obsolescence risk. People price some of these things like they’ll all have the durability of Coca Cola and margins of Microsoft. Very few discuss the reality of businesses not lasting forever, but I agree it’s critical.",
        "created_utc": 1625512633,
        "id": "h45oply",
        "score": 33,
        "subreddit": "SecurityAnalysis",
        "created": 1625541433.0
    },
    {
        "author": "Burgerb",
        "body": "I have that dilemma: I bought things like TTD, SHOP, NVDA, MSFT and others.  Stocks have multiplied and I want to take gains and put them in an Index fund.  However, I'm worried about the Tax implications when I sell.  What should I do?",
        "created_utc": 1625171016,
        "id": "h3q2jdm",
        "score": 33,
        "subreddit": "investing",
        "created": 1625199816.0
    },
    {
        "author": "seattletechy",
        "body": "I am surprised it didn’t take off after the Xbox/Microsoft integration last week.  Just to give you a perspective it takes almost 2-3 years to convince a company of Microsoft’s size to agree for an integration such as this one.  They have 100s of millions users.  While Paysafe is starting with the Xbox team Microsoft’s payments stacks serves the entire company including  Azure, office, windows and Teams.  Now imagine the size of the customer base Paysafe has.",
        "created_utc": 1625361862,
        "id": "h3z8ngq",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1625390662.0
    },
    {
        "author": "baskinginthesunbear",
        "body": "Paysafe is fucking useless to deal with from a merchant standpoint. Incredibly poor processes and controls. Constant fuck-ups. Zero accountability. Honestly surprised a company as big as Microsoft wants to deal with them.",
        "created_utc": 1625408936,
        "id": "h40y7aa",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1625437736.0
    },
    {
        "author": "bagelwhore_x0",
        "body": "Killing it! I’m at like 20% profit all time and I’m ready to just stick with trading blue chip stocks and msft is my favorite. It’s the most predictable imo. I missed out on it tho this week chasing some other stocks and now I learned my lesson not to stray from my bestie Microsoft",
        "created_utc": 1625252893,
        "id": "h3u8ct0",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1625281693.0
    },
    {
        "author": "averagebensimmons",
        "body": "I see so many mentions of AMD and APPL and I'm like hey you know there is MSFT?",
        "created_utc": 1625444726,
        "id": "h42vgpk",
        "score": 28,
        "subreddit": "stocks",
        "created": 1625473526.0
    },
    {
        "author": "lilaznjocky",
        "body": "Anything that is well diversified tbh. MSFT Amazon. They have their hands in everything, and they can’t have everything fail. Just wait to get 100 shares and sell covered calls on the way up.",
        "created_utc": 1625431497,
        "id": "h427lun",
        "score": 27,
        "subreddit": "stocks",
        "created": 1625460297.0
    },
    {
        "author": "Captain_Yolo_",
        "body": "Told my parents I'm finally taking the position at Microsoft. I'm tired of not making a difference.\n\n\nAs third shift janitor I promise to make sure those urinals are licked clean and the floors polished to a mirror finish 👌",
        "created_utc": 1625272323,
        "id": "h3vcn3n",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1625301123.0
    },
    {
        "author": "MyParanoidEyes",
        "body": "MSFT, GOOGL, VISA, Amazon, the big guns",
        "created_utc": 1625424318,
        "id": "h41tdwk",
        "score": 26,
        "subreddit": "stocks",
        "created": 1625453118.0
    },
    {
        "author": "Rclarkttu07",
        "body": "Doing the same with $25 each week split into apple Amazon and Tesla. Also buy 1 msft a month and one VTI. Hoping to sell my AMC shares to spread out if it ever takes off again.",
        "created_utc": 1625603775,
        "id": "h4a14ty",
        "score": 23,
        "subreddit": "investing",
        "created": 1625632575.0
    },
    {
        "author": "coolcomfort123",
        "body": "msft is on fire, it just keep going up.",
        "created_utc": 1625233776,
        "id": "h3syq7d",
        "score": 22,
        "subreddit": "stocks",
        "created": 1625262576.0
    },
    {
        "author": "WolfPackWSB",
        "body": "Yup that was me in October 2020 buying GME @ $11 and averaged all the way down to $7.87 after Microsoft said they would give GME a % of every digital sale on the Xbox console!! Put every penny I could $13,700 then another $138/week after that.. Made my 2 year old daughter a Millionaire",
        "created_utc": 1625663518,
        "id": "h4cm300",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1625692318.0
    },
    {
        "author": "Pdicky69",
        "body": "$NET is on a fundamental basis is over valued. They expect rev to be $500M+ this year but they trade at $33B. It’s been on of my biggest picked winners. \n\nHere is a quick breakdown of what the popular services they offer, highly scaleable and a HUGE TAM.\n\nhttps://www.freelancer.com/articles/web-development/cloudflare\n\nHowever I sold off at $75, $85 levels due to price action getting ahead of the fundamental business. I’ve exited about 50% of my position. I still have 200 shares because I believe, it could do some long term stuff well and be a $100B company. But I can’t allocate so much of my portfolio in this company vs a FB/AMZN/GOOG (where I get growth, balance sheet safety, and moat)\n\nFrom here, if you want to get in on the action. You have to believe they do a few things…\n1) surprise HEAVILY on revenue growth and forward guidance\n2) grow more into their cyber security suite of tools beyond just basic stuff like their widely used DDOS prevention (a ton of websites use them for this) and firewall \n3) Content delivery network investment trend continues and profit margins aren’t competed away with bigger boys entering the game (ie GOOG, MSFT, AMZN)\n4) website speeds overwhelmingly determine ranking on google and mobile searches\n\nCloudflare and Fastly are the two more popular services for websites and apps to use as they offer ease of use to speed up website access for users and support to prevent website downtime. Folks have frequently complimented on how easy cloudflare is to use.",
        "created_utc": 1625514830,
        "id": "h45t0z8",
        "score": 22,
        "subreddit": "stocks",
        "created": 1625543630.0
    },
    {
        "author": "Shadow23z",
        "body": "Msft",
        "created_utc": 1625160818,
        "id": "h3peviw",
        "score": 21,
        "subreddit": "stocks",
        "created": 1625189618.0
    },
    {
        "author": "defenstrate5731",
        "body": "Investing in ETFs, specifically the S&amp;P ones you’re going to come out in top. That’s why actively trading/day trading/swing trading people hate on is because you typically won’t be the market. \n\nPersonally, I have about 30% in VOO and rest in individual stocks, but big names like MSFT, FB,DIS, JPM, etc.  \n\nIf you’re lazy and don’t really want to do the research, stick to ETFs like VOO, VTI, VTSAX, etc.",
        "created_utc": 1625249575,
        "id": "h3u0irf",
        "score": 20,
        "subreddit": "investing",
        "created": 1625278375.0
    },
    {
        "author": "teslas_love_pigeon",
        "body": "Don't disturb the retards with your facts please.\n\nNext think you're going to tell me is that Palantir doesn't have deals with Facebook, Google, Microsoft, and Amazon and they are just listing react, vscode, and aws in job ad.",
        "created_utc": 1625255630,
        "id": "h3uenb0",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1625284430.0
    },
    {
        "author": "RunningJay",
        "body": "Let's take MSFT at 20%. Let's say you put $5000 in and you're now at $6000.  I always like to keep the capital invested and take only profit so I'd sell 4x MSFT, or if I was more confident only 3x @ \\~$832.95.\n\nNow technically you're not taking profits exactly, you're just taking cash off the table.\n\nWith AAPL, same theory, if you invested $1000, you're currently at $1500, so sell $500 worth to return to your original capital investement.\n\n&amp;#x200B;\n\nWhatever you do with that $ better out-perform MSFT or AAPL, otherwise, just leave it there.",
        "created_utc": 1625536498,
        "id": "h46xj51",
        "score": 20,
        "subreddit": "stocks",
        "created": 1625565298.0
    },
    {
        "author": "doggy_lovers",
        "body": "Microsoft in the 1990s was the most valuable company in the world switching spots with GE, it is currently the only company that was in the top 10 list in 1990 and is currently still top 10 right now (at #2 spot behind apple). It was the #1 company by marketcap in 2019 and march 2020.\n\nMoreover, It has never fallen out of the top 10 list for more than 20+ years even with failure of Ballmer, tech bubble crash, Nokia, etc. Now with the new ceo, I dont see it going out of the top 10 especially since it is so far ahead from #10 spot which is Alibaba at 600 billion market cap. (Microsoft is worth 2.1 trillion).\n\nBack in the 1990s #1 spot had 200 billion valuation compared to 100 billion for #10 spot. So now the Top 5 companies are much more valuable compared to the bottom 5 of the list. Unlike the 1990s the top companies were not investing to the future and focus on short term profits.\n\nMicrosoft continues to invest in the future with the cloud technology, ai, vr/ar tech as well as is extremely diversified with equal 33% weight in 3 different classified segments.(the other trillion companies aren't as diversified). Finally, it is one of two companies (other being JNJ) with triple AAA credit rating, higher than the US government. It faces less regulatory risk than tech giants competitors allowing for easy acquisitions thanks to its stellar balance sheet.\n\nSource: https://en.wikipedia.org/wiki/List_of_public_corporations_by_market_capitalization#2012",
        "created_utc": 1625340104,
        "id": "h3y6e91",
        "score": 19,
        "subreddit": "stocks",
        "created": 1625368904.0
    },
    {
        "author": "FlyersTime",
        "body": "Amazon \nNvidia\nMicrosoft \nApple \n\nThat’s all you fucking need",
        "created_utc": 1625662084,
        "id": "h4cjmmm",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1625690884.0
    },
    {
        "author": "harrison_wintergreen",
        "body": "ELI5: \n\n- Burry believes (as he wrote): \"passive investing has removed price discovery from the equity markets\". https://www.bloomberg.com/news/articles/2019-09-04/michael-burry-explains-why-index-funds-are-like-subprime-cdos\n\n- price discovery is the process of estimating a reasonable fair value for a stock. \n\n- because relatively few people are buying/selling stocks based on their fair value, prices for stocks are often being determined mainly by cash-flows. see Tesla or dogecoin for examples. Tesla sells under 1% all vehicles worldwide but is somehow worth *more than all the other carmakers combined* because lots of people were buying Tesla stock and not because of any financial status of Tesla. dogecoin started LITERALLY as a joke but somehow was more valuable than companies like Ford Motors only because a ton of cash flowed into Dogecoin. this is all sheer insanity by traditional stock valuation guidelines. asset bubbles are nothing new, but Burry believes it's being exacerbated by passive investing. \n\n- Burry believes this situation of prices being based on cash flows is similar to what happened in the housing bubble, when multi-zillion Collateralized Debt Obligations (CDOs) were being priced not by a reasonable estimate of their fair value but by cash-flows. \n\n- when flows reverse and lots of people want out of index funds, it will get ugly because so many stocks are linked/benchmarked to major stock indexes *including lower volume stocks*. consider VTI: the top holdings (Apple, Microsoft, Johnson &amp; Johnson) might have a billion shares in total and hundreds of millions of dollars trading each day. but the smallest company stocks might have only a few million shares and a few million dollars trading each day. if too many people want to sell all at the same time, it will drive prices down sharply because these stocks are so often sold as a bundle/unit. as Burry puts it: \"The theater keeps getting more crowded, but the exit door is the same as it always was\"\n\n&gt;since the guy predicted 2007-2008 crash.\n\nhe also predicted the dot-com bubble.",
        "created_utc": 1625611801,
        "id": "h4ai1k1",
        "score": 19,
        "subreddit": "stocks",
        "created": 1625640601.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "seriously ppl.\n\njust buy big tech calls.\n\n if 2020 hasnt taught you this... or the bounce from Feb/March correction, or May pull back... not sure what will.\n\nyeah you can buy meme shit and pray that this week is when it decides to do meme shit vs pump &amp; dump by ppl\n\nor you can buy AAPL, MSFT, GOOGL, AMZN, FB, and NVDA calls and make actual fucking money and be able to sleep at night.\n\n* poor? do AAPL/MSFT/FB monthlies + leaps on dips.\n\n* got $ to blow? GOOGL and NVDA calls apparently doesnt know when to stop mooning\n\n* adventurous ppl can do AMZN monthlies and try to time AMZN's year-long channel of low 3000s to 3500s.",
        "created_utc": 1625257131,
        "id": "h3ui223",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1625285931.0
    },
    {
        "author": "StonksInvesteur",
        "body": "MSFT 300 calls, anyone?",
        "created_utc": 1625571987,
        "id": "h487i74",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1625600787.0
    },
    {
        "author": "gcko",
        "body": "Almost same. \n\nHolding AAPL, MSFT, DIS, VCR all the way to retirement unless something major happens to these companies. \n\nOh and at least a couple shares of GME I bought at $69 which I will eventually transfer into my children’s college fund. It’ll make a good story.",
        "created_utc": 1625441988,
        "id": "h42qwkq",
        "score": 18,
        "subreddit": "stocks",
        "created": 1625470788.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Like MSFT?",
        "created_utc": 1625422990,
        "id": "h41qp81",
        "score": 18,
        "subreddit": "stocks",
        "created": 1625451790.0
    },
    {
        "author": "hardtoexplainnnnn",
        "body": "MSFT was going up like this back in january-february. same with the other tech stocks. all tech stocks seem to be rising a lot again lately too. i think the tech bull run is back.",
        "created_utc": 1625432779,
        "id": "h42a3tw",
        "score": 17,
        "subreddit": "stocks",
        "created": 1625461579.0
    },
    {
        "author": "TheFilterJustLeaves",
        "body": "Probably fucked. MSFT doesn’t pump. It is the blob slowly eating everything in its path.",
        "created_utc": 1625345803,
        "id": "h3yh6y5",
        "score": 16,
        "subreddit": "options",
        "created": 1625374603.0
    },
    {
        "author": "NigelRL",
        "body": "I bought MSFT puts so it will go higher 🚀",
        "created_utc": 1625609358,
        "id": "h4ad1hv",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1625638158.0
    },
    {
        "author": "CountTheForDown",
        "body": "Tech has fooled me a couple of times over the past couple of weeks. The most recent indicator  of the mega tech is msft. There's about a 15 buck difference between one peak to the next. It just hit the next 15 on friday.\n\nFrom what I saw in mid fed, no matter how great an earnings was it was a blood bath. No reason to expect different now.",
        "created_utc": 1625451161,
        "id": "h435dnr",
        "score": 16,
        "subreddit": "options",
        "created": 1625479961.0
    },
    {
        "author": "justsomescrub",
        "body": "Not so much diversifying as just straight up killing it. Operating income rose 189% from 2019 to 2020 with eps up 604%. Q1 2021 operating income is up 266% and eps is up 232% from Q1 2020 and it isn't *just* higher margins; Total revenue in 2020 was up 45% from 2019 and Q1 2021 total rev Is up 92% compared to Q1 2020. Oh and the XLNX acquisition or whatever pending china approval.\n\n  \nAND there are some tasty insider whispers IF TRUE insinuating next gen GPU performance above and beyond what they expect from Nvidia. FULL STOP. Not at bargain price points, or for certain niche applications just straight up expecting to have the best GPUs on the market next gen. Nvidia having something spicy up their sleeve non-withstanding; you never know with Nvidia.   \n\n  Add in plans to buy back 4 billion worth of shares over the next 4(?) Years with cash on hand and plans for 3nm production by 2024 and everything I hear about AMD makes me think up up up. They have new deals with Samsung for their phones and google/amazon for servers, to add to the pile of deals like making chips for Sony and Microsoft consoles. The future looks bright.\n\nI put 90% of my account in AMD last month when they were hovering around 80$ without a single worry and I haven't unwound my position yet. Hoping for 2021 guidance to be adjusted from 50% to 75% growth to set this thing off again. Or merger approval, whatever comes first.",
        "created_utc": 1625268525,
        "id": "h3v5p9o",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1625297325.0
    },
    {
        "author": "Jdog43349",
        "body": "Yeah cause Android isnt just as big as Apple, right? And Google doesnt own YouTube, right? \n\nDont listen to this guy, buy Google AND Microsoft.",
        "created_utc": 1625342689,
        "id": "h3ybbv1",
        "score": 15,
        "subreddit": "stocks",
        "created": 1625371489.0
    },
    {
        "author": "Mesmeryze",
        "body": "microsoft just been solid as a rock through the hard times sincr 2 years ago my god",
        "created_utc": 1625242013,
        "id": "h3ti1bl",
        "score": 15,
        "subreddit": "stocks",
        "created": 1625270813.0
    },
    {
        "author": "Guy_Who_Made_Money",
        "body": "Amazon may split, Ford may do a reverse split, Microsoft may merge with Apple, Disney is going to sell off the Mickey Mouse Family IP to focus on Marvel, EA is merging with Take Two, Nokia may actually make money.          \nNow buy those rumors I made up.",
        "created_utc": 1625363069,
        "id": "h3zak3h",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1625391869.0
    },
    {
        "author": "half0tempo",
        "body": "My 5 shares of MSFT are so solid, I transitioned to a lazy portfolio VOO and VXUS. But kept my 5 MSFT shares I bought during the heat of the pandemic. Never will let go.",
        "created_utc": 1625252960,
        "id": "h3u8ibm",
        "score": 15,
        "subreddit": "stocks",
        "created": 1625281760.0
    },
    {
        "author": "brbcripwalking",
        "body": "Imagine being a boomer\n\nCasually fucking buy MSFT at $0.10, AMZN at $1.73, and buy AAPL at $0.80 on some Forrest Gump shit.\n\nPull yourself up by the bootstraps youngin what do you mean you can't afford a home?",
        "created_utc": 1625186528,
        "id": "h3qz1jm",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1625215328.0
    },
    {
        "author": "Boomtown626",
        "body": "I haven’t sold a share of MSFT or aapl. Not have a sold a share of my yolo plays. What I’m selling are my reopening plays, my clean energy plays that don’t appear to be keeping up with the sector, and my long shot penny stocks. \n\nThe kicker: I’m only selling when I find something better - either a new position or building weight in the positions I’m most confident in.",
        "created_utc": 1625535521,
        "id": "h46vrg2",
        "score": 14,
        "subreddit": "stocks",
        "created": 1625564321.0
    },
    {
        "author": "creemeeseason",
        "body": "I've owned Microsoft since 2018. If I had a 20% stop loss it would have triggered in March of 2020, among other times (at $160 or so). Instead, I just held and it always came back up and is at $277 today. \n\nJust hold, especially with solid companies.",
        "created_utc": 1625332382,
        "id": "h3xrn7l",
        "score": 14,
        "subreddit": "stocks",
        "created": 1625361182.0
    },
    {
        "author": "Icommandyou",
        "body": "SPY and MSFT doing great. Memes down.\n\nNature is healing itself.",
        "created_utc": 1625256108,
        "id": "h3ufr4u",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1625284908.0
    },
    {
        "author": "FalconsBlewA283Lead",
        "body": "MSFT is such a machine",
        "created_utc": 1625254708,
        "id": "h3uci55",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625283508.0
    },
    {
        "author": "apooroldinvestor",
        "body": "20% of my portfolio is MSFT AAPL.  Am I ok?",
        "created_utc": 1625548835,
        "id": "h47h2yz",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625577635.0
    },
    {
        "author": "zxc123zxc123",
        "body": "Hi. I'm from the Intel side! I think AMD side shouldn't worry too much about INTC. It's a big old ship that's getting bombarded from all sides. The fact that it's a big ship means it's changes will take time. I'm giving Gelsinger a chance to right the ship, but it will take a long while to undo BSwan's bad moves, get the right people, develop the chips, and catch up to AMD. \n\nA plus side for everyone is that the semi-space is a growing area with electronification, digitization, and \"5G-cloudification\" of everything along with the increasing importance of AI &amp; tech in business and government. Semis are so important in fact, that at this point US Gov should really be looking at INTC/NVD/TI more like they did Ford/GM 100 years ago: as a strategic industrial/military resource. \n\nReal threat to AMD isn't INTC. INTC was the big market share holder in the past and isn't likely gaining any ground any time soon. What AMD and all the trad chip manufacturers should fear is FAAAM &amp; BAT. Apple has started designing it's own chips. They aren't going back to using outsourced chips. If history says anything it's that Apple will continue to cut others out as they continue to in-house their chips for their entire lineup while improving their chips just like how they kept improving their computers, just like how the iphone kept improving until NOK/MOT were beat, just like how a good chunk of the watch market is Apple watches, just like how Ipads have taken away from of the laptop space, just like how Apple TV keeps chipping away at cable, just like how the app store and Apple's eco system keeps growing, etcetcetc. There is nothing AMD/NVD/INTC can do to stop Apple. And Apple is just the first. MSFT also doing the same. Google, Facebook, and Amazon might follow suit. China's Tencent and Alibaba will likely copy what the US companies do as soon as Pooh Bear gets done man handling them.",
        "created_utc": 1625258081,
        "id": "h3uk775",
        "score": 13,
        "subreddit": "investing",
        "created": 1625286881.0
    },
    {
        "author": "ACELUCKY23",
        "body": "$MSFT, $AAPL AND $NVDA. I like $AMD, but I don’t plan to hold that as “forever” at the moment. \n\nPlease avoid meme stocks if possible, those are not meant to be long term investments.",
        "created_utc": 1625442592,
        "id": "h42rx5g",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625471392.0
    },
    {
        "author": "Sweaty-Bumblebee4055",
        "body": "All in on that AMD run before it turns into NVDA and gonna throw it all in on MSFT",
        "created_utc": 1625538228,
        "id": "h470kgk",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1625567028.0
    },
    {
        "author": "iceberg_crumble",
        "body": "Hey man hopefully you’re using other DD than this job post. I work in the SI and SaaS space - super common to have an alliance manager that runs the cloud relationship, especially given they both (MSFT and PLTR) have big gov contracts. \n\nI doubt the role is new - prob turnover or titling change.  Just google this title and you’ll see all major SaaS companies have this role or something similar if it can be integrated/sold with O365.",
        "created_utc": 1625574665,
        "id": "h48bc8w",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1625603465.0
    },
    {
        "author": "Perdix_Icarus",
        "body": "AMZN, MSFT and GOOGL are at ATH and looks like AAPL would also join them there soon.",
        "created_utc": 1625581920,
        "id": "h48om67",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625610720.0
    },
    {
        "author": "manofculture003",
        "body": "If you invested $1000 in Microsoft back in Dec 1999, in Oct 2016 you would have had $1000",
        "created_utc": 1625590254,
        "id": "h496s19",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1625619054.0
    },
    {
        "author": "heatd",
        "body": "MSFT and AAPL are 11% of SPY and 20% of QQQ",
        "created_utc": 1625549600,
        "id": "h47i36q",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625578400.0
    },
    {
        "author": "maz-o",
        "body": "Nope this is called timing the market and you know how the saying goes. \n\nI’m never selling my MSFT.",
        "created_utc": 1625156419,
        "id": "h3p4fun",
        "score": 12,
        "subreddit": "stocks",
        "created": 1625185219.0
    },
    {
        "author": "left_turn_signal",
        "body": "\"The bulk of the Pelosis' money comes from investments in stocks and real estate. Operating through Financial Leasing Services, his San Francisco investment firm, Paul Pelosi owns stock in companies including Microsoft, AT&amp;T, Cisco Systems, Disney, Johnson &amp; Johnson and a variety of tech stocks.\nReal estate investments include a four-story office building at 45 Belden St. in the Financial District, office buildings on Battery and Sansome streets near the Embarcadero, a building housing a Walgreens drugstore near Ocean Beach and other commercial property in San Anselmo.\nOther investments include a St. Helena vineyard worth between $5 million and $25 million, a $1 million-plus townhome in Norden (Nevada County), and minority interests in the Auberge du Soleil resort hotel in Rutherford, the CordeValle Golf Club in San Martin, and the Piatti Italian restaurant chain.\"\n\nLook at the date of that article 2007. \n\n(https://www.sfgate.com/politics/article/Pelosi-s-husband-prefers-a-low-profile-2660253.php)",
        "created_utc": 1625593216,
        "id": "h49df75",
        "score": 12,
        "subreddit": "options",
        "created": 1625622016.0
    },
    {
        "author": "6151rellim",
        "body": "That is scary to think. If I had a large sum to invest tomorrow I’d be right on the fence between Microsoft or Amazon.",
        "created_utc": 1625297154,
        "id": "h3wd7xz",
        "score": 12,
        "subreddit": "stocks",
        "created": 1625325954.0
    },
    {
        "author": "Marquis77",
        "body": "Nope. VMware does well with on prem virtualization but they are leagues behind AMZN/MSFT in terms of cloud capabilities.",
        "created_utc": 1625593358,
        "id": "h49dqjq",
        "score": 12,
        "subreddit": "stocks",
        "created": 1625622158.0
    },
    {
        "author": "_igg",
        "body": "Been in a coma for a year, did MSFT hit 200 yet?",
        "created_utc": 1625191614,
        "id": "h3r8q2u",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1625220414.0
    },
    {
        "author": "GoldDecision7",
        "body": "Good job MSFT, AMD, and AAPL. I might actually financially recover from joining this place.",
        "created_utc": 1625247693,
        "id": "h3tw1c9",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1625276493.0
    },
    {
        "author": "Shacrone",
        "body": "sir I don't know why you think pltr can be compared to msft",
        "created_utc": 1625334683,
        "id": "h3xw3yo",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625363483.0
    },
    {
        "author": "klumpbin",
        "body": "Yes. Amazon, Microsoft and google are all on the verge of bankruptcy, so you’ve essentially missed the boat /s",
        "created_utc": 1625548742,
        "id": "h47gyhr",
        "score": 11,
        "subreddit": "StockMarket",
        "created": 1625577542.0
    },
    {
        "author": "1foxyboi",
        "body": "SPY pays one, so does QQQ. \n\nAAPL MSFT too\n\nI would say not having a single dividend in a portfolio is the strategy outside the norm",
        "created_utc": 1625440295,
        "id": "h42nztf",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625469095.0
    },
    {
        "author": "DoesntUnderstandJoke",
        "body": "I’m amazing at selling covered calls. Msft 265c for $1.16. Now At $13. \n\nNice negative 10 bagger 📈😣🔫",
        "created_utc": 1625253307,
        "id": "h3u9apz",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1625282107.0
    },
    {
        "author": "throwitup1124",
        "body": "Go look at the top ten companies 10, 20, 30 years ago and see where they’re at today. In order to outperform the index, you’re suggesting that these companies will continue to outperform over the long term. MSFT, AAPL, FB, GOOGL, V market caps are already at mega levels and it’s a big assumption that they will continue to get bigger. While I do think they will continue to grow in the short/mid-term, I’d be cautious on just owning the top ten.",
        "created_utc": 1625173751,
        "id": "h3q8ts1",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625202551.0
    },
    {
        "author": "schittluck",
        "body": "MSFT all the way",
        "created_utc": 1625268165,
        "id": "h3v50zu",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625296965.0
    },
    {
        "author": "ShortPutAndPMCC",
        "body": "But have you seen the returns of just “blindly” investing in solid stocks like Microsoft, Google, Amazon, NVDA, AMD, SEA, TSMC, etc? They beat my returns easily and I’ve been following their price for 13 months. Makes me wonder why I followed them so long and didn’t buy, but learnt options for only 5 months and decided to go into it just because I thought I could make it work.",
        "created_utc": 1625563738,
        "id": "h47y4eh",
        "score": 11,
        "subreddit": "options",
        "created": 1625592538.0
    },
    {
        "author": "BobandSteve",
        "body": "I'm just gonna say, if fucking covid couldn't cause the crash of all crashes idk if its just gonna spontaneously happen.\n\nWhy would there be a correction to tech? What would make Apple or Microsoft lose 20% of market cap when they bring in a shit ton of cash. It can happen but I dont really buy inflation as the reason",
        "created_utc": 1625435036,
        "id": "h42eheb",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625463836.0
    },
    {
        "author": "uselessadjective",
        "body": "Sorry dont agree, PE ratio of AMD is still 20  It used to be 70-80 till last year.\nCompartively nVidia's PE ratio is 80. AMZN and GOOGLE also in 50s.\n\nOut of all Tech stocks only AMD is undervalued right now. \n\nHave been holding all below stocks from last 4 years\n\nMSFT\nFB\nAMD\nNVIDIA\nTWTR\nAMZN\n\nAMD is gonna fly very soon.",
        "created_utc": 1625346445,
        "id": "h3yidwv",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625375245.0
    },
    {
        "author": "ACELUCKY23",
        "body": "I feel like $MSFT is a stock everyone should have some money invested in at the moment. It’s been very impressive as of late and I don’t see things changing for some time.",
        "created_utc": 1625243749,
        "id": "h3tmk4g",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625272549.0
    },
    {
        "author": "TotheMoongirl21",
        "body": "I bought the shares when Microsoft was $231 and still holding. This is my long term not selling stock.",
        "created_utc": 1625258646,
        "id": "h3ulgpa",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625287446.0
    },
    {
        "author": "Qarantyl",
        "body": "Why is apple super expensive and msft only fair value, MSFT is trading at higher multiples than AAPL right now. I would say msft's 45x free cash flow is actually very overvalued. Its a great company but everyone seems to have such a hard on for it right now around here.",
        "created_utc": 1625638261,
        "id": "h4bs4lx",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625667061.0
    },
    {
        "author": "ImmySnommis",
        "body": "About half is wrapped up in MSFT, GOOG, AAPL and COST. Another quarter or so is in DE, PSTH and TSM. The test is a smattering of speculative stuff that's kinda just for fun - stuff like SPCE, NIO, MYRG, and some SPACs.",
        "created_utc": 1625422968,
        "id": "h41qnnw",
        "score": 10,
        "subreddit": "investing",
        "created": 1625451768.0
    },
    {
        "author": "Sheeple81",
        "body": "Does this mean Microsoft is a meme stock?",
        "created_utc": 1625251595,
        "id": "h3u5c5o",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625280395.0
    },
    {
        "author": "CokeRapThisGlamorous",
        "body": "This thread is likely due to the JEDI contract news that broke today, announcing that MSFT will not be the Pentagon's sole cloud provider. AMZN and MSFT have risen/dropped as a result. I imagine Pelosi's position would make her privy to this news in advance of the general public. Could be a reach that this is the reasoning for the move though.",
        "created_utc": 1625600624,
        "id": "h49tuct",
        "score": 10,
        "subreddit": "options",
        "created": 1625629424.0
    },
    {
        "author": "Sweaty-Bumblebee4055",
        "body": "AMD MSFT WISH let’s GO",
        "created_utc": 1625576659,
        "id": "h48el9w",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625605459.0
    },
    {
        "author": "Overall-Jaguar-445",
        "body": "ARKK-10.96%\n\nNVDA-35.68%\n\nQQQ-31.08%\n\nMSFT-22.28%",
        "created_utc": 1625598462,
        "id": "h49p0xw",
        "score": 9,
        "subreddit": "stocks",
        "created": 1625627262.0
    },
    {
        "author": "YourInnate",
        "body": "It's a matter of perspective and big picture stuff. If you bough a SPY leap the day before the market crashed last year from covid, and bought 100 shares the day before the crash in covid, the LEAP would be worth more today.\n\n2-5% a month seems super low, but options are a grind. When in doubt, zoom out. 2-5% a month is 25-60% a year. Consider the indexes historically return 10%, doubling that on your bad years and quintupling it on your good years seems like a good trade.\n\nAnother note, this past year has been a historic bull run/recovery for most of the stock market. You can't compare throwing money into microsoft or google and watching it appreciate vs selling options on the same underlying. Likewise, if you had been selling RIOT/MARA puts the first 4 months of the year, you could've been making 10% a week. \n\nEverything in the market is perspective. If you think 2-5% a month is too slow/boring... You might consider roulette.",
        "created_utc": 1625587456,
        "id": "h490gmj",
        "score": 9,
        "subreddit": "options",
        "created": 1625616256.0
    },
    {
        "author": "BigBrianBrand",
        "body": "Alibaba is the best Buy and Hold example that fits your question. \n\nIt has perceived government regulation risk. Similar to what Facebook has been through these last 3 years. As long as the financials continue to grow, the stock will eventually skyrocket. \n\nEtsy, VRTX, nVidia, Apple, Facebook, Amazon, Google, Tesla, and Microsoft are also moderate risk picks in terms of their current price",
        "created_utc": 1625176385,
        "id": "h3qeph1",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625205185.0
    }
]