[
    {
        "author": "amg-rx7",
        "body": "Apple Amazon Microsoft Nvidia PayPal Square Costco Walmart plus a few good EFTs",
        "created_utc": 1625437049,
        "id": "h42i7nt",
        "score": 172,
        "subreddit": "stocks",
        "created": 1625465849.0
    },
    {
        "author": "El_Duderino_Mepper",
        "body": "GOOG and PYPL",
        "created_utc": 1625431806,
        "id": "h4287o6",
        "score": 53,
        "subreddit": "stocks",
        "created": 1625460606.0
    },
    {
        "author": "thomasdraken",
        "body": "lmfao you can't even pay with paypal and they'd accept bitcoin ?\n\nwhy are they all trying to push bitcoin through these bs articles, as if it was suddenly going to become the universal currency ?",
        "created_utc": 1627270302,
        "id": "h6jq8qc",
        "score": 50,
        "subreddit": "CanadianInvestor",
        "created": 1627299102.0
    },
    {
        "author": "BagFullOfKittenBones",
        "body": "That’s why the term ‘unregulated bank’ is used to describe Starbucks. They can truly do what they want with that money, as it’s logged in as gift card sales. But the amount that people deposit into their Starbucks accounts and the ease you can link your Starbucks app to your chequing/PayPal/credit card put it at the same scale as many major banks, without the regulations that banks are beholden to.",
        "created_utc": 1626643591,
        "id": "h5ofq8s",
        "score": 42,
        "subreddit": "stocks",
        "created": 1626672391.0
    },
    {
        "author": "WhiteHoney88",
        "body": "Pypl is such a beast. I hope this week or next it pushes over $300!",
        "created_utc": 1625459581,
        "id": "h43huk4",
        "score": 32,
        "subreddit": "stocks",
        "created": 1625488381.0
    },
    {
        "author": "profanitycounter",
        "body": "UH OH! Someone has been using stinky language and u/Scrumpb3 decided to check u/This_is_a_Crab's bad word usage.\n\nI have gone back one thousand posts and comments and reviewed their potty language usage.\n\n|Bad Word|Quantity|\n:--|:-:|\n|anal|3\n|ass|7\n|bastard|1\n|bitch|6\n|bullshit|3\n|cock|1\n|cum|2\n|damn|12\n|fucking|5\n|fuck|8\n|hell|4\n|porn|4\n|re**rd|7\n|re**rded|4\n|shitty|1\n|shit|13\n|tard|1\n\n^(Request time: 13.1. I am a bot that performs automatic profanity reports.) ^(This is profanitycounter version 3, view update notes) ^[here.](https://www.reddit.com/r/profanitycounter/comments/i6pql7/introducing_profanitycounter_version_3/) ^(Please consider supporting my development) ^([through my creator's PayPal.](https://www.paypal.me/aidanginise1))",
        "created_utc": 1627410236,
        "id": "h6qhm1c",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1627439036.0
    },
    {
        "author": "RGR111",
        "body": "AAPL &amp; PYPL✅",
        "created_utc": 1627101201,
        "id": "h6bzphz",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1627130001.0
    },
    {
        "author": "iratherpeeoutside",
        "body": "not retiring anytime soon so i would keep buying stocks that i thought were going to be around for awhile. NVDA,AAPL,PYPL,SQ,JPM,DAL,PG etc.. boring i know but any chance i can buy those companies at a discount, i will.",
        "created_utc": 1626551254,
        "id": "h5jrsp6",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1626580054.0
    },
    {
        "author": "cobra1927",
        "body": "I also got into paypal when it was recommended on their podcast probably 2 or 3 years ago now. It has been a good ride",
        "created_utc": 1625369481,
        "id": "h3zkq4v",
        "score": 16,
        "subreddit": "stocks",
        "created": 1625398281.0
    },
    {
        "author": "dontbedumbbro",
        "body": "What about the PayPal situation how does sellers feel about that",
        "created_utc": 1627305969,
        "id": "h6l1fgl",
        "score": 16,
        "subreddit": "stocks",
        "created": 1627334769.0
    },
    {
        "author": "celluloideyez",
        "body": "Yeah. Add some fin tech company (even something like SQ or PYPL)",
        "created_utc": 1627160421,
        "id": "h6el4ah",
        "score": 14,
        "subreddit": "stocks",
        "created": 1627189221.0
    },
    {
        "author": "EricTheAce",
        "body": "People seem to have short term memories, I remember when ARK was the talk of this sub last year because their funds were doing so well. And yes, they're taken a beating this year but I feel like they'll have a solid 2H of the year.\n\nI invest in ARKK and some of the stocks in ARK funds such as Roku, sq, crwd, pd, coin, dkng, net, nvda, pltr, tsla, twtr, se, splk, regn, snap, and pypl, I bought most of them last year and some early this year, and overall I'm doing pretty well with them. Over 100%+ gains for the likes of Roku, net, and crwd. And obviously I have low performing ones like coin, tsla, and splk. I did my own DD and  I'm happy with the results. These stocks are def more volatile but I can handle it.",
        "created_utc": 1627010537,
        "id": "h67hpcn",
        "score": 13,
        "subreddit": "stocks",
        "created": 1627039337.0
    },
    {
        "author": "sknt1983",
        "body": "Wise is much, much cheaper than Paypal and has way better conversion rates.",
        "created_utc": 1625661028,
        "id": "h4chxsp",
        "score": 12,
        "subreddit": "stocks",
        "created": 1625689828.0
    },
    {
        "author": "dusterhi",
        "body": "I have a very unpopular opinion on this but I think both are bad investments currently. They are pretty overvalued based on extremely high profit margins that they won’t be able to keep up forever. They’re prehistoric beasts trying to hop on current growth trends through acquisitions (which then get lost inside their corporate jungle) - companies like PayPal, wechat/alipay, BNPL will eat their lunch. \n\nThe foundation for their current success was laid decades ago - they have not innovated since then and are not currently laying the foundations for future success",
        "created_utc": 1625449760,
        "id": "h433a8a",
        "score": 12,
        "subreddit": "stocks",
        "created": 1625478560.0
    },
    {
        "author": "juaggo_",
        "body": "Actually PayPal also has a credit card processing in the form of Zettle. They announced a couple of weeks ago that they are expanding to the US markets. They are targeting small businesses too and their pricing is more affordable than Square’s.\n\nPayPal/Zettle: 2.29% + 0.09 cents\n\nSquare: 2.6% + 0.10 cents",
        "created_utc": 1626341969,
        "id": "h599m61",
        "score": 12,
        "subreddit": "stocks",
        "created": 1626370769.0
    },
    {
        "author": "LuxGang",
        "body": "SOFI.\n\nThey're growing faster than other Fintechs and Pipe investors selling off is creating a nice buy opportunity. Many people view this one as the next SQ or PYPL",
        "created_utc": 1625237161,
        "id": "h3t6b3l",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625265961.0
    },
    {
        "author": "drunkendrake",
        "body": "This argument is bullshit. PayPal is not a currency, it's a payments aggregator which technically Amazon also is with Amazon pay. So you are asking they let a direct competitor be used on their website.",
        "created_utc": 1627280017,
        "id": "h6k4gaz",
        "score": 10,
        "subreddit": "CanadianInvestor",
        "created": 1627308817.0
    },
    {
        "author": "Cool_Use_575",
        "body": "Hands down SoFi ; it is the next PayPal 🚀🚀💎💎🙌🙌",
        "created_utc": 1625879705,
        "id": "h4nl4j9",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1625908505.0
    },
    {
        "author": "chrism-6",
        "body": "Didn’t feel like putting my full due dilligence in but this pretty much sums it up well enough from another PSFE post. The main tidbit not touched on entirely here is the dominance they have in the iGaming market. This industry is expected to grow to upwards of 40 billion in the next few years and PSFE is positioned very well to take advantage. Of course the iGaming market has some regulatory hoops to jump through but we’re seeing trends throughout at least the US that state regulators are warming up to the idea of allowing easy access to sports gambling with restrictions being eased in multiple states in the past year\n\nJust added to Russell 3000 and 1000. Found bottom support and getting ready to build upward momentum imo.\n\nThis is what I like about it: Paysafe is the #1 global leader in iGaming payment processing. “At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”\n\nPartnered with Coinbase, Roblox, Draftkings, Spotify, Fortnight, Amazon, Twitch, Microsoft/Xbox, bet365, ApplePay, Youtube, Visa, Betfair, PayLease, ESL Gaming, Luckbox, Amelco, and Pointsbet among many others.\n\nVoted “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method”\n\nPaysafe has the #2 digital wallet globally with a presence in 120 countries. They own Skrill, which is enabled for crypto-to-crypto trading (Bitcoin &amp; 26 other crypto-currencies) and was voted “Best Digital Wallet” for “best consumer take up”, “most innovative technology” with “greatest potential to disrupt current ecosystems.”\n\nIn Europe, where Paysafe is more known, Trustpilot rates Paysafe as “Excellent” (4.7/5 stars) with over 29,000 reviews, and Skrill as “great” (4.2/5 stars) with over 17,000 reviews, while PayPal is rated \"bad\" (1.2/5 stars) with over 17,000 reviews. They are currently laying the groundwork for their US expansion.\n\nUnlike any other payment processor, Paysafecard enables those without bank accounts or credit cards (the over 1.7 billion “unbanked”) to engage in online commerce in over 50 countries. This segment grew 63% YoY.\n\nPaysafe’s industry leading multi-jurisdictional regulatory expertise offers a durable advantage in spaces where competing fintechs are slow to enter. CEO Philip McHugh: “When we talk about a deep and a wide moat, this is absolutely one of the areas that we see that benefit where it’s hard to copy.…We have over 300 professionals dedicated to risk, compliance, and analytics. That is very, very rare in the payments space. It’s a real strength of ours. We’ve been able to track some of the top people in the industry, including the former CRO from PayPal, and we’ve upgraded the team, we’ve built some real data capabilities, and we see this continuing to be an area of differentiation for Paysafe versus others.”\n\nIn Q1 Paysafe had $90 million in one-time expenses associated with merger and paying down $1.2 billion in debt. This means without those expenses they would have beat analysts estimates and, going forward, they are well positioned to beat analysts EPS estimates for the rest of the year.\n\nRecent debt management, saving around $92 million annually, secures higher margins and higher profits which will lead to raised price targets and positive price action catalysts.\n\nPaysafe confirmed they are on track to meet 2021 growth projection which doesn’t include planned inorganic M&amp;A growth pipeline and iGaming expansion (55% CAGR).\n\nFrom 2017 to 2019, under Blackstone/CVC stewardship, Paysafe grew revenue 65% from $864 million to $1.418 billion. (28% CAGR) 2020 saw revenue stagnate due to Covid-related business closures and high-risk channel exits but, even so, if you add 2020’s performance, 2017-2020 still amounts to a respectable 18% CAGR, roughly the same as PayPal’s current projected growth.\n\nBuy rating from all seven analysts covering Paysafe, with 50-70% upside from current price but, with everything noted above, it’s clear that Paysafe would still be significantly undervalued when compared to a basket of comps (PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, bill, GPN, and Paysign) with a collective growth rate of ~12.5% (in Paysafe’s 10-13% range):\n\n\nPaysafe's price based on sector peer multiples:\n\nEV/EBITDA ratio :$50.75\n\nEV/Rev ratio : $44.64\n\nEV/FCF ratio : $44.18\n\nAverage :$46.52\n\n\nValuation Notes:\n\nRemoved all high outliers in each category putting PSFE at $100+ Unlike Paysafe's reported $362 million in free cash flow (on track to increase 29%) and 30%+ EBITDA margin, half of peers report negative EBITDA growth and a third report negative EBITDA and negative free cash flow. Paysafe has better EPS than over half of the peer group Paysafe has better Debt/EBITDA ratio than 3/4 of them \n\nChairman of Fidelity and now Chairman of Paysafe, Bill Foley, has a proven track record in generating value for his investors through rapid synergistic inorganic growth. This is a key strategic pillar for Paysafe. Over the last five years Foley has grown Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B). He also grew FIS from $2.5 billion to over $91 billion (36.4X). He says, “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.”",
        "created_utc": 1625672828,
        "id": "h4d5o0v",
        "score": 9,
        "subreddit": "stocks",
        "created": 1625701628.0
    },
    {
        "author": "ChestyMenace",
        "body": "I'd advise against this one. The big brick and mortar stores are moving away from them and the small ones tend to use options like Square or PayPal, etc. Every seen the self-checkouts at Home Depot? Not NCR. The newest Target stores that just opened up... not NCR.",
        "created_utc": 1626574237,
        "id": "h5kzuzj",
        "score": 9,
        "subreddit": "investing",
        "created": 1626603037.0
    },
    {
        "author": "S7EFEN",
        "body": "wasnt just paypal, he bought into fb after paypal. so two huge wins",
        "created_utc": 1625300834,
        "id": "h3wh4l8",
        "score": 9,
        "subreddit": "investing",
        "created": 1625329634.0
    },
    {
        "author": "TheSyhr",
        "body": "Long term portfolio looking for (mostly) stable growth with some dividends:\n\nVUSA - 25%\n\nAAPL - 6%\n\nDIS - 5%\n\nO - 5%\n\nKO - 5%\n\nNVDA - 5%\n\nNFLX - 5%\n\nTSLA - 4%\n\nJ&amp;J - 4%\n\nGSK - 4%\n\nSBUX - 4%\n\nSTAG - 4%\n\nPYPL - 4%\n\nAMD - 4%\n\nBMO - 4%\n\nMMM - 4%\n\nIITU - 4%\n\nINRG - 4%",
        "created_utc": 1626503088,
        "id": "h5hnfx0",
        "score": 9,
        "subreddit": "stocks",
        "created": 1626531888.0
    },
    {
        "author": "kortokrizzle",
        "body": "My hips gonna need to get replaced before this PayPal refund shows up in my bank account",
        "created_utc": 1626561487,
        "id": "h5kbklh",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1626590287.0
    },
    {
        "author": "VillageBuilder",
        "body": "Okay so, I want to preface that I'm not educated on this sector even a little bit. But I am trying.\n\nI've seen SOFI love all over Reddit lately and I'm interested. I used them for student loan refinancing years back and downloaded the app to see what they offer, which I liked!\n\nBut as someone trying to get into this sector, why is this more appealing than Paypal? I get that SoFi is more of a one stop shop currently, but Venmo is growing so fast, and with the addition of crypto purchase, I can foresee investing as well. They're making it so not only is all of your day to day exchanges with others happens with them, but there are several ways to keep your money with them thru investing. They've got a credit and debit card as well. They're likely not getting into the loan game though.\n\nAgain, I'm interested, I just want to know why this SoFi is looking to be so disruptive vs some competition?",
        "created_utc": 1625624453,
        "id": "h4b637t",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625653253.0
    },
    {
        "author": "Sixers0321",
        "body": "Square has more growth potential,  Paypal is safer.",
        "created_utc": 1626341796,
        "id": "h599f4x",
        "score": 8,
        "subreddit": "stocks",
        "created": 1626370596.0
    },
    {
        "author": "boukmw",
        "body": "For example, apple is looking into introducing a glucose monitor on their watches (and integrating it with their \"Health\" App). In the US alone, there are 34.2 million americans with diabetes (and most of them should resort to a glucose monitor to keep their disease under control). \n\nDo you think Apple needs AMD or NVDIA for their chips? In the past, that would have been a clear yes, but now? No, they don't.\n\nDo you think Apple needs SQ or Paypal to offer a wallet on an iPhone? \n\nApple is looking at leveraging their product and operating system and enter new markets. This is very powerful.",
        "created_utc": 1626362592,
        "id": "h5a96vu",
        "score": 8,
        "subreddit": "stocks",
        "created": 1626391392.0
    },
    {
        "author": "keepcrazy",
        "body": "Indeed. Just looked that up. He actually kinda wiggled into it - not unlike what he did at PayPal…",
        "created_utc": 1626500273,
        "id": "h5hjq76",
        "score": 8,
        "subreddit": "stocks",
        "created": 1626529073.0
    },
    {
        "author": "bromophobic272",
        "body": "Account opened up 70% thanks to ETSY &amp; PYPL calls. Think I’m gonna go ahead and call it a day.",
        "created_utc": 1626961960,
        "id": "h64ko6y",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1626990760.0
    },
    {
        "author": "tallpaulpaultall",
        "body": "If PYPL hits 302 today I'll never gamble again. Today.",
        "created_utc": 1626435048,
        "id": "h5dwb3q",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1626463848.0
    },
    {
        "author": "Gyata97",
        "body": "So many bag holders trying to pump memes. Bro, Sis, Non-bro or Non-sis, just get into AAPL or NVDA or AMZN or PYPL or any stock that is actually in fly mode.",
        "created_utc": 1625581472,
        "id": "h48npag",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1625610272.0
    },
    {
        "author": "GADHP",
        "body": "Just PayPal me your money",
        "created_utc": 1627397991,
        "id": "h6ppgfx",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1627426791.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I'm not looking for 4 or 5x.  2x is fine in 5 years. Even 1.5x.  I dont have just AAPL.  I have UNH HD SHW NVDA ASML LRCX GOOGL AMZN MSFT pypl total market. Healthcare equipment and healthcare mutual funds.  Vanguard value etf.",
        "created_utc": 1627256671,
        "id": "h6j1e72",
        "score": 7,
        "subreddit": "stocks",
        "created": 1627285471.0
    },
    {
        "author": "Big-Illustrator-5096",
        "body": "Founded in July 2003 by Martin Eberhard and Marc Tarpenning as Tesla Motors, the company's name is a tribute to inventor and electrical engineer Nikola Tesla. Elon Musk, who contributed most of the funding in the early days, has served as CEO since 2008.  : https://en.m.wikipedia.org/wiki/Tesla,_Inc \n\nPaypal was a team effort you can learn more about the team here: https://en.m.wikipedia.org/wiki/PayPal_Mafia\n\nNot saying Musk isn't a genius or that he doesn't work insanly hard but he's not a Nikola Tesla... more of an Eddison",
        "created_utc": 1626512761,
        "id": "h5hyi9s",
        "score": 7,
        "subreddit": "stocks",
        "created": 1626541561.0
    },
    {
        "author": "FalconsBlewA283Lead",
        "body": "Tempted to add to GOOG and PYPL but such a crapshoot buying things right before they report earnings.",
        "created_utc": 1627401217,
        "id": "h6pwq29",
        "score": 7,
        "subreddit": "stocks",
        "created": 1627430017.0
    },
    {
        "author": "NeopolitanApologist",
        "body": "Tell that to PayPal which started at 0.009/share",
        "created_utc": 1627417795,
        "id": "h6qys5g",
        "score": 7,
        "subreddit": "pennystocks",
        "created": 1627446595.0
    },
    {
        "author": "SmoothBrainSavant",
        "body": "Sold al my pypl, so watch these guys jump to 330-350$ this week. F….\n\nEdit: if were being frank, i sold pypl and shopify… but kept microsoft and amazon.. do to this the ones i have will tank the ones I sold will pop. Such is the curse of my smooth brainenneness",
        "created_utc": 1627148932,
        "id": "h6dya8a",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1627177732.0
    },
    {
        "author": "Cool_Use_575",
        "body": "$SoFi is future PayPal or Square. People will regret in 2 years why they didn’t accumulate at this price range! Will hold and accumulate 💎💎💎🙌🙌🙌🦍🦍",
        "created_utc": 1626535471,
        "id": "h5iv8zs",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1626564271.0
    },
    {
        "author": "SnukeInRSniz",
        "body": "Jesus, do some actual DD before dumping money into something. There's a lot to bullish on with regards to SoFi, reading their prospectus would shed some of the pros and cons on the company for you. To start they have a very good CEO in Noto and good management. They have strong growth QoQ and YoY and will be profitable this year. Their customer base is growing substantially. They have preliminary approval for a bank charter and have acquired a bank, they are expecting the charter to be completed by the end of the year, this will reduce their costs and increase revenues substantially. They are the ONLY one stop shop for loans, investing, banking, etc. They also own Galileo which is the same as Square/Paypal so they can do C2C and B2B transactions, A LOT of people don't realize that. \n\n&amp;#x200B;\n\nBearish cases are thin, short term volatility is going to be immense as lockup expiry results in a huge release of shares (total shares are over 800Million!), there will be a big increase in the float over the coming weeks. Bigger investors/tutes know that the price was going to come down with the massive amount of shares being released from lockup, they are probably/hopefully just waiting on the sidelines for a better entry point. They are also entering an increasingly crowded sector with established banks and rising fintechs all over the field, it's a huge pie, but a lot more mouths to feed. There's also the chance the bank charter could not be approved. \n\n&amp;#x200B;\n\nHopefully this thing bottoms out now, I'm expecting a rocky July and a start to move up in early August in anticipation of earnings. What's the bottom? Well, pre-merger support was around 15, with some of the buying I'm hoping support now remains in the 17 area.",
        "created_utc": 1625254527,
        "id": "h3uc3gq",
        "score": 7,
        "subreddit": "stocks",
        "created": 1625283327.0
    },
    {
        "author": "FalconsBlewA283Lead",
        "body": "A lot. TSLA Monday, AAPL/MSFT/GOOG/AMD/V/SBUX all Tuesday, FB/PYPL Wednesday, AMZN Thursday just off the top of my head.",
        "created_utc": 1627062985,
        "id": "h69w8xx",
        "score": 7,
        "subreddit": "stocks",
        "created": 1627091785.0
    },
    {
        "author": "apooroldinvestor",
        "body": "MSFT GOOGL AMZN AAPL NVDA LRCX ASML PYPL UNH .... Have beat the market for many years.\n\nUNH has returned 21% a year since 2000.  21 years it has beat the market.",
        "created_utc": 1625179706,
        "id": "h3qlq1c",
        "score": 6,
        "subreddit": "stocks",
        "created": 1625208506.0
    },
    {
        "author": "O0O00O000O00O0O",
        "body": "He \"sold himself\" a ton of Paypal shares at $0.001 per share.  Not really something you can recreate unless you found the next multi-billion dollar company.",
        "created_utc": 1625684573,
        "id": "h4dwgd1",
        "score": 6,
        "subreddit": "investing",
        "created": 1625713373.0
    },
    {
        "author": "WatchTheWorldFall",
        "body": "Someone just PayPal me 100k.  That would be very kind.",
        "created_utc": 1625683792,
        "id": "h4dunxj",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625712592.0
    },
    {
        "author": "TheUndercoverAuditor",
        "body": "24 year old currently living at home. On pace to make six figures within the next 2 years. I have maxed both TFSA and RRSP. Been investing for a few years now but am looking for ways to balance out my portfolio as I want to reduce the amount of time I hawkeye my portfolio as I get a bit gain hungry...\n\nAny recommendations on would be appreciated. I've started to accumulate more dividend payers over the past few months. Looking to open a margin account to continue investing in the market. Would also like some tips on how to differentiate my investing strategy with the margin account vs. TFSA.\n\n**TFSA:**\n\n|Company|Ticker|Percentage|\n|:-|:-|:-|\n|MICROSOFT CORP|MSFT|12.8%|\n|VANGUARD S&amp;P500 IDX C$HDG|VSP|9.88%|\n|PAYPAL|PYPL|8.49%|\n|WALT DISNEY|DIS|6.91%|\n|WALMART INC|WMT|6.65%|\n|NVIDIA CORP|NVDA|6.21%|\n|JD.COM INC SPONS ADR|JD|5.82%|\n|SQUARE INC CL-A|SQ|5.13%|\n|EMERGE ARK AI&amp;BIG C$ ETF|EAAI|3.68%|\n|EMERGE ARK GL DISR C$ ETF|EARK|3.44%|\n|BROOKFIELD ASSET MGT-A LV|BAM.A|3.39%|\n|EMERGE ARK AUTO TEC C$ETF|EAUT|3.24%|\n|EMERGE ARK FINTECH C$ ETF|EAFT|3.2%|\n|ROGERS COMMUNICATNS-A MV|RCI.A|3.06%|\n|LISTED FDS ROUNDHILL SPRT|BETZ|2.81%|\n|LISTED FD ROUND BALL ETF|META|2.55%|\n|TWITTER INC|TWTR|2.36%|\n|TRANSALTA RENEWABLES INC|RNW|2.32%|\n|POWER CORP OF CANADA SV|POW|2.09%|\n|PURPOSE BITCOIN C$NON-HDG|BTCC.B|2.06%|\n|BILIBILI INC ADR|BILI|1.98%|\n|EMERGE ARK GENO&amp;BIO C$ETF|EAGB|1.8%|\n\n**RRSP:**\n\n&amp;#x200B;\n\n|**Company**|Ticker|Pecentage|\n|:-|:-|:-|\n|BMO CANADIAN DIVIDEND ETF|ZDV|14.82%|\n|ISHRS CORE S&amp;P500 IDX ETF|XUS|18.37%|\n|ISHARES CORE EQUITY ETF|XEQT|53.18%|\n|TORONTO DOMINION BANK|TD|12.71%|",
        "created_utc": 1625711449,
        "id": "h4fhchu",
        "score": 6,
        "subreddit": "CanadianInvestor",
        "created": 1625740249.0
    },
    {
        "author": "lionelFromBE",
        "body": "still in SPCE - go! just bought paypal calls strike 300",
        "created_utc": 1625584575,
        "id": "h48u4r6",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625613375.0
    },
    {
        "author": "Ferrari_tech",
        "body": "PayPal have 6 month free finance and many other credit cards offers the same services.",
        "created_utc": 1627253435,
        "id": "h6iv7zq",
        "score": 6,
        "subreddit": "stocks",
        "created": 1627282235.0
    },
    {
        "author": "iszir",
        "body": "AAPL  35%\n\nHD 11%\n\nCRSR 11%\n\nDKNG 10%\n\nPYPL 8%\n\nPLTR 8%\n\nAMD 7%\n\nZETA 7%\n\nCash 3%",
        "created_utc": 1626099874,
        "id": "h4x8sxg",
        "score": 6,
        "subreddit": "stocks",
        "created": 1626128674.0
    },
    {
        "author": "LordxGenius",
        "body": "What do y’all think of PayPal calls?",
        "created_utc": 1626090632,
        "id": "h4wsfw2",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1626119432.0
    },
    {
        "author": "grizzlybear10",
        "body": "&gt;PYPL\n\nI saw PYPL at 230 and waited for it to drop to $215. Missed the boat.",
        "created_utc": 1627060421,
        "id": "h69qaxn",
        "score": 6,
        "subreddit": "stocks",
        "created": 1627089221.0
    },
    {
        "author": "Hobodownthestreet",
        "body": "If you’re bored, you can go through my entire comment history and see that this is not something I do often, if ever: if you haven’t, maybe check out PayPal $PYPL cause they’re rocking and rolling. Like hardcore. I don’t know if they would be considered to be in the famous FANG family, but if they were, I could see it being PFANG.",
        "created_utc": 1626190510,
        "id": "h51p1k8",
        "score": 6,
        "subreddit": "stocks",
        "created": 1626219310.0
    },
    {
        "author": "FixingandDrinking",
        "body": "Got so burned last paypal earnings.....record breaking increased guidance didnt matter sell the news I was so bummed",
        "created_utc": 1627141896,
        "id": "h6djpli",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1627170696.0
    },
    {
        "author": "littlenemonox",
        "body": "Oops might be a typo: WF's PYPL target looks like it was set to 350 rather than 250. \n\nI'm cautiously optimistic about upcoming earnings, should be interesting for sure.  Great write-ups as always!",
        "created_utc": 1626814980,
        "id": "h5x7444",
        "score": 6,
        "subreddit": "stocks",
        "created": 1626843780.0
    },
    {
        "author": "Grey_Eye_22",
        "body": "20% compounded growth of revenue for salesforce since 2006 with \\~70% gross margins. Buying Stack and other companies and integrating it into their systems. \n\nPayPal has been doing a good job expanding Venmo and building out the online payment network. Expanding into a lot of other industries.",
        "created_utc": 1625509595,
        "id": "h45ioow",
        "score": 6,
        "subreddit": "stocks",
        "created": 1625538395.0
    },
    {
        "author": "bifburger",
        "body": "Great day for me... got calls in AVPT, SQ, MAXR and SOFI.\n\nSold calls in ALB and PYPL today.\n\nI hope the stock market gods keep this shit up!",
        "created_utc": 1626899502,
        "id": "h61os9v",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1626928302.0
    },
    {
        "author": "profanitycounter",
        "body": "UH OH! Someone has been using stinky language and u/richtofin115 decided to check u/Ragnaroktogon's bad word usage.\n\nI have gone back one thousand posts and comments and reviewed their potty language usage.\n\n|Bad Word|Quantity|\n:--|:-:|\n|bitch|1\n|bullshit|1\n|cuck|1\n|dick|2\n|fucking|18\n|fuck|14\n|hell|5\n|lmao|8\n|shit|10\n|slut|1\n\n^(Request time: 9.1. I am a bot that performs automatic profanity reports.) ^(This is profanitycounter version 3, view update notes) ^[here.](https://www.reddit.com/r/profanitycounter/comments/i6pql7/introducing_profanitycounter_version_3/) ^(Please consider supporting my development) ^([through my creator's PayPal.](https://www.paypal.me/aidanginise1))",
        "created_utc": 1627333987,
        "id": "h6mry8q",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1627362787.0
    },
    {
        "author": "rougethesis",
        "body": "This human gets it! If you’re into crypto for the money… thank Elon and buy the dip. If you’re into crypto for any other reason, acknowledge how much this guy has done to bring it into the spot lot and inspire more adoption. Either way, stop throwing stones at someone that’s genuinely trying to make the world more sustainable. The guy was a founder of PayPal for gods sake, he knows a thing or two about digital money!",
        "created_utc": 1626977677,
        "id": "h65l0tj",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1627006477.0
    },
    {
        "author": "Kyleeee",
        "body": "I'm self employed. I had to provide them bank statements for the last 3 years (for all 3 of my accounts, two business one personal), P/L statements, my paypal accounts, my god they never stopped asking me for shit.\n\nSame story I've heard from all of my friends trying to get into the market. This seems like an outlier to me based on my experience.",
        "created_utc": 1626285164,
        "id": "h56gkeo",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1626313964.0
    },
    {
        "author": "profanitycounter",
        "body": "UH OH! Someone has been using stinky language and u/competitivebunny decided to check u/competitivebunny's bad word usage.\n\nI have gone back one thousand posts and comments and reviewed their potty language usage.\n\n|Bad Word|Quantity|\n:--|:-:|\n|fucking|2\n|fuck|4\n|hell|1\n|shitty|1\n|shit|11\n\n^(Request time: 20.8. I am a bot that performs automatic profanity reports.) ^(This is profanitycounter version 3, view update notes) ^[here.](https://www.reddit.com/r/profanitycounter/comments/i6pql7/introducing_profanitycounter_version_3/) ^(Please consider supporting my development) ^([through my creator's PayPal.](https://www.paypal.me/aidanginise1))",
        "created_utc": 1627363486,
        "id": "h6obo6n",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1627392286.0
    },
    {
        "author": "profanitycounter",
        "body": "UH OH! Someone has been using stinky language and u/FannyPackPhantom decided to check u/phoenixmusicman's bad word usage.\n\nI have gone back one thousand posts and comments and reviewed their potty language usage.\n\n|Bad Word|Quantity|\n:--|:-:|\n|anal|1\n|ass|5\n|asshole|1\n|bastard|1\n|bitch|2\n|bullshit|3\n|cum|1\n|cunt|3\n|damn|9\n|dick|3\n|douchebag|1\n|fucking|33\n|fuck|50\n|goddamn|1\n|hell|35\n|lmao|7\n|lmfao|5\n|motherfucking|1\n|penis|1\n|pissed|3\n|porn|2\n|shitty|4\n|shit|22\n|tits|3\n\n^(Request time: 116.1. I am a bot that performs automatic profanity reports.) ^(This is profanitycounter version 3, view update notes) ^[here.](https://www.reddit.com/r/profanitycounter/comments/i6pql7/introducing_profanitycounter_version_3/) ^(Please consider supporting my development) ^([through my creator's PayPal.](https://www.paypal.me/aidanginise1))",
        "created_utc": 1627418374,
        "id": "h6r02ab",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1627447174.0
    },
    {
        "author": "StopTheBan420",
        "body": "PayPal will pump after earnings",
        "created_utc": 1627414957,
        "id": "h6qscu7",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1627443757.0
    },
    {
        "author": "Code_Reedus",
        "body": "X.com merged with Confiinity and was still called X.com. Elon was largest shareholder and CEO. He was replaced as CEO by Thiel and the company was later renamed PayPal. \n\nIt's arguable that Elon should rightfully be considered a co- founder based on the history. Elons company had the banking license. Confinity had the payment processing tech. Founders of both companies were indirectly founders of PayPal. \n\nYou guys all just spit out what you heard on a YouTube video that cherrypicks some of this info to bash Elon. Learn to think for yourselves.",
        "created_utc": 1627283032,
        "id": "h6k85dg",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1627311832.0
    },
    {
        "author": "Allen_17",
        "body": "How do you guys feel about buying PayPal and visa atm? I will be holding long term",
        "created_utc": 1626439414,
        "id": "h5e39jv",
        "score": 5,
        "subreddit": "stocks",
        "created": 1626468214.0
    },
    {
        "author": "BuytheFknDip69",
        "body": "SOFI has bottomed between $14 and $15 four times now. It’s a great company and it’s smart to buy on insider sell off weakness. Even conservative Morningstar has it at a 4 star rating $20.50 PT while the likes of SQ and PYPL get 1 star ratings. There’s not going to be a magical sign which tells you to buy, so buy now and you’ll probably be happy you did in 2022.",
        "created_utc": 1626472014,
        "id": "h5g4foq",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1626500814.0
    },
    {
        "author": "Sandy_Mountain",
        "body": "I am thinking of investing in these stocks\n\n\nRoku\n\n\nKornit Digital\n\n\n\nPaypal\n\n\n\n\nCloudflare \n\n\n\n\nWas looking to get a second opinion... Also is it a good idea to sell Corsair because it keeps dumping after it gets to $35...",
        "created_utc": 1627075525,
        "id": "h6ao5l3",
        "score": 5,
        "subreddit": "stocks",
        "created": 1627104325.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Yeah but if you're long term 10+ years MSFT NOW is cheap as are most good companies.\n\nI like ASML and LRCX and NVDA of course.  PYPL and also UNH HUM and scientific medical companies.  Healthcare is great. People are living longer and healthcare is a huge expense that will only make more and more money as years go by.",
        "created_utc": 1625425912,
        "id": "h41wkuj",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625454712.0
    },
    {
        "author": "Ka07iiC",
        "body": "Exactly! He missed a big point lol. He only looked at massive 200+ B companies. Didn't even include PayPal\n\nEdit: let alone Google!",
        "created_utc": 1625697644,
        "id": "h4eqbk1",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1625726444.0
    },
    {
        "author": "BigBoiBenis",
        "body": "PYPL SQ",
        "created_utc": 1625795014,
        "id": "h4jknia",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625823814.0
    },
    {
        "author": "SprinklerPope",
        "body": "Not holding PayPal 22 years ago. I HODL EVERYTHING NOW.",
        "created_utc": 1626012346,
        "id": "h4t54s0",
        "score": 5,
        "subreddit": "ValueInvesting",
        "created": 1626041146.0
    },
    {
        "author": "show76",
        "body": "&gt; but I feel like most people in the US will be using Venmo/Paypal/Cash App(square) to transfer money to each other.\n\nWhile that may hold true for US based people for transferring between friends, I think Wise's main US customer base is more directed to the expat community and the US based small businesses that may have some sales outside the US.",
        "created_utc": 1625664668,
        "id": "h4co6fr",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625693468.0
    },
    {
        "author": "DoctorTF",
        "body": "#NVDA and PayPal ❤️‍🔥",
        "created_utc": 1626961469,
        "id": "h64jnhk",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1626990269.0
    },
    {
        "author": "jdjdjjdjjd",
        "body": "You missed the best thing about $PAYO. It now provides upfront capital to online sellers based on their previous recurring sales revenue.  So small business on Amazon or Wish can grow faster. No need for a bank. When their business grows, so does Payoneer.  \n\nThis is basically what the startup “Pipe” does for startups but Payoneer is doing it for online retailers selling through big marketplaces.  Chamath and Jason Calacanis talk about Pipe all the time on the All-In podcast. \n\n Payoneer isn’t just money from  payments, it is really a becoming a growth platform for every online seller outside the USA. This is how it will be more valuable than PayPal.  \n\nIn the near future anyone wants to sell through global online marketplace outside the USA will sign up to Payoneer.  Now think of Starlink and how access to broadband will grow in Africa, Asia and developing countries in the next few years. All the growth in internet users is in a Africa and they will use Payoneer to sell through the existing marketplaces partnered with Payoneer.  All the broadband growth is outside the USA, all those small business will sign up to payoneer to sell their goods.",
        "created_utc": 1626442937,
        "id": "h5e9vod",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1626471737.0
    },
    {
        "author": "tallpaulpaultall",
        "body": "Welp, there goes my new exhaust for my bike. PYPL calls bout to be worthless",
        "created_utc": 1626359788,
        "id": "h5a2s0r",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1626388588.0
    },
    {
        "author": "drevil77",
        "body": "I have a position in SOFI. I think it has a lot of growth ahead. What I am curious about is will the market price it like a PayPal or like a traditional bank.",
        "created_utc": 1625191333,
        "id": "h3r86ll",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625220133.0
    },
    {
        "author": "New_Hedgehog_8865",
        "body": "Today is interesting. Usually my growth/tech stocks dip together. However, today, AMD, CSTL, CHPT, OPEN and BMBL are tanking together, but PYPL, AAPL, and two bio stocks are green/rising continuing to rally. In the past, PYPL in particular tended to dip strongly with the others.",
        "created_utc": 1625686370,
        "id": "h4e0i2b",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625715170.0
    },
    {
        "author": "Huntersmells33",
        "body": "Oh PayPal, you beautiful woman. Keep fighting and keep climbing.",
        "created_utc": 1625755181,
        "id": "h4h7vjn",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625783981.0
    },
    {
        "author": "Charlie2136",
        "body": "I went completely cash except on two positions yesterday. AAPL and PYPL calls. I am still fuk",
        "created_utc": 1625745521,
        "id": "h4gpuyh",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625774321.0
    },
    {
        "author": "lionelFromBE",
        "body": "PYPL options, + SPCE waiting RB goes to the space",
        "created_utc": 1625656661,
        "id": "h4cbt7v",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625685461.0
    },
    {
        "author": "LordxGenius",
        "body": "Bought pypl calls at top today 🤡🤡🤡🤡",
        "created_utc": 1626098988,
        "id": "h4x70jh",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1626127788.0
    },
    {
        "author": "captain_yosha",
        "body": "Lol there are some defensive holders who will get mad. I like their CEO but just don't see where they fit with SQ, Paypal and SHOP. I bought at $74 and sold at $90.\n\nThe common answer is that they have plenty of hospitality / restaurant clients so will favor from re-opening. My only local experience with them is a record shop that uses for their online portal. Otherwise even in Canada, Square seems to be the dominant in store option. Who knows, just with these valuations it's hard to pick the little guy",
        "created_utc": 1626369361,
        "id": "h5ap0zl",
        "score": 5,
        "subreddit": "CanadianInvestor",
        "created": 1626398161.0
    },
    {
        "author": "Redditpuram",
        "body": "July is paypal and restaurants rotation",
        "created_utc": 1625144038,
        "id": "h3oedbg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625172838.0
    },
    {
        "author": "imlaggingsobad",
        "body": "This is your savings. I would be risk averse, especially since your time horizon is only 6months. \n\nEqually weighted between Apple, Amazon, Paypal, Microsoft seems ok. \n\nI wouldn't touch NVDA or TSLA because they are too volatile.",
        "created_utc": 1625365817,
        "id": "h3zex3p",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625394617.0
    },
    {
        "author": "StopTheBan420",
        "body": "PayPal puts",
        "created_utc": 1626123652,
        "id": "h4ypkb4",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1626152452.0
    },
    {
        "author": "redpillbluepill4",
        "body": "I'm very bullish.. Mostly because PayPal is invested in this and they don't do stocks on their app.\n\nI think people are sleeping on this and i have a large position.",
        "created_utc": 1625881838,
        "id": "h4nou5a",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1625910638.0
    },
    {
        "author": "turkeychicken",
        "body": "I used TransferWise for about a year to pay an app developer who lived in Romania.  The interface was slick and it worked well enough.  After the project ended I didn't have a need to use the service any more though.\n\nMaybe it has a larger European / Non-US userbase but I feel like most people in the US will be using Venmo/Paypal/Cash App(square) to transfer money to each other.",
        "created_utc": 1625660803,
        "id": "h4chliv",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625689603.0
    },
    {
        "author": "the-bad-lieutenant",
        "body": "what the fuck PSFE I thought you were going to be the UK version of paypal...does that mean paypal lite or paypal with bad teeth, because you aren't doing shit otherwise",
        "created_utc": 1626281433,
        "id": "h56804w",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1626310233.0
    },
    {
        "author": "Hobodownthestreet",
        "body": "For me Pypl is always a buy. Regardless of dip or not. I haven’t followed the market much to see what’s a buy or not.",
        "created_utc": 1627403680,
        "id": "h6q2co2",
        "score": 4,
        "subreddit": "stocks",
        "created": 1627432480.0
    },
    {
        "author": "Quirky-Process-5119",
        "body": "My picks: SHOP (absolutely not over priced, IMO), PayPal, Apple, Nvidia, TEAM, Visa, ExxonMobil.",
        "created_utc": 1626635248,
        "id": "h5nx0m1",
        "score": 4,
        "subreddit": "stocks",
        "created": 1626664048.0
    },
    {
        "author": "greensymbiote",
        "body": "Sure. As mentioned above \"despite recent reports\" refers to recent YoY revenue growth which was affected by Covid-related business closures and Asia channel exits. Because, Paysafe just went public, most people are only looking at that year but if you including that performance with prior years, they were growing 18% CAGR which is on par with PYPL. Prior to that year they were growing 28% CAGR.\n\nBill Foley's tendency to downplay his projections and then exceed most expectations is something that came up a lot when I first started researching him.  In this case, he appears to be following the same pattern.  Their growth projections seem intentionally conservative as they don't include ongoing US iGaming expansion. Nor do they include M&amp;A growth that is apparently on deck.  Moreover, from the beginning, Foley has been extremely quiet about Paysafe and has done extremely little PR to boost it.  He's said explicitly that he doesn't care about the short term traders so he is not interested in hyping up a stock.  He is all about the long term play, and by all accounts, he delivers.",
        "created_utc": 1625240635,
        "id": "h3teipw",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625269435.0
    },
    {
        "author": "TerrorDeity",
        "body": "Leaps on Robinhood when I can. I compare them to google, apple, or Facebook right now. In the future they can even be square or PayPal. Enormous potential.",
        "created_utc": 1625177319,
        "id": "h3qgq63",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625206119.0
    },
    {
        "author": "bifburger",
        "body": "Watch Coinbase this week... gonna be interesting not to mention PayPal and Square who are also involved in crypto.\n\nI could see PYPL at $320 by EOW.\n\nLove defi. Can't wait until it crushes greedy CDN banks.",
        "created_utc": 1626025016,
        "id": "h4ttqbo",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1626053816.0
    },
    {
        "author": "Impossible_Goal_6514",
        "body": "The job opening is days old news. But I certainly hope for a tesla news. High chance that Peter thiel and elon has spoken before since they were partners in PayPal.",
        "created_utc": 1625576712,
        "id": "h48eots",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625605512.0
    },
    {
        "author": "Gyata97",
        "body": "Get into AAPL and PYPL you retards and stop playing memes.",
        "created_utc": 1625665821,
        "id": "h4cqezb",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625694621.0
    },
    {
        "author": "ConditionPrudent1648",
        "body": "Agree. \n\nTaking china as an example, they skipped the credit card phrase and moved from cash to Fintech (alipay/WeChat pay) quite easily and drastically.\n\nThe only thing going for visa, mc and amex is the rewards points which hooks consumers on.\nI see no other great advantages in owning a credit card.\n\nMerchant side, I have seen alot of merchants pushing for Google pay, apple pay, PayPal, swipe etc.... Before they suggest u to use credit card, because they charge merchants quite a high % for transactions.\n\nBanks wise, I have felt that the banks are finding credit cards to be less profitable as people start paying on time and being more careful with their spending, thus choking the interest rate they can charge for your late payments or non payments.\n\nCredit card Company wise, they have a very decent share of the payment market and that will probably be their only moat for now.\n\nCompetitor wise, the fintechs are promoting change of usage quite aggressively.  From where I come from, you get scratch cards, reward points and discounts for using their payment method.\n\nMost fintechs I know are currently working hand in hand with credit card companies to improve adaptation. But once the fintechs get a major foothold of the market, they will start going at it alone, cutting out the credit card companies. \n\nAs credit cards are pretty much of our everyday lives, I don't see it losing the battle so soon, but in the next 10-20 years, this landscape is definitely going to change.\n\nMy humble two cents",
        "created_utc": 1625471025,
        "id": "h43wa19",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625499825.0
    },
    {
        "author": "newtoinvesting123",
        "body": "PayPal me nudes!",
        "created_utc": 1627212703,
        "id": "h6gq5zh",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1627241503.0
    },
    {
        "author": "GADHP",
        "body": "Can I paypal you",
        "created_utc": 1627212654,
        "id": "h6gq3wi",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1627241454.0
    },
    {
        "author": "Domethegoon",
        "body": "Not gonna lie I lost a good chunk of change on PYPL puts this week and I dont feel great about it. It's probably not a good idea to short good companies.",
        "created_utc": 1627087495,
        "id": "h6bbpp9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1627116295.0
    },
    {
        "author": "TheMadLawyer",
        "body": "Let's talk PYPL... have been accumulating ; have a nice gain; did not buy it to trade; bought the stock because I like the concept for long term; but at a $308 this stock has surpassed my expectations; earnings report is coming next week; I just don't know what to do here.... By more? Sell some? Just hold?",
        "created_utc": 1627069355,
        "id": "h6aakbc",
        "score": 4,
        "subreddit": "investing",
        "created": 1627098155.0
    },
    {
        "author": "iamsarahz",
        "body": "anyone playing PYPL earnings next week?",
        "created_utc": 1627055133,
        "id": "h69dv2a",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1627083933.0
    },
    {
        "author": "RGR111",
        "body": "Aapl &amp; pypl",
        "created_utc": 1627024858,
        "id": "h682gxk",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1627053658.0
    },
    {
        "author": "tallpaulpaultall",
        "body": "Please go green. I beg of you. I just need enough for my new exhaust on my bike you fucking bitch PYPL!",
        "created_utc": 1626394001,
        "id": "h5c7a9b",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1626422801.0
    },
    {
        "author": "MiniatureEvil",
        "body": "Jokes on you I bought STX and not shit-tier meme stocks",
        "created_utc": 1626296252,
        "id": "h575gzy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626325052.0
    },
    {
        "author": "PivotRedAce",
        "body": "I wouldn't revenge invest immediately after losing a bunch of money. Stop your losses and give yourself a day to calm down so you can come back tomorrow more level-headed. \n\n&gt;!STX has been treating me well recently, however. Obviously do your DD but it might be worth looking into. If you are buying options on this stock or stocks in general make sure they are at least a month out to account for dips.!&lt;",
        "created_utc": 1626100910,
        "id": "h4xaxql",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626129710.0
    },
    {
        "author": "PivotRedAce",
        "body": "I've got calls in STX that have been treating me well, but YMMV obviously.",
        "created_utc": 1626098304,
        "id": "h4x5ntr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626127104.0
    },
    {
        "author": "The_Number_12",
        "body": "all in on TROW, PIPR, and fuck it, STX for the dividend",
        "created_utc": 1625165670,
        "id": "h3pq5hs",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1625194470.0
    },
    {
        "author": "ayjaylar",
        "body": "Ah ya skyworks is the 5G player, makes sense now",
        "created_utc": 1625157231,
        "id": "h3p6cwp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625186031.0
    }
]