[
    {
        "author": "Summebride",
        "body": "Great write up.  Counter advocate point, for discussion purposes...  Haven't you seen (as I have countless times) when mediocre software either wins the market, or wins on the stock market?  I won't even bother to list all the examples where the junkier option took over.  \n\nEverything you say about Palantir's offering could be technically correct, but then not matter when customers flock to it anyway.  Salesforce is rudimentary and mediocre.  And they also do $10 billion per quarter and rising.  \n\nYou mention that Palantir hasn't electrified the whole world in 20 years, so why would they now?  That's flawed (and not accurate in terms of years).   For their 17 years, broad market appeal wasn't the mission, so the fact it didn't happen doesn't necessarily mean much.\n\nNow that is beginning to be the mission, you can start the timer and break out the measuring stick.  What we've seen so far is some fairly strong interest from all kinds of private and public organizations.  What remains to be seen if it continues to ramp, of if this is just some initial fascination that goes away.",
        "created_utc": 1630322437,
        "id": "hawzq3m",
        "score": 82,
        "subreddit": "stocks",
        "created": 1630351237.0
    },
    {
        "author": "RinsyBoy",
        "body": "If you want to think like that, you can only invest in very few companies because the entire market is grossly overvalued. You have to compare with other companies in the same sector, which would be hard to because really only salesforce MAYBE comes close to PLTR. They are a unique business, so good luck doing that.",
        "created_utc": 1629109681,
        "id": "h952cqm",
        "score": 44,
        "subreddit": "stocks",
        "created": 1629138481.0
    },
    {
        "author": "preiser",
        "body": "this is a big fat hidden gem of a stock. closely tied to MSFT, huge growth potential as they're working with msft azure, salesforce, and google currently while trying to branch into AWS. add on to it the fed govts focus on cybersecurity with MSFT, google, and AWS leading the charge, there will be trickle down to AVPT. to boot, AVPT recently launched their channel program to branch out into small and medium business, previously they had focused on 5k+ employee enterprises.\n\navpt is criminally undervalued and will be a great play over the next 12 months as they deploy their merger cash on growth, both organic and inorganic.",
        "created_utc": 1628619097,
        "id": "h8fs97n",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1628647897.0
    },
    {
        "author": "Mdizzle29",
        "body": "I've held positions in Salesforce for 15 years now. \n\nEven though I'm up 5,000% overall, I sold too much along the way. What an incredibly successful company, wow.",
        "created_utc": 1629930738,
        "id": "hacnz0t",
        "score": 29,
        "subreddit": "stocks",
        "created": 1629959538.0
    },
    {
        "author": "TheProphetsGambit",
        "body": "At this point I'm just averaging down and being patient\n\nMarket will come to its senses soon enough, maybe within a year at most\n\nOn earnings call ceo reiterated the expansion to Salesforce cloud and current 111% retention rate with a target of 120%. I think the Salesforce play will be interesting to watch in coming quarters \n\nDoes anyone have any other plays similar to avpt in terms of low valuation and high growth?",
        "created_utc": 1628643114,
        "id": "h8h9qwh",
        "score": 26,
        "subreddit": "SPACs",
        "created": 1628671914.0
    },
    {
        "author": "The_Folkhero",
        "body": "Love Salesforce. One of my biggest holdings. Founder led juggernaut. I call CRM along with Adobe and Intuit as the \"baby FAANGs\" in my portfolio.",
        "created_utc": 1630015910,
        "id": "hahc3od",
        "score": 25,
        "subreddit": "investing",
        "created": 1630044710.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "P/E is a trash metric for companies that reinvest their earnings for growth. (AKA all software companies)\n\n&amp;#x200B;\n\nLook at Ebitda and Free Cash Flow.\n\n&amp;#x200B;\n\nSalesForce is expensive but you're getting a corvette.",
        "created_utc": 1630344051,
        "id": "hay9lid",
        "score": 23,
        "subreddit": "stocks",
        "created": 1630372851.0
    },
    {
        "author": "Fayde",
        "body": "Day 4 of my FD experiment:\n\n\n\n🍆| 💲 | 💦\n---|---|---\nBA | 215p | +11k\nBB |10.5p | -2k\nCRM | 270c | +6k\nGOOGL | 2850c | -8k\nMRVL | 65c/60p | Flat AF\nNVDA | 125c | -22k",
        "created_utc": 1630008784,
        "id": "hagv04f",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1630037584.0
    },
    {
        "author": "Snw323",
        "body": "Nvda - with the ARM acquisition\n\nCRM - really bullish on Salesforce they seem to make great acquisitions \n\nCpng - a little speculative but does a lot of great things",
        "created_utc": 1628426759,
        "id": "h85wwud",
        "score": 17,
        "subreddit": "stocks",
        "created": 1628455559.0
    },
    {
        "author": "marabou_stork",
        "body": "Oh, I'm with you! I was very long on BABA but all the recent developments make it hard to know where things will go.\n\nRegarding Slack, the more I learn about how people use Slack, the more I think this was a slam dunk for Salesforce. Sure, they paid a lot, but they can now replace Chatter with a great tool, and are integrating Tableau, Mulesoft, CRM, etc. into Slack... I've read about businesses that have [moved off of email and just use Slack internally](https://phasecrm.com/salesforce-mulesoft-slack-strategy), which says a lot about how powerful the combo could be.",
        "created_utc": 1629924393,
        "id": "hac8wwk",
        "score": 17,
        "subreddit": "stocks",
        "created": 1629953193.0
    },
    {
        "author": "NickNameIsNick",
        "body": "Second Quarter 2021 Financial Results\r  \n\r  \nTotal Revenue of $45.3 million, up 38% year-over-year\r  \nTotal ARR1 of $139.0 million as of June 30, 2021, up 33% year-over-year\r  \nSaaS Revenue of $20.6 million, up 76% year-over-year\r  \nGAAP Operating Loss of $11.2 million; GAAP Operating Margin of (24.7%)\r  \nNon-GAAP Operating Income of $3.3 million; Non-GAAP Operating Margin of 7.3%\r  \nGAAP net loss attributable to AvePoint, Inc. of $11.6 million or $0.98 per share\r  \nCash and Cash Equivalents of approximately $66.3 million as of June 30, 2021\r  \nNet proceeds of $204.5 million from business combination which closed on July 1st, subsequent to second quarter end\r  \nSecond Quarter 2021 Key Highlights\r  \n\r  \nThe AvePoint SaaS cloud platform, AvePoint Online Services, achieved FedRAMP Authorization signifying its SaaS solutions are approved for use across all United States federal agencies at the moderate impact level. The platform was also assessed against the Information Security Registered Assessors Program (IRAP), which ensures compliance with information security and requirements as mandated by the Australian Government\r  \nAvePoint released its Salesforce Cloud Backup for managed service providers (MSPs) across 36 countries and via 58 distributor app marketplaces\r  \nAPAC’s leading distributor of cloud solutions and services, rhipe, now offers AvePoint solutions to its managed service provider (MSP) customers\r  \nContinued expansion in user base with more than 8 million cloud users\r  \nFinancial Outlook\r  \n\r  \nFor the third quarter of 2021, AvePoint currently expects:\r  \n\r  \nTotal revenues between $51.5 and $53.5 million\r  \nNon-GAAP operating income between $1.7 and $3.2 million\r  \nFor the full year ending December 31, 2021, AvePoint currently expects:\r  \n\r  \nTotal revenues between $192.0 and $196.0 million \r  \nNon-GAAP operating income between $4.7 and $7.7 million",
        "created_utc": 1628626074,
        "id": "h8g8pkz",
        "score": 14,
        "subreddit": "SPACs",
        "created": 1628654874.0
    },
    {
        "author": "BearsGetRekt",
        "body": "Lpt: never buy a stock right after a big double digit loss, give it a week or so, they usually dip a bit more, at the very least go with monthlies/leaps. Source: tried catching the knife on crm, qcom, baba, Intel last year. They recover but it takes months, not days or weeks.",
        "created_utc": 1628806525,
        "id": "h8plo6g",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628835325.0
    },
    {
        "author": "Coda70",
        "body": "FAANG MSFT DIS CRM WMT BA JPM AMEX NVDA AMD etc.  I only play behemoths with a few exceptions.  Apple gonna keep running.",
        "created_utc": 1630358936,
        "id": "haz9gap",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1630387736.0
    },
    {
        "author": "thenewredditguy99",
        "body": "Yes, the shares of WORK converted into shares of Salesforce. 0.0776 shares + $29.76 in cash, to be exact. \n\nIf a stock is delisted from the exchanges, it will likely end up trading OTC.",
        "created_utc": 1628261857,
        "id": "h7xx7g2",
        "score": 10,
        "subreddit": "stocks",
        "created": 1628290657.0
    },
    {
        "author": "zerroEnna",
        "body": "I'm sorry but trying to compare Avepoint's service to Salesforce, Datadog, Fastly, Snowflake, Zoom, Docusign, and Crowdstrike only does a disservice to your argument.",
        "created_utc": 1629394376,
        "id": "h9k2rld",
        "score": 10,
        "subreddit": "SPACs",
        "created": 1629423176.0
    },
    {
        "author": "Quirky-Process-5119",
        "body": "NVDA, SHOP (favorite), PYPL, APPLE,  Salesforce.",
        "created_utc": 1629920702,
        "id": "habzkmc",
        "score": 9,
        "subreddit": "stocks",
        "created": 1629949502.0
    },
    {
        "author": "4858693929292",
        "body": "Salesforce is not rudimentary and mediocre, lmao. It may be hard to develop for and implement, but the software itself cannot be beat feature-wise by its competitors. Salesforce is literally **the** tool of B2B sales these days.",
        "created_utc": 1630345359,
        "id": "haycqzs",
        "score": 9,
        "subreddit": "stocks",
        "created": 1630374159.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "Salesforce isn't mature though. They're still buying new things and paying down investments.\n\nThey bought mulesoft, tableau and just slack within the last 4 years.\n\nTheir earnings are growing, revenue is growing, and fcf is exploding.",
        "created_utc": 1630347284,
        "id": "hayheu2",
        "score": 9,
        "subreddit": "stocks",
        "created": 1630376084.0
    },
    {
        "author": "sahukhala",
        "body": "&gt;k right after a big double digit loss, give it a week or so, they usually dip a bit more, at the very least go with monthlies/leaps. Source: tried catching the knife on crm, qcom, baba, Intel last year. They recover but it takes months, not days or weeks.\n\nMore bad news follows after ER miss, such as downgrades, driving the price further down.",
        "created_utc": 1628806690,
        "id": "h8pm1g2",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1628835490.0
    },
    {
        "author": "VVarlord",
        "body": "Here's why I'm long on Salesforce. Yes there's competition but there's *been* competition for thier services for years. No one can get quite what they have because they're fantastic at taking complex workflows and simplifying them just enough to work for pretty much anyone. Business loves them because they present data in a familiar yet flexible way and as long as they continue to innovate and don't shit the bed they'll continue to soar with mid to large size companies",
        "created_utc": 1630029553,
        "id": "hai5dot",
        "score": 8,
        "subreddit": "investing",
        "created": 1630058353.0
    },
    {
        "author": "solidsneeze",
        "body": "Salesforce geyser",
        "created_utc": 1629921998,
        "id": "hac2vb7",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1629950798.0
    },
    {
        "author": "joethemaker22",
        "body": "Reddit is a horrible place for stock advice given the upvote system leads to people saying what is popular in the present. That isnt helpful when some stocks take months/years to play out. \n\nSince May I have constantly seen people just look at stocks P/E or say the company has massive losses avoid them. Or that the stock was trading at a too high multiple. Going against that crowd ended up giving me my best gains. SNOW, DKNG, SE, MELI, CRM, CRWD, and NET have all done well since that FUD in May. Then you had the period of time people kept saying avoid bank stocks/financials. I again ignored the noise and bought GS and BLK  in April and again did well.\n\nI think the lesson is just overall reddit isnt really good for anything long term it better for stuff that play out within 1-3 days like meme stocks.",
        "created_utc": 1630102113,
        "id": "ham1nx5",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630130913.0
    },
    {
        "author": "Neat_Spectacles_Bruh",
        "body": "AVLR - 1 and 5 yrs - Tax Automation Software. Ungodly boring but a huge pain in the ass for businesses and new companies. \n\nCRM - 10 yrs - Salesforce, enterprise computing and building toward hybrid work future with Slack now part of the team.",
        "created_utc": 1629723562,
        "id": "ha0zu8b",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1629752362.0
    },
    {
        "author": "ninkorn",
        "body": "CEO of Salesforce reminds me of a sleazy car salesman",
        "created_utc": 1629929971,
        "id": "hacm7wu",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1629958771.0
    },
    {
        "author": "jsntx",
        "body": "I have 190 CRM shares @ 225 avg but I'm staying away from options after having a few losses on calls. I 100% agree with you, it's undervalued, but CRM has been kept suppressed for a long time while other tech companies get insane valuations. This makes OTM calls plays risky imo. \n\nI'll wait for the next pull back to load up on leaps.",
        "created_utc": 1630002425,
        "id": "hagf80n",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1630031225.0
    },
    {
        "author": "coolhandmoos",
        "body": "Salesforce has been killing it and has built itself with a reputation of being a great company to work for",
        "created_utc": 1629937689,
        "id": "had39f1",
        "score": 7,
        "subreddit": "stocks",
        "created": 1629966489.0
    },
    {
        "author": "East1st",
        "body": "I like CRM, but agree the valuation seems high. Been waiting for a significant pull back before jumping in, but others that you ask think it’s undervalued, so who really knows.",
        "created_utc": 1630342190,
        "id": "hay53up",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630370990.0
    },
    {
        "author": "TyrannosaurusWest",
        "body": "Salesforce is a cult.",
        "created_utc": 1628270299,
        "id": "h7yh76v",
        "score": 7,
        "subreddit": "stocks",
        "created": 1628299099.0
    },
    {
        "author": "Mdizzle29",
        "body": "Salesforce (CRM): Microsoft will crush it and they will go out of business. No barriers to entry. CRM stock is up 5600% since 2004.",
        "created_utc": 1629574483,
        "id": "h9tnfza",
        "score": 7,
        "subreddit": "stocks",
        "created": 1629603283.0
    },
    {
        "author": "CampPlane",
        "body": "I don't think Salesforce is going to be a behemoth like Microsoft and Apple, but as someone who's been using Salesforce nearly daily for well over a decade, I really wish I invested in them when I started my brokerage account in 2013. It would be insanely difficult for a competitor to come in take a chunk of market share. They *are* CRM software. Other companies succeed because they integrate with Salesforce - LeanData, Salesloft, Tableau, etc. They have such a huge moat, it's not even funny.",
        "created_utc": 1630356615,
        "id": "haz3y6y",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630385415.0
    },
    {
        "author": "indrgun",
        "body": "Yes CRM &amp; SPLK hopefully can still make money tomorrow",
        "created_utc": 1629922065,
        "id": "hac31g3",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1629950865.0
    },
    {
        "author": "Fayde",
        "body": "Day 4 of buying a shitload of degenerate FDs near open:\n\n\n\n🍆| 💦 | 📝\n---|---|---\nBA | 215p | \nBB |10.5p | \nCRM | 270c | \nGOOGL | 2850c | \nMRVL | 65c | Sept 17, might turn into a 65c/60p EOD if I decide to hold overnight through earnings\nNVDA | 125c | \n\nPlease don't copy my FDs unless you're prepared to lose 100% of your hard earned dick sucking money 100% of the time 🤨",
        "created_utc": 1629972633,
        "id": "haend67",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1630001433.0
    },
    {
        "author": "codemonkey14",
        "body": "Salesforce crushed earnings",
        "created_utc": 1629922688,
        "id": "hac4m1a",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1629951488.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "P/e does not do a good job period. It can be manipulated and it doesn't account for how much debt a company has.\n\nEv/EBITDA is much better metric. \n\n\nSalesforce generates 5 billion in free cash flow and that has grown from 2 billion 3 years ago. They print money. They do that very very well. How do you think they could afford to invest in every silicon valley startup and buy tableau and slack? Both grow over 25% annually and will continue to grow. They don't even really have debt that they can't pay off. It has a great balance sheet. \n\nBut they are expensive because they have to grow alot.\n\n\n\nSalesforce spends 3.5 billion in R&amp;D  up 2 billion from 2018 and a total 12 billion in sg&amp;a. That would be earnings if it wasn't a management decision to reinvest in the business.\n\n Their gross profit was huge its like 18 billion they just aggressively spend it to grow their market.\n\nIt's a subscription based company anyway you need to look at bookings and sticky revenue.",
        "created_utc": 1630359455,
        "id": "hazan70",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630388255.0
    },
    {
        "author": "BreakfastOnTheRiver",
        "body": "Long since $210. $CRM gonna make me ![gif](emote|free_emotes_pack|grin)",
        "created_utc": 1629998208,
        "id": "hag4j3u",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1630027008.0
    },
    {
        "author": "Investnew",
        "body": "Salesforce is a huge name, but there's lots of other players that benefit greatly from long-term/permanent work-from-home.  For example, a cloud-based work collaboration software like Smartsheet or a file sharing tool like Dropbox, both of which supposedly have been in talks with Amazon to form some kind of \"rebel alliance\" to take on Microsoft's work-productivity suite:  https://nypost.com/2021/07/01/amazon-discussed-forming-rebel-alliance-against-microsoft/ ... interesting stuff going on in this space.",
        "created_utc": 1630012860,
        "id": "hah4zaz",
        "score": 6,
        "subreddit": "investing",
        "created": 1630041660.0
    },
    {
        "author": "Joltarts",
        "body": "Not to mention, the software that PLTR have developed was funded by the US government.\n\nWhy do you think they keep being nominated for large and important Govt contracts without open tender or competition? The US government developed PLTR software. They have no reason to use anyone else..\n\nAll this nonsense about if they are so good, then why aren't there any competition has been said and refuted months ago. Nothing has changed to their underlying business..\n\nWe are looking at the next Tesla share.\n\nAmazon, &amp; Microsoft already said they have no interest in developing PLTR AI software as they know they are way too far behind and will take too much time to catch up. It's the biggest reason why they have partnered up with Pltr instead of competing.\n\nThis is like Toyota and BMW declaring they don't know how to make electric cars and instead, choose to partner with Tesla and pay them to make electric cars for them. Which is unheard of, yet, this so called little small company in Palantir already has the biggest partners you can work with.. Why is that?\n\nPalantirs biggest competition right now is CRM like salesforce. But quite honestly, Salesforce will be swallowed whole and spit out again because it's like comparing a rudimentary software against the behemoth that is Palantir.",
        "created_utc": 1629125686,
        "id": "h95wcv7",
        "score": 5,
        "subreddit": "stocks",
        "created": 1629154486.0
    },
    {
        "author": "sharco",
        "body": "Doing the same with NVDA and SQ. Gunna hop into CRM next week",
        "created_utc": 1629561718,
        "id": "h9sva9d",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1629590518.0
    },
    {
        "author": "YoloOnTsla",
        "body": "Salesforce is best CRM platform out there. More importantly the best M&amp;A team out there. They constantly buy the best companies in a space, and integrate. Waiting for next pullback then diving in this one",
        "created_utc": 1629998744,
        "id": "hag5x5n",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630027544.0
    },
    {
        "author": "Pikaea",
        "body": "I will start entering Avepoint soon, working within SalesForce, Atlassian, and AWS seems too much growth potential for it not to succeed.",
        "created_utc": 1630097212,
        "id": "halqhx9",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1630126012.0
    },
    {
        "author": "turkeychicken",
        "body": "I just did some rebalancing of my portfolio.  I dumped some low conviction/loser companies and doubled up on some of my high conviction companies.  I also started positions in a couple new companies as well.\n\nMy current brokerage portfolio is:\n\n**Equities**\n\nSymbol | % gain/loss | % of account\n:--------|:--------:|---------:\nAMZN | +152.23% | 15.2% | \nGOOGL | +138.5% | 15.02% | \nMSFT | +116.46% | 15% | \nNET | +147.29% | 8.7% | \nAAPL | +64.65% | 5.44% | \nTMO | +50.29% | 4.59% | \nABT | +26.06% | 3.89% | \nZTS | +74.84% | 2.9% | \nZG | +59.32% | 2.65% | \nCRM | +86.09% | 1.69% | \nMDT | +23.89% | 1.59% | \nHD | +17.29% | 1.4% | \nJPM | +32.44% | 1.25% | \nA | +3.84% | 1.23% | \nBRK/B | +62.67% | 1.21% | \nZBRA | +0.74% | 1.07% | \nUSB | +55.08% | 1.03% | \nSBUX | +34.63% | 0.89% | \nCRVL | +0.12% | 0.3% | \nIBM | -28.8% | 0.12% | \n\n**ETFs**\n\nSymbol | % gain/loss | % of account\n:--------|:--------:|---------:\nQCLN | +128.61% | 4.09%\nVTI | +4.98% | 3.34%\nVUG | +1.7% | 2.61%\nCGW | +8.23% | 1.81%\nADME | +52.31% | 0.94%\n\n**Mutual Funds**\n\nSymbol | % gain/loss | % of account\n:--------|:--------:|---------:\nWAMVX | +42.41% | 1.2%\nDLHAX | +17.13% | 0.83%\n\nI have some other ETFs and mutual funds in my Roth and SEP IRAs but this is the majority of  my investments.",
        "created_utc": 1630364432,
        "id": "hazlsaq",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630393232.0
    },
    {
        "author": "WickedSensitiveCrew",
        "body": "SNOW, CRWD, PLTR, SE, and CRM is what is saving me today. Feels kinda nice riding the horsemen of the overvalued apocalypse to a green day despite all the FUD around those stocks and market.",
        "created_utc": 1629999430,
        "id": "hag7ouf",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630028230.0
    },
    {
        "author": "Call_Me_Hurr1cane",
        "body": "Just bought CRM 280c… now the pre earnings sweating begins.",
        "created_utc": 1629919986,
        "id": "habxrnn",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1629948786.0
    },
    {
        "author": "codemonkey14",
        "body": "Anyone else playing CRM earnings this week?",
        "created_utc": 1629813685,
        "id": "ha5uyrs",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1629842485.0
    },
    {
        "author": "WorkingCorrect1062",
        "body": "CRM $280 tomorrow",
        "created_utc": 1629934540,
        "id": "hacwdfz",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1629963340.0
    },
    {
        "author": "Spiritual_Extreme_81",
        "body": "I told some boomers CRM GO BRRRR tomorrow \n\nThey told me “Does Brrr mean dropping?” \n\nLol 🤣",
        "created_utc": 1629935121,
        "id": "hacxmsh",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1629963921.0
    },
    {
        "author": "_foldLeft",
        "body": "I mean I agree with the general idea that CRM is undervalued relative to their competition and has a great future, but attempting to justify that argument just because they bought Slack is... _narrrow_. There are many other, better reasons for being excited about CRMs future than Slack.",
        "created_utc": 1630017574,
        "id": "hahfugw",
        "score": 5,
        "subreddit": "investing",
        "created": 1630046374.0
    },
    {
        "author": "PaleontologistWest",
        "body": "salesforce is good lol.  You should do some DD.",
        "created_utc": 1630346615,
        "id": "hayfsib",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630375415.0
    },
    {
        "author": "boomerzoomers",
        "body": "CRM running to 280 this week",
        "created_utc": 1630283255,
        "id": "havbr9h",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630312055.0
    },
    {
        "author": "marabou_stork",
        "body": "Agreed! I'm really curious how they'll tie this directly into the CRM data model (if at all).",
        "created_utc": 1629927559,
        "id": "hacgl66",
        "score": 4,
        "subreddit": "stocks",
        "created": 1629956359.0
    },
    {
        "author": "Trump_Ate_My_Ass",
        "body": "I literally bought a CRM call at the high of day\n\n🤡",
        "created_utc": 1629985761,
        "id": "haf9twd",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630014561.0
    },
    {
        "author": "Spiritual_Extreme_81",
        "body": "CRM GO BRRRRR tomorrow 😁",
        "created_utc": 1629924475,
        "id": "hac947l",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1629953275.0
    },
    {
        "author": "Spiritual_Extreme_81",
        "body": "MSFT Puts \nCRM Calls \nAAPL Calls \nBABA Puts \nDE Calls \nTSLA Puts \n\nGoing into the weekend with this",
        "created_utc": 1629489639,
        "id": "h9pcm2w",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1629518439.0
    },
    {
        "author": "GeneEnvironmental925",
        "body": "CRM broke out of its downtrend a few weeks ago and is getting ready for a move up to $300 leading into earnings at the EOM, IMO. I’m long.",
        "created_utc": 1628267712,
        "id": "h7yb14q",
        "score": 4,
        "subreddit": "stocks",
        "created": 1628296512.0
    },
    {
        "author": "Spiritual_Extreme_81",
        "body": "I want CRM to gap up to 280 then Spy can dump all it wants \n\nGot my UVXY today",
        "created_utc": 1629948646,
        "id": "hadqo4t",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1629977446.0
    },
    {
        "author": "Analfistfromhell",
        "body": "Crm 😭😭😭😭😭😭 please maintain those gains now",
        "created_utc": 1629921975,
        "id": "hac2t81",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1629950775.0
    },
    {
        "author": "Personal_coach",
        "body": "$CRM EARNINGS NEXT WEEK💰💰. \nAscending triangle on the weekly chart with a huge volume shelf as well.😳🚀",
        "created_utc": 1629141383,
        "id": "h97055a",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629170183.0
    },
    {
        "author": "Trishypooo",
        "body": "CRM breaking out on Earnings Report coming out and Cramer interviewing!",
        "created_utc": 1629910642,
        "id": "habafsn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629939442.0
    },
    {
        "author": "stevoacp1",
        "body": "CRM gonna print tomorrow. gonna pull and AMD/NVDA and dip a little then rip",
        "created_utc": 1629923425,
        "id": "hac6hts",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629952225.0
    },
    {
        "author": "ckami_91",
        "body": "CRM 300 and GME 300",
        "created_utc": 1629915161,
        "id": "hablpmk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629943961.0
    },
    {
        "author": "jsntx",
        "body": "##CRM!!!\n\nI told you. 258 days ago tho. But I was eventually right! 😀",
        "created_utc": 1629994523,
        "id": "hafv2av",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630023323.0
    },
    {
        "author": "Reasonable_Gas_5870",
        "body": "CRM fucking pumping!",
        "created_utc": 1629984995,
        "id": "haf84xj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630013795.0
    },
    {
        "author": "dkrich",
        "body": "CRM has to be the most overhyped over priced stock that I can find at least in the software space. Now it can’t even catch a bid on a day that the NQ is up 180 points after what seemed like a good earnings report. I dunno this one seems like an excellent short candidate",
        "created_utc": 1630349045,
        "id": "haylmmw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630377845.0
    },
    {
        "author": "emilybluntforeal",
        "body": "It's because of their absolute dominance in the CRM market, product-wise.",
        "created_utc": 1630346422,
        "id": "hayfbq4",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630375222.0
    },
    {
        "author": "Spiritual_Extreme_81",
        "body": "CRM \n\nthey crushed earnings last time and stock ripped. \n\nI have a Call Debit spread 260/265",
        "created_utc": 1629573145,
        "id": "h9tkkwo",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629601945.0
    },
    {
        "author": "Mortal1ty1337",
        "body": "I had so much flack for defending the shares are the slack deal. It wasn't that I thought it was a good deal... its just the entire market cap of slack was wiped off the value of salesforce. I should have gone in harder...",
        "created_utc": 1629928527,
        "id": "hacivkc",
        "score": 3,
        "subreddit": "stocks",
        "created": 1629957327.0
    },
    {
        "author": "Spiritual_Extreme_81",
        "body": "Spy you better not rain on my CRM Parade 😡",
        "created_utc": 1629951465,
        "id": "hadvpr7",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629980265.0
    },
    {
        "author": "throwaway78907890123",
        "body": "Regret buying CRM weeklies…",
        "created_utc": 1629923169,
        "id": "hac5uei",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629951969.0
    },
    {
        "author": "thefunnelmaster",
        "body": "I wouldn’t quite say it sucks as it is a powerful tool, but 100% agree that as a user it’s much harder to navigate. HubSpot has been eating up a ton of Salesforce market share.",
        "created_utc": 1630032149,
        "id": "haiawus",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630060949.0
    },
    {
        "author": "PapayaOk8743",
        "body": "So you sit and look at your CRM screen all day and talk yourself out of calling people….got it!",
        "created_utc": 1630240354,
        "id": "hasnxvi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630269154.0
    },
    {
        "author": "suckercuck",
        "body": "Because CNBC always be pumpin’ CRM",
        "created_utc": 1630353499,
        "id": "haywfn7",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630382299.0
    },
    {
        "author": "AngelaQQ",
        "body": "I like their cost discipline/balance sheet\n\nReliance on Microsoft/sharepoint gives me pause as to TAM\n\nNeed to hire more aggressive salesforce/improve sales strategy as a more late stage SaaS company. I see PAYC as a model for what a sales-focused mature/profitable SaaS company should look like in terms of sales operations.",
        "created_utc": 1628523698,
        "id": "h8api04",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1628552498.0
    },
    {
        "author": "Gitzo-Gutface",
        "body": "Wait, slack is owned by salesforce now?",
        "created_utc": 1629735461,
        "id": "ha1qhqd",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1629764261.0
    },
    {
        "author": "toydan",
        "body": "I might play CRM tomorrow. I assume they report AH",
        "created_utc": 1629838972,
        "id": "ha7l9fg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629867772.0
    },
    {
        "author": "bitesizebeef",
        "body": "I was a slack holder and sold when they got bought. Collected a nice premium on the buyout and moved onto other things although I had to heavily debate to take the shares but in the end decided I didnt know enough about salesforce, I do like seeing that they are putting slack to good use instead of just killing it like happens with a lot of mergers.",
        "created_utc": 1629946687,
        "id": "hadmuhs",
        "score": 3,
        "subreddit": "stocks",
        "created": 1629975487.0
    },
    {
        "author": "SullyBrr",
        "body": "Salesforce better be glad they made some nice acquisitions like Tableau and Slack because Salesforce by itself as a CRM is the most garbage software ever",
        "created_utc": 1629926472,
        "id": "hacdzbv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629955272.0
    },
    {
        "author": "the_beast93112",
        "body": "I'm probably gonna regret not adding more CRM",
        "created_utc": 1629921359,
        "id": "hac19cg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629950159.0
    },
    {
        "author": "jsntx",
        "body": "CRM 🚀 (only one cuz it takes forever to move)",
        "created_utc": 1629923036,
        "id": "hac5i59",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629951836.0
    },
    {
        "author": "thisispoopoopeepee",
        "body": "Compared to what CRM? SAP lol....",
        "created_utc": 1630097149,
        "id": "halqcn3",
        "score": 3,
        "subreddit": "investing",
        "created": 1630125949.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "High growth potential a little riskier due to already high valuation\n\nETSY, CRM\n\n\nGrowth at a reasonable price\nTTWO\n\n\nGrowth at a reasonable price Stocks after a 10% pullback (still will likely beat market)\n\nAdbe, FAAMG, HD",
        "created_utc": 1630090627,
        "id": "halapsl",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630119427.0
    },
    {
        "author": "GeneEnvironmental925",
        "body": "CRM is going to make the next leg up to around $300 leading into earnings",
        "created_utc": 1628265954,
        "id": "h7y6vf2",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628294754.0
    },
    {
        "author": "Hustler-rocks",
        "body": "Does anyone know about when Slack acquisition will be completed? $CRM earning is in 14 days.",
        "created_utc": 1628789663,
        "id": "h8ogutz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628818463.0
    },
    {
        "author": "Personal_coach",
        "body": "Buy CRM calls before Monday and you will be rich",
        "created_utc": 1628703056,
        "id": "h8k321t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628731856.0
    },
    {
        "author": "indigoismyfavourite",
        "body": "Salesforce remains the biggest hos out there. Do not advise any investment in them",
        "created_utc": 1628604044,
        "id": "h8esx3z",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628632844.0
    },
    {
        "author": "Almost_a_Noob",
        "body": "Everyone seems to be mentioning stocks with low volumes/liquidity &amp; with high premiums. I would look at stocks like AMZN or CRM that have been consolidating for a year, don’t but yet but buy once the trend is up and they are testing key resistance. Sell for a slight loss if they reject, and keep for a huge gain if they break out. Or to be more conservative buy the day after there is a close above that resistance, likely it will continue to trade higher like AMD just did after it’s consolidation for a year. You’d want to use TA too.",
        "created_utc": 1628440911,
        "id": "h86oj86",
        "score": 2,
        "subreddit": "options",
        "created": 1628469711.0
    },
    {
        "author": "claytondpark",
        "body": "Yeah legit it's nvda, adbe, msft, nflx and a lil bit of apple and crm today otherwise all other major stocks are red or flat",
        "created_utc": 1629391049,
        "id": "h9jup7w",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629419849.0
    },
    {
        "author": "bullishchilipepper10",
        "body": "Once MSFT CRM etc start giving back some of their gains it'll drop. 70% of SnP stocks are red or something",
        "created_utc": 1629393035,
        "id": "h9jzj62",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629421835.0
    },
    {
        "author": "stockaholic777",
        "body": "CRM into earnings.  Been looking very strong!",
        "created_utc": 1629487512,
        "id": "h9p7jhd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629516312.0
    },
    {
        "author": "stevoacp1",
        "body": "CRM is a great company but an absolute terrible stock to play",
        "created_utc": 1629812525,
        "id": "ha5sfqd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629841325.0
    },
    {
        "author": "Reasonable_Gas_5870",
        "body": "Easily with CRM earning this week. It will drag MSFT there.",
        "created_utc": 1629742362,
        "id": "ha27fb1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629771162.0
    },
    {
        "author": "kstorm88",
        "body": "Looks like theta wins for CRM.",
        "created_utc": 1629922723,
        "id": "hac4p98",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629951523.0
    },
    {
        "author": "WorkingCorrect1062",
        "body": "CRM gonna print hard, nice beat! Green signal for ADBE too. 🚀",
        "created_utc": 1629923483,
        "id": "hac6n3u",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629952283.0
    },
    {
        "author": "throwaway78907890123",
        "body": "CRM cmon disappoint me",
        "created_utc": 1629921840,
        "id": "hac2gw9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629950640.0
    },
    {
        "author": "Analfistfromhell",
        "body": "All in CRM tomorrow i cry tears of joy or sadness",
        "created_utc": 1629921697,
        "id": "hac23tu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629950497.0
    },
    {
        "author": "coder_karl",
        "body": "$ESTC $SPLK $CRM go go Make-Me-Money-Rangers",
        "created_utc": 1629536869,
        "id": "h9rqjdu",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1629565669.0
    },
    {
        "author": "shadowpawn",
        "body": "$CRM for the win on Weds.",
        "created_utc": 1629547606,
        "id": "h9s3ni0",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1629576406.0
    },
    {
        "author": "LegendaryHODLer",
        "body": "I do like CRM, I’ll try and get back in around $250",
        "created_utc": 1629674099,
        "id": "h9yugv4",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1629702899.0
    },
    {
        "author": "69articuno69",
        "body": "CRM all day baby.",
        "created_utc": 1630041288,
        "id": "hais12p",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630070088.0
    },
    {
        "author": "TheTHip99",
        "body": "looks like Salesforce and Amazon are the only winners today.",
        "created_utc": 1629991280,
        "id": "hafmysw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630020080.0
    },
    {
        "author": "Fayde",
        "body": "Also grabbed some CRM 270c FDs near close but Θ gang is probably going to eat those 🙄",
        "created_utc": 1629937288,
        "id": "had2dk3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629966088.0
    },
    {
        "author": "HeroOrHooligan",
        "body": "This is no joke, the year was 1999, the dumb shit girl with stock market dad went all in on cisco, I bought American express like a dingus",
        "created_utc": 1628685501,
        "id": "h8izwyi",
        "score": 141,
        "subreddit": "wallstreetbets",
        "created": 1628714301.0
    },
    {
        "author": "gslime",
        "body": "My dad worked at Cisco back then and  was given 5,000 shares as part of his employment package, only stipulation was it was locked up for 2 years.  Right before he hit the 2 year make they laid off all the senior level engineers, salesmen, and various other positions to hire millenials who would do almost the same work at a 1/4 of the salary.  My Dad wrote a scathing letter to then ceo John Chambers, and he responded with a hand signed check for 1 penny.",
        "created_utc": 1628691719,
        "id": "h8jcdjq",
        "score": 131,
        "subreddit": "wallstreetbets",
        "created": 1628720519.0
    },
    {
        "author": "Laakhesis",
        "body": "If Reddit exist back in 2000, your question is rephrased to\n\n&gt;Thinking about taking my money out of ETF (QQQ) and put it into **Cisco, Oracle, Intel, Amgen, Qualcoom**, so I can reap the full benefits of the stock increasing for maximum results.\n\nHistorically, winners rotate and QQQ is just there to track it passively. This is something to think about.",
        "created_utc": 1629473883,
        "id": "h9o9lt5",
        "score": 90,
        "subreddit": "investing",
        "created": 1629502683.0
    },
    {
        "author": "jessejerkoff",
        "body": "The fact that Cisco had with WebEx a fully functional video meeting tool, a huge customer base with direct access to the technical decision makers and they still fumbled the pandemic and lost out to zoom should tell you all you need to know:\n\nCisco is not a go getter growth company. They have become a it utilities company.",
        "created_utc": 1628417192,
        "id": "h85ks0v",
        "score": 82,
        "subreddit": "stocks",
        "created": 1628445992.0
    },
    {
        "author": "quiethandle",
        "body": "Tell that to people who bought Cisco in March of 2000. They are still holding those bags 21 years later...",
        "created_utc": 1629247845,
        "id": "h9cudbh",
        "score": 39,
        "subreddit": "investing",
        "created": 1629276645.0
    },
    {
        "author": "Pelopida92",
        "body": "I work in tech and honestly think Cisco has no future. its the next IBM. They had their moment but they are done now. In five years from now they might not even exist anymore. Probably will sell out to some big player.",
        "created_utc": 1628423572,
        "id": "h85sco0",
        "score": 26,
        "subreddit": "stocks",
        "created": 1628452372.0
    },
    {
        "author": "lib3rty47",
        "body": "Wrong. The economy does not equal the market. Cisco, is a tech leader in networking solutions for enterprises, theyve beat earnings repeatedly and is always in the conversation when it comes to networking, yet they still havent reached their all time highs in 20 years. It took Amazon 10 years to reach theirs when they plummeted. Along with the NASDAQ. \n\nThe market cap of I think the top 3 companies in the sp500 are all tech and above 1-2 trillion and the top 10 are approaching near half a trillion.\n\nWhat happens when there is no more new money in large caps because the market is noticing small and mid caps are promising more returns. Just because its a good company or a thriving sector, it doesn't mean its fairly valued and represents the economy, it could end up moving sideways for years till small/mid or even other sectors catch up. You could be stagnate with overpriced tech stocks till the market decodes the rotation finishes",
        "created_utc": 1629331747,
        "id": "h9gzupm",
        "score": 16,
        "subreddit": "stocks",
        "created": 1629360547.0
    },
    {
        "author": "80percentofme",
        "body": "Amazon wasn’t a top ten internet stock in 1997.  ORCL was.  Your $10k would be worth $20k now.  CSCO was.  Your $10k would be worth $8,500 now.  Of course, when you look back, you can pick winners.  It’s harder without hindsight.",
        "created_utc": 1628373074,
        "id": "h83oaql",
        "score": 14,
        "subreddit": "stocks",
        "created": 1628401874.0
    },
    {
        "author": "RollShotCornerPocket",
        "body": "The biggest lesson i've learned as someone who grew up with an OG investor of a dad? Just keep buying. \n\n&amp;#x200B;\n\nWatched my dad call a broker every month and invest $100 into SPY, MCD, SBUX, CSCO and MSFT without fail. Old man watched Cisco go from $77 to $13, Starbucks go from 18 to 4, Microsoft go from 57 to 28 in multiple major crashes that toilet paper hands would've dumped. What did he do? Bought the dip. If it dipped more? Bought again next month. If you're concerned about a market downturn, build positions over a period of time and don't sell. That's it.",
        "created_utc": 1628268729,
        "id": "h7ydh7s",
        "score": 14,
        "subreddit": "StockMarket",
        "created": 1628297529.0
    },
    {
        "author": "dellarouche",
        "body": "Cisco webex most likely",
        "created_utc": 1629350078,
        "id": "h9hz0ih",
        "score": 11,
        "subreddit": "stocks",
        "created": 1629378878.0
    },
    {
        "author": "MrBrawn",
        "body": "Man I remember when Cisco was king shit.  I visited their multibuilding campus while in college back in 2000.  It was cool as fuck.  It looks like they are making things happen again. Which is interesting.  Still 20 years to hold a bag is a loong time.",
        "created_utc": 1629249980,
        "id": "h9cykar",
        "score": 10,
        "subreddit": "investing",
        "created": 1629278780.0
    },
    {
        "author": "NodeDotSwift",
        "body": "It’s all about the predictability of revenues and profits. Buffett missed out on Amazon, but he was glad he missed out on Yahoo, Cisco, etc.",
        "created_utc": 1628633361,
        "id": "h8gpeuo",
        "score": 10,
        "subreddit": "ValueInvesting",
        "created": 1628662161.0
    },
    {
        "author": "BeerPizzaGaming",
        "body": "I am unsure about: Roblox and Analogue Devices  \nI like: HD, Lowes, Cisco, NVidia and TJX\n\nThe rest of retail might really mess up the week and cause the above to perform poorly relative to if the retail stocks as a whole were on par or if it was an otherwise good week.\n\nI'll check back in next week to see how I did.",
        "created_utc": 1628914645,
        "id": "h8vgqh9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1628943445.0
    },
    {
        "author": "__iMAGiNATiON",
        "body": "While business fundamentals are important for long term returns, valuation is too. Cisco and Microsoft were and still are great business. But investing at the wrong time (i.e. when they were overvalued) would have led to significantly lower returns than the market.",
        "created_utc": 1628970812,
        "id": "h8y4umk",
        "score": 7,
        "subreddit": "investing",
        "created": 1628999612.0
    },
    {
        "author": "Led_-zeppelin",
        "body": "&gt;You can overpay for growth  \n&gt;  \n&gt; regardless of how good the company is, and that's exactly what Cathie is doing.\n\nI think the issue here is to double check what the thesis on this companies where at the time to see what made you overpay for growth or not. Cathy can be overpaying for growth (and I think she is in most of her picks) but in some  she must just be right and I think she knows that she doesn't need to be right in 100% of them just on a few to be wildly successful, Just like what happen with Tesla, She had a bull target price of $7000 pre split ($1400 slit adjusted) and everyone thought her crazy and now you see her base case being the most common price targets for this year and her 2017's bull case being likely more and more (and I think it was a price target for 2024 so she still has time for Tesla to reach that valuation).\n\nAlso regarding Cisco, I don't particularly remember the \"bull case\" for Cisco that \"validated\" its price during the Dot Com bubble,  but I would argue if simplified  it would look like this \"everyone will be using the internet in the future so the company that has the technology that will allow everyone to be connected to the internet will be a goldmine\". Not a bad idea or logic other than the technology got commoditized and 20 years later everyone has a router in their house like people assumed in 1999/2000 but nobody cares what brand it is and the devices that actually keep us connected to the internet in the most convenient way (smartphones) is actually designed by the most valuable company in the world and its competitor doesn't even make the hardware at all (Google with Android).\n\nWhat people didn't saw in the 2000's with their \"bull case\" for Cisco (The creation of the smartphone and how it changed internet access from home to on the go was the biggest culprit here)  is the reason why Cisco hasn't recovered in share price because people bought into growth that never materialized . I agree you can overpay for growth but you will only be certain of it after the fact when your thesis is validated or completely changes for better or worse.  You can overpay for growth and you can also miss opportunities of decades or even lifetimes, this is why you have to double check your thesis if you are investing into this type of companies that will have massive growth in the future to see if the growth is actually there or not.",
        "created_utc": 1629255020,
        "id": "h9d8bz9",
        "score": 7,
        "subreddit": "investing",
        "created": 1629283820.0
    },
    {
        "author": "Brave_Sir_Rennie",
        "body": "Bought AMZN last century, … when it went up a bit, I sold enough to get my money back and held the rest these past 20+ years. Did the same with CSCO. (Did the same with many others, but these are the two “hit it out the park” ones.",
        "created_utc": 1629644341,
        "id": "h9wz4qp",
        "score": 6,
        "subreddit": "stocks",
        "created": 1629673141.0
    },
    {
        "author": "Jerhed89",
        "body": "I’m thinking puts on NVDA and CSCO.  Leads for hardware has been 60+ days so I’d be surprised if they meet earnings, and I’ve seen more items become constricted so I don’t expect amazing guidance.  I’d consider puts on Home Depot as well, construction materials cost has been insane and has caused project delays with getting items.  \n\nI’m honestly not super confident to buy calls or puts on any of the others.",
        "created_utc": 1628977668,
        "id": "h8yjstt",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1629006468.0
    },
    {
        "author": "waldenducks",
        "body": "\\- Cisco, March 27, 2000",
        "created_utc": 1629671099,
        "id": "h9yo6qc",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1629699899.0
    },
    {
        "author": "cryptohick",
        "body": "I currently have 2023 LEAPS on CSCO, O, and a stock commonly referred to as a meme stock that recently bought up $50 million in gold lol",
        "created_utc": 1629863983,
        "id": "ha93ejo",
        "score": 4,
        "subreddit": "stocks",
        "created": 1629892783.0
    },
    {
        "author": "NodeDotSwift",
        "body": "A value investor would not have bought Cisco in 1999. Nor DISCA or VIAC at their peaks.\n\nIt’s called estimating intrinsic value for predictable businesses with a strong margin of safety. If you can’t estimate IV don’t buy stocks. Since I can, I say give me more volatility so I can lower my portfolio risk.\n\nhttps://fs.blog/2013/11/mr-market/",
        "created_utc": 1629156209,
        "id": "h9807jv",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1629185009.0
    },
    {
        "author": "theyneverluvdme",
        "body": "CSCO $60 EOW",
        "created_utc": 1629730851,
        "id": "ha1fi48",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629759651.0
    },
    {
        "author": "michaels0510",
        "body": "I’ve taken my profits yesterday and put them into Cisco for now. Might take it out once this dip shakes itself out. Which I’m sure it will within the next quarter.",
        "created_utc": 1628252594,
        "id": "h7xdubz",
        "score": 3,
        "subreddit": "investing",
        "created": 1628281394.0
    },
    {
        "author": "spacebizzle",
        "body": "If Tesla goes, it’ll bring down all the high fliers with it, overpriced software, memes, ev, hype, in a sane market it’s a $50-80B company, not $650B.  \n\nIt’s the Cisco of this era.",
        "created_utc": 1629225046,
        "id": "h9bfyop",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629253846.0
    },
    {
        "author": "redditisphaggot123",
        "body": "&gt;Cisco\n\n&gt;tech leader\n\nlmao\n\nIn all seriousness though I agree, there's a lot of future growth priced into most tech stocks and I could see them underperforming if conditions don't pan out.",
        "created_utc": 1629342140,
        "id": "h9hljv1",
        "score": 3,
        "subreddit": "stocks",
        "created": 1629370940.0
    },
    {
        "author": "Net-Xpert",
        "body": "Dude we are not going to War. This thing is coming to an end. Only one equity I agree with is PLTR. Instead of Afghanistan I am looking for cyclicals that will get a lion share for infrastructure upgrade like Engineering and construction names Jacob’s Engineering, Eaton Corp, Broadband Companies carriers like Verizon. AT&amp;T, TMobile, 5G companies Nokia , Tech sector Cisco, PAN, Fortinet, that’s where the next money 💰 flow will be in. Thank God we are out of Afghanistan let’s focus on local economy and make money not lose money.",
        "created_utc": 1629133460,
        "id": "h96g3cv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629162260.0
    },
    {
        "author": "FatDickGreg",
        "body": "That means you just ate processed foods delivered from Cisco is what that means actually",
        "created_utc": 1629601196,
        "id": "h9v6pjz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629629996.0
    },
    {
        "author": "AccountantOk111",
        "body": "Really we are breaking down hood and now Cisco all morning who cares about Cisco",
        "created_utc": 1629379165,
        "id": "h9j2p3n",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629407965.0
    },
    {
        "author": "BizPundit",
        "body": "CSCO all time chart is hilarious. The dot com bubble was so fucking insane, wish I could have been a part of it",
        "created_utc": 1629444400,
        "id": "h9mw9ds",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629473200.0
    },
    {
        "author": "MightyManorMan",
        "body": "TQQQ is actually ZQQ leveraged 3 times (minus the hedging in CAD). UPRO is the S&amp;P 500 3 times. But let's be real... the NASDAQ 100 is definitely moving. \n\nThe top 20 are actually 2/3rds of the whole index. Imagine if you removed the big laggards, Pepsi, Comcast, Intel and Cisco.",
        "created_utc": 1628782220,
        "id": "h8nyfkl",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1628811020.0
    },
    {
        "author": "AndyM134",
        "body": "Cisco or Sysco?",
        "created_utc": 1628464684,
        "id": "h8839e3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628493484.0
    },
    {
        "author": "ajfaria",
        "body": "What's up with the shortages everywhere? I've heard it's Cisco drivers/packers are super low rn but like every restaurant/fast food/grocery store are low or out of tons of products. Wtf",
        "created_utc": 1628464601,
        "id": "h8833fp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628493401.0
    },
    {
        "author": "greytoc",
        "body": "Company stocks can fall and it can take years and sometimes decades to recover. \n\nThere were quite a few well known high-flying tech stocks in the 90's and early 2000's that never recovered or are only now recovering.  The ones that always pop into my mind include Cisco, Intel, GE, Akamai, VeriSign, Checkpoint. Citrix. I'm sure there are more examples including companies that eventually failed or were delisted. \n\nAnd please don't ask me why they pop into my mind.",
        "created_utc": 1629227525,
        "id": "h9blqnt",
        "score": 2,
        "subreddit": "investing",
        "created": 1629256325.0
    },
    {
        "author": "slaphandsbumpfists",
        "body": "Here's my current list for actively investing in puts and put spreads. You'll need to screen this for your own criteria and assess what market conditions to enter and exit trades. \n\nAAPL,AEP,AFL,ALL,AMC,AMGN,AQN,ATO,BB,BBY,BLK,CAH,CB,CHRW,CLX,CMI,CSCO,ED,F,FDX,GD,HD,HIG,HPQ,INTC,IP,JNJ,K,KMB,KO,KR,LAZ,LEG,LMT,LNT,LOW,MDT,MMM,MO,OMC,PFE,PFG,PG,PM,PRU,QCOM,SJM,SNA,SPY,SRE,T,TRV,UBSI,UNM,VIAC,VIX,VZ,WBA,WDC,WHR,WRK",
        "created_utc": 1629810412,
        "id": "ha5o3br",
        "score": 2,
        "subreddit": "options",
        "created": 1629839212.0
    },
    {
        "author": "Thick-Acanthaceae-59",
        "body": "Delay, Delta +, soon Delta ++ like Cisco",
        "created_utc": 1628135145,
        "id": "h7rit0j",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628163945.0
    },
    {
        "author": "michaels0510",
        "body": "I’m more into long hold shares so I’m not sure if Cisco is something that’s going to be around in 5-10 years time.",
        "created_utc": 1628418658,
        "id": "h85me8r",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628447458.0
    },
    {
        "author": "filtervw",
        "body": "I am not sure of it's affected but it surely is correlated in a some way. If you find a company where the CEO is paid well above average of it's industry  but the revenue is flat or dropping you can be sure the CEO works for his/ her bonus not for the good of a he company. Examples: IBM in the days of Rometti, Intel a couple of years ago, GE, Cisco, etc",
        "created_utc": 1628373699,
        "id": "h83pjaq",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628402499.0
    },
    {
        "author": "jessejerkoff",
        "body": "Not the argument I made! You're right, but that just goes to show how out of touch Cisco is with their customer needs.\n\nIt's sort of as if I run a bar, someone orders a tequila sunrise and I give him a glass of pipe cleaner. They were my customer, they said they need it, all I had to do is give it to them. But no, I give them a glass of pipe cleaner so that the popup cocktail stand on the road can serve them the drinks they want. \n\nThat is how bad Cisco is.",
        "created_utc": 1628458520,
        "id": "h87qkf1",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628487320.0
    },
    {
        "author": "AndyM134",
        "body": "Lol all good, just adding that before someone gets mad when they short Cisco for a food supply chain issue. Even tho Cisco hasn’t been a hot buy either but yea",
        "created_utc": 1628464772,
        "id": "h883fpl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628493572.0
    },
    {
        "author": "FluxTradesStocks",
        "body": "Gonna swing a $CSCO 55/55.5 Straddle into earnings, filled at 1.93.\n\nThe average historical move of CSCO is 5%, but the strangle gives us a b/e of 3.5%. Awesome odds on this one!",
        "created_utc": 1629315275,
        "id": "h9g01vp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629344075.0
    },
    {
        "author": "jaghataikhan",
        "body": "Yeah back then Cisco/ dell/ end/ hp were basically the FANGs of today",
        "created_utc": 1629253879,
        "id": "h9d66l9",
        "score": 2,
        "subreddit": "investing",
        "created": 1629282679.0
    },
    {
        "author": "Awesome____Sauce",
        "body": "fuck you cisco",
        "created_utc": 1629379608,
        "id": "h9j3mg5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629408408.0
    },
    {
        "author": "fonzy541",
        "body": "Good look on $CSCO",
        "created_utc": 1629084531,
        "id": "h943ze3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629113331.0
    },
    {
        "author": "sockalicious",
        "body": "Tomorrow gonna watch my CSCO FD put spread 55.5/50 find some way to crater out on me.\n\nUnless my wife goes into labor in which case I will watch it on my phone in L&amp;D",
        "created_utc": 1629232214,
        "id": "h9bx249",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629261014.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 18th of August\n\n\n\n## Upcoming events for Wednesday, August 18th\n\n - Expected earnings:\n\n  ADI, APOP, BBWI, BLRX, CAAP, CSAN, CSCO, CTIB, DGLY, DLO, DQ, EAT, EBR, EBR.B, ELTK, GRIL, GRIN, HEPA, HOOD, IMNM, INDP, JBSS, KEYS, KLTR, LITB, LITE, LOW, MBT, METX, NCNA, NNDM, NVDA, OSIS, PLCE, PNRG, PTNR, RRGB, SFL, SINT, SMED, SNPS, SPTN, SQM, STG, TGT, TJX, TUYA, UAMY, UUU, VINP, VIPS, VNET, VSCO, WB, WLMS, YY, ZIM, ZTO\n\n - Ex-div:\n\n  ADTN, APO, AVA, BG, BWXT, CLPR, CVX, DFS, DHT, GFF, HE, HTBI, LFUS, MAC, MAV, MHI, MSFT, NLSN, NRP, PHD, PHT, RMD, SBSI, SUNS, SWCH, VCIF, WD\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.890%)\n    - Building Permits (consensus: 1.610M, previous: 1.594M)\n    - Building Permits (previous: -5.3%)\n    - Crude Oil Imports (previous: -0.796M)\n    - Crude Oil Inventories (consensus: -1.055M, previous: -0.447M)\n    - Cushing Crude Oil Inventories (previous: -0.325M)\n    - Distillate Fuel Production (previous: 0.008M)\n    - EIA Refinery Crude Runs  (previous: 0.277M)\n    - EIA Weekly Distillates Stocks (consensus: 0.276M, previous: 1.766M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.2%, previous: 0.5%)\n    - FOMC Meeting Minutes\n    - Gasoline Inventories (consensus: -1.671M, previous: -1.400M)\n    - Gasoline Production (previous: -0.190M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Housing Starts (consensus: 1.600M, previous: 1.643M)\n    - Housing Starts (previous: 6.3%)\n    - MBA 30-Year Mortgage Rate (previous: 2.99%)\n    - MBA Delinquency Rates (previous: 6.38%)\n    - MBA Mortgage Applications (previous: 2.8%)\n    - MBA Purchase Index (previous: 252.0)\n    - Mortgage Market Index (previous: 754.8)\n    - Mortgage Refinance Index (previous: 3,684.3)\n\n## Upcoming events for Thursday, August 19th\n\n - Expected earnings:\n\n  ACY, AMAT, ARCE, ATGE, AZRE, BFRA, BILI, BJ, BLND, BTBT, BVXV, BZUN, CALT, CANG, CATO, CBMB, DAO, DESP, EL, EYES, FEDU, FLGC, FRSX, FTCH, GHG, GSMG, HMG, HMLP, HOLI, HUIZ, INM, ISIG, KOSS, KSS, LFVN, LIZI, LYTS, M, MNSO, MSGS, MYSZ, NM, NNA, NTES, NUZE, OIBR.C, PALI, PAQC, PAX, PDEX, PFGC, QFIN, QIWI, RDHL, REDU, ROST, SINO, SJ, SQBG, STVN, SUPV, TPR, TUEM, VEON, WOOF, WVFC, YRD, YTRA, ZEPP, ZIVO\n\n - Ex-div:\n\n  ACP, AGD, AKO.A, AKO.B, AOD, ARDC, ASGI, AWP, BBSI, BBWI, CBFV, CCOI, CGNX, CMI, CORE, CTSH, DEX, EVRG, FDBC, FSS, FWRD, GSK, HCI, HCSG, HMPT, HNI, HSBC, HSY, IBOC, IEP, IGR, MCHP, MCO, MGPI, MGU, MIXT, MNRL, MTRN, MTX, NMRK, OBNK, OTIS, PBI, PCF, PCSB, PFC, PRI, PUK, RPRX, RTX, RXN, SBLK, SNA, SWM, TEL, THQ, THW, TKR, TTEK, UMPQ, USLM, USPH, WBA\n\n - Economic events and announcements:\n\n    - 30-Year TIPS Auction (previous: -0.040%)\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.055%)\n    - Continuing Jobless Claims (consensus: 2,800K, previous: 2,866K)\n    - Initial Jobless Claims (consensus: 363K, previous: 375K)\n    - Jobless Claims 4-Week Avg. (previous: 396.25K)\n    - Natural Gas Storage (consensus: 49B, previous: 49B)\n    - Philadelphia Fed Manufacturing Index (consensus: 23.0, previous: 21.9)\n    - Philly Fed Business Conditions (previous: 48.6)\n    - Philly Fed CAPEX Index (previous: 41.20)\n    - Philly Fed Employment (previous: 29.2)\n    - Philly Fed New Orders (previous: 17.0)\n    - Philly Fed Prices Paid (previous: 69.70)\n    - US Leading Index (consensus: 0.8%, previous: 0.7%)\n\n## Upcoming events for Friday, August 20th\n\n - Expected earnings:\n\n  AHPI, AIM, ATXI, AVCO, AZRX, BHAT, BKE, BRFS, BRID, CARV, CDZI, CIDM, CIG, CJJD, CNET, CNNB, CREG, CXDC, CYTH, DE, DSS, ENVB, FL, FRD, FSEA, FTFT, GASS, GB, GLG, GNLN, HUSA, INTG, JP, KULR, MBOT, MSN, MVST, MYMD, NXTD, OSAT, PBFS, PED, PFSW, POLA, PTIX, PVL, QLGN, RLX, RVP, SCX, SFUN, SGRP, SHG, SNFCA, TAIT, TAYD, TDAC, TKAT, TTNP, UI, UNAM, VERY, VWE, WORX\n\n - Ex-div:\n\n  AATC, AEIS, AFT, AIF, AOMR, ATO, BGH, DLX, DX, FGB, FHB, FMN, GAIN, GLAD, GOOD, GSL, HL, HVT, HVT.A, IGIC, JBT, LAND, LTC, MFD, MMM, NATH, NCMI, NLOK, OGN, R, RDN, TIPT, TSCO, UGP, UPS\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.3K)\n    - CFTC Copper speculative net positions (previous: 29.0K)\n    - CFTC Corn speculative net positions (previous: 321.6K)\n    - CFTC Crude Oil speculative net positions (previous: 400.4K)\n    - CFTC Gold speculative net positions (previous: 168.4K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -13.3K)\n    - CFTC Natural Gas speculative net positions (previous: -143.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 23.1K)\n    - CFTC Silver speculative net positions (previous: 24.5K)\n    - CFTC Soybeans speculative net positions (previous: 122.4K)\n    - CFTC Wheat speculative net positions (previous: 43.6K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 387)\n    - U.S. Baker Hughes Total Rig Count (previous: 491)\n\n^^^^2021-08-18",
        "created_utc": 1629280814,
        "id": "h9e5h7d",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1629309614.0
    },
    {
        "author": "ff005",
        "body": "I'd go for dividend paying stocks, some growth &amp; some value. You can find dividend stocks in many different sectors. Dual income. \n\nTech\n$AVGO\n$TXN\n$MSFT\n$CSCO\n\nIndustrials\n$CAT\n$HON\n$BA\n$MMM\n\nRetail\n$WMT\n$TGT\n$COST\n$HD\n\nHealthcare\n$PFE\n$JNJ\n$MRK\n$ABBV\n\nTelecom\n$T\n$VZ\n$CCI\n$AMT",
        "created_utc": 1629021640,
        "id": "h90jn6a",
        "score": 2,
        "subreddit": "options",
        "created": 1629050440.0
    },
    {
        "author": "1badls2goat_v2",
        "body": "I worked at Cisco. Fuck Chambers. That is all.",
        "created_utc": 1628706953,
        "id": "h8kch43",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628735753.0
    },
    {
        "author": "monkey7878",
        "body": "Google, IBM, oracle, cisco, Fortinet, Crowdstrike are my bets.",
        "created_utc": 1628972377,
        "id": "h8y895z",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629001177.0
    },
    {
        "author": "Redditor45643335",
        "body": "I just checked the stock price of Oracle for like the first time in 10 years expecting it to be dead but its actually popping off... I thought it was in the same league as IBM and Cisco.",
        "created_utc": 1629482954,
        "id": "h9ow6we",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629511754.0
    },
    {
        "author": "play_it_safe",
        "body": "First, what's interesting is that I come from a similar background and had the same thinking for a long time. But the more I thought about it, the more I reconsidered. \n\nWhat's interesting is that the bust cycle for tech already happened. That was Cisco. Every industry has done this. Renewables did a decade ago. Now they're fairly mature revenue generating companies (FSLR off top of my head). \n\nI think with big tech, it's had those growing pains already. MSFT AAPL especially came back from the dead after that that bust. These are no Cisco. That died basically. Or Standard Oil. Or GM (which I think is reinventing itself nicely, but that's another story). Or INTC (which is dying...). AAPL MSFT AMZN especially have huge competitive advantages across industries, own Washington and continue to curb any attempt at serious regulation, and continue to create and recreate entirely new industries. Especially with huge profit margins, sticky revenue streams, and TAM that continue to multiply as they suck in every other industry in existence (I'm not kidding:AMZN still owns the cloud, and that's not an easy yoke to throw off for clients. MSFT has bought out gaming, AAPL into cars, which may or may not be good idea, and services like banking). They are in part infrastructure companies, too. They can't fail. Or the increasingly digitized economy fails. One Google outage cost the world billions. For all of that, I'm happy to pay the multiples you put out. They're peanuts. AAPL also has enough cash on hand and the acumen to spend it wisely that the Swiss Central Bank bought millions worth during covid crash (it was huge). You're investing in with something that has the power and wealth of a freaking nation state. Dying? No problem. FB bought out Instagram. \n\nMoats upon moats, and network effects. These are all something former giants didn't have, and not something that could be said of any former businesses that went bust. No one trick ponies here. \n\nNFLX isn't worthwhile in my opinion. Nor is TSLA. The ones I named are. For all the reasons I gave.\n\nIf you're concerned about valuations, you need to consider interest rates. Both Schiller and Buffett have talked about how given persistent low interest rates in the developed world, the equity premium right now is, well, not a premium. They're the only way to generate returns. And may well remain so.\n\nHere's a guy that's been consistently correct for the past two years on valuations and overall market behavior. He's spot on about the numbers. Very good recent article by him: https://www.fidelity.com/learning-center/trading-investing/is-the-market-at-a-top\n\nI don't disagree with you. But to compare something like AAPL to Cisco or to Standard Oil is to completely misunderstand the nature of their businesses and their staying power and what they've become. And that's why Buffett continues to hold an ungodly amount. Did he buy the former giants? I'm sure you respect him, right? 😉",
        "created_utc": 1628223376,
        "id": "h7wbicz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628252176.0
    },
    {
        "author": "edgestander",
        "body": "I don’t think Cisco ever passed GE and was behind Exxon nearly the entire bubble.",
        "created_utc": 1627849758,
        "id": "h7conwd",
        "score": 1,
        "subreddit": "investing",
        "created": 1627878558.0
    },
    {
        "author": "MightyManorMan",
        "body": "Cisco has grown on average 1.6% per annum for the last 9 years. They are using their cash to buy back about 3% of the shares a year, so that their EPS rises. And paying a 2.5% yield so they don't accumulate too much cash. Not enough R&amp;D and new products... they are sleepy. They need new management.",
        "created_utc": 1628280179,
        "id": "h7z48a8",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1628308979.0
    },
    {
        "author": "patrick8515",
        "body": "I need my fix! CSCO calls??",
        "created_utc": 1627903760,
        "id": "h7f1v84",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627932560.0
    },
    {
        "author": "Disastrous-Sorbet-38",
        "body": "Put it into one or a few blue chip stocks that have a good record of paying dividends.  Over the long haul, that $1,000 will turn into $50,000 pretty easily with dividends being reinvested.  Apple, Cisco, Visa, Mastercard, MMM, Union Pacific, Wells Fargo - those kinds of stocks.  Or you could just buy SPY.",
        "created_utc": 1627825270,
        "id": "h7b9cfv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627854070.0
    },
    {
        "author": "burn_bridges",
        "body": "Thoughts on the VGT ETF?  Owns all (3) of those in addition to NVDA, AAPL, MSFT, ADBE, INTC, CRM, CSCO, etc...",
        "created_utc": 1628795686,
        "id": "h8ouwta",
        "score": 1,
        "subreddit": "investing",
        "created": 1628824486.0
    },
    {
        "author": "Zranza",
        "body": "Yes I’m just a stupid amateur who invested in dumb hype companies like Starbucks Nike Facebook Apple Amazon Netflix Chipotle back in 2012/13 and not garbage like Intel Verizon and Cisco. \n\nGet off your high horse and stop thinking you’re better/smarter than everybody else. Probably a 40 year old virgin in your moms basement driving a Ford truck with an American/Trump flag waving off the side preaching that gas&gt;electric.",
        "created_utc": 1628439397,
        "id": "h86l90s",
        "score": 1,
        "subreddit": "investing",
        "created": 1628468197.0
    },
    {
        "author": "postblitz",
        "body": "Everyone preaching value always mentions the best case scenario while advocating action regardless of scenario. Namely: what if you had bought those before they collapsed? What if you bought Cisco in 1999 and never got your \"value\" back?",
        "created_utc": 1629147821,
        "id": "h97gjoc",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1629176621.0
    },
    {
        "author": "stockaholic777",
        "body": "Cisco",
        "created_utc": 1628977937,
        "id": "h8ykdfh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629006737.0
    },
    {
        "author": "lemurianelf",
        "body": "I mean look at Cisco chart. If anybody bought in at peak, I got no sympathy for them.",
        "created_utc": 1629243046,
        "id": "h9ckzd6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629271846.0
    },
    {
        "author": "reddituserzerosix",
        "body": "F for HOOD and CSCO",
        "created_utc": 1629317406,
        "id": "h9g4u4r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629346206.0
    },
    {
        "author": "patrick8515",
        "body": "CSCO calls finally worked but fuck .",
        "created_utc": 1629423807,
        "id": "h9lyo08",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629452607.0
    },
    {
        "author": "bungholio99",
        "body": "Do a smart pick that doesn’t make you work to much...do you understand tech maybe pick Oracle/Cisco, do you understand retail e-commerce maybe Amazon, best pick would maybe Coca Cola you understand the business and you can also rely on other reports..\n\nDon’t take something to fancy and difficult to understand and explain like google, coinbase or Tesla.",
        "created_utc": 1629869939,
        "id": "ha9cvbx",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1629898739.0
    },
    {
        "author": "M_Scaevola",
        "body": "A moat in consumer products is easy enough to spot. Progressive in car insurance (right now at least, maybe Geico makes a comeback). Apple in computers. Walmart. Amazon. Mars Candy. It’s all qualitative in nature though, so I don’t know how useful a service for that would be.\n\nGetting outside of consumer facing entities, you tend to need some familiarity with the industry (this is why lynch stresses local knowledge). Cisco for networking technologies. Microsoft and Oracle both dominate database markets, even with cloud in roads.\n\nConglomerates or even large business with multiple product lines may have moats in some areas, but not in others. Activision has a moat with candy crush, but they gave up their market share with World of Warcraft through sheer stupidity. Nintendo partially owns the Pokémon Company. But both companies also have a lot of other baggage that may hurt the company.",
        "created_utc": 1629736555,
        "id": "ha1t5et",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1629765355.0
    },
    {
        "author": "MightyManorMan",
        "body": "TEC looks like maybe half my portfolio... it's based on [https://www.solactive.com/Indices/?index=DE000SLA6X91](https://www.solactive.com/Indices/?index=DE000SLA6X91)\n\nThe problem with indexes like this is that they create a basket of the winners and losers. For example, in the doghouse of stocks I wouldn't buy from the index, Cisco (they are basically asleep at the wheel, for about 8 years, no innovation, no growth), Intel (single digit growth), Visa (Square is growing quickly, MasterCard is growing better than Visa). Just to give a few examples.\n\nAlso, because these are indexes, they tend to look at more established companies and miss the exponential growth stage.",
        "created_utc": 1628126563,
        "id": "h7r1sle",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1628155363.0
    },
    {
        "author": "cloud7up",
        "body": "What are your thoughts on investing in Cisco? Big company and is a leader in the networking field along with making moves in Cybersecurity field. I think it is a good investment strategy",
        "created_utc": 1627960846,
        "id": "h7ieizt",
        "score": 1,
        "subreddit": "investing",
        "created": 1627989646.0
    },
    {
        "author": "fugatorio",
        "body": "I love how retards here shit on divvy stocks (O, Stag, Csco, IBM, etc) but over the course of last 12 months, my divvy stocks went way up and gave me a fat dividend compared to AMZN, CRSR, BABA, and a lot of other overrated pieces of shit stocks that WSB loves.",
        "created_utc": 1627991687,
        "id": "h7jjvx5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628020487.0
    },
    {
        "author": "cookingboy",
        "body": "&gt;  EV companies are basically the new dot com equivalent\n\nI don't see how that's true. Dotcom companies at one point was responsible for driving NASDAQ up by 400% from 1995 to 2000. I don't see how EV companies are making nearly the same difference on the public market today. Microsoft and Cisco were the world's most valuable companies during the dot com bubble (number 1 and 2, and they took turns lol), but Tesla, even after its crazy rise last year, is still not even [in the top 5 by market cap today](https://companiesmarketcap.com/). \n\n&gt;It's even scarier than back then.\n\nBy what metrics?",
        "created_utc": 1627803079,
        "id": "h7ah4cf",
        "score": 1,
        "subreddit": "investing",
        "created": 1627831879.0
    },
    {
        "author": "FinndBors",
        "body": "&gt; Back then many companies not only didn't have profit, they literally had almost zero revenue.\n\nThat’s not true. A large percentage of IPOs back then had revenue, just no profits. And the valuations of these profitless companies like pets.com (again it had revenue) was at 300 million at its max. Just look at the valuations of various spacs like NKLA, QS, SPCE. No revenue, but huge multi billion valuations.\n\n&gt; Where as today the tech giants are figuratively printing profits.\n\nThe tech giants of yesteryear were also printing profits like MSFT, HPQ, CISCO, etc. Those were the FAANGs of the day.",
        "created_utc": 1627815463,
        "id": "h7auz9n",
        "score": 1,
        "subreddit": "investing",
        "created": 1627844263.0
    },
    {
        "author": "MessyAngelo",
        "body": "I install these virtual meeting rooms. No one and i mean no one is using a single apple product to do this. Its all zoom rooms or on their own network. Zoom and cisco would be the play here. But i would add i am seeing less and less cisco being used. Its all Creston and extron gear.",
        "created_utc": 1627839624,
        "id": "h7c3cnq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627868424.0
    },
    {
        "author": "cloud7up",
        "body": "What do you think about buying calls for a stock that has been trading sideways for a while? I'm looking at the CSCO options chains but wanted to get some thoughts first",
        "created_utc": 1628042622,
        "id": "h7mnebt",
        "score": 1,
        "subreddit": "options",
        "created": 1628071422.0
    },
    {
        "author": "scaling_gamer",
        "body": "CSCO earnings are on the 18th and options are dirt cheap. \n\nHow are straddles not free money when this always pumps or dumps after earnings at least 5%?",
        "created_utc": 1628201090,
        "id": "h7v29b7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628229890.0
    },
    {
        "author": "trill_collins__",
        "body": "&gt; Keep sitting on the sidelines talking about P/E and go buy Macy’s, Intel, Cisco, Nordstrom’s, Best Buy, and ~~Jet Blue~~ UnitedContinental. Enjoy your “value investing” and I’ll be buying the companies that rule the decade [like Pets.com, Enron, AOL, WorldCom, and GeoCities]. We’ll talk in ~~2030~~ 2010 and compare returns. Good luck!\n\n-Some other over-confident dumbass a few decades ago just before the dot com crash",
        "created_utc": 1628436144,
        "id": "h86edk7",
        "score": 1,
        "subreddit": "investing",
        "created": 1628464944.0
    },
    {
        "author": "strawlion",
        "body": "Tends to work out for indices in the long run. Doesn't tend to work out for individual stocks when very overvalued which is the point of this thread.\n\nRemember how hot CSCO was in 2000? Wouldn't have even broken even after 20 years of holding",
        "created_utc": 1628988387,
        "id": "h8z5dcg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629017187.0
    },
    {
        "author": "homeless_alchemist",
        "body": "I don't understand doximity's valuation at all. I think it's grossly overvalued. They basically create tools and a networking platform for physicians. They then monetize their physician network via allowing pharma and hospital systems to market to them. They're upside is capped by how niche their focus is. Though, I guess they could try to branch into physician adjacent fields, if they start to plateau. \n\nI have used doximity's patient dialer during covid and it was really effective, but now that covid isn't as bad and my hospital transitioned to Cisco Jabber, I have little reason to use it now.",
        "created_utc": 1629067156,
        "id": "h934t9a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629095956.0
    },
    {
        "author": "swingkid72",
        "body": "Please explain what “based on the timeline means”. By my calculation $100k invested in AAPL on 9/1/1996 (roughly 25 years ago) would be worth about $68.8 million. Still an enormous gain that more than proves the point you’re trying to make, but a long way from $73.8 billion. \n\nAlso, the point holds for those who had the foresight and/or luck to invest in AAPL or AMZN then, but not for any number of tech companies that that went under during the dot com crash, or even some of those that have survived to this day, like Cisco, that still has yet to reach the ATH it made in 1997.  \n\nSo the idea that it doesn’t matter what price you buy a company at, if you just hold long enough, you will eventually profit, is false.",
        "created_utc": 1628986468,
        "id": "h8z1mfv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629015268.0
    },
    {
        "author": "fr0ntsight",
        "body": "Is that showing the day or total gains/losses?\n\nHonestly it's really simple. Just buy apple, Nvidia, Google, Cisco, etc... They will all go up IMHO. \nYou could also just buy spy and do better than your doing",
        "created_utc": 1629438778,
        "id": "h9mp4ty",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1629467578.0
    },
    {
        "author": "souljaboyforeskin",
        "body": "csco puts just trust me",
        "created_utc": 1629441710,
        "id": "h9msz0m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629470510.0
    },
    {
        "author": "Appropriate_Tap_7045",
        "body": "Lmao I was using your posts more as a learning resource, wasnt really\nplanning on making any plays. But this week i had some BP, so i opened a csco strangle. No biggie, ate the loss. Hilarious that I passed up dynamite SNAP and PINS plays only to try CSCO",
        "created_utc": 1629396195,
        "id": "h9k74yo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629424995.0
    },
    {
        "author": "hahdbdidndkdi",
        "body": "Ok.\n\nRegarding your second point, I hope you didn't buy Intel or Cisco in 2000.",
        "created_utc": 1629476049,
        "id": "h9of09a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629504849.0
    },
    {
        "author": "Wayneisthebatman",
        "body": "Buy ANET as a hedge for Cisco calls",
        "created_utc": 1629138103,
        "id": "h96rzgm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629166903.0
    },
    {
        "author": "deadjawa",
        "body": "Uh, clearly you weren’t around during the tech boom.  Lots of people who were investing in clunkers like CSCO, LU, and DELL were also investing in AMZN, AAPL, MSFT.  The winners offset the losers immensely.\n\nIf you think she’s a momentum trader you haven’t actually read any of Ark’s research which stresses valuations over a longer horizon.  And the primary reason she gets into and out of positions is when fundamentals change.  Typically for one of a few common reasons.",
        "created_utc": 1629250415,
        "id": "h9czf8j",
        "score": 1,
        "subreddit": "investing",
        "created": 1629279215.0
    },
    {
        "author": "sockalicious",
        "body": "CSCO, earnings come out on Weds and they never make earnings",
        "created_utc": 1629103709,
        "id": "h94v5md",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629132509.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 17th of August\n\n\n\n## Upcoming events for Tuesday, August 17th\n\n - Stock splits:\n\n    - LEMLF @ **1:10**\n    - MNNFF @ **1:5**\n    - PTSI @ **2:1** (Payable date: 08/16/2021)\n\n - Expected earnings:\n\n  A, ACXP, AENZ, AFMD, AIT, ALC, AMCR, ARKR, AUVI, BBIG, BBL, BDL, BEST, BON, BTCM, BYFC, CDK, CHSCP, CMCM, COGT, CREE, CRESY, CRMT, CVM, CWCO, DNUT, ECC, FLNG, FORTY, GDS, GNPX, GOGL, GRCL, GRUB, HCDI, HD, HUYA, INST, JAX, JKHY, LX, LZB, MNDY, NETI, NOAH, NRBO, NVIV, OB, ONE, OZON, PINC, PRAX, QUIK, REE, RERE, RHE, RVPH, SE, SRNE, STNE, SVFD, THCA, TIGR, VTEX, WHLR, WMT\n\n - Ex-div:\n\n  ADM, ADX, AFL, AGO, AMAL, AMOT, BKH, CRD.A, CRD.B, CSL, CXE, CXH, DMB, ED, EQIX, ESXB, FDP, FMBH, FOF, GGB, HRZN, ICL, JACK, L, LDP, MCR, MIN, MMT, MPC, MRO, ORA, PBR, PBR.A, PCAR, PEO, PFLT, PHI, POWL, PSF, PSX, PTA, RNP, RQI, SEM, SGC, SHYF, SSSS, SXC, TGT, UTF, VMC\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -0.816M)\n    - Business Inventories (consensus: 0.8%, previous: 0.5%)\n    - Capacity Utilization Rate (consensus: 75.7%, previous: 75.4%)\n    - Core Retail Sales (consensus: 0.1%, previous: 1.3%)\n    - FOMC Member Kashkari Speaks\n    - Fed Chair Powell Speaks\n    - Industrial Production (consensus: 0.5%, previous: 0.4%)\n    - Industrial Production (previous: 9.80%)\n    - MBA Delinquency Rates (previous: 6.38%)\n    - Manufacturing Production (consensus: 0.6%, previous: -0.1%)\n    - NAHB Housing Market Index (consensus: 80, previous: 80)\n    - Redbook (previous: 16.2%)\n    - Retail Control (consensus: -0.1%, previous: 1.1%)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Retail Sales (consensus: -0.3%, previous: 0.6%)\n    - Retail Sales (previous: 17.98%)\n    - Retail Sales Ex Gas/Autos (previous: 1.1%)\n\n## Upcoming events for Wednesday, August 18th\n\n - Expected earnings:\n\n  ADI, AIHS, APOP, BBQ, BBWI, BLRX, CAAP, CSAN, CSCO, CTIB, DLO, DQ, EAT, EBR, EBR.B, ELTK, GHSI, GRIL, GRIN, HEPA, HGSH, HOOD, IMNM, INDP, JBSS, KEYS, KLTR, LITB, LITE, LOW, MBT, METX, NAOV, NCNA, NNDM, NVDA, OSIS, PLCE, PNRG, PTNR, RRGB, SFL, SINT, SMED, SNPS, SONM, SPTN, SQM, STG, TGT, TJX, TUYA, UAMY, UUU, VINP, VIPS, VNET, VSCO, WB, WLMS, YY, ZIM, ZTO\n\n - Ex-div:\n\n  ADTN, APO, AVA, BG, BWXT, CLPR, CVX, DFS, DHT, GFF, HE, HTBI, LFUS, MAC, MAV, MHI, MSFT, NLSN, NRP, PHD, PHT, RMD, SBSI, SUNS, SWCH, VCIF, WD\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.890%)\n    - Building Permits (consensus: 1.610M, previous: 1.594M)\n    - Building Permits (previous: -5.3%)\n    - Crude Oil Imports (previous: -0.796M)\n    - Crude Oil Inventories (consensus: -1.259M, previous: -0.447M)\n    - Cushing Crude Oil Inventories (previous: -0.325M)\n    - Distillate Fuel Production (previous: 0.008M)\n    - EIA Refinery Crude Runs  (previous: 0.277M)\n    - EIA Weekly Distillates Stocks (consensus: -0.217M, previous: 1.766M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.2%, previous: 0.5%)\n    - FOMC Meeting Minutes\n    - Gasoline Inventories (consensus: -1.800M, previous: -1.400M)\n    - Gasoline Production (previous: -0.190M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Housing Starts (consensus: 1.602M, previous: 1.643M)\n    - Housing Starts (previous: 6.3%)\n    - MBA 30-Year Mortgage Rate (previous: 2.99%)\n    - MBA Mortgage Applications (previous: 2.8%)\n    - MBA Purchase Index (previous: 252.0)\n    - Mortgage Market Index (previous: 754.8)\n    - Mortgage Refinance Index (previous: 3,684.3)\n\n## Upcoming events for Thursday, August 19th\n\n - Expected earnings:\n\n  AG, AMAT, ARCE, ATGE, BFRA, BILI, BJ, BLND, BTBT, BVXV, BZUN, CATO, COCP, DESP, EL, ELOX, ENTX, EPIX, FEDU, FLGC, FRSX, FTCH, GSMG, HMLP, HUIZ, ISIG, KOSS, KSS, LFVN, LORL, LVTX, LYTS, M, MNSO, MSGS, NM, NNA, NUZE, PAQC, PAX, PDEX, PFGC, QFIN, QIWI, ROST, SJ, SLDB, STVN, SUPV, TPR, TUEM, VEON, VQS, WOOF, WVFC, YRD, YTRA, ZEPP\n\n - Ex-div:\n\n  ACP, AGD, AKO.A, AKO.B, AOD, ARDC, ASGI, AWP, BBSI, BBWI, CBFV, CCOI, CGNX, CMI, CORE, CTSH, DEX, EVRG, FDBC, FSS, FWRD, GSK, HCI, HCSG, HMPT, HNI, HSBC, HSY, IBOC, IEP, IGR, MCHP, MCO, MGPI, MGU, MIXT, MNRL, MTRN, MTX, NMRK, OBNK, OTIS, PBI, PCF, PCSB, PFC, PRI, PUK, RPRX, RTX, RXN, SBLK, SNA, SWM, TEL, THQ, THW, TKR, TTEK, UMPQ, USLM, USPH, WBA\n\n - Economic events and announcements:\n\n    - 30-Year TIPS Auction (previous: -0.040%)\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.055%)\n    - Continuing Jobless Claims (consensus: 2,800K, previous: 2,866K)\n    - Initial Jobless Claims (consensus: 363K, previous: 375K)\n    - Jobless Claims 4-Week Avg. (previous: 396.25K)\n    - Natural Gas Storage (consensus: 49B, previous: 49B)\n    - Philadelphia Fed Manufacturing Index (consensus: 23.0, previous: 21.9)\n    - Philly Fed Business Conditions (previous: 48.6)\n    - Philly Fed CAPEX Index (previous: 41.20)\n    - Philly Fed Employment (previous: 29.2)\n    - Philly Fed New Orders (previous: 17.0)\n    - Philly Fed Prices Paid (previous: 69.70)\n    - US Leading Index (consensus: 0.8%, previous: 0.7%)\n\n## Upcoming events for Friday, August 20th\n\n - Expected earnings:\n\n  AVCO, BKE, BRID, BTX, CDZI, CNNB, DE, ENSC, FL, GASS, GB, GNLN, INTG, JP, KULR, LMFA, MVST, PFSW, PVL, RLX, SCX, SHG, TAYD, TDAC, TKAT, UI\n\n - Ex-div:\n\n  AATC, AEIS, AFT, AIF, AOMR, ATO, BGH, DLX, FGB, FHB, FMN, GAIN, GLAD, GOOD, GSL, HL, HVT, HVT.A, IGIC, JBT, LAND, LTC, MFD, NATH, NCMI, NLOK, OGN, R, RDN, TIPT, TSCO, UGP, UPS\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.3K)\n    - CFTC Copper speculative net positions (previous: 29.0K)\n    - CFTC Corn speculative net positions (previous: 321.6K)\n    - CFTC Crude Oil speculative net positions (previous: 400.4K)\n    - CFTC Gold speculative net positions (previous: 168.4K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -13.3K)\n    - CFTC Natural Gas speculative net positions (previous: -143.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 23.1K)\n    - CFTC Silver speculative net positions (previous: 24.5K)\n    - CFTC Soybeans speculative net positions (previous: 122.4K)\n    - CFTC Wheat speculative net positions (previous: 43.6K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 387)\n    - U.S. Baker Hughes Total Rig Count (previous: 491)\n\n^^^^2021-08-17",
        "created_utc": 1629194413,
        "id": "h99s9at",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1629223213.0
    },
    {
        "author": "Nandredor",
        "body": "One time for most. I re upped on csco twice. Should have invested more in all of them but I’m dumb",
        "created_utc": 1629565735,
        "id": "h9t49sg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629594535.0
    },
    {
        "author": "FuckTheUnvaccinated",
        "body": "&gt;\tFor nvda to be overvalued you are saying they will not maintain there growth rate. Doubt it.\n\nThis is exactly what investors were saying about csco and intel…\n\nThey had conviction in the rise of the internet and they were right, but stock prices still tanked…",
        "created_utc": 1629910581,
        "id": "habaa98",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629939381.0
    },
    {
        "author": "AnalbolicHazelnut",
        "body": "I really like the VGT pick. Let's have a look at the top 10 holdings of the fund that account for 57.4%.\n \n1 Apple 19.58%\n\n2 Microsoft 16.53%\n\n3 Nvidia 4.22%\n\n4 Visa 3.16%\n\n5 Mastercard 2.76%\n\n6 Paypal 2.76%\n\n7 Adobe 2.39%\n\n8 Intel 1.94%\n\n9 Salesforce 1.91%\n\n10 Cisco 1.90%\n\nThere is some hardware in there but most of the revenue on that list comes from software by subscription and that is with out a doubt the best business model of all time. It's almost cheating. Those are almost comming a part of the infastructure, with the margins that it brings when the company has matured. Those are all great companies to own.\n\nWith that beeing said, you are paying a premium for those companies right now. Now, ofcourse that is the case with most of the top holdings in any ETF, but big and mega cap tech are in my opinion due for a _mild_ correction that won't stay long. Or at the very least,  a slower climb moving forwards. \n\nIf this is a decent amount that you are going to be investing, I recommend that you start of with at least half in a lump sum and then periodecly re-invest the next 24 months. Or 12. Or at least 6. I think you should make the innitial more VTI heavy and aventually end it in the 70-30. \n\nOr don't. This might be overthinking it wich is not really in tune with your tech heavy bogglehead approuch. I would add in a little VOO but I still like your picks. In the end, it properbly doesn't matter.",
        "created_utc": 1629840481,
        "id": "ha7oucp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629869281.0
    },
    {
        "author": "BigBrianBrand",
        "body": "I had a feeling Cisco and the dot com crash was going to get brought up. It's a popular forced bear narrative on this sub for any tech company. You could have said this same thing during the August 2015 and December 2018 crashes, because the market is somehow always in a bubble.\n\nAnd honestly, you are showing your lack of knowledge trying to compare an IT company in a less established industry at the time that had dealt with interest rates at 5.5%, versus a digital advertising company that has 91% global market share in a near-zero interest rate environment.\n\nGoogle brings in $80B in Operating Income on a $1.8T Market Cap.\n\n'00 Cisco's financials are not even remotely comparable. They had only $20B in revenue on a $550B market cap.\n\nAs for cyclicality, there are always market corrections every so often. Let me know when marketing has a 10-year decline.\n\nPlease please please actually study up on the dot com crash and Microsoft/Cisco/Dell/Intel before trying to start comparing them to FAAMG on a stock forum.",
        "created_utc": 1629777539,
        "id": "ha4en5b",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1629806339.0
    },
    {
        "author": "xReD-BaRoNx",
        "body": "Upvote for the CSCO mention. It’s had a good run this year.",
        "created_utc": 1629733768,
        "id": "ha1mee6",
        "score": 1,
        "subreddit": "options",
        "created": 1629762568.0
    },
    {
        "author": "Dadd_io",
        "body": "Cisco, Intel, and Oracle were all dot-com darlings with large revenue and growth trajectories and PEs similar to Nvidia.  It wasn't all Webvan and pets.com (which by the way are basically Instacart and chewy. com all over again).",
        "created_utc": 1629748144,
        "id": "ha2lglk",
        "score": 1,
        "subreddit": "investing",
        "created": 1629776944.0
    },
    {
        "author": "Dadd_io",
        "body": "Just like Cisco, Oracle, and Intel back in 2000.  Still all good to great companies but only Oracle has caught its 2000 valuation, and it only caught it in this new bubble. I've looked extensively at valuations back then and in fact cashed out thousands of options then in one of those highly overvalued companies.  This will end similarly.",
        "created_utc": 1629747160,
        "id": "ha2j1ye",
        "score": 1,
        "subreddit": "investing",
        "created": 1629775960.0
    },
    {
        "author": "cloud7up",
        "body": "Not Sysco, Cisco.",
        "created_utc": 1627952637,
        "id": "h7hxzlh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627981437.0
    },
    {
        "author": "edgestander",
        "body": "I’m gonna assume you were not investing during the dot com boom? The tech giants then were printing money too.  Oracle, Cisco, MSFT, Sun, Intel, Lucent, Nokia, were “printing money”.  Personally having been invested in both, there is more irrationality in this market today, IMHO.",
        "created_utc": 1627849705,
        "id": "h7cojxc",
        "score": 1,
        "subreddit": "investing",
        "created": 1627878505.0
    },
    {
        "author": "iopeneverydoor",
        "body": "It's best to diversify. Buy the entire market. SPY or VTI or their mutual fund counterparts. 20 years ago-well, 20 years ago, there was a massive  dot com crash. MSFT's stock dived and didn't recover to its like 1999 price for 16 years. Cisco did horrible as well. Not bad companies, but for someone who had everything in MSFT that was a long 16 years. S&amp;P 500 recovered much faster.",
        "created_utc": 1627873482,
        "id": "h7dymep",
        "score": 1,
        "subreddit": "investing",
        "created": 1627902282.0
    },
    {
        "author": "flatirony",
        "body": "Thanks for the well written post.   I disagree with it but I’m happy to have the discussion.  \n\nFirst of all I should clarify that I am an infrastructure engineer for an internet company.  Not one of the biggest ones, but one you’ve heard of.   So\none way that I follow the advice in your username is not to put all of my eggs in one basket by also investing heavily in tech.\n\nOn valuations, that was my ballpark estimate for big Tech.  I looked the numbers up just now and feel really good about them.   Here are the forward/trailing P/E’s for these companies:\n\nAMZN   59/58\nAAPL    26/29\nGOOG  30/31\nMSFT   32/36\nFB         28/26\nNFLX    50/54\n\nThis averages to 38, without even including smaller and less mature growth tech.  Much less Tesla.\n\nAnd I personally believe that those P/E’s are based on optimistically flawed macro assumptions, for reasons OP touched on.  \n\nI understand that P/E isn’t the only measure of value and can even be a dangerous one (clearly $ZIM’s 2021 P/E of under 2 is not sustainable).\n\nBut it pretty much boils down to what you’re paying for a combination of sustainable earnings and growth potential.\n\nI know these are considered the best and most revolutionary businesses ever.  But I also know that the same thing has been said about most of the biggest businesses in history.  It was definitely said of Cisco in 1999, but also of IBM and GE and GM and Standard Oil and the Pennsylvania Railroad.  I majored in the history of technology, I’ve always been interested in this phenomenon.\n\nThis week I have been reading David McCullough’s history of the Panama Canal.   \n\nThe French Suez and Panama Canal companies were each by far the biggest IPO’s in history. The same guy, Ferdinand de Lesseps, was the CEO both times.  The Suez was a legendary success, the Panama an abject failure.  A total loss for shareholders, who were still much better off than the perhaps 20,000 employees who died of malaria and yellow fever. \n\nThe French capital raises for the Panama Canal project in the 1880’s remind me a great deal of recent going’s on\n\nWe especially hear how it’s different this time late in each business cycle.  And we are very late in this cycle.  I believe we are in the 12th year of it, from the stock market POV, because 2020 only produced a tiny blip and it was off to the races again.\n\n$SPX has returned over 18% CAGR since the 2009 bottom.  The highest ever *rolling* 10 year nominal return is about 20%, and that was in a little higher inflation regime than we had in the 2010’s, along with much higher interest rates.  Thus I would posit that overall in the last 12 years we have seen the highest 10-year equity risk premium in history.  And roughly tied for the highest ever real returns.\n\nAnd that’s using $SPX.  The Nasdaq 100 has been considerably better.  Meanwhile small caps are much more overvalued than big tech, with a higher P/E ratio.  A fair number of straight up zombies litter $IWM.\n\nI could go on for hours honestly.  It seems obvious to me that the overall US stock market must mean-revert, at least in real terms.\n\nMeanwhile I expect commodities, which reached historic relative lows in early 2020, to eventually continue\nto mean-revert the other way as they have generally been doing since late 2020.\n\nI don’t know when it will happen.  This bubble is nothing compared to Japan in 1990.  I try to find investments that will do well regardless, and",
        "created_utc": 1628222317,
        "id": "h7w9op8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628251117.0
    },
    {
        "author": "Zranza",
        "body": "You sound just like my old fashioned value investing uncle who didn’t invest in Microsoft Starbucks Facebook Apple Nike Amazon and Netflix back in 2012. Instead he bought Cisco Verizon and Intel like I assume you do. Too funny, I’ve seen this movie so many times. \n\nGL boomer",
        "created_utc": 1628365073,
        "id": "h8381uc",
        "score": 1,
        "subreddit": "investing",
        "created": 1628393873.0
    },
    {
        "author": "BJJblue34",
        "body": "Apple currently has its highest PE ratio in its history. So, the company never traded at &gt;50x. ComparingTesla to Apple for growing into high PEs doesn't make sense. Amazon is an exception. It has at times had a PE of &gt;1000x. However, for every Amazon with a large PE you have a Intel or Cisco that have still not surpassed their 2000 price high. That doesn't even mention all the companies that eventually failed. My take is Tesla is a good company but current valuations don't make sense.",
        "created_utc": 1629332634,
        "id": "h9h1qk6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629361434.0
    },
    {
        "author": "JungAndReckless6",
        "body": "Mainly that cloud native products offer significantly more optionality than anything Cisco ever offered, considerably higher margins, and that Cisco got way ahead of itself in the dot com bubble without the secular shift to technology that we’ve seen in the last 10 years. \n\nPlus, management in many of these large cap tech companies are often the same type of wacky visionaries that I love to see in leadership. I don’t necessarily advocate buying something like NET or CRWD at these prices, and significant returns might take several years, but strong management and a fantastic product with a secular shift behind it is the way I like to invest. Hell, if you value most of these companies on an EV/GP basis and take into account their growth and major trends in the world I’d argue that they’re cheaper than many value stocks.\n\nThere will absolutely be rotations into and out of tech though, but I don’t try to time anything.",
        "created_utc": 1629334464,
        "id": "h9h5nd7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629363264.0
    },
    {
        "author": "Awesome____Sauce",
        "body": "buy puts on csco for ER, get bitches, ???",
        "created_utc": 1629312343,
        "id": "h9ftk0p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629341143.0
    },
    {
        "author": "Awesome____Sauce",
        "body": "my $csco itm money puts looking good so far (dont want to jinx it), may help me offset my losses",
        "created_utc": 1629317481,
        "id": "h9g502l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629346281.0
    },
    {
        "author": "sockalicious",
        "body": "I figured, CSCO never does more than a tiny beat, even if it does the market's due to take a shit, so I bought a 55/50.5p vertical.   Managed to pick the only company in the entire average that went up 5% today.  Annoying to be right, right and so wrong.",
        "created_utc": 1629412633,
        "id": "h9lapv8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629441433.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 16th of August\n\n\n\n## Upcoming events for Monday, August 16th\n\n - Stock splits:\n\n    - URVNF @ **1:10**\n\n - Expected earnings:\n\n  ACRX, ACTG, ADMP, AESE, AIV, AKU, ALAC, AREC, ARKR, ATAI, ATCX, AYTU, BHP, BIOC, BITF, BKYI, BLDE, BLIN, BPT, BRCN, CBAT, CBLI, CHCI, CIH, CLSK, CNSP, COMS, CREX, CRKN, CRT, CRTD, CTEK, CTK, CVV, CYRN, DLPN, DNMR, DOYU, DPW, DRIO, DTST, EDR, ELYS, ETON, EVLV, FBIO, FBRX, FENG, FN, FTRP, FUV, GALT, GAN, GBRG, GERN, GLBE, GNOG, GOEV, GVP, GWGH, HHR, HIPO, IDEX, IKT, IMMR, IMPL, INPX, INVO, ISUN, JAN, JOB, JOBS, KBNT, KNTE, LIQT, LIVE, LMNL, LOV, LRFC, LUB, MBII, MBIO, MICT, MINM, MITC, MLSS, MMAT, MNTK, MVO, NAT, NES, NIU, NKSH, NMRD, NRXP, NVGS, NYMX, OBCI, OEG, OMEX, ONDS, OSMT, OTLY, OVID, OXBR, PBT, PHGE, PLAG, PLX, PME, POWW, PRCH, PSFE, PTPI, PYR, QRHC, QSI, RAIL, RBLX, REKR, RIOT, RKDA, RMED, RMO, RMTI, SACH, SBS, SCOB, SCYX, SGBX, SJT, SLHG, SMFR, SMTI, SNAX, SRAX, SSKN, SSL, STAF, STRS, SUMR, SUNL, SVVC, SWKH, TBLT, TENX, TLGT, TLK, TLS, TME, TOMZ, TSHA, TSRI, UAVS, UCL, USAS, UWMC, VBLT, VEI, VERB, VET, VISL, VOC, VYNT, WF, WILC, WYY, XSPA, YOU, ZEV, ZH\n\n - Ex-div:\n\n  AMGN, APAM, CORR, DYFN, ETH, FINS, GDV, GNK, GNT, GPRK, GUT, GWRS, HNNA, HP, ITUB, IVH, JRSH, LNN, MCFE, NHTC, NVO, OPP, OXLC, OXSQ, PACW, PGZ, PTMN, REYN, RFM, RFMZ, RGA, RIV, RMAX, RMI, RMM, RSF, SBRA, SCU, SMM, SOR, SPOK, SWKS, XFLT\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.050%)\n    - 6-Month Bill Auction (previous: 0.050%)\n    - Investing.com Gold Index (actual: 51.2%, previous: 59.4%)\n    - Investing.com S&amp;P 500 Index (actual: 43.3%, previous: 46.6%)\n    - NY Empire State Manufacturing Index (consensus: 29.00, previous: 43.00)\n    - Overall Net Capital Flow (previous: 105.30B)\n    - TIC Net Long-Term Transactions (previous: -30.2B)\n    - TIC Net Long-Term Transactions including Swaps (previous: -63.60B)\n    - US Foreign Buying, T-bonds (previous: -93.40B)\n\n## Upcoming events for Tuesday, August 17th\n\n - Stock splits:\n\n    - PTSI @ **2:1** (Payable date: 08/16/2021)\n\n - Expected earnings:\n\n  A, ACXP, AENZ, AFMD, AIT, ALC, AMCR, AUVI, BBIG, BBL, BDL, BEST, BON, BTCM, BYFC, CDK, CHSCP, CMCM, COGT, CREE, CRESY, CRMT, CVM, CWCO, DNUT, ECC, FLNG, FORTY, FURY, GDS, GNPX, GOGL, GRCL, GRUB, HCDI, HD, HUYA, INST, JAX, JKHY, LX, LZB, MNDY, NETI, NOAH, NRBO, NVIV, OB, ONE, OZON, PINC, PRAX, QUIK, REE, RERE, RHE, RVPH, SA, SE, SFL, SOLY, SRNE, STNE, SVFD, THCA, TIGR, VTEX, WHLR, WMT\n\n - Ex-div:\n\n  ADM, ADX, AFL, AGO, AMAL, AMOT, BKH, CRD.A, CRD.B, CSL, CXE, CXH, DMB, ED, EQIX, ESXB, FDP, FMBH, FOF, GGB, HRZN, ICL, JACK, L, LDP, MCR, MIN, MMT, MPC, MRO, ORA, PBR, PBR.A, PCAR, PEO, PFLT, PHI, POWL, PSF, PSX, PTA, RNP, RQI, SEM, SGC, SHYF, SSSS, SXC, TGT, UTF, VMC\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -0.816M)\n    - Business Inventories (consensus: 0.8%, previous: 0.5%)\n    - Capacity Utilization Rate (consensus: 75.7%, previous: 75.4%)\n    - Core Retail Sales (consensus: 0.2%, previous: 1.3%)\n    - Fed Chair Powell Speaks\n    - Industrial Production (consensus: 0.5%, previous: 0.4%)\n    - Industrial Production (previous: 9.80%)\n    - MBA Delinquency Rates (previous: 6.38%)\n    - Manufacturing Production (consensus: 0.6%, previous: -0.1%)\n    - NAHB Housing Market Index (consensus: 80, previous: 80)\n    - Redbook (previous: 16.2%)\n    - Retail Control (consensus: 0.1%, previous: 1.1%)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Retail Sales (consensus: -0.2%, previous: 0.6%)\n    - Retail Sales (previous: 17.98%)\n    - Retail Sales Ex Gas/Autos (previous: 1.1%)\n\n## Upcoming events for Wednesday, August 18th\n\n - Expected earnings:\n\n  ADI, AIHS, APOP, BBQ, BBWI, BLRX, CAAP, CSAN, CSCO, CTIB, DLO, DQ, EAT, EBR, EBR.B, ELTK, GHSI, GRIL, GRIN, HEPA, HGSH, HOOD, IMNM, INDP, JBSS, KEYS, KLTR, LITB, LITE, LOW, MBT, METX, NAOV, NCNA, NNDM, NVDA, OSIS, PLCE, PNRG, PTNR, RRGB, SFL, SINT, SMED, SNPS, SONM, SPTN, SQM, STG, TGT, TJX, TUYA, UAMY, UUU, VINP, VIPS, VNET, VSCO, WB, WLMS, YY, ZIM, ZTO\n\n - Ex-div:\n\n  ADTN, APO, AVA, BG, BWXT, CLPR, CVX, DFS, DHT, GFF, HE, HTBI, LFUS, MAC, MAV, MHI, MSFT, NLSN, NRP, PHD, PHT, RMD, SBSI, SUNS, SWCH, VCIF, WD\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.890%)\n    - Building Permits (consensus: 1.610M, previous: 1.594M)\n    - Building Permits (previous: -5.3%)\n    - Crude Oil Imports (previous: -0.796M)\n    - Crude Oil Inventories (previous: -0.447M)\n    - Cushing Crude Oil Inventories (previous: -0.325M)\n    - Distillate Fuel Production (previous: 0.008M)\n    - EIA Refinery Crude Runs  (previous: 0.277M)\n    - EIA Weekly Distillates Stocks (previous: 1.766M)\n    - EIA Weekly Refinery Utilization Rates (previous: 0.5%)\n    - FOMC Meeting Minutes\n    - Gasoline Inventories (previous: -1.400M)\n    - Gasoline Production (previous: -0.190M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Housing Starts (consensus: 1.602M, previous: 1.643M)\n    - Housing Starts (previous: 6.3%)\n    - MBA 30-Year Mortgage Rate (previous: 2.99%)\n    - MBA Mortgage Applications (previous: 2.8%)\n    - MBA Purchase Index (previous: 252.0)\n    - Mortgage Market Index (previous: 754.8)\n    - Mortgage Refinance Index (previous: 3,684.3)\n\n## Upcoming events for Thursday, August 19th\n\n - Expected earnings:\n\n  AG, AMAT, ARCE, ARDX, ATGE, BFRA, BILI, BJ, BLND, BLRX, BTBT, BVXV, BZUN, CATO, COCP, DESP, EL, ELOX, ENTX, EPIX, FEDU, FLGC, FRSX, FTCH, GSMG, HMLP, HUIZ, ISIG, KOSS, KSS, LFVN, LORL, LVTX, LYTS, M, MNSO, MSGS, NM, NNA, NUZE, PAQC, PAX, PDEX, PFGC, QFIN, QIWI, ROST, SJ, SLDB, SPRT, STVN, SUPV, TPR, TUEM, VEON, VQS, WOOF, WVFC, YRD, ZEPP\n\n - Ex-div:\n\n  ACP, AGD, AKO.A, AKO.B, AOD, ARDC, ASGI, AWP, BBSI, BBWI, CBFV, CCOI, CGNX, CMI, CORE, CTSH, DEX, EVRG, FDBC, FSS, FWRD, GSK, HCI, HCSG, HMPT, HNI, HSBC, HSY, IBOC, IEP, IGR, MCHP, MCO, MGPI, MGU, MIXT, MNRL, MTRN, MTX, NMRK, OBNK, OTIS, PBI, PCF, PCSB, PFC, PRI, PUK, RPRX, RTX, RXN, SBLK, SNA, SWM, TEL, THQ, THW, TKR, TTEK, UMPQ, USLM, USPH, WBA\n\n - Economic events and announcements:\n\n    - 30-Year TIPS Auction (previous: -0.040%)\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.055%)\n    - Continuing Jobless Claims (consensus: 2,800K, previous: 2,866K)\n    - Initial Jobless Claims (consensus: 360K, previous: 375K)\n    - Jobless Claims 4-Week Avg. (previous: 396.25K)\n    - Natural Gas Storage (consensus: 49B, previous: 49B)\n    - Philadelphia Fed Manufacturing Index (consensus: 25.0, previous: 21.9)\n    - Philly Fed Business Conditions (previous: 48.6)\n    - Philly Fed CAPEX Index (previous: 41.20)\n    - Philly Fed Employment (previous: 29.2)\n    - Philly Fed New Orders (previous: 17.0)\n    - Philly Fed Prices Paid (previous: 69.70)\n    - US Leading Index (consensus: 0.8%, previous: 0.7%)\n\n^^^^2021-08-16",
        "created_utc": 1629108013,
        "id": "h95092i",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1629136813.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  4th of August\n\n\n\n## Upcoming events for Wednesday, August  4th\n\n - Expected earnings:\n\n  AAU, ABC, ABIO, AC, ACA, ACAD, ACEL, ACIU, ACLS, ACR, ADMA, ADPT, ADT, ADTN, AEIS, AERI, AFIN, AGL, AIRI, ALB, ALE, ALG, ALIM, ALKT, ALL, ALLO, ALNA, ALRN, ALTM, AMED, AMOT, AMPE, AMPY, AMSC, ANGI, ANSS, APA, APO, ARLO, ARTNA, ASMB, ASTE, ASYS, ATO, ATRC, ATTO, AVA, AXGN, BAK, BBSI, BCLI, BCOR, BCSF, BCYC, BDC, BDSI, BE, BFAM, BGCP, BKNG, BKTI, BLPH, BLUE, BNGO, BOOT, BRSP, BTG, BVH, BWA, CAMT, CCMP, CCRN, CCU, CDAY, CDW, CENT, CENTA, CENX, CFMS, CHNG, CIA, CIB, CIGI, CIM, CKPT, CLH, CLVS, CLW, CMLS, CMP, CPA, CPK, CPS, CRL, CRTO, CSGS, CSII, CSTE, CSWI, CUTR, CVGI, CVRX, CVS, CYAD, DCP, DFIN, DGII, DHC, DLHC, DMTK, DNOW, DOC, DOX, DRTT, DVAX, DXC, EA, ECPG, EDIT, EDRY, EGHT, ELA, ELF, EMKR, EMR, ENBL, EOG, EOLS, EQH, EQX, ERJ, ERO, ETR, ETSY, EVH, EVOP, EVRI, EXC, EXPI, EYPT, FATE, FCPT, FDP, FENC, FLMN, FLOW, FLT, FLXN, FOX, FOXA, FPI, FRGI, FRT, FSLY, FTDR, FUN, FVE, GDDY, GEL, GEO, GGB, GHC, GLBZ, GM, GMED, GNK, GPRK, GRP.U, GRTS, GTHX, HARP, HBB, HCC, HDSN, HFC, HHC, HI, HMC, HNGR, HR, HRTX, HUBS, HWM, HYMC, HZNP, IAC, IAG, ICD, ICUI, IIPR, IMXI, INGN, INMB, INSG, IO, IONS, ISEE, ISSC, IVC, IVR, JACK, JLL, JRVR, KBAL, KE, KHC, KIN, KLIC, KRO, KRTX, KUKE, KW, KZR, LAND, LESL, LHCG, LILA, LILAK, LL, LMND, LMRK, LNC, LPG, LPI, LUMN, MAC, MASS, MAXR, MBI, MCK, MCS, MDU, MED, MELI, MET, MFC, MGLN, MGM, MGPI, MIDD, MLR, MLVF, MNKD, MNRL, MNTV, MOD, MPC, MPLX, MRO, MTG, MTOR, MVIS, MWA, NC, NEPH, NESR, NEX, NHTC, NI, NL, NMFC, NODK, NP, NSPR, NSTG, NTEC, NUS, NVRO, NWPX, NXST, NYT, OCDX, ODP, OESX, ONEM, OPRX, OR, ORA, ORCC, ORIC, OSPN, OTIC, OYST, PACE, PARR, PCSA, PDCE, PETQ, PFLT, PING, PIRS, PLMR, PLTK, PLUS, PLYA, PNNT, PROF, PSN, PSNL, PTVE, PW, QNST, QRVO, QTWO, RCII, RCKT, RCL, REGI, RGR, RKT, RMAX, RMNI, RNWK, ROKU, RPD, RPT, RTLR, RVI, RVLV, RYI, RYN, SAFT, SALM, SANA, SBGI, SBOW, SBRA, SCU, SD, SENEA, SENEB, SGRY, SGU, SITE, SITM, SJI, SLF, SLGL, SLNG, SMG, SMP, SMSI, SPNS, SPR, SRDX, SRI, SRPT, SSRM, SSSS, STAA, STN, SUM, SUP, SUPN, SWM, TELL, TGB, TGI, TLC, TNDM, TPC, TPVG, TRC, TREC, TRMB, TRNO, TS, TSE, TT, TTGT, TUP, TVTY, TWNK, TWO, TXG, TXMD, UBER, UE, UFCS, UFI, UGI, UHAL, UIHC, ULCC, UMH, UPLD, URG, URGN, USDP, USWS, UTHR, UVV, VCEL, VIRT, VMC, VRCA, VRDN, VTOL, VVV, VWTR, VZIO, WCN, WDC, WLFC, WLL, WTS, WU, WYNN, XNCR, XPL, YELL, ZYME\n\n - Ex-div:\n\n  AWI, CATC, CCK, DKL, FELE, IBTX, IDA, KBH, MATX, NEP, NWBI, OFED, OPBK, SIMO, STBA, TGP, VBTX, VLO, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 695K, previous: 692K)\n    - Crude Oil Imports (previous: -0.616M)\n    - Crude Oil Inventories (consensus: -3.102M, previous: -4.089M)\n    - Cushing Crude Oil Inventories (previous: -1.268M)\n    - Distillate Fuel Production (previous: -0.163M)\n    - EIA Refinery Crude Runs  (previous: -0.132M)\n    - EIA Weekly Distillates Stocks (consensus: -0.543M, previous: -3.088M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: -0.3%)\n    - FOMC Member Clarida Speaks\n    - Gasoline Inventories (consensus: -1.780M, previous: -2.253M)\n    - Gasoline Production (previous: 0.649M)\n    - Heating Oil Stockpiles (previous: 0.108M)\n    - ISM Non-Manufacturing Business Activity (consensus: 60.6, previous: 60.4)\n    - ISM Non-Manufacturing Employment (previous: 49.3)\n    - ISM Non-Manufacturing New Orders (previous: 62.1)\n    - ISM Non-Manufacturing PMI (consensus: 60.5, previous: 60.1)\n    - ISM Non-Manufacturing Prices (previous: 79.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.01%)\n    - MBA Mortgage Applications (previous: 5.7%)\n    - MBA Purchase Index (previous: 251.7)\n    - Markit Composite PMI (consensus: 59.7, previous: 63.7)\n    - Mortgage Market Index (previous: 737.9)\n    - Mortgage Refinance Index (previous: 3,570.4)\n    - Services PMI (consensus: 59.8, previous: 64.6)\n\n## Upcoming events for Thursday, August  5th\n\n - Expected earnings:\n\n  AAOI, AAON, AAWW, ABMD, ABUS, ACET, ACHV, ACIW, ACMR, ACOR, ADMS, ADNT, ADXN, AE, AEE, AEL, AES, AEZS, AFCG, AG, AGM, AGO, AGS, AHCO, AIG, AIKI, AINV, AJX, AKBA, AL, ALBO, ALCO, ALDX, ALGS, ALRM, ALTR, AMBC, AMEH, AMH, AMN, AMRN, AMRS, AMYT, ANIK, APDN, APLE, APPN, APR, APTV, AQB, ARD, ARDX, ARNA, ARW, ARWR, ASRT, ASXC, ATAX, ATH, ATNX, ATRI, ATRS, ATSG, AUMN, AUPH, AUTL, AUTO, AVD, AVEO, AVLR, AVRO, AVXL, AXDX, AXNX, AXON, BAND, BANX, BBGI, BCE, BCH, BCRX, BDX, BECN, BEP, BERY, BFS, BGNE, BGS, BGSF, BHF, BIGC, BIP, BKCC, BKD, BKI, BL, BLCM, BLDP, BLDR, BLFS, BLL, BLRX, BPMP, BRBR, BRG, BRKS, BRT, BSGM, BTBT, BV, BWMX, BXRX, BYND, CABA, CAH, CAI, CALA, CAPR, CARG, CARS, CBIO, CCOI, CDAK, CDXS, CELH, CEMI, CERT, CFLT, CGNX, CHEK, CHH, CHRS, CHUY, CI, CIO, CKX, CLBS, CLDX, CLLS, CLNE, CLXT, CMRX, CNCE, CNDT, CNNE, CNP, CNQ, CNXN, COCP, COLD, COLL, COMM, CORE, CPLG, CQP, CRAI, CRBP, CRC, CSOD, CTIC, CTMX, CTOS, CTRE, CTT, CTVA, CVCO, CVET, CVNA, CWK, CYRX, CYTK, CZNC, DBRG, DBX, DDOG, DEN, DHX, DIN, DIOD, DLA, DLX, DMLP, DMRC, DNN, DOCN, DRH, DRNA, DUK, DWSN, DXPE, DXYN, DYN, EB, ECOM, ECOR, ED, EFC, EGLE, EIGR, ELOX, ELY, ELYS, ENDP, ENG, ENSV, ENTA, ENV, EPAM, EPC, EPIX, ERF, ERII, ESCA, ESTE, ETTX, EVC, EVOK, EVRG, EXEL, EXPE, EYEG, FAT, FCRD, FDUS, FEYE, FLDM, FLS, FND, FNKO, FOCS, FOLD, FOUR, FOXF, FPH, FROG, FSR, FTSI, FVRR, G, GBNH, GCP, GDEN, GDP, GDYN, GENC, GEOS, GERN, GH, GIL, GKOS, GLMD, GLPG, GLYC, GNE, GNL, GOGO, GOLF, GPL, GPOR, GPRO, GRPN, GSAT, GSBD, GSL, GTH, GTN, GTN.A, GTS, GTYH, HASI, HBI, HBIO, HCAT, HCI, HEAR, HII, HIMX, HL, HMHC, HNNA, HRTG, HTA, IBOC, IBP, ICAD, IDCC, IESC, IFF, IFRX, IGMS, IHC, IHRT, ILMN, IMH, IMKTA, ING, INOD, INS, INSM, IOVA, IRM, IRTC, IRWD, ISDR, ISIG, ITI, ITRI, ITRM, ITT, JCOM, JNCE, JYNT, K, KALA, KAMN, KDMN, KIDS, KPTI, KRP, KTB, KURA, KYMR, LAMR, LASR, LAUR, LAZY, LCTX, LCUT, LEE, LGF.A, LGF.B, LJPC, LNG, LNSR, LNT, LOCO, LOPE, LORL, LPCN, LQDT, LSPD, LTHM, LUMO, LXP, MAIN, MCHX, MDGL, MDRX, MDWD, MFA, MGEE, MGNI, MGTA, MGTX, MIRM, MITO, MKTY, MLAB, MMS, MNPR, MNST, MOSY, MP, MPLN, MRNA, MRNS, MRTX, MRUS, MSI, MTBC, MTEM, MTW, MTZ, MUR, MUX, MX, MXC, MYE, NATR, NBRV, NBY, NET, NEXT, NFE, NFG, NGVC, NH, NHC, NICE, NINE, NJR, NKTR, NNA, NNBR, NNI, NOG, NOMD, NRG, NS, NSIT, NTLA, NTRA, NTUS, NUZE, NVAX, NVMI, NVO, NWN, NWS, NWSA, NXTC, NYMT, OBSV, OCN, OCSL, OEC, OGE, OLED, OLP, OM, ONCT, ONTO, OPNT, OPRT, ORBC, ORTX, OTEX, OTRK, OUT, PAE, PALT, PASG, PBA, PBH, PBPB, PBYI, PCOR, PCSB, PCTY, PDEX, PECO, PEI, PENN, PFBI, PFIE, PFSI, PGNY, PH, PHAT, PHI, PHX, PK, PLM, PLUG, PMT, PNW, PODD, POST, PPL, PRA, PRAA, PRDO, PRI, PRMW, PRQR, PRTA, PRTS, PRTY, PRVB, PTGX, PTMN, PWFL, PWR, PZZA, QDEL, QTNT, QTRX, QUOT, RAMP, RBA, RC, RCUS, RDFN, RDUS, REFR, REG, REGN, REV, REZI, RGNX, RLJ, RMD, RMR, ROLL, RSLS, RUN, RVNC, SAND, SBBP, SBLK, SEAS, SELB, SEM, SFM, SGA, SGMO, SHAK, SHYF, SIF, SIGA, SKM, SLDB, SLRX, SMHI, SNEX, SPCE, SPH, SPKE, SPNT, SPRO, SPRT, SPXC, SR, SRE, SRG, SRLP, SRRA, SRTS, SSYS, STFC, STMP, STNG, STOR, STRO, STRT, STWD, SVC, SVM, SVRA, SWCH, SWIM, SWX, SYBX, SYN, SYNA, SYRS, TAL, TBIO, TCX, TDC, TDS, TDW, TECH, TEN, TG, TGH, TGP, THR, THS, TIPT, TK, TM, TMCI, TMDX, TMST, TMX, TNK, TPIC, TPL, TRGP, TRHC, TRI, TRIN, TRIP, TRUE, TRUP, TSP, TTOO, TTSH, TUEM, UEIC, UNIT, UONE, UONEK, USM, USPH, VCTR, VEL, VEON, VER, VG, VGR, VHI, VIAC, VIACA, VIR, VLDR, VMEO, VOR, VOYA, VRAY, VRNA, VRRM, VSAT, VST, VVI, VXRT, W, WCC, WD, WFCF, WLDN, WMS, WOW, WPRT, WRK, WSC, WSTG, WTRG, WTRH, WVE, WVFC, WWR, XEC, XENE, XERS, XLRN, XOMA, XRAY, XTNT, XXII, Y, YELP, YETI, YMAB, YMTX, YORW, Z, ZEUS, ZG, ZGNX, ZIXI, ZNGA, ZSAN, ZTS\n\n - Ex-div:\n\n  AFB, AMG, ARLP, BKEP, BSBR, CADE, CEQP, CFFN, CMCO, CMS, CVCY, ET, FCF, FE, FHI, FRAF, FRBA, GPP, HMLP, HSII, HWM, IBCP, INTC, LBC, LSBK, LW, MMLP, MMP, MPLX, NYCB, OMF, PCB, PCTI, PETS, PKOH, PNFP, PNM, PPBI, RELX, SIRI, SMBK, SUN, UL, WAFD, WFC, WHG\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.045%)\n    - Challenger Job Cuts (previous: 20.476K)\n    - Continuing Jobless Claims (consensus: 3,260K, previous: 3,269K)\n    - Exports (previous: 204.99B)\n    - Fed Waller Speaks\n    - Imports (previous: 273.89B)\n    - Initial Jobless Claims (consensus: 384K, previous: 400K)\n    - Jobless Claims 4-Week Avg. (previous: 394.50K)\n    - Natural Gas Storage (previous: 36B)\n    - Trade Balance (consensus: -74.10B, previous: -71.20B)\n\n^^^^2021-08-04",
        "created_utc": 1628071224,
        "id": "h7ns60v",
        "score": 3,
        "subreddit": "RobinHood",
        "created": 1628100024.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  3rd of August\n\n\n\n## Upcoming events for Tuesday, August  3rd\n\n - Expected earnings:\n\n  ACOR, ADCT, AENZ, AFG, AHH, AIZ, AKAM, ALNY, ALTO, AME, AMGN, ANDE, ANIX, APAM, APEN, APRN, APT, APTO, AQST, AQUA, ARC, ARNC, ARVN, ATEC, ATI, ATKR, ATOM, ATVI, AVID, AVNS, AY, AYX, BABA, BEN, BGFV, BHC, BHG, BKEP, BKH, BLD, BLKB, BNFT, BNL, BP, BRY, BXC, BYFC, CAR, CDEV, CDLX, CDXC, CECE, CEIX, CERS, CFBK, CGBD, CHCT, CHSCP, CIX, CLDT, CLSK, CLX, CMI, CNR, COHR, COP, COUR, CPE, CPSI, CPSS, CRD.A, CRD.B, CRIS, CRK, CRNC, CRSR, CRVL, CSLT, CTSO, CW, CWEN, CWEN.A, CWH, CZR, DCPH, DD, DEA, DEI, DENN, DISCA, DISCB, DISCK, DK, DKL, DNB, DS, DSKE, DSX, DVA, DVN, EC, EDU, ELVT, ENLC, EPZM, ESPR, ET, ETN, ETRN, EVTC, EXPD, EZPW, FCNCA, FI, FICO, FIS, FMC, FNF, FNHC, FOE, FRG, FSP, FSTR, GBL, GBT, GDOT, GECC, GHL, GIC, GLDD, GLRE, GLT, GLTO, GMRE, GNW, GRBK, GTE, H, HEES, HEP, HLF, HLI, HLNE, HPP, HSC, HSIC, HSKA, HST, HY, HZN, IAA, ICFI, ICHR, IDN, IDRA, IGT, INCY, INFN, INGR, INN, INSP, INVE, IOSP, IPGP, IT, ITIC, IX, J, JAX, JAZZ, JBGS, KAI, KAR, KFRC, KKR, KLDO, KNSA, KOPN, KTOS, KWR, LCII, LDI, LDOS, LEU, LGIH, LHX, LIND, LLY, LPG, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, LYV, MANT, MAR, MCHP, MCRB, MCY, MDNA, MDXG, MEC, MGRC, MGY, MIC, MIME, MKL, MNOV, MNR, MNTX, MRCC, MRCY, MTCH, MTRN, MUFG, MYGN, NBIX, NCR, NCSM, NDLS, NE, NEWR, NKLA, NMIH, NNN, NPO, NPTN, NR, NRC, NSA, NVST, NVT, NVTA, OAS, OCFT, OCN, OI, OKE, OMI, OMP, ONCR, OPCH, OPTN, OSUR, OXY, PAA, PACB, PAGP, PAYC, PBI, PCRX, PEAK, PEG, PERI, PKOH, POWL, PRIM, PRO, PRU, PSA, PSB, PSX, PSXP, PTRS, PUMP, PVAC, QTS, QUAD, RCKY, RCM, RDN, RGA, RHP, RIBT, RIGL, RL, RM, RMRM, RNG, ROCK, RPAI, RRD, RVPH, RYAM, RYTM, SABR, SAGE, SATS, SEB, SEE, SHO, SKLZ, SKT, SKY, SKYT, SLRC, SND, SONY, SPT, SPWR, SQNS, SRC, SRNE, STAR, STIM, STLA, SUN, SUNS, TACT, TALO, TBPH, TCS, TDG, TISI, TNC, TRTX, TSLX, TSQ, TTEC, TX, UA, UAA, UBOH, UFPT, UNM, USAC, USCR, UTL, VAL, VECO, VERI, VNTR, VREX, VRSK, VVNT, WAT, WBT, WEC, WEYS, WHLR, WK, WLK, WLKP, WLTW, WMC, WMG, WRN, WSR, WTI, WTTR, XFOR, XHR, XP, XPER, XYL, ZBH, ZBRA\n\n - Ex-div:\n\n  ATR, BBD, BBDO, BCBP, EIG, ETRN, HFWA, MKTX, NTIC, SHEN\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.000%)\n    - API Weekly Crude Oil Stock (previous: -4.728M)\n    - Durables Excluding Defense (previous: 1.0%)\n    - FOMC Member Bowman Speaks\n    - FOMC Member Clarida Speaks\n    - Factory Orders (consensus: 1.0%, previous: 1.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 54.3)\n    - Redbook (previous: 16.0%)\n    - Total Vehicle Sales (previous: 15.40M)\n\n## Upcoming events for Wednesday, August  4th\n\n - Expected earnings:\n\n  AAU, ABC, ABIO, AC, ACA, ACAD, ACEL, ACIU, ACLS, ACR, ADMA, ADPT, ADT, ADTN, AEIS, AERI, AFIN, AGL, ALB, ALE, ALG, ALIM, ALKT, ALL, ALLO, ALNA, ALRN, ALTM, AMED, AMOT, AMPE, AMPY, AMSC, ANGI, ANSS, APA, APO, ARLO, ARTNA, ASMB, ASTE, ASYS, ATO, ATRA, ATRC, ATTO, AVA, AXGN, BBSI, BCLI, BCOR, BCSF, BCYC, BDC, BDSI, BE, BFAM, BGCP, BKNG, BKTI, BLPH, BLUE, BNGO, BOOT, BRSP, BTG, BVH, BWA, CAMT, CCMP, CCRN, CCU, CDAY, CDW, CENT, CENTA, CENX, CFMS, CHNG, CIA, CIB, CIGI, CIM, CKPT, CLH, CLVS, CLW, CMLS, CMP, CPA, CPK, CPS, CRL, CRTO, CSGS, CSII, CSTE, CSWI, CUTR, CVGI, CVRX, CVS, CYAD, DAR, DCP, DFIN, DGII, DHC, DLHC, DMTK, DNOW, DOC, DOX, DRTT, DVAX, DXC, EA, ECPG, EDIT, EDRY, EGHT, ELF, EMKR, EMR, ENBL, EOG, EOLS, EQH, EQX, ERJ, ERO, ETR, ETSY, EVH, EVOP, EVRI, EXC, EXPI, EYPT, FATE, FCPT, FDP, FENC, FLMN, FLOW, FLT, FLXN, FOX, FOXA, FPI, FRGI, FRT, FSLY, FTDR, FUN, FVE, GDDY, GEL, GEO, GGB, GHC, GLAD, GLBZ, GM, GMED, GNK, GPRK, GRP.U, GRTS, GTHX, HARP, HBB, HCC, HDSN, HFC, HHC, HI, HMC, HNGR, HR, HRTX, HUBS, HWM, HYMC, HZNP, IAC, IAG, ICD, ICUI, IIPR, IMXI, INGN, INMB, INSG, IO, IONS, ISEE, ISSC, IVC, IVR, JACK, JLL, JRVR, KBAL, KE, KHC, KIN, KLIC, KRO, KRTX, KUKE, KW, KZR, LAND, LESL, LHCG, LILA, LILAK, LL, LMND, LMRK, LNC, LPI, LUMN, MAC, MASS, MAXR, MBI, MCK, MCS, MDCA, MDU, MED, MET, MFC, MGLN, MGM, MGPI, MIDD, MLR, MLVF, MNKD, MNRL, MNTV, MOD, MPC, MPLX, MRO, MTG, MTOR, MVIS, MWA, NC, NEPH, NESR, NEWT, NEX, NHTC, NI, NL, NMFC, NMR, NODK, NP, NSPR, NSTG, NTEC, NUS, NVRO, NWPX, NXST, NYT, OCDX, ODP, OESX, ONEM, OPRX, OR, ORA, ORCC, ORIC, OSPN, OTIC, OYST, PACE, PARR, PCSA, PDCE, PETQ, PFLT, PING, PIRS, PLMR, PLTK, PLUS, PLYA, PNNT, PROF, PSN, PSNL, PTVE, PW, QNST, QRVO, QTWO, QUIK, RCII, RCKT, RCL, REGI, RESN, RGR, RKT, RMAX, RMNI, RNWK, ROKU, RPD, RPT, RTLR, RVI, RVLV, RYI, RYN, SAFT, SALM, SANA, SBGI, SBOW, SBRA, SCU, SD, SENEA, SENEB, SGRY, SITE, SITM, SJI, SLCT, SLF, SLGL, SLNG, SMFG, SMG, SMP, SMSI, SPNS, SPR, SRDX, SRI, SRPT, SSRM, SSSS, STAA, STKL, STN, SUM, SUP, SUPN, SWM, TELL, TGB, TGI, TLC, TNDM, TPC, TPVG, TRC, TREC, TRMB, TRNO, TS, TSE, TT, TTGT, TUP, TVTY, TWNK, TWO, TXG, TXMD, UBER, UE, UFCS, UFI, UGI, UHAL, UIHC, ULCC, UMH, UPLD, URG, URGN, USDP, USWS, UTHR, UVV, VCEL, VIRT, VMC, VRCA, VRDN, VTOL, VVV, VWTR, VZIO, WCN, WDC, WLFC, WLL, WTS, WU, WYNN, XNCR, XPL, YELL, ZYME\n\n - Ex-div:\n\n  AWI, CATC, CCK, DKL, FELE, IBTX, IDA, KBH, MATX, NEP, NWBI, OFED, OPBK, SIMO, STBA, TGP, VBTX, VLO, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.000%)\n    - API Weekly Crude Oil Stock (previous: -4.728M)\n    - Durables Excluding Defense (previous: 1.0%)\n    - FOMC Member Bowman Speaks\n    - FOMC Member Clarida Speaks\n    - Factory Orders (consensus: 1.0%, previous: 1.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 54.3)\n    - Redbook (previous: 16.0%)\n    - Total Vehicle Sales (previous: 15.40M)\n\n^^^^2021-08-03",
        "created_utc": 1627984814,
        "id": "h7jaqb2",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1628013614.0
    },
    {
        "author": "moniis",
        "body": "Flt is trending on wealthsimple, anyone know why?",
        "created_utc": 1628011764,
        "id": "h7kqb58",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628040564.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  2nd of August\n\n\n\n## Upcoming events for Monday, August  2nd\n\n - Stock splits:\n\n    - GE @ **1:8**\n\n - Expected earnings:\n\n  ACHC, ADUS, AIV, ALX, AMRC, ANET, APPF, ARAV, ARCB, ARGO, ASLN, AWK, AWR, BCC, BRKR, BRX, BSBK, BSM, BVN, BWXT, CINR, CLAR, CLNN, CLR, CNA, COLM, CORR, CRNT, CSR, CSWC, CVI, CX, DAC, DBVT, DSPG, DZSI, EARN, EML, EMN, EVER, FANG, FNCB, FREY, FRPT, GAIA, GAIN, GOOD, GPN, GPP, GPRE, GSMG, HAYW, HLIT, HMN, HSBC, IMUX, IPI, ITUB, IVAC, JELD, KDNY, KMT, KNBE, KRG, L, LEG, LU, LUB, METC, MFIN, MG, MOS, NERV, NETI, NPK, NSP, NXPI, O, OGS, OHI, ON, OTTR, PBHC, PEBK, PLOW, PXD, RACE, RADA, RARE, REKR, REYN, RGCO, RIG, RMBL, RMBS, SANM, SBAC, SBT, SCM, SEDG, SFST, SGU, SIBN, SPG, SPNE, STRL, SYKE, TA, TCMD, TCPC, TGTX, TKR, TREX, TSEM, TTI, TTWO, UAN, UCTT, UIS, UNVR, USAU, UTI, VMD, VNO, VNOM, VRNS, VTVT, WILC, WMB, WMK, WWD, XTNT, ZI\n\n - Ex-div:\n\n  BANR, CAG, CAPL, CBAN, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, IGD, ITUB, LMRK, SAFM, SHLX, SPH, SRCE, SRLP, WBS, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.050%)\n    - 6-Month Bill Auction (previous: 0.050%)\n    - Construction Spending (consensus: 0.4%, previous: -0.3%)\n    - ISM Manufacturing Employment (previous: 49.9)\n    - ISM Manufacturing New Orders Index (previous: 66.0)\n    - ISM Manufacturing PMI (consensus: 60.9, previous: 60.6)\n    - ISM Manufacturing Prices (previous: 92.1)\n    - Investing.com Gold Index (actual: 58.5%, previous: 58.2%)\n    - Investing.com S&amp;P 500 Index (actual: 47.3%, previous: 42.2%)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 63.1, previous: 62.1)\n    - Total Vehicle Sales (previous: 15.40M)\n\n## Upcoming events for Tuesday, August  3rd\n\n - Expected earnings:\n\n  ACOR, ADCT, AENZ, AFG, AHH, AIZ, AJX, AKAM, ALNY, ALTO, AME, AMGN, ANDE, ANIX, APAM, APEN, APRN, APT, APTO, AQST, AQUA, ARC, ARNC, ARVN, ATEC, ATI, ATKR, ATOM, ATVI, AVID, AVNS, AY, AYX, BABA, BEN, BGFV, BHC, BHG, BKEP, BKH, BLD, BLKB, BNFT, BNL, BP, BRY, BXC, BYFC, CAR, CDEV, CDLX, CDXC, CECE, CEIX, CERS, CFBK, CGBD, CHCT, CHSCP, CIX, CLDT, CLSK, CLX, CMI, CNR, COHR, COP, COUR, CPE, CPSI, CPSS, CRD.A, CRD.B, CRIS, CRK, CRNC, CRSR, CRVL, CSLT, CTSO, CW, CWEN, CWEN.A, CWH, CZR, DCPH, DD, DEA, DEI, DENN, DISCA, DISCB, DISCK, DK, DKL, DNB, DS, DSKE, DSX, DVA, DVN, E, EC, EDU, ELVT, ENIA, ENLC, EPZM, ESPR, ET, ETN, ETRN, EVC, EVTC, EXPD, EZPW, FCNCA, FI, FICO, FIS, FMC, FNF, FNHC, FOE, FRG, FSP, FSTR, GBL, GBT, GDOT, GHL, GIC, GLDD, GLRE, GLT, GLTO, GMRE, GNW, GRBK, GTE, H, HEES, HEP, HLF, HLI, HLNE, HPP, HSC, HSIC, HSKA, HST, HY, HZN, IAA, ICFI, ICHR, IDN, IDRA, IGT, INCY, INFN, INGR, INN, INSP, INVE, IOSP, IPGP, IT, ITIC, IX, J, JAX, JAZZ, JBGS, KAI, KAR, KFRC, KKR, KLDO, KNSA, KOPN, KTOS, KWR, LCII, LDI, LDOS, LEU, LGIH, LHX, LIND, LLY, LPG, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, LYV, MANT, MAR, MCHP, MCRB, MCY, MDNA, MDXG, MEC, MGRC, MGY, MIC, MIME, MKL, MNOV, MNR, MNST, MNTX, MRCC, MRCY, MTCH, MTRN, MUFG, MYGN, NBIX, NCR, NCSM, NDLS, NE, NEWR, NKLA, NMIH, NNN, NPO, NPTN, NR, NRC, NSA, NVST, NVT, NVTA, OAS, OCFT, OCN, OI, OKE, OMI, OMP, ONCR, OPCH, OPTN, OSUR, OXY, PAA, PACB, PAGP, PAYC, PBI, PCRX, PEAK, PEG, PERI, PKOH, POWL, PRIM, PRO, PRU, PSA, PSB, PSX, PSXP, PTRS, PUMP, PVAC, QTS, QUAD, RCKY, RCM, RDN, RGA, RHP, RIBT, RIGL, RL, RM, RMRM, RNG, ROCK, RPAI, RRD, RVPH, RYAM, RYTM, SABR, SAGE, SEB, SEE, SHO, SKLZ, SKT, SKY, SKYT, SLRC, SND, SONY, SPT, SPWR, SQNS, SRC, SRNE, STAR, STIM, STLA, SUN, SUNS, SWI, TACT, TALO, TBPH, TCS, TDG, TISI, TNC, TRTX, TSLX, TSQ, TTEC, TX, UA, UAA, UBOH, UFPT, UNM, USAC, USCR, UTL, VAL, VECO, VERI, VNTR, VREX, VRSK, VVNT, WAT, WBT, WEC, WEYS, WHLR, WK, WLK, WLKP, WLTW, WMC, WMG, WRN, WSR, WTI, WTTR, WYNN, XFOR, XHR, XP, XPER, XYL, ZBH, ZBRA\n\n - Ex-div:\n\n  ATR, BBD, BBDO, BCBP, EIG, ETRN, HFWA, MKTX, NTIC, SHEN\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.000%)\n    - API Weekly Crude Oil Stock (previous: -4.728M)\n    - Durables Excluding Defense (previous: 1.0%)\n    - FOMC Member Bowman Speaks\n    - Factory Orders (consensus: 1.0%, previous: 1.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 54.3)\n    - Redbook (previous: 16.0%)\n\n## Upcoming events for Wednesday, August  4th\n\n - Expected earnings:\n\n  AAU, ABC, ABIO, AC, ACA, ACAD, ACEL, ACIU, ACLS, ACR, ADMA, ADPT, ADT, ADTN, AEIS, AERI, AFIN, AGL, ALB, ALE, ALG, ALIM, ALKT, ALL, ALLO, ALNA, ALRN, ALTM, AMED, AMOT, AMPE, AMPY, AMSC, ANGI, ANSS, ANVS, APA, APO, ARLO, ARNA, ARTNA, ASMB, ASTE, ASYS, ATO, ATRA, ATRC, ATTO, AVA, AXGN, BBSI, BCLI, BCOR, BCSF, BCYC, BDC, BDSI, BE, BFAM, BFIN, BGCP, BKNG, BKTI, BLPH, BLUE, BNGO, BOOT, BRSP, BTG, BWA, CAMT, CCMP, CCRN, CCU, CDAY, CDW, CENT, CENTA, CENX, CFMS, CHNG, CIA, CIB, CIGI, CIM, CKPT, CLH, CLLS, CLVS, CLW, CMLS, CMP, CPA, CPK, CPS, CRL, CRTO, CSGS, CSII, CSTE, CSWI, CUTR, CVGI, CVRX, CVS, CYAD, DAR, DCP, DFIN, DGII, DHC, DLHC, DMTK, DNOW, DOC, DOX, DRTT, DVAX, DXC, EA, ECPG, EDIT, EDRY, EGHT, ELF, EMKR, EMR, ENBL, EOG, EOLS, EQH, EQX, ERJ, ERO, ETR, ETSY, EVH, EVOP, EVRI, EXC, EXPI, EYPT, FATE, FCPT, FDP, FENC, FLMN, FLOW, FLT, FLXN, FOX, FOXA, FRGI, FRPH, FRT, FSLY, FTDR, FUN, FVE, GDDY, GEL, GGB, GHC, GLAD, GLBZ, GM, GMED, GNK, GPRK, GRP.U, GRTS, GTHX, HARP, HBB, HCC, HDSN, HFC, HHC, HI, HMC, HNGR, HR, HRTX, HUBS, HWM, HYMC, HZNP, IAC, IAG, ICD, ICUI, IIPR, IMXI, INGN, INMB, INSG, IO, IONS, ISEE, ISSC, IVC, IVR, JACK, JLL, JRVR, KBAL, KE, KHC, KIN, KLIC, KRO, KRTX, KUKE, KW, KZR, LAND, LESL, LEVL, LHCG, LILA, LILAK, LL, LMND, LMRK, LNC, LPI, LUMN, MAC, MASS, MAXR, MBI, MCK, MCS, MDCA, MDU, MED, MET, MFC, MGLN, MGM, MGPI, MIDD, MLR, MLVF, MNKD, MNRL, MNTV, MOD, MPC, MPLX, MRO, MTG, MTOR, MVIS, MWA, NC, NEPH, NESR, NEWT, NEX, NHTC, NI, NL, NMFC, NMR, NODK, NP, NSPR, NSTG, NTEC, NUS, NVRO, NWPX, NXST, NYT, OCDX, ODP, OESX, ONEM, OPRX, OR, ORA, ORCC, ORIC, OSPN, OTIC, OYST, PACE, PARR, PCSA, PDCE, PETQ, PFIE, PFLT, PING, PIRS, PLMR, PLTK, PLUS, PLYA, PNNT, PROF, PSN, PSNL, PTVE, PW, QNST, QRVO, QTWO, QUIK, RCII, RCKT, RCL, REGI, RESN, RGR, RKT, RMAX, RMNI, RNWK, ROKU, RPD, RPT, RTLR, RVI, RVLV, RYI, RYN, SAFT, SALM, SANA, SBGI, SBOW, SBRA, SCU, SD, SENEA, SENEB, SGMO, SGRY, SITE, SITM, SJI, SLCT, SLF, SLGL, SLNG, SMFG, SMG, SMP, SMSI, SPNS, SPR, SRDX, SRI, SRPT, SSRM, SSSS, STAA, STKL, STN, SUM, SUP, SUPN, SWM, TELL, TGB, TGI, TIPT, TLC, TNDM, TPC, TPVG, TRC, TREC, TRMB, TRNO, TS, TSE, TT, TTGT, TUP, TVTY, TWNK, TWO, TXG, TXMD, UBER, UE, UFCS, UFI, UGI, UHAL, UIHC, ULCC, UMH, UPLD, URG, URGN, USDP, USWS, UTHR, UVV, VCEL, VGR, VIRT, VMC, VRCA, VRDN, VTOL, VVV, VWTR, VZIO, WCN, WDC, WLFC, WLL, WTS, WU, XNCR, XPL, YELL, ZYME\n\n - Ex-div:\n\n  AWI, CATC, CCK, DKL, FELE, IBTX, IDA, KBH, MATX, NEP, NWBI, OFED, OPBK, SIMO, STBA, TGP, VBTX, VLO, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 700K, previous: 692K)\n    - Crude Oil Imports (previous: -0.616M)\n    - Crude Oil Inventories (previous: -4.089M)\n    - Cushing Crude Oil Inventories (previous: -1.268M)\n    - Distillate Fuel Production (previous: -0.163M)\n    - EIA Refinery Crude Runs  (previous: -0.132M)\n    - EIA Weekly Distillates Stocks (consensus: -0.435M, previous: -3.088M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.4%, previous: -0.3%)\n    - FOMC Member Clarida Speaks\n    - Gasoline Inventories (consensus: -0.916M, previous: -2.253M)\n    - Gasoline Production (previous: 0.649M)\n    - Heating Oil Stockpiles (previous: 0.108M)\n    - ISM Non-Manufacturing Business Activity (previous: 60.4)\n    - ISM Non-Manufacturing Employment (previous: 49.3)\n    - ISM Non-Manufacturing New Orders (previous: 62.1)\n    - ISM Non-Manufacturing PMI (consensus: 60.4, previous: 60.1)\n    - ISM Non-Manufacturing Prices (previous: 79.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.01%)\n    - MBA Mortgage Applications (previous: 5.7%)\n    - MBA Purchase Index (previous: 251.7)\n    - Markit Composite PMI (previous: 59.7)\n    - Mortgage Market Index (previous: 737.9)\n    - Mortgage Market Index (previous: 737.9)\n    - Mortgage Refinance Index (previous: 3,570.4)\n    - Services PMI (previous: 59.8)\n\n^^^^2021-08-02",
        "created_utc": 1627898416,
        "id": "h7evcd0",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1627927216.0
    }
]