[
    {
        "author": "notpr1m",
        "body": "AMD, COIN, QCOM",
        "created_utc": 1626607722,
        "id": "h5mbmt8",
        "permalink": "/r/stocks/comments/omoprn/stocks_that_youd_still_buy_today_at_todays_prices/h5mbmt8/",
        "score": 32,
        "subreddit": "stocks",
        "created": 1626636522.0
    },
    {
        "author": "superjeffs",
        "body": "Looks like someone found NLST, affectionaly known as the next Qualcomm but of computer memory. Not a scam but very much under radar. Congrats!!",
        "created_utc": 1626734217,
        "id": "h5t392o",
        "permalink": "/r/wallstreetbets/comments/onc8o3/gain_porn_will_use_to_get_more_amc_in_the_future/h5t392o/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1626763017.0
    },
    {
        "author": "superjeffs",
        "body": "Far from a scam. Company was at one time on the Nasdaq. Had to drop to OTC because it couldn’t meet mimimun listing requirements from infringement pressure on its business and patents. They’re current on SEC filings, have two mainstream analysts covering, and have millions in revenues. Not a scam and more of a ground floor opportunity. Think of Netlist as the Qualcomm but of computer memory.",
        "created_utc": 1626735437,
        "id": "h5t5teh",
        "permalink": "/r/wallstreetbets/comments/onc8o3/gain_porn_will_use_to_get_more_amc_in_the_future/h5t5teh/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1626764237.0
    },
    {
        "author": "LegendLarrynumero1",
        "body": "Jason's stocks:\n\nPenumbra  +21.5%\n\n\nItron  -1.4%\n\n\nSynaptics  +11%\n\n\nBrooks Automation  -7.5%\n\n\nRadnet  +37.4%\n\n\nAppHarvest  +9.4%\n\n\nDexcom  +8%\n\n\nTeradyne  +9.9%\n\n\nMarvel MRVL  +.75%\n\nCiena  -5.5%\n\n\nRoblox  +24%\n\n\nAxon -7.2%\n\n\nBill.com -.16%\n\n\nHome Depot -4.42%\n\n\nQualcomm +1.9%\n\n\nElastic +25%",
        "created_utc": 1625369663,
        "id": "h3zl05s",
        "permalink": "/r/stocks/comments/od9lsa/the_motley_fool_podcast_has_their_analysts/h3zl05s/",
        "score": 20,
        "subreddit": "stocks",
        "created": 1625398463.0
    },
    {
        "author": "BigFace918907",
        "body": "Buy and hold. TSM manufacturers over 50% of the worlds semiconductors and sells to Apple, Nvidia, Qualcomm and other “chip producers”. Some of them are trying to build their own foundries but those are incredibly expensive and take a long time.",
        "created_utc": 1627407705,
        "id": "h6qbqlr",
        "permalink": "/r/stocks/comments/osq1pg/what_are_your_thoughts_on_tsm/h6qbqlr/",
        "score": 18,
        "subreddit": "stocks",
        "created": 1627436505.0
    },
    {
        "author": "utalkin_tome",
        "body": "People really need to understand that the competition isn't between ISAs like x86 and ARM. Both of these ISAs have borrowed from each others accomplishments to keep advancing.\n\nThe competition is between the design of the SoC itself. Apple engineers just designed a REALLY good chip using ARM license. They've been designing their own chips for a long time now so they have talent.\n\nARM by itself didn't provide some magical performance improvement. Look at Qualcomm and Samsung for a good example. Both use ARM to design their chips and they can barely compete with Apple's design.\n\nAMD also uses x86 and has designed chips that can compete with Apple's designs and beat some of Intel's chips too. So again the competition is between the design itself and not the ISAs.",
        "created_utc": 1626469134,
        "id": "h5fy5vt",
        "permalink": "/r/stocks/comments/olm9my/intel_potential/h5fy5vt/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1626497934.0
    },
    {
        "author": "exe_virus",
        "body": "Big tech will be regulated to hell. Maybe not now, not in 5 years. But it will be anti monopoly regulated until a new crop emerges and overtakes. \n\nHappened with AT&amp;T bell in the 60's which led to IBM, AMD, Texas instruments, etc.\n\nThen in the 80's/90's, antitrust threats is what led these large hardware companies to outsource their software OS to Microsoft and apple and Unix. \n\nThen in the 2000's we had Microsoft Monopoly broken up and the dot com crash, which led to Google, myspace, etc. Then in '08 google and Qualcomm and all these technologies came together to form what allowed today's JavaScript web based companies like Facebook, YouTube (google), linkedin (Microsoft) you get the idea. \n\nWhat has allowed big tech to stay on top is *acquisitions*. When that power is taken away, you will see big tech's investment thesis fall apart. And lo and behold that's the kind of anti monopoly regulations we are starting to see.",
        "created_utc": 1626739602,
        "id": "h5tecii",
        "permalink": "/r/investing/comments/onfgxl/the_asian_financial_crisis_the_birth_of_the_age/h5tecii/",
        "score": 10,
        "subreddit": "investing",
        "created": 1626768402.0
    },
    {
        "author": "Mr_sunnshine",
        "body": "If you knew the story of how Qualcomm rose in 1999, you wouldn’t think it’s so funny.",
        "created_utc": 1626748157,
        "id": "h5tvfzr",
        "permalink": "/r/wallstreetbets/comments/onc8o3/gain_porn_will_use_to_get_more_amc_in_the_future/h5tvfzr/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1626776957.0
    },
    {
        "author": "Vitadek_Gaming",
        "body": "I work with a lot of satellite signal equipment.\nThe biggest issue with trying to get lots of \"bandwidth\" within satellite services is water, we call it \"rain fade\". Basically, you can get better and more robust signal at lower frequencies, but have a less medium to work with when sending data through.\nAt higher frequencies, water (rain/clouds) tend to interfere with the signal, but you can push more data through. But it's not as reliable. If you're using Ka band, and it starts raining, you're SOL.\nSo it's generally a give and take. Usually the answer is a better modem, what basically translates your signal to usable data. Certain equipment allows for more efficient symbol translation (Qualcomm has a good handle on this). As well as finding the best band for the mission/task. Better transceivers and receivers help too ofc. But it's hard to package solid sat lock into a phone, I'm curious on how they got around it.\n\nAnyways, here's a good article: https://www.esa.int/Applications/Telecommunications_Integrated_Applications/Satellite_frequency_bands\n\nYou can't get \"5G' from satellite, you can't even get half a mile with 5G telecommunication. \n\nBut there you go, a break down of satellite service providers.",
        "created_utc": 1625732048,
        "id": "h4ga9et",
        "permalink": "/r/investing/comments/ofruwg/what_companies_did_you_invest_in_because_you/h4ga9et/",
        "score": 9,
        "subreddit": "investing",
        "created": 1625760848.0
    },
    {
        "author": "Stuck_in_a_thing",
        "body": "Can someone explain how QCOM benefits? They are fabless.",
        "created_utc": 1626988237,
        "id": "h669763",
        "permalink": "/r/investing/comments/opjbxe/us_developing_plans_to_spend_52_billion_on_chips/h669763/",
        "score": 8,
        "subreddit": "investing",
        "created": 1627017037.0
    },
    {
        "author": "LePootPootJames",
        "body": "*ERs next week*\n\nMonday: TSLA\n\nTuesday: AAPL, MSFT, GOOG, V, UPS, SBUX, AMD\n\nWednesday: FB, PYPL, PFE, SHOP, MCD, QCOM\n\nThursday: AMZN, MA\n\nFriday: no big tech or wsb favs, probably the most notable are PG, XOM and CAT",
        "created_utc": 1627064043,
        "id": "h69ynj5",
        "permalink": "/r/wallstreetbets/comments/opyia2/fraternal_association_of_gambling_gentlemen_and/h69ynj5/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1627092843.0
    },
    {
        "author": "Investing8675309",
        "body": "TSM put out 5nm last year and is ramping this year. Intel 10nm won’t be out until mid-fall. After that they’ll go to 7nm. \n\nTo be fair this isn’t a nm-to-nm comparison, some have argued, rightfully so, that an Intel 7nm is comparative to a TSM 5nm. I believe AMD’s are still on 7nm (I’m not going to check this but going off memory). Intel has done a great job of improving their chips over the last few years without the nm shrinkage. That said, AMD has caught up.\n\nThere have been some interesting reports of Intel partnering on 3nm with TSM, not sure if that will go anywhere.\n\nKeep in mind this isn’t just an Intel vs AMD/TSM. TSM supplies Apple, Qualcomm, and, really, just about everyone else.",
        "created_utc": 1625326048,
        "id": "h3xfebw",
        "permalink": "/r/ValueInvesting/comments/ocx4zs/intel_corporation_intc_a_valuation_on_3rd_july/h3xfebw/",
        "score": 8,
        "subreddit": "ValueInvesting",
        "created": 1625354848.0
    },
    {
        "author": "cuteman",
        "body": "&gt;The bill negotiation process is what I was referring to. \n&gt;\n&gt;But Republicans are responsible for a lot of things being so far behind. Would you like me to start naming them...\n\nUS lack of dominance in semi conductors isn't one of them.\n\nThat lands squarely on US companies who have failed to invest and chose to offshore production to their own peril.\n\nIf anything this reads like companies now need a bailout because of their failures to invest and innovate themselves over prior decades.\n\nIt's only because of the recent chip shortage and blatantly obvious disadvantages versus Asian fabs that there is motive for it to be suggested in the first place.\n\nIt's only because of the spending spree for anything and everything that a proposal of this type could even make it to a vote. \n\nIf Amazon fell behind Alibaba should the government give them tens of billions in grants/loans to catch up?\n\nThese are some of the largest, and high margin companies we're talking about here: Intel, Qualcomm, etc.\n\nI don't think it's a slam dunk not obvious what should happen.",
        "created_utc": 1627000781,
        "id": "h66ykrw",
        "permalink": "/r/investing/comments/opjbxe/us_developing_plans_to_spend_52_billion_on_chips/h66ykrw/",
        "score": 7,
        "subreddit": "investing",
        "created": 1627029581.0
    },
    {
        "author": "Wickedcafemocha",
        "body": "Do some research on the 912 memory patent recently reaffirmed to be valid and owned by Netlist. \n\nNetlist is now a gatekeeper for the DDR5 memory standard, just like QualComm in the cellular field.\n\nYour loss for making stupid comments without doing the research.",
        "created_utc": 1626378063,
        "id": "h5b9arq",
        "permalink": "/r/stocks/comments/okyxqt/netlist_is_the_future_of_the_big_tech/h5b9arq/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1626406863.0
    },
    {
        "author": "wozza365",
        "body": "I agree, it's unlikely Intel would be able to get enough capacity from TSMC to fulfill their entire line of CPUs or even a significant portion of it. I suspect this will probably be for some super low power laptop/tablet chips and won't get anywhere near desktop or regular laptops. Although they're creating those hybrid big-little equivalents, so maybe it will be used for that.\n\nTSMC are always going to cosy up to AMD/Apple/Nvidia/Qualcomm who aren't competing with TSMC and are already using up every last nanometre that TSMC can pump out.",
        "created_utc": 1625248666,
        "id": "h3tydlc",
        "permalink": "/r/investing/comments/oca28f/amd_question_intel_using_tsmc_for_3nm_chips_has/h3tydlc/",
        "score": 6,
        "subreddit": "investing",
        "created": 1625277466.0
    },
    {
        "author": "FunctionVoidBig",
        "body": "Qualcomm's days of dominating mobile are fast going away.\n\nApple is designing their own chips now and likely will forever at this point.\n\nGoogle is releasing their first chip for their phones AND a new smartwatch - Google it.  Samsung already makes their own chips for their phones/watches.  \n\nOnce the Google chip comes out, Qualcomm is likely screwed....",
        "created_utc": 1626042098,
        "id": "h4utc8x",
        "permalink": "/r/stocks/comments/ogs1rh/rstocks_daily_discussion_fundamentals_friday_jul/h4utc8x/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1626070898.0
    },
    {
        "author": "csklmf",
        "body": "Please comment on my own ETF I created /s\n\nTSLA - 18%\n\nSQ - 10%\n\nAAPL - 6%\n\nAMZN - 3%\n\nGOOGL - 3%\n\nCELH - 5%\n\nPLTR - 3%\n\nCHPT - 2.5%\n\nTTCF - 2%\n\nSOFI - 3%\n\nQCOM - 3%\n\nAMD - 2.7%\n\nSE - 3%\n\nNET - 3%\n\nDIS - 4.8%\n\nRTX - 2.3%",
        "created_utc": 1627162105,
        "id": "h6eoe4e",
        "permalink": "/r/stocks/comments/nppkp4/rate_my_portfolio_rstocks_quarterly_thread_june/h6eoe4e/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1627190905.0
    },
    {
        "author": "MajesticNectarine",
        "body": "Bought Facebook and Qualcomm today. These seem like good bets for the future and are reasonably priced (based on the little knowledge I have and countless YouTube videos I have watched and articles I have read lol). And because I say that I’ll be back in a few months and these will probably be down 15-20% because that’s my luck haha x(",
        "created_utc": 1625168036,
        "id": "h3pvm0q",
        "permalink": "/r/stocks/comments/obi5og/rstocks_daily_discussion_options_trading_thursday/h3pvm0q/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625196836.0
    },
    {
        "author": "reddit-is-sus666",
        "body": "MU, ASX, QCOM, SWKS, AMAT, LRCX, AMD, and a few other that are around the 30 or less PE are all going to see strong growth. The sector of semiconductors has a lot of companies but they can all be successful and have huge business due to the size of the market. Semiconductors/microchips whatever you wanna call them are literally in everything we buy now except food/water (hopefully? Lol). \n\n\n\nI'm long Gas/Oil (XOM, COP) and Semiconductors the next couple years. Steel is a great play too, my favorite being CLF or NUE. I know the hype with electric vehicles but there are so many more aspects to oil/gas than cars. Gas/oil is going to be needed in large quantities for a decent amount of time ahead of us.",
        "created_utc": 1626364897,
        "id": "h5aeiwo",
        "permalink": "/r/options/comments/okvjbh/anyone_else_tired_of_this_market/h5aeiwo/",
        "score": 5,
        "subreddit": "options",
        "created": 1626393697.0
    },
    {
        "author": "bernie638",
        "body": "I would say QCOM should be a match for you.   They pay a small but solid dividend now and have good growth expectations with 5G.  Everything with a modern buys their licenses and the number of things with modems is expected to go up significantly as 5G rollout gets moving.   IOT, 5G connected tablets and even laptops,  autos, etc.\n\nI own 100 shares since early 2015, I kept buying when they were fighting with AAPL and had 255 shares at one point,  sold 55 when it jumped,  then another 100 near the peak after earnings, but it's settled down now and I think it's got potential again. \n\nGood luck.",
        "created_utc": 1625649277,
        "id": "h4c3vgt",
        "permalink": "/r/investing/comments/ofb7ch/your_picks_for_the_best_dividend_growth_stocks_of/h4c3vgt/",
        "score": 5,
        "subreddit": "investing",
        "created": 1625678077.0
    },
    {
        "author": "csklmf",
        "body": "&amp;#x200B;\n\nAlso QCOM",
        "created_utc": 1626380755,
        "id": "h5bfch5",
        "permalink": "/r/stocks/comments/okpdc9/rstocks_daily_discussion_options_trading_thursday/h5bfch5/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1626409555.0
    },
    {
        "author": "toydan",
        "body": "Well good morning ☕️ and this looks interesting \n\nI have 117 stocks on my watchlist. Many of them I own and a few I am watching. 2 are green UWMC and QCOM. MAGA MSFT AAPL GOOG AMZN looking ok. \n\nAlso I am not a fan of [Bill Ackman](https://finance.yahoo.com/news/bill-ackmans-pershing-drops-deal-061848687.html) in the least.",
        "created_utc": 1626691618,
        "id": "h5qlgt6",
        "permalink": "/r/wallstreetbets/comments/ona9jf/fraternal_association_of_gambling_gentlemen_and/h5qlgt6/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1626720418.0
    },
    {
        "author": "Rodgerwilco",
        "body": "TSMC supplies Apple, NVDA, Intel, AMD, Samsung, Qualcomm, IBM, Microsoft, Sony etcetcetcetc. They are responsible for over 70% of the words chips. Sure, we're investing in US production of chips but TSMC is strategic by keeping their most important/advanced nodes on mainland Taiwan.  \n\nChina wants Taiwan. USA and allies will back Taiwan because it's a matter of national security and it's in our best interest to not get fucked by China.  \n\nYou're right, TSMC the company is not monetarily 'worth' 5 Trillion right now. But what's the price tag of a country that 70% of the worlds chips rely on? What are the collective value of lives that will be lost over that war? It's worth more than 5T in my books.",
        "created_utc": 1625959418,
        "id": "h4r3etl",
        "permalink": "/r/stocks/comments/ohdsxk/first_company_to_reach_5_trillion_market_cap/h4r3etl/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625988218.0
    },
    {
        "author": "Lazybumm1",
        "body": "NVDA is investing in task-specific designs. The market for silicon is huge and there's demand for all shorts of different things. I'm extremely bullish on both AMD and NVDA don't get me wrong, I still think that even in the datacenter space where both might be competing for silicon they can both do fine. \n\nNVDA will probably overtake the market for training nodes (have you heard many people training in OpenCL? CUDA is the way to go!) but for general tasks the power efficiency of Epic chips and the lower price tag is very alluring.\n\nThey're both after Intel's lunch really. The risk here being how well companies trying to push for their own designs / architectures will do (Apple's M1 series, Google's, Amazon's and BABA's proprietary designs etc.). \n\nApart from those don't forget there's also a huge market for embeded, integrated and edge computing as well. I'm not a huge fan of AMD's Xilinx acquisition as we've seen that the use cases for FPGAs are very niche. QCOM most certainly is balls deep in this space, but there is growing interest from NVDA and AMD too!",
        "created_utc": 1625177899,
        "id": "h3qhyfi",
        "permalink": "/r/wallstreetbets/comments/obke5x/amd_wins_eu_antitrust_nod_for_35_billion_xilinx/h3qhyfi/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625206699.0
    },
    {
        "author": "hochsteD1szipl1",
        "body": "Yeah, I sold some QCOM $142 7/30 that are ITM, earnings date is 7/28. I’m actually kind of worried.",
        "created_utc": 1627135061,
        "id": "h6d6ahv",
        "permalink": "/r/wallstreetbets/comments/oqg4hj/when_the_underlying_price_surges_on_expiration_day/h6d6ahv/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1627163861.0
    },
    {
        "author": "toydan",
        "body": "$QCOM $SWKS $SOXL\n\ngiving me a semi \n\nEdit I thought good pun.",
        "created_utc": 1626270237,
        "id": "h55j4ik",
        "permalink": "/r/wallstreetbets/comments/ok0f1a/fraternal_association_of_gambling_gentlemen_and/h55j4ik/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626299037.0
    },
    {
        "author": "Fanzy_pants",
        "body": "Nothing like getting that cheeky ass notification from E-Trade that the contracts I purchased for 4.5 or whatever are expiring soon at .01\n\nLooking at you, QCOM",
        "created_utc": 1625879571,
        "id": "h4nkwhf",
        "permalink": "/r/wallstreetbets/comments/ogrof2/fraternal_association_of_gambling_gentlemen_and/h4nkwhf/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625908371.0
    },
    {
        "author": "happierdayz4me2",
        "body": "QCOM reports next week. Grab those 145c July 30. Or you can be a bitch and do synthetic longs",
        "created_utc": 1626781815,
        "id": "h5v54cy",
        "permalink": "/r/wallstreetbets/comments/onz1ys/daily_discussion_thread_for_july_20_2021/h5v54cy/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626810615.0
    },
    {
        "author": "PetulantWaffle",
        "body": "Really ? “Reddit Warriors” are going to dump at $22? No one is in it because of the company itself? \nLet me ask ask you this…who do you think developed the seminal patent that has been running Google’s engines for 10+ years? Do you think that maybe if they had been paid for their patent by Google and Samsung and others that just maybe, just maybe, they might have grown a little? \nNow that the patent has been re-affirmed as a seminal patent, no one can use it without license. \nNetlist will be the next Qualcomm… no one else has the 912 technology. Sky is the limit for Netlist now.",
        "created_utc": 1626974385,
        "id": "h65d8f8",
        "permalink": "/r/stocks/comments/opealr/nlst_price_is_at_a_discount_today/h65d8f8/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1627003185.0
    },
    {
        "author": "Apcorp78",
        "body": "Intel looks like a better buy right now, to me. Qualcomm looks like it’s been on bit of a run",
        "created_utc": 1625165719,
        "id": "h3pq9l3",
        "permalink": "/r/stocks/comments/obi5og/rstocks_daily_discussion_options_trading_thursday/h3pq9l3/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625194519.0
    },
    {
        "author": "Not_FinancialAdvice",
        "body": "&gt; Intel's 10nm transistor density is pretty competitive with TSMC's latest 7nm nodes.\n\nIllustrated: https://fuse.wikichip.org/wp-content/uploads/2019/06/tsmc-intel-xtor-comp-16-10-7.png\n\nDisclosure: INTC, QCOM shareholder",
        "created_utc": 1627016826,
        "id": "h67s32w",
        "permalink": "/r/investing/comments/opjbxe/us_developing_plans_to_spend_52_billion_on_chips/h67s32w/",
        "score": 3,
        "subreddit": "investing",
        "created": 1627045626.0
    },
    {
        "author": "hugovaraujo",
        "body": "Bought Qualcomm, Intel and Taiwan Semiconductor Manufacturer this Monday and I am f-ing pissed. 😂",
        "created_utc": 1626407452,
        "id": "h5cwegx",
        "permalink": "/r/StockMarket/comments/ol1add/here_is_a_market_recap_for_today_thursday_july_15/h5cwegx/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1626436252.0
    },
    {
        "author": "yeti_man82",
        "body": "I would recommend some MSFT and NVDA, for sure. Maybe some 'boring' non-tech plays, like FDX, TGT, or DE, all outstanding companies. I am also high on fintech (SQ, PYPL) and semiconductors (you already have AMD, but I also like TSM, MU, QCOM, and INTC).",
        "created_utc": 1626399879,
        "id": "h5cijzt",
        "permalink": "/r/stocks/comments/nppkp4/rate_my_portfolio_rstocks_quarterly_thread_june/h5cijzt/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1626428679.0
    },
    {
        "author": "MorrisseysRubiksCube",
        "body": "Raymond James has QUALCOMM is a strong buy. My financial advisor, who is with Raymond James, likes it a lot too.",
        "created_utc": 1625170967,
        "id": "h3q2f8b",
        "permalink": "/r/stocks/comments/obi5og/rstocks_daily_discussion_options_trading_thursday/h3q2f8b/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625199767.0
    },
    {
        "author": "Disada1",
        "body": "Intel admitted their engineering is shit and will be behind for the next 4 years.\n\n[https://finance.yahoo.com/news/intel-build-qualcomm-chips-aims-210415654.html?guccounter=1&amp;guce\\_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce\\_referrer\\_sig=AQAAANoFYNzq\\_zDTg4NQYEf1eVgjc7MmPivC\\_SWE5B74c9vZHWDffdxrGB-UghvCvROR5eOYkziwvS91Je-I8aRTHT1z9DLbiaJ-SCtPQY5J4X-9zMpHz8DXmcoIoFqnTl6WfDzRWYgkTd8jDhMdTnRr3TlPlAxr0GR0ZAMdseyHMBzv](https://www.theverge.com/2021/7/26/22594074/intel-acclerated-new-architecture-roadmap-naming-7nm-2025)\n\nedit: changed link because old one was the verge and they suck pp",
        "created_utc": 1627338314,
        "id": "h6n1ara",
        "permalink": "/r/wallstreetbets/comments/oruxsq/fraternal_association_of_gambling_gentlemen_and/h6n1ara/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1627367114.0
    },
    {
        "author": "Powerful_Stick_1449",
        "body": "ARM is… but if it falls through then the question arises as to how much of this deal is priced into NVIDIA right now. I heard rumor that Qualcomm was trying to position to go for it if NVIDIA gets blocked",
        "created_utc": 1625406027,
        "id": "h40svme",
        "permalink": "/r/SPACs/comments/ocwvuj/if_arm_says_nvda_is_a_spac_who_are_we_to_question/h40svme/",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1625434827.0
    },
    {
        "author": "pineapplestring",
        "body": "Does anyone know the bear case for QCOM? It seems everything is in their favor and I’m interested in buying",
        "created_utc": 1625756505,
        "id": "h4har8w",
        "permalink": "/r/stocks/comments/og3s35/rstocks_daily_discussion_options_trading_thursday/h4har8w/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625785305.0
    },
    {
        "author": "Whiteasian56",
        "body": "Happened on SKLZ, PRPL, RKT, FDX, QCOM, DIS, SBUX, BABA, GE, UBER, LYFT, NKE, V, WMT, INTC, TGT, KO, DAL, CCL, UAL, LUV, PYPL, NCHL, and RCL as well. Very weird",
        "created_utc": 1625192652,
        "id": "h3raojg",
        "permalink": "/r/wallstreetbets/comments/obtvlz/what_are_your_moves_tomorrow_july_02_2021/h3raojg/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625221452.0
    },
    {
        "author": "not_creative1",
        "body": "QCOM is better than AMD",
        "created_utc": 1626248519,
        "id": "h54qba0",
        "permalink": "/r/wallstreetbets/comments/ojnmfa/what_are_your_moves_tomorrow_july_14_2021/h54qba0/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626277319.0
    },
    {
        "author": "OptionsTrader16",
        "body": "Not really. I got IV crushed on Qualcomm but I feel this stock will have momentum IV over the next year. I think once pipe sellers are out it’ll ride up and the IV will remain high. I dumped all my LEAPS the first time up by $24 then started buying back in around 22 and have been averaging down ever since. Next run up towards 24+\\- I’ll dump these again for another great profit.",
        "created_utc": 1625626402,
        "id": "h4b9t2l",
        "permalink": "/r/wallstreetbets/comments/oexv7k/heres_why_sofi_selling_to_continue_for_next_13/h4b9t2l/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625655202.0
    },
    {
        "author": "graybeard5529",
        "body": "PE 20020709\n\n|symbol|days|Low\\_cls|High\\_cls|Last\\_cls|STDEV|NetVal|Order\\_Pr|AdjDown|Spread|\n|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|\n|QCOM|5|138.29|142.58|141.43|1.4593|140.69|139.96|128.76|−1.47|\n\nGood Free cash flow",
        "created_utc": 1626101460,
        "id": "h4xc3cc",
        "permalink": "/r/StockMarket/comments/oiqxev/dd_qualcomm_qcom/h4xc3cc/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1626130260.0
    },
    {
        "author": "netrider1",
        "body": "Good job. Good to see qcom here which is 15% of and the biggest position in my portfolio.",
        "created_utc": 1626138070,
        "id": "h4zi9ej",
        "permalink": "/r/StockMarket/comments/oiqxev/dd_qualcomm_qcom/h4zi9ej/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1626166870.0
    },
    {
        "author": "happierdayz4me2",
        "body": "What the ever loving fuck qualcomm?? you bait me out of my hedges and tease. I want to bitch slap it sometimes",
        "created_utc": 1626449761,
        "id": "h5eozk4",
        "permalink": "/r/wallstreetbets/comments/oldt8j/daily_discussion_thread_for_july_16_2021/h5eozk4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626478561.0
    },
    {
        "author": "tb7150",
        "body": "The existing fabs likely can’t be used for smaller gate sizes and it costs billions to make a new fab. Why wouldn’t they just build their own in-house fab for how much INTC would cost?\n\nIf you meant manpower capacity, again AAPL can attract its own talent so unless they wanted INTC IP I really see no benefit especially with the move with QCOM to design a new chip series",
        "created_utc": 1627056559,
        "id": "h69h7pd",
        "permalink": "/r/wallstreetbets/comments/opz91a/daily_discussion_thread_for_july_23_2021/h69h7pd/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627085359.0
    },
    {
        "author": "Trading-Resources",
        "body": "More Semiconductor Earnings. $UMC $QCOM $LRCX &amp; $XlNX all crushed it today. Tomorrow $SWKS. Use the list below to see any that you like that may pull back for future profit. Scrutinize the financials! \n\nhttps://www.reddit.com/r/wallstreetbets/comments/ol9lx3/semiconductor_expected_earnings_dates/",
        "created_utc": 1627509027,
        "id": "h6vsa7v",
        "permalink": "/r/wallstreetbets/comments/othpff/what_are_your_moves_tomorrow_july_29_2021/h6vsa7v/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627537827.0
    },
    {
        "author": "jerryjones-is-smart",
        "body": "$QCOM good deal rn and below historical PE after strong earnings and guidance raise",
        "created_utc": 1627665498,
        "id": "h73sjd8",
        "permalink": "/r/wallstreetbets/comments/ouhpha/daily_discussion_thread_for_july_30_2021/h73sjd8/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627694298.0
    },
    {
        "author": "ElderlyYeti",
        "body": "I have a small position in QCOM (3% of my portfolio) that I plan on adding to over the next few months.  I'm not in a rush though, probably wait for it to dip back into the low 130s.  I'd also recommend you look at AVGO as well.  \n\nBoth of these stocks have run up quite a bit over the last year so it isn't practical to expect those returns to continue which is why I'd stress a bit of patience on an entry point.",
        "created_utc": 1625252920,
        "id": "h3u8f46",
        "permalink": "/r/investing/comments/oc68xk/daily_general_discussion_and_spitballin_thread/h3u8f46/",
        "score": 2,
        "subreddit": "investing",
        "created": 1625281720.0
    },
    {
        "author": "ketapa",
        "body": "I'd go with definitely 5G (I'm Qualcomm all the way tbh as see them being the major player), clean energy (PLUG is best, perhaps CLNE has a role to play) and anything online data related (GOOG a big and safe one, PLTR for a higher risk and higher reward one).",
        "created_utc": 1625133619,
        "id": "h3nzjfj",
        "permalink": "/r/stocks/comments/oav9mb/what_are_your_projected_growth_sectors_over_the/h3nzjfj/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625162419.0
    },
    {
        "author": "Qwertyforu",
        "body": "Picked up some Qualcomm",
        "created_utc": 1625762470,
        "id": "h4hoavj",
        "permalink": "/r/stocks/comments/og3s35/rstocks_daily_discussion_options_trading_thursday/h4hoavj/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625791270.0
    },
    {
        "author": "LaLiLuLeLo_0",
        "body": "ARM doesn't make CPUs, they license the ARM architecture that other companies (like Qualcomm or Apple) buy and make CPUs based on. My thinking is that NVDA will be licensing ARM to an increasing number of both Apple and non-Apple PC manufacturers.\n\nAlso, ARM use is [growing in the datacenter](https://www.digitimes.com/news/a20210302PD209.html) thanks to its lower power consumption. Nvidia GPUs are already the de-facto standard for datacenter machine learning applications, and if Nvidia were to own ARM, they could more tightly integrate both ARM CPUs and Nvidia GPUs, or combine the two on a high performance SoC, for much better performance.",
        "created_utc": 1625791996,
        "id": "h4jezt3",
        "permalink": "/r/ValueInvesting/comments/og55gb/apple/h4jezt3/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1625820796.0
    },
    {
        "author": "mitttttch",
        "body": "What has better growth potential moving forward? \n\nAMD or Qualcomm?\n\nI really like what AMD is doing in terms of technology and contracts.(gaming consoles, interface for automobiles, pc gaming)\n\nbut it's hard to ignore Qualcomm patents and hold it has in the mobile industry. Mobile, I think, has bigger room for growth. With 5g, and emerging country's still getting mobile devices. \n\nAny insight would be greatly appreciated. (I also feel like $MU might be a good time to jump in but that's another story). Any .2 is more then welcome !",
        "created_utc": 1626041616,
        "id": "h4us8gi",
        "permalink": "/r/investing/comments/oi12vc/daily_advice_thread_all_basic_help_or_advice/h4us8gi/",
        "score": 2,
        "subreddit": "investing",
        "created": 1626070416.0
    },
    {
        "author": "TownDrunkerd",
        "body": "Good call! I hold a little bit myself. I also hold a little TDIV. My thought being that the future dividend growth behemoths will likely be largely based in the tech industry. QCOM, CSCO and the likes are heavily weighted there as well.",
        "created_utc": 1625674081,
        "id": "h4d8iti",
        "permalink": "/r/investing/comments/ofb7ch/your_picks_for_the_best_dividend_growth_stocks_of/h4d8iti/",
        "score": 2,
        "subreddit": "investing",
        "created": 1625702881.0
    },
    {
        "author": "z06dro",
        "body": "Qcom",
        "created_utc": 1627004045,
        "id": "h674wa5",
        "permalink": "/r/wallstreetbets/comments/oplsaa/what_are_your_moves_tomorrow_july_23_2021/h674wa5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627032845.0
    },
    {
        "author": "tb7150",
        "body": "Oh definitely not NVDA. Some dude was hyping INDI and there was one point people hyped ON. I actively fight the stupid in semiconductors here. But I own TSM, NVDA, QCOM, AMD, and INTC (descending portfolio share)",
        "created_utc": 1627061575,
        "id": "h69szhw",
        "permalink": "/r/wallstreetbets/comments/opz91a/daily_discussion_thread_for_july_23_2021/h69szhw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627090375.0
    },
    {
        "author": "Cool-Intention9207",
        "body": "LAM-TSM ALEC-CEMI-NTLA-QCOM-AAPL",
        "created_utc": 1626958489,
        "id": "h64du5c",
        "permalink": "/r/wallstreetbets/comments/opasbw/daily_discussion_thread_for_july_22_2021/h64du5c/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626987289.0
    },
    {
        "author": "stickman07738",
        "body": "It started out 4 funds (100% stock nearly 25 years), max out 401k, backdoor IRA and placed my bonus and deferred compensation in similar funds.  I also developed a series of blue chips using DRIPS (HON, KMB, APD, and a couple of utilities) - $100/month then move to $500/quarter.  Stop DRIPS contribution on retirement and still have not touch 401K, Roth and just recently tapped HON (my largest) to re-do kitchen.    \n\nI lost a ton of money during dot-com boom (QCOM an others) - thought I was a \"f-ing genius\" that taught me slow and steady wins the race - too much trading and speculation will hurt you in the long run.  \n\nI am not 100% a boglehead  and still have a number of speculative picks to keep my mind active - just so many pool/beach days and beers you can drink.",
        "created_utc": 1626528133,
        "id": "h5ihkye",
        "permalink": "/r/investing/comments/olvvz1/beating_the_marketwhat_bogleheads_have_wrong/h5ihkye/",
        "score": 2,
        "subreddit": "investing",
        "created": 1626556933.0
    },
    {
        "author": "undecidedmarketmaker",
        "body": "Two very contrasting companies - Copart (CPRT) and Cadence Design Systems (CDNS) are long term holds. Why? Both perform a quasi-utility function in their respective industries.\n\nCars will always be insurance totaled and salvaged for parts. Copart (and IAA to a lesser extent) have such a large moat of auction and salvage yards that few others can successfully penetrate the insurance-contracted businesses.\n\nEveryone, from Apple to Broadcom to Texas Instruments to Nvidia to Qualcomm making the chips that go into your fridge and car and [supercomputer](https://en.wikipedia.org/wiki/TOP500), uses Cadence software for their chip business. Every layout and circuit guy is weaned by Cadence and will support their high margins for the rest of their work lives. SOXL is testament to Mr. Market's growing love for our technology-integrated future, running off their chips. With Cadence, you aren't picking a winner. Whoever wins, you win.",
        "created_utc": 1626829252,
        "id": "h5y1e6k",
        "permalink": "/r/wallstreetbets/comments/oo9tqk/what_are_your_moves_tomorrow_july_21_2021/h5y1e6k/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626858052.0
    },
    {
        "author": "Kindly-Somewhere-14",
        "body": "Qcom",
        "created_utc": 1625153270,
        "id": "h3oxfhw",
        "permalink": "/r/wallstreetbets/comments/obik3v/daily_discussion_thread_for_july_01_2021/h3oxfhw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625182070.0
    },
    {
        "author": "tb7150",
        "body": "It’s new emphasis on chip design with QCOM has me bullish",
        "created_utc": 1626192792,
        "id": "h51u85z",
        "permalink": "/r/wallstreetbets/comments/ojcfk1/daily_discussion_thread_for_july_13_2021/h51u85z/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626221592.0
    },
    {
        "author": "patright333",
        "body": "Adding to MU and QCOM",
        "created_utc": 1625665738,
        "id": "h4cq8qk",
        "permalink": "/r/wallstreetbets/comments/offukf/daily_discussion_thread_for_july_07_2021/h4cq8qk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625694538.0
    },
    {
        "author": "tb7150",
        "body": "AAPL is moving with QCOM to design its own chips dude. Especially since INTC keeps fucking up and can’t go below 10nm. Why would AAPL buy INTC and raise its overhead when they collaborate with QCOM and use both of their hardware designers?",
        "created_utc": 1627056042,
        "id": "h69g0ge",
        "permalink": "/r/wallstreetbets/comments/opz91a/daily_discussion_thread_for_july_23_2021/h69g0ge/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627084842.0
    },
    {
        "author": "not_creative1",
        "body": "Fuck, should have taken QCOM profits today",
        "created_utc": 1627613386,
        "id": "h71dnkd",
        "permalink": "/r/wallstreetbets/comments/ou520a/what_are_your_moves_tomorrow_july_30_2021/h71dnkd/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627642186.0
    },
    {
        "author": "Burtonwurton",
        "body": "QCOM BABY! Bag holding this shit for way too long.",
        "created_utc": 1627502688,
        "id": "h6vdezm",
        "permalink": "/r/wallstreetbets/comments/othpff/what_are_your_moves_tomorrow_july_29_2021/h6vdezm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627531488.0
    },
    {
        "author": "planyo",
        "body": "There’s also a saying, that nvda is rather a software company than a hardware, you can think of AI solutions for example, in which they are leaders. So more like a sofware company with some hardware competences, and the comparison to amd+intc+qcom is rather false, although not entirely untrue.",
        "created_utc": 1625460838,
        "id": "h43jm5b",
        "permalink": "/r/stocks/comments/odsjza/what_are_your_favorite_hold_forever_stock/h43jm5b/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625489638.0
    },
    {
        "author": "teacherbbq",
        "body": "Their P/E and Enterprise/EBITDA Metrics have them hilariously low compared to companies like AMD or even QCOM. They had a really good, and in some areas, record breaking quarter and it dipped pretty decently. I’m adding as it falls.",
        "created_utc": 1625237383,
        "id": "h3t6tw9",
        "permalink": "/r/stocks/comments/oc6lta/rstocks_daily_discussion_fundamentals_friday_jul/h3t6tw9/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625266183.0
    },
    {
        "author": "reddit-is-sus666",
        "body": "There's aren't many undervalued Semiconductor stocks based on the avg PE ratio in the sector, but AMAT is one of them. The others I have picked out are:\n\nASX\n\nII-VI\n\nKLAC\n\nLRCX\n\nMU\n\nQCOM\n\nSWKS\n\nTER\n\nTSM\n\n\n\n\nAMD is my favorite overall but after the recent run I'd wait for a better entry/try to swing some puts since it has never stayed up after a run",
        "created_utc": 1626018054,
        "id": "h4tfu9c",
        "permalink": "/r/StockMarket/comments/oi648h/my_personal_dd_on_applied_material_amat/h4tfu9c/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1626046854.0
    },
    {
        "author": "happierdayz4me2",
        "body": "If QCOM dips before ER, buy those July 30s and LEAPS. This could be the ER with guidance for their Q1 (two quarters out) which is when the big numbers come and journey to Mars commences.",
        "created_utc": 1627301066,
        "id": "h6kt6q3",
        "permalink": "/r/wallstreetbets/comments/orvnbd/daily_discussion_thread_for_july_26_2021/h6kt6q3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627329866.0
    },
    {
        "author": "somewhat_pragmatic",
        "body": "&gt;  There's basically an insatiable hunger for computing power going forward for at least the next 25 years.\n\n25 years is a VERY long time in the world of semiconductor technology.  Nvidia and AMD are decently positioned with their GPU technologies.  Intel is not in a great position.  Their present day bread and butter is x86 CPUs used in laptops, desktops, and servers.  \n\nHousehold purchase of desktop and laptop computers has declined precipitously in the last 10 years.  People are largely doing home computing on tablets and phones now.  Thats a huge chunk of lost Intel sales.  Additionally Apple is now producing laptops with ARM based CPUs further eroding Intel laptop sales in the remaining business market.\n\nIntel's final solid ground was the server market.  Except AMD is now eating their lunch with their Epyc CPUs at the high end, and now at the low end ARM based CPUs are entering the server market.  Cloud provider AWS introduced the ARM based Graviton CPU for value cloud computing.  MS cloud provider is using Qualcomm ARM CPUs as a new product for low end computing on Azure.\n\nSo all of Intel's cash cows are under heavy attack without a clear answer from Intel about where their future revenue is going to come from.",
        "created_utc": 1627048707,
        "id": "h68zaqe",
        "permalink": "/r/investing/comments/opjbxe/us_developing_plans_to_spend_52_billion_on_chips/h68zaqe/",
        "score": 2,
        "subreddit": "investing",
        "created": 1627077507.0
    },
    {
        "author": "davidithejew180",
        "body": "QCOM calls at open",
        "created_utc": 1627560642,
        "id": "h6y3tsc",
        "permalink": "/r/wallstreetbets/comments/otuiae/daily_discussion_thread_for_july_29_2021/h6y3tsc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627589442.0
    },
    {
        "author": "ILoveMyFerrari",
        "body": "Yeah, FB is a great stock. I bought some back when it dipped to $257 per share, and it's a damn shame that I got out of it in the 280's and went into something else, because it's had a really nice run into the 350's. I would have been better off just holding FB the entire time.\n\nFB is certainly a wonderful stock to own, assuming you don't classify it almost as a \"sin\" stock like Phillip Morris or something. (Due to their heavy handed censorship and crowd psychology experiments)\n\nI find their censorship tactics annoying, and they do lots of shady things, but it's the business world, so what do you expect? Altruism? lol. So, I'm not too bothered.\n\nI want to get back into FB at some point, but I'm waiting on some sort of overall market correction. It's ran so much in the last couple of months, that I feel like I'd be buying back in at it's 2021 peak. Maybe around $320 ish, I could ease back in.\n\nRegarding whether Facebook is fashionable or not, I'm actually not making any personal judgement calls on that. It's not that I think it's unfashionable. I actually don't have much of a personal opinion on it. I barely use the service, but it's not for that reason. However, I have lots of friends and associates that were heavy users of the platform, and they have since departed the platform. (not talking about Trump supporters either)  Of course, that's just anecdotal evidence, but when you see enough of it, it does ring some alarm bells.\n\nAlso, anybody that buys a Quest 2 is required to sign up for a Facebook account. There are tons and tons of complaints from Quest 2 owners that would prefer not to be \"forced\" to sign up with a social media platform just to use a headset. However, for Facebook, it's a great strategy, because when your user numbers are starting to chip off, you can add a whole bunch of new users that are only signing up because they're forced to with an Oculus 2 headset.\n\nEven though many of these users will never use Facebook proper, it doesn't matter, because their numbers help make the ecosystem look healthier than it really is.\n\nI'm not trying to say Facebook is the next MySpace or anything like that. I'm just trying to point out, that there are plenty of thorns on this rose as well. We can't just totally ignore them.\n\nHowever, I'd like to get back to the original discussion on profiting in the VR and AR space. Those of us that know that VR and AR are going to be absolutely huge in the future, want to take advantage of this inside knowledge now, and invest in VR and AR companies that could really take off, when the general public at large is fully aware of all of this.\n\nSo, getting back to the idea of \"pure\" plays, are you aware of anything else that somebody should keep their eye on? I've done a fair amount of research on this topic, but there isn't a lot of obvious answers. There's a number of private companies that could become more interesting if they go public, but we can't really worry about them until that actually happens. If we want to stick with publicly traded companies, the ones that best fit the profile are Kopin Corporation, Microvision, Vuzix Corporation, eMagin Corporation, HTC, Snapchat.\n\nPersonally, I'd avoid HTC as their management is absolutely awful. I'm not very bullish on Snapchat either, but had to mention them, because they have longterm AR ambitions. I just think they'll be squashed by the true power players. Other stocks to consider that will benefit off a VR/AR revolution potentially is NVDA, AMD, QCOM, TSM (supposedly making some chips for Apple's upcoming VR HMD), Samsung, SONY.\n\nI'm always looking for some other stocks in this segment that I'm not currently aware of.",
        "created_utc": 1625326032,
        "id": "h3xfda7",
        "permalink": "/r/investing/comments/nnr3pu/qualcomm_qcom_whats_the_bear_case/h3xfda7/",
        "score": 1,
        "subreddit": "investing",
        "created": 1625354832.0
    },
    {
        "author": "No_Werewolf_1214",
        "body": "VT, LIN, QCOM, LUV, MT",
        "created_utc": 1625523927,
        "id": "h46akn0",
        "permalink": "/r/stocks/comments/odsjza/what_are_your_favorite_hold_forever_stock/h46akn0/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625552727.0
    },
    {
        "author": "AIforimaging",
        "body": "AI space is where it’s at now and there’s a company who has partnerships with Qualcomm, Nvidia, and Arm and they are about to hit the mainstream of the investment community when licensing agreements start rolling out. Share price has been suppressed by former chairman and CEO who were dismissed from the company selling off their shares. They will soon be done, right around the same time that these contracts start rolling out. Never been a better time to buy this one, company is Nexoptic, check their website or better yet check out the Reddit community ALIIS.",
        "created_utc": 1626024391,
        "id": "h4tsh0y",
        "permalink": "/r/ValueInvesting/comments/ogz9nd/what_is_the_highest_conviction_long_position_in/h4tsh0y/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1626053191.0
    },
    {
        "author": "the_humeister",
        "body": "QCOM, BABA",
        "created_utc": 1626190257,
        "id": "h51oh0j",
        "permalink": "/r/stocks/comments/ojfwuz/long_term_undervalued_stocks/h51oh0j/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626219057.0
    },
    {
        "author": "No_Werewolf_1214",
        "body": "Only one that interests me right now is QCOM. \n\nAny post-earnings dip would be the time to jump at Q1/Q2 bull plays and before Q4 (at latest) would be be when you want to have your share positions settling into the basis range you want. They are gonna blow it out of the water Q4-Q2 earnings and guidance",
        "created_utc": 1626503259,
        "id": "h5hnnoe",
        "permalink": "/r/investing/comments/oljzbt/semiconductor_stocks_boom_or_bust/h5hnnoe/",
        "score": 1,
        "subreddit": "investing",
        "created": 1626532059.0
    },
    {
        "author": "untitled-man",
        "body": "QCOM doesn’t have a foundry. Why would they gain from this?",
        "created_utc": 1627022239,
        "id": "h67zcnc",
        "permalink": "/r/investing/comments/opjbxe/us_developing_plans_to_spend_52_billion_on_chips/h67zcnc/",
        "score": 1,
        "subreddit": "investing",
        "created": 1627051039.0
    },
    {
        "author": "tb7150",
        "body": "Fair strategy. Have you looked into QCOM? I think they have a similar dividend yield",
        "created_utc": 1627057916,
        "id": "h69ke82",
        "permalink": "/r/wallstreetbets/comments/opz91a/daily_discussion_thread_for_july_23_2021/h69ke82/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627086716.0
    },
    {
        "author": "reddituserzerosix",
        "body": "F for PYPL FB, grats boomer QCOM",
        "created_utc": 1627504362,
        "id": "h6vheqi",
        "permalink": "/r/wallstreetbets/comments/othpff/what_are_your_moves_tomorrow_july_29_2021/h6vheqi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627533162.0
    },
    {
        "author": "TerrorDeity",
        "body": "AMD and QCOM calls are looking good. How high we thinking for AMD? I think it blows past 100",
        "created_utc": 1627526536,
        "id": "h6wsopm",
        "permalink": "/r/wallstreetbets/comments/othpff/what_are_your_moves_tomorrow_july_29_2021/h6wsopm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627555336.0
    },
    {
        "author": "BeTheNarrative",
        "body": "qualcomm calls printing asf, glad I yolo'd",
        "created_utc": 1627530543,
        "id": "h6x03lf",
        "permalink": "/r/wallstreetbets/comments/othpff/what_are_your_moves_tomorrow_july_29_2021/h6x03lf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627559343.0
    },
    {
        "author": "jerryjones-is-smart",
        "body": "$QCOM looks nice right now",
        "created_utc": 1627656861,
        "id": "h737vgq",
        "permalink": "/r/wallstreetbets/comments/ouhpha/daily_discussion_thread_for_july_30_2021/h737vgq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627685661.0
    },
    {
        "author": "Vulpoaica",
        "body": "Time for another spin of earnings roulette to find if Qualcomm pulls an AMD today",
        "created_utc": 1627556295,
        "id": "h6xxdvm",
        "permalink": "/r/wallstreetbets/comments/otuiae/daily_discussion_thread_for_july_29_2021/h6xxdvm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627585095.0
    },
    {
        "author": "backfire97",
        "body": "If anxious, you can always do smh or soxx which are semiconductor ETFs. You definitely do not get a ton of exposure to nvda but you get a decent amount. It also gives exposure to TSM, Qualcomm, Texas instruments (I think) and more",
        "created_utc": 1627577289,
        "id": "h6z3zdh",
        "permalink": "/r/stocks/comments/otyqbw/selling_pg_for_nividia/h6z3zdh/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627606089.0
    },
    {
        "author": "DarthTrader357",
        "body": "Cult stock. I called it out yesterday based on the strategic future of the next 5 years for AMD vs. Intel and QualComm etc. People downvoted me into oblivion.\n\nBecause they \"like the stock\". AMD is obviously a cult stock now. Doesn't mean it's a garbage company. Just means people don't care about its real performance or is strategic future performance.",
        "created_utc": 1627580851,
        "id": "h6zcs0h",
        "permalink": "/r/investing/comments/ou2dct/please_explain_me_how_amd_s_ratios_make_sense/h6zcs0h/",
        "score": 1,
        "subreddit": "investing",
        "created": 1627609651.0
    },
    {
        "author": "mihail_markov",
        "body": "Dont forget intel, Qualcomm, broadcom, they are all decent.",
        "created_utc": 1625748898,
        "id": "h4gvb5y",
        "permalink": "/r/stocks/comments/ofof8p/what_is_the_best_semiconductor_stock_right_now/h4gvb5y/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625777698.0
    },
    {
        "author": "kstorm88",
        "body": "My cost basis for aapl is $18. It is possible. And my cost basis for qcom is like $10 because I've owned it for like 20 years.",
        "created_utc": 1625596374,
        "id": "h49kg97",
        "permalink": "/r/wallstreetbets/comments/oervpb/daily_discussion_thread_for_july_06_2021/h49kg97/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625625174.0
    },
    {
        "author": "hylasmaliki",
        "body": "I was looking at synthetic DNA for medical field, maxcyte and 4bb, as well as pacb, and illumina.  Meituan and PDD for the 'convenience' and services industry. Qualcomm for the technology side with a particular interest in their association with Ultraleap. I like Farfetch and tHg for the business side of things.",
        "created_utc": 1626966809,
        "id": "h64vbpf",
        "permalink": "/r/stocks/comments/op37hp/future_multibaggers_what_stocks_do_you_think_will/h64vbpf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626995609.0
    },
    {
        "author": "Mati_RSchulz",
        "body": "A lot of things are happening simultaneously that I think might or might not lead to some kind of correction and leave a door open to buy cheaper. I wanted to know if it's just me or someone else agreed. (From the replies I've got so far, I'll have to further look into it, hahaha).\nIn my buy list is Adobe (which I think is overvalued now, I bought some when it was $400), and some other big tech companies that seems to be overvalued as well. I have not done any proper DD, but my next research will be about Qualcomm probably, Also, I recently bought Alibaba.",
        "created_utc": 1627185908,
        "id": "h6fukv3",
        "permalink": "/r/ValueInvesting/comments/oqzomy/a_good_opportunity_to_buy_cheap_might_be_on_its/h6fukv3/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1627214708.0
    },
    {
        "author": "Shaun8030",
        "body": "Yeah TFSA is pretty much apple , amzn. , GOOG , MSFT , Nvidia  ,Adbe ,  MA, Dis. RRSP is mainly qqqm , Vgt and a bit of smh and Arkk. Spouse TFSA is a bit riskier TSM , Shop , square , pypl , amd, QCOM. Amd",
        "created_utc": 1627009471,
        "id": "h67fr1o",
        "permalink": "/r/CanadianInvestor/comments/oplsa7/after_hours_discussion_thread_for_july_22_2021/h67fr1o/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1627038271.0
    },
    {
        "author": "VolvoKoloradikal",
        "body": "Intel just signed on Qualcomm for its 2nd tier Snapdragon chips and Amazon for packaging services today for their IDM 2.0 push.\n\nJust 2 weeks ago this sub and others were joking \"who would ever let Intel manufacture their chips\".",
        "created_utc": 1627337640,
        "id": "h6mzv7n",
        "permalink": "/r/stocks/comments/orvi7o/intc_a_dying_company_or_a_value_investing/h6mzv7n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627366440.0
    },
    {
        "author": "p_giggles",
        "body": "You are overestimating bitcoin's impact on the broader semiconductor market. Last time bitcoin shit the bed in 2017 NVDA was the only company affected by it.  Companies making datacenter switches (AVGO) or PC CPUs (INTC) or mobile basebands (QCOM) or analog chips (TXN) do not care about crypto because their parts aren't used for it. \n\nI'm not sure who you're referencing by \"all the suppliers.\" Are you referring to GPU suppliers? Because it's NVDA with a little bit of AMD.",
        "created_utc": 1626481120,
        "id": "h5gmwv3",
        "permalink": "/r/investing/comments/oljzbt/semiconductor_stocks_boom_or_bust/h5gmwv3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1626509920.0
    },
    {
        "author": "stickman07738",
        "body": "**Get out when you have achieved your target and take re-entry after 4 weeks minimum ----&gt; Locking profits**\n\n**I agree with taking profits** but I would not get out and re-buy.   My strategy is at 25% growth take some profits; if it hits 50% over my purchase price - sell 1/3 or 1/2 dependent on the stock and let the free shares ride.  If you exit, you may be buying share at a higher price. \n\nYou also need to have an exit strategy to control your downside risk.  I never understood averaging down (catching a falling knife).  If a stock goes down by 15%, I sell and watch.  I ask myself what did I miss?  If it starts behaving as my earlier analyses expected, I may buy back in.  (I learned this lesson the hard way during dot-com bubble with QCOM - thought I was genius buying on the dip, only to eventually lose $300K.)",
        "created_utc": 1626550613,
        "id": "h5jqiq9",
        "permalink": "/r/stocks/comments/om6k0t/my_experience_in_last_one_year/h5jqiq9/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626579413.0
    },
    {
        "author": "TOTALLYnattyAF",
        "body": "I've been trading since 2007. I was up 10,000%, chasing momentum is what brought me back to where I am. I also consistently hit about 30% per year. Nothing is known with certainty, but I feel very strongly about CRSR and I've been in plenty of undervalued trades that moved sideways or even down before eventually finding their footing and shooting up. Not long ago, AAPL was sub $100 pre split and everyone thought the iphone was done. That was another trade I made a ton of money on. I made money on QCOM, HLF, NCLH, VIAC, and so many others. Buy and hold, concentrating my portfolio, often with very in the money LEAPS and just wait for the fundamentals to find their footing.",
        "created_utc": 1626833085,
        "id": "h5y9g7g",
        "permalink": "/r/wallstreetbets/comments/ooam3t/buy_the_fucking_dip_crsr_yolo_update/h5y9g7g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626861885.0
    },
    {
        "author": "happierdayz4me2",
        "body": "Lmao cramer saying sell qcom like a dog",
        "created_utc": 1626701398,
        "id": "h5r0q1i",
        "permalink": "/r/wallstreetbets/comments/onazr6/daily_discussion_thread_for_july_19_2021/h5r0q1i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626730198.0
    },
    {
        "author": "Chuck_Norris_Jokebot",
        "body": "You mentioned the word 'joke'. Chuck Norris doesn't joke. \nHere is a fact about Chuck Norris: \n\n &gt;Using his trademark roundhouse kick, Chuck Norris once made a fieldgoal in RJ Stadium in Tampa Bay from the 50 yard line of Qualcomm stadium in San Diego.",
        "created_utc": 1627169310,
        "id": "h6f20ym",
        "permalink": "/r/options/comments/or02ku/tell_us_the_platform_you_use_for_options_trading/h6f20ym/",
        "score": 1,
        "subreddit": "options",
        "created": 1627198110.0
    },
    {
        "author": "pigsgetfathogsdie",
        "body": "I had friends who became paper multi-millionaires from a fukkin greetingcard.com company…then…poof…lost it all.\n\nMultiply the above by a few thousand totally shady tech IPOs.\n\nFrom Wiki…was totally mental…\n\nBetween 1995 and its peak in March 2000, the Nasdaq Composite stock market index rose 400%, only to fall 78% from its peak by October 2002, giving up all its gains during the bubble. During the crash, many online shopping companies, such as Pets.com, Webvan, and Boo.com, as well as several communication companies, such as Worldcom, NorthPoint Communications, and Global Crossing, failed and shut down.\n\nSome companies, such as Cisco, whose stock declined by 86%, Amazon.com, and Qualcomm, lost a large portion of their market capitalization but survived.",
        "created_utc": 1627681007,
        "id": "h74ss00",
        "permalink": "/r/wallstreetbets/comments/ousepa/the_roaring_2020s_why_the_mother_of_all_crashes/h74ss00/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627709807.0
    },
    {
        "author": "bernie638",
        "body": "I still own 100 shares of QCOM that I bought @$57 over a long time (sold 150 shares earlier this year because it was too much of my money).  I think they will continue to do well.   5G is still early and they own the 5G modem tech.  They also plan on a lot of sales with the IOT and automobiles (cars need a modern for over the air updates and to be he-he mobile hot spots).",
        "created_utc": 1627648996,
        "id": "h72ro2t",
        "permalink": "/r/investing/comments/ouh1jn/daily_general_discussion_and_spitballin_thread/h72ro2t/",
        "score": 1,
        "subreddit": "investing",
        "created": 1627677796.0
    },
    {
        "author": "Disada1",
        "body": "Mixed AH action from earnings: FB, PYPL, LRCX down. QCOM up\n\nHope for 🌈🐻?",
        "created_utc": 1627508676,
        "id": "h6vrhv9",
        "permalink": "/r/wallstreetbets/comments/ot64mz/fraternal_association_of_gambling_gentlemen_and/h6vrhv9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627537476.0
    },
    {
        "author": "Shaun8030",
        "body": "Nice day overall so far QCOM and tesla good , paypal and FB bad",
        "created_utc": 1627583353,
        "id": "h6ziuoh",
        "permalink": "/r/CanadianInvestor/comments/otuia4/daily_discussion_thread_for_july_29_2021/h6ziuoh/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1627612153.0
    },
    {
        "author": "toydan",
        "body": "What $QCOM giveth $PYPL taketh away. \n\nAlso $TSLA don’t you fucking tease me today. It is time to break some resistance lines",
        "created_utc": 1627568843,
        "id": "h6yjygf",
        "permalink": "/r/wallstreetbets/comments/otttc6/fraternal_association_of_gambling_gentlemen_and/h6yjygf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627597643.0
    }
]