[
    {
        "author": "toydan",
        "body": "I have been trying to get right w the world/universe for some time. Think when I let 3 cars in traffic last night everything aligned.  I put everything I care about in a separate watch list manually everyday. Gives me a chance to look at them as I do it. All green except LCID which is good as that is my lone short. And PTLR a little red. \n\nI did sell my PYPL shares and got a 1/23 $250 LEAP $66.58\n\nSold my Z shares and got 2 1/23 $90 LEAP $25.83 each\n\nWith some leftover funds, Said fuk it and got SDC 150 sh and 4 1/23 $5 LEAPS @ $2.50 each. \n\nplaying SKLZ. first time in long time I am in on meme and I usually just play them like I am this one w 250 sh and selling a couple 9/10 $15 CCs. \n\nForget who it was in here, but I did hop on w them PSFE w 150 sh and sold 2 $8 CSPs. \n\nPlaying LMND for earnings did 5 11/17 80/85 Call debit spreads since I was learning those. \n\nI posted all plays real time and added these today. Will pick up more NIO somehow. So easy to make money on that one under $40. \n\nThat’s all I got today.\n\nGood luck!",
        "created_utc": 1630507899,
        "id": "hb6zds8",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630536699.0
    },
    {
        "author": "Slaxle",
        "body": "My portfolio:\nFunds:\nFSKAX - 33.43% (TOTAL MARKET)\nFSELX - 12.07 (SEMICONDUCTOR)\nFBGRX - 7.02% (BLUE CHIP)\n\nPAYPAL - 18.15%\nSOFI - 10.02%\nAMD - 3.49%\nMU - 6.96%\nFree cash - 8.85%\n\nI want to get some hidings in NVIDIA, TSM, and ASML to round off my semiconductors. Get some SQ to polish off my Fintech. Just looking for good prices.\n\nNew investments I'm looking at for fall 2021 - Industrials (xli) online retail (Amazon and IBUY)",
        "created_utc": 1630516106,
        "id": "hb7jgjh",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630544906.0
    },
    {
        "author": "Rang_Dipkin",
        "body": "PYPL is a fucking beast … have 12% of my account in it and I’m thinking about taking it to 20%",
        "created_utc": 1630505500,
        "id": "hb6tpai",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630534300.0
    },
    {
        "author": "Fabulous-Wolverine68",
        "body": "VOO, PYPL, AMD, AAPL, [SU.TO](https://SU.TO), PLTR\n\nRecently sold off a large chunk of my portfolio and put it into VOO. AAPl is currently my largest holding",
        "created_utc": 1630521788,
        "id": "hb7xcgd",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630550588.0
    },
    {
        "author": "Wild_Space",
        "body": "Currently, your quarterly data is behind a paypal. \n\nId use the information that the major free sites offer as a baseline. You need to at least offer that. Then, to pull users away you need to offer something more / special.",
        "created_utc": 1630529141,
        "id": "hb8fguc",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1630557941.0
    },
    {
        "author": "tifa3",
        "body": "pypl stock sucks, tanks whenever it gets to 291",
        "created_utc": 1630504679,
        "id": "hb6ru3f",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630533479.0
    },
    {
        "author": "BitcoinCitadel",
        "body": "I'll take a Bulgarian boy over PayPal any day",
        "created_utc": 1630507759,
        "id": "hb6z1ty",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630536559.0
    },
    {
        "author": "kja662",
        "body": "I keep my 401K balanced between index funds (value, growth, total market, real estate) and invest my brokerage account in single stocks (pypl, a go, mo, BRK.b, dis, abbv, epd, baba). So far my 401k is out performing but it’s close",
        "created_utc": 1630509032,
        "id": "hb723iy",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1630537832.0
    },
    {
        "author": "halfmanhalfrobot69",
        "body": "PYPL pleas fly again. All I ask is 300 by eow",
        "created_utc": 1630531463,
        "id": "hb8kriq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630560263.0
    },
    {
        "author": "MightyManorMan",
        "body": "The point of markets is to always push the top of the index up. If you are waiting for it to go down, you might be waiting a long long long time. \n\nLook at Paypal, pretty close to value. Company is still growing, maybe 15% a year or so. EPS is up. Sitting on cash.\n\nLook at Apple, pretty close to value. Company still growing, maybe 5% a year or so. EPS is up. Sitting on cash. And buying back their shares if they go too low... bought back about 790 million shares in 2020.\n\nMicrosoft, a little over values, growing revenue, growing earnings, sitting on cash. And buying back their shares if they go too low... bought back about 50 million shares in 2020.\n\nThere is plenty of value.",
        "created_utc": 1630515969,
        "id": "hb7j4kr",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1630544769.0
    },
    {
        "author": "DOESNT_BE_LIKE_IT_IS",
        "body": "\\*ROBINHOOD PLANS EARLY-DEPOSIT FEATURE THAT RIVALS PAYPAL, BANKS $HOOD $PYPL | \\*ROBINHOOD WORKING ON SECURITY FEATURE THAT USES VOICE ID",
        "created_utc": 1630518302,
        "id": "hb7ou9i",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630547102.0
    },
    {
        "author": "Mpcars",
        "body": "Who would’ve thought HOOD would come along and be moving goats like sq and pypl",
        "created_utc": 1630518492,
        "id": "hb7pb8v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630547292.0
    },
    {
        "author": "orgabool",
        "body": "AMZN\nSNOW\nZNGA\nTTD\nSE\nROKU\nRDFN\nLULU\nPINS\nZM\nLMND\nPYPL\nINTU\nABNB\nSKLZ\n\nTech is the only thing I'm interested in.\nMore or less equally weighted.\nProfile is moderate/high risk, buy and hold.\nTime horizon 5-10 years.\n\nPlan to add more bigger caps (GOOG, NVDA, CRM)  as paychecks come in. Will probably trim LMND and SKLZ.\n\nAny help or suggestion appreciated. Thanks",
        "created_utc": 1630497803,
        "id": "hb6e2cn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630526603.0
    },
    {
        "author": "ReggieStocker25",
        "body": "He’s very shady - doesn’t release any PR as the CEO except when he files 4 or 8k Forms. He bought $IPSI shares shortly after their high around .24 and .15. Big takeaway from the last 8k Form was his “Corbett Clause”. This company has so much potential. OTC stocks need P/R in order to survive. No volume almost guarantees the stock will regress negatively. That’s been the case since April. $IPSI has invested in a P/R according to one of their early 4-K Form so hopefully that comes into fruition. He put his daughter on IPSI chair board as a high ranking member. The kiosks deployment has been delayed but the blame is due mostly to covid. One thing I can see Corbett did well is eliminate all the toxic debt. I’m just worried he runs this stock up and dips. $IPSI has the potential to be the next PayPal and having William Corbett at the helm has raised more questions than answers in the shareholders eyes. Not to mention spelling mistakes on the website. This company is very early which is a good thing, they just need to clean up their errors",
        "created_utc": 1630525840,
        "id": "hb87aza",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630554640.0
    },
    {
        "author": "toydan",
        "body": "Good morning ☕️ ☕️\n\nFelt like a [avocado socks  ](https://imgur.com/a/PlN65h1) kinda day\n\nHad an epiphany and will be moving shit around and picking up and averaging up in both PYPL and PLTR. \n\nFeels like a green day and mega cap tech day. Those are my favorite\n\nStay classy San Diego ✌️",
        "created_utc": 1630500844,
        "id": "hb6jnog",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630529644.0
    },
    {
        "author": "orgabool",
        "body": "AMZN\nSNOW\nZNGA\nTTD\nSE\nROKU\nRDFN\nLULU\nPINS\nZM\nLMND\nPYPL\nINTU\nABNB\nSKLZ\n\nTech is the only thing I'm interested in.\nMore or less equally weighted.\nProfile is moderate/high risk.\n\nPlan to add more bigger caps (GOOG, NVDA, CRM)  as paychecks come in.",
        "created_utc": 1630488047,
        "id": "hb60qpo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630516847.0
    }
]