[
    {
        "author": "desquibnt",
        "body": "It’s data management. Have you ever worked for a larger company that’s been around for a while? If you have, chances are they operate on a conglomeration of programs that have accumulated over the years that all don’t talk to each other. Decision making at these companies takes longer and is inefficient because they have to pull data from multiple systems and sometimes the data you get is unreliable because the programs are old af. \n\nMy old job and my current job are both at Fortune 500 companies and both operate on a Frankenstein system of multiple programs for CRM. Both companies constantly talk about overhauling the system but it never gets done because of the legacy spaghetti code involved. You change/upgrade one program and then it becomes incompatible to the rest and you need to upgrade everything. Upgrading would mean overhauling everything at the same time which is a MASSIVE project. \n\nPLTR is coming in with one propriety program/OS that’s plug and play. Get rid of your old Frankenstein CRM that’s 50 different programs and replace it with Gotham. Now the entire system and database talks to each other and you can get real data in real time.",
        "created_utc": 1633932948,
        "id": "hg77fkw",
        "permalink": "/r/stocks/comments/q5kk1r/if_you_had_to_choose_one_stock_between_tsla_and/hg77fkw/",
        "score": 83,
        "subreddit": "stocks",
        "created": 1633961748.0
    },
    {
        "author": "Init_4_the_downvotes",
        "body": "I saw salesforce ads in the airport and the metro in California about four years ago, I worked a shitty call center job that used it. It was good software and made my life easier. Figured eventually all shitty jobs would use it. Largest ROI in my life.",
        "created_utc": 1634317565,
        "id": "hgrdcx0",
        "permalink": "/r/stocks/comments/q8nvs5/im_19_and_i_want_to_use_stocks_to_retire_at_50_is/hgrdcx0/",
        "score": 50,
        "subreddit": "stocks",
        "created": 1634346365.0
    },
    {
        "author": "FullTackle9375",
        "body": "He has been pushing AMD,NVDIA,Salesforce and FAANG for years he even made up the term, if you inversed him you would be broke.   \nHe makes dumb predictions but he would still do better than most here including you.",
        "created_utc": 1633296105,
        "id": "hf9wpyu",
        "permalink": "/r/stocks/comments/q0poeh/how_does_jim_cramer_still_have_a_job/hf9wpyu/",
        "score": 42,
        "subreddit": "stocks",
        "created": 1633324905.0
    },
    {
        "author": "hnr01",
        "body": "Unified communications as a service.\n\nIf you like high risk high reward, Zoom.\n\nIf you want stable growth, Verizon, Cisco, Microsoft. All play in the UCaaS space.\n\nHere’s what you really want to look at: Salesforce. They bought Slack. All signs point to them buying out a pure UCaaS play in the near future.\n\nThat’s where I’d put my money.",
        "created_utc": 1634181227,
        "id": "hgkhdvf",
        "permalink": "/r/stocks/comments/q7k5lf/why_are_telecom_stocks_getting_sold_off/hgkhdvf/",
        "score": 41,
        "subreddit": "stocks",
        "created": 1634210027.0
    },
    {
        "author": "TajPereira",
        "body": "SOFI\nCRWD\nCRM",
        "created_utc": 1635202505,
        "id": "hi1nces",
        "permalink": "/r/stocks/comments/qfqo6y/what_are_your_highest_conviction_stock_picks_for/hi1nces/",
        "score": 26,
        "subreddit": "stocks",
        "created": 1635231305.0
    },
    {
        "author": "Beetlejuice_hero",
        "body": "I owned NVDA in 2009 @ ~3/share, sold a few years later for a decent profit.  Value today: $180,000.  \n\nI owned a LOT of ATVI @ 10.5/share in 2012, sold a few months later for a decent profit.  Value today: well over a million.\n\nOwned, again a lot, of AMAT in 2012 @ 11/share, sold a few months later for a decent profit.  Value today: also well over a million.\n\nWaste Management @ 32/share in 2012.  God do I wish I held that.  The dividends alone would be so sick (7%).  Hate that I sold that  one.  Absolutely rock-solid company currently @158/share.\n\nI've crushed it with AAPL, CRM, LMT, BIDU.  I've *been* crushed by OXY and an awful small-cap whose name I can't even bear to repeat.  \n\nOn and on...\n\nWin some, lose some.  Can't go back in time.  Keep your eye on the ball.  More winners ahead.\n\nAt the end of the day, most people should just stick to 80%+ index funds, with a little left over for higher risk in individual stocks.\n\nI don't do that I guess cause I'm a glutton for punishment and/or have a slight gambling problem, but that's the path most should take.",
        "created_utc": 1634247156,
        "id": "hgnsg5z",
        "permalink": "/r/stocks/comments/q87iql/missed_out_on_55k_because_my_exit_was_hit/hgnsg5z/",
        "score": 17,
        "subreddit": "stocks",
        "created": 1634275956.0
    },
    {
        "author": "Dmoan",
        "body": "Hmm my best stocks CRM, XOM, C, MSFT, TWTR etc\n\nWorst stocks: RKT, CRSR\n\nHmm need to stop buying stocks pumped in WSB",
        "created_utc": 1634244266,
        "id": "hgnnpcm",
        "permalink": "/r/wallstreetbets/comments/q87iwg/what_are_your_moves_tomorrow_october_15_2021/hgnnpcm/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1634273066.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "Adbe \n\nCRM\n\nTTWO",
        "created_utc": 1635198364,
        "id": "hi1dxkf",
        "permalink": "/r/stocks/comments/qfqo6y/what_are_your_highest_conviction_stock_picks_for/hi1dxkf/",
        "score": 15,
        "subreddit": "stocks",
        "created": 1635227164.0
    },
    {
        "author": "Joltarts",
        "body": "They are the next level of CRM.\n\nLook at salesforce and SAP. Widely  used and adopted in enterprises.\n\nBut guess what? None of them have the capability of conducting data analytics and deducing answers effectively. Rudimentary answers to things like what are my customers interested in purchasing, currently requires you to do it yourself. \n\nPLTR will not only do this automatically, they can even plan things like stock inventory and forward planning and business strategy.\n\nHonestly, the biggest competitor to PLTR right now is Salesforce and PLTR absolutely blows salesforce out of the water.",
        "created_utc": 1633950158,
        "id": "hg7rf8v",
        "permalink": "/r/stocks/comments/q5kk1r/if_you_had_to_choose_one_stock_between_tsla_and/hg7rf8v/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1633978958.0
    },
    {
        "author": "hnr01",
        "body": "For sure. Good luck. Buy on a red day. $CRM is so aggressive in mergers and acquisitions that it’s only a matter of time.",
        "created_utc": 1634181436,
        "id": "hgkhses",
        "permalink": "/r/stocks/comments/q7k5lf/why_are_telecom_stocks_getting_sold_off/hgkhses/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1634210236.0
    },
    {
        "author": "RollShotCornerPocket",
        "body": "One of my largest next decade and beyond plays is fintech. Of which I think $SOFI has an incredible runway to take off. It's floor is being a buyout target for a $JPM or $GS type that wants to integrate their hyper growth customer base into legacy banking. I think it's at fair value right now just under $20 a share. \n\n&amp;#x200B;\n\n$FRSH is also on my watch list. Use the software for work and it just works. Really great product, regular joe schmoes can use their API Integrations to optimize work flows, etc. It won't be salesforce but it can cut into that market if you ask me. Valuation prior to upcoming earnings is a little rich, but mid to high 30's would be a solid entry. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n$PSFE is a massive risk massive reward situation. Absolute beat down stock with heavy institutional investment in the 7$ range. It's a payment processing platform that some consider a proxy to the gambling sector. Lots of debt from M&amp;A but the price targets are juicy. (Trading around 8$ right now with many targets of 15). \n\n&amp;#x200B;\n\nStripe (Whenever it IPO's next year). Can you tell I like fintech? lol",
        "created_utc": 1634313166,
        "id": "hgr2mbv",
        "permalink": "/r/RobinHood/comments/q8mgv8/where_to_invest_10k_presently/hgr2mbv/",
        "score": 12,
        "subreddit": "RobinHood",
        "created": 1634341966.0
    },
    {
        "author": "ebichumannn",
        "body": "I think they are both great but I'm not into AMD for a couple reasons;\n\nCompetition,  its the hottest sector in the market and everyone is drawing blood to stay at the top.\n\nBy comparison PLTR has very limited competition, and the competition it does have are not exactly apples to apples. CRM, SNOW, Microsoft and Amazon would technically be competitors but with different twists.\n\nAMD is also positioned in a cyclical environment , which I hate. Cyclicality + not knowing how things are going to turn out for them long term make it a no go for me.\n\nIn the near term ( maybe 5 years ) Id say AMD is a no brainer buy, but the cyclicality of it makes it so It cant be a core holding for me. IF I had to invest in the sector, I'd go with something like ASML or ASYS. A supplier to the cyclicals. A pick and shovel play if you will.\n\nPLTR also benefits from the government contracts. Some people have said that its both its strength and its weakness, but Id argue that it provides no exposure to weakness what so ever.\n\nThe fact that PLTR has been the government's T1 data analytics and AI supplier for over a decade means they are sitting on technology light years ahead of the private sector. When and how they will be able to execute said technology is an unknown.\n\nPLTR has a lot of unknowns, as you stated, and this is a big reason why institutions shy away from the company. We will never be able to get a full peak behind the curtain, but I argue that this is PLTR's strength. Its relationship with government ensures its longevity.\n\nPLTR is just starting its foray into the private/commercial sector.\n\nIf a company is good enough to protect American lives and Uncle Sam's interest's , it projects a level of security , trustworthiness and safety  that they will be able to leverage in the private sector.\n\nLastly, considering AMD exists in the hardware ecosystem, growth will always be dependent on externalities such as supply chain issues ( currently on full display ) and commodity availability etc.\n\nPLTR doesnt require external inputs to sell their products. So exponential growth can be achieved with much less resistance.\n\n&amp;#x200B;\n\nAnyways, thats my pitch. PLTR is my second biggest holding. Its also the one that lets me get the best sleep at night. I truly never worry about it. Max drawdown I figure is about 50% but with everything it has going for it, even in an economic recession, I see it as unlikely.\n\nOnce their SPAC deals and investments start bearing fruit, you're going to see institutions begin to FOMO into the company. At that point government contracts will be nothing but a distant memory.",
        "created_utc": 1633567683,
        "id": "hfo8xn6",
        "permalink": "/r/stocks/comments/q2wh8s/pltr_vs_amd/hfo8xn6/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1633596483.0
    },
    {
        "author": "FlorianNV",
        "body": "Here are the 30 confirmed stocks (so far) in Jim Cramer's Investing Club emails as of 10/25/21: Abbott Laboratories, Abbvie, Alphabet, Amazon, AMD, American Eagle Outfitters, Apple, Boeing, Broadcom, Costco, Disney, Eli Lilly, Estee Lauder, Facebook, Ford, Honeywell, Linde, Marvell, Mastercard, Microsoft, Morgan Stanley, Nucor, Nvidia, PayPal, Salesforce, UPS, Union Pacific, Walmart, Wells Fargo, Wynn.",
        "created_utc": 1635196665,
        "id": "hi19xpz",
        "permalink": "/r/investing/comments/qfopi1/which_30_or_so_stocks_are_in_jim_kramers/hi19xpz/",
        "score": 11,
        "subreddit": "investing",
        "created": 1635225465.0
    },
    {
        "author": "wkb1111",
        "body": "Don't buy ibm right now. They are pre-spinoff and you won't receive share in their spin off company. \n\nI'd like to sarcastic ally respond - Yeah, all old bluechips from the 90s are going to 0. Just look at Microsoft. VISA. Cisco. Oracle. \n\nWhat operating systems do majority of servers run? It's not windows, or iOS, or android. It's Linux. And the best one is redhat. It can run on and interface with any of the cloud providers securely. It's a platform to switch between any cloud provider easier than conforming to each cloud setup separately. \n\nWhat company makes the best server to process transactions for credit cards, banks, large retailers and service companies? Ibm, their processors are purpose built. Some like banks, hospitals, insurers are require by law to run their own data transaction systems. Their 7nm power 10 / telum processors can handle more work load any one else. Amd and Intel chip followers take note of ibm's CPU architecture. Specifically their cash system that result in much lower latency and cash pools in the size of gigabytes, also shared memory pools in terabytes. \n\nThey came up with the 2nm and lower transistor process for chips. They led in creating a programming language for quantum computing. They set a world record in data storage solution with their 580 terabyte tape units. Not worth listing all the little things they do. \n\nTheir new CEO is outspoken about collaboration and getting ibm out from being a siloed company. I am sure they will find the right partners for their tech. He switched the company over to Salesforce and slack and such. Deepens partnerships with companies like SAP and others. Increasing consulting business. IBM was also early in jumping in and providing lots of online open courses with100s of thousands taking part across the world. \n\nIBMs role might be niche and you might not understand them. But, it doesn't mean they are not relevant globally. $75B in revenues.",
        "created_utc": 1635403437,
        "id": "hicoi46",
        "permalink": "/r/stocks/comments/qh9osa/ibm_cant_keep_going_down_right/hicoi46/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1635432237.0
    },
    {
        "author": "NubChumpster",
        "body": "I'd bet that BABA, FB, VICI, AAPL, MSFT, GOOG, AMZN, CRM, COST, SPOT all out perform VOO in the next 5 years",
        "created_utc": 1635582537,
        "id": "himd9ig",
        "permalink": "/r/investing/comments/qir3da/pick_your_5_growth_stocks_for_2022/himd9ig/",
        "score": 10,
        "subreddit": "investing",
        "created": 1635611337.0
    },
    {
        "author": "CrimsonBrit",
        "body": "* Paypal ($PYPL)   -   47%\r\n* Shopify ($SHOP)    -   15%\r\n* Zillow ($Z)    -   7%\r\n* Cloudflare ($NET)     -   4%\n* Peloton ($PTON)     -   4%\n* Apple ($AAPL)     -   3%\n* Spotify ($SPOT)     -   3%\n* Amazon ($AMZN)     -   3%\n* Walt Disney Co ($DIS)    -   3%\n* Mastercard ($MA)     -   2%\n* Salesforce.com ($CRM)     -   2%\n* Microsoft ($MSFT)     -   2%\n* Up Fintech Holding ($TIGR)     -   1%\n* Visa ($V)     -   1%\n* Southwest Airlines ($LUV)     -   &lt;1%\n* Delta Air Lines  ($DAL)     -   &lt;1%\n* Cash     -   1%",
        "created_utc": 1633449118,
        "id": "hfhpl8a",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hfhpl8a/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1633477918.0
    },
    {
        "author": "michael_curdt",
        "body": "AAPL, MSFT, FB, NVDA, DIS, SQ, CRM, NKE, TWLO, NEE",
        "created_utc": 1633664716,
        "id": "hftc8q9",
        "permalink": "/r/stocks/comments/q3ounw/if_you_had_to_pick_only_10_stocks_to_invest_in/hftc8q9/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1633693516.0
    },
    {
        "author": "Psyched4this",
        "body": "They recently started expanding their salesforce as well",
        "created_utc": 1633193472,
        "id": "hf47487",
        "permalink": "/r/wallstreetbets/comments/pzxjei/over_240k_tesla_q3_2021_vehicle_production/hf47487/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633222272.0
    },
    {
        "author": "Marketdog91",
        "body": "I’m confused why you think that’s unreasonable. It’s how normal growth companies operate. Once they reach profitable scale, if demand stays in tact, profits grow exponentially. \nFor example. \nAdobe profits 2015= 630 2020= 5260\nFB profits 2014 = 2940 2020 = 29146\nCRM 2018 = 363 2020 = 4072.\n\nNow you may be correct in your assumption that Tesla is currently overvalued, but the market is pricing in the future, and Tesla is THE dominant car company at the moment. If things stay the same as they’ve been for the last 3 years, Tesla will grow into there valuation and probably continue to grow. \n\nAgain, I don’t disagree that they are overvalued, but they are overvalued for a good reason. Some of the smartest minds in the world are betting on them. The retail investor is just small part of why the shares go up.!",
        "created_utc": 1635208428,
        "id": "hi2051i",
        "permalink": "/r/stocks/comments/qfte3a/tesla_is_the_most_overvalued_company_of_all_time/hi2051i/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1635237228.0
    },
    {
        "author": "1ll0gic",
        "body": "30 years old\n\n21% CRM\n\n18% NVDA\n\n16% UPST\n\n14% CRWD\n\n12% NET\n\n12% INMD\n\n8% SOFI\n\nThinking of getting rid of UPST and maybe another one to add an energy stock and consumer cyclical stock",
        "created_utc": 1635529198,
        "id": "hijexr3",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hijexr3/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635557998.0
    },
    {
        "author": "coughingcoffee01",
        "body": "20% AMZN, 17.5% BTI, 15% CRM, 15% LMT, 12.5% D, 7.5% YUMC, 7.5% BUD, 3% BABA ( 140$ / share ) and 2% cash to DCA the position of BABA I just opened :p",
        "created_utc": 1633382128,
        "id": "hfeirgm",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hfeirgm/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1633410928.0
    },
    {
        "author": "ThumbBee92",
        "body": "Not much synergies evident and you usually pay a premium to acquire..Pinterest was already richly valued. Now consider buying it for 20% more.\n\nIf PayPal doesn't use cash, they'll either pay with stock or debt. So either dilution or increased debt gearing.\n\nFor context, look at Salesforce buying Tableau or Slack. It might pay off in the long term, but bearish in short.",
        "created_utc": 1634752422,
        "id": "hhe07o2",
        "permalink": "/r/stocks/comments/qbwyfj/rstocks_daily_discussion_wednesday_oct_20_2021/hhe07o2/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1634781222.0
    },
    {
        "author": "zg44",
        "body": "Money just flying into GOOG, MSFT, CRM, and TSLA there in the last hour.",
        "created_utc": 1635537637,
        "id": "hik0g4n",
        "permalink": "/r/wallstreetbets/comments/qi9clo/daily_discussion_thread_for_october_29_2021/hik0g4n/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635566437.0
    },
    {
        "author": "SkullRunner",
        "body": "I was lead promotional tech lead of a major Beer brands Facebook pages/apps about 12 years ago when it was a big deal in the engagement space, before the brand dialed back all engagement plays on the platform because, guess what, legal drinking age to 35 were as a demographic getting smaller on the platform, aging out with no fresh wave coming in behind, so the brand started to claw back their presence to a basic social posting schedule vs putting in content and promotions at scale, cause those dollars were better spent elsewhere.  \n\n\nMy opinion of FB is of someone that has worked in advertising and marketing tech development focused on CRM and stats research, for the past 15 years or so.   I have seen what it was, and now what it is.  \n\n\nI stand by my assessment as does Facebooks own internal research and 3rd parties that the platform is at large an echo chamber for those that do not think critically, are manipulated easily by what the algorithm is feeling them and is an older population of users.   It's not debatable.   \n\n\nIf you are a FB user it does not mean that's you or your friends (if you're taking this personally) peer group, age group, experience and interests can not be other than what I'm describing, you could see a feed of content that is yours and feel FB is not what I'm saying, that is the social bubble / echo chamber effect at work with their algorithm, they are not all bad, just the majority of them are.",
        "created_utc": 1635280012,
        "id": "hi5rxal",
        "permalink": "/r/CanadianInvestor/comments/qg5e59/financial_post_facebook_alarmed_by_drop_in_teen/hi5rxal/",
        "score": 5,
        "subreddit": "CanadianInvestor",
        "created": 1635308812.0
    },
    {
        "author": "zg44",
        "body": "Don't be a perma-bear or perma-bull.\n\nJust follow the market. \n\nToday's move was super-bullish in this downtrend.  A big red to green move from -1.2% or so is a huge move.\n\nAnd the debt ceiling coming into some form of resolution is a big deal, shows neither side is willing to actually blow up the situation.\n\nChinese markets have completely retraced their pandemic gains.\n\nWe look due for a significant bounce even if it fails eventually.\n\nLook at the market leaders and their strength today: MSFT and other big tech are looking really good.\n\nPANW, CRM, AFRM and others look like they want to run.  That's usually a good sign for a couple green sessions.\n\nObviously China or any other news can dump the market but we look set for some kind of multi-day rally.",
        "created_utc": 1633555450,
        "id": "hfnj2w4",
        "permalink": "/r/wallstreetbets/comments/q2s87a/what_are_your_moves_tomorrow_october_07_2021/hfnj2w4/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633584250.0
    },
    {
        "author": "high_roller_dude",
        "body": "yeah obviously premiums are not huge but i dont reach for yield. id rather play things conservatively whether im selling calls or puts. \n\nalso i sell far otm calls on other stocks i own, including msft, crwd, crm, adbe, etc. all combined, they generate enough income for me to cover my grocery bills for a  month, which is good enough for me",
        "created_utc": 1633567893,
        "id": "hfo9dpq",
        "permalink": "/r/stocks/comments/q2x7l1/cloudflare_net/hfo9dpq/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1633596693.0
    },
    {
        "author": "trickintown",
        "body": "&gt;UX is very simple.\n\nThe simplicity makes it so elegant. No too much graphics, no unwanted dumb animations, highly customizable workflow. No unwanted distractions - the slack/salesforce integration makes work so much pleasurable.",
        "created_utc": 1635227299,
        "id": "hi2z2qa",
        "permalink": "/r/stocks/comments/qfyfib/salesforce_for_a_long_term_investment/hi2z2qa/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635256099.0
    },
    {
        "author": "dannytrevito",
        "body": "As a tech guy, I dont understand how someone can pay that much for a crm websolution, its like Oracle but for crm..",
        "created_utc": 1635223466,
        "id": "hi2tnc6",
        "permalink": "/r/stocks/comments/qfyfib/salesforce_for_a_long_term_investment/hi2tnc6/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635252266.0
    },
    {
        "author": "Beetlejuice_hero",
        "body": "Getting killed with it right now.  $56.30 cost basis. Set an average down buy point of 48 if it reaches that.  \n\nVZ is what it is.  Revenue juggernaut, but massive debt and as unsexy a company as there is.  Yes I see value at this level and especially in the 40s.  I'm holding for now and re-investing dividends.  \n\nLuckily my much larger CRM position has soared so it's more than off-set my VZ losses.",
        "created_utc": 1634156780,
        "id": "hgj0gs5",
        "permalink": "/r/stocks/comments/q7er7g/time_to_buy_the_dip_on_vz/hgj0gs5/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1634185580.0
    },
    {
        "author": "The_Folkhero",
        "body": "This company is a beast! Blow away earnings every time. Was up 100% in ONE DAY back in March. Salesforce CEO Marc Benioff, Mark Cuban and former Google CEO Eric Schmidt are investors. \n\nhttps://www.cnbc.com/2021/03/22/upstart-up-171percent-in-three-days-as-momentum-pours-into-fintech-company.html?__source=androidappshare",
        "created_utc": 1634406674,
        "id": "hgvukzq",
        "permalink": "/r/wallstreetbets/comments/q934qc/youre_breaking_up_market_manipulation_leaving/hgvukzq/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634435474.0
    },
    {
        "author": "coolcomfort123",
        "body": "Probably only a little bit, but much better compared to other stocks like NET and CRM.",
        "created_utc": 1634689183,
        "id": "hhavmsb",
        "permalink": "/r/stocks/comments/qbkt1t/is_msft_becoming_overvalued/hhavmsb/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1634717983.0
    },
    {
        "author": "trickintown",
        "body": "I’m contemplating of going big on CRM, but their PE is right now not in accordance with market",
        "created_utc": 1635231489,
        "id": "hi34ce8",
        "permalink": "/r/stocks/comments/qfqo6y/what_are_your_highest_conviction_stock_picks_for/hi34ce8/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1635260289.0
    },
    {
        "author": "springsprint",
        "body": "TBF, you could say the same about Salesforce. Even their own employees seem a bit puzzled about what their company does.",
        "created_utc": 1633935497,
        "id": "hg7aqvm",
        "permalink": "/r/stocks/comments/q5kk1r/if_you_had_to_choose_one_stock_between_tsla_and/hg7aqvm/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633964297.0
    },
    {
        "author": "Beetlejuice_hero",
        "body": "Well the beauty of index funds is you just buy buy buy and never sell, regardless of up, down, or loop de loop.  I own SCHB, SCHA, and DGRO and will never sell.\n\nI also own one \"never sell\" stock (AAPL) and there are certainly more examples of those types of companies.  Buy and only buy.  \n\nBut for more \"trades\" or stocks you're uncertain about or concerned about locking in profit?  It can be very tough to know when to sell.  Sucks to watch a 20% gain shrink back to zero or negative, but oftentimes that's necessary to enjoy those big gaps up (would have made me a millionaire with ATVI &amp; AMAT). Also happened to me recently with CRM.  Up nice amount, pulled way back, then rocketed back up.  Still holding.\n\nAt the end of the day it's best to just focus on Index funds and leave a small % (5, 10, maybe 20) to play around.  So no matter what happens with your higher potential, more volatile portion, you always have that \"never have to worry\" 80+% to let you sleep at night and keep you continually invested.",
        "created_utc": 1634260855,
        "id": "hgomay3",
        "permalink": "/r/stocks/comments/q87iql/missed_out_on_55k_because_my_exit_was_hit/hgomay3/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1634289655.0
    },
    {
        "author": "newzstockchick",
        "body": "Apparently RKT is partnering with CRM. It’s up 6% rn",
        "created_utc": 1635526960,
        "id": "hij94a5",
        "permalink": "/r/wallstreetbets/comments/qi9clo/daily_discussion_thread_for_october_29_2021/hij94a5/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635555760.0
    },
    {
        "author": "MiamiFan-305",
        "body": "Didn't check go to verify but I'm assuming Salesforce, square and crowdstrike are at decent percentages in qqq? So some more overlap there.",
        "created_utc": 1633399021,
        "id": "hffioq9",
        "permalink": "/r/StockMarket/comments/q1k63c/new_to_investing_so_i_would_love_to_hear_your/hffioq9/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1633427821.0
    },
    {
        "author": "BeautifulPreparation",
        "body": "CRM has been free money lately",
        "created_utc": 1634659168,
        "id": "hh8vik8",
        "permalink": "/r/wallstreetbets/comments/qb89rl/daily_discussion_thread_for_october_19_2021/hh8vik8/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634687968.0
    },
    {
        "author": "UKbigman",
        "body": "Salesforce deal for mortgage-as-service…not really sure what it means but the CEOs will be on CNBC shortly.",
        "created_utc": 1635534345,
        "id": "hijs1hf",
        "permalink": "/r/wallstreetbets/comments/qi9clo/daily_discussion_thread_for_october_29_2021/hijs1hf/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635563145.0
    },
    {
        "author": "Dangerous_Contact439",
        "body": "agree. doing this with speculative stocks would be stupidity. AAPL wouldnt necessarily fit that bill - for Aapl, MSFT, CRM etc to be falling like a knife multiple businesses should be failing at once.",
        "created_utc": 1633212319,
        "id": "hf5emlp",
        "permalink": "/r/options/comments/q043uv/put_options_on_margin/hf5emlp/",
        "score": 3,
        "subreddit": "options",
        "created": 1633241119.0
    },
    {
        "author": "desquibnt",
        "body": "I’d say more like Salesforce from a CRM perspective but PLTR’s platform reaches much further than just CRM. It can go into supply chain management as well.",
        "created_utc": 1633950956,
        "id": "hg7sgm8",
        "permalink": "/r/stocks/comments/q5kk1r/if_you_had_to_choose_one_stock_between_tsla_and/hg7sgm8/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633979756.0
    },
    {
        "author": "heyheymustbethemoney",
        "body": "Google, Align, intuitive surgical, Nvidia, AMD, Adobe, SalesForce. Shopify, Snap, Affirm, UpStart, MongoDB, Zscaler, Crowdstrike \n\nCrazy valuations but I buy these on all dips.",
        "created_utc": 1633841980,
        "id": "hg2irov",
        "permalink": "/r/StockMarket/comments/q4lnar/struggling_in_the_market_rate_my_holdings_please/hg2irov/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1633870780.0
    },
    {
        "author": "milanello09",
        "body": "CRM is Salesforce, competitor to Freshworks. You don’t have to completely rid of Freshworks, just weight the portfolio to not be so dependent on speculation. Speculative plays are good, and could work out and make you a a lot of money, but could also lose you a lot if you’re missing a solid foundation.\n\nIf you want to be more data-driven, go to finviz.com (free) and you can find stocks you like based of data.",
        "created_utc": 1633733305,
        "id": "hfwv712",
        "permalink": "/r/stocks/comments/q42gio/looking_for_some_advice_on_these_stocks/hfwv712/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633762105.0
    },
    {
        "author": "milanello09",
        "body": "IMO, this is not a strong portfolio. You are somewhat diversified metals and gases, but the rest are speculative plays. It doesn’t matter how long you have to stay invested if the companies won’t grow or be around. \n\nStem and Sofi are the most interesting here, but those should be low weighted positions in the portfolio, not a core holding.\n\nIf I were you, I’d get rid of the literal crap plays like WISH and PSFE. Reduce exposure on some of the gas plays (LAC incl), it makes up like 50% of your net worth. Trade the more speculative plays with no backing like FRSH for more stable competitors like CRM and add some more stable tech (FAANG). \n\nThere are a million better assets out there to choose from besides these ones.\n\nJust my 1 cent.",
        "created_utc": 1633732265,
        "id": "hfwsvx1",
        "permalink": "/r/stocks/comments/q42gio/looking_for_some_advice_on_these_stocks/hfwsvx1/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633761065.0
    },
    {
        "author": "_foldLeft",
        "body": "CRM now",
        "created_utc": 1633988515,
        "id": "hga1jfk",
        "permalink": "/r/wallstreetbets/comments/q64csq/what_are_your_moves_tomorrow_october_12_2021/hga1jfk/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634017315.0
    },
    {
        "author": "evanc1411",
        "body": "Shoutout to cloud sector and CRM (Salesforce)",
        "created_utc": 1634966064,
        "id": "hhpmlq6",
        "permalink": "/r/investing/comments/qdua1s/how_are_you_preparing_for_2022/hhpmlq6/",
        "score": 3,
        "subreddit": "investing",
        "created": 1634994864.0
    },
    {
        "author": "FlorianNV",
        "body": "Salesforce is on the list. I haven't seen anything in the emails yet about Pepsi and CVS. But I don't think the list of 30 above is the complete list. I bet there are several more stocks in his trust.",
        "created_utc": 1635198077,
        "id": "hi1d9fu",
        "permalink": "/r/investing/comments/qfopi1/which_30_or_so_stocks_are_in_jim_kramers/hi1d9fu/",
        "score": 3,
        "subreddit": "investing",
        "created": 1635226877.0
    },
    {
        "author": "gouligan_GenY",
        "body": "RKT Volume surge sounds like they will be on CNBC closing bell. New says announcing partnership with salesforce.\n\nanyone confirm?",
        "created_utc": 1635531908,
        "id": "hijlwuf",
        "permalink": "/r/wallstreetbets/comments/qi9clo/daily_discussion_thread_for_october_29_2021/hijlwuf/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635560708.0
    },
    {
        "author": "_hiddenscout",
        "body": "They operate in a different space than Salesforce. Salesforce is more a CRM. \n\nAtlassian has a suite of software more commonly used in software development. Their bread and butter is JIRA. It allows you track user stories when developing software. JIRA also has a roboust market place where people sell apps. \n\nBesides JIRA, they offer bitbucket. There is three big code repositories: Gitlab, GitHub, and Bitbucket. Atlassian owns Bitbucket. JIRA and BitBucket integrate really nicely, since when building software, it's takes a team. You change your code base with something called a pull request, which is tracked in the repo. \n\nThe other major product their offer is their Wiki's. \n\nThere really isn't too many bear cases against Atlassian. I've used JIRA at every sofware place I've worked.\n\nI think the biggest bear case agains them is that there is more competition coming into the space, especially for JIRA.",
        "created_utc": 1635454322,
        "id": "hifgwl6",
        "permalink": "/r/stocks/comments/qhj6bk/rstocks_daily_discussion_options_trading_thursday/hifgwl6/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635483122.0
    },
    {
        "author": "VisualMod",
        "body": "&gt;Rocket Mortgage Unveils Partnership with Salesforce, Providing Transformational Mortgage Services to Financial Institutions\n$RKT\n\n^\\*Walter ^Bloomberg ^[@DeItaone](http://twitter.com/DeItaone) ^at ^2021-10-29 ^13:00:47 ^EDT-0400",
        "created_utc": 1635526856,
        "id": "hij8ulj",
        "permalink": "/r/wallstreetbets/comments/qi9clo/daily_discussion_thread_for_october_29_2021/hij8ulj/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635555656.0
    },
    {
        "author": "YoloStonks4Tendies",
        "body": "That deal with Salesforce looks great",
        "created_utc": 1635528071,
        "id": "hijbzge",
        "permalink": "/r/wallstreetbets/comments/qi9clo/daily_discussion_thread_for_october_29_2021/hijbzge/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635556871.0
    },
    {
        "author": "My_Bacon",
        "body": "Rocket and Salesforce partnering up eh?",
        "created_utc": 1635527125,
        "id": "hij9ju8",
        "permalink": "/r/wallstreetbets/comments/qi9clo/daily_discussion_thread_for_october_29_2021/hij9ju8/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635555925.0
    },
    {
        "author": "tomb_bomt",
        "body": "There are a few things that worry me about Salesforce tbh, good company though.\n\nNegative earnings growth over the past year and their earnings are forecast to grow by 10.37% for the next 5 years, thats not exactly shit hot. For a company with a huge P/E ratio and a PEG ratio of 4.23, those growth figures aren't really what I'd expect to see. Though when looking at their balance sheet, it's bloody impressive haha!\n\nBut when I calculate the fair value of the stock it's $295. So tbh, in the long term, as long as they keep growing at rates currently predicted, you should have a decent investment. I'm just not sure it's as hot as you think it might be, then again I could be completely wrong haha! Just playing devil's advocate a little here.",
        "created_utc": 1635223292,
        "id": "hi2tdpa",
        "permalink": "/r/stocks/comments/qfyfib/salesforce_for_a_long_term_investment/hi2tdpa/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635252092.0
    },
    {
        "author": "bruhmomentsdeepfried",
        "body": "CRM NET SNOW STEM",
        "created_utc": 1633101472,
        "id": "hezfpd4",
        "permalink": "/r/stocks/comments/pyx2gr/quality_stocks_at_a_discount/hezfpd4/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633130272.0
    },
    {
        "author": "play_it_safe",
        "body": "&gt; such a good deal!\n\nI think this is the problem. It's a good deal relative to where it was. But from a valuation perspective, it's still an almost 2 billion dollar company with a high multiple with a lot of uncertainty around it. I know people are defensive about it and another certain 3D printing company, but there are questions to ask to make sure it's a quality stock in this sort of risk-off environment.\n\nDoes it have long term staying power in 3D printing? How does the market even value that sector, outside of speculation? Will it have proven cash flows? As a former SPAC, does it have skeletons in the closet and is there something we don't know about it (SPAC route to becoming a public company undergoes less scrutiny, and is partly why they're priced at a discount for a while, not to mention some very shady SPACs meaning guilt by association)? \n\nPeople are selling this sort of uncertainty about sector, company, and valuation, and moving to proven quality names in tech in this sort of environment, as well as mainstay sectors like energy and financials, and this may be why it's selling off so hard, along with other small cap names that have a lot of potential but are speculative in one way or another, like SKLZ, FUBO, etc. It doesn't mean it's a good deal, though if small cap growth stocks come back in force, DM can surge back to $10. But it's hard to say. That's a gamble.\n\n\"Quality\" is really hard to gauge admittedly. But I'd say a company that's been around for at least a few years and has proven cash flows and a business with less speculative risk factored in is what this post is getting at.\n\nIn contrast, take a look at $PRLB, another 3D printing stock. Has been around for a while, consistently doing good business, and now trading close to March 2020 lows. Why? It's just out of favor in the market and very likely being manipulated. Buying it is still a gamble somewhat and carries some of the same risks as DM, but at least with it we have a much larger span of relative valuation to draw on and a company with solid financials to fall back on. \n\nThat said, PRLB is a falling knife and still not truly quality by any means. But if I wanted to buy in the sector, that would be it. Most fundamentally sound company in the sector is what to go for IMO\n\nI've been buying small cap growth, too, but very selectively and slowly over time, because they can dip to stupid low levels. INMD, ATKR are two. VSH is an oversold very cheap semi stock that's extremely good fundamentally and trading nowhere near its peers that are well above pre-covid highs. CRNC is a unique AI company that's hitting the bottom of its multi-month range and valued at modest multiples despite growth. SMG has been walloped as if it were a MJ stock, but obviously it's not just that -- Barron's laid out a great case for it last week.\n\nOther than that, it's been stalwarts like ABT, BMY, CRM, NVDA that I'm going to keep buying over time. VALE is a new one I'm adding because it's never been this cheap by PE (IIRC) and key to any economic recovery.",
        "created_utc": 1633403316,
        "id": "hffr4dl",
        "permalink": "/r/stocks/comments/q1gk89/protip_when_good_stocks_are_on_sale_dont_buy/hffr4dl/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633432116.0
    },
    {
        "author": "imlaggingsobad",
        "body": "A few thoughts I had:\n\n1. Tesla has won the race. If they can continue to grow their brand the way they are, they will undoubtedly become the Apple of cars. \n2. What's up with logistics only having 3 players, and UPS being the outright monopoly? Seems like a huge opportunity for Uber and Doordash to make a name for themselves in on-demand delivery.\n3. It's funny how the first US bank appears at #62. Just shows that people aren't loyal to their banks, they only use them because they're locked in or it's convention. Makes me even more bullish on Square and Paypal. \n4. Why did they classify Google as a media/entertainment company? Either way, the Facebook brand is super strong, despite all the hate it receives on Reddit. \n5. I'm impressed that Zoom and AMD made the list. I expect in the future they will overtake Oracle, Salesforce, Cisco etc in terms of brand recognition and loyalty.",
        "created_utc": 1633662028,
        "id": "hft79a4",
        "permalink": "/r/StockMarket/comments/q3gfsa/the_worlds_100_most_valuable_brands_in_2021/hft79a4/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1633690828.0
    },
    {
        "author": "ElvanKing",
        "body": "FUBO, SOFI, PLTR, AMZN, CRM and NET",
        "created_utc": 1633981607,
        "id": "hg9m9ah",
        "permalink": "/r/wallstreetbets/comments/q5sih9/daily_discussion_thread_for_october_11_2021/hg9m9ah/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634010407.0
    },
    {
        "author": "HourPackage",
        "body": "Remember when all the dweebs made fun of CRM for buying WORK and now they are dumping PYPL for the PINS talk. CRM is up something like 40% since the acquisition. PYPL going to do the same, hopefully it dumps enough to get a good price.",
        "created_utc": 1634745344,
        "id": "hhdi9qq",
        "permalink": "/r/wallstreetbets/comments/qbxd7v/daily_discussion_thread_for_october_20_2021/hhdi9qq/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634774144.0
    },
    {
        "author": "MoRegrets",
        "body": "They offer solutions for salesforce. I’d see AVPT more as a value added reseller/support org for Microsoft implementations.",
        "created_utc": 1634070490,
        "id": "hgecjz0",
        "permalink": "/r/SPACs/comments/q6gbxb/announcements_x_daily_discussion_for_tuesday/hgecjz0/",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1634099290.0
    },
    {
        "author": "Mister-guy",
        "body": "Dude you’re awesome, thanks. I’m mostly VTI and VXUS, but looking to diversify w a little risk (~10-15%). \n\nI was thinking ASTS originally, but I’ll be looking into Salesforce now as well. \n\nCheers.",
        "created_utc": 1634181380,
        "id": "hgkhoh5",
        "permalink": "/r/stocks/comments/q7k5lf/why_are_telecom_stocks_getting_sold_off/hgkhoh5/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1634210180.0
    },
    {
        "author": "sabertoothed_tiger",
        "body": "CRM has a promising future.",
        "created_utc": 1635542409,
        "id": "hikcbo3",
        "permalink": "/r/stocks/comments/qikt84/what_are_some_good_stocks_to_invest_in/hikcbo3/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635571209.0
    },
    {
        "author": "Spiritual_Extreme_81",
        "body": "The Dow is interesting one company can literally lift the entire index. Salesforce did it recently and DIS and BA this past week.",
        "created_utc": 1633286636,
        "id": "hf997y5",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf997y5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633315436.0
    },
    {
        "author": "NickNameIsNick",
        "body": "MSFT offered funds/stake but AVPT declined bc they want to work with Salesforce, AWS, Google, etc.",
        "created_utc": 1634070592,
        "id": "hgecte4",
        "permalink": "/r/SPACs/comments/q6gbxb/announcements_x_daily_discussion_for_tuesday/hgecte4/",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1634099392.0
    },
    {
        "author": "CamaroLS1",
        "body": "CRM puts now - WITNESS ME",
        "created_utc": 1634240749,
        "id": "hgnf69s",
        "permalink": "/r/wallstreetbets/comments/q7wkcn/daily_discussion_thread_for_october_14_2021/hgnf69s/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634269549.0
    },
    {
        "author": "majorchamp",
        "body": "I sometimes kick myself over this...I had Salesforce stock at a strike price of $5.50 lol, about 330 shares.  Sold most of it within 6 months of the IPO, highest price around $65 I think.",
        "created_utc": 1634252584,
        "id": "hgo4kfb",
        "permalink": "/r/stocks/comments/q87iql/missed_out_on_55k_because_my_exit_was_hit/hgo4kfb/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634281384.0
    },
    {
        "author": "FinancialRub6814",
        "body": "AMD, Nvidia, CRM, Apple, Boeing.\n\nMade alot of money on Dutch Bros since IPO.$BROS.  Definitely the in and out burger or chick fil a of coffee.",
        "created_utc": 1634616435,
        "id": "hh71ggi",
        "permalink": "/r/wallstreetbets/comments/qaupdv/what_are_your_moves_tomorrow_october_19_2021/hh71ggi/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634645235.0
    },
    {
        "author": "bootcamper64",
        "body": "|\\*\\*Symbol\\*\\*|\\*\\*Percent Of Account\\*\\*|  \n:--|:--|  \n|CLF|12.46%|  \n|FVRR|9.49%|  \n|SBLK|8.68%|  \n|CRM|7.42%|  \n|SHOP|6.84%|  \n|SPAXX\\*\\* (CASH)|6.49%|  \n|ADSK|5.63%|  \n|ASO|5.41%|  \n|UPST|5.15%|  \n|SDC|4.46%|  \n|BBIG|4.22%|  \n|GOLD|4.13%|  \n|MT|4.06%|  \n|PAYC|4.03%|  \n|DOCU|3.58%|  \n|PLTR|3.17%|  \n|XLY|2.49%|  \n|SNOW|2.18%|  \n|OCUL|1.39%|  \n|CRNT|1.31%|  \n|SKLZ|1.27%|\n\n&amp;#x200B;\n\nMy main stock picking  account. Have another 'set and forget' account with SPY and bluechips (MSFT, APPL, WMT, etc)",
        "created_utc": 1634850789,
        "id": "hhjgryp",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hhjgryp/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634879589.0
    },
    {
        "author": "CognitivelyNomadic",
        "body": "What are the AAPL, MSFT and CRM of other industries? Healthy, steady but growing.\n\nLooking to broaden “fun money” side investments. Too exposed to QQQ, SPY or individual tech stocks",
        "created_utc": 1635180483,
        "id": "hi05wp4",
        "permalink": "/r/investing/comments/qfck11/daily_advice_thread_all_basic_help_or_advice/hi05wp4/",
        "score": 2,
        "subreddit": "investing",
        "created": 1635209283.0
    },
    {
        "author": "Purple_Cow1",
        "body": "Twilio - it reminds me CRM 10 years ago. Now entering on marketing space. Bought Segment leader in Cdp customer data platform \n\nCloudflare- leader in CDN\n\nSofi - I see now they sponsoring Anthony Pompliano YouTube channel guru of Bitcoin. I have the feeling they are going in the right direction",
        "created_utc": 1635271140,
        "id": "hi552r2",
        "permalink": "/r/stocks/comments/qfqo6y/what_are_your_highest_conviction_stock_picks_for/hi552r2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635299940.0
    },
    {
        "author": "sudopacman",
        "body": "I worked there a few years ago, and I hated the company.  Amazon cheaped out on everything, like making you pay for drinks, and your only special benefit was basically $100 off $1000 purchase.  \n\nI don't remember all the detail, but Amazon went out of its way to make you feel the frugality.  And I worked in one of the most profitable customer facing services in AWS, I can't imagine how stingy internal retail must've been.\n\nI work at Salesforce now and love it.  Whether they actually give a shit about me or not, they make a great effort to appear so.  The culture and work life balance are excellent.",
        "created_utc": 1633409645,
        "id": "hfg1ryn",
        "permalink": "/r/stocks/comments/q1a8ux/facebook_down_down_down/hfg1ryn/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633438445.0
    },
    {
        "author": "jaynemesis",
        "body": "F, AMD, MSFT, CRM, SIE.DE, ABBN.ZU, ORSTED.CO, TWTR, SPOT, CSX",
        "created_utc": 1633666376,
        "id": "hftf00l",
        "permalink": "/r/stocks/comments/q3ounw/if_you_had_to_pick_only_10_stocks_to_invest_in/hftf00l/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633695176.0
    },
    {
        "author": "-Muscles-Marinara-",
        "body": "CLPT - think the intuitive surgical of neuro. \n\nTOITF(Topicus)- spin-off of constellation software. Going after the fragmented European crm market",
        "created_utc": 1633819095,
        "id": "hg1a8vz",
        "permalink": "/r/stocks/comments/q4qgh0/what_stocks_are_you_watching_thats_still_not_well/hg1a8vz/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633847895.0
    },
    {
        "author": "bilateralconfusion",
        "body": "Lol HubSpot is on track to be the next salesforce",
        "created_utc": 1633818518,
        "id": "hg191cq",
        "permalink": "/r/stocks/comments/q4qgh0/what_stocks_are_you_watching_thats_still_not_well/hg191cq/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633847318.0
    },
    {
        "author": "SaltyEarth7905",
        "body": "It has split in the past but it’s been seven years or so. It’s a powerhouse, like SalesForce, nvidia, Microsoft. Whether in full shares or slices, get invested on dips.",
        "created_utc": 1634577768,
        "id": "hh4q625",
        "permalink": "/r/stocks/comments/qar0iq/adobe_adbe_i_want_in_but/hh4q625/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634606568.0
    },
    {
        "author": "trickintown",
        "body": "Alternate opinion… look at salesforce.. wait for one correction and when their P/E goes below 80 that’s a long game..\n\nLow code software dev is to become  a big industry (just like how cloud grew crazy this decade) and salesforce has a huge early mover advantage..",
        "created_utc": 1635082127,
        "id": "hhuxwju",
        "permalink": "/r/stocks/comments/qebmzx/buying_100_shares_of_1_blue_chip_but_which/hhuxwju/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635110927.0
    },
    {
        "author": "the_beast93112",
        "body": "I think it's because of the collaboration with CRM",
        "created_utc": 1635535086,
        "id": "hijtw0h",
        "permalink": "/r/wallstreetbets/comments/qi9clo/daily_discussion_thread_for_october_29_2021/hijtw0h/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635563886.0
    },
    {
        "author": "erockjr",
        "body": "Anyone know how accurate this is?\n\nhttps://enlyft.com/tech/products/salesforce-financial-services-cloud\n\nCan't find a date when this was published. Using a mobile device, but it doesn't look like too many financial institutions use the sales force suite.",
        "created_utc": 1635540998,
        "id": "hik8xea",
        "permalink": "/r/wallstreetbets/comments/qii3j6/rocket_mortgage_unveils_partnership_with/hik8xea/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635569798.0
    },
    {
        "author": "gouligan_GenY",
        "body": "Confirmed, Rocket $RKT and Salesforce $CRM Partnership 🚀\n\nDreamforce 🚀",
        "created_utc": 1635536149,
        "id": "hijwkmm",
        "permalink": "/r/wallstreetbets/comments/qi9clo/daily_discussion_thread_for_october_29_2021/hijwkmm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635564949.0
    },
    {
        "author": "losing_my_erection",
        "body": "Reluctantly sold $CRM that I have been holding since April, last friday for a cool profit. Definitely soften the blow of the market pullback. Will be looking to buy again soon but I’ll let the bears have their fun first.",
        "created_utc": 1633098649,
        "id": "hez9bdh",
        "permalink": "/r/stocks/comments/pz8v7p/so_how_much_did_you_lose_in_september/hez9bdh/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633127449.0
    },
    {
        "author": "AromaticFarmer",
        "body": "Got a free year of Disney + for attending a Salesforce event",
        "created_utc": 1633872618,
        "id": "hg3nrrh",
        "permalink": "/r/wallstreetbets/comments/q45jst/weekend_discussion_thread_for_the_weekend_of/hg3nrrh/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633901418.0
    },
    {
        "author": "HalfwayDown21",
        "body": "CRM. For actual fundamentals.",
        "created_utc": 1633551421,
        "id": "hfn9or1",
        "permalink": "/r/wallstreetbets/comments/q2s87a/what_are_your_moves_tomorrow_october_07_2021/hfn9or1/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633580221.0
    },
    {
        "author": "Plus_Comfortable1645",
        "body": "CRM dec 300/310 call spread sir",
        "created_utc": 1633491370,
        "id": "hfkb09w",
        "permalink": "/r/wallstreetbets/comments/q249th/what_are_your_moves_tomorrow_october_06_2021/hfkb09w/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633520170.0
    },
    {
        "author": "baconography",
        "body": "Fair enough. It would depend on the actual company, and exposure to the headwinds, plus fundamentals, and (I hate to say this) but technicals. Some might rebound way better than the more debt-laden, overvalued P/E and P/S tech names. FB is an exception, and is fucked, though.  \n\n\nBut a fair number of tech names who do almost everything digitally shouldn't be affected by things like logistics &amp; shipping, and physical product supply. ADBE, GOOGL, and CRM come to mind.",
        "created_utc": 1633969119,
        "id": "hg8scsm",
        "permalink": "/r/wallstreetbets/comments/q5sih9/daily_discussion_thread_for_october_11_2021/hg8scsm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633997919.0
    },
    {
        "author": "highflyinginvesting",
        "body": "Ok, so if at close you got a May $45 call, that would cost you around $1,900.  If PINS did get to 70 sometime before then, it would be worth somewhere between $2600-$2500 depending on when it got there\n\nHowever, the deal may not go through and sometimes it can take a lot longer for shares to be converted. Slack Salesforce acquisition is a good example of a deal that took a while.\n\nYou may also want to consider doing a call spread, and potentially buying a higher strike call and selling a 70 call against it.",
        "created_utc": 1634773270,
        "id": "hhfeeri",
        "permalink": "/r/options/comments/qcam03/options_play_in_pins/hhfeeri/",
        "score": 2,
        "subreddit": "options",
        "created": 1634802070.0
    },
    {
        "author": "GbPpio",
        "body": "Salesforce appears prominent",
        "created_utc": 1635308657,
        "id": "hi7j6a7",
        "permalink": "/r/wallstreetbets/comments/qgo0z5/lots_of_ceosupper_mgmt_paper_handsing_companies/hi7j6a7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635337457.0
    },
    {
        "author": "YoloStonks4Tendies",
        "body": "The salesforce deal should be massive for RKT. Nothing like signing a massive deal with an almost 300bn dollar company to hopefully get the share price where it should be and lighten some bags :)",
        "created_utc": 1635528515,
        "id": "hijd518",
        "permalink": "/r/wallstreetbets/comments/qi9clo/daily_discussion_thread_for_october_29_2021/hijd518/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635557315.0
    },
    {
        "author": "developingstory",
        "body": "Need a crash so I can yolo calls at the bottom for once. The tendies are secondary, my real motivation is to mass email every lead in my company’s CRM a pic of my dangling nuts with the tattoo that reads:\n\n“Poor no moor”\n\nThen quit.",
        "created_utc": 1633486017,
        "id": "hfk0ec4",
        "permalink": "/r/wallstreetbets/comments/q249th/what_are_your_moves_tomorrow_october_06_2021/hfk0ec4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633514817.0
    },
    {
        "author": "Joltarts",
        "body": "They also have a product for small medium enterprises. \n\nTheir closest competitor in this CRM space is Salesforce and SAP. And those companies are not using AI driven analysis. Once companies start adopting PLTR software over other CRM, it's game over for Salesforce as far as I'm concerned.",
        "created_utc": 1633611283,
        "id": "hfq1n1x",
        "permalink": "/r/stocks/comments/q2wh8s/pltr_vs_amd/hfq1n1x/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633640083.0
    },
    {
        "author": "CallMeEpiphany",
        "body": "I’m going to get hate for this but don’t invest in tech for a year. If that is not a choice, get Salesforce or Microsoft.",
        "created_utc": 1634179984,
        "id": "hgkeypy",
        "permalink": "/r/investing/comments/q7759a/daily_general_discussion_and_spitballin_thread/hgkeypy/",
        "score": 2,
        "subreddit": "investing",
        "created": 1634208784.0
    },
    {
        "author": "stevoacp1",
        "body": "CRM new ATH.  $310 eoy",
        "created_utc": 1634241966,
        "id": "hgni555",
        "permalink": "/r/wallstreetbets/comments/q87iwg/what_are_your_moves_tomorrow_october_15_2021/hgni555/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634270766.0
    },
    {
        "author": "zg44",
        "body": "Look at the stocks that did well today, it's a who's who of the biggest momentum stocks.\n\nCut losers and just buy winners.\n\nDoesn't matter if a stock is up 200% in the previous 2 months, it's going to try to go up another 50% in the next month (looking at you UPST).\n\nStocks that are breaking to ATHs right now are probably the best bet because this time of year is when all the big hedge funds crowd into winners to show good numbers/stocks on their year end reports.\n\nWe've seen that happen in previous years: last year it happened with stocks like TSLA, NIO, SQ, battery stocks like PLUG etc.\n\nComing out of a major dip like this late in the year, that type of crowding should be exacerbated.\n\nStocks like CRM, AFRM, and of course among the big caps: GOOG and MSFT (which have been the 2 most bullish of the big caps).\n\nLooks like we're going to witness a rotation into winners for the last 2.5 months if we break to new highs on SPX/Nasdaq.",
        "created_utc": 1634243132,
        "id": "hgnkymg",
        "permalink": "/r/wallstreetbets/comments/q87iwg/what_are_your_moves_tomorrow_october_15_2021/hgnkymg/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634271932.0
    },
    {
        "author": "Few_Dirt_8665",
        "body": "Each year there happen to be a couple companies that dominate the talking heads (and this percolates into the amateur content creation sphere).  Ones that I recall over the past few years… any of the FAANG companies.  FB is dominating the conversation in recent months.  Salesforce (CRM) goes in and out.  Same with Shopify.\n\nWhen Stripe IPOs, I think it’ll get some attention and stay there for a bit.  They are the darling in the private market sphere.\n\nBeen a lot of recent retail talk about Robinhood (HOOD) and Coinbase (COIN) but that’s beginning to wane.",
        "created_utc": 1635080709,
        "id": "hhuveo7",
        "permalink": "/r/stocks/comments/qeqpar/are_there_any_other_public_stocks_with_the_kind/hhuveo7/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635109509.0
    },
    {
        "author": "Anth916",
        "body": "I'm not sure I'd consider 20 to 25 percent really being a \"crash\". I see it as a strong correction, but not really a \"crash\". For example, if Nvidia \"crashes\" 25 percent off it's all-time high of $230.43, it would drop to $172.82. If Google \"crashes\" 25% from it's all-time high of $2,936.41, it drops to $2,202.30. Or Salesforce crashing 25% from it's ATH of $286.36 to $214.77.  I see all those prices as major corrections, but not a full blown crash.\n\nBut you can say that it's mostly semantics, and when do you draw the line between major correction and legit crash",
        "created_utc": 1633291886,
        "id": "hf9mg1z",
        "permalink": "/r/stocks/comments/q06f4p/falling_knives_club/hf9mg1z/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633320686.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "My new office is debating using them because we want a CRM system but they pricy af",
        "created_utc": 1633551603,
        "id": "hfna4mc",
        "permalink": "/r/wallstreetbets/comments/q2s87a/what_are_your_moves_tomorrow_october_07_2021/hfna4mc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633580403.0
    },
    {
        "author": "zg44",
        "body": "Yesterday's move felt like the kind of move that happens at the end of pullbacks, and it was accompanied by strong earnings reports as earning season started the past 2 days.\n\nThis is probably the point where you abandon puts and start buying dips (or keep buying dips if you already were), at least until we get closer to the November 2-3 Fed meeting.\n\nMain reason yesterday's move was so bullish is that the market leaders approached or broke through new ATHs or closed their pullback gaps: GOOG, MSFT, CRM among big caps and of course UPST, AMBA, PANW and others among smaller caps.\n\nTSLA showing tons of momentum the past couple days and basically just looks like it's set to challenge all time highs.\n\nI'd expect some form of market rotation later in the year as we start getting to tapering and the tech stocks experience some kind of a mini-blowoff top, but for now market just looks set to get to all time highs.",
        "created_utc": 1634296342,
        "id": "hgq4d5i",
        "permalink": "/r/wallstreetbets/comments/q8l7gz/daily_discussion_thread_for_october_15_2021/hgq4d5i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634325142.0
    },
    {
        "author": "BeautifulPreparation",
        "body": "everyone sleeping on CRM?",
        "created_utc": 1634219494,
        "id": "hgm07rx",
        "permalink": "/r/wallstreetbets/comments/q7wkcn/daily_discussion_thread_for_october_14_2021/hgm07rx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634248294.0
    },
    {
        "author": "thetagodfather",
        "body": "Think about it like this…most consumers have no reason for using AI, analytics, enterprise security or CRM platforms \n\nBut those have insane profit margins and print $$$\n\nThis is very early so we won’t see adoption for a while though \n\nBut will be good for speeding up mass processing of existing workloads, and application against a lot of problems we can’t solve now because of the limitation of 1 and 0 as the only answers\n\nQuantum mechanics becomes a mysterious realm of magic once you dig into it, and realize how ignorant we are of the universe around us and how it *really* works",
        "created_utc": 1634201756,
        "id": "hgl9kmu",
        "permalink": "/r/SPACs/comments/q7qfpt/ionq_quantum_computers_are_already_here/hgl9kmu/",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1634230556.0
    },
    {
        "author": "ondori_co",
        "body": "Thank you! \n\nThat makes a lot of sense.\n\nAssuming a lot of money is pulled from the fund and the shares are deleted. Then the dilution should remain unchanged and thus stock price unaffected. \n\nAlso from what I see, EIT.UN.TO is trading within a tiny % of its NAV. Thus I think it's safe for me to buy shares right now.\n\nMy other div funds, CLF &amp; CRF are trading ~30% above NAV. Honestly too risky to hold, so I divested to switch to EIT.UN.TO.\n\nIf there is a market crash that causes CLF &amp; CRM to drop near the NAV or if the CAD to USD drops to less than 1.2 then I'll switch back to CLF &amp; CRM.",
        "created_utc": 1634214741,
        "id": "hglqroh",
        "permalink": "/r/CanadianInvestor/comments/q7iaph/what_is_a_voluntary_annual_cash_redemption/hglqroh/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1634243541.0
    },
    {
        "author": "Japparbyn",
        "body": "I use Salesforce. It is slow and insights have to be found in other programs. Takes 10min to do all the research before a good cold call. Wish it was all on a single page like palantir UI",
        "created_utc": 1633981047,
        "id": "hg9kz8w",
        "permalink": "/r/stocks/comments/q5kk1r/if_you_had_to_choose_one_stock_between_tsla_and/hg9kz8w/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1634009847.0
    },
    {
        "author": "zg44",
        "body": "AMBA, CRM, among others.",
        "created_utc": 1634251412,
        "id": "hgo1zij",
        "permalink": "/r/wallstreetbets/comments/q87iwg/what_are_your_moves_tomorrow_october_15_2021/hgo1zij/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634280212.0
    },
    {
        "author": "Guy_PCS",
        "body": "Your very welcome, suggested VGT is it has the holdings of Apple &amp; MSFT plus some very good tech growth companies. \n\nVGT top holdings\n\nMonth-end 10 largest holdings\r  \n(57.20% of total net assets) as of 09/30/2021 \r  \n\r  \n1\tApple Inc.\r  \n2\tMicrosoft Corp.\r  \n3\tNVIDIA Corp.\r  \n4\tVisa Inc.\r  \n5\tMastercard Inc.\r  \n6\tPayPal Holdings Inc.\r  \n7\tAdobe Inc.\r  \n8\tsalesforce.com Inc.\r  \n9\tCisco Systems Inc.\r  \n10\tIntel Corp.",
        "created_utc": 1634597622,
        "id": "hh5zmya",
        "permalink": "/r/StockMarket/comments/qaq7zo/rate_my_holdings_please/hh5zmya/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1634626422.0
    }
]