[
    {
        "author": "TheOriginalRK",
        "body": "I was doing so god damn well, my long term stock portfolio was flying with ev , solar and spac plays. Now I’m down 40% almost $200k in 2 weeks and I honestly feel depressed. I’ve never felt like this or imagined just losing this much money this fast. I don’t even know what to do just get out of Everything and take my cash for now or just hold these stocks for years. Top positions LUCID, AAPL, ENPH , NIO, SQ, Plug. I’ve felt like such garbage last 2 weeks while just seeing everything I worked for just fade and fade. Literally just feel helpless seeing that much money vanish this fast. I really fucked up",
        "created_utc": 1614811575,
        "id": "gpl7m4k",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614840375.0
    },
    {
        "author": "EmpValentine",
        "body": "My portfolio is a collection of PRPL, CRSR, AMD, ENPH, PLUG. I added RKT yesterday at $32.53 during the first dip. I even got 35C's for RKT because I thought it was FINALLY being fairly valued. \n\nSo if any of you want to know what positions I open in order to reverse it let me know.",
        "created_utc": 1614867663,
        "id": "gpnl0ky",
        "score": 11,
        "subreddit": "investing",
        "created": 1614896463.0
    },
    {
        "author": "normal_communist",
        "body": "i put $1000 of my stimmy in and immediately lost $300, stonks baby\n\nspy 400c 3/19\nenph 210c 4/16\nsqqq 14c 3/19 \namc 15c 3/19\n\nfuck :)",
        "created_utc": 1615920509,
        "id": "gr5i3en",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615949309.0
    },
    {
        "author": "ixamnis",
        "body": "NIO should be valued at $100 per share by year end.\n\nI Believe ENPH will be $250/share by year end. \n\nHold tight.  We are all looking at some red in our accounts right now.",
        "created_utc": 1614780381,
        "id": "gpj8tox",
        "score": 7,
        "subreddit": "stocks",
        "created": 1614809181.0
    },
    {
        "author": "Life_Equivalent_793",
        "body": "Enph is a solid company. The decline you've seen is just due to market movers and the whole energy freeze debacle. It will be over 200 in not time ( a couple of weeks) I'd personally trust enph to give you your money back before nio.",
        "created_utc": 1614776961,
        "id": "gpj2sc6",
        "score": 7,
        "subreddit": "stocks",
        "created": 1614805761.0
    },
    {
        "author": "semaphore-1842",
        "body": "Omg yes. I was all pumped up and ready to go all in buying the dip on ENPH, SOL and RUN today. And then...",
        "created_utc": 1615321213,
        "id": "gqd9zpq",
        "score": 7,
        "subreddit": "stocks",
        "created": 1615350013.0
    },
    {
        "author": "jungl3_junki3",
        "body": "Yesterday at close I chose between EH, APPH, DM, MARA, AMD, ENPH and PLTR to throw $1k at.  I chose PLTR because I'm a fucking idiot.\n\nTf is with today?  Meme stocks and SPY/tech living in harmony?",
        "created_utc": 1615308943,
        "id": "gqcio1m",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615337743.0
    },
    {
        "author": "futureIsYes",
        "body": "Rotation into value?\n\nBaidu, now trading at pe of 18! (compare to google at 35)\n\nCSIQ, now trading at pe of 11.5 (compare to ENPH, 140)\n\nIf these are not value plays, I don't know why.  \n\nAvg Nasdaq pe today is 26\n\n[https://ycharts.com/companies/NDAQ/pe\\_ratio](https://ycharts.com/companies/NDAQ/pe_ratio)\n\nbut according to this, even higher (but this was for Friday, but don't think it will change that much in one day...)\n\n[https://www.barrons.com/market-data/stocks/us/pe-yields](https://www.barrons.com/market-data/stocks/us/pe-yields)",
        "created_utc": 1615237705,
        "id": "gq97ngk",
        "score": 5,
        "subreddit": "stocks",
        "created": 1615266505.0
    },
    {
        "author": "GeneEnvironmental925",
        "body": "Definitely hold NIO, can't speak on ENPH",
        "created_utc": 1614777961,
        "id": "gpj4g5n",
        "score": 5,
        "subreddit": "stocks",
        "created": 1614806761.0
    },
    {
        "author": "Jackismyson",
        "body": "What are we playing on this infrastructure bill? ENPH? TSLA?",
        "created_utc": 1617133031,
        "id": "gsu31gv",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617161831.0
    },
    {
        "author": "7991sushi",
        "body": "X (US steel), ENPH (solar), maybe Tesla (a bit of a risk factor due to higher than normal PE ratio and delivery number coming out Thursday)",
        "created_utc": 1617162776,
        "id": "gsvnz05",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617191576.0
    },
    {
        "author": "microwavepetcarrier",
        "body": "\n&gt;A MESSAGE FOR GME SHORT SELLERS  \nGood evening you pieces of shit,  \nWhy do you keep doubling down on your short positions? Why are new hedge funds are coming in and scooping up new short positions? What the fuck are you shitstains on society doing? What the fuck is wrong with you? Do you understand who we are?  \nWe don’t fucking play here. We lose money for fucking breakfast. Every day. And then we come back and lose even more fucking money. We buy out of the money weeklies on fucking THURSDAYS. We don’t give a fuck. This is what we do. We do this. We don’t fucking play around. We come here to risk it all. We come here to YOLO our children’s college funds away just to post memes about it.  \nYour plan was really just to put us in a position where all we have to do is hold SHARES? Say less fam. I haven’t owned a share in four years. I sold AAPL AMD and ENPH calls last week just to buy shares of GameStop and fuck you up as much as possible so we can make memes about it.  \nDouble down, triple down, quadruple down, take every penny of your rich boomer clients money and put it on the table. Sink the entire already artificially propped up economy over it. We know you will. And because we know you will, we are going to make you do it. Just like the coyote blindly chasing the roadrunner off of a fucking cliff. Chop off your whole head to spite your face.  \nTake all your boomer ass money and put it on the table. We are here for it. My shares are available for $10,000 before 6 pm today. For every hour after that, Im asking another $250.  \nGo fuck yourself.\n  \n-/u/TOADSTOOL__SURPRISE",
        "created_utc": 1615402679,
        "id": "gqh9y1t",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1615431479.0
    },
    {
        "author": "ryancubs",
        "body": "Is ENPH still a good buy even though its now closing in on 150/share? I missed out on buying in when it was below 140.",
        "created_utc": 1615310171,
        "id": "gqcllvb",
        "score": 3,
        "subreddit": "stocks",
        "created": 1615338971.0
    },
    {
        "author": "Torquedork1",
        "body": "My boy ENPH never gets love on here",
        "created_utc": 1615826637,
        "id": "gr120xu",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615855437.0
    },
    {
        "author": "ozpcmr",
        "body": "American/International solar stocks: Up\n\nChinese solar stocks: Destroyed\n\nThankfully I don't have any chinese solar today, but what happened to them? They seem to be higher risk/reward, but its weird they're heavily red while MAXN's up 11% and ENPH is up 5.",
        "created_utc": 1615828006,
        "id": "gr154jt",
        "score": 3,
        "subreddit": "stocks",
        "created": 1615856806.0
    },
    {
        "author": "Life_Equivalent_793",
        "body": "I think what's important for every trader/investor that wants to be succesful is to remember that the stock market is like a lung or a heartbeat. Up and down, inflates deflates. Not one stock only goes up no matter how much we wanna call em stonks. I have personally been trading enph since it was $6, 3 years ago. I went through a similar situation last year with it where I bought at ath and the stock right after plummeted 30 pts. I freaked out and sold for a loss because \"there was money to make elsewhere and got kick in the mouth when the stock shot back up. I knew it would based on technicals and Financials (I'm telling you. Solid company almost debt. Revenue and profit positive year over year and every quarter! Do some DD) but I saw some retarded comments and let some fucjers fucj me.",
        "created_utc": 1614779120,
        "id": "gpj6hd2",
        "score": 3,
        "subreddit": "stocks",
        "created": 1614807920.0
    },
    {
        "author": "7991sushi",
        "body": "I’m thinking of ENPH, pick some up today",
        "created_utc": 1617059256,
        "id": "gsqpxla",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617088056.0
    },
    {
        "author": "lavishcoat",
        "body": "Turns out buying ENPH above 200 was the wrong move...\n\nHello darkness my old friend...",
        "created_utc": 1615252526,
        "id": "gqa17a4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615281326.0
    },
    {
        "author": "lavishcoat",
        "body": "My timing is impeccable.\n\nENPH cost basis $205.\n\n🤡",
        "created_utc": 1614858155,
        "id": "gpn5uyp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614886955.0
    },
    {
        "author": "FelwintersLie",
        "body": "Enph plug pleas fly again",
        "created_utc": 1614729104,
        "id": "gph4okd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614757904.0
    },
    {
        "author": "SameAsItEverWasss",
        "body": "Been in on AMRS a while. I heard about it from the Enphase (ENPH) crew two years ago - look what happened there. AMRS will hit 100+",
        "created_utc": 1614731987,
        "id": "gphabcs",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614760787.0
    },
    {
        "author": "futureIsYes",
        "body": "I was stupid.\n\nIn 2015, when I started investing, I started buying MSFT, AAPL, NVDA, GOOG and BOTS, and I kept these for about 3 years, and everything was great. I sometimes forgot to check my portfolio for months. If I have kept it that way, I would have so much better return than now. \n\nBut after the pandemic, I started listening to podcasts, spending a lot of time in reddit, etc... and started buying/selling based on recommendations from the podcasts and the reddit gang. Some has made me good money (e.g. ENPH, LVGO, PINS, etc..), but even those big gains are really not worth the time I spending and the stress I have been through the past few weeks with the tech pullback dragging me down by almost 30%.\n\nSo, now I want my sanity/time back :-) I am OK with even 5% return per year. I am not kidding, the last 3 weeks, I have spent more time at reddit, bloomberg, yahoo finance, motely fool podcasts, seeking alpha, and the like than at work... this has to stop before it completely gets out of control.",
        "created_utc": 1615397476,
        "id": "gqgvsab",
        "score": 3,
        "subreddit": "stocks",
        "created": 1615426276.0
    },
    {
        "author": "walter1021",
        "body": "ENPH",
        "created_utc": 1617138742,
        "id": "gsuff6g",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617167542.0
    },
    {
        "author": "z109620",
        "body": "Don't get the ICLN love.\n\n1) Some of it's holdings are Toxic.  For example, PLUG is a company that has been around since the 90's that's never turned a profit and is in a sector with limited use cases ... Batteries &gt;&gt;&gt; Hydrogen Fuel Cells\n\n2) Some of the general enthusiasm appears to focus on Biden administration ... Problem is ICLN has mere 30% US exposure (of which PLUG and ENPH make up the lion's share ... Neither have good fundamentals)\n\n3) Many of holdings are established EU companies ... May not have growth potential.\n\n\nClean Energy is definitely a great long play ... I'm just not sure ICLN is a good play.  I'd suggest cutting and running\n\nGood Luck!",
        "created_utc": 1617220863,
        "id": "gsy9wth",
        "score": 3,
        "subreddit": "stocks",
        "created": 1617249663.0
    },
    {
        "author": "richbeezy",
        "body": "Yeah, I remember some hedge fund put a short report out on ENPH and their basis was “we interviewed former employees”. \n\n“Geee, I wOnDeR iF fOrmEr eMpLoYeEs aRe A rEliAbLe SoUrCe oF iNFo?”\n\nI don’t know about you, but I have never had good things to say about a former employer. Hell, I don’t have good things to say about my CURRENT employer.\n\nAnyways, the hedge fund put the report out on ENPH when it was around $60 about 6-8 months ago. It was trading over 200 not long ago.",
        "created_utc": 1614888801,
        "id": "gpoy0hy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614917601.0
    },
    {
        "author": "hechacker1",
        "body": "I didn't get an option. Bought stock. 🔔🔔🔔\n\nBut I will fix that tomorrow with leaps. ENPH. It had the worst selloff other than TSLA over 1 month. I'm hoping for a little pullback tomorrow at open.",
        "created_utc": 1615338316,
        "id": "gqe9ifs",
        "score": 2,
        "subreddit": "options",
        "created": 1615367116.0
    },
    {
        "author": "play_it_safe",
        "body": "A decade ago was when that conversation happened. Now there are companies like ENPH and CSIQ that are very stable and rock solid.",
        "created_utc": 1615500229,
        "id": "gqmfz62",
        "score": 2,
        "subreddit": "stocks",
        "created": 1615529029.0
    },
    {
        "author": "chugler92",
        "body": "BEP.un on the tsx, I like enph as well",
        "created_utc": 1615578974,
        "id": "gqq52c5",
        "score": 2,
        "subreddit": "stocks",
        "created": 1615607774.0
    },
    {
        "author": "crazydr13",
        "body": "I think you should remember the reasons why ENPH and NIO have become so hyped up. Going forward, we need to find solutions to combating our climate crisis which means reducing carbon emissions. Two of the largest sources of carbon emissions are from transportation and energy generation. ENPH and NIO address both of those. Additionally, the real gains and development of those plans have not been realized yet. With governments around the world pledging to put trillions towards renewable energy and transportation, both of those companies are in a great position to do very well. \n\nIf you can, try not to look at them and focus on where the companies are going.\n\nEdit: I have a little bit of NIO and some SEDG (ENPH’s rival).",
        "created_utc": 1614779553,
        "id": "gpj79r8",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614808353.0
    },
    {
        "author": "Rootenheimer",
        "body": "nobody has enough love for ENPH. Enphase tendies helped grow me into the big strong retard I am today. Respect",
        "created_utc": 1617211529,
        "id": "gsxpgsd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617240329.0
    },
    {
        "author": "Finley0578",
        "body": "MAXN (solar play)\nENPH (solar power)",
        "created_utc": 1615232130,
        "id": "gq8us0f",
        "score": 2,
        "subreddit": "stocks",
        "created": 1615260930.0
    },
    {
        "author": "IronicHipsterCake",
        "body": "ENPH @ $133? Jesus don't mind if I do",
        "created_utc": 1615231255,
        "id": "gq8srje",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615260055.0
    },
    {
        "author": "Mossles",
        "body": "Enphase just keeps getting beat down.  My rtx calls I sold should be getting exercised next week. Do I roll that into Enph or does this sector just keep getting beat.",
        "created_utc": 1615234298,
        "id": "gq8zs0v",
        "score": 2,
        "subreddit": "stocks",
        "created": 1615263098.0
    },
    {
        "author": "psychcloud",
        "body": "Positions- QQQ, AAPL, AMD, NVDA, TSLA, TDOC, SQ, SE, NET, NIO, TAN, ZM, APPS, DMTK, ENPH, FSLY, FUTU, GRWG, MP, FUBO, MWK, PLTR, SKLZ, TIGR, UPWK, YI \n\nShould I sell off and consolidate into the first 10 names or just keep buying as we plunge. Thoughts?",
        "created_utc": 1615248557,
        "id": "gq9txh0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615277357.0
    },
    {
        "author": "ABCinNYC98",
        "body": "I would just sell weekly covered calls on NIO.  Unless you know of a guarantee 25% gain for $8,800.\n\nJust think of it as collecting rent.\n\nDon't know much about $ENPH.",
        "created_utc": 1614781146,
        "id": "gpjabd5",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614809946.0
    },
    {
        "author": "notA_cringeyusername",
        "body": "If your more into \"adrenaline\" it may be worth looking at lower cap companies which you really believe in (I'll give you an example, I bought enph at 7 because I really believed in solar, and it's really paid off looking at the current share price), but ETFs are also a sensible investment. More of a personal stock recommendation if you would like but I would recommend Sony for you to check out, I can send you a DD on them if you would like, but just putting Sony out there. I would also recommend for you to get started that you get some education under your belt, and would highly recommend the following websites etc. Investing.gov has a great getting started page, investopedia has some great education in general, and is like the Wikipedia for investing, and also khan academy playlist on stocks and bonds are super helpful",
        "created_utc": 1614727397,
        "id": "gph1cgx",
        "score": 2,
        "subreddit": "investing",
        "created": 1614756197.0
    },
    {
        "author": "chugler92",
        "body": "Enph is the best company in there why not just buy them ?",
        "created_utc": 1617142751,
        "id": "gsunmbv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1617171551.0
    },
    {
        "author": "ohnoabigshark",
        "body": "This happened to ENPH...two years ago, I think? The stock never looked back after that. Big nothing-burger.",
        "created_utc": 1615943224,
        "id": "gr6t0d1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615972024.0
    },
    {
        "author": "ohnoabigshark",
        "body": "I think the accounting news is a big nothing burger. Similar to what happened with ENPH. I think it will bottom out between 30-35. Nothing has changed, and if the findings are immaterial to overall financial picture, this will rebound nicely.",
        "created_utc": 1615950548,
        "id": "gr76f4e",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615979348.0
    },
    {
        "author": "LandSeparate7925",
        "body": "$ENPH dipped down to ~$150 today. Managed to buy a dozen more shares at $155. Felt like a bargain so had to be done. Pretty confident I’ll double this in a year or so. But that’s all I’ll invest in this company for now, haha...",
        "created_utc": 1614874272,
        "id": "gpnzktn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614903072.0
    },
    {
        "author": "ajanis_cat_fists",
        "body": "Jim Cramer likes ENPH which means I’ll be broke by tomorrow.",
        "created_utc": 1614795907,
        "id": "gpk7vie",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614824707.0
    },
    {
        "author": "Original-Opportunity",
        "body": "Yeesh I’m down ~12% on it so take this with a grain of salt.  I bought in early, felt a little crazy post-Texas storm and bought more when it was, in hindsight, totally overvalued.\n\n$143 is a great entry price.  Still risky, because you’re trading the news.  I believe in it.  \n\nI think residential solar is inevitable.  To the best of my knowledge, Enphase and Tesla are the only manufacturers of home power storage batteries that can be used with different types of power.  Enphase is respected within the solar community, but is, and this is how it was explained to me: Many current solar users use alternative energy because they want to be “off the grid.”  ENPH doesn’t really market to these buyers beyond some of their niche products that are above my understanding.  ENPH residential services are like a Nest thermostat- you’re able to to control and monitor from your phone, it’s an expensive investment, installers have to do everything, but they have an excellent support network.  They integrate with tons of solar companies as well.\n\nIt’s also a decent company to work for, it’s US-based and occupies that weird area of tech vs. energy.  \n\nAs a stock... kinda volatile.  But I appreciate their mission and products and apparent clout with securing big contracts.",
        "created_utc": 1617038118,
        "id": "gspgwwi",
        "score": 2,
        "subreddit": "stocks",
        "created": 1617066918.0
    },
    {
        "author": "SubjectDiscipline",
        "body": "Price targets are complete bs for early stage growth companies, anyone who tells you different is not being truthful. My gut says above $50 by YE 2021 and above $30 by the summer but that is hardly scientific. The applications for the tech are endless and it could be worth far more than either of those guesses far more quickly - it is impossible to say\n\nSecond question answered in the post - was looking for businesses with similar turnaround profile to $ENPH and came across significant overlap in shareholder base / other investors I talk to. Went down the rabbit hole from there",
        "created_utc": 1617061309,
        "id": "gsqtu78",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617090109.0
    },
    {
        "author": "7991sushi",
        "body": "I hope so. Kinda heavy on ENPH and TSLA right now",
        "created_utc": 1617162818,
        "id": "gsvo1ea",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617191618.0
    },
    {
        "author": "pure_me",
        "body": "DING DING DING. IF you didn't buy the ENPH dip you missed out",
        "created_utc": 1615924825,
        "id": "gr5rm5d",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615953625.0
    },
    {
        "author": "radarbot",
        "body": "I wasn't. I was in other things during the rise, including SEDG, RUN, MAXN and SPWR.\n\nI decided it was too many stocks to look at so I consolidated them into ENPH at $220 in January. Then there was a huge pullback, but all those solar stocks got whalloped. So I guess I would be no worst off if I just held all those.",
        "created_utc": 1615288954,
        "id": "gqbelqq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615317754.0
    },
    {
        "author": "SameAsItEverWasss",
        "body": "LEG calls. Way too cheap for how much room it has to run on the breakout pattern and undervalued by most estimates. Hold GME as usual for the cause and tendies. Maybe load up some of my beaten down sole stocks like ENPH. Hedge with SQQQ, SDS, and UVXY calls because the market is looking like it has cancer. Relief rally today could be a head fake. Good luck!",
        "created_utc": 1615295911,
        "id": "gqbodtj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615324711.0
    },
    {
        "author": "beefstake",
        "body": "TSLA and ZM do have a lot further to go, multiples are bonkers so they get wrecked by DCF calcs. More profitable companies are still getting whacked that shouldn't though. ENPH and MSFT from that list above for example basically just print money.",
        "created_utc": 1615174498,
        "id": "gq69lky",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615203298.0
    },
    {
        "author": "PassiveF1st",
        "body": "I've been red 2 out of every 3 days for the past 3 months. Down 11.49%\n\nBiggest losses on AMD, SQ, PYPL, TSM, ENPH, NEE",
        "created_utc": 1615326394,
        "id": "gqdlr9f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615355194.0
    },
    {
        "author": "MercedesSLR722",
        "body": "Here's my results for the last 14 days:\n\n1) ENPH 28% Loss\n2) ANET 13.36% Loss\n3) OXY 16.55% Gain\n4) WYNN 8.28% Gain\n5) VLO 12.40% Gain",
        "created_utc": 1615287822,
        "id": "gqbdckb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615316622.0
    },
    {
        "author": "MrDeath69",
        "body": "I'm holding RSVA not worried, I just look at ENPH share price as an example.  \n\nIf you want a 10x or 100x you have to be in early.  \n\nOne 100X carries everything else in a portfolio. \n\nThis is the secret.  \n\nThis is the way.",
        "created_utc": 1615270968,
        "id": "gqavgjr",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1615299768.0
    },
    {
        "author": "mailseth",
        "body": "My situation is different than yours, but my suggestions would be to look at TAN, ENPH, RUN, SPWR, &amp; MAXN off the top of my head if you want clean energy. If you want to diversify out of solar, I’d look at BYND, but that’s not likely to jump any time soon on a Green New Deal.",
        "created_utc": 1615399321,
        "id": "gqh1dbi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615428121.0
    },
    {
        "author": "futureIsYes",
        "body": "It depends. So far, taking profit mostly have caused me pain. Examples are ENPH (I got out at 96), PINS (I got out at around 40),  TSLA (most painful one, exited at 350, pre-split, after buying it around 250).\n\nBut on the other hand, there are cases where I wish I had taken profit, and see all of it disappear or get reduced tremendously.\n\nFor example, MGNI. I was up almost 130%, now in two weeks, that has been reduced to just 70%. IQQH, I was up almost 50% at some point, now -9%. \n\nSo probably the best decision is to set some limit. e.g. I take x% out, if it grows to y%. You set the x and y based on how confident you are on the company. For example, for a solid company like APPLE, MSFT, etc, x will be very low, and y will be high, while for a biotech company that is not generating any revenue yet but riding on good expectations/story, you can have x quite high (e.g. take 50% out when the gain is 100%, basically letting just the profit ride...) \n\nIf only I listen to my own advice!",
        "created_utc": 1615324402,
        "id": "gqdh8vd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615353202.0
    },
    {
        "author": "B-dawgisgtaken",
        "body": "1) ENPH\n\n2) I don't Day Trade\n\n3) AVUV\n\n4) RSG, not a bad buy, just wasn't as good as what I could have done with those cash.",
        "created_utc": 1615704477,
        "id": "gqvm8uj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615733277.0
    },
    {
        "author": "Treabeard5553",
        "body": "ENPH, CLF, FLR, MT",
        "created_utc": 1615786836,
        "id": "gqzhkhp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615815636.0
    },
    {
        "author": "FinnTheFog",
        "body": "ENPH is de way",
        "created_utc": 1615875967,
        "id": "gr3ift6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615904767.0
    },
    {
        "author": "vaporwaverhere",
        "body": "No one is mentioning it: ENPH. I will also keep Nvidia.",
        "created_utc": 1615545187,
        "id": "gqodvzz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615573987.0
    },
    {
        "author": "savinger",
        "body": "**Information Technology (15%)**  \nAAPL, MSFT, NVDA, AMD, TSM, EMQQ\n\n**Communication Services (15%)**  \nGOOGL, FB, TWTR, DIS, NFLX, TMUS, PINS, ROKU\n\n**Consumer Discretionary (15%)**  \nAMZN, BABA, ETSY, TSLA, NIO, NKE, XLY, IBUY\n\n**Consumer Staples (10%)**  \nWMT, TGT, SBUX\n\n**Financial (15%)**  \nSQ, PYPL, SHOP, ARKF, XLF\n\n**Energy, Industrials (10%)**  \nPLUG, ENPH, BATT, BA, XLE, PBW\n\n**Healthcare (10%)**  \nMRNA, NVAX, XHS, XHE, XLV, ARKG\n\n**Small-cap Value (10%)**  \nAVUV\n\n–––––\n\nWhat might you consider cutting? How might you change the weightings?",
        "created_utc": 1615629817,
        "id": "gqsbq6a",
        "score": 1,
        "subreddit": "investing",
        "created": 1615658617.0
    },
    {
        "author": "hashtagBob",
        "body": "ENPH",
        "created_utc": 1615523299,
        "id": "gqnnsrp",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1615552099.0
    },
    {
        "author": "bignut09",
        "body": "STPK, RUN, ENPH",
        "created_utc": 1615601526,
        "id": "gqrbs1h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615630326.0
    },
    {
        "author": "psychcloud",
        "body": "What stock will 10-20x in the coming years? I have bets on MP ENPH TDOC FUTU SE.",
        "created_utc": 1615605053,
        "id": "gqrht9n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615633853.0
    },
    {
        "author": "jon_snow3445",
        "body": "ENPH I think will be a beneficiary of the infrastructure package. But you can’t go wrong with a clean energy ETF.",
        "created_utc": 1615512048,
        "id": "gqn37nx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615540848.0
    },
    {
        "author": "chicu111",
        "body": "Yes. For now SunRun is only residential. But residential incentives to add solar panels are rising. The utility department I work at in the city of LA (I can't name it here but you can look up city of LA utility company for both water and power) gives incentives for solar panel ownership. Right now cost of solar installation is still on the expensive end. But it will decrease while you're getting more incentives. Eric Garcetti, our mayor, has demanded 100% renewable in the next 50 years (a little overboard lmao but we're heading there because the mayor tells us to do so)  \n\n\nAs for which one I like better? I like both.   \nENPH for obvious reasons  \nAnd SunRun will be installing solar panels on my garage and roof. I got a quote for 11k. They're good. They will get the permits. Do the engineering (I could do it myself but it's included so fk it). Much more responsive than Tesla (I believe they have moved away from supporting their sunroof shit).",
        "created_utc": 1615163968,
        "id": "gq5qrui",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615192768.0
    },
    {
        "author": "pure_me",
        "body": "id buy enph tbh",
        "created_utc": 1615924562,
        "id": "gr5r1ek",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615953362.0
    },
    {
        "author": "Bman409",
        "body": "short the solar stocks (ENPH, NOVA, TAN)\n\nShort the fuel cells.. (this place wont' even let me list them because within the past 6 months they were like $2 stocks.. now they are in the 20s and 30s.. lol... short them)",
        "created_utc": 1614703291,
        "id": "gpfihsj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614732091.0
    },
    {
        "author": "ModernDayHippi",
        "body": "$ENPH and $EH\n\nBest solar and most advanced eVTOL",
        "created_utc": 1614789414,
        "id": "gpjsmyo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614818214.0
    },
    {
        "author": "Joeyjoejoejabadu",
        "body": "For me? Enphase (ENPH) and Solar Edge (SEDG).",
        "created_utc": 1617062784,
        "id": "gsqwjdf",
        "score": 1,
        "subreddit": "investing",
        "created": 1617091584.0
    },
    {
        "author": "Thalesian",
        "body": "I can't speak to SPWR in particular (though I hold 300 shares). They recently sold a lot of ENPH stock close to its high, so they had a sudden rush of money that's not related to the core of their business, thus their 2020 Q4 results shouldn't be considered representative. \n\nSolar in general has passed a major milestone in 2019/2020 in which it became cheaper than nuclear power (residential solar) and even natural gas (utility solar). Since solar is likely to get cheaper still due to Swanson's law (similar to Moore's law), the tailwinds are very strongly at the back of all stocks in this sector. \n\nThat said, as  an investor I've noticed that the rise in the price of solar equities like SPWR is correlated to EVs. It wouldn't surprise me if solar is just tagged \"green high growth\" in algorithms along with hydrogen and EVs. Right now a lot of their movement is correlated, even though in my opinion the case for solar is much stronger  in the medium and long term than either hydrogen or EVs. It's not like a Tesla is rapidly becoming cheaper than a Honda, but solar is becoming much cheaper than its fossil fuel competitors. \n\nThe biggest concern is the sensitivity these stocks may have to interest rates. Most need debt.",
        "created_utc": 1617034451,
        "id": "gsp8web",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617063251.0
    },
    {
        "author": "HumbleBJJ",
        "body": "Thoughts on ENPH? Buy the dip?",
        "created_utc": 1615988728,
        "id": "gr8if3i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1616017528.0
    },
    {
        "author": "DengarRoth",
        "body": "Apparently that knife fell clear through my palm last week, same with my other clean/renewable holdings (ENPH, ICLN) in my USD account. Makes AQN, NPI, and HCLN's last month look reasonable by comparison.",
        "created_utc": 1615989277,
        "id": "gr8jhhd",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1616018077.0
    },
    {
        "author": "CoffeeQID",
        "body": "So is this a good buying opportunity? \n\nI remember when ENPH was getting hit with fraud allegations and the stock plunged to $40 and look where it is now. \n\nKind of getting a similar feeling here, that maybe this is a good time to buy.",
        "created_utc": 1615958840,
        "id": "gr7iviv",
        "score": 1,
        "subreddit": "investing",
        "created": 1615987640.0
    },
    {
        "author": "ohnoabigshark",
        "body": "I am sorry you are down 20%, that sucks. The irony is in your own words, \"theire incompetance\". My phone would barely let me type that without autocorrect throwing a fit.\n\nIf you're holding shares, all you have to do is wait this out. It's not even a loss, yet. A similar thing happened to ENPH in 2020 and it was all sunshine and moon rockets after. \n\nYou're down 20% because there are plenty of other people having the same impulsive, overcorrecting reaction you are experiencing right now. Yes, PLUG messed up. You should take solace in the fact they are self-reporting, knowing full well it will throw their stock into a shit storm. In their release they note that the updates do not effect their forward looking guidance or path to profitability. If you believed in them enough before to throw a significant amount of money into them, what has changed? \n\nThis is the same price at which SK placed a huge investment in them. Walmart continues to be a big parrner. They are still affirming future guidance. Nothing has changed.",
        "created_utc": 1615984884,
        "id": "gr8bo7k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1616013684.0
    },
    {
        "author": "RigusOctavian",
        "body": "$TAN, $SEDG, $ENPH, $REGI, $CSIQ, $JKS, $PLUG, $CHPT, $NNOMF for a bunch of renewables or related that I track. (I don't hold all of them)",
        "created_utc": 1617204305,
        "id": "gsx9dat",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617233105.0
    },
    {
        "author": "Thetrader2896",
        "body": "Well I am -5% but I do have LEAPS in enph. I was 220% last year hbu ape",
        "created_utc": 1614824965,
        "id": "gplx5u1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614853765.0
    },
    {
        "author": "TheOriginalRK",
        "body": "Jesus fuck Zillow and ENPH. How are you still dying this much",
        "created_utc": 1615234193,
        "id": "gq8zjgy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615262993.0
    },
    {
        "author": "radarbot",
        "body": "Oh man, I really want to believe this. but day after day of 5% decreases in ENPH is messing with my mind. SPWR has a stake in ENPH and its current beat down is a double whammy of two things:\n\n1. SPWR mediocre earnings that don't justify is valuation\n2. Huge rotations out of growth/tech\n\nI think this rotation is honestly excessive. But, if you look back, solar went through this like 5 years ago and only now did it recover to those prices.\n\nI agree that ENPH is the winner in microinverters, and if the green new deal actually goes through I think we'll see a 2x return on ENPH from current prices.",
        "created_utc": 1615236491,
        "id": "gq94uqb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615265291.0
    },
    {
        "author": "Plethorian",
        "body": "I got lucky and bought ENPH under $30 in August of 2019. It's the top performing stock in my portfolio. I keep taking profits out to diversify, lol.",
        "created_utc": 1615170597,
        "id": "gq62pcs",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615199397.0
    },
    {
        "author": "t33po",
        "body": "ENPH got the hammer/souffle treatment lately even though their books still look better than most tech/green memes. Dunno, might fuck around and go full retard with max otm june calls. You know green tech will be big in the infrastucture bill and ENPH inverters are a game changer in the solar game.",
        "created_utc": 1615132415,
        "id": "gq3tqbd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615161215.0
    },
    {
        "author": "InSearchofOMG",
        "body": "ENPH was at 180 like two days ago eesh",
        "created_utc": 1614882374,
        "id": "gpoijd0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614911174.0
    },
    {
        "author": "ajanis_cat_fists",
        "body": "ENPH all day",
        "created_utc": 1614882900,
        "id": "gpojsaw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614911700.0
    },
    {
        "author": "Votadini-magpie",
        "body": " Started investing April last year, 50% into stocks of my choice, 50% to a grouped investment.\n\n I’d picked some well known tech and green energy stocks, SPWR, ENPH, PLUG, NIO, BEP, NEE, REGI, NET &amp; SQ. \n\nAs of January I was around 150% up on my personal investment choices and less than 15% on the grouped investment \n\n I’m getting totally rocked over the last few weeks I’m still positive but another week like we’ve been having and I’ll probably be close to breaking even.\n\n Meanwhile my other 50% invested with St James place. Has dropped but only by 2-3%.\n\n If all my money was in these aforementioned hyped stocks my bum hole would be twitching and it would take all my composure not to sell up while still positive. \n\n I’m glad I’m not 100% in and have more sensible investments elsewhere, but mind you they aren’t anywhere near as thrilling.",
        "created_utc": 1614883997,
        "id": "gpome85",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614912797.0
    },
    {
        "author": "BestGermanEver",
        "body": "Yup, you were right we would be a bit disappointed:\n\n`Numbers from March 9, 2021:`\n\n    ENPH \n    Feb 23/21\t: 170.89 \n    March 08/21\t: 132.06\n    -22.07%\n    \n    ANET\n    Feb 23/21\t: 287.08 \n    March 08/21\t: 267.03\n    - 6.09%\n    \n    OXY\n    Feb 23/21\t:   26.06 \n    March 08/21\t:   29.77\n    + 14.02%\n    \n    WYNN\n    Feb 23/21\t:   136.48 \n    March 08/21\t:   133.74\n    - 2.00%\n    \n    VLO\n    Feb 23/21\t:     75.81 \n    March 08/21\t:     80.56\n    + 6.26%",
        "created_utc": 1615277240,
        "id": "gqb2jxi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615306040.0
    },
    {
        "author": "Habitat0",
        "body": "Rub it in why don’t ya. Anyways just loaded ENPH LAZR MVIS SQ PPYL more TSLA and BNGO",
        "created_utc": 1615329536,
        "id": "gqdsgw0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615358336.0
    },
    {
        "author": "TheOriginalRK",
        "body": "$AAPL, $NIO, CCIV, Zillow, PLUG, ENPh",
        "created_utc": 1615240495,
        "id": "gq9dw7w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615269295.0
    },
    {
        "author": "Energy_Solutions_P",
        "body": "Yes, I manage an options income fund - using a wheel-like strategy. I have done some extensive backtesting modeling over the years on options - and it shows that option buyers lose, and those that sell options win...\n\nSo I sell covered calls, and cash/margin-protected puts. The key is in the stocks you pick for your fund! Do not get lured into only picking high IV high premium plays - like GME! I am not saying do not have GME as one of your plays - but keep the fund balanced, and only allow a small % for dicey plays like GME or BB - BTW - I have both in my fund but both are less then 2% of fund...\n\nSo I try am keep about 25 stocks in my fund - with no one stock over 87-8% of the fund. I have some dividend stocks, small caps, large caps, and try and have diversification - not too many stocks in the same industry or correlated to one another. Again - for these stocks - you have to like them - belief in them, and willing to own them long term. \n\nI have about 40 call and put contracts going all the time - I just keep spinning that wheel! I always make sure that the $$ value of my call stocks is 3 times higher than my put plays. I manage these \"rentals\" for max ROI. I will buy these contracts back if it increases the ROI % significantly.\n\nThis strategy works well in most markets. I do best when the market slowly goes up or flat over time. This strategy also works if the market goes down - slowly. This strategy does not work with market crashes like a year ago - but then only a short strategy would work for that...\n\nMy fund is solid 7 figures - and I average high returns 25%+, but this strategy would work for almost any size fund. Having a large fund like mine does allow for better diversification?\n\nLooking over the past 4-5 years, my biggest winners have been:\n\nMU, EWY, ZEUS, GM, LUMN, UAL, TPH, MHO, AYX, TAN, TSLA, ENPH, SEDG, JKS, FSLR, etc..\n\nIn this above list I have stopped spinning MU, TSLA, ENPH, SEDG due to their huge rise in price making them a bit overvalued for me...\n\n&amp;#x200B;\n\nMy biggest losers:\n\nGPOR, BIIB, MNK, ACB...\n\nSo you can lose by spinning - I was making great option income on GPOR - until they went BK! My mistake with GPOR, MNK, and ACB - I got sucked in by the really juicy premiums...I really did not want to own them long term...\n\nHope this helps;\n\n&amp;#x200B;\n\nESP",
        "created_utc": 1615658325,
        "id": "gqthh6o",
        "score": 1,
        "subreddit": "options",
        "created": 1615687125.0
    },
    {
        "author": "Ratatoskr_v1",
        "body": "ENPH has a great moat in solar, but I'd hold off until the interest rate scare settles one way or another.",
        "created_utc": 1615646409,
        "id": "gqsvidt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615675209.0
    },
    {
        "author": "seven11evan",
        "body": "My only worry about STPK is that I have literally never heard of them and I work for one of the biggest solar and battery installers in my area.  We are in New England so I guess maybe that’s part of it? We’ve installed ENPH, TSLA, Sonnen, and it would be cool to see the stem product in the warehouse.",
        "created_utc": 1615466643,
        "id": "gqkfcgy",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1615495443.0
    },
    {
        "author": "treeeeeeeeeeeeeeee",
        "body": "It's literally down 38% from it's ATH... It's also a decent stock. The tech rebound hasn't fully completed yet so I don't know why you think you've missed the boat. Buy it tomorrow and thank me later. \n\nAlso it's not just Unity, there's loads of stocks that are rebounding. SPCE, JMIA, NIO, LMND, ENPH, etc.",
        "created_utc": 1615514439,
        "id": "gqn7ra1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615543239.0
    },
    {
        "author": "MomoTheFarmer",
        "body": "ENPH when it was on its climb.... $190 stock price\n\nI did 21May21 $210 and 19Mar21 $200   Both calls were in the money 2 days after I placed them.  I was up $6-7k or something.  But I was greedy and held on instead of selling them.  Then BOOM a collapse lol",
        "created_utc": 1615531156,
        "id": "gqnyy2i",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1615559956.0
    },
    {
        "author": "lavishcoat",
        "body": "I'm down bigly. Fuck ENPH",
        "created_utc": 1615379696,
        "id": "gqftklx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615408496.0
    },
    {
        "author": "lavishcoat",
        "body": "What is Enph?",
        "created_utc": 1615382139,
        "id": "gqfxa2y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615410939.0
    },
    {
        "author": "aloahnoah",
        "body": "This subreddit starts hating on every stock once it falls, Same with ark, pltr, etc... Nio and enph are good companies with Strong growth in sector and Business, dont worry about the noise",
        "created_utc": 1614796858,
        "id": "gpka3fx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614825658.0
    },
    {
        "author": "maz-o",
        "body": "what were your initial plans when buying ENPH at 214 and NIO at 64? don't say flipping for a quick buck.",
        "created_utc": 1614777019,
        "id": "gpj2vsq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614805819.0
    },
    {
        "author": "radarbot",
        "body": "I agree, but its just hard to avoid some of the negativity that was in this post:\nhttps://www.reddit.com/r/stocks/comments/lm3ipq/i_feel_like_enph_is_on_sale_thoughts/\n\nLots of people hating on the 200 PE ratio and the product ENPH makes.",
        "created_utc": 1614777985,
        "id": "gpj4hm9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614806785.0
    },
    {
        "author": "Thetrader2896",
        "body": "AMRS has massive upside and PLTR, I like ENPH here too",
        "created_utc": 1614803988,
        "id": "gpkqjhs",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614832788.0
    },
    {
        "author": "beefstake",
        "body": "Margins and earnings growth. MSFT did $15B in profit last quarter, still growing like crazy and also pays a dividend.\n\nENPH has ~80% gross margins and 50% q-on-q rev growth. Which makes for a pretty fucking crazy PEG if you extrapolate using forward PE.\n\nDon't get me wrong there are lots of stocks that deserved their haircuts but I think this trade is way overdone.\n\nIf we weren't already in the middle of a rotation this bond yield hit wouldn't have been so bad. But considering large portfolio managers were already repositioning into energy+financials then this massive bond tantrum came along the correction has been too deep and too broad and hit too many good stocks in the process.",
        "created_utc": 1615175486,
        "id": "gq6bb7o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615204286.0
    },
    {
        "author": "thekingbun",
        "body": "I got completely shook loose of all green energy stonks last week except for ICLN which has ENPH as one of their top holdings.  I’m fucking done with the insane volatility. GLTA",
        "created_utc": 1615166015,
        "id": "gq5uf3v",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615194815.0
    },
    {
        "author": "sunshinelighter",
        "body": "In 2018, my initial investment of about $10K, I rode $ENPH options month over month, and at the peak of August, I had nearly $600K. The day it hit the peak, it continued to drop, and I lost everything in the matter of two weeks. September was one of the worst months...and I always was reminded of the Green Day song, \"Wake Me Up When September Ends\". I was depressed and lost all energy, and couldn't find money to continue doing what I enjoyed the most.   \n\n\nI scraped money together and played $ENPH again for the next earnings, and then it got shorted, lost everything again. The unusual thing was, I was not sad or depressed this time, but more disappointed that I had not learned my lesson. \n\nI found more money again, and tried again in Jan, and hit the ball outta the park and came back up to where I had been. I lost a little with the start of COVID, but did not blow my account.\n\nIf there's anything I learned, you can't \"rush\" to try and \"win it all back\", cause you'll let emotions get in the way of strategy. You learn your lessons now, and I've matured a lot in the sense of knowing when to accept profits, rather than stay greedy. I've also become fearless of blowing accounts too, because of how fortunate I was to continue rebounding. Sometimes, you just need to take a break and let your mind clear before you can start up again. The hardest was always trying to find the liquidity to start all over gain. \n\nA friend once said, \"you're a better trader if you can grow your account from $5k to $100k, then you are from $100k to $1M.\" You're not at 0, so you can surely bounce back.",
        "created_utc": 1614876447,
        "id": "gpo4m6r",
        "score": 1,
        "subreddit": "options",
        "created": 1614905247.0
    },
    {
        "author": "Key-Square4533",
        "body": "Is enph a play?",
        "created_utc": 1617194371,
        "id": "gswq5ag",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617223171.0
    },
    {
        "author": "PandaGodFliesToMoon",
        "body": "Anyone in enph? Eow prediction?",
        "created_utc": 1617173868,
        "id": "gsw39k3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617202668.0
    },
    {
        "author": "2ezyo",
        "body": "Y’all have any spare F5 keys layout around? Completely burned through mine.",
        "created_utc": 1615340938,
        "id": "gqeef8d",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1615369738.0
    },
    {
        "author": "ECE12",
        "body": "You folks are funny as hell with your comments. I am entertained just reading the thread and F5'ing.",
        "created_utc": 1615225882,
        "id": "gq8g7b9",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1615254682.0
    },
    {
        "author": "DalaMoose",
        "body": "Fellow APES, I figured it out.\n\nThe more we mash the f5 key the faster it climbs. \n\nMy wife's boyfriend said I get new crayons today, and her girlfriend said I can watch movies all day.",
        "created_utc": 1615389502,
        "id": "gqgbrk3",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1615418302.0
    },
    {
        "author": "eat_snacky_smores",
        "body": "Reddit hasn't crashed for me. I'm F5'ing my dick off.",
        "created_utc": 1615316709,
        "id": "gqczzrm",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1615345509.0
    },
    {
        "author": "Can_EU_Not",
        "body": "Press F5 a lot probably. \n\nI hope against hope but let’s be honest, hope is all I have. If GME hits 350 this month I’m gonna post a pegging video while singing Rocketman.",
        "created_utc": 1614892252,
        "id": "gpp689h",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1614921052.0
    },
    {
        "author": "nxb123",
        "body": "Time for another day of staring at green/red lines and pressing F5",
        "created_utc": 1614867405,
        "id": "gpnkipf",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1614896205.0
    },
    {
        "author": "ihatehotmail",
        "body": "Trade halts posted here! You can see the time halted and halts last for about 5 minutes. \n\nYou get 5 minutes to go rub one out and get back to hitting F5, apes!\n\nhttps://www.nasdaqtrader.com/trader.aspx?id=TradeHalts",
        "created_utc": 1615398998,
        "id": "gqh0gry",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1615427798.0
    },
    {
        "author": "GangreneMachine",
        "body": "My F5 key is more used than Paris Hilton",
        "created_utc": 1615479133,
        "id": "gql3ojk",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615507933.0
    },
    {
        "author": "JMCatron",
        "body": "must\n\nkeep\n\nmashing\n\nf5",
        "created_utc": 1615401151,
        "id": "gqh64x4",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615429951.0
    },
    {
        "author": "WoolyWeenie",
        "body": "The rocket launch has been postponed weather permitting. Frankly there's absolutely nothing but blue skies, but fuck that shit we are going to launch this shit in the middle of a F5 hurricane and bazooka to the edge of the universe. Until then, we wait. We hold.",
        "created_utc": 1614805027,
        "id": "gpksyjs",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614833827.0
    },
    {
        "author": "brego91",
        "body": "Those 5 minutes of action remind me F&amp;F5",
        "created_utc": 1617048088,
        "id": "gsq2xwo",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1617076888.0
    },
    {
        "author": "Brawnpaul",
        "body": "All you need to do to get karma fast is to sort by new on a popular sub, hit F5 until you find a good post, and be one of the first few comments saying something inline with popular opinion lol.",
        "created_utc": 1617146057,
        "id": "gsutyfa",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1617174857.0
    },
    {
        "author": "Guyote_",
        "body": "Power F5 Hour",
        "created_utc": 1614888402,
        "id": "gpox2sl",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614917202.0
    },
    {
        "author": "morbidcuriosities",
        "body": "may end up doing this myself lol. I have some work to catch up on anyway, it'll give me something to do other than rub the letters off my F5 key during premarket.",
        "created_utc": 1615868377,
        "id": "gr390q3",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615897177.0
    },
    {
        "author": "SlothyPotato",
        "body": "F5 on your keyboard",
        "created_utc": 1615489863,
        "id": "gqlskxt",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615518663.0
    },
    {
        "author": "IncestuousDisgrace",
        "body": "Daily Routine;  \n\n\n1- Wake up at 5 am to look at the PM  \n2- Eat Breakfast  \n3- Quick wank to release stress    \n4- Wait for the GME Thread and press F5 every minute  \n5- Calculate how rich i could be if GME hit xxxx$",
        "created_utc": 1615561410,
        "id": "gqp27se",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615590210.0
    },
    {
        "author": "SillyFlyGuy",
        "body": "I've never purchased an IPO or direct offering. Are we expected to type in RBLX on our broker's site and click F5 until a trade window appears? This seems a little haphazard, none of news articles have any more details either.",
        "created_utc": 1615340432,
        "id": "gqedgz0",
        "score": 3,
        "subreddit": "stocks",
        "created": 1615369232.0
    },
    {
        "author": "suckit23123",
        "body": "Same, spamming f5 like a madman. I'll bet they borrowed another 500k. Almost running out of shorts.",
        "created_utc": 1615221178,
        "id": "gq84rk2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615249978.0
    },
    {
        "author": "racerxff",
        "body": "F5, pray for tendies. All cash tied up right now",
        "created_utc": 1614806475,
        "id": "gpkwbo1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614835275.0
    },
    {
        "author": "Notstrongbad",
        "body": "Yahoo Finance + F5 seizure",
        "created_utc": 1615319002,
        "id": "gqd52uo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615347802.0
    },
    {
        "author": "TopStrategist",
        "body": "Press F\n\nF5 that is\n\nRepeatedly",
        "created_utc": 1615821859,
        "id": "gr0r6kc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615850659.0
    },
    {
        "author": "Disposable_Canadian",
        "body": "Press f5 until it said 330",
        "created_utc": 1615999384,
        "id": "gr9571d",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1616028184.0
    },
    {
        "author": "DalaMoose",
        "body": "Exactly.\n\nWe are Smrter. Much much Smrter than the other guys. They said not nice things once, I dont like them, not at all.\n\nIt's also like flappy bird with no ceilings. Just keep smashing f5 and to mars we go.",
        "created_utc": 1615392621,
        "id": "gqgj876",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615421421.0
    },
    {
        "author": "Plane_Baby",
        "body": "Look at the updated \"as of...\" times. They are different. RH was from 0900 and the other from 1200. Maybe it is not shady just a delay in price updates. Or a good F5 could fix it.",
        "created_utc": 1615397058,
        "id": "gqguk2g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615425858.0
    },
    {
        "author": "SamLynn79",
        "body": "I hit F5 to refresh this guy's comment page many times throughout the day while looking for explanations about what's going on. My brain a smooth polished glass ball.",
        "created_utc": 1615479271,
        "id": "gql3zpi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615508071.0
    },
    {
        "author": "LonelySwinger",
        "body": "#Jim Cramer remembered how to use the downvote again and found the f5 button",
        "created_utc": 1615816678,
        "id": "gr0gmwm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615845478.0
    },
    {
        "author": "OJSimpsons",
        "body": "This is why we f5",
        "created_utc": 1615556797,
        "id": "gqot5yn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615585597.0
    },
    {
        "author": "DidacticGamer",
        "body": "Hit F5 on my checking account until that +$1400 hits so I can get it into RH by Monday.",
        "created_utc": 1615582942,
        "id": "gqqdjaf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615611742.0
    },
    {
        "author": "BillMahersPorkCigar",
        "body": "I’m waiting for a meeting with HR about my excessive internet activity f5’ing GME’s share price all day for the last 2 months",
        "created_utc": 1617022638,
        "id": "gsol0n7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617051438.0
    },
    {
        "author": "gibmekarmababe",
        "body": "F5 F5 F5 !!!",
        "created_utc": 1617024408,
        "id": "gsoo6wd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617053208.0
    },
    {
        "author": "SigmaWind231",
        "body": "CTRL-F5 all day long apes.",
        "created_utc": 1615298356,
        "id": "gqbstbi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615327156.0
    },
    {
        "author": "dryhuot23",
        "body": "Ty I wish I could do more then F5 but Ppl like you keep me alive",
        "created_utc": 1615295339,
        "id": "gqbnfoz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615324139.0
    },
    {
        "author": "LzTangeL",
        "body": "spam F5",
        "created_utc": 1614717571,
        "id": "gpgfnsv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614746371.0
    },
    {
        "author": "sadshark",
        "body": "Dude, it happens to all of us. You press F5 instinctively every 2 minutes.",
        "created_utc": 1616953987,
        "id": "gsln6k2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1616982787.0
    },
    {
        "author": "PM-ME-YOUR-HANDBRA",
        "body": "Just keep pressing F5",
        "created_utc": 1615302903,
        "id": "gqc2oeo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615331703.0
    },
    {
        "author": "junkpile1",
        "body": "There really isn't an established play, other than stay on your toes and F5 like a muhfucka. We're all going to get some great DD after the fact with 20/20 hindsight. I can confidently say, however, that stop loss orders and price targets are going to be bad plays on this one. It's going to be difficult to time the peak of this in real time, let alone ahead of time with an order. A TSL might be the play if you're fully intending for it to trigger in, say, a 10 minute window. But I don't think any apes should be under the impression that a TSL should be implemented earlier than the exact moment they actually intend to sell positions.",
        "created_utc": 1615341037,
        "id": "gqeelzs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615369837.0
    },
    {
        "author": "Addamere",
        "body": "Mashing F5 on the premarket",
        "created_utc": 1615382447,
        "id": "gqfxs74",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615411247.0
    },
    {
        "author": "Disposable_Canadian",
        "body": "Fucking yahoo shit needs to update faster.  I hate mashing F5 because it stalls out.",
        "created_utc": 1615385043,
        "id": "gqg2ftr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615413843.0
    },
    {
        "author": "QuinnMallory",
        "body": "My F5 key broke",
        "created_utc": 1615399048,
        "id": "gqh0m4g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615427848.0
    },
    {
        "author": "HyperionPrime",
        "body": "Put a stack of pennies on the F5 key",
        "created_utc": 1615563262,
        "id": "gqp65pa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615592062.0
    },
    {
        "author": "Staspireone",
        "body": "Today is going to be an important day.\n\nGME is at +3.5 in the pre-market.\n\nLots of things can happen.\n\nThe price is going to go up.\n\nThe price is going to go down.\n\nBut in the long run, the last voice is the bullish movement.\n\n&amp;#x200B;\n\nSo check it out, calm down, jerk off. And just press F5 looking for the u /Corno4825 diary.\n\n&amp;#x200B;\n\nGood luck to you all!!\n\n💎🐵💎🐵💎🐵💎🐵💎",
        "created_utc": 1615555842,
        "id": "gqorgi9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615584642.0
    },
    {
        "author": "TheReginald",
        "body": "Pack it in for the night. Give your F5 a rest.  GG",
        "created_utc": 1615323626,
        "id": "gqdfgac",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615352426.0
    },
    {
        "author": "QuinnMallory",
        "body": "I just F5 a google search for $GME",
        "created_utc": 1615579086,
        "id": "gqq5axo",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1615607886.0
    },
    {
        "author": "Geoffs_Review_Corner",
        "body": "Just hit F5",
        "created_utc": 1615397101,
        "id": "gqguof0",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1615425901.0
    },
    {
        "author": "CrawfishSam",
        "body": "My advice to be less frazzled...\n\nPick 10 or 20 stocks\n\nBuy a little at a time. $500 day one. $500 another day, etc.\n\nBuy more when they are red, not when they are green.\n\nLately I look for ones with 25% upside potential. I usually look for ones 25% below where they have been in the past \\~2 years.\n\nLow debt\n\nPast growth, starting. to turn the corning again  on revenue - maybe hit by covid. \n\nIf they talk about the stock a lot on CNBC in the morning shows it is probably too late. In general CNBC only talks about large stocks so mid and small caps are generally what I end up with. Generally you can follow the trends they talk about Industrials, etc.\n\nPick what's next not what's happening now.\n\nMaybe pick up a couple Banks or Reits below book value - that are improving or their is a reason they will improve (opening economy)",
        "created_utc": 1614880068,
        "id": "gpod1p2",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1614908868.0
    },
    {
        "author": "Giantomato",
        "body": "Corning",
        "created_utc": 1615239582,
        "id": "gq9bw57",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615268382.0
    },
    {
        "author": "Academic-Aside-9088",
        "body": "Lumen Technologies (NYE: LUMN) Expands Fiber Network Across U.S. and Europe\n\nProject uses Corning fiber to create largest ultra-low-loss fiber network in North America, substantially adding to significant fiber network.\n\nAs customer demand for extreme high-capacity, low-latency data transport continues to grow, Lumen Technologies is utilizing its global multi-conduit infrastructure to expand the company’s intercity network by 4.7 million miles of fiber, making it the largest ultra-low-loss fiber network in North America.\n\n“Our newly-built intercity fiber network, created with the latest optical technology, is another example of how our diverse fiber assets differentiate us from other network providers,” said Andrew Dugan, Lumen chief technology officer. “Our multi-conduit infrastructure has a significant amount of capacity for supporting the growing demand for fiber and will allow us to quickly and cost effectively deploy new fiber technology now and in the future. This uniquely positions Lumen to meet the needs of companies seeking highly reliable, low-latency network infrastructure designed to move massive amounts of data.”\n\nThe first phase of this overbuild fiber network, completed in June 2019, connects more than 50 major cities throughout the U.S. and represents another powerful asset in Lumen’s vast global fiber-optic network, which includes a purpose-built long-haul network and dense metro networks designed to stay ahead of the growing data demand. The second phase of this expansion will include areas in Europe and will be completed by early 2021. The expanded infrastructure, using the latest optical innovations from Corning Incorporated (NYSE: GLW), will enhance performance levels across Lumen’s network, benefiting businesses, government agencies and providers seeking fiber to build their own secure, scalable networks for demanding next-generation applications.\n\nThis project uses Corning’s SMF-28® ULL fiber and SMF-28® Ultra fiber in a hybrid Corning® SST-UltraRibbon™ cable. With a silica core design, SMF-28 ULL fiber offers the lowest loss of any terrestrial-grade optical fiber and will provide the CenturyLink network with a boost in optical signal-to-noise ratio (OSNR) which can extend optical reach at very high data rates. The added capacity will further improve the scalability of the network to meet the high bandwidth demands of emerging technologies and applications such as 5G, augmented reality, high-definition video streaming and the Internet of Things.\n\n“A next-generation network requires next-generation optical infrastructure, and we believe Corning's fiber and cable innovations will enable Lumen and its customers to unlock the opportunities presented by the Internet of Things and other transformative technologies\" said Dr. Bernhard Deutsch, vice president and general manager, Corning Optical Fiber and Cable. \"With the expanded optical reach and capacity provided by our ultra-low-loss fiber, Lumen will magnify the capabilities of their expansive, scalable fiber network.”\n\nLumen was able to quickly and cost effectively complete the first phase of the project using multi-conduit infrastructure already in place. The company is currently selling routes to large enterprise companies and content providers in the U.S. and will work with customers to add additional routes as needed.\n\nKey Facts:\n\nLumen is creating an extensive 4.7-million fiber mile intercity fiber network across the U.S. and parts of Europe.\nThe first phase, comprising 3.5 million fiber miles, was completed in June 2019.An additional 1.2 million fiber miles will be added by early 2021.\nLumen is currently selling fiber routes to large enterprise companies and content providers in the U.S.\nMulti-conduit infrastructure allows Lumen to quickly and economically deploy new fiber technology or    add network capacity as needed.\nThe expanded fiber network utilizes Corning’s SMF-28® ULL fiber and SMF-28® Ultra fiber, creating the largest ultra-low-loss fiber network in North America.\n\nAdditional Resources\n\n *See Lumen’s expanded intercity network map:  http://filecache.mediaroom.com/mr5mr_century_link/183014/FiberMap_Update0719_FINAL.jpg\n\n *Hear Andrew Dugan explain the benefits of the fiber network expansion: http://origin-qps.onstreammedia.com/origin/multivu_archive/MNR/Century_Link_Dark_Fiber_Andrew_Dugan_Proof_v4.mp4\n\n *Learn more about CenturyLink Dark Fiber:  http://www.centurylink.com/business/networking/dark-fiber.html\n\n *Learn more about Corning’s SMF-28® ULL fiber and SMF-28® Ultra fiber: https://www.corning.com/worldwide/en/products/communication-networks/products/fiber/smf-28-ull.html\n\nAbout Lumen Technologies \n\nLumen Technologies is the second largest U.S. communications provider to global enterprise customers. With customers in more than 60 countries and an intense focus on the customer experience, Lumen strives to be the world’s best networking company by solving customers’ increased demand for reliable and secure connections. The company also serves as its customers’ trusted partner, helping them manage increased network and IT complexity and providing managed network and cyber security solutions that help protect their business.\n\nAbout Corning Incorporated\n\nCorning (www.corning.com) is one of the world's leading innovators in materials science, with a more than 165-year track record of life-changing inventions. Corning applies its unparalleled expertise in glass science, ceramic science, and optical physics along with its deep manufacturing and engineering capabilities to develop category-defining products that transform industries and enhance people's lives. Corning succeeds through sustained investment in RD&amp;E, a unique combination of material and process innovation, and deep, trust-based relationships with customers who are global leaders in their industries.",
        "created_utc": 1614862451,
        "id": "gpnbrqm",
        "score": 1,
        "subreddit": "investing",
        "created": 1614891251.0
    },
    {
        "author": "GryphonR",
        "body": "Like others, I've been seeing information pop up around the impending sand shortage for a while but haven't looked for tickers.\n\nWhat are your thoughts behind Corning and AGC? My smooth brain tells me that if the cost of their raw material increases their profit margins get reduced, cost of product increases and share price likely decreases?",
        "created_utc": 1615380640,
        "id": "gqfuxhx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615409440.0
    }
]