[
    {
        "author": "shutupdigit",
        "body": "!banbet ADSK 280 1w or I’ll get a butterfly tattooed on my foot and post feet pics",
        "created_utc": 1633899561,
        "id": "hg5e8kw",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1633928361.0
    },
    {
        "author": "VisualMod",
        "body": "Ban Bet Created\n---\n**/u/shutupdigit** bet **ADSK** goes to **280.0** in **1 week** **or i’ll get a butterfly tattooed on my foot and post feet pics**",
        "created_utc": 1633899575,
        "id": "hg5e9qv",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1633928375.0
    },
    {
        "author": "notbrokemexican",
        "body": "A lot of people don't understand FB as an infrastructure company. They have a lot of influence in the web market. For example, Twitters architecture rework is primarily using Facebook technology. Even Microsoft's design pattern is written in Facebook's frontend language.\n\n\nTheir AR language is good. It's easy and it's going to interop to make dreadful shit like Autodesk or Roblox easier to work with.",
        "created_utc": 1635467585,
        "id": "higafw5",
        "score": 11,
        "subreddit": "stocks",
        "created": 1635496385.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet\n---\n\n/u/shutupdigit made a bet that ADSK would go to 280.0 when it was 278.94 and it did, congrats retard.",
        "created_utc": 1633961730,
        "id": "hg8b7hf",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633990530.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet\n---\n\n/u/Disada1 made a bet that ADSK would go to 280.0 when it was 278.94 and it did, congrats retard.",
        "created_utc": 1633961737,
        "id": "hg8b7zn",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633990537.0
    },
    {
        "author": "jsntx",
        "body": "Nice story. I really thought 3D printing was going to take off and lost money on SSYS a few years ago. \n\nThe problem is that 3D printing for the masses required a smarter user. This is not VCR-level of complexity. That was not gonna happen. On the other hand, if only a company could revolutionize the way to interact with the model and the machine, to dumb it down, this could've been another story. Autodesk and other CAD companies have been spending millions and decades trying to solve this problem for their own markets without major success. Their users still have to be engineers or highly skilled technicians and designers. \n\nOpen source is not the solution here. It requires the ruthlessness and vision of a Steve Jobs to make 3D printers ubiquitous. Otherwise, they should be relegated to commercial and industrial applications. \n\nI still think 3D printing should take off, but I'm not following the stocks any more.",
        "created_utc": 1633850308,
        "id": "hg2twnu",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1633879108.0
    },
    {
        "author": "localmain",
        "body": "ALBO, BABA, ADSK, MSFT, SE. Have ~$4700 invested, mostly into SE and MSFT.",
        "created_utc": 1633445811,
        "id": "hfhhpqy",
        "score": 6,
        "subreddit": "stocks",
        "created": 1633474611.0
    },
    {
        "author": "so_ruck_te",
        "body": "I've been investing in New Zealand shares since March 2020 and made some solid gains (due to very lucky timing rather than skill). Recently I've been doing more thorough research about investing – such as learning how to read a balance sheet. I've adjusted my portfolio based on what I learned. Would love any feedback from more experienced investors!\n\nContext: I'm 29, investing for the long-term, and \"success\" would be beating the S&amp;P 500. I enjoy investing in individual companies rather than indexes.\n\n**COMPANIES**\n\nFedEx Corp (FDX) – **14.54%** (bought a week ago, the current price seems fantastic)\n\nSynlait Milk (SML) – **12.47%** (newish NZ dairy company, consistent growth in profits until it was hit badly by Covid, share price dropped by about 80% before I bought)\n\nNike, Inc. (NKE) – **8.37%**  – rock-solid balance sheet, double-digit growth in all regions\n\nFord Motor Co. (F) – **7.54%** – I like its chances in the EV race, seems undervalued at the moment, infinitely more popular than GM outside North America\n\nApple Inc (AAPL) – **6.24%** – Love the company\n\nAutodesk Inc. (ADSK) – **4.11%** – My girlfriend works in the construction/design industry, and tells me that Autodesk makes fantastic products. ADSK has increasing market penetration in industries which are traditionally resistant to tech.\n\nF&amp;C Investment Trust (FCT) – **3.97%** – exposure to Amazon + FAANG\n\nGoldman Sachs Group, Inc. (GS) – **3.41%**\n\nJP Morgan Global Growth &amp; Income (JPG) – **3.03%** – exposure to S&amp;P 500 and some foreign stocks\n\nTempleton Emerging Markets Investment Trust (TEM) – **3.00%** – exposure to Chinese stocks\n\nHingham Institution For Savings (HIFS) – **2.65%** – a small S&amp;L in Boston and DC; their 2021 annual report makes for exhilarating reading\n\nFletcher Building (FBU) – **2.49%** – bluechip construction company in NZ/Australia\n\nDelegat Group (DGL) – **1.61%** – fast-growing winemaker in NZ/Australia\n\nGeneral Motors (GM) – **0.14%**\n\n**FUNDS**\n\nNZ Top 50 Fund (FNZ) – **6.22%**\n\nEmerging Markets Responsible Fund (EMG) – **5.29%**\n\nAsia Pacific Fund (APA) – **3.35%**\n\nUS Large Growth Fund (USG) – **3.08%**\n\nNZ Mid Cap Fund (MDZ) – **1.33%**\n\n**OTHER**\n\nKiwisaver (similar to 401k)\t– **7.14%**",
        "created_utc": 1633823618,
        "id": "hg1jkte",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633852418.0
    },
    {
        "author": "Disada1",
        "body": "!banbet ADSK 280 1w or I’ll donate $250 to a charity of /u/shutupdigit 's choice",
        "created_utc": 1633915361,
        "id": "hg6cfg1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633944161.0
    },
    {
        "author": "ionlypwn",
        "body": "I like FB, are we all going to act like we didn’t know that, that is how the algorithm works? I also am starting to like AAPL, GOOG, ATVI, and ADSK. I do have some value stocks that I already own but I don’t want more exposure to.",
        "created_utc": 1633369750,
        "id": "hfdl1od",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633398550.0
    },
    {
        "author": "bootcamper64",
        "body": "|\\*\\*Symbol\\*\\*|\\*\\*Percent Of Account\\*\\*|  \n:--|:--|  \n|CLF|12.46%|  \n|FVRR|9.49%|  \n|SBLK|8.68%|  \n|CRM|7.42%|  \n|SHOP|6.84%|  \n|SPAXX\\*\\* (CASH)|6.49%|  \n|ADSK|5.63%|  \n|ASO|5.41%|  \n|UPST|5.15%|  \n|SDC|4.46%|  \n|BBIG|4.22%|  \n|GOLD|4.13%|  \n|MT|4.06%|  \n|PAYC|4.03%|  \n|DOCU|3.58%|  \n|PLTR|3.17%|  \n|XLY|2.49%|  \n|SNOW|2.18%|  \n|OCUL|1.39%|  \n|CRNT|1.31%|  \n|SKLZ|1.27%|\n\n&amp;#x200B;\n\nMy main stock picking  account. Have another 'set and forget' account with SPY and bluechips (MSFT, APPL, WMT, etc)",
        "created_utc": 1634850789,
        "id": "hhjgryp",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634879589.0
    },
    {
        "author": "VisualMod",
        "body": "Ban Bet Created\n---\n**/u/Disada1** bet **ADSK** goes to **280.0** in **1 week** **or i’ll donate $250 to a charity of /u/shutupdigit 's choice**",
        "created_utc": 1633915376,
        "id": "hg6cgjl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633944176.0
    },
    {
        "author": "St3w1e0",
        "body": "They do seem profitable and cash flow positive though? Granted they had quite a large SGA adjustment last year so I too doubt the EBITDA margin and revenue growth. It looks like Tempo is the software with the CTO from Autodesk and a blue chip customer list (NASA, Cognex) while the acquisitions are the manufacturing capability so together they should help win more contracts. Its not massively overvalued so I don't think there's a big rerate risk if they fail to grow topline that quick.",
        "created_utc": 1634215868,
        "id": "hglsty6",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1634244668.0
    },
    {
        "author": "shutupdigit",
        "body": "I’m really pissed that even besides the rblx and asana bets I won ADSK and NTLA but they’re not there because he just decided I wouldn’t have gotten a tattoo if I lost. I wouldn’t have said it if I didn’t mean it and I’m fucking angry. Whatever I’ll lose the 3rd one and hang out with u/josh439 or maybe I just won’t come back to the sub that was causally ruined because for whatever reason I’m excluded from it.",
        "created_utc": 1634310155,
        "id": "hgqvbms",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634338955.0
    },
    {
        "author": "NooshBagoosh",
        "body": "Still can't figure out this market; missed a nice day on software. Big openers for INTU, ADBE, and ADSK. The latter of which is still holding at +2.5%.",
        "created_utc": 1634142552,
        "id": "hgi0v6d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634171352.0
    },
    {
        "author": "shutupdigit",
        "body": "well disada1’s bet is on there which is weird Bc he bet on my bet. And zachs bet is on there which is weird because that was also my bet. But I also won NTLA 130 and bet on it at 122 so it’s weird that’s not on there also my with ADSK 280 which was the same exact bet disada1 made saying if it lost he would donate to a charity of my choosing so basically I’m being selectively left off.",
        "created_utc": 1634314945,
        "id": "hgr6y8s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634343745.0
    },
    {
        "author": "codename_JS28",
        "body": "Yes. Apart from Amazon which is just too fucking good of a company to not invest in, everything I own I believe to be at least somewhat decent for the fabric of american society.\n\nMy biggest holdings: TGT, a standard retailer that seems to provide decent pay and conditions to workers, but not depressing like Wal-mart. NVDA which I don't believe uses slave labor etc in china to make their products. ADSK which is an innocuous software company with an effective monopoly in the industry I work in (plus the infrastructure bill bodes very well for them). $SBUX which despite making sugary drinks and making people fatter has awesome brand strength.  HLT just a good hotel chain and CRSR they make computer parts. Lmao",
        "created_utc": 1634954214,
        "id": "hhp2e3n",
        "score": 1,
        "subreddit": "stocks",
        "created": 1634983014.0
    },
    {
        "author": "Meisterthemaster",
        "body": "not that, i just dont see much future in current stock-market companies in the 3d-printing field. Stratasys, for example, are awesome printers, but way to expensive. Autodesk makes very good software, but they are also very expensive and have to compete with blender (free). Software like solidworks is still about 2000 a year. none of them shows any future promise on the 3d-printing field. \n\nlike i said, if there is a promising candidate on the stock-market for 3d-printing i will not hesitate to invest. but i dont see that candidate yet.\n\nOn a side-note: (now that i see that Markforged is on the marked) this is a company that shows promise.",
        "created_utc": 1635188841,
        "id": "hi0qfr5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635217641.0
    },
    {
        "author": "slotracer43",
        "body": "Likewise, you can't sell as soon as a stock is up 50% or 100%.\n\nLong NVDA since IPO. Long ADSK since somewhere in the 90's, LULU for over 10 years, etc.\n\nEdited for typo...",
        "created_utc": 1635699156,
        "id": "his63bc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635727956.0
    },
    {
        "author": "flobbley",
        "body": "Not right now because I need my cash for other things but if I were I would be looking at T. Rowe Price and Autodesk.",
        "created_utc": 1633360480,
        "id": "hfcxgms",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633389280.0
    },
    {
        "author": "lanchadecancha",
        "body": "12% of your portfolio in a dairy company with less than a billion market cap, in a country of a 5mm people.  \n\nAutodesk is great though",
        "created_utc": 1634054883,
        "id": "hgdafkg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1634083683.0
    },
    {
        "author": "smokeyjay",
        "body": "I think the faamg stocks are ok.  Also started a $ttwo and $adsk position.  Sold off my $upst position.\n\nFb forward pe for 2022 will be 20.  These companies are growing revenue at 20-40%.  They have too much cash.  This year and the next could be rough but 5 years out i expect tech to beat the sp500. \n\nI do have a small amount of $xeg (canadian etf) i bought a while ago and may add more.",
        "created_utc": 1633981931,
        "id": "hg9n01h",
        "score": 1,
        "subreddit": "investing",
        "created": 1634010731.0
    },
    {
        "author": "RationalExuberance7",
        "body": "SSD and ADSK\n\nThere are some stock to hold for months, others for years, rare others for decades. Those two hidden gems are for generations - through recessions and depressions and technological disruptions",
        "created_utc": 1634444951,
        "id": "hgy4g9p",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1634473751.0
    },
    {
        "author": "shutupdigit",
        "body": "No no it was one bet at a time. I first tried to make like 3 at at a time and couldn’t but I won the ADSK bet on Monday and then right after I won I placed the NTLA bet. So the ones I couldn’t place were ASAN and RBLX but I would have won those too. I just figured the tattoo was a pretty good high stakes bet I was also fairly confident I wouldn’t have to get it. Does that make more sense?",
        "created_utc": 1634955093,
        "id": "hhp45gb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634983893.0
    },
    {
        "author": "smokeyjay",
        "body": "Added to QQQ type etf.  May add more to $adsk, $ttwo if it goes further down.  \n\nWaiting for some of the smaller tech stocks to drop further til I start a position.  Would be great to own SHOP, TWLO, NVDA thats not overly expensive.",
        "created_utc": 1633376333,
        "id": "hfe2vka",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633405133.0
    },
    {
        "author": "aksalamander",
        "body": "I would be interested in autodesk or procore stock, both of which support construction. Both are sticky higher profit margin software businesses. Probably overvalued at the moment from a value perspective, though.",
        "created_utc": 1635220582,
        "id": "hi2p0w4",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1635249382.0
    },
    {
        "author": "Prestigious_Word1543",
        "body": "Buy adsk calls, ur welcome.",
        "created_utc": 1634838985,
        "id": "hhinnqz",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1634867785.0
    },
    {
        "author": "codename_JS28",
        "body": "I’m kinda chill tbh not investing in basically a platform for lies and spreading fear and violence. Moral investor gang sleeps well at night. Chillin with my $ADSK shares",
        "created_utc": 1634858568,
        "id": "hhjxzv4",
        "score": -3,
        "subreddit": "SPACs",
        "created": 1634887368.0
    },
    {
        "author": "nickytotherescue",
        "body": "SHOP, TSLA, NFLX &amp; AVGO. Other stocks like GOOG, MU &amp; AMD look good too.",
        "created_utc": 1633363706,
        "id": "hfd556e",
        "score": 8,
        "subreddit": "stocks",
        "created": 1633392506.0
    },
    {
        "author": "optionsCone",
        "body": "&gt;\tApple Poised To Slash iPhone Production Goal Due To Chip Crunch; Apple Suppliers Broadcom, TI Struggling To Deliver Enough Chips\n\nDammit Apple",
        "created_utc": 1634068998,
        "id": "hge8xrw",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1634097798.0
    },
    {
        "author": "daaabears1",
        "body": "There are so many companies that offer greater growth than Ericsson. The components that Ericsson makes are high cost and low margin. On top of that they have to compete to get contracts. The downside to this is that the number of contracts can be sporadic and unreliable. To my knowledge there isn’t much, if any, advantage to choosing Ericsson versus Nokia components. Further, BofA recently came out with their 14 moonshot technologies report that said 5G will be the shortest cellular generation before we move into 6G. Also, the S&amp;P has risen 26% in the last year (98% in last 5 years) and Ericsson has risen 3.9% in the past year (54% in last 5 years) so it’s significantly trailing the market. If you are dead set on 5G, I’d suggest looking in $FIVG because they own holdings that have performed greater than Ericsson. Take a look at $FIVG holdings like apple, google, or semi companies like $AVGO, $QCOM.",
        "created_utc": 1633100180,
        "id": "hezcqxy",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633128980.0
    },
    {
        "author": "HoomanBeing123",
        "body": "I'm thinking about adding CHPS horizon's semiconductor etf which holds NVDIA, TSM, ASML, Intel, Broadcom. Any suggestions? Thanks",
        "created_utc": 1634523680,
        "id": "hh28g71",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1634552480.0
    },
    {
        "author": "Puzzleheaded-Fuel795",
        "body": "https://cir-inc.com/broadcom-cisco-inphi-and-the-timing-for-co-packaged-optics-a-cir-research-note/",
        "created_utc": 1634702941,
        "id": "hhbncyc",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1634731741.0
    },
    {
        "author": "JMOE-23",
        "body": "Why doesn’t anyone ever mention MRVL?  \n\nUnder $70 and making great acquisitions to be competitive w Broadcom which is over $500. \n\nJust asking. Ty fellow investors.",
        "created_utc": 1634656065,
        "id": "hh8o3w2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634684865.0
    },
    {
        "author": "merc123",
        "body": "Glad I avoided WATT at $8 around their IPO. \n\nI believed in it when Apple thought about using them 5 years ago for OTA charging.  They had a grand idea of whole house charging. You walk in and your phone automatically starts charging anywhere in your house (within distance of the charging station - like WiFi). FCC and Apple squashed that idea when they didn’t approve it and Apple went with Broadcom Qi. \n\nEven with this approval I’m not so sure. There are a lot of physics hurdles that it would face. You would need a lot of these devices to cover a house or multiple devices to cover even a room in a standard US home. Also distance plays a big factor - longer = less charging power to the point it may not even be relevant.  WiFi has less of these hurdles obviously. \n\nThrowing a couple hundred at it as a speculative stock may be worthwhile.",
        "created_utc": 1634660859,
        "id": "hh8zlpt",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1634689659.0
    },
    {
        "author": "Spiritual_Extreme_81",
        "body": "Broadcom sold off today sooo I’m sure it’s true",
        "created_utc": 1634081660,
        "id": "hgf2jb0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634110460.0
    },
    {
        "author": "yopladas",
        "body": "You could look at non-Chinese companies with revenue expose in China. \n\nFor example, electronics used to make smartphones and PCs are made using parts from Qualcomm (CPU), Micron Technologies (flash memory), Broadcom, Veeco, AMD, TI (semiconductors). There is less exposure (&lt;=25%) at NVidia, Intel, Apple, CAT, Ford, GM, Starbucks, Nike, and Apple all have some exposure but not a huge amount, which is good. \n\nYou can search for more companies using Tijori Finance's website, for example have a look at Apple here: https://tijorifinance.com/us/company/AAPL/overview",
        "created_utc": 1633624194,
        "id": "hfquqxz",
        "score": -1,
        "subreddit": "investing",
        "created": 1633652994.0
    }
]