[
    {
        "author": "sockalicious",
        "body": "Step 2:  Using comparators from other industries, while ignoring available data from representatives of the same industry such as Motorola, Texas Instruments, 3DFX, ATI, National Semiconductor, Rockwell Semi, TRW, VM Labs et cetera.",
        "created_utc": 1635142526,
        "id": "hhyg20t",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1635171326.0
    },
    {
        "author": "Summebride",
        "body": "Lots of line item beats here.  But the bigger story is more qualitative, in that other chip companies like Texas Instruments and Intel report woes and gloom from supply chain, yet AMD has been rolling along.",
        "created_utc": 1635284078,
        "id": "hi627ov",
        "score": 21,
        "subreddit": "stocks",
        "created": 1635312878.0
    },
    {
        "author": "nekomech",
        "body": "Literally any other semi.  It’s going to take INTC years to turn around.  CEO keeps pointing to the foundry that’s going to come in 2024 if there are zero delays and they execute well.\n\nAMD\nNVDA\nTXN\nMU\nTSM\nQCOM\nAMAT\n\nor just buy SOXX, or SOXL if you are feeling spicy.\n\nI will bet $100 that INTC underperforms both SOXX and QQQ in 2022.",
        "created_utc": 1635321459,
        "id": "hi80p74",
        "score": 9,
        "subreddit": "investing",
        "created": 1635350259.0
    },
    {
        "author": "bearhunter429",
        "body": "Texas Instruments market cap $183.78B.\n\nSelling calculators must be really profitable.",
        "created_utc": 1635273396,
        "id": "hi5asbv",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635302196.0
    },
    {
        "author": "bungholio99",
        "body": "If you can check Lenovo, record growth discounted cause china stock.\nVery innovative and in several markets (Motorola is also Lenovo today and Fujitsu) own manufacturing so has priority during chip crisis.\nGood investments and JV (NIO, NEC,Netapp)\nBiggest Cloud Server Provider for Microsoft and SAP.\n\nIf semi-conducteur Qualcomm they are leading in Smartphone,Tablet and get used in further appliances.\n\nBaba or AMS/Flex for the risky ones and AMD/Texas Instruments/TSMC/Apple as the safe bets.\n\nAlways watch the SOX when buying Semi Conducteur\n\nhttps://www.marketwatch.com/investing/index/sox",
        "created_utc": 1634983743,
        "id": "hhq73ry",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635012543.0
    },
    {
        "author": "StockTipsTips",
        "body": "Possibly Very Bullish Sectors for the Next 3-12 Months Amid Troubled Times. The examples below are certainly not buy recommendations. Just examples.\n\nBelow is a list of what I consider possible bullish sectors/industries in the next 3-12 months. We all know of the supply chain issues, the semiconductor shortages, worker shortages, &amp; inflation issues. As a result I'm considering these sectors/industries as possible bullish options in the next 3-12 Months. Please understand that I know that I did not get all stocks in each category. So if you're favored stock isn't listed, don't get angry, post it in the comments below. And if you feel I missed a sector, please let me know. \n\nAnyway enjoy the dips now because these are likely to get beefed up as the supply chain &amp; worker shortages unwind\n\n.\n\n**1)** **Inelastic &amp; Fairly inelastic Industries:** (*Meaning people usually pay for the good or service no matter what the price \"insensitive to changes in price or income\"*) \n\n* Pharmaceuticals (With highly used patented meds for diseases &amp; illnesses)\n* Oil/Gas/Natural Gas (No matter how scarce it gets, people will buy it)\n* Energy (Be careful, many producers of electricity are heavily regulated)\n\n**2) Agriculture/Farm Equipment/Fertilizers/Farm Chemicals:** People got to eat ... and have you seen the price of softs futures? This will incentivize farmers to produce more which in turn will require more farm equipment, farm construction, pesticides, herbicides, insecticides, seeds, chemicals etc. It does not help that food is rotting on the docks right now &amp; people are panic buying.\n\n* **Examples:** YTEN, TITN, NTR, SANW, DE, DOLE, ANDE, CLXT, ADM, CLXT, AGRO, AGCO, ADM, LMNR, TWI, ADM, BG, CALM, GRWG, HYFM, FMC, MEOH, \n\n**3) Semiconductors, Passive Semiconductors, &amp; Electronic Components:** Semiconductors are suffering due to worker shortages &amp; supply chain issues. However demand is seriously backed up. As soon as the supply chain situation gets straightened out expect semiconductors to explode.\n\n* **Examples:** NVDA, INTC, ARCB, AMKR, MU AMD, TXN, VSH, STM, ASYS, WOLF, TSM, QCOM, ON, ASML, NXP, AMAT, AVGO, LRCX, SWKS, MRVL, KLAC, MCHP, QRVO, SSNLF, DIOD\n\n**4) Shipping/Bulk Transportation/Freight/Transportation Services:** Shipping / Bulk Transportation / Freight / Transportation Services / are more in demand now than ever before in US history. In fact these services are in so much demand that they're clogging up the ports. And while ships sitting off the coast are likely loosing money as the supply chain issues worsen, you can bet they'll explode with business for pint up demand as the situation unwinds. \n\n* **Examples:** ZIM, JBHT, NSC, TNK, TGP, CNI, CMRE, REVG, DAC, SB, HTZZ, GRIN, ODFL, ASC, EDRY, XPO, SBLK, FWRD, BEST, CPLP, MATX, SAIA, INSW, GASS, PATI, PSHG, NETI, PXS, ULH, USDP, TFII, KNOP, KNX, CHRW, GLOP, EDRY, CVLG, PAC, HUBG, EDRY, MRTN, GLNG, NMM, HMLP, BEST, CPLP, DESP, HTLD, PWFL, GOGL, EGLE, SHIP, ZTO, LSTR, WERN, USAK, ESEA, GNK, CICOY, OROVY, PCFBY, CSX, DSX, MMLP,  PANL, KEX, NAT, UNP, WJRYY\n\n**5)** **Chemicals:** Agriculture chemicals, industrial chemicals, construction chemicals, drilling chemicals, textile chemicals, take your pick. The worlds manufacturers do not run without chemicals of some sort. And once supply chain issues are put behind us &amp; workers start to fill these empty job seats, you can bet that increased production will ramp up the demand for industrial chemicals. \n\n* **EXAMPLES:** HUN, OLN, DOW, LYB, EMN, GLTC, KRO, UNVR, CBT, MEOH, APD, OEC, VHI, ODC, TREC, TROX, IOSP, DD, KOP, ALB, LAC, PPG\n\n**6) Staffing Firms:** There's a massive worker shortage &amp; those positions will need to be filled. You can bet staffing firms are in high demand.\n\n* **EXAMPLES:** DLHC, CCRN, KFY, CBRE, HQI, RHI, WDAY, NSP, HSII, RGP, TBI, KFRC, \n\n**7) Inferior goods:** Ever notice how demand for some products go up when prices rise? These are generally inferior goods. Ramen Noodles &amp; Mac&amp;Cheese are a few examples. Dollar Stores are filled with inferior goods. \n\n* DG, DLTR, WMT, ROST, KHC",
        "created_utc": 1635443044,
        "id": "hieog2c",
        "score": 5,
        "subreddit": "investing",
        "created": 1635471844.0
    },
    {
        "author": "wsupduck",
        "body": "Texas Instruments",
        "created_utc": 1633375969,
        "id": "hfe1vls",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1633404769.0
    },
    {
        "author": "redbatman2",
        "body": "Texas Instruments is in a different market than the other semiconductor companies.",
        "created_utc": 1634857496,
        "id": "hhjvqn3",
        "score": 3,
        "subreddit": "stocks",
        "created": 1634886296.0
    },
    {
        "author": "azwel",
        "body": "Amazon Google  Facebook. Microsoft.Apple. Tesla. Home depot, Texas instruments, shopify...  Abbvie Altria and various dividend stocks..etc",
        "created_utc": 1633899188,
        "id": "hg5dcow",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633927988.0
    },
    {
        "author": "95Daphne",
        "body": "TSM actually happens to be its top holding.\n\nBesides NVDA/AMD, outside of the semiconductor equipment stocks, you have AVGO (holding of mine since last year) and TXN...besides them I'm not sure about anybody else.",
        "created_utc": 1635176542,
        "id": "hhzwas3",
        "score": 3,
        "subreddit": "investing",
        "created": 1635205342.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "Dropped $TXN from my watchlist 6 mos ago when it was trading at 190, just checked it - yup. Still 190",
        "created_utc": 1634220793,
        "id": "hgm33ym",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634249593.0
    },
    {
        "author": "ReThinkingForMyself",
        "body": "It's very interesting to read all of the different perspectives about the chip industry, good stuff. I took a less granular approach. Intel has been an iconic business for my entire adult lifetime and has survived many troubles. I'm not looking for a moon stock, just something that is likely to keep It's value for the next 20 years or so, grow modestly, and keep paying the dividend. Bleeding edge chips are not going to fuel growth forever. Soon we will reach the limits and needs of human perception, and performance/graphics improvements won't have as much value as in the past.\n\nThe covid and climate crises appear to predict a contraction in globalization  and a simplification of supply chains, which may benefit Intel in the near future. Its name recognition, market cap, low p/e, importance to American interests, and forward looking attitude all indicate a \"buy\" to me. I see Texas Instruments  taking advantage of the current situation as well.",
        "created_utc": 1633272718,
        "id": "hf8cdzj",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1633301518.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 26th of October\n\n\n\n## Upcoming events for Tuesday, October 26th\n\n - Expected earnings:\n\n  AAN, AAT, ABG, ACCO, ACH, ACU, ADM, AGR, AGYS, AHT, AKO.A, AKO.B, AKR, AMD, AMP, APAM, ARCC, ARCH, AUDC, AWI, AWRE, BEN, BGFV, BSBR, BUSE, BXP, BYD, CAC, CAJ, CB, CCB, CCBG, CCNE, CEQP, CHRW, CIT, CMRE, CNC, COF, CSGP, CVLT, CZOO, CZWI, DALN, DAN, DBVT, DHIL, DLR, EBMT, ECL, EDU, EGP, ENPH, ENTG, EQR, ESS, FBHS, FCBC, FCF, FCPT, FELE, FFIC, FFIV, FFNW, FFWM, FIBK, FRAF, FRBA, FRME, FSV, GBX, GE, GIC, GLW, GOOG, GOOGL, GPK, HA, HAFC, HAS, HBCP, HFBL, HIW, HNP, HONE, HOOD, HPP, HRZN, HSBC, HT, HUBB, HZO, IBCP, IEX, INMD, IVZ, JBLU, JNPR, KAI, LBAI, LBC, LBRT, LFUS, LLY, LMT, MANH, MASI, MKL, MMM, MMYT, MSCI, MSFT, MTDR, MYOV, NAVI, NBR, NBTB, NCR, NETI, NOV, NVS, OMAB, OVBC, OXSQ, PCAR, PCB, PEBO, PERI, PFG, PHM, PII, PJT, PNR, PROV, QS, QURE, RARE, RCKY, RNDB, ROIC, RRC, RRD, RTX, SBSI, SEB, SFBC, SFNC, SFST, SHW, SPFI, SPGI, SSTK, ST, TECK, TENB, TER, TPB, TRMK, TRTN, TRU, TTM, TWOU, TWTR, TXN, UBCP, UBS, UDR, UMBF, UPS, USNA, UTMD, V, VBTX, VNE, WIRE, WM, WNEB, WRLD, WSBC, WSR, XRX, ZWS\n\n - Ex-div:\n\n  AM, ATR, CLX, CMC, DNUT, ENTG, INFY, PSEC\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.310%)\n    - API Weekly Crude Oil Stock (previous: 3.294M)\n    - CB Consumer Confidence (consensus: 108.3, previous: 109.3)\n    - Dallas Fed Services Revenues (previous: 14.5)\n    - House Price Index (previous: 1.4%)\n    - House Price Index (previous: 19.2%)\n    - House Price Index (previous: 348.4)\n    - New Home Sales (consensus: 760K, previous: 740K)\n    - New Home Sales (previous: 1.5%)\n    - Redbook (previous: 15.4%)\n    - Richmond Manufacturing Index (previous: -3)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -3)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 1.5%, previous: 1.5%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 20.0%, previous: 19.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.5%, previous: 1.5%)\n    - Texas Services Sector Outlook (previous: 8.3)\n\n## Upcoming events for Wednesday, October 27th\n\n - Expected earnings:\n\n  ACBI, ACGL, ACNB, ADP, AEM, AEMD, AFI, AFL, AGI, AINC, AIT, ALG, ALGN, ALGT, ALKS, ALRS, ALSN, AM, AMSF, APH, AR, ARES, AROW, ARR, ASGN, ATNI, AVB, AVID, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BFIN, BG, BHE, BHR, BMRN, BMY, BOOT, BRKL, BSM, BSX, BWFG, BXMT, CACI, CADE, CAMT, CASH, CBD, CBTX, CCS, CDE, CHDN, CHEF, CHX, CINF, CIVB, CLB, CME, CMPR, CNMD, CNO, COFS, CONE, CPF, CPSH, CRSP, CSTM, CSV, CTS, CTSH, CUBI, CX, CYBE, CYH, DB, DGICA, DGICB, DMRC, DRE, DRVN, DT, DTE, DX, E, EAT, EBAY, ECHO, EHC, ENSG, EQC, EQT, ESI, ESRT, ETD, EVR, EVTC, EW, EXR, F, FARO, FBC, FCNCA, FDBC, FDP, FISV, FIX, FLEX, FLOW, FLS, FMNB, FNWB, FORM, FRBK, FRTA, FWRD, GD, GGB, GHM, GLOP, GM, GORO, GRMN, GSHD, GSK, GTY, HAYW, HBNC, HEES, HES, HESM, HLT, HOG, HVT, HVT.A, HWKN, IBA, ICLR, ILPT, INOV, INVA, INVH, IP, IRBT, IRT, ISBC, IVC, JAKK, JBT, JMP, JOE, KHC, KLAC, KN, KO, KRA, KRC, KRNY, LARK, LC, LEXX, LOB, MAA, MAS, MBIN, MC, MCD, MEOH, MHH, MHO, MKSI, MN, MNRO, MOH, MORN, MPX, MSA, MTH, MUSA, MXL, MYRG, NDLS, NFBK, NGVT, NLY, NMR, NOA, NOVA, NOW, NSC, NSR, NTB, NTGR, NYCB, OBNK, OC, ODFL, ODT, OII, ONCS, ORLY, ORN, PAG, PAYA, PB, PDM, PEGA, PGC, PGRE, PI, PINS, PLXS, PPC, PPD, PW, QCRH, R, RBBN, RDY, RE, RES, RIBT, RJF, ROCK, ROL, RVPH, RWT, SAVE, SC, SCI, SF, SIGI, SIM, SIMO, SIX, SLAB, SLGN, SMED, SMP, SNBR, SONY, SP, SPOK, SPOT, SREV, SRI, SSB, SSBI, STC, STCN, STLA, STXB, SU, SYBT, TDOC, TDY, TEL, TESS, TEVA, THFF, THG, TMHC, TMO, TNL, TROX, TTMI, TWLO, TYL, UCTT, UEC, UMC, UPWK, URI, USLM, UTHR, UVE, UVSP, VALE, VGZ, VICI, VIST, VKTX, VMAR, VNDA, VRT, VRTS, VSEC, WAB, WCN, WFG, WH, WHG, WOLF, XLNX, YNDX, YUMC, ZDGE, ZVO\n\n - Ex-div:\n\n  BPMP, COP, FRC, KNOP\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.990%)\n    - Core Durable Goods Orders (consensus: 0.4%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.715M)\n    - Crude Oil Inventories (consensus: 1.650M, previous: -0.431M)\n    - Cushing Crude Oil Inventories (previous: -2.320M)\n    - Distillate Fuel Production (previous: -0.289M)\n    - Durable Goods Orders (consensus: -1.1%, previous: 1.8%)\n    - Durables Excluding Defense (previous: 2.4%)\n    - EIA Refinery Crude Runs  (previous: -0.071M)\n    - EIA Weekly Distillates Stocks (consensus: -2.350M, previous: -3.913M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.1%, previous: -2.0%)\n    - Gasoline Inventories (consensus: -1.850M, previous: -5.368M)\n    - Gasoline Production (previous: 0.455M)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 0.6%)\n    - Goods Trade Balance (previous: -88.16B)\n    - Heating Oil Stockpiles (previous: 0.037M)\n    - MBA 30-Year Mortgage Rate (previous: 3.23%)\n    - MBA Mortgage Applications (previous: -6.3%)\n    - MBA Purchase Index (previous: 266.2)\n    - Mortgage Market Index (previous: 643.0)\n    - Mortgage Refinance Index (previous: 2,807.9)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Wholesale Inventories (previous: 1.2%)\n\n## Upcoming events for Thursday, October 28th\n\n - Stock splits:\n\n    - SSBI @ **110:100** (Payable date: 11/04/2021)\n\n - Expected earnings:\n\n  AAPL, AB, ABCB, ABMD, ABTX, ACHC, ADS, AEP, AGCO, AGL, AIRC, AJG, ALDX, ALGM, ALIM, ALNY, AMAL, AMT, AMZN, AOS, AQMS, ARGX, ASPN, ATEN, ATI, ATOM, ATR, AUY, AVNT, AVT, AVTR, AX, BAX, BC, BCLI, BIO, BIO.B, BPMC, BSIG, BSMX, BTU, BVN, BWMX, BY, CARR, CAT, CBRE, CBZ, CDNA, CFFN, CFR, CG, CHE, CHKP, CLVT, CMCO, CMCSA, CMS, CNOB, CNSL, CNX, CODI, COHU, COLB, COLM, COOP, COR, CPG, CPT, CRS, CTO, CUZ, CVEO, CVLY, CWST, CWT, DAIO, DBD, DECK, DQ, DRQ, DVA, DVD, DXCM, EB, EBC, EGO, EIG, EME, EMN, ENVA, ERIE, EVBN, EVLO, EXP, EXPO, FBIZ, FCN, FE, FHI, FISI, FLWS, FMX, FRST, FTAI, FTDR, FTV, FVCB, GILD, GLPI, GNCA, GPI, GSIT, GTX, GVA, HBAN, HIG, HLI, HSY, HTBK, HTGC, HTH, HUBG, HVT, HVT.A, ICE, IDA, IMAX, INSM, INT, ITGR, ITW, JHG, KBR, KDP, KEX, KMPR, KNSL, KRG, LADR, LAWS, LECO, LH, LIN, LKQ, LMAT, LOPE, LPLA, LTC, LTH, LVO, MA, MAYS, MCBC, MCO, MD, MDC, MDP, MERC, MGRC, MHK, MIXT, MMSI, MO, MPW, MPWR, MRK, MSBI, MSTR, MTLS, MVIS, NATI, NEM, NKSH, NLSN, NOC, NOK, NTST, NVCR, NVT, NXGN, OCFC, OFC, OPBK, OPI, OPK, OPRA, ORC, ORI, OSIS, OSK, OSTK, PACK, PATK, PBF, PBFX, PEB, PFC, PFHD, POLY, POWI, PRFT, PRLB, PSB, PTCT, PTEN, PVBC, QUMU, RDS.A, RDS.B, RGEN, RILY, RLGY, RMD, RNST, RS, RSG, SAH, SAIA, SBCF, SBFG, SBUX, SCM, SGEN, SHBI, SHEN, SHOP, SID, SILC, SIRI, SJW, SKX, SKYW, SM, SMMF, SNDR, SNY, SPNE, SPSC, SSNC, STAG, STM, SVBI, SWI, SWK, SYK, TAL, TAP, TAP.A, TARO, TBBK, TEAM, TEX, TFII, TFX, THRM, TIGO, TOWN, TPX, TREE, TRS, TVTX, TW, TXRH, TXT, ULBI, ULH, USAK, USCB, VC, VCRA, VLY, VRSN, WDC, WERN, WEX, WLTW, WNS, WRAP, WRE, WST, WTBA, X, XEL, YUM, ZEN\n\n - Ex-div:\n\n  AA, ACI, ADC, AGNC, AOS, ARC, BRMK, BSRR, CARR, CFG, CIT, COST, CRT, CSWI, DCP, DNP, DSX, EARN, EFC, EPD, EPR, FERG, FT, GEL, GRP.U, HMLP, KFFB, LEVI, LND, MAIN, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PRT, PSXP, PVL, PZN, RBNC, SBNY, SCHL, SCM, SIG, SJT, SKT, SLG, STAG, TRGP, UNB, UNM, VRTS, WHF, ZTS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 7-Year Note Auction (previous: 1.332%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 2,415K, previous: 2,481K)\n    - Core PCE Prices (consensus: 4.50%, previous: 6.10%)\n    - GDP (consensus: 2.7%, previous: 6.7%)\n    - GDP Price Index (consensus: 5.5%, previous: 6.2%)\n    - GDP Sales (previous: 8.1%)\n    - Initial Jobless Claims (consensus: 290K, previous: 290K)\n    - Jobless Claims 4-Week Avg. (previous: 319.75K)\n    - KC Fed Composite Index (previous: 22)\n    - KC Fed Manufacturing Index (previous: 10)\n    - Natural Gas Storage (consensus: 90B, previous: 92B)\n    - PCE Prices (previous: 6.5%)\n    - Pending Home Sales (consensus: 0.5%, previous: 8.1%)\n    - Pending Home Sales Index (previous: 119.5)\n    - Real Consumer Spending (previous: 12.0%)\n\n^^^^2021-10-26",
        "created_utc": 1635242415,
        "id": "hi3h3xm",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635271215.0
    },
    {
        "author": "zen_gambler",
        "body": "If you could only pick one of these to buy tomorrow, which would it be and why?\n\n1. FB\n\n2. MSFT\n\n3. JPM\n\n4. COIN\n\n5. V\n\n6. TXN\n\n7. COF\n\n8. MA\n\n9. SHLX\n\n10. ADBE",
        "created_utc": 1635077812,
        "id": "hhuqjai",
        "score": 2,
        "subreddit": "investing",
        "created": 1635106612.0
    },
    {
        "author": "Capasian",
        "body": "Thank you so much for these two meaningful and insightful posts. For a long time I have been trying to convince my friend to drop Intel stock (mostly based on their shrinking market share, your data nicely adds), but he still believes in the power of inertia. Nevertheless, I had gathered a list of stocks one IMO can use instead, not overperformative, but solid. \n\nI think that top pick is ASML - instead of betting on a sloppy big player in a growing market, you switch to the main supplier of players in this market. \nTexas Instruments and Analog Devices are good picks if you trust in the electronics segment as a whole, and they provide a wider product mix in terms of electronic components and integrated circuits.\nAnd my favorites also are companies, that produce good measurement instruments. I do solid state physics, and there is funny coincidence - producers of devices I like and use generally show good performance at a stock market. Those are Ametek, Agilent, Keysight, Danaher (Fortive).\n\nWhether you have the opinion on these companies, I would highly appreciate it.",
        "created_utc": 1634888953,
        "id": "hhlf79e",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634917753.0
    },
    {
        "author": "daydancer",
        "body": "PEP, TXN, UPS, PG are nice blue chip stocks with decent dividend. These are long term investments for my portfolio though\n\nMy actual dividend portfolio only consists of O, IRM, and IEP. In that order, they increase in yield percentage. IEP pays the most at 8 dollars a year for a nice yield of 14.61%. Dividend stocks are great but can quickly be unprofitable if the losses offset the payout so its good to buy dips and monitor performance as needed.",
        "created_utc": 1634334371,
        "id": "hgsgtht",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634363171.0
    },
    {
        "author": "redbatman2",
        "body": "They make completely different types of chips. Texas Instruments makes analog chops while intel and TSM does digital chips.",
        "created_utc": 1634853998,
        "id": "hhjo5gr",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634882798.0
    },
    {
        "author": "BUDDHA_LAUGHING",
        "body": "I've read many of the projects first hand at a my job and I can speak to it a bit but it's been a long day and this is a big subject with many aspects.  I will just mention the main one along with some publicly traded companies.  The main buzz word or \"thrust\" right now is \"Digital Twins\" for \"remote viewing.\"  Matterport MTTR is mapping and storing the interiors of the world which will be used at some point in the future for the metaverse.  The reverse of this is Snapchat SNAP whose glasses will merge the digital world into your viewing and will be able to record the two together for content posting.  A larger aspect is that 5G is using mmWaves so that mmWave radar can also be part of the 5G towers.  This will allow unmanned drones to fly and film and allow remote viewing in real-time.  MmWave radar chips are now being added to phones (I think mostly from TXN) so that the drones can ping them to navigate indoors unmanned.  These chips also are supposed to work with augmented reality Snapchat or Magic Leap type apps.  Not investment advice.  This is a very boring post for a subject I'm actually excited about.  Sorry, just tired...",
        "created_utc": 1634864398,
        "id": "hhkacx3",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1634893198.0
    },
    {
        "author": "BackgroundJudge2896",
        "body": "Low-multiple semis (TXN, QCOM), some energy on big drawdowns like yesterday, airlines, MA/V, and pharma/biotech",
        "created_utc": 1635409397,
        "id": "hicvkgg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635438197.0
    },
    {
        "author": "asianrockstar2009",
        "body": "Texas Instruments",
        "created_utc": 1635443741,
        "id": "hieq9v8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635472541.0
    },
    {
        "author": "jbonesmiller1981",
        "body": "MSFT,V,DIS,TXN,LOW,SBUX,PYPL,DOV,NEP,ABT",
        "created_utc": 1633666242,
        "id": "hftescq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633695042.0
    },
    {
        "author": "daydancer",
        "body": "My favorites are blue chip/large cap stocks and I've made some nice returns by doing so. They are not risk-free but way less risk compared to small caps/short squeezes. The strategy is literally buy low, sell high lol. Study the daily chart and find the lows and high of the stocks. Some stocks like to bounce within a range for weeks or even months.\n\nA super great example is TXN. It reached 197 in April and it usually bounces down to its lows (174-180) and bounces back up to 190s. It has repeated this pattern for MONTHS and just yesterday, it hit 186 and today it bounced right back up. AXP has also been fairly predictable, lows (155-161), and highs (171-179). When stocks break out of their range, then I usually stop trading it for awhile to see the new boundaries. At what price you sell is up to you, but my minimum goal is a 2% return but if the stock is looking strong I try to aim for 5% or above. During this choppy market recently, I've also been having major fun with SBUX, V, WM, UPS, AMD, VTI.",
        "created_utc": 1634254501,
        "id": "hgo8nft",
        "score": 1,
        "subreddit": "stocks",
        "created": 1634283301.0
    },
    {
        "author": "More-Sprinkles29",
        "body": " Just started managing an account. Looking to restructure/consolidate a portfolio for long term growth - already have a few thoughts on which ones I plan to sell. Wanted to seek other's constructive criticism on what should be removed or added. May consider reallocating some of that cash into existing portfolio stocks (I.e. MSFT or DIS), but definitely looking to diversify and potentially include some new stocks. \n\nAbout me: In late twenties; high risk tolerance, no outstanding debt or loans. Potentially use a portion of the funds for a wedding  house purchase in the next 5 years. \n\n  \nBolded below is what I'm thinking of selling. Thoughts?  \nSymbol  % Of Account  \nAMZN 9.83%  \nAAPL 18.68%  \nSCHW 2.21%  \nCSCO 5.74%  \nCOST 2.31%  \n**GILD 0.43%**  \n**INTC 5.74%**  \nMSFT 7.82%  \nMRNA 1.52%  \nTXN 7.14%  \nDIS 3.37%  \nQQQ 2.27%  \n**VWO 1.31% (maybe)**  \n**VNQ 2.12% (maybe)**  \n**TWCUX 4.89%**  \n**FRESX 1.52%**  \n**GTHIX 2.42%**  \n**MWTRX 1.05%**  \n**PONAX 0.89%**  \n**SWCAX 7.01%**  \n**SWANX 0.42%**  \n**SWISX 0.96%**  \n**SWSSX 5%**  \n**TBGVX 1.12%**  \n**VALIX 1.36%**  \n**VSGAX 1.90%**",
        "created_utc": 1634288958,
        "id": "hgpvfzj",
        "score": 1,
        "subreddit": "investing",
        "created": 1634317758.0
    },
    {
        "author": "2E26",
        "body": "Continue watching my existing stonks. I want to dump UWMC and WISH if they go green. I may go for an even hundred shares of LYG, as they seem promising.\n\nLonger term (or sooner if one of my more expendable stocks looks moonish) is to get more TXN or go wild and get some TGT. Not hoping to live off of dividends, but it provides me with some money to play around with cheaper stocks (like LYG).",
        "created_utc": 1634699501,
        "id": "hhbh1d8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634728301.0
    },
    {
        "author": "BackgroundJudge2896",
        "body": "When? Not seeing anything on it right now. TXN is dropping bc they had in-line guidance (dumb reason for a drop), but not seeing any sympathy with TSM.",
        "created_utc": 1635284179,
        "id": "hi62gk9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635312979.0
    },
    {
        "author": "Intrepid_Artist",
        "body": "How TSMC was build? \nIn the late 80s. By experiences of Morris Chang and taiwanese government determination to build tech. Morris Chang passed his PhD at Stanford University in 60s and worked at Texas Instruments for nearly 3 decades before Taiwan government recruited him. \n\nHe holds opinion only real rival to TSMC is Samsung, cause of operating advantages and local talent. American foundries relay on subsidies, which can give short term boost but can not guarantee long term edge. \nMorris Chang find ironic (once) mighty Intel wants enter foundry, when they refused investing into TSMC.\n\nWhat is my conclusion from above? One man, a strong CEO matters. I believe  Pat Gelsinger is the right guy for the j",
        "created_utc": 1635323556,
        "id": "hi833jq",
        "score": 1,
        "subreddit": "investing",
        "created": 1635352356.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Friday, the 29th of October\n\n\n\n## Upcoming events for Friday, October 29th\n\n - Expected earnings:\n\n  ABBV, ABR, AENZ, AON, AREC, ASIX, ASX, ATNM, ATRO, B, BAH, BBVA, BCH, BCPC, BELFA, BELFB, BLX, BSAC, CBOE, CCJ, CERN, CHD, CHT, CHTR, CL, COWN, CRI, CVX, DCOM, ECVT, ENIC, ENLV, ESXB, FNCB, FSFG, FTS, GIGM, GRC, GWW, HEXO, HUN, IMGN, IMO, IRMD, IROQ, ITCB, JCS, LAZ, LEVL, LHX, LYB, MGI, MSEX, NECB, NICK, NOVN, NPK, NTP, NVO, NWG, NWL, OIIM, OXLC, PBR, PBR.A, PFS, PHVS, PIPR, PLPC, PNM, POR, PSX, PSXP, RCL, RUTH, SHLX, SIFY, SJR, SLCA, SNP, TTE, TWIN, TZOO, UBOH, URG, UUUU, WETF, WPC, WY, XOM, ZNH\n\n - Ex-div:\n\n  ALLY, AON, ATLO, AVAL, BCBP, BK, BMO, BMTC, BX, C, CAG, CASY, CE, CZNC, DGICA, DGICB, DMLP, ENLC, EVTC, EWBC, HAS, HEP, HFBL, HIFS, KMI, KOF, KRP, LCUT, LNT, NRG, NVEC, OKE, ORRF, PAYX, PBCT, PLBC, PNM, PPBI, RBB, RVI, SAN, SGU, SPFI, STL, SXT, SYF, TKC, TXN, VALU, VOC, WES\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.6K)\n    - CFTC Copper speculative net positions (previous: 40.6K)\n    - CFTC Corn speculative net positions (previous: 277.0K)\n    - CFTC Crude Oil speculative net positions (previous: 429.6K)\n    - CFTC Gold speculative net positions (previous: 193.3K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.1K)\n    - CFTC Natural Gas speculative net positions (previous: -131.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 67.6K)\n    - CFTC Silver speculative net positions (previous: 30.4K)\n    - CFTC Soybeans speculative net positions (previous: 43.5K)\n    - CFTC Wheat speculative net positions (previous: -8.6K)\n    - Chicago PMI (consensus: 63.5, previous: 64.7)\n    - Core PCE Price Index (consensus: 0.2%, previous: 0.3%)\n    - Core PCE Price Index (consensus: 3.7%, previous: 3.6%)\n    - Dallas Fed PCE (previous: 2.80%)\n    - Dallas Fed Services Revenues (previous: 14.0)\n    - Employment Benefits (previous: 0.40%)\n    - Employment Cost Index (consensus: 0.9%, previous: 0.7%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.80%)\n    - Michigan Consumer Expectations (consensus: 67.2, previous: 68.1)\n    - Michigan Consumer Sentiment (consensus: 71.4, previous: 71.4)\n    - Michigan Current Conditions (consensus: 77.9, previous: 80.1)\n    - Michigan Inflation Expectations (consensus: 4.8%, previous: 4.6%)\n    - PCE Price index (previous: 4.3)\n    - PCE price index (previous: 0.4%)\n    - Personal Income (consensus: -0.2%, previous: 0.2%)\n    - Personal Spending (consensus: 0.5%, previous: 0.8%)\n    - Real Personal Consumption (previous: 0.4%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.6%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 3.9%)\n    - Texas Services Sector Outlook (previous: 11.5)\n    - U.S. Baker Hughes Oil Rig Count (previous: 445)\n    - U.S. Baker Hughes Total Rig Count (previous: 543)\n\n## Upcoming events for Monday, November  1st\n\n - Expected earnings:\n\n  ABIO, ADC, ADTN, ADUS, AKTS, ALX, AMC, AMG, AMRC, ANAT, ANET, APEN, APLS, AWR, BEN, BNL, BRKR, BRX, BWXT, CACC, CAR, CCLP, CEA, CHGG, CLDB, CLX, CNA, CORR, CPLP, CRNT, CRUS, CSR, CSWC, CURO, CVI, CWBC, DSPG, DSS, DZSI, EC, EEX, EGRX, ENBL, EPRT, EVER, FANG, FEDU, FGBI, FN, FSBW, GAIA, GAME, GSS, GTE, GXO, HLIT, HNRG, HOLX, IPI, ISEE, IVAC, IVT, IX, JELD, KFRC, KLDO, KMT, KOF, L, LDI, LEG, LPG, LTRN, LXU, MCK, MFIN, MGP, MNOV, MOS, MRBK, MVBF, NBIX, NERV, NNN, NRIM, NSP, NSSC, NTR, NXPI, O, OGS, OIS, ON, ONVO, OTTR, PCG, PDLB, PLOW, PSA, RGS, RHP, RIG, RMBS, RRX, RYAAY, SBAC, SBT, SCCO, SKT, SMLR, SNDX, SOI, SPG, SUNW, SXC, TA, TGB, TKR, TRVG, TRVN, TTI, UAN, UNVR, VBIV, VNO, VNOM, VRNS, WBK, WLFC, WMB, WMK, WTRG, XENT, ZI\n\n - Ex-div:\n\n  AES, BANR, BKR, ETRN, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, HIHO, IGD, ITUB, LMRK, O, OMF, SHLX, SPH, SRCE, VER, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.055%)\n    - 6-Month Bill Auction (previous: 0.060%)\n    - Construction Spending (consensus: 0.4%, previous: 0.3%)\n    - ISM Manufacturing Employment (previous: 50.2)\n    - ISM Manufacturing New Orders Index (previous: 66.7)\n    - ISM Manufacturing PMI (consensus: 60.4, previous: 61.1)\n    - ISM Manufacturing Prices (consensus: 78.5, previous: 81.2)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 59.2, previous: 60.7)\n    - Total Vehicle Sales (previous: 9.66M)\n\n^^^^2021-10-29",
        "created_utc": 1635501611,
        "id": "hihss0l",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1635530411.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 27th of October\n\n\n\n## Upcoming events for Wednesday, October 27th\n\n - Expected earnings:\n\n  ACBI, ACGL, ACNB, ADP, AEM, AEMD, AFI, AFL, AGI, AINC, AIT, AKO.A, AKO.B, ALG, ALGN, ALGT, ALKS, ALRS, ALSN, AM, AMSF, APH, AR, ARES, AROW, ARR, ASGN, ATNI, AVB, AVID, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BFIN, BG, BHE, BHR, BMRN, BMY, BOOT, BRKL, BSM, BSX, BWFG, BXMT, CACI, CAMT, CASH, CBD, CBTX, CCS, CDE, CHDN, CHEF, CHX, CINF, CIVB, CLB, CME, CMPR, CMRE, CNMD, CNO, COFS, CONE, CPF, CPSH, CRSP, CSTM, CSV, CTS, CTSH, CUBI, CX, CYBE, CYH, DB, DGICA, DGICB, DMRC, DRE, DRVN, DT, DTE, DX, E, EAT, EBAY, ECHO, EHC, ENSG, EQC, EQT, ESI, ESRT, ETD, EVR, EVTC, EW, EXR, F, FARO, FBC, FCNCA, FDBC, FDP, FIBK, FISV, FIX, FLEX, FLOW, FLS, FMNB, FNWB, FORM, FPI, FRBK, FRTA, FWRD, GD, GGB, GHM, GLOP, GM, GORO, GRMN, GSHD, GSK, GTY, HAYW, HBNC, HEES, HES, HESM, HLT, HOG, HWKN, ICLR, ILPT, INOV, INVA, INVH, IP, IRBT, IRT, ISBC, IVC, JAKK, JBT, JMP, JOE, KHC, KLAC, KN, KO, KRA, KRC, KRNY, LARK, LC, LEXX, LOB, MAA, MAS, MBIN, MC, MCD, MEOH, MHH, MHO, MKSI, MN, MNRO, MOH, MORN, MPX, MSA, MTH, MUSA, MXL, MYRG, NBN, NDLS, NFBK, NGVT, NLY, NMR, NOA, NOVA, NOW, NSC, NSR, NTB, NTGR, NYCB, OBNK, OC, ODFL, ODT, OII, ONCS, ORLY, ORN, PAG, PB, PDM, PEGA, PGC, PGRE, PI, PLXS, PPC, PPD, PW, QCRH, R, RBBN, RDY, RE, RES, RIBT, RJF, ROCK, ROL, RVPH, RWT, SAVE, SC, SCI, SF, SIGI, SIM, SIMO, SIX, SLAB, SLGN, SMED, SMP, SNBR, SONY, SP, SPOK, SPOT, SREV, SRI, SSB, SSBI, STC, STCN, STLA, STXB, SU, SYBT, TDOC, TDY, TEL, TESS, TEVA, THFF, THG, TMHC, TMO, TNL, TROX, TTMI, TWLO, TYL, UCTT, UEC, UMC, UPWK, URI, USLM, UTHR, UVE, UVSP, VALE, VGZ, VICI, VIST, VKTX, VMAR, VNDA, VRT, VRTS, VSEC, WAB, WCN, WFG, WH, WHG, WOLF, XLNX, YNDX, YUMC, ZDGE, ZVO\n\n - Ex-div:\n\n  BPMP, COP, FRC, KNOP\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.990%)\n    - Core Durable Goods Orders (consensus: 0.4%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.715M)\n    - Crude Oil Inventories (consensus: 1.914M, previous: -0.431M)\n    - Cushing Crude Oil Inventories (previous: -2.320M)\n    - Distillate Fuel Production (previous: -0.289M)\n    - Durable Goods Orders (consensus: -1.1%, previous: 1.8%)\n    - Durables Excluding Defense (previous: 2.4%)\n    - EIA Refinery Crude Runs  (previous: -0.071M)\n    - EIA Weekly Distillates Stocks (consensus: -2.311M, previous: -3.913M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.3%, previous: -2.0%)\n    - Gasoline Inventories (consensus: -1.862M, previous: -5.368M)\n    - Gasoline Production (previous: 0.455M)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 0.6%)\n    - Goods Trade Balance (previous: -88.16B)\n    - Heating Oil Stockpiles (previous: 0.037M)\n    - MBA 30-Year Mortgage Rate (previous: 3.23%)\n    - MBA Mortgage Applications (previous: -6.3%)\n    - MBA Purchase Index (previous: 266.2)\n    - Mortgage Market Index (previous: 643.0)\n    - Mortgage Refinance Index (previous: 2,807.9)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Wholesale Inventories (previous: 1.2%)\n\n## Upcoming events for Thursday, October 28th\n\n - Stock splits:\n\n    - SSBI @ **110:100** (Payable date: 11/04/2021)\n\n - Expected earnings:\n\n  AAPL, AB, ABCB, ABMD, ABTX, ACHC, ADS, AEP, AGCO, AGL, AIRC, AJG, ALDX, ALGM, ALIM, ALNY, AMAL, AMT, AMZN, AOS, AQMS, ARGX, ASPN, ATEN, ATI, ATOM, ATR, AUY, AVNT, AVT, AVTR, AX, BAX, BC, BCLI, BIO, BIO.B, BPMC, BSIG, BSMX, BTU, BVN, BWMX, BY, CARR, CAT, CBRE, CBZ, CDNA, CFFN, CFR, CG, CHE, CHKP, CLVT, CMCO, CMCSA, CMS, CNOB, CNSL, CNX, CODI, COHU, COLB, COLM, COOP, COR, CPG, CPT, CRS, CTO, CUZ, CVEO, CVLY, CWST, CWT, DAIO, DBD, DECK, DQ, DRQ, DVA, DVD, DXCM, EB, EBC, EGO, EIG, EME, EMN, ENVA, ERIE, EVBN, EVLO, EXP, EXPO, FBIZ, FCN, FE, FHI, FISI, FLWS, FMX, FRST, FTAI, FTDR, FTV, FVCB, GILD, GLPI, GNCA, GPI, GSIT, GTX, GVA, HBAN, HIG, HLI, HSY, HTBK, HTGC, HTH, HUBG, HVT, HVT.A, ICE, IDA, IMAX, INSM, INT, ITGR, ITW, JHG, KBR, KDP, KEX, KMPR, KNSL, KRG, LADR, LAWS, LECO, LH, LIN, LKQ, LMAT, LOPE, LPLA, LTC, LTH, LVO, MA, MAYS, MCBC, MCO, MD, MDC, MDP, MERC, MGRC, MHK, MIXT, MMSI, MO, MPW, MPWR, MRK, MSBI, MSTR, MTLS, MVIS, NATI, NEM, NKSH, NLSN, NOC, NOK, NTST, NVCR, NVT, NXGN, OCFC, OFC, OPBK, OPI, OPK, OPRA, ORC, ORI, OSIS, OSK, OSTK, PACK, PATK, PBF, PBFX, PEB, PFC, PFHD, POLY, POWI, PRFT, PRLB, PSB, PTCT, PTEN, PVBC, QUMU, RDS.A, RDS.B, RGEN, RILY, RLGY, RMD, RNST, RS, RSG, SAH, SAIA, SBCF, SBFG, SBUX, SCM, SGEN, SHBI, SHEN, SHOP, SID, SILC, SIRI, SJW, SKX, SKYW, SM, SMMF, SNDR, SNY, SPNE, SPSC, SSNC, STAG, STM, SVBI, SWI, SWK, SYK, TAL, TAP, TAP.A, TARO, TBBK, TEAM, TEX, TFII, TFX, THRM, TIGO, TOWN, TPX, TREE, TRS, TVTX, TW, TXRH, TXT, ULBI, ULH, USAK, USCB, VC, VCRA, VLY, VRSN, WDC, WERN, WEX, WLTW, WNS, WRAP, WRE, WST, WTBA, X, XEL, YUM, ZEN\n\n - Ex-div:\n\n  AA, ACI, ADC, AGNC, AOS, ARC, BRMK, BSRR, CARR, CFG, CIT, COST, CRT, CSWI, DCP, DNP, DSX, EARN, EFC, EPD, EPR, FERG, FT, GEL, GRP.U, HMLP, KFFB, LEVI, LND, MAIN, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PRT, PSXP, PVL, PZN, RBNC, SBNY, SCHL, SCM, SIG, SJT, SKT, SLG, STAG, TRGP, UNB, UNM, VRTS, WHF, ZTS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 7-Year Note Auction (previous: 1.332%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 2,415K, previous: 2,481K)\n    - Core PCE Prices (consensus: 4.50%, previous: 6.10%)\n    - GDP (consensus: 2.7%, previous: 6.7%)\n    - GDP Price Index (consensus: 5.5%, previous: 6.2%)\n    - GDP Sales (previous: 8.1%)\n    - Initial Jobless Claims (consensus: 290K, previous: 290K)\n    - Jobless Claims 4-Week Avg. (previous: 319.75K)\n    - KC Fed Composite Index (previous: 22)\n    - KC Fed Manufacturing Index (previous: 10)\n    - Natural Gas Storage (consensus: 90B, previous: 92B)\n    - PCE Prices (previous: 6.5%)\n    - Pending Home Sales (consensus: 0.5%, previous: 8.1%)\n    - Pending Home Sales Index (previous: 119.5)\n    - Real Consumer Spending (previous: 12.0%)\n\n## Upcoming events for Friday, October 29th\n\n - Expected earnings:\n\n  ABBV, ABR, AENZ, AON, AREC, ASIX, ASX, ATNM, ATRO, B, BAH, BBVA, BCH, BCPC, BELFA, BELFB, BLX, BSAC, CBOE, CCJ, CERN, CHD, CHT, CHTR, CL, COWN, CRI, CVX, DCOM, ECVT, ENIC, ENLV, ESXB, FNCB, FSFG, FTS, FUSB, GIGM, GRC, GWW, HUN, HWBK, IMGN, IMO, IRMD, IROQ, ITCB, JCS, LAZ, LEVL, LGND, LHX, LYB, MGI, MSEX, NECB, NICK, NOVN, NPK, NTP, NVO, NWFL, NWG, NWL, OIIM, OXLC, PEG, PFS, PHVS, PIPR, PLPC, PNM, POR, PSX, PSXP, RCL, ROLL, RUTH, SHLX, SIFY, SJR, SLCA, SNP, TTE, TWIN, TZOO, UBOH, UBSI, URG, UUUU, WETF, WPC, WY, XOM, ZNH\n\n - Ex-div:\n\n  ALLY, AON, ATLO, AVAL, BCBP, BK, BMO, BMTC, BX, C, CAG, CASY, CE, CZNC, DGICA, DGICB, DMLP, ENLC, EVTC, EWBC, HAS, HEP, HFBL, HIFS, KMI, KOF, KRP, LCUT, LNT, NRG, NVEC, OKE, ORRF, PAYX, PBCT, PLBC, PNM, PPBI, RBB, RVI, SAN, SGU, SPFI, STL, SXT, SYF, TKC, TXN, VALU, VOC, WES\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.6K)\n    - CFTC Copper speculative net positions (previous: 40.6K)\n    - CFTC Corn speculative net positions (previous: 277.0K)\n    - CFTC Crude Oil speculative net positions (previous: 429.6K)\n    - CFTC Gold speculative net positions (previous: 193.3K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.1K)\n    - CFTC Natural Gas speculative net positions (previous: -131.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 67.6K)\n    - CFTC Silver speculative net positions (previous: 30.4K)\n    - CFTC Soybeans speculative net positions (previous: 43.5K)\n    - CFTC Wheat speculative net positions (previous: -8.6K)\n    - Chicago PMI (consensus: 63.5, previous: 64.7)\n    - Core PCE Price Index (consensus: 0.2%, previous: 0.3%)\n    - Core PCE Price Index (consensus: 3.7%, previous: 3.6%)\n    - Dallas Fed PCE (previous: 2.80%)\n    - Dallas Fed Services Revenues (previous: 14.0)\n    - Employment Benefits (previous: 0.40%)\n    - Employment Cost Index (consensus: 0.9%, previous: 0.7%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.80%)\n    - Michigan Consumer Expectations (previous: 67.2)\n    - Michigan Consumer Sentiment (consensus: 71.4, previous: 71.4)\n    - Michigan Current Conditions (previous: 77.9)\n    - Michigan Inflation Expectations (previous: 4.8%)\n    - PCE Price index (previous: 4.3)\n    - PCE price index (previous: 0.4%)\n    - Personal Income (consensus: -0.2%, previous: 0.2%)\n    - Personal Spending (consensus: 0.5%, previous: 0.8%)\n    - Real Personal Consumption (previous: 0.4%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.6%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 3.9%)\n    - Texas Services Sector Outlook (previous: 11.5)\n    - U.S. Baker Hughes Oil Rig Count (previous: 445)\n    - U.S. Baker Hughes Total Rig Count (previous: 543)\n\n^^^^2021-10-27",
        "created_utc": 1635328812,
        "id": "hi895vq",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1635357612.0
    },
    {
        "author": "rhythmdev",
        "body": "$20k High yield Gov Bonds\n\n$15k VTI\n\n$10k Cash\n\n$10k AAPL\n\n$10k Phys Gold\n\n$5k XOM\n\n$5k TXN\n\n$5k MMM\n\n$5k GSK\n\n$5k BATS\n\n$5k PEP\n\n$5k V",
        "created_utc": 1633322575,
        "id": "hfbedaq",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1633351375.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 25th of October\n\n\n\n## Upcoming events for Monday, October 25th\n\n - Stock splits:\n\n    - DPST @ **5:1** (Payable date: 10/22/2021)\n    - RETL @ **5:1** (Payable date: 10/22/2021)\n    - TECS @ **1:10**\n    - DRV @ **1:10**\n\n - Expected earnings:\n\n  ACC, AGNC, AIN, AJRD, AMG, AMKR, ARE, ARI, ARLP, AUB, AXTA, BDN, BMRC, BOH, BRO, BSRR, BXS, CAJ, CALX, CATY, CBNK, CBU, CCK, CDNS, CFBK, CIZN, CLDB, CPSS, CR, CWBC, DORM, DSS, EC, EFSC, FB, FBMS, FBNC, FBP, FEDU, FLXS, FSBC, FSBW, GABC, GAME, HBT, HMST, HNI, HOPE, HSII, HSTM, HTLF, IBTX, JBSS, KMB, KOF, KREF, LII, LKFN, LOGI, LSBK, LXFR, MEDP, MEDS, MNOV, MRBK, MSVB, NEU, NRIM, NWBI, OI, ONVO, OPOF, OTIS, PCH, PEBK, PETS, PKG, PRK, PWOD, QSR, RBB, RNR, SAN, SCCO, SITC, SLP, SMBC, SSD, SUI, TBI, TCBK, TGB, TIMB, TNET, TZOO, UFI, UHS, WASH\n\n - Ex-div:\n\n  APOG, CRS, CVLY, FAST, RY\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.055%)\n    - 6-Month Bill Auction (previous: 0.060%)\n    - Chicago Fed National Activity (previous: 0.29)\n    - Dallas Fed Mfg Business Index (previous: 4.6)\n    - Investing.com Gold Index (actual: 54.3%, previous: 58.4%)\n    - Investing.com S&amp;P 500 Index (actual: 47.2%, previous: 62.3%)\n\n## Upcoming events for Tuesday, October 26th\n\n - Expected earnings:\n\n  AAN, AAT, ABG, ACCO, ACH, ACU, ADM, AGR, AGYS, AHT, AKO.A, AKO.B, AKR, AMD, AMP, APAM, ARCC, ARCH, AUDC, AWI, AWRE, BEN, BGFV, BSBR, BUSE, BXP, BYD, CAC, CB, CCB, CCBG, CCNE, CEQP, CHRW, CIT, CLS, CMRE, CNC, COF, CSGP, CVLT, CZOO, CZWI, DALN, DAN, DHIL, DLR, EBMT, ECL, EDU, EGP, ENPH, ENTG, EQR, ESS, FBHS, FCBC, FCF, FCPT, FELE, FFIC, FFIV, FFNW, FFWM, FIBK, FRAF, FRBA, FRME, FSV, GBX, GE, GIC, GLW, GOOG, GOOGL, GPK, HA, HAFC, HAS, HBCP, HFBL, HIW, HNP, HONE, HOOD, HPP, HRZN, HSBC, HT, HUBB, HZO, IBCP, IEX, INMD, IVZ, JBLU, JNPR, KAI, LBAI, LBC, LBRT, LFUS, LLY, LMT, MANH, MASI, MKL, MMM, MMYT, MSCI, MSFT, MTDR, MYOV, NAVI, NBR, NBTB, NCR, NETI, NOV, NVS, OMAB, OVBC, OXSQ, PCAR, PCB, PEBO, PERI, PFG, PHM, PII, PJT, PNR, PROV, QS, QURE, RARE, RCKY, RNDB, ROIC, RRC, RRD, RTX, SBSI, SEB, SFBC, SFNC, SFST, SHW, SPFI, SPGI, SSTK, ST, TECK, TENB, TER, TPB, TRMK, TRTN, TRU, TTM, TWOU, TWTR, TXN, UBCP, UBS, UDR, UMBF, UPS, USNA, UTMD, V, VBTX, WIRE, WM, WNEB, WRLD, WSBC, WSR, XRX, ZWS\n\n - Ex-div:\n\n  AM, ATR, CLX, CMC, DNUT, ENTG, INFY, PSEC\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.310%)\n    - API Weekly Crude Oil Stock (previous: 3.294M)\n    - CB Consumer Confidence (consensus: 108.8, previous: 109.3)\n    - Dallas Fed Services Revenues (previous: 14.5)\n    - House Price Index (previous: 1.4%)\n    - House Price Index (previous: 19.2%)\n    - House Price Index (previous: 348.4)\n    - New Home Sales (consensus: 755K, previous: 740K)\n    - New Home Sales (previous: 1.5%)\n    - Redbook (previous: 15.4%)\n    - Richmond Manufacturing Index (previous: -3)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -3)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 1.5%, previous: 1.5%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 20.1%, previous: 19.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.4%, previous: 1.5%)\n    - Texas Services Sector Outlook (previous: 8.3)\n\n## Upcoming events for Wednesday, October 27th\n\n - Expected earnings:\n\n  ACBI, ACGL, ACNB, ADP, AEM, AEMD, AFL, AGI, AINC, AIT, ALG, ALGN, ALGT, ALKS, ALRS, ALSN, AM, AMSF, APH, AR, ARES, ASGN, ATNI, AVB, AVID, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BFIN, BG, BHE, BHR, BMRN, BMY, BOOT, BRKL, BSM, BSX, BWFG, BXMT, CACI, CAMT, CASH, CBD, CCS, CDE, CHDN, CHEF, CHX, CINF, CIVB, CLB, CME, CMPR, CNMD, CNO, COFS, CONE, CPF, CPSH, CRSP, CSTM, CSV, CTS, CTSH, CUBI, CX, CYBE, CYH, DB, DGICA, DGICB, DMRC, DRE, DRVN, DT, DTE, DX, E, EAT, EBAY, ECHO, EHC, ENSG, EQC, EQT, ESI, ESRT, ETD, EVR, EVTC, EW, EXR, F, FARO, FCNCA, FDBC, FDP, FISV, FIX, FLEX, FLOW, FLS, FMNB, FNWB, FORM, FRBK, FRTA, FWRD, GD, GGB, GHM, GLOP, GM, GORO, GRMN, GSHD, GSK, GTY, HAYW, HBNC, HEES, HES, HESM, HLT, HOG, HVT, HVT.A, HWKN, IBA, ILPT, INOV, INVA, INVH, IP, IRBT, IRT, ISBC, IVC, JAKK, JBT, JMP, JOE, KHC, KLAC, KN, KO, KRA, KRC, KRNY, LARK, LC, LEXX, LOB, MAA, MAS, MBIN, MC, MCD, MEOH, MHH, MHO, MKSI, MN, MNRO, MOH, MORN, MPX, MSA, MTH, MUSA, MYRG, NDLS, NFBK, NGVT, NLY, NMR, NOA, NOVA, NOW, NSC, NSR, NTB, NTGR, NYCB, OBNK, OC, ODFL, ODT, OII, ONCS, ORLY, ORN, PAG, PAYA, PB, PDM, PEGA, PGC, PGRE, PI, PINS, PLXS, PPC, PPD, PW, QCRH, R, RBBN, RDY, RE, RES, RIBT, RJF, ROCK, ROL, RVPH, RWT, SAVE, SC, SCI, SF, SIGI, SIM, SIMO, SIX, SLAB, SLGN, SMED, SMP, SNBR, SONY, SP, SPOK, SPOT, SREV, SRI, SSB, SSBI, STC, STCN, STLA, STXB, SU, SYBT, TDOC, TDY, TEL, TESS, TEVA, THFF, THG, TMHC, TMO, TNL, TROX, TTMI, TWLO, TYL, UCTT, UEC, UMC, UPWK, URI, USLM, UTHR, UVE, UVSP, VALE, VGZ, VICI, VIST, VKTX, VMAR, VNDA, VRT, VRTS, VSEC, WAB, WCN, WFG, WH, WHG, WOLF, XLNX, YNDX, YUMC, ZDGE, ZVO\n\n - Ex-div:\n\n  BPMP, COP, FRC, KNOP\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.990%)\n    - Core Durable Goods Orders (consensus: 0.4%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.715M)\n    - Crude Oil Inventories (consensus: 1.857M, previous: -0.431M)\n    - Cushing Crude Oil Inventories (previous: -2.320M)\n    - Distillate Fuel Production (previous: -0.289M)\n    - Durable Goods Orders (consensus: -1.0%, previous: 1.8%)\n    - Durables Excluding Defense (previous: 2.4%)\n    - EIA Refinery Crude Runs  (previous: -0.071M)\n    - EIA Weekly Distillates Stocks (consensus: -0.700M, previous: -3.913M)\n    - EIA Weekly Refinery Utilization Rates (previous: -2.0%)\n    - Gasoline Inventories (previous: -5.368M)\n    - Gasoline Production (previous: 0.455M)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 0.6%)\n    - Goods Trade Balance (previous: -88.16B)\n    - Heating Oil Stockpiles (previous: 0.037M)\n    - MBA 30-Year Mortgage Rate (previous: 3.23%)\n    - MBA Mortgage Applications (previous: -6.3%)\n    - MBA Purchase Index (previous: 266.2)\n    - Mortgage Market Index (previous: 643.0)\n    - Mortgage Refinance Index (previous: 2,807.9)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Wholesale Inventories (previous: 1.2%)\n\n## Upcoming events for Thursday, October 28th\n\n - Stock splits:\n\n    - SSBI @ **110:100** (Payable date: 11/04/2021)\n\n - Expected earnings:\n\n  AAPL, AB, ABCB, ABMD, ABTX, ACHC, ADS, AEP, AGCO, AGL, AIRC, AJG, ALDX, ALGM, ALIM, ALNY, AMAL, AMT, AMZN, AOS, AQMS, ARGX, ASPN, ASR, ATEN, ATI, ATOM, ATR, AUY, AVNT, AVT, AVTR, AX, BAX, BC, BIO, BIO.B, BPMC, BSIG, BSMX, BTU, BVN, BWMX, BY, CARR, CAT, CBRE, CBTX, CBZ, CDNA, CFFN, CFR, CG, CHE, CHKP, CLVT, CMCO, CMCSA, CMS, CNOB, CNSL, CNX, CODI, COHU, COLB, COLM, COOP, COR, CPG, CPT, CRS, CTO, CUZ, CVEO, CVLY, CWST, CWT, DAIO, DBD, DECK, DQ, DRQ, DVA, DVD, DXCM, EB, EBC, EGO, EIG, EME, EMN, ENVA, ERIE, EVBN, EVLO, EXP, EXPO, FBIZ, FCN, FE, FHI, FISI, FLWS, FMX, FRST, FTAI, FTDR, FTV, FVCB, GILD, GLPI, GNCA, GPI, GSIT, GTX, GVA, GWB, HBAN, HIG, HLI, HSY, HTBK, HTGC, HTH, HUBG, ICE, IDA, IMAX, INSM, INT, ITGR, ITW, JHG, KBR, KDP, KEX, KMPR, KNSL, KRG, LADR, LAWS, LECO, LH, LIN, LKQ, LMAT, LOPE, LPLA, LTC, LTH, MA, MAYS, MCBC, MCO, MD, MDC, MDP, MERC, MGRC, MHK, MIXT, MMSI, MO, MPW, MPWR, MRK, MSBI, MSTR, MTLS, MVIS, NATI, NEM, NKSH, NLSN, NOC, NTST, NVCR, NVT, NXGN, OCFC, OFC, OPBK, OPI, OPRA, ORC, ORI, OSIS, OSK, OSTK, PACK, PATK, PBF, PBFX, PEB, PFC, PFHD, POLY, POWI, PRFT, PRLB, PSB, PTCT, PTEN, PVBC, QUMU, RDS.A, RDS.B, RGEN, RLGY, RMD, RNGR, RNST, RS, RSG, SAH, SAIA, SBCF, SBFG, SBUX, SCM, SGEN, SHBI, SHEN, SHOP, SILC, SIRI, SJW, SKX, SKYW, SM, SMMF, SNDR, SNY, SPNE, SPSC, SSNC, STAG, STM, SVBI, SWI, SWK, SYK, TAL, TAP, TAP.A, TARO, TBBK, TEAM, TEX, TFII, TFX, THRM, TIGO, TOWN, TPX, TREE, TRS, TV, TVTX, TW, TXRH, TXT, ULBI, ULH, USAK, USCB, VC, VCRA, VLY, VRSN, WDC, WERN, WEX, WLTW, WNS, WRAP, WRE, WST, WTBA, X, XEL, YUM, ZEN\n\n - Ex-div:\n\n  AA, ACI, ADC, AGNC, AOS, ARC, BRMK, CARR, CFG, CIT, COST, CRT, CSWI, DCP, DNP, DSX, EARN, EFC, EPD, EPR, FERG, FT, GEL, GRP.U, HMLP, KFFB, LEVI, LND, MAIN, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PRT, PSXP, PVL, PZN, RBNC, SBNY, SCHL, SCM, SIG, SJT, SKT, STAG, TRGP, UNB, UNM, VRTS, WHF, ZTS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 7-Year Note Auction (previous: 1.332%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 2,445K, previous: 2,481K)\n    - Core PCE Prices (consensus: 4.50%, previous: 6.10%)\n    - GDP (consensus: 2.8%, previous: 6.7%)\n    - GDP Price Index (consensus: 5.4%, previous: 6.2%)\n    - GDP Sales (previous: 8.1%)\n    - Initial Jobless Claims (consensus: 292K, previous: 290K)\n    - Jobless Claims 4-Week Avg. (previous: 319.75K)\n    - KC Fed Composite Index (previous: 22)\n    - KC Fed Manufacturing Index (previous: 10)\n    - Natural Gas Storage (consensus: 90B, previous: 92B)\n    - PCE Prices (previous: 6.5%)\n    - Pending Home Sales (consensus: 0.5%, previous: 8.1%)\n    - Pending Home Sales Index (previous: 119.5)\n    - Real Consumer Spending (previous: 12.0%)\n\n^^^^2021-10-25",
        "created_utc": 1635156012,
        "id": "hhyvgab",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1635184812.0
    },
    {
        "author": "Jumpdeckchair",
        "body": "TXN is the GOAT of wasting time in school during the 2000s",
        "created_utc": 1635339667,
        "id": "hi8q5qx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635368467.0
    },
    {
        "author": "dahliatree",
        "body": "whattabout texas instruments?",
        "created_utc": 1634840568,
        "id": "hhirjgk",
        "score": 0,
        "subreddit": "stocks",
        "created": 1634869368.0
    },
    {
        "author": "thisistheperfectname",
        "body": "Please, no - I'm having a bad enough earnings season as it is between TXN and V.",
        "created_utc": 1635348238,
        "id": "hi99kne",
        "score": 0,
        "subreddit": "stocks",
        "created": 1635377038.0
    },
    {
        "author": "cmon_do_it",
        "body": "Here is Shiller's own Excess CAPE Yield metric which factors in interest rates:\n\n[https://en.macromicro.me/charts/27100/us-shiller-ecy](https://en.macromicro.me/spotlights/131/guan-jian-tu-biao-gu-jia-yi-jing-tai-gui-le-ma-le-ma-ren-shi-diao-zheng-hou-chao-e-ben-yi-bi-bao-chou-ECY)\n\nalso,\n\n[https://pse.is/3e9gf3](https://pse.is/3e9gf3)\n\nAccording to ECY, valuations are not as astronomical as they seem.",
        "created_utc": 1636132196,
        "id": "hjfryw4",
        "score": 132,
        "subreddit": "investing",
        "created": 1636160996.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "Paypal users 390 Million \n\nVisa Users 1280 Million\n\nMastercard users 840 Million",
        "created_utc": 1636704241,
        "id": "hkb5ysd",
        "score": 47,
        "subreddit": "stocks",
        "created": 1636733041.0
    },
    {
        "author": "wearahat03",
        "body": "&amp;#x200B;\n\n||PE RATIO|Recent REV GROWTH|\n|:-|:-|:-|\n|PYPL|44.7|13%|\n|AAPL|25.9|29%|\n|MSFT|39.1|22%|\n|GOOGL|28|41%|\n|FB|23.5|35%|\n|AMZN|80|15%|\n|V|34.9|29%|\n|MA|44|29%|\n\nPYPL is too expensive versus their growth rate. Their PE ratio is AFTER they've dropped.\n\nNot only are they more expensive than FAAMG but also more expensive than V and MA.\n\nOnly AMZN is more expensive and might correct in the future.",
        "created_utc": 1636821939,
        "id": "hkh1rf0",
        "score": 31,
        "subreddit": "stocks",
        "created": 1636850739.0
    },
    {
        "author": "TheDynamicKing",
        "body": "ain't nothing wrong with 50 years old living with ma and pa. this is the wall street way",
        "created_utc": 1636567568,
        "id": "hk3hamv",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1636596368.0
    },
    {
        "author": "Calm_Leek_1362",
        "body": "I've never heard of 'wumao'. I didn't think I was saying anything political... it's just how it is. The US Congress works for big money. CPC has complete control in China. Remember how some people thought Jack Ma was dead and nobody thought that sounded implausible? And not a single wall street banker that caused the 07 crash even had to pay a fine (in fact, they paid themselves bonuses with taxpayer money from bailouts), and nobody was surprised?\n\nI'm not judging either country, that's just the way it is.",
        "created_utc": 1636566641,
        "id": "hk3evsw",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1636595441.0
    },
    {
        "author": "EMTPirate",
        "body": "I checked your profile to see if you are another one of the Chinese profiles that keeps pushing junk investment, and I doubt a lawyer would need to buy a Turkish knockoff of a Glock, but I'll give you the benefit of the doubt that you are just a bad lawyer and can't afford anything better.\n\nI know a good deal about China, I know about the power struggle between Xi Jinping and the Jiang Zemin faction that is causing a lot of these crackdowns. I know the Army swears allegiance to the CCP instead of the nation. That the CCP rules as the please from Zhongnanhai without regard to laws.  They are content to practice hostage diplomacy like they did with the two Michael's to free Meng Wanzhou and they seem confused when western counties can't simply disregard the courts and do as they please like China. That the Belt and Road initiative is just neo colonialism to steal resources and strategic ports from poor nations. That the Uighurs face slave labor and genocide by controlling birth rates and harvesting organs like Falun Gong practitioners. \n\nChina is not a free, fair, or open market. Ask Jack Ma who got disappeared by them. Look at their national security laws, and how they annex neighborhoods and force their will on them. How they alter maps and globes to include the 9 dash line and pretend it is part of Chinese territory like the Scarborough shoal despite court rulings.\n\nSo tell me how elections matter when China can decide who is on the ballot to prevent a true opposition and use the national security law to disappear opposition?\n\nCall me a typical American, but my eyes are open to the actions of the CCP.",
        "created_utc": 1635853573,
        "id": "hj00l6f",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1635882373.0
    },
    {
        "author": "EtadanikM",
        "body": "You are all sorts of stupid if you think this wasn't caused by people like Jack Ma. It was precisely corporate greed that caused Chinese real estate companies to operate pyramid schemes where they would use the down payments from apartments that weren't even built to finish previous apartments that weren't even built. Ant Group would've made this infinitely worse with its \"wild west\" loan shark practices. Run away financialization IS the cause of over building.\n\nThis is a problem that Deng and his successors created. It isn't new.",
        "created_utc": 1636578439,
        "id": "hk49bcv",
        "score": 18,
        "subreddit": "stocks",
        "created": 1636607239.0
    },
    {
        "author": "Will_House",
        "body": "As a customer and holder of EQB, I'm very stoked for the Mastercard partnership",
        "created_utc": 1635896667,
        "id": "hj2vs48",
        "score": 15,
        "subreddit": "CanadianInvestor",
        "created": 1635925467.0
    },
    {
        "author": "moaiii",
        "body": "That doesn't work well with options most of the time due to gamma. You could have a fairly small pullback of the underlying down to a support line or MA which will knock 50% or more off the premium almost instantly. You close, because you couldn't get a fill at 20% down, but then the underlying confirms support and shoots right back up again past your entry point bringing those premiums straight back up with them. You just lost over 50% when the trade was always above support, still trending up, and doing just fine.\n\nTrade on the price action, not the P&amp;L, assume that the cost/margin to enter the trade is your \"at risk\" amount, and set your position size accordingly.",
        "created_utc": 1636242873,
        "id": "hjm3qei",
        "score": 14,
        "subreddit": "options",
        "created": 1636271673.0
    },
    {
        "author": "wsb202009",
        "body": "I keep adding PYPL daily dips, both shares and options. I hold V and MA Jan 22 options, buying IPAY ETF too.",
        "created_utc": 1635899035,
        "id": "hj31gmt",
        "score": 11,
        "subreddit": "stocks",
        "created": 1635927835.0
    },
    {
        "author": "Bacarchi",
        "body": "Wish is good company. Whenever I see their FB ads for male corzettes, various sex toys, fake night vission goggles, booletproof vests and shit like that it always makes me laugh.\n\nBut I ain't giving dime for that bag of shit. Jack Ma can eat them alive.",
        "created_utc": 1636585487,
        "id": "hk4qvcq",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1636614287.0
    },
    {
        "author": "CommunicationOld9321",
        "body": "I hate not having alot to invest.....but slowly I ma get there",
        "created_utc": 1636071979,
        "id": "hjcs8k6",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1636100779.0
    },
    {
        "author": "Litho360",
        "body": "I like T for sure. Surprised it hasn’t moved already, but the latest infrastructure bill passed has 65 billion dedicated to improve internet access. \n\nPayPal seems like it should have some nice movements seeing how Visa and Mastercard have been making some nice gains.",
        "created_utc": 1636380109,
        "id": "hjsyfdz",
        "score": 11,
        "subreddit": "stocks",
        "created": 1636408909.0
    },
    {
        "author": "LuxGang",
        "body": "Someone yesterday made a great post analysing the Fintech companies like V, MA, PYPL, SQ etc.\n\nThe point this user made boils down to:\n\nV, MA, SQ, PYPL etc still have inflated P/E ratios(30+), while companies like GOOG are trading below 30 P/E and growing faster. So why buy an overpriced Fintech when you can buy GOOG at a much better value?\n\nMakes sense to me. I was looking at buying one of the aforementioned stocks, but now I think I'll just stick to big tech, which to me looks like a much better long term buy. Thoughts?",
        "created_utc": 1635960635,
        "id": "hj69ojt",
        "score": 11,
        "subreddit": "stocks",
        "created": 1635989435.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "I don't agree.\n\nVisa can grow a lot in south east asia and Africa.\n\nIn Europe and the States, there are a lot of people that don't need/use Paypal and never will\n\nBut everybody has and will have sinxe they open a bank account debit and credit cards (V and MA)",
        "created_utc": 1636728508,
        "id": "hkc5y97",
        "score": 10,
        "subreddit": "stocks",
        "created": 1636757308.0
    },
    {
        "author": "SmallParade",
        "body": "&gt;43.5 payment transactions per active account on a trailing twelve months basis, growing 11%\n\nThat’s from PayPal’s last earnings report. People are using it 3.6 times a month on average. That’s about how often I use it. I don’t use cash much anymore either but I use it more than 3.6 times a month. And I use my debit MasterCard to pay from my bank account probably 60-100 times a month. You understand now why they wanted to buy Pinterest. Generally speaking, people aren’t going around flashing the PayPal app everyday to pay for things. They use it here and there.",
        "created_utc": 1635899940,
        "id": "hj33peq",
        "score": 10,
        "subreddit": "stocks",
        "created": 1635928740.0
    },
    {
        "author": "dzettel",
        "body": "For real. It’s a fair value now, about to pick up Visa and Mastercard at EOD",
        "created_utc": 1635881775,
        "id": "hj1twuu",
        "score": 10,
        "subreddit": "stocks",
        "created": 1635910575.0
    },
    {
        "author": "Testynut",
        "body": "I love MasterCard and Visa",
        "created_utc": 1636509139,
        "id": "hk0jxoo",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1636537939.0
    },
    {
        "author": "tothemoonandback01",
        "body": "&gt;86% of Chinese approve of their government compared to something like 30% in America.\n\nYes, if the Chinese don't approve they disappear to the re-education camp.  Ask Jack Ma if you don't believe me.",
        "created_utc": 1635856623,
        "id": "hj05qa7",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635885423.0
    },
    {
        "author": "VacationLover1",
        "body": "Can Jack Ma just come out of his forced rehabilitation and say ‘buy the baba dip bitches’ just so we can break into the $200’s.. I mean how much longer will it take to brainwash the guy, it’s been a year",
        "created_utc": 1636341115,
        "id": "hjre52r",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1636369915.0
    },
    {
        "author": "Tsukune_Surprise",
        "body": "I’ve said it before and I’ll say it again-\n\nGambling is why we are here. But when you gamble you know the odds and the rules of the game. (Mostly- I still don’t understand craps but I’ll lose money on it anyway)\n\nPoint is this- don’t fuck around with Chinese stocks.  They have no rules. The Chinese government is also instituting some new Jack Ma rules to keep companies from getting too strong. A Chinese company gets too big and the government will knock it down. \n\nDon’t fuck around with Chinese stocks.  (And you aren’t even really buying their stocks since foreigners can’t own Chinese stock directly). \n\nYou’re buying promise rings from virgins who haven’t figured out their sexuality while their ultra religious father tries to send them to straight camp.",
        "created_utc": 1635982342,
        "id": "hj7sm37",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1636011142.0
    },
    {
        "author": "discovery991",
        "body": "MA",
        "created_utc": 1636697398,
        "id": "hkawsdx",
        "score": 9,
        "subreddit": "stocks",
        "created": 1636726198.0
    },
    {
        "author": "james14cunningham",
        "body": "the corrections are done, this is ready to move up much higher, all aboard. imho\r  \nI ma sure there is going to be smashing news very soon,\r  \nstart of the phase 3\r  \ntoxicology report\r  \npartnership\r  \ncovid nasal spray progress  \n\n\n$ATOS along with JMP and $BTCS will give good green this month. DD",
        "created_utc": 1636367598,
        "id": "hjsewbl",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1636396398.0
    },
    {
        "author": "swingforthefence69",
        "body": "Is PYPL dragging down V and MA? Looking to add some more to my positions",
        "created_utc": 1636470038,
        "id": "hjxx6rr",
        "score": 8,
        "subreddit": "stocks",
        "created": 1636498838.0
    },
    {
        "author": "DDRaptors",
        "body": "Fuckin PayPal dragging down my V and MA.",
        "created_utc": 1636471906,
        "id": "hjy1kp1",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1636500706.0
    },
    {
        "author": "wsb202009",
        "body": "Big companies like PYPL, V and MA always meet the street expectations, but their forecast may differ depending on demand. \n\nWhen PYPL jumps, it goes like TSLA, no one can catch it !",
        "created_utc": 1635899175,
        "id": "hj31sz0",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635927975.0
    },
    {
        "author": "Successful_Okra6902",
        "body": "Price is below 200 MA, it's still going down.",
        "created_utc": 1636410526,
        "id": "hjv0jpq",
        "score": 7,
        "subreddit": "stocks",
        "created": 1636439326.0
    },
    {
        "author": "brooklynbest97",
        "body": "I need PYPL to jump the same way MA did after that drop two weeks ago",
        "created_utc": 1636729588,
        "id": "hkc8foc",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636758388.0
    },
    {
        "author": "Jayytimes2",
        "body": "&gt;(V, MA, PYPL, SQ, etc) are all dipping and being replaced with buys of cyber security etc. (Cloudflare, NET, DDOG, FASTLY, etc).\n\nWould you mind expanding on this?",
        "created_utc": 1636593664,
        "id": "hk59bku",
        "score": 7,
        "subreddit": "stocks",
        "created": 1636622464.0
    },
    {
        "author": "FEMA_Camp_Survivor",
        "body": "PayPal, Visa, MA, and others have been in the dumps lately. Godspeed homie.",
        "created_utc": 1636056486,
        "id": "hjbqoah",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636085286.0
    },
    {
        "author": "Queen__Elizabeth__2",
        "body": "Guys need some advice, I'm very interested in V, I believe is an awesome stock and is ready to go up but I have no ideia whats going on in that space. V, MA and PYPL have been dropping for a while... and I can't wrap my head around why. Can someone help?",
        "created_utc": 1636124479,
        "id": "hjf81tm",
        "score": 7,
        "subreddit": "stocks",
        "created": 1636153279.0
    },
    {
        "author": "Zackattackrat",
        "body": "Ma calls be a printin’ tmro",
        "created_utc": 1636589483,
        "id": "hk500i5",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636618283.0
    },
    {
        "author": "I_love_avocados1",
        "body": "It’s most payment processors, not just PayPal. Look what’s happening to old school competitors like $EEFT, $FIS, $FISV, $GPN, not to mention $MA, and $V.",
        "created_utc": 1635864325,
        "id": "hj0m8a9",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635893125.0
    },
    {
        "author": "Eslooie",
        "body": "Looks like no one is ever using electronic payments again. Totally makes sense V, MA, and Pypl have drilled.",
        "created_utc": 1635959531,
        "id": "hj66qrr",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635988331.0
    },
    {
        "author": "juaggo_",
        "body": "I think V. They are bigger and valuation more attractive. MA also has a lawsuit at the moment where they have their entire cash reserve worth of money on the line. I doubt they lose it all, just a thing to notice.",
        "created_utc": 1635975749,
        "id": "hj7czg2",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636004549.0
    },
    {
        "author": "FJBonks",
        "body": "Honest question here bc I was an investor in it but got out when Jack Ma faded out of the limelight.\n\nWhat are your reasons in putting money in a company that CCP likes to mess with?  Did you guys forget CCP cancelled the biggest IPO in the world for Ant group Nov 2020; And Alibaba just got fined $2.8 billion in April 2021.  Any success of Alibaba are being watched closely by the CCP.  \n\nI do hope this stock goes up for you if you’re still invested in it.",
        "created_utc": 1636570315,
        "id": "hk3oeg7",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636599115.0
    },
    {
        "author": "TheRandomnatrix",
        "body": "Me: \"Why can't you just have a green day?!\"\n\nVisa and MA: *screams*\n\nAt least DFS is carrying me today.",
        "created_utc": 1635952775,
        "id": "hj5oudc",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635981575.0
    },
    {
        "author": "The_Number_12",
        "body": "I got in at $187 last year, I think it's honestly going to keep sliding down for a while, it's likely gonna get to $160 maybe even $150\\~. T ROWE Price is one of the biggest holders and they've been shedding PYPL for a little while now, I think other large firms are doing the same en masse now. They were up over 100% if they bought a little over a year ago, time to sell it off hard. the P/E makes no sense compared to V amd MA which do the same service more or less (move money &amp; pay merchants).",
        "created_utc": 1636499404,
        "id": "hjzy4da",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636528204.0
    },
    {
        "author": "B1gChuckDaddySr",
        "body": "JACK MA",
        "created_utc": 1635951334,
        "id": "hj5l6pz",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635980134.0
    },
    {
        "author": "WasteNet2532",
        "body": "Baba was beat down bc Jack Ma made a mistake. And Xinnie the Pooh punished him greatly for it. So long as baba diversifies in areas where the government doesnt care so much ( which it seems to be doing)it is greatly undervalued, but in my situation, the risk *is* necessary. I lost 70% of my account. So im using the last few grand for a couple LEAPs. Lets just see how these earnings play out",
        "created_utc": 1636449169,
        "id": "hjx0eo7",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636477969.0
    },
    {
        "author": "WombatShwambat",
        "body": "When do you guys think Jack Ma will be done with his re-education?",
        "created_utc": 1636392801,
        "id": "hjtsi49",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636421601.0
    },
    {
        "author": "whatyoulookinatbud",
        "body": "MQ. I believe they can take on MasterCard and Visa. Or will get bought out.",
        "created_utc": 1635828550,
        "id": "hiz68o3",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635857350.0
    },
    {
        "author": "B1gChuckDaddySr",
        "body": "When is Jack Ma going to rescue BABA?",
        "created_utc": 1636601093,
        "id": "hk5pual",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636629893.0
    },
    {
        "author": "duskick",
        "body": "To me, SQ is an earlier version of PayPal.  They are in the process of creating their network.  The benefit they have in the long run in owning the hardware, software, and network, is that they can eliminate Visa and MasterCard from the equation.  If someone uses the Cash app to buy directly from a SQ terminal, the could reduce the charge from 2-3% (of which they get a small cut) to 0-5-1% (of which they get all).  SQ wins, merchant wins, but V and MC lose on such a transaction. PayPal is trying to build a similar network, but doesn’t have as much traction with in person terminals.",
        "created_utc": 1636724999,
        "id": "hkbyg2k",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636753799.0
    },
    {
        "author": "yaboiRich",
        "body": "Went to the bar last night and ran in to this girl I used to bang. She ignored me like she didn't who I was. Its alright bitch, I got your friends number and imma fuck her just to spite you. \n\nHave a safe weekend out there ma dudes",
        "created_utc": 1636782719,
        "id": "hkffflb",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636811519.0
    },
    {
        "author": "midnightscare",
        "body": "Brookfield bets on post-pandemic office demand with Alstria (German real estate company) €19.50/share in cash takeover offer \n\nhttps://www.reuters.com/article/alstria-office-ma-brookfield-asset-idUSL8N2RV4JP",
        "created_utc": 1636044593,
        "id": "hjawavk",
        "score": 5,
        "subreddit": "CanadianInvestor",
        "created": 1636073393.0
    },
    {
        "author": "Current-Promotion-31",
        "body": "Watertown MA offering $310 an hour for snow plow drivers.  Dat shit cray",
        "created_utc": 1636547171,
        "id": "hk265ub",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636575971.0
    },
    {
        "author": "Shandowarden",
        "body": "MQ and SOFI. Idk why this sub is so biased heavily onto old names when there are far better opportunities. Mastercard, Visa and Paypal already grew a shit ton during covid and their numbers were unjustified. SQ also blew up so much already and you can see it sitting stale st 230-270 levels forever. If you want to save money, sure buy those, but if you want more aggro future growth, go MQ and SoFi",
        "created_utc": 1635864854,
        "id": "hj0nhfx",
        "score": 4,
        "subreddit": "stocks",
        "created": 1635893654.0
    },
    {
        "author": "LazySoftwareEngineer",
        "body": "Buy almost any other payment processor, not PyPl. V, MA, SOFI, SQ, now UPST on the dip even. There will be a bounce, but I foresee a long sideways crawl for this.",
        "created_utc": 1636513592,
        "id": "hk0tukr",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1636542392.0
    },
    {
        "author": "epyonxero",
        "body": "Thats the dream but the banks and payment networks arent going to give up their cash cow without a fight. V and MA are already dipping their toes into crypto and blockchain payments. Banks tried and failed to kill crypto before and now theyre trying to co-opt it by making it so only banks can issue stable coins. \n\nIm bullish on Circle because they know this and have been very proactive in appeasing the regulators.",
        "created_utc": 1636683378,
        "id": "hka5jqg",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1636712178.0
    },
    {
        "author": "sf_warriors",
        "body": "Galileo is alone worth $20 billion imho. They are galloping at 100miles/hr with their expansion throughout the world, visa and mastercard have 10a of integrations in the news. It is regarded as one of the best and fastest growing payments processor. If Galileo to have a ipo today, they will easily raise $20 billion. Similar company called Marquetta(MQ) is valued $25 billion who went ipo this year",
        "created_utc": 1636694880,
        "id": "hkasr4p",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636723680.0
    },
    {
        "author": "polonaisefantaisie",
        "body": "Okay but Visa looks terribly oversold. It's way below the ath and lagging behind Mastercard.\n\nI think V leaps could be a nice play.",
        "created_utc": 1636828559,
        "id": "hkhhcpz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636857359.0
    },
    {
        "author": "Sell_Hour",
        "body": "They’re going into hiding like jack ma did",
        "created_utc": 1636046595,
        "id": "hjb1h21",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636075395.0
    },
    {
        "author": "Specialist_Coffee709",
        "body": "All in $INTC then since we all know they just need to do a better copycat of AMD shit. Alibaba did a good job……Pat needs to higher ma asap!",
        "created_utc": 1635864225,
        "id": "hj0lzpa",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635893025.0
    },
    {
        "author": "B1gChuckDaddySr",
        "body": "Jack Ma",
        "created_utc": 1636234787,
        "id": "hjllwq8",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636263587.0
    },
    {
        "author": "bidensaphag",
        "body": "MA!!! The Meatloaf!!",
        "created_utc": 1636307135,
        "id": "hjp67w6",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636335935.0
    },
    {
        "author": "atdharris",
        "body": "Venmo may be growing but apparently other parts of their business are not. PYPL is growing slower than V or MA yet trading at a premium to those two companies. That's likely why the stock is selling off.",
        "created_utc": 1636486120,
        "id": "hjz17za",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636514920.0
    },
    {
        "author": "Erion929",
        "body": "I understand, as a business….but they have some hard times coming in China.\n\nPolitically, BABA will continue to be depressed by the CCP….where’s Ma, anyway?",
        "created_utc": 1636564926,
        "id": "hk3afc0",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636593726.0
    },
    {
        "author": "Ok-Wasabi2873",
        "body": "I was arguing with my cousin, heavy value guy, about this. My argument against BABA is that Jack Ma has fallen out of favor with the CCP. And the CCP picks the winners. I don’t think they’re going to pick BABA.",
        "created_utc": 1636828645,
        "id": "hkhhjxz",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636857445.0
    },
    {
        "author": "Teekay53",
        "body": "Same. People are saying that the CCP is not going to kill their golden goose. However, I don't think that when the CCP looks at Alibaba they see a golden goose, but rather they see how capitalism can bring arrogance and power to someone who's supposed to listen to them, not question them (Jack Ma). It doesn't matter that Ma is out, my belief is that this is how they still see alibaba, as an entity that dared question their power.",
        "created_utc": 1636828862,
        "id": "hkhi1n2",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636857662.0
    },
    {
        "author": "CommunicationOld9321",
        "body": "Those new solar roof tiles look dope I ma invest in the companies",
        "created_utc": 1635827460,
        "id": "hiz4ktn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635856260.0
    },
    {
        "author": "daaabears1",
        "body": "I haven’t followed the company very closely but a short term headwind could be the reopening. It seems like PayPal is used mostly digitally. When i pay for stuff in person I use Visa or Mastercard (sometimes use a Square POS). I think there’s a big missed opportunity with a digital only (or mostly) platform. With that said, not an expert on the company so I could be wrong.",
        "created_utc": 1635816435,
        "id": "hiyiwwi",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635845235.0
    },
    {
        "author": "phohunna",
        "body": "I live in Canada and I recently visited friends in MA where weed was legalized in 2017. Many municipalities still ban the sale.\n\nIn Boston, they have like 2 recreational dispensaries for the entire city. We had to bike nearly a half hour from Cambridge, and there were several security guards for the sleepy store. You can't buy with a credit card because the lending banks want nothing to do with it.\n\nIn Canada by contrast, its much more like a small fancy liquor store. We have dispensaries every few blocks and zero security guards. You can go in and buy with your credit card.\n\nCompanies like TLRY wont take off until there is sufficient distribution and its easy to buy. That wont come until its nationally legalized. Its going to be a long time.",
        "created_utc": 1636037190,
        "id": "hjad7db",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636065990.0
    },
    {
        "author": "wsb202009",
        "body": "Ha ha ha ! That is for you to find out !! If the reason is genuine, PYPL stock down is justified. If not, you have chances to benefit !!!\n\nBTW: All payment sector is down with rotation, such as V, MA, PYPL..etc",
        "created_utc": 1636121692,
        "id": "hjf14bn",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636150492.0
    },
    {
        "author": "B1gChuckDaddySr",
        "body": "Jack Ma to the rescue",
        "created_utc": 1636336838,
        "id": "hjr58cn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636365638.0
    },
    {
        "author": "NaplesBrandon",
        "body": "You would be better served trading spreads on large, industry leading stocks like MA, SHOP, DG, AMZN etc. watching their 30-60 trading ranges and selling spreads far out of the money when they trade near the lower end of their range. OTM by 20% or more when possible or near 52 week low.",
        "created_utc": 1636728759,
        "id": "hkc6j0m",
        "score": 3,
        "subreddit": "options",
        "created": 1636757559.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/Telkorenar (2/0) made a bet that MA would go to 355.0 when it was 336.7 and it did, congrats autist.",
        "created_utc": 1636556226,
        "id": "hk2oiym",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636585026.0
    },
    {
        "author": "RingingInTheRain",
        "body": "I'm down at least 10k from my FB/Meta calls. I averaged down too. I feel you ma. I feel you..",
        "created_utc": 1636561944,
        "id": "hk32pd9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636590744.0
    },
    {
        "author": "MungerMentalModel",
        "body": "if you go to [tradingview.com](https://tradingview.com), go to the chart, click on \"indicators\" , then search for \"MA\".  add it to the chart and then you can change the settings for it to show 20 instead of the default which is 9.  The price action of a stock frequently interacts with the moving average, the moving average acts like a rubber band.  The farther the stock moves away from it, the stronger it wants to rebound back.",
        "created_utc": 1636512860,
        "id": "hk0s8o8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636541660.0
    },
    {
        "author": "The_Bill_Slayer",
        "body": "I love Canadian tire,  I really think they've been incredible lately.  Sears target closed, years later I'm checking out full toy isles in canadian tire lol loved it almost filled a void.   \nAlso love their website I swear it's better then walmarts website and costco I mean that says a lot imo!\n\nOnly reason I put it behind a railroad or a bank as my choice is because . . . .\n\nThe banks are expanding outside of Canada td bank northern USA, scotia bank south America.   I mean if your in a government corrupt country would you rather use Los Locale Banco  or Scotia bank to hold your tendies? \n\nRailroads are kind of limited to North America altho they can do buyouts for a bigger American presence I don't even think they have to worry too much there is 2 for canada they can share?!\n\nSeems more competition in stores?\n\nHow much more can they expand?  I love em use them all the time and have their Mastercard lol",
        "created_utc": 1636597871,
        "id": "hk5ishb",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1636626671.0
    },
    {
        "author": "iriechubs",
        "body": "I was day trading my mom txt me I’m like ma The meatloaf! Anyways by the time I got back from the txt like 1 min later I was down 2,500$. I was like note to self never answer txts while trading!",
        "created_utc": 1636812959,
        "id": "hkgioiw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636841759.0
    },
    {
        "author": "sreten-jr",
        "body": "Buy high, sell low ma brothas",
        "created_utc": 1635863552,
        "id": "hj0keez",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635892352.0
    },
    {
        "author": "wsb202009",
        "body": "Look of for IPAY, portfolio is V, MA, PYPL...etc all mobile payments.\n\nIf you look for stocks, my preference is for SID (3.95 now), but steel industry with good dividend 9% and low P/E. Results due by Nov 4th. I think it won't long last at this price.\n\nETF is SLX.\n\nPresently they are corrected high and will revive in future.\n\nStarting buying small qty, keep adding every dip.\n\nBTW: I own all of these, may be biased with my DD. You need to analyze before your decision.",
        "created_utc": 1635875661,
        "id": "hj1e57c",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635904461.0
    },
    {
        "author": "tracyXTMAC",
        "body": "lol okay. You will get there one day ma boi. And yeah dont ever bet against Elon. I did the same thing earlier this year and $8k evaporated in 3 days.",
        "created_utc": 1636175151,
        "id": "hjik6ve",
        "score": 3,
        "subreddit": "options",
        "created": 1636203951.0
    },
    {
        "author": "Particular-Cake-6430",
        "body": "Jack ma is rich as fuck though. That’s like a 5 point boost",
        "created_utc": 1636086011,
        "id": "hjdlf9q",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636114811.0
    },
    {
        "author": "BokitoIsMijnVriend",
        "body": "he was [overhere](https://nltrending.com/billionaire-and-alibaba-founder-jack-ma-brings-visit-to-the-netherlands/) last week",
        "created_utc": 1636392979,
        "id": "hjtsyeh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636421779.0
    },
    {
        "author": "bazookateeth",
        "body": "Also LLKKF for a lithium play. Has ties with Jeff Bezos, Bill Gates and Jack Ma.",
        "created_utc": 1636300841,
        "id": "hjoqcz6",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1636329641.0
    },
    {
        "author": "CHERCK_FLOKI",
        "body": "IRS be like.... Where's ma cut home.",
        "created_utc": 1636320868,
        "id": "hjq5b55",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636349668.0
    },
    {
        "author": "arbiter12",
        "body": "Ma dude... your innocence worries me so i will be harsh.\n\nDo you really think, if the recipe for making money was \"[just look for undervalued companies whereby their total share\\*value is lower than their Ebitda/cashvalue!](https://corporatefinanceinstitute.com/resources/knowledge/trading-investing/trading-below-cash/)\", professional trading houses would spend literal billions in research, algorithm and personnel?\n\n&amp;#x200B;\n\nWhat you should first learn about this industry, if you want to succeed in it is that if something is easy and/or predictable, then it doesn't work/won't happen. You may get lucky and expect the expected and it happens just as planned, but most often, the big players are contrarian to the market itself, meaning that if you think A is likely and a million people think A is likely, then B is almost guaranteed to happen (unless enough contrarians think B will happen, then probably C)\n\nTraders don't play the game fairly. They just harvest money from betting against the most number of people.",
        "created_utc": 1636552545,
        "id": "hk2gasj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636581345.0
    },
    {
        "author": "EyesEarsMouthNose",
        "body": "Just say EBITDA ma guy",
        "created_utc": 1636676194,
        "id": "hk9q7j4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636704994.0
    },
    {
        "author": "RumHam1",
        "body": "Valuing a stock is really difficult and it often boils down to a lot of different assumptions.  Even experts are routinely wrong, so keep that in mind.  What I do for one company normally takes 3-5 hours, and I try to do it quarterly for any company I own.\n\nI will usually start by collecting the company's past, current and future valuation metrics.  Things like price to sales, price to earnings, price to forward earnings, debt ratios, etc.  I compare the 5 year averages to what they currently are.  I also do for their competitors and companies in the same financial space (for example, I'd look at Visa, Mastercard, and other card companies together).  I look at past growth and projected growth to see if I think the valuations are justifiable where they currently are.\n\nI look through the financial statements and try to spot trends in cash flow, debt, margin, and many other things to see how the company is performing yoy and qoq.\n\nI look at how the company is engaging with the industry and where they are projecting their growth to come from.  Are the expanding market share, is the sector growing, etc.  I need the company to justify why it can achieve or surpass their growth estimates.\n\nI listen to their most recent conference calls and look though any articles I can find, but I heavily discount opinion pieces.  I actively seek out reasons why this company will fail.\n\nAfter all of this, I try to put together a balanced view of where the company is valued now vs historically and also vs their competition.  It requires a lot of projection and assumptions and I only do it for companies that I can understand their business model.  You have to go into the process without bias, and to be honest the majority of companies that I do this for aren't buys at the time.",
        "created_utc": 1636650548,
        "id": "hk81eep",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636679348.0
    },
    {
        "author": "sendokun",
        "body": "I would do 40% on V and PayPal, 20% on MA",
        "created_utc": 1636743617,
        "id": "hkd6o2e",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636772417.0
    },
    {
        "author": "rainbow0o",
        "body": "id rather invest in sofi, visa, mastercard, afrm, and square than paypal.",
        "created_utc": 1636818352,
        "id": "hkgtlx9",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636847152.0
    },
    {
        "author": "Im_Blind_And_Deaf",
        "body": "I wanna sheet on ma bed",
        "created_utc": 1635805147,
        "id": "hixtivs",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635833947.0
    },
    {
        "author": "mwing95",
        "body": "BKKT - Hugh volatility play but with their recent deal with Mastercard I'm liking their future. \n\nSLI - stable lithium company, decent volatility",
        "created_utc": 1635781568,
        "id": "hiw8lzl",
        "score": 3,
        "subreddit": "options",
        "created": 1635810368.0
    },
    {
        "author": "WSBrexiteer",
        "body": "Jack Ma new Chinese Premier after initiating a bloody coup with thousands of tanks bought over AliExpress",
        "created_utc": 1635800966,
        "id": "hixjlz7",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635829766.0
    },
    {
        "author": "WVEers89",
        "body": "Sold my $MA calls for a $400 loss yesterday morning.\nThey would have been worth $1900 at 2pm today.\nSick.",
        "created_utc": 1636145683,
        "id": "hjgrkv1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636174483.0
    },
    {
        "author": "Albedo100",
        "body": "&gt; Visa/Mastercard/Discover all charge the vendor a percentage of the transaction. This fee adds up. Blockchain can be substantially less.\n\nTraditional transaction fees *can* be less as well if they just chose to lower the fees. \n\nYou're missing the point that blockchains carry a premium cost to cover securing the network and it may never been competitive with closed systems. On blockchain *fees* are fundamental. In traditional systems, they aren't.",
        "created_utc": 1636313778,
        "id": "hjpna1h",
        "score": 3,
        "subreddit": "investing",
        "created": 1636342578.0
    },
    {
        "author": "Future_Expat_FIRE",
        "body": "Nice post and I like the set up rather than coming in hot.  Downside risk is limited to $200 IMO and they consistently meet or beat earnings because they are conservative by nature.  I’ve been waiting for this type of opportunity in a solid company for a long time.  Went with $300 Jan 24 leaps just in case I’m completely wrong about Monday, so I have time on my side :)  GLTA and hop on MA if your looking for a safer play that is already breaking out!",
        "created_utc": 1636198685,
        "id": "hjjexax",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636227485.0
    },
    {
        "author": "1200mademeaCommie",
        "body": "I’d go with the beat up Dow names and look for continuation. Axp. V. Ma. Cat. Ba. Dis.",
        "created_utc": 1636197552,
        "id": "hjjda9z",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636226352.0
    },
    {
        "author": "dontgetmadgetdata",
        "body": "I like it. The price is pretty elevated off it’s 50 day MA due to a nice post earnings drift. It has kissed its 50 day 5 times this year. To increase your probability of profit, I might wait until it consolidates/retraces to around this area and open up the position at that time. Possibly move the strike closer to that stock price to further increase the leverage. \n\nFor example, If it retraces to closer to $300 level and open contracts with $280-$300 strike. You would still need around $350 to break even if the cost is halved but you would have substantially more leverage per dollar.",
        "created_utc": 1636230931,
        "id": "hjldc8e",
        "score": 3,
        "subreddit": "options",
        "created": 1636259731.0
    },
    {
        "author": "migbyo",
        "body": "I think [this breakdown of M&amp;A in the biotech industry](https://www.evaluate.com/vantage/articles/data-insights/ma/following-ma-money-phase-and-therapy-area) is interesting.",
        "created_utc": 1636661759,
        "id": "hk8td8r",
        "score": 3,
        "subreddit": "shroomstocks",
        "created": 1636690559.0
    },
    {
        "author": "notreally49",
        "body": "agreed, baba price is 90% dependent on chinese gov easing the pressure and Jack Ma coming back, earnings alone wont take it above 180.",
        "created_utc": 1636757257,
        "id": "hke21z2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636786057.0
    },
    {
        "author": "PCB4lyfe",
        "body": ".75% ER seems high when their top holdings are SQ PYPL V and MA, I just bought those 4 companies and called it a day.",
        "created_utc": 1636820931,
        "id": "hkgzg3n",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636849731.0
    },
    {
        "author": "Mr-Acorns22",
        "body": "GIMME MA MONEY",
        "created_utc": 1635763211,
        "id": "hivbbig",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635792011.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "&gt; not afraid of risk\n\nThat's for sure.\n\nYou can't balance with solid long term plays. It isn't in your character. You'll buy whatever people tell you are long-term solid plays.\n\nLike I could tell you that MACAW is going to the moon, and you'd probably buy it. (I bought it. I'm bullish. Don't buy that, it's gambling, be a good boy.)\n\nSell your bags and buy VOO. If you own something shitty like BABA and it is up, sell that too. Where is the world is Jack Ma? Why would you still be holding that?",
        "created_utc": 1635818343,
        "id": "hiyn5j8",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1635847143.0
    },
    {
        "author": "Tendiemesilly",
        "body": "Imma keeep it lika island boy imma keep it like an island boy imma keep it like a guap ma man, ya ya ya",
        "created_utc": 1636044248,
        "id": "hjavepo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636073048.0
    },
    {
        "author": "Dmoan",
        "body": "It is still way below its highs and 200 day MA",
        "created_utc": 1635790047,
        "id": "hiwsrch",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635818847.0
    },
    {
        "author": "Beilsteiner",
        "body": "Also Jack Ma everything in Baba",
        "created_utc": 1635884708,
        "id": "hj21iye",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635913508.0
    },
    {
        "author": "polychris",
        "body": "[https://imgur.com/a/shou9yJ](https://imgur.com/a/shou9yJ) The MA(50) on the 5 min chart is the 250-min moving average.",
        "created_utc": 1636073524,
        "id": "hjcvsgc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636102324.0
    },
    {
        "author": "Slut_Spoiler",
        "body": "That is some oracle shit right there",
        "created_utc": 1635890205,
        "id": "hj2fxxm",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1635919005.0
    },
    {
        "author": "spacequarks",
        "body": "Cloudflare is the future of cloud computing. Period. We use their workers product (edge compute similar to AWS Lambda) and running their R2 beta. Cloudflare also manages the insane mess that is DNS since we offer our SaaS with custom domains. \n\nAWS/GCP/Azure are gonna look like Oracle, IBM and Sun Microsystems in the future.",
        "created_utc": 1635997833,
        "id": "hj8pwfe",
        "score": 10,
        "subreddit": "stocks",
        "created": 1636026633.0
    },
    {
        "author": "MartianSpaceCat",
        "body": "Don't worry about TSLA, guys.\n\nI predicted that TSLA would drop substantially today, which actually means that it will end the day up another five percent. Call me the negative oracle.",
        "created_utc": 1635864187,
        "id": "hj0lwgq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635892987.0
    },
    {
        "author": "kidicaru59",
        "body": "OMG he's an oracle",
        "created_utc": 1635871128,
        "id": "hj12qzw",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635899928.0
    },
    {
        "author": "planetofpower",
        "body": "Thier testing an AI program that predicts the future of your account. This is the foreshadowing, or beta oracle program.",
        "created_utc": 1635978005,
        "id": "hj7ikk4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636006805.0
    },
    {
        "author": "FrogsEverywhere",
        "body": "What's your play for today oh great oracle?",
        "created_utc": 1636015856,
        "id": "hj9demi",
        "score": 2,
        "subreddit": "smallstreetbets",
        "created": 1636044656.0
    },
    {
        "author": "Hornysnek69",
        "body": "Buying ORCL every dip is free money",
        "created_utc": 1635864186,
        "id": "hj0lwcw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635892986.0
    },
    {
        "author": "joncho23",
        "body": "One of my favorites directly from the oracle himself",
        "created_utc": 1635846568,
        "id": "hizrd80",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635875368.0
    },
    {
        "author": "SippieCup",
        "body": "&gt; Do you understand why they are forecasting a loss and increased expenses? \n\nI am talking about Revenue, not expenses.\n\n&gt;You idiots think too short term, you need to think long term and invest based on that. Thats why I am a multi millionaire with early bets on many of the strongest companies today.\n\nlol. You invested in Tesla, good job. So did the rest of us. You are still illiterate. \n\n&gt;Anyways go ahead and invest in AMD and forget Intel, we can only look back and see so who knows, maybe Intel just shrivels up and disintegrates and AMD becomes a trillion dollar company…\n\nHere's a secret. You can do both at the same time! Although at the moment I see no reason for purchasing additional Intel stock. Intel is the next IBM/Oracle, they won't go anywhere, but they really have limited growth in comparison to others in the market.",
        "created_utc": 1635779757,
        "id": "hiw4i5m",
        "score": 1,
        "subreddit": "investing",
        "created": 1635808557.0
    },
    {
        "author": "athetopofahill",
        "body": "No oracle but there are only probabilities.",
        "created_utc": 1635797399,
        "id": "hixarj2",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1635826199.0
    },
    {
        "author": "messengers1",
        "body": "You should continue to top up more Apple, Oracle, Societe Generale, Stellantis, iShare EV, Vanguard since they are doing well.  If you want something new, you should try Tesla, Nvidia or TSMC.",
        "created_utc": 1635944839,
        "id": "hj5628u",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1635973639.0
    },
    {
        "author": "Delicious_Reporter21",
        "body": "There is no oracle here )",
        "created_utc": 1635994937,
        "id": "hj8kfo3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636023737.0
    },
    {
        "author": "raw_testosterone",
        "body": "Cathie Wood is a fucking Oracle sex goddess and whatever she does I will support by purchasing more ARK.",
        "created_utc": 1636039452,
        "id": "hjaix91",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636068252.0
    },
    {
        "author": "Hornysnek69",
        "body": "Zim 55c 11/19 or ORCL calls in the morning if it dipa",
        "created_utc": 1635873260,
        "id": "hj183cj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635902060.0
    },
    {
        "author": "Unique_Advantage_323",
        "body": "You’re whole thread was/is attacking people. Saying you’ll get it sooner or later is implying you’ll understand the consequences of your decisions. It wasn’t an overt attack, chief, but yes the sarcasm was explicit. My opinion wasn’t based on some Econ 101 but years, as a decision maker, in a multinational organization and friends who were from India and China who had worked for Deloitte, PWC, Google,  Sysco, Oracle, the DoD etc but you’ve made it clear, no one else knows anything but you.",
        "created_utc": 1635869426,
        "id": "hj0yijz",
        "score": 0,
        "subreddit": "stocks",
        "created": 1635898226.0
    }
]