[
    {
        "author": "bajsranden10",
        "body": "IF HE IS STILL HOLDING I MA STILL HOLDING. Also, please have my wifes kids",
        "created_utc": 1612300328,
        "id": "gls5vz4",
        "permalink": "/r/wallstreetbets/comments/lb6jld/gme_yolo_update_feb_2_2021/gls5vz4/",
        "score": 1638,
        "subreddit": "wallstreetbets",
        "created": 1612329128.0
    },
    {
        "author": "anoleo201194",
        "body": "MA I'M ON TV",
        "created_utc": 1614288421,
        "id": "gor7o3n",
        "permalink": "/r/wallstreetbets/comments/lsgqig/i_dont_need_fox_business_to_hold_me_accountable/gor7o3n/",
        "score": 1312,
        "subreddit": "wallstreetbets",
        "created": 1614317221.0
    },
    {
        "author": "futurespacecadet",
        "body": "“Come with meeee, and you’ll reeeee at a market of-ma-ni-pu-la-tionnn”",
        "created_utc": 1612306203,
        "id": "glskeds",
        "permalink": "/r/wallstreetbets/comments/lb5yl0/come_with_me_and_youll_be_in_a_world_of_pure/glskeds/",
        "score": 1131,
        "subreddit": "wallstreetbets",
        "created": 1612335003.0
    },
    {
        "author": "Shit_Pant",
        "body": ".ylgnidrocca stide dda dna etadpu lliw I ,noitamrofni gnitroppus evah uoy dna etaruccani si noitamrofni gnihtyna fI\n\n&amp;#x200B;\n\n.SPAEL 3202 evah dna 02&lt;$ ecnis ni neeB :erusolcsiD\n\n&amp;#x200B;\n\n  🦍 🚀  =  🙌 💎 RD:LT\n\n&amp;#x200B;\n\n.gnidloh m'I dna gnigrevnoc era srotcaf 01 eseht taht eveileb I\n\n&amp;#x200B;\n\n.ETULOSER YATS DNA DEDNAH REPAP EB TNOD .EMIT SEKAT TI SNAEM LLITS TAHT TUB TNEVLOS NIAMER NAC YEHT NAHT DEDRATER NIAMER NAC EW ,RAW A SI SIHT .GNIDLOH M'I TUB TEGRAT A EVAH SYAWLA .YWEHC ETACILPER LLIW EMG EVEILEB I YLLATNEMADNUF .NEHOC NAYR DNA KCOTS EHT EKIL I .SNOITIDNOC EHT SETACILPER ESLE GNIHTON .EMG ENO YLNO SI EREHT ,YLLANIF )J\n\n&amp;#x200B;\n\nnoitaNretteBa/u/ aiv /lanimret\\_grebmoolb\\_morf\\_egami\\_lluf\\_eht\\_sereh/mzdaal/stnemmoc/stebteertsllaw/r/moc.tidder.www//:sptth\n\n&amp;#x200B;\n\n.derevoc ton evah strohs OMI .0202 ,9 .beF si etad eht yas ot tnaw I .syad wef gnimoc eht ni tseretni trohs eht fo etadpu reraelc a eb lliw ereht revewoH .IS %021 revo gniwohs llits lanimret grebmoolB )I\n\n&amp;#x200B;\n\n.erusserp gniyub detagilbo fo tnuoma eguh a si sihT .worromot yb tnemllifluf eriuqer lliw serahs esehT .mti dehsinif )523-511 ekirts( sllac 0202 ,92 yraunaJ fo tnuoma egral A )H\n\n&amp;#x200B;\n\ndaeLfostoLstI/u/ gnp.16evcvpjmpauw/ti.dder.i//:sptth\n\n&amp;#x200B;\n\n5drolyps/u/ gpj.16ew25hv594jf/ti.dder.i//:sptth\n\n&amp;#x200B;\n\n4321voig/u/ gpj.16ewhxyq4fyqh/ti.dder.i//:sptth\n\n&amp;#x200B;\n\n.tcerrocni ylsuoigerge thgir nwod saw aidem s'yadoT .gnirevoc era strohs eht taht keew tsal gniyas esruoc fo yllanif dna )etisoppo etelpmoc eht swohs rekcart tnemitnes skcotsyggaws eht( htob ro, potSemaG fo tuo elihw revlis no ni si tidder taht yltnagorra gnitats ,)elpmaxe rtcefrep( revlis gnillihs era yehT .ti tup remarC sa \"mals dnarg\" eht tih t'nod ew erusne ot ,skcits tahw ees ot llaw eht ta DUF eht lla worht ot segoots rieht gnitteg dna deracs era serianoillib ehT .gnilaever ylesnemmi si aidem hguorht noitamrofnisid fo pu-pmar tnatalb dna evissergga ehT )G\n\n&amp;#x200B;\n\n.nopaew yradnegel ruoy gnitteg erofeb noissim detag-emit a siht redisnoc ,GNORTS DLOH sremag era eW .eugitaf/noitirtta dna noitamrofnisid ,ytilitalov hguorht uoy tiab ot gniyrt era yeht ,GNORTS DLOH .daeha skeew/syad eht ni sessol rehtruf gnikat eb osla lliw erom erus m'I .yadot tuoliab a deriuqer dna ytidiuqil tuoba ylcilbup deil OEC HR ,tuo deliab eb ot dedeen nivleM .EMG$ fo siseht eht tuoba snoitcivnoc ruoy nehtgnerts dluohs derrucni sessol ehT )F\n\n&amp;#x200B;\n\nlmth.kcotSgnitiefretnuoC/0.2SC/moc.kcotsgnitiefretnuoc//:ptth :gnidaer rehtruf\n\n&amp;#x200B;\n\nsreggadynnhoj/u/ /eht\\_fo\\_deifirret\\_si\\_teerts\\_llaw\\_nosaer\\_laer\\_eht/dky79l/stnemmoc/stebteertsllaw/r/moc.tidder.www//:sptth\n\n&amp;#x200B;\n\n.sessol cihportsatac tneverp sa llew sa siht fo skcart rieht revoc ot gniyrt eb dluoc yehT .gnineppah si siht si desirprus eb t'ndluow I dna noitautis euqinu a t'nsi siht ,serahs tiefretnuoc gnidart neeb evah strohs eht taht noitalucepS )E\n\n&amp;#x200B;\n\n1/otohp/0335595499507726531/sutats/1latipaCRRahplA/moc.rettiwt//:sptth\n\n&amp;#x200B;\n\n.elas trohs rof worrob ot serahs evah regnol on srekorB )D\n\n&amp;#x200B;\n\numleh/u/ /emulov\\_gnikcuf\\_eht\\_ta\\_kool\\_tsuj\\_dna\\_cinap\\_tnod/rpu5al/stnemmoc/stebteertsllaw/r/moc.tidder.www//:sptth\n\n&amp;#x200B;\n\n.derevoc tsuj yeht fi oga gnol dedne fo dluoc sihT .kcatta detartsehcro na si sihT .emit yreve derevocer ev'eW .roivaheb tnegilgen rieht rof eoj egareva eht kcuf ot gniyrt s'FH/s'MM fo noisrevrep eht yalpsid lluf no was eW .nac yeht sa hcum sa revoc ot redro ni sdnah repap dna sessol pots ecrof ot yadyreve skcatta reddaL trohS nees ev'ew neht ecniS )C\n\n&amp;#x200B;\n\naidemninrub/u/ aiv /ta\\_kool\\_ekil\\_skool\\_enil\\_eht\\_gnidloh\\_tahw\\_si\\_siht/9q0aal/stnemmoc/stebteertsllaw/r/moc.tidder.www//:sptth\n\n&amp;#x200B;\n\ntnemitnes-rekcit/stebteertsllaw/draobhsad/moc.skcotsyggaws//:sptth :tnemitneS\n\n&amp;#x200B;\n\n.sessol evissam rucni did dna dluow yeht taht llet suoivbo nA .mutnemom drawpu morf gnipeeketag dna serahs esahcrup ot ytiliba srotsevni liater no kcatta suoivbo na saw keew tsaL .desserppus gnieb saw/si gnidart ,gninoom ecirp dna hgih emit lla sti ta si EMG$ rof tnemitnes eht nehw taht latnedicnioc ton s'tI .emulov wol yllamronba dah evah syad gnidart 3 tsal ehT )B\n\n&amp;#x200B;\n\nlatipac\\_ydnet/u/ aiv /os\\_elttes\\_ot\\_serahs\\_evah\\_tnod\\_yeht\\_tuo\\_atad\\_ces/kg6cal/stnemmoc/stebteertsllaw/r/moc.tidder.www//:sptth\n\n&amp;#x200B;\n\nseiksetep/u/ aiv /eht\\_fo\\_ecirp\\_eht\\_tuoba\\_ton\\_sti\\_slevel\\_eseht\\_ta/3xo8al/stnemmoc/stebteertsllaw/r/moc.tidder.www//:sptth\n\n&amp;#x200B;\n\n?serahs eht era erehW .seunitnoc serahs fo )reviled ot eruliaF( DTF fo kaerts ehT .syad 53 revo rof tsiL seitiruceS dlohserhT ESYN eht no neeb sah EMG )A\n\n&amp;#x200B;\n\n.rosivda laicnanif a ton ma I ,ecivda laicnanif ton si sihT .esoht htiw tohs a ti evig nac uoy elihw elttil txen eht ni daer ot nrael uoy fi taht os gnihtyreve decruos I ,)srood kcil I uoy kcuf ,ton ro( neppah lliw ezeeuqs eht kniht I yhw snosaer fo tsil kciuq a rehtegot tup ot dediced I dna gnol ot raf bsw gnidaer neeb sah niarb yeknom yM\n\n&amp;#x200B;\n\n.syawyna daer tub  🦍 🚀 =  🙌 💎 RD:LT",
        "created_utc": 1612218326,
        "id": "glnpv8y",
        "permalink": "/r/wallstreetbets/comments/ladv7v/gme_will_squeeze_and_heres_the_10_reasons_why_i/glnpv8y/",
        "score": 1087,
        "subreddit": "wallstreetbets",
        "created": 1612247126.0
    },
    {
        "author": "Harambe_Like_Baby",
        "body": "Hey at least jack ma is okay",
        "created_utc": 1613095700,
        "id": "gn0gsg5",
        "permalink": "/r/wallstreetbets/comments/li128e/went_balls_deep_on_tlryapha_fds_yesterday_not_my/gn0gsg5/",
        "score": 470,
        "subreddit": "wallstreetbets",
        "created": 1613124500.0
    },
    {
        "author": "69PutsOnYourPuts69",
        "body": "Call her G-Ma cuz she's a fucking G",
        "created_utc": 1612272645,
        "id": "glq70t5",
        "permalink": "/r/wallstreetbets/comments/lavgj3/my_102_year_old_grandmother_bought_gme_in_august/glq70t5/",
        "score": 319,
        "subreddit": "wallstreetbets",
        "created": 1612301445.0
    },
    {
        "author": "gcrewss",
        "body": "As someone who resides in MA , I can tell you it wasn’t surprising his rep did that, most of the politicians don’t care much for the common people especially that guy.",
        "created_utc": 1613686318,
        "id": "gnxsiy9",
        "permalink": "/r/wallstreetbets/comments/lmyan9/dfvs_smile_hes_watching_all_us_apes_support_him/gnxsiy9/",
        "score": 178,
        "subreddit": "wallstreetbets",
        "created": 1613715118.0
    },
    {
        "author": "MikeOx_Girthy",
        "body": "You ma ma ma make my eyes rain",
        "created_utc": 1614289847,
        "id": "gorb1d5",
        "permalink": "/r/wallstreetbets/comments/lsgv43/tried_to_quickly_buy_50k_worth_of_gme_before/gorb1d5/",
        "score": 135,
        "subreddit": "wallstreetbets",
        "created": 1614318647.0
    },
    {
        "author": "IdiidDuItt",
        "body": "Ma' boi /u/THICC_LADIES_PM_ME  's tendies gonna be nicely cooked every day now!",
        "created_utc": 1612222118,
        "id": "glnyt4y",
        "permalink": "/r/wallstreetbets/comments/laef86/look_ma_im_famous_wsj_called_me_out_for_no_reason/glnyt4y/",
        "score": 95,
        "subreddit": "wallstreetbets",
        "created": 1612250918.0
    },
    {
        "author": "DowninDowntown",
        "body": "and we found Jack Ma!",
        "created_utc": 1613103661,
        "id": "gn0vj5s",
        "permalink": "/r/wallstreetbets/comments/li128e/went_balls_deep_on_tlryapha_fds_yesterday_not_my/gn0vj5s/",
        "score": 84,
        "subreddit": "wallstreetbets",
        "created": 1613132461.0
    },
    {
        "author": "Silver_Antelope3786",
        "body": "Where did you get that shirt ma man?",
        "created_utc": 1614302564,
        "id": "gos1qxu",
        "permalink": "/r/wallstreetbets/comments/lsm8qv/we_like_the_stock/gos1qxu/",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1614331364.0
    },
    {
        "author": "Hazed33",
        "body": "He is also the godamned congressman from DFV state of MA. He even had the balls to say, I should let Mr Gill speak, but proceeded to ramble on for almost 3 of his 5 minutes and DFV spoke for a total of 10 seconds maybe. Thank goodness these politicians represent us....",
        "created_utc": 1613697724,
        "id": "gnyfr0d",
        "permalink": "/r/wallstreetbets/comments/lmyan9/dfvs_smile_hes_watching_all_us_apes_support_him/gnyfr0d/",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1613726524.0
    },
    {
        "author": "godnightx_x",
        "body": "Current meme game is weak AF. Bring back jack ma on a radiator!!",
        "created_utc": 1612232675,
        "id": "glol7xv",
        "permalink": "/r/wallstreetbets/comments/lal1g7/courtesy_of_uterribletraderig_this_is_the_caliber/glol7xv/",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1612261475.0
    },
    {
        "author": "FormalWath",
        "body": "It's interesting how a lot of people are claiming they used their cards for one or two things only... Yet they are being hit by these fraud charges. Just a quick note, it's common for card thefs to first \"test\" card with small payment to check if it gets blocked.\n\nNow if one of big boys (visa, mastercard) got hacked that would destroy confidence in all internet/card payments... Also EU has very strict guidlines saying any breach  has to be reported to authorities ASAP and fines are huge fines. And let's be clear about that for a second, EU can fine visa and mastercard.",
        "created_utc": 1614110309,
        "id": "gohzjeb",
        "permalink": "/r/wallstreetbets/comments/lqqp0u/crowd_sourcing_dd_there_is_a_massive_payment_card/gohzjeb/",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1614139109.0
    },
    {
        "author": "FinntheHue",
        "body": "My guess on what the goal of this is\n\nkeep laddering us down until we end the day below the 50 MA and the 100 MA. Pitch the narrative that people are moving from GME to silver. Use the manipulated graph as justification for saying that. Use their newfound gains from silver to keep shorting GME. \n\nKeep an eye on volume and you can see this isn't a mass sell off by any means so that's all bullshit.",
        "created_utc": 1612202085,
        "id": "glmk5rs",
        "permalink": "/r/wallstreetbets/comments/la5s8i/gme_discussion_thread_for_february_01_2021_part_2/glmk5rs/",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1612230885.0
    },
    {
        "author": "anyfactor",
        "body": "See ma, I made it into the big leagues",
        "created_utc": 1613242971,
        "id": "gn9n946",
        "permalink": "/r/wallstreetbets/comments/lj2iei/not_every_play_is_a_short_squeeze_play/gn9n946/",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1613271771.0
    },
    {
        "author": "zorkini",
        "body": "Peut-être que rendu à 10 000euro l'action de gme ma femme me laissera dormir au pied du lit ou elle et son copain dorme",
        "created_utc": 1612193459,
        "id": "gllxiwo",
        "permalink": "/r/wallstreetbets/comments/la1chy/went_all_in_this_morning_support_from_france/gllxiwo/",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1612222259.0
    },
    {
        "author": "sdasda7777",
        "body": "I cannot agree with those. Simply check the fundamentals and you'll see the best ones are:\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613762144,
        "id": "go1drfw",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1drfw/",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1613790944.0
    },
    {
        "author": "0LowLight0",
        "body": "3@90\n\nTop of the water tower, ma!",
        "created_utc": 1614209680,
        "id": "gon51cb",
        "permalink": "/r/wallstreetbets/comments/lro20f/i_love_you_wsb_its_fucking_lambo_time_tomorrow/gon51cb/",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1614238480.0
    },
    {
        "author": "NPRjunkieDC",
        "body": "This applies to small and mid cap companies:\n\nhttps://ragingbull.com/kb/how-to-make-money-with-penny-stocks/\n\nOtcmarkets.com you can see pennystocks that are being sold ,  up to date news by ticker + screener. Some stocks have warnings. \n\nUnbiastock.com shows you stocks that are trading last hour or 6-12-24.\n\nFinviz.com is a stock screener with many filters but only non-OTC .\n\nMy stock portfolio is a free app to monitor your portfolio .\n\nTD Ameritrade lets you buy almost any stock.  RH and Webull don't allow OTC and most pennystocks are OTC. Fidelity also good but occasionally don't offer a stock. \n\nI trade 4-5 stocks daily but that is cuz I'm on my phone most of the day monitoring my 64 stock portfolio and seeing what others recommend or what is selling .\n\nThe general advice for pennystocks is to trade not invest . Occasionally you find a winner that you keep and might add to. You make more money with several 20% short trades that add up over time vs chasing winners and losing money in the process. \n\nWe all make the mistake of getting in late, or selling too early . \n\nI don't do what some do like deeply research a company Sec filings , balance sheet etc. \n\nI go to Yahoo Finance and click view all. Check 50/200 MA + Float that the smaller the better and prefer under 100M. Billions of shares in a pennystock is a warning sign. Ideally the numbers at the bottom like earnings growth,  operating income,  EBITDA should be positive but rarely the case with pennystocks or companies that are growing. \n\nBefore a purchase I check Yahoo Finance conversations. You can see how much interest by number of new conversations.  Also good info from posters that know about the company.  Volume too is important.  Should be much higher than usual.\n\nI also go to Stocktwits for the same .\n\nSomeone pointed out that companies that price rises 100% in last year or months will probably keep going . This is very true in pennystocks. \n\nBut these sites + Reddit are full of pumpers and dumpers.  So read through the lines.\n\nFinally when a stock seems a winner by the point it crosses 100% for you many recoup investment.  I wait until 220-240% so I only have to sell 30% of stocks not 50%. This threshold usually happens in one day. A stock goes up gradually for days or weeks then suddenly flies.",
        "created_utc": 1613058413,
        "id": "gmy5sht",
        "permalink": "/r/stocks/comments/lhn99g/how_do_people_find_stocks_before_they_explode/gmy5sht/",
        "score": 40,
        "subreddit": "stocks",
        "created": 1613087213.0
    },
    {
        "author": "heyaheyyarequiem",
        "body": "What are you talking about?   \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS\n\nAre clearly better picks",
        "created_utc": 1613763200,
        "id": "go1g59q",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1g59q/",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1613792000.0
    },
    {
        "author": "donnatellame",
        "body": "Rep. Madeleine Dean (PA-4) pointing out that Robinhood did not notify their clients until two says after they took action, Vlad Tenev looks very uncomfortable at this point, she wants to know what mistakes were made but he is not giving her an answer. \n\nRep. Alexandria Ocasio-Cortez (NY-14) points out Robinhood's margins were lowest up into December 2020, that Robinhood bragged about it; asking if they failed to properly manage their own books/margins. \n\nRep. Jake Auchincloss (MA-4) highlighting that Robinhood, again, is similar to gambling and its addictive nature. Vlad Tenev decided to, for some reason, drag China in. Jake is back on the edu route for users/Americans at large. Said Robinhood violated a law in Massachusetts--which law?\n\nRep. Jesus Garcia (IL-4) points out that Citadel is an important player in the market at large and that \"you are not one of our regular witnesses in this committee\". lulz. \"Retail investors are not a match for deep pocket investors\"; Citadel/Griffin is avoiding the question on how they faired during pandemic--finally answered that they were successful last year.",
        "created_utc": 1613688790,
        "id": "gnxxw5u",
        "permalink": "/r/wallstreetbets/comments/lm7n51/congressional_hearings_dfv_gme_etc_megathread/gnxxw5u/",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1613717590.0
    },
    {
        "author": "Jacob1235_S",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nEdit: i am not a financial professional...i don't lose enough money to be considered one yet",
        "created_utc": 1613761256,
        "id": "go1br9s",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1br9s/",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1613790056.0
    },
    {
        "author": "amrogers3",
        "body": "&gt;MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613763162,
        "id": "go1g26p",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1g26p/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1613791962.0
    },
    {
        "author": "PM_ME_YOUR_UVULA_PLS",
        "body": "MA GAWD THEY HAD INVESTORS",
        "created_utc": 1614260620,
        "id": "gopckpv",
        "permalink": "/r/wallstreetbets/comments/ls40os/here_comes_the_money/gopckpv/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1614289420.0
    },
    {
        "author": "SmudgedReddit0r",
        "body": "Where ma bb boys at? 😃🚀🚀🚀🚀",
        "created_utc": 1612200845,
        "id": "glmgwkf",
        "permalink": "/r/wallstreetbets/comments/la1om4/bb_when_the_market_opens/glmgwkf/",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1612229645.0
    },
    {
        "author": "WittsandGrit",
        "body": "Imagine Jack Ma drawing charts in the dirt at camp right now explaining how he beat earnings to his Uyghur gang.",
        "created_utc": 1612238731,
        "id": "gloxdmz",
        "permalink": "/r/wallstreetbets/comments/la0nb6/unpinned_daily_discussion_thread_for_february_01/gloxdmz/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1612267531.0
    },
    {
        "author": "Warrior_Asbel",
        "body": "Said this in the other one before it got taken down.\n\nI’ve been in for quite a while so I am relatively safe at my price point entry, however I do want to say that it’s fair for you to think it’s a scam. There is a lot of sus about the company but I also think there’s a good amount going for it.\n\n1. I have emailed them before, and they have responded. That at least tells me that there is someone actively working on this, regardless if it’s a scam. \n\n2. The website is updating daily to reflect the new preorders being submitted, this page in particular: https://aabbgoldtoken.com/aabb-gold-token/ \n\n3. There is a third party website, as it’s not affiliated with them, confirming that they in fact exist and have made a transaction before in gold mines. This is the website: http://mnamexico.com/en/ma-january-2021-2/ It was to Qiangda, who they supposedly work with. Regardless of that, the transaction being made does in fact show that they owned some form of a gold mine in the Guerrero Gold Belt. \n\n4. The token is in the etherium website. Not too familiar with it, nor do I know if I got the name right, but it shows source codes for various cryptos, and AABBG is on there. \n\n5. This company also has SEC filings for financials and whatnot. They’ve been doing this for years so it’s definitely some form of a company to even have financials in the first place.\n\nThat’s it for now pretty much. I’m gonna keep holding as any claim of scam would get shut down if the app releases, since they kept their word on that. If the app is good and they actually fulfill the orders remains to be seen, but I’m gonna keep watch on that. Again, you’re perfectly fine to think it’s a sketch company. It 100% is. But I’m gonna keep riding this out. They’ve been doing PR every Tuesday so if anything, we can keep checking those to see if something is off or not",
        "created_utc": 1614192416,
        "id": "gom38jd",
        "permalink": "/r/pennystocks/comments/lrk4w6/aabb_is_a_scam_my_deep_dive_and_evidence_part_1/gom38jd/",
        "score": 32,
        "subreddit": "pennystocks",
        "created": 1614221216.0
    },
    {
        "author": "iesou",
        "body": "I am long and shorting these.\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613760402,
        "id": "go19t6s",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go19t6s/",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1613789202.0
    },
    {
        "author": "Any_Situation_3005",
        "body": "I disagree with you. My picks are\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS\n\nThis isn't financial advice",
        "created_utc": 1613758641,
        "id": "go15tji",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go15tji/",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1613787441.0
    },
    {
        "author": "dole-whip",
        "body": "It's MA, everyone is at dunks",
        "created_utc": 1614380817,
        "id": "gowlqd2",
        "permalink": "/r/wallstreetbets/comments/lt7v4w/gme_yolo_monthend_update_feb_2021/gowlqd2/",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614409617.0
    },
    {
        "author": "NPRjunkieDC",
        "body": "https://ragingbull.com/kb/how-to-make-money-with-penny-stocks/\n\nOtcmarkets.com you can see pennystocks that are being sold ,  up to date news by ticker + screener. Some stocks have warnings. \n\nUnbiastock.com shows you stocks that are trading last hour or 6-12-24.\n\nFinviz.com is a stock screener with many filters but only non-OTC .\n\nMy stock portfolio is a free app to monitor your portfolio .\n\nTD Ameritrade lets you buy almost any stock.  RH and Webull don't allow OTC and most pennystocks are OTC. Fidelity also good but occasionally don't offer a stock. \n\nI trade 4-5 stocks daily but that is cuz I'm on my phone most of the day monitoring my 64 stock portfolio and seeing what others recommend or what is selling .\n\nThe general advice for pennystocks is to trade not invest . Occasionally you find a winner that you keep and might add to. You make more money with several 20% short trades that add up over time vs chasing winners and losing money in the process. \n\nWe all make the mistake of getting in late, or selling too early . \n\nI don't do what some do like deeply research a company Sec filings , balance sheet etc. \n\nI go to Yahoo Finance and click view all. Check 50/200 MA + Float that the smaller the better and prefer under 100M. Billions of shares in a pennystock is a warning sign. Ideally the numbers at the bottom like earnings growth,  operating income,  EBITDA should be positive but rarely the case with pennystocks or companies that are growing. \n\nBefore a purchase I check Yahoo Finance conversations. You can see how much interest by number of new conversations.  Also good info from posters that know about the company.  Volume too is important.  Should be much higher than usual.\n\nI also go to Stocktwits for the same .\n\nSomeone pointed out that companies that price rises 100% in last year or months will probably keep going . This is very true in pennystocks. \n\nBut these sites + Reddit are full of pumpers and dumpers.  So read through the lines.\n\nFinally when a stock seems a winner by the point it crosses 100% for you many recoup investment.  I wait until 220-240% so I only have to sell 30% of stocks not 50%. This threshold usually happens in one day. A stock goes up gradually for days or weeks then suddenly flies.",
        "created_utc": 1612985929,
        "id": "gmup2t3",
        "permalink": "/r/pennystocks/comments/lh0qrg/so_if_you_are_making_money_with_penny_stocks_how/gmup2t3/",
        "score": 29,
        "subreddit": "pennystocks",
        "created": 1613014729.0
    },
    {
        "author": "chrispunk28",
        "body": "Dropped 1k on AMC HOLDING MA GME AND MA DICK!!!",
        "created_utc": 1612188306,
        "id": "gllkoxs",
        "permalink": "/r/wallstreetbets/comments/la0n4z/daily_discussion_thread_for_february_01_2021/gllkoxs/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1612217106.0
    },
    {
        "author": "postbroadcast",
        "body": "buying tech to track this 🚀 🚀 🚀 MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, GME, GME, GME, GME, GME, GME, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, AMC, GME, CDW, CE, CNC, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, CNP, CTL, CERN, CF, SCHW, CHTR, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, GME, GME, GME, GME, GME, GME, GME, GME, GME, GME, GME, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, BBW, GME, GME, GME, GME, GME, GME, GME, GME, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, GME, GME, GME, GME, GME, GME, GME, GME, GME, GME, GME, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, GME, GME, GME, GME, GME, GME, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613760794,
        "id": "go1apel",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1apel/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1613789594.0
    },
    {
        "author": "lame_irl",
        "body": "MA GET OVA HERE! THIS GUY STILL BELIEVES IN MODERN PORTFOLIO THEORY 🤣😂🤣😂\n\nI bet you think the earth is square too",
        "created_utc": 1614124401,
        "id": "goivl8h",
        "permalink": "/r/wallstreetbets/comments/lqsgtf/live_feed_of_my_portfolio_today/goivl8h/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614153201.0
    },
    {
        "author": "ThisIsMyMemesAccount",
        "body": "Jack ma cock n balls",
        "created_utc": 1613102895,
        "id": "gn0u73p",
        "permalink": "/r/wallstreetbets/comments/li128e/went_balls_deep_on_tlryapha_fds_yesterday_not_my/gn0u73p/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1613131695.0
    },
    {
        "author": "Snoo_66633",
        "body": "AMC ma bois, AMC.",
        "created_utc": 1612174588,
        "id": "gll11go",
        "permalink": "/r/wallstreetbets/comments/l9wner/what_are_your_moves_today_february_01_2021/gll11go/",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1612203388.0
    },
    {
        "author": "Bluengold1988",
        "body": "If the CCP stranded Jack Ma on a roof, would you help Jack off?",
        "created_utc": 1612355207,
        "id": "gluqwed",
        "permalink": "/r/wallstreetbets/comments/lbl65s/unpinned_daily_discussion_thread_for_february_03/gluqwed/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1612384007.0
    },
    {
        "author": "Moooooonsuun",
        "body": "I'M LIVIN' IN THAT 21ST TENDERY \n  \n\nDOING SOMETHING MEAN TO IT\n  \n\nDOING BETTER THAN THE HEDGIES ANYBODY EVER SEEN DO IT \n  \n\nSCREAMS FROM THE SHORTIES, GOT A NICE RING TO IT \n  \n\nI GUESS EVERY AUTIST AND RETARD NEED HIS THEME MUSIC\n  \n... \n\nNO ONE HEDGE SHOULD HAVE ALL THAT POWER\n  \n\nTHE STOCK'S TICKING I JUST COUNT THE HOURS\n  \n\nKEEP HOLDING, TO THE PLAYERS GO THE POWER\n  \n\n*21ST CENTURY DIAMOND HANDS*\n  \n... \n\n  \nTHE SYSTEM BROKEN, THE HEDGE IS DEAD, THE SQUEEZE IS OPEN\n  \n\nWE AIN'T GOT TENDIES TO LOSE, MA' FUCKA WE HOLDIN'\n  \n\nHUH? MA' FUCKA WE HOLDIN'\n  \n\nWITH SOME MOONING STONKS, AND SOME OPTIONS CLOSIN'\n  \n\nIN THIS 🌈🐻 WORLD, WE THE 🐮 CHOSEN\n  \n\nSO GOODNIGHT WSB, I SEE YOU IN THE MORNIN'\n  \n\nHUH? I'LL SEE YOU IN THE MORNIN'\n  \n\nTHIS MOONING WAY TOO MUCH, I NEED A MOMENT",
        "created_utc": 1612211456,
        "id": "gln8jc9",
        "permalink": "/r/wallstreetbets/comments/lab86a/gme_discussion_thread_for_february_1_2021_part_3/gln8jc9/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1612240256.0
    },
    {
        "author": "Hunt69Mike",
        "body": "Got damn g ma.",
        "created_utc": 1613273711,
        "id": "gncf6k9",
        "permalink": "/r/StockMarket/comments/ljc5c1/i_might_be_a_little_jealous/gncf6k9/",
        "score": 25,
        "subreddit": "StockMarket",
        "created": 1613302511.0
    },
    {
        "author": "Primepolitical",
        "body": "&gt;Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nI am sorry, but are you long or shorting these?",
        "created_utc": 1613759293,
        "id": "go17ai1",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go17ai1/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1613788093.0
    },
    {
        "author": "Moooooonsuun",
        "body": "I'M LIVIN' IN THAT 21ST TENDERY \n  \n\nDOING SOMETHING MEAN TO IT\n  \n\nDOING BETTER THAN THE HEDGIES ANYBODY EVER SEEN DO IT \n  \n\nSCREAMS FROM THE SHORTIES, GOT A NICE RING TO IT \n  \n\nI GUESS EVERY AUTIST AND RETARD NEED HIS THEME MUSIC\n  \n... \n\nNO ONE HEDGE SHOULD HAVE ALL THAT POWER\n  \n\nTHE STOCK'S TICKING I JUST COUNT THE HOURS\n  \n\nKEEP HOLDING, TO THE PLAYERS GO THE POWER\n  \n\n*21ST CENTURY DIAMOND HANDS*\n  \n... \n\n  \nTHE SYSTEM BROKEN, THE HEDGE IS DEAD, THE SQUEEZE IS OPEN\n  \n\nWE AIN'T GOT TENDIES TO LOSE, MA' FUCKA WE HOLDIN'\n  \n\nHUH? MA' FUCKA WE HOLDIN'\n  \n\nWITH SOME MOONING STONKS, AND SOME OPTIONS CLOSIN'\n  \n\nIN THIS 🌈🐻 WORLD, WE THE 🐮 CHOSEN\n  \n\nSO GOODNIGHT WSB, I SEE YOU IN THE MORNIN'\n  \n\nHUH? I'LL SEE YOU IN THE MORNIN'\n  \n\nTHIS MOONING WAY TOO MUCH, I NEED A MOMENT",
        "created_utc": 1612210043,
        "id": "gln4w2x",
        "permalink": "/r/wallstreetbets/comments/lab86a/gme_discussion_thread_for_february_1_2021_part_3/gln4w2x/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1612238843.0
    },
    {
        "author": "TheRandomnatrix",
        "body": "I don't have any recommendations for reading but:\n\n* Look for tickers either trading sideways or preferably trading sideways at a slight upward angle. Preferably good companies you wouldn't mind long holding. FANG, MA, SJM, and HD are good examples and ones I usually use, but this changes all the time. If you see a bunch of red and start panicking, you already fucked up because you bought companies you didn't believe in long term. This whole red week crap everyone was screaming about because all the overpriced speculative stuff dropped a bunch? Yeah I'm only down like 2% and doing just fine because I bought good companies on the dip before that even happened, so they didn't really dip much after I bought them and even if they did I know they'll be back. And if they don't jump back, odds are everyone is hurting a lot worse which means more buying opportunities.\n\n* Learn about support and resistances, where stocks stop falling and start going back up, and where runups start ending.\n\n* Learn about moving averages and using multiple moving averages over different time periods to determine if something is roughly under or overvalued. Don't rely too much on them but they help.\n\n* Have entry and exits points in mind before you buy and before you sell. This goes for both profit taking and loss realizing. Set stop losses if you don't think you can handle being rational in a market dip, and limit orders to prevent being greedy. There will always be more swings. It's not worth blowing up your account because you got stupid and wanted just a little more or don't have the stomach to eat a loss beyond your risk tolerance. Before you buy imagine the company dropping 10% from where you bought it. Would you be alright eating that loss, or be confident enough in the company to hold? Would you be alright if it shot up 20% past where you took profits? Those are both very real scenarios.\n\n* Don't get greedy. You're not trying to double your money. You're trying to get in a few easy percentage points then get out in a reasonable time. Set reasonable profit margins. There's absolutely nothing wrong with walking away with like 3% in 2-3 weeks, in fact something like that is incredibly good, especially if you can do it reliably. Do that four times in a year on some safe companies and you've already beaten SPY for crying out loud.\n\n* Traders don't speculate, that's what investing is for. If you're hitting ATH as a trader, you're doing it wrong in my book. Your goal isn't to sail uncharted waters it's to get really good sailing the existing ones. If you find yourself trying to hold into new highs, you screwed up. You're not sticking to your plan you set out. There's nothing *wrong* with investing, but it's not trading.\n\n* Don't micromanage it. Sometimes this stuff takes weeks to play out and sometimes you'll be sitting in the red. Resist the urge to day trade your position unless you have a good reason to do so. Have your plan and stick to it.\n\n* Always have the next few potential trades lined up at any given time. I'm always on the lookout for new deals, even in the middle of a trade. That doesn't mean screw your current trade over because of impulse, it means you're ready to move on to the next opportunity within a couple days of the current one finishing. And sometimes there's just not really anything good going on and you should never try to force a trade that you're not fully comfortable with just to have something going on.",
        "created_utc": 1614382463,
        "id": "gowqtyv",
        "permalink": "/r/stocks/comments/lszqy7/dont_give_up_before_you_get_good/gowqtyv/",
        "score": 24,
        "subreddit": "stocks",
        "created": 1614411263.0
    },
    {
        "author": "skeetz456",
        "body": "MA START THE MEATLOAF! ITS HAPPENING AGAIN🚀",
        "created_utc": 1614017669,
        "id": "god6lo2",
        "permalink": "/r/wallstreetbets/comments/lpl1je/gme_megathread_for_monday_february_22nd_2021/god6lo2/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1614046469.0
    },
    {
        "author": "duffelbagD",
        "body": "Bought more today to average down.. probably retarded but I ma never said I was smart.",
        "created_utc": 1614062370,
        "id": "gofo59g",
        "permalink": "/r/wallstreetbets/comments/lpl1je/gme_megathread_for_monday_february_22nd_2021/gofo59g/",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1614091170.0
    },
    {
        "author": "iamagro",
        "body": "Ma dio porco",
        "created_utc": 1612193180,
        "id": "gllwpb0",
        "permalink": "/r/wallstreetbets/comments/la5k6p/etoro_is_automatically_closing_positions_stop/gllwpb0/",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1612221980.0
    },
    {
        "author": "Voodoomomajujuu",
        "body": "Vti, QQQ, Disney, Microsoft, Jnj, Nike, jpm, pg, pep, brk, v/ma, wm, Amazon, google, to name a few",
        "created_utc": 1614307775,
        "id": "gosbykf",
        "permalink": "/r/stocks/comments/lsn4e7/best_etfs_and_longterm_stocks_20_years/gosbykf/",
        "score": 23,
        "subreddit": "stocks",
        "created": 1614336575.0
    },
    {
        "author": "TurnedUpTurtle",
        "body": "GME to the moon ma dude",
        "created_utc": 1612834721,
        "id": "gmne7ap",
        "permalink": "/r/wallstreetbets/comments/lf9rdy/gme_megathread_for_mon_28/gmne7ap/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1612863521.0
    },
    {
        "author": "HolderofFour",
        "body": "Can’t say much on MA, since I haven’t done DD on them but as a V shareholder I know that they neither earn revenue from nor bear risk tied to the interest or fees paid by cardholders. Instead, Visa derives revenue from client services, data processing, cross-border transactions, and licensing fees.",
        "created_utc": 1614209889,
        "id": "gon5hhu",
        "permalink": "/r/investing/comments/lrpi4v/visa_and_mastercard_are_getting_ready_to_raise/gon5hhu/",
        "score": 22,
        "subreddit": "investing",
        "created": 1614238689.0
    },
    {
        "author": "Fatih256",
        "body": "Come on ma boi AMC rise up to 30$ today 🚀🚀🚀🚀🚀",
        "created_utc": 1612196561,
        "id": "glm5x6n",
        "permalink": "/r/wallstreetbets/comments/la0n4z/daily_discussion_thread_for_february_01_2021/glm5x6n/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1612225361.0
    },
    {
        "author": "Quality_Cucumber",
        "body": "“Look ma, I bought at the top!”",
        "created_utc": 1613603211,
        "id": "gntl5im",
        "permalink": "/r/wallstreetbets/comments/lm7bt5/230k_riot_yolo_im_going_to_the_fucking_moon/gntl5im/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1613632011.0
    },
    {
        "author": "Slyric_",
        "body": "Wow you’re looking at those? I’m looking at them too! Here’s my portfolio: \n\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\nEdit: i am not a financial expert I’m just a retard sitting at computer",
        "created_utc": 1613760284,
        "id": "go19jmb",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go19jmb/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1613789084.0
    },
    {
        "author": "Schneebley",
        "body": "Kind of annoyed at some of the Reps like Jake Auchincloss (MA-4) who seemed to push more toward wanting more legislation limiting retail investors access to the market. He seemed to have a very rudimentary understanding of options, and grilled Robinhood on why they seem to allow more people access to options on their platform.\n\nNow I understand and even meme that Robinhood is too lax with who they give options to, but it's more that I'd rather Robinhood just put flashy warning signs for the massive idiots that need their hand held rather than start restricting everyone to trading in the market.",
        "created_utc": 1613698945,
        "id": "gnyi4dl",
        "permalink": "/r/wallstreetbets/comments/lmvqyw/gamestop_congressional_hearings_part_2/gnyi4dl/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1613727745.0
    },
    {
        "author": "Mfibbs69",
        "body": "Had a nice peak up GME’s skirt today! What a tease! Mom told me to never wear sweatpants when she staarts to move like that. Mom told me Im special and not to stare, or cause a scene,but I can’t help it! She’s such a hot piece a stonk! My Ma always told that I’m retaarded and I shouldn’t have these feelings but when that skirt rises just a little, I staart to feel funny down dthere. I keep sayin,”I wanna see mour he he! I hope it’s windy tomaarrow and that skirt flies right up to her boobies! Oh no, but whaat if she thinks I’m a retaaded pervuert? Oh fuck it, I am!",
        "created_utc": 1614037053,
        "id": "goednsj",
        "permalink": "/r/wallstreetbets/comments/lpl1je/gme_megathread_for_monday_february_22nd_2021/goednsj/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1614065853.0
    },
    {
        "author": "HolderofFour",
        "body": "After watching Jack Ma talk to Elon, I can see why Harvard rejected him 10 times. Lmao",
        "created_utc": 1613089049,
        "id": "gn042ed",
        "permalink": "/r/wallstreetbets/comments/lhumfo/what_are_your_moves_tomorrow_february_12_2021/gn042ed/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1613117849.0
    },
    {
        "author": "gcoop20",
        "body": "You ma ma ma, ma ma ma make me tendies",
        "created_utc": 1612212894,
        "id": "glncbod",
        "permalink": "/r/wallstreetbets/comments/ladt4u/they_are_underestimating_retard_strength/glncbod/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1612241694.0
    },
    {
        "author": "Spartacus19845",
        "body": "AMC 5 day MA is crossing 10 day MA!  BULLISH TO $40!",
        "created_utc": 1614023367,
        "id": "godjkyv",
        "permalink": "/r/wallstreetbets/comments/lplby9/daily_discussion_thread_for_february_22_2021/godjkyv/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1614052167.0
    },
    {
        "author": "xKhaos420",
        "body": "Visa and Mastercard calls are the play, these retards won't be able to afford groceries this month",
        "created_utc": 1612298816,
        "id": "gls2394",
        "permalink": "/r/wallstreetbets/comments/lat47o/unpinned_daily_discussion_thread_for_february_02/gls2394/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1612327616.0
    },
    {
        "author": "Migb1793",
        "body": "Haha... I’m one with the autist and the autistics are with me 😎🦍💎🙌🏻💎\n\nStill holding Ma brothas\n\nRemember, together we are retarded",
        "created_utc": 1612829501,
        "id": "gmn45r0",
        "permalink": "/r/wallstreetbets/comments/lf9rdy/gme_megathread_for_mon_28/gmn45r0/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1612858301.0
    },
    {
        "author": "Moooooonsuun",
        "body": "I'M LIVIN' IN THAT 21ST TENDERY \n  \n\nDOING SOMETHING MEAN TO IT\n  \n\nDOING BETTER THAN THE HEDGIES ANYBODY EVER SEEN DO IT \n  \n\nSCREAMS FROM THE SHORTIES, GOT A NICE RING TO IT \n  \n\nI GUESS EVERY AUTIST AND RETARD NEED HIS THEME MUSIC\n  \n... \n\nNO ONE HEDGE SHOULD HAVE ALL THAT POWER\n  \n\nTHE STOCK'S TICKING I JUST COUNT THE HOURS\n  \n\nKEEP HOLDING, TO THE PLAYERS GO THE POWER\n  \n\n*21ST CENTURY DIAMOND HANDS*\n  \n... \n\n  \nTHE SYSTEM BROKEN, THE HEDGE IS DEAD, THE SQUEEZE IS OPEN\n  \n\nWE AIN'T GOT TENDIES TO LOSE, MA' FUCKA WE HOLDIN'\n  \n\nHUH? MA' FUCKA WE HOLDIN'\n  \n\nWITH SOME MOONING STONKS, AND SOME OPTIONS CLOSIN'\n  \n\nIN THIS 🌈🐻 WORLD, WE THE 🐮 CHOSEN\n  \n\nSO GOODNIGHT WSB, I SEE YOU IN THE MORNIN'\n  \n\nHUH? I'LL SEE YOU IN THE MORNIN'\n  \n\nTHIS MOONING WAY TOO MUCH, I NEED A MOMENT",
        "created_utc": 1612212779,
        "id": "glnc09n",
        "permalink": "/r/wallstreetbets/comments/lab86a/gme_discussion_thread_for_february_1_2021_part_3/glnc09n/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1612241579.0
    },
    {
        "author": "Mammoth_Call_214",
        "body": "Aaaand were down 2.3%. Have 270 Leaps and shares. Bought that dip, looking for the rally to continue. All we need is another MA sighting and some decent news on Ant and this shit will take off.",
        "created_utc": 1612289590,
        "id": "glrem4b",
        "permalink": "/r/wallstreetbets/comments/lb26o9/baba_earnings_222021/glrem4b/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1612318390.0
    },
    {
        "author": "an_aoudad",
        "body": "Dude for real. The MA hate here is odd. It's not the best but MA has a little of everything for everyone, and if they don't, someone in New England does.",
        "created_utc": 1613693539,
        "id": "gny7k1z",
        "permalink": "/r/wallstreetbets/comments/lmyan9/dfvs_smile_hes_watching_all_us_apes_support_him/gny7k1z/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1613722339.0
    },
    {
        "author": "Moooooonsuun",
        "body": "I'M LIVIN' IN THAT 21ST TENDERY \n  \n\nDOING SOMETHING MEAN TO IT\n  \n\nDOING BETTER THAN THE HEDGIES ANYBODY EVER SEEN DO IT \n  \n\nSCREAMS FROM THE SHORTIES, GOT A NICE RING TO IT \n  \n\nI GUESS EVERY AUTIST AND RETARD NEED HIS THEME MUSIC\n  \n... \n\nNO ONE HEDGE SHOULD HAVE ALL THAT POWER\n  \n\nTHE STOCK'S TICKING I JUST COUNT THE HOURS\n  \n\nKEEP HOLDING, TO THE PLAYERS GO THE POWER\n  \n\n*21ST CENTURY DIAMOND HANDS*\n  \n... \n\n  \nTHE SYSTEM BROKEN, THE HEDGE IS DEAD, THE SQUEEZE IS OPEN\n  \n\nWE AIN'T GOT TENDIES TO LOSE, MA' FUCKA WE HOLDIN'\n  \n\nHUH? MA' FUCKA WE HOLDIN'\n  \n\nWITH SOME MOONING STONKS, AND SOME OPTIONS CLOSIN'\n  \n\nIN THIS 🌈🐻 WORLD, WE THE 🐮 CHOSEN\n  \n\nSO GOODNIGHT WSB, I SEE YOU IN THE MORNIN'\n  \n\nHUH? I'LL SEE YOU IN THE MORNIN'\n  \n\nTHIS MOONING WAY TOO MUCH, I NEED A MOMENT",
        "created_utc": 1612211946,
        "id": "gln9sse",
        "permalink": "/r/wallstreetbets/comments/lab86a/gme_discussion_thread_for_february_1_2021_part_3/gln9sse/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1612240746.0
    },
    {
        "author": "PouyanMomento",
        "body": "I bought GME at 91... ma buddies sayin I'm a fool cause it's already high... help me prove them wrong",
        "created_utc": 1614207234,
        "id": "gomztos",
        "permalink": "/r/wallstreetbets/comments/lrne7f/what_are_your_moves_tomorrow_february_25_2021/gomztos/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1614236034.0
    },
    {
        "author": "giantwashcapsfan8",
        "body": "Market corrections are consistently ended by SPY breaching the 50 MA, save for the COVID crash which is obviously a unique scenario. All 8 corrections in the past 2 year immediately recovered after breaching that point, being immediately followed by a week where we rip near 10%. [See this years graph for autist proof.](https://i.imgur.com/dPplIT0.png). The longest SPY has remained under the 50MA was 3 days. We’re 1% away, at $279.50. Might not be tomorrow but we’re about to find our bottom and SPY $400 end of next week.",
        "created_utc": 1614319922,
        "id": "gosw2tb",
        "permalink": "/r/wallstreetbets/comments/lsgrk1/what_are_your_moves_tomorrow_february_26_2021/gosw2tb/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1614348722.0
    },
    {
        "author": "smrxxx",
        "body": "So, Stephen Lynch, D-MA, who said that he'd give DFV time to respond, after spending minutes asking his question, cut DFV off so he could ask a different question of someone else.",
        "created_utc": 1613684966,
        "id": "gnxpdbx",
        "permalink": "/r/wallstreetbets/comments/lm7n51/congressional_hearings_dfv_gme_etc_megathread/gnxpdbx/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1613713766.0
    },
    {
        "author": "XxShakallxX",
        "body": "Yeah that's right, MA Line",
        "created_utc": 1614365714,
        "id": "gov6rco",
        "permalink": "/r/wallstreetbets/comments/lsy53g/450k_loss_in_4_days_a_new_personal_record/gov6rco/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1614394514.0
    },
    {
        "author": "KoiPonded",
        "body": "So by holding my diamonds, I’m keeping GameStop employees employed? Look, Ma! I’m a job creator!",
        "created_utc": 1612201793,
        "id": "glmjdtj",
        "permalink": "/r/wallstreetbets/comments/la6e16/cnn_back_off_this_is_a_lie_literally_a_5_second/glmjdtj/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1612230593.0
    },
    {
        "author": "Dougiejurgens2",
        "body": "My best trade ever was a 10 bagger on baba FDs when China deep faked Jack ma the day I bought them.",
        "created_utc": 1612238574,
        "id": "glox2wn",
        "permalink": "/r/wallstreetbets/comments/la0nb6/unpinned_daily_discussion_thread_for_february_01/glox2wn/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1612267374.0
    },
    {
        "author": "Wolf_of_Autism",
        "body": "yeah normally im not a retard and make reasonable trades but i went full retard and just invested 4 years worth of profits.....actual autist\n\nsorry ma",
        "created_utc": 1612376367,
        "id": "glw1o9k",
        "permalink": "/r/smallstreetbets/comments/lbk554/gme_downward_price_action_this_week_doesnt_make/glw1o9k/",
        "score": 16,
        "subreddit": "smallstreetbets",
        "created": 1612405167.0
    },
    {
        "author": "tattoomoniesgoburr",
        "body": "I AM ALSO IN ON THIS. PROFESSIONAL TATTOOER IN BOSTON, MA. If this shit hits $1000 I will be doing diamond hand day, where I will tattoo free diamonds on anyone with proof of a hold in GME!",
        "created_utc": 1614210070,
        "id": "gon5uzb",
        "permalink": "/r/Wallstreetbetsnew/comments/lro3u7/gme_10000_free_tattoos_for_all_he_apes/gon5uzb/",
        "score": 16,
        "subreddit": "Wallstreetbetsnew",
        "created": 1614238870.0
    },
    {
        "author": "Any_Situation_3005",
        "body": "I disagree with you. My picks are\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS\n\nThis isn't financial advice",
        "created_utc": 1613758634,
        "id": "go15sx7",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go15sx7/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1613787434.0
    },
    {
        "author": "Floofyboy",
        "body": "&gt; 2) Pattern-detection: Humans are notorious for seeing cause and effect in random noise. When there is short-term stock movement, people invoke all kinds of explanations (\"markets went down because investors were worried about ____\") and sometimes make decisions based on them. But often, this will be explaining noise. \n\n\nI think its sometimes its a self fulfilling prophecy. For example, i'm not convinced a stock going above the 50 days ma really means anything, but since a bunch of people think its a buy signal, it ends up actually being one.",
        "created_utc": 1614372780,
        "id": "govvbkt",
        "permalink": "/r/StockMarket/comments/lt6ajh/a_couple_cognitive_biases_to_be_aware_of_in/govvbkt/",
        "score": 16,
        "subreddit": "StockMarket",
        "created": 1614401580.0
    },
    {
        "author": "1d0wn5up",
        "body": "Pretty crazy - I’m new to all this but jumped on the GME wave at 90 a share. Still holding. Saw all the story’s about DFV and how he started all this and became a millionaire. Decided to look into him more and found out he’s from Massachusetts. I’m also from here and thought wow that’s crazy. Then I read a bit more and saw that he’s from a place called Wilmington Ma , that’s literally 5 min up the street from me. I’m glad to see a local Boston kid make it big and rob these crook POS blind.",
        "created_utc": 1612184892,
        "id": "gllegnq",
        "permalink": "/r/wallstreetbets/comments/la0n4z/daily_discussion_thread_for_february_01_2021/gllegnq/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1612213692.0
    },
    {
        "author": "Moooooonsuun",
        "body": "I'M LIVIN' IN THAT 21ST TENDERY \n  \n\nDOING SOMETHING MEAN TO IT\n  \n\nDOING BETTER THAN THE HEDGIES ANYBODY EVER SEEN DO IT \n  \n\nSCREAMS FROM THE SHORTIES, GOT A NICE RING TO IT \n  \n\nI GUESS EVERY AUTIST AND RETARD NEED HIS THEME MUSIC\n  \n... \n\nNO ONE HEDGE SHOULD HAVE ALL THAT POWER\n  \n\nTHE STOCK'S TICKING I JUST COUNT THE HOURS\n  \n\nKEEP HOLDING, TO THE PLAYERS GO THE POWER\n  \n\n*21ST CENTURY DIAMOND HANDS*\n  \n... \n\n  \nTHE SYSTEM BROKEN, THE HEDGE IS DEAD, THE SQUEEZE IS OPEN\n  \n\nWE AIN'T GOT TENDIES TO LOSE, MA' FUCKA WE HOLDIN'\n  \n\nHUH? MA' FUCKA WE HOLDIN'\n  \n\nWITH SOME MOONING STONKS, AND SOME OPTIONS CLOSIN'\n  \n\nIN THIS 🌈🐻 WORLD, WE THE 🐮 CHOSEN\n  \n\nSO GOODNIGHT WSB, I SEE YOU IN THE MORNIN'\n  \n\nHUH? I'LL SEE YOU IN THE MORNIN'\n  \n\nTHIS MOONING WAY TOO MUCH, I NEED A MOMENT",
        "created_utc": 1612212447,
        "id": "glnb47n",
        "permalink": "/r/wallstreetbets/comments/lab86a/gme_discussion_thread_for_february_1_2021_part_3/glnb47n/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1612241247.0
    },
    {
        "author": "NPRjunkieDC",
        "body": "I posted this for noobies in another subreddit. \nApplies to small and mid-cap too\n\nhttps://ragingbull.com/kb/how-to-make-money-with-penny-stocks/\n\nOtcmarkets.com you can see pennystocks that are being sold ,  up to date news by ticker + screener. Some stocks have warnings. \n\nUnbiastock.com shows you stocks that are trading last hour or 6-12-24.\n\nFinviz.com is a stock screener with many filters but only non-OTC .\n\nMy stock portfolio is a free app to monitor your portfolio .\n\nTD Ameritrade lets you buy almost any stock.  RH and Webull don't allow OTC and most pennystocks are OTC. Fidelity also good but occasionally don't offer a stock. \n\nI trade 4-5 stocks daily but that is cuz I'm on my phone most of the day monitoring my 64 stock portfolio and seeing what others recommend or what is selling .\n\nThe general advice for pennystocks is to trade not invest . Occasionally you find a winner that you keep and might add to. You make more money with several 20% short trades that add up over time vs chasing winners and losing money in the process. \n\nWe all make the mistake of getting in late, or selling too early . \n\nI don't do what some do like deeply research a company Sec filings , balance sheet etc. \n\nI go to Yahoo Finance and click view all. Check 50/200 MA + Float that the smaller the better and prefer under 100M. Billions of shares in a pennystock is a warning sign. Ideally the numbers at the bottom like earnings growth,  operating income,  EBITDA should be positive but rarely the case with pennystocks or companies that are growing. \n\nBefore a purchase I check Yahoo Finance conversations. You can see how much interest by number of new conversations.  Also good info from posters that know about the company.  Volume too is important.  Should be much higher than usual.\n\nI also go to Stocktwits for the same .\n\nSomeone pointed out that companies that price rises 100% in last year or months will probably keep going . This is very true in pennystocks. \n\nBut these sites + Reddit are full of pumpers and dumpers.  So read through the lines.\n\nFinally when a stock seems a winner by the point it crosses 100% for you many recoup investment.  I wait until 220-240% so I only have to sell 30% of stocks not 50%. This threshold usually happens in one day. A stock goes up gradually for days or weeks then suddenly flies.",
        "created_utc": 1613072349,
        "id": "gmz38ni",
        "permalink": "/r/stocks/comments/lhs005/message_to_other_young_investors/gmz38ni/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1613101149.0
    },
    {
        "author": "goldmansachsofshit",
        "body": "ma!!! somethin's happnin' with the StOCk!!!Ma!!",
        "created_utc": 1612981191,
        "id": "gmudp06",
        "permalink": "/r/wallstreetbets/comments/lgrxxk/gme_reeee_consolidation_zone_210/gmudp06/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1613009991.0
    },
    {
        "author": "shibewalker",
        "body": "WSB be like “Look ma! Me and my retarded friends are on tv again” 🤣 💎🤲🏽",
        "created_utc": 1614262297,
        "id": "gopfs5z",
        "permalink": "/r/wallstreetbets/comments/ls63oa/gme_megathread_for_thursday_february_25th_2021/gopfs5z/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1614291097.0
    },
    {
        "author": "stickalus",
        "body": "AMC AND GME GRAPHS BE IDENTICAL! THEY THINK WE BE SMART BUT NO! WE RETARDED! BUY MORE! HOLD UNTIL THE RAPTURE! LOOK AT ME NOW MA!💎🙌🏻\n\nthis is not financial advice, my keyboard autoppredicted the above message.",
        "created_utc": 1612282620,
        "id": "glqw0nn",
        "permalink": "/r/wallstreetbets/comments/laujs5/gme_thread_for_2221/glqw0nn/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1612311420.0
    },
    {
        "author": "Minimum-Set-3222",
        "body": "gamma squeeze... gamma squeeze... gamma SQUEEZE... GAMMA SQUEEZE... GAM MA SQ U E E Z E 🦾",
        "created_utc": 1614353228,
        "id": "gou5wx5",
        "permalink": "/r/wallstreetbets/comments/lsvmfs/gme_megathread_for_friday_february_26th_2021/gou5wx5/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1614382028.0
    },
    {
        "author": "manofculture003",
        "body": "Bring back the good old days of people talking about Jack Ma. That was funny as fuck",
        "created_utc": 1612230134,
        "id": "glofyei",
        "permalink": "/r/wallstreetbets/comments/ladzdt/what_are_your_moves_tomorrow_february_02_2021/glofyei/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1612258934.0
    },
    {
        "author": "endi1133",
        "body": "Yup.  Nasdaq sitting below it's 50 day ma.  Markets, especially tech ARE top heavy.  \nI wanna see PLTR get under 20.",
        "created_utc": 1614293269,
        "id": "goriqzh",
        "permalink": "/r/options/comments/lse1si/pltr_calls_have_dropped_quite_a_bit_in_price/goriqzh/",
        "score": 15,
        "subreddit": "options",
        "created": 1614322069.0
    },
    {
        "author": "giantwashcapsfan8",
        "body": "Market corrections are consistently ended by SPY breaching the 50 MA, save for the COVID crash which is obviously a unique scenario. All 8 corrections in the past 2 year immediately recovered after breaching that point, being immediately followed by a week where we rip near 10%. [See this years graph for autist proof.](https://i.imgur.com/dPplIT0.png). The longest SPY has remained under the 50MA was 3 days. We’re 1% away, at $279.50. Might not be tomorrow but we’re about to find our bottom and SPY $400 end of next week.",
        "created_utc": 1614312601,
        "id": "goskvd0",
        "permalink": "/r/wallstreetbets/comments/lsgrk1/what_are_your_moves_tomorrow_february_26_2021/goskvd0/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1614341401.0
    },
    {
        "author": "Heytherpalz",
        "body": "Jack ma called and said he is holding. 🚀🚀🚀💎🖐",
        "created_utc": 1612215809,
        "id": "glnjucm",
        "permalink": "/r/wallstreetbets/comments/laenfw/120k_baba_earnings_yolo_up_100_and_letting_it/glnjucm/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1612244609.0
    },
    {
        "author": "GottaBeMadeOfMilo",
        "body": "The short report coming out on the 9th lags 2 weeks and will be mostly uneventful. 50 day ma coming in around $50 and will offer good support (this is a good spot to buy IMO). The next catalyst will be earnings on March 25, or Cohen making a big move. This has potential to hit $180 - $200 again, but it will not be a fast short squeeze like before, give it a month or two. Not financial advice, I have no position in this stock right now but will buy in closer to $50.",
        "created_utc": 1612813377,
        "id": "gmm5vpl",
        "permalink": "/r/wallstreetbets/comments/lf9rdy/gme_megathread_for_mon_28/gmm5vpl/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1612842177.0
    },
    {
        "author": "heavydutydan",
        "body": "Ma!!! THE MEATLOAF!! FUCK!!",
        "created_utc": 1612254281,
        "id": "glpjp0n",
        "permalink": "/r/wallstreetbets/comments/lao08z/mom_you_didnt_raise_me_to_be_a_little_bitch_lol/glpjp0n/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1612283081.0
    },
    {
        "author": "humplick",
        "body": "[Sax-a-ma-phone](http://imgur.com/a/KGRZwoX)",
        "created_utc": 1614106910,
        "id": "gohrqxu",
        "permalink": "/r/pennystocks/comments/lqfix2/do_not_panicsell_the_coming_days/gohrqxu/",
        "score": 15,
        "subreddit": "pennystocks",
        "created": 1614135710.0
    },
    {
        "author": "ilovethatitsjustus",
        "body": "Jack Ma is probably spinning in his grave at these BABA numbers 🤣",
        "created_utc": 1612323523,
        "id": "gltkf3x",
        "permalink": "/r/wallstreetbets/comments/lat47o/unpinned_daily_discussion_thread_for_february_02/gltkf3x/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1612352323.0
    },
    {
        "author": "bryanna_leigh",
        "body": " MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613758764,
        "id": "go163dp",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go163dp/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1613787564.0
    },
    {
        "author": "cuittle",
        "body": "Short term bad news, long term who knows yet. Square is still reliant on Visa and Mastercard infrastructure for its current revenue generating business. The holy grail for any Fintech company is to create a widely adopted solution that completely circumvents credit card payment processors' rails.",
        "created_utc": 1614211410,
        "id": "gon8l9r",
        "permalink": "/r/investing/comments/lrpi4v/visa_and_mastercard_are_getting_ready_to_raise/gon8l9r/",
        "score": 14,
        "subreddit": "investing",
        "created": 1614240210.0
    },
    {
        "author": "bobstergrip",
        "body": "This explains a lot. I use the MACD, RSI, and Stoch, and MA currently. I can see some uses for a couple of the other indicators now.",
        "created_utc": 1614285385,
        "id": "gor066f",
        "permalink": "/r/stocks/comments/lsfk88/indicators_explained_for_newbies_in_stock_market/gor066f/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1614314185.0
    },
    {
        "author": "EastCoastProtoDad",
        "body": "Portfolio today:\n\nGOOG- 30%\nAAPL- 25%\nMA-20%\nV-15%\nGE-10%\n\nPortfolio tomorrow:\n\nGME - 40%\nAPHA-25%\nBB -25%\nPLTR -10%",
        "created_utc": 1614209140,
        "id": "gon3wqf",
        "permalink": "/r/wallstreetbets/comments/lrne7f/what_are_your_moves_tomorrow_february_25_2021/gon3wqf/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1614237940.0
    },
    {
        "author": "The-Crazed-Crusader",
        "body": "Guy who was raised by former farmers and grew up around farmers here:\n\nIt isn't quite a monopoly, but since most first world farmer's own equipment more valuable than their house and none of the parts on different vehicles are compatible then many farmers have to do business with certain companies. Added to this is because they're expensive, farm equipment is given exceptionally robust builds and are maintained well so they last for decades or longer. Many farmers are also savvy mechanics, as it costs less than calling in a specialist mechanic from 50 miles away (hauling a combine requires a semi driver, so it's easier to have the mechanics come to the combine for overhauls).\n\nAlso, there's nothing wrong with big commercial produce companies, but most of the land is actually owned by a myriad ma and pa ventures that generally inherited land that's been in the family ever since the US was first settled. The big corporate side are generally the middlemen that buy from the farmers, package everything into standardized brand recognized amounts, and distribute it for mass consumption. Actual farming hasn't been much effected by the growth of global businesses as it requires men with decades of experience, massive up front capital, and a tie between worker interests and the outcome of individual crops (farmers that get paid regardless if there's a good harvest are far less productive).\n\nI think John Deere will be very profitable indefinitely as they have a wide economic moat, providing the world's most essential industry with its most essential equipment. However, this industry moves very slowly, and I wouldn't expect it to go full Amazon and suddenly transform into a growth company.",
        "created_utc": 1613097253,
        "id": "gn0jq56",
        "permalink": "/r/wallstreetbets/comments/li1b1l/is_an_agriculture_monopoly_making_the_john_deere/gn0jq56/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1613126053.0
    },
    {
        "author": "unsatisfyin",
        "body": "I once took $10 from ma and she dragged me up the stairs by my ears.",
        "created_utc": 1614195668,
        "id": "gombpz0",
        "permalink": "/r/wallstreetbets/comments/lrlee7/100k_nndm_molo_update/gombpz0/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1614224468.0
    },
    {
        "author": "Botboy141",
        "body": "MA is great, except for all their congressmen wanting more restrictions on retail trading.",
        "created_utc": 1613694230,
        "id": "gny8xvr",
        "permalink": "/r/wallstreetbets/comments/lmyan9/dfvs_smile_hes_watching_all_us_apes_support_him/gny8xvr/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1613723030.0
    },
    {
        "author": "FillRevolutionary885",
        "body": "Look ma, im about to be on the top.",
        "created_utc": 1613603253,
        "id": "gntl90a",
        "permalink": "/r/wallstreetbets/comments/lm7bt5/230k_riot_yolo_im_going_to_the_fucking_moon/gntl90a/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1613632053.0
    },
    {
        "author": "broneilbro",
        "body": "We need to cross the MA on the 5Min chart and then its to the moon...",
        "created_utc": 1612194572,
        "id": "glm0myl",
        "permalink": "/r/wallstreetbets/comments/la5s8i/gme_discussion_thread_for_february_01_2021_part_2/glm0myl/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1612223372.0
    },
    {
        "author": "MrTeeBeggerson",
        "body": "Holding ma diiiickkkkk🚀🚀🚀🚀🚀🚀",
        "created_utc": 1612302328,
        "id": "glsb8au",
        "permalink": "/r/wallstreetbets/comments/lb77pr/gme_and_amc_charts_nearly_identical_all_day_on_an/glsb8au/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1612331128.0
    },
    {
        "author": "LetsTalkOrptions",
        "body": "Lost it all on stonks and donated all ma Reddit gold, so might as well hold 🙌🏻💎💎💎",
        "created_utc": 1612324794,
        "id": "gltmw41",
        "permalink": "/r/wallstreetbets/comments/lb7rg4/gme_overnight_pajama_party_megathread_9000/gltmw41/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1612353594.0
    },
    {
        "author": "Floofyboy",
        "body": "Nobody knows for sure, but if you look at the 1 day chart, its about to reach the 50 day MA and possibly bounce back from it like its been doing for the last 10 months. But who knows, market is nuts right now.",
        "created_utc": 1614105789,
        "id": "gohp4wa",
        "permalink": "/r/stocks/comments/lqpkzk/arkf_now_or_tomorrow/gohp4wa/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1614134589.0
    },
    {
        "author": "jjm295",
        "body": "I’ve been around such great battles as $RAD and $MU. THIS IS THE BIGGEST BATTLE OF THEM ALL, AND IM GLAD TO HAVE THE REINFORCEMENTS! Welcome fellow autists! 💎🙌",
        "created_utc": 1612214482,
        "id": "glngk0e",
        "permalink": "/r/wallstreetbets/comments/laefvm/theres_a_difference_between_joining_wsb_and/glngk0e/",
        "score": 209,
        "subreddit": "wallstreetbets",
        "created": 1612243282.0
    },
    {
        "author": "Virtue_Voidwalker",
        "body": "GOD MU WAS SUCH A BLAST LOL\n\nThe best indicator was my dad, who bought the peak and rode it down for a loss.",
        "created_utc": 1612325509,
        "id": "glto8hu",
        "permalink": "/r/wallstreetbets/comments/lbcruc/wallstreetbets_state_of_the_union/glto8hu/",
        "score": 135,
        "subreddit": "wallstreetbets",
        "created": 1612354309.0
    },
    {
        "author": "Empor3R",
        "body": "The good days. When we busted a nut on AMD 20$ calls and the emotional roller coaster of MU. Su Bae memes for days. The new ppl here only know came for gme",
        "created_utc": 1613011563,
        "id": "gmw86wr",
        "permalink": "/r/wallstreetbets/comments/lh4yss/anyone_else_suspicious_about_all_of_these_beta/gmw86wr/",
        "score": 117,
        "subreddit": "wallstreetbets",
        "created": 1613040363.0
    },
    {
        "author": "WhatRUsernamesUsed4",
        "body": "7/20/18 $MU $90 calls was prime wsb",
        "created_utc": 1612982290,
        "id": "gmugeh4",
        "permalink": "/r/wallstreetbets/comments/lgvbcc/the_sub_is_becoming_a_pyramid_scheme_and/gmugeh4/",
        "score": 111,
        "subreddit": "wallstreetbets",
        "created": 1613011090.0
    },
    {
        "author": "funkysmellbear",
        "body": "I miss the days of $MU tbh",
        "created_utc": 1612325469,
        "id": "glto5rr",
        "permalink": "/r/wallstreetbets/comments/lbcruc/wallstreetbets_state_of_the_union/glto5rr/",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1612354269.0
    },
    {
        "author": "BearyAnal",
        "body": "That shit was brutal, there was that one dude who thought MU would go all the way up and held until he loss almost everything. Good times",
        "created_utc": 1612327154,
        "id": "gltr8q7",
        "permalink": "/r/wallstreetbets/comments/lbcruc/wallstreetbets_state_of_the_union/gltr8q7/",
        "score": 63,
        "subreddit": "wallstreetbets",
        "created": 1612355954.0
    },
    {
        "author": "distressedweedle",
        "body": "Fuck, I join just before the $MU and $AMD craze and that's how I learned about options the hard way. \n\nThose $MU $69c FDs in 2018 never did pay out lmao",
        "created_utc": 1612327019,
        "id": "gltqzze",
        "permalink": "/r/wallstreetbets/comments/lbcruc/wallstreetbets_state_of_the_union/gltqzze/",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1612355819.0
    },
    {
        "author": "WasabiofIP",
        "body": "Anyone heard of a little company called Micron? I hear it's trading at a super low P/E... ;)",
        "created_utc": 1612979413,
        "id": "gmu9fpr",
        "permalink": "/r/wallstreetbets/comments/lgvbcc/the_sub_is_becoming_a_pyramid_scheme_and/gmu9fpr/",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1613008213.0
    },
    {
        "author": "sdasda7777",
        "body": "I cannot agree with those. Simply check the fundamentals and you'll see the best ones are:\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613762144,
        "id": "go1drfw",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1drfw/",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1613790944.0
    },
    {
        "author": "ShellShockBP",
        "body": "I remember a little stock called Micron that was always on the cusp of mooning.",
        "created_utc": 1612328402,
        "id": "glttfud",
        "permalink": "/r/wallstreetbets/comments/lbd21v/together_no_one_can_stop_us/glttfud/",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1612357202.0
    },
    {
        "author": "heyaheyyarequiem",
        "body": "What are you talking about?   \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS\n\nAre clearly better picks",
        "created_utc": 1613763200,
        "id": "go1g59q",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1g59q/",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1613792000.0
    },
    {
        "author": "Jacob1235_S",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nEdit: i am not a financial professional...i don't lose enough money to be considered one yet",
        "created_utc": 1613761256,
        "id": "go1br9s",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1br9s/",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1613790056.0
    },
    {
        "author": "amrogers3",
        "body": "&gt;MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613763162,
        "id": "go1g26p",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1g26p/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1613791962.0
    },
    {
        "author": "SlAddict",
        "body": "Ask them what strike I should buy for my MU Calls",
        "created_utc": 1612225528,
        "id": "glo6785",
        "permalink": "/r/wallstreetbets/comments/laexxi/robinhood_ceo_expected_to_testify_before_us_house/glo6785/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1612254328.0
    },
    {
        "author": "JulianVerse",
        "body": "MU 60",
        "created_utc": 1613009960,
        "id": "gmw4z2j",
        "permalink": "/r/wallstreetbets/comments/lh4yss/anyone_else_suspicious_about_all_of_these_beta/gmw4z2j/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1613038760.0
    },
    {
        "author": "iesou",
        "body": "I am long and shorting these.\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613760402,
        "id": "go19t6s",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go19t6s/",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1613789202.0
    },
    {
        "author": "Any_Situation_3005",
        "body": "I disagree with you. My picks are\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS\n\nThis isn't financial advice",
        "created_utc": 1613758641,
        "id": "go15tji",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go15tji/",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1613787441.0
    },
    {
        "author": "postbroadcast",
        "body": "buying tech to track this 🚀 🚀 🚀 MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, GME, GME, GME, GME, GME, GME, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, AMC, GME, CDW, CE, CNC, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, CNP, CTL, CERN, CF, SCHW, CHTR, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, AMC, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, GME, GME, GME, GME, GME, GME, GME, GME, GME, GME, GME, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, BBW, GME, GME, GME, GME, GME, GME, GME, GME, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, GME, GME, GME, GME, GME, GME, GME, GME, GME, GME, GME, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, GME, GME, GME, GME, GME, GME, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, AMC, GME, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613760794,
        "id": "go1apel",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1apel/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1613789594.0
    },
    {
        "author": "realister",
        "body": "#GME gang welcome to the **elite club**!\n\nYou are joining such titans as: \n\n**TLRY** gang\n\n**RKT mortgage** gang \n\n**Oil Tanker** gang\n\n**Purple Mattress** gang\n\n**SLV** gang\n\n**Corn** gang\n\n**MU $90** gang\n\n**JNUG** gang\n\n**MSFT $220 in September** gang\n\n**SLV** gang again.\n\n*Thank you for your service.*",
        "created_utc": 1612309303,
        "id": "glsr7f7",
        "permalink": "/r/wallstreetbets/comments/lb6aiq/what_are_your_moves_tomorrow_february_03_2021/glsr7f7/",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1612338103.0
    },
    {
        "author": "Primepolitical",
        "body": "&gt;Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nI am sorry, but are you long or shorting these?",
        "created_utc": 1613759293,
        "id": "go17ai1",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go17ai1/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1613788093.0
    },
    {
        "author": "NuancedFlow",
        "body": "Ah the good ol MU days",
        "created_utc": 1613019753,
        "id": "gmwmxwj",
        "permalink": "/r/wallstreetbets/comments/lh4yss/anyone_else_suspicious_about_all_of_these_beta/gmwmxwj/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1613048553.0
    },
    {
        "author": "Slyric_",
        "body": "Wow you’re looking at those? I’m looking at them too! Here’s my portfolio: \n\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\nEdit: i am not a financial expert I’m just a retard sitting at computer",
        "created_utc": 1613760284,
        "id": "go19jmb",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go19jmb/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1613789084.0
    },
    {
        "author": "realister",
        "body": "#GME gang welcome to the **elite club**!\n\nYou are joining the Titans of WSB such as: \n\n**TLRY** gang\n\n**RKT mortgage** gang \n\n**Oil Tanker** gang\n\n**Purple Mattress** gang\n\n**SLV** gang\n\n**Corn** gang\n\n**MU 90c** gang\n\n**SPY 200p gang**\n\n**JNUG** gang\n\n**MSFT $220c in September** gang\n\n\n*Thank you for your service.*",
        "created_utc": 1612358595,
        "id": "gluw7jl",
        "permalink": "/r/wallstreetbets/comments/lbl62i/daily_discussion_thread_for_february_03_2021/gluw7jl/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1612387395.0
    },
    {
        "author": "Lolsmileyface13",
        "body": "*takes massive hit off a blunt*\n\nWSB is so cyclical. First we all pile into a meme like gme (mu) with bagholders left. Then we rotate sectors into weed and will soon leave behind a wake of retards clinging to their useless otc weed stocks screaming asks at 1/10th what they paid (last time was what, 2016?). \n\nNext we will rotate into biopharma, followed by good old 3x leveraged etfs. And the circle of depravity/retardation will have completed another rotation.",
        "created_utc": 1612996020,
        "id": "gmvckrq",
        "permalink": "/r/wallstreetbets/comments/lh3qli/what_are_your_moves_tomorrow_february_11_2021/gmvckrq/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1613024820.0
    },
    {
        "author": "NoobSniperWill",
        "body": "MU $90C gang assemble!",
        "created_utc": 1612982270,
        "id": "gmugcom",
        "permalink": "/r/wallstreetbets/comments/lgvbcc/the_sub_is_becoming_a_pyramid_scheme_and/gmugcom/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1613011070.0
    },
    {
        "author": "Nnova831",
        "body": "guys I just sold my AMD and MU equity for more AMC and GME am I doing it right?",
        "created_utc": 1612276050,
        "id": "glqdzku",
        "permalink": "/r/wallstreetbets/comments/lat43j/daily_discussion_thread_for_february_02_2021/glqdzku/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1612304850.0
    },
    {
        "author": "ethandavid",
        "body": "I bagheld MU for almost a year, not falling for this one again",
        "created_utc": 1612239298,
        "id": "gloyfb7",
        "permalink": "/r/wallstreetbets/comments/lan0id/semiconductors_very_undervalued_heres_my_dd/gloyfb7/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1612268098.0
    },
    {
        "author": "effinwookie",
        "body": "The people on here bitching about GME are getting just as annoying as the people blindly pumping their grandmas savings into it. When did this sub become the fun police, ffs half you fuckers we’re going nuts on $MU not too long ago.",
        "created_utc": 1612288316,
        "id": "glrbd68",
        "permalink": "/r/wallstreetbets/comments/layuxv/daily_discussion_thread_for_february_02_2021_part/glrbd68/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1612317116.0
    },
    {
        "author": "Any_Situation_3005",
        "body": "I disagree with you. My picks are\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS\n\nThis isn't financial advice",
        "created_utc": 1613758634,
        "id": "go15sx7",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go15sx7/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1613787434.0
    },
    {
        "author": "epyon00",
        "body": "🔥🔥🔥Demand for chips  +  Biden throwing 💲💲💲 at supply problem =  🚀🚀🚀🚀🚀🚀🚀\n\n$10k calls on:   INTC  MU  SMH  ON  AMD",
        "created_utc": 1613077776,
        "id": "gmzfzhh",
        "permalink": "/r/wallstreetbets/comments/lhumfo/what_are_your_moves_tomorrow_february_12_2021/gmzfzhh/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1613106576.0
    },
    {
        "author": "eciovkcuf",
        "body": "Y’all are fucking hilarious if your only retort is to claim my account age. I’ve been here since Marty mohos micron yolo. Wsb is for retards, but this is a special type of ignorant bullshit.",
        "created_utc": 1612236943,
        "id": "glotx84",
        "permalink": "/r/wallstreetbets/comments/ladzdt/what_are_your_moves_tomorrow_february_02_2021/glotx84/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1612265743.0
    },
    {
        "author": "ninkorn",
        "body": "Remember when this sub was obsessed over MU, AMD, TSLA, and GNUS?\n\nThose were the days. Good times",
        "created_utc": 1612236534,
        "id": "glot3p0",
        "permalink": "/r/wallstreetbets/comments/ladzdt/what_are_your_moves_tomorrow_february_02_2021/glot3p0/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1612265334.0
    },
    {
        "author": "bryanna_leigh",
        "body": " MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613758764,
        "id": "go163dp",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go163dp/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1613787564.0
    },
    {
        "author": "--orb",
        "body": "Yeah bro. WSB has \"always\" been a sub that goes from 1.2m to 8.2m subs in a week.  \n\nGet the fuck out of here with your makin'-shit-up-actin'-like-you-been-'round-here-before-ass. I don't remember us gaining 100k subscribers to all into fucking $MU.",
        "created_utc": 1612295201,
        "id": "glrsx78",
        "permalink": "/r/wallstreetbets/comments/lah5rb/do_you_all_notice_the_trend_on_wsb_today_theres_a/glrsx78/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1612324001.0
    },
    {
        "author": "brutalpancake",
        "body": "MU 90C gang where u at",
        "created_utc": 1613073992,
        "id": "gmz74zh",
        "permalink": "/r/wallstreetbets/comments/lhtazu/as_requested_heres_a_visualization_of_which/gmz74zh/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1613102792.0
    },
    {
        "author": "EL1TEGAMING",
        "body": "I miss these... $MU 90C back couple years ago was the shit!",
        "created_utc": 1612209846,
        "id": "gln4e34",
        "permalink": "/r/wallstreetbets/comments/lacejd/bringing_back_some_degeneracy_back_to_the_sub/gln4e34/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1612238646.0
    },
    {
        "author": "FaggotsDelight69",
        "body": "WSB is fucking ruined. Take me back to MSFT $200 and MU $60",
        "created_utc": 1612321323,
        "id": "gltfyyw",
        "permalink": "/r/wallstreetbets/comments/lb6aiq/what_are_your_moves_tomorrow_february_03_2021/gltfyyw/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1612350123.0
    },
    {
        "author": "SteezySF",
        "body": "&gt;MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nThese ones are better.  MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613757771,
        "id": "go13y6e",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go13y6e/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1613786571.0
    },
    {
        "author": "_Forgotten",
        "body": "I really like these stocks:  \n MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM,  ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO,  AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH,  ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET,  AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX,  BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR,  BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE,  CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI,  XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA,  CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI,  CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS,  DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC,  EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS,  EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX,  FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA,  FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS,  GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE,  HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO,  ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ,  IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY,  KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS,  LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO,  MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET,  MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI,  MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE,  NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY,  OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT,  PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR,  PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O,  REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC,  SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX,  STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL,  FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR,  ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO,  VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA,  DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN,  XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613761232,
        "id": "go1bp9p",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1bp9p/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1613790032.0
    },
    {
        "author": "accy312help",
        "body": "AMD and MU is like the hot ex that glowed up after i dumped her for another basic bitch. Don’t worry baby we are coming back after these gamestop autists lose all their money tomorrow",
        "created_utc": 1612813546,
        "id": "gmm69b3",
        "permalink": "/r/wallstreetbets/comments/lf9huy/daily_discussion_thread_for_february_08_2021/gmm69b3/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1612842346.0
    },
    {
        "author": "thot_tendie",
        "body": "They're gonna repeat all the plays we tried and lost our ass on. First up is SLV, then they'll try to meme on large cap MSFT again, then back to tradition with a nice MU 90C to top it off.",
        "created_utc": 1612317839,
        "id": "glt8wne",
        "permalink": "/r/wallstreetbets/comments/lat47o/unpinned_daily_discussion_thread_for_february_02/glt8wne/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1612346639.0
    },
    {
        "author": "iTypenaked",
        "body": "$MU gang",
        "created_utc": 1612931287,
        "id": "gms6qgj",
        "permalink": "/r/wallstreetbets/comments/lgll5j/what_is_the_future_of_wsb/gms6qgj/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1612960087.0
    },
    {
        "author": "pixelwalrusca",
        "body": "Hello scraper bots, here's the stonks I like\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613757518,
        "id": "go13e8g",
        "permalink": "/r/wallstreetbets/comments/lnd8jo/daily_discussion_thread_for_february_19_2021/go13e8g/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1613786318.0
    },
    {
        "author": "navyspheal",
        "body": "MU 90C brings a tear to my eye",
        "created_utc": 1613074273,
        "id": "gmz7sj6",
        "permalink": "/r/wallstreetbets/comments/lhtazu/as_requested_heres_a_visualization_of_which/gmz7sj6/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1613103073.0
    },
    {
        "author": "_mvkoto",
        "body": "i like how you think my man. here are my favorites as well:\n\n&amp;#x200B;\n\n MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613760994,
        "id": "go1b5rb",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1b5rb/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1613789794.0
    },
    {
        "author": "TankGroundbreaking65",
        "body": "MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613761692,
        "id": "go1cqoj",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1cqoj/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1613790492.0
    },
    {
        "author": "v1nzy",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nEdit: i am not a financial professional...i don't lose enough money to be considered one yet",
        "created_utc": 1613760942,
        "id": "go1b1ki",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1b1ki/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1613789742.0
    },
    {
        "author": "hoogetraps",
        "body": "We’ve never seen a cult as strong as GME. Like Su Bae, MSFT, MU, fake meat, Tim Apple, etc all had strong followings but nothing remotely close to this complete sub domination.",
        "created_utc": 1612228487,
        "id": "glocfj7",
        "permalink": "/r/wallstreetbets/comments/ladzdt/what_are_your_moves_tomorrow_february_02_2021/glocfj7/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1612257287.0
    },
    {
        "author": "alwayswashere",
        "body": "What was after MU? AMD ...",
        "created_utc": 1613760521,
        "id": "go1a2wa",
        "permalink": "/r/wallstreetbets/comments/lnna91/today_as_mu_has_finally_crossed_the_90_threshold/go1a2wa/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613789321.0
    },
    {
        "author": "Jacob1235_S",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nEdit: i am not a financial professional...i don't lose enough money to be considered one yet",
        "created_utc": 1613761249,
        "id": "go1bqnm",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1bqnm/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613790049.0
    },
    {
        "author": "Johzzy",
        "body": "I've been doing my DD recently and these are the stocks I like\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX \nand also these\n\n EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.  \n\nI'm not a financial advisor anything I say or may not say will not profit you and only me",
        "created_utc": 1613761764,
        "id": "go1cwlc",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1cwlc/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613790564.0
    },
    {
        "author": "bring_me_a_samich",
        "body": "So I agree with a lot of your pics. These though I have doubts about:\n\nDVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY",
        "created_utc": 1613760940,
        "id": "go1b1f3",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1b1f3/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613789740.0
    },
    {
        "author": "the-lost-",
        "body": "If the GME boys end up being right I will simply tip the cap, and continue to lose money on MU calls. Same thing if they are wrong. This is a casino. Giveth and taketh",
        "created_utc": 1612238375,
        "id": "glowp3n",
        "permalink": "/r/wallstreetbets/comments/ladzdt/what_are_your_moves_tomorrow_february_02_2021/glowp3n/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1612267175.0
    },
    {
        "author": "SoggyGotBanned",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nEdit: i am not a financial professional...i don't lose enough money to be considered one yet",
        "created_utc": 1613761039,
        "id": "go1b9fi",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1b9fi/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613789839.0
    },
    {
        "author": "Davkokot",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nEdit: i am not a financial professional...i don't lose enough money to be considered one yet",
        "created_utc": 1613760736,
        "id": "go1akls",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1akls/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613789536.0
    },
    {
        "author": "Jacob1235_S",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nEdit: i am not a financial professional...i don't lose enough money to be considered one yet",
        "created_utc": 1613761266,
        "id": "go1bs1c",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1bs1c/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613790066.0
    },
    {
        "author": "NoobSniperWill",
        "body": "MU $90C gang unite!",
        "created_utc": 1613761403,
        "id": "go1c39u",
        "permalink": "/r/wallstreetbets/comments/lnna91/today_as_mu_has_finally_crossed_the_90_threshold/go1c39u/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613790203.0
    },
    {
        "author": "mikey-likes_it",
        "body": "MU, AMD, and Intel are asking Biden for US help due to globa chip shortage. Interesting",
        "created_utc": 1613074254,
        "id": "gmz7qva",
        "permalink": "/r/stocks/comments/lhfyjo/rstocks_daily_discussion_options_trading_thursday/gmz7qva/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1613103054.0
    },
    {
        "author": "johnwithcheese",
        "body": "I don’t know about that man. Here’s some of my favourite stocks me and my wife’s boyfriend invest in\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nEdit: i am not a financial advisor, i’ve only lost my net worth and only ever seen red",
        "created_utc": 1613761429,
        "id": "go1c5c4",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1c5c4/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613790229.0
    },
    {
        "author": "Gahvynn",
        "body": "MU go baby go!  MU $90 is no longer a meme!\n\nPLTR go baby go!",
        "created_utc": 1613765584,
        "id": "go1lfil",
        "permalink": "/r/wallstreetbets/comments/lnd8jo/daily_discussion_thread_for_february_19_2021/go1lfil/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613794384.0
    },
    {
        "author": "crawford89",
        "body": "Imma let you finish, but these stocks are the ones that could be the best of all time maybe! Best of all time maybe kinda sorta!\n\nThese ones: MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613760207,
        "id": "go19dc3",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go19dc3/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613789007.0
    },
    {
        "author": "bandersnatchhh",
        "body": "AMC and MU is the only green on my watchlist lol",
        "created_utc": 1614101630,
        "id": "gohf01g",
        "permalink": "/r/wallstreetbets/comments/lqfr4s/daily_discussion_thread_for_february_23_2021/gohf01g/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614130430.0
    },
    {
        "author": "es024",
        "body": "You kids don't even know about $MU 90. We are approaching history",
        "created_utc": 1613061907,
        "id": "gmye3s6",
        "permalink": "/r/wallstreetbets/comments/lhifig/daily_discussion_thread_for_february_11_2021/gmye3s6/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613090707.0
    },
    {
        "author": "AuditControl_Inbox",
        "body": "Theres alot of new people here that werent here during martymohos MU run years back, and are gonna be fucking penniless or bagholding for decades. \n\nBasic google search would tell them my statement that institutions and mutual funds own more than 57 percent of gme shares is right.",
        "created_utc": 1612227007,
        "id": "glo9cfu",
        "permalink": "/r/wallstreetbets/comments/laiwhz/most_of_the_world_does_not_yet_realize_how_big/glo9cfu/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1612255807.0
    },
    {
        "author": "taerin",
        "body": "MU hit 90 today and not a fuckin peep from anybody here. That’s how I know all the OG wsbers have moved on from this sub. Too much “I LiKe tHe StOcK” bullshit from noobs trying to get rich quick from *this one weird trick*",
        "created_utc": 1613755548,
        "id": "go0ywm7",
        "permalink": "/r/wallstreetbets/comments/lnd8jo/daily_discussion_thread_for_february_19_2021/go0ywm7/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613784348.0
    },
    {
        "author": "NEW_JERSEY_PATRIOT",
        "body": "&gt;FUCK YOU BOTS\n\n\nBUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING \nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613757496,
        "id": "go13cei",
        "permalink": "/r/wallstreetbets/comments/lnd8jo/daily_discussion_thread_for_february_19_2021/go13cei/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613786296.0
    },
    {
        "author": "thalassamikra",
        "body": "DFV is wired differently - at this point he's just married to this play and perhaps is going to be like that other WSB legend who made a lot and lost a lot playing MU",
        "created_utc": 1612324432,
        "id": "gltm78l",
        "permalink": "/r/wallstreetbets/comments/lat47o/unpinned_daily_discussion_thread_for_february_02/gltm78l/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1612353232.0
    },
    {
        "author": "seank11",
        "body": "Yes I am. The have great margins, great revs, and a very low valuation.\n\nThere is a chip shortage, and MU manufacturs the components that go into many of these chips. This gives MU pricing power, and since the industry is now an oligopoly where the players are limiting CapEx and thus not increasing production too much, there will probably be a run on pricing in the next contract negotiations.\n\nWouldnt be surprised to see MU hit 100 by EOM, and I believe March 4 has the CEO speaking, where I personally believe they will announce 2 of: Raising guidance, increased BuyBacks, or a divvy.\n\nI will probably be buying VERY short dated OTM calls before this conference, hoping to get a 10 bagger lotto ticket.",
        "created_utc": 1613329407,
        "id": "gngdo66",
        "permalink": "/r/wallstreetbets/comments/ljp713/why_i_think_amd_is_going_up_a_lot_soon/gngdo66/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613358207.0
    },
    {
        "author": "Repeat_Pristine",
        "body": "No, I disagree, I will be longing these stocks:\n\nMGM,  MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK,  SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN,  TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA,  UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN,  VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT,  WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX,  XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL,  BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY,  AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT,  CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB,  CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH,  CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST,  COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG,  DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD,  DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX,  EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST,  FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV,  FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD,  GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC,  HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII,  IEX, IDXX, INFO, ITW, ILMN, IR, INTC, FUCK, YOU, RH, ICE, IBM, INCY, IP, IPG, IFF,  INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM,  JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH,  LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW,  LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD,  MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI,  MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE,  NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY,  OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT,  PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR,  PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O,  REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC,  SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL,  A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL,  GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP,  ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT,  APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nI am not a financial advisor, I am a humble offensive term for people with development disorders.",
        "created_utc": 1613761852,
        "id": "go1d3lz",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1d3lz/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613790652.0
    },
    {
        "author": "AccountantOk111",
        "body": "Who's in the micron gang ??",
        "created_utc": 1613765918,
        "id": "go1m699",
        "permalink": "/r/wallstreetbets/comments/lnd8jo/daily_discussion_thread_for_february_19_2021/go1m699/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613794718.0
    },
    {
        "author": "onyxer03",
        "body": "&gt;MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nBut you cant forget about \n\n&amp;#x200B;\n\n MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613760235,
        "id": "go19fny",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go19fny/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613789035.0
    },
    {
        "author": "VicTheRealest",
        "body": "I disagree with you. My picks are\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS\n\nThis isn't financial advice",
        "created_utc": 1613758392,
        "id": "go159fs",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go159fs/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613787192.0
    },
    {
        "author": "ok2drive",
        "body": "I miss the old MU days. When the sub was small and it was just daily MU talk. That was the first retard mania I experienced on this sub",
        "created_utc": 1613761101,
        "id": "go1befy",
        "permalink": "/r/wallstreetbets/comments/lnna91/today_as_mu_has_finally_crossed_the_90_threshold/go1befy/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613789901.0
    },
    {
        "author": "deadketchup",
        "body": "Yeah I lost a bunch of money in $RAD but being on here with rad and jnug and amd and mu and lean hogs was so fucking fun",
        "created_utc": 1612988426,
        "id": "gmuuy51",
        "permalink": "/r/wallstreetbets/comments/lgvbcc/the_sub_is_becoming_a_pyramid_scheme_and/gmuuy51/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613017226.0
    },
    {
        "author": "BrunoRib",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.  \n\n\nEdit: i am not a sexual or  financial expert..Sue Christian Fucking Iovin if you lose money",
        "created_utc": 1613755616,
        "id": "go0z28l",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go0z28l/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613784416.0
    },
    {
        "author": "JLGT86",
        "body": "$AMD &amp; $MU let’s fucking go",
        "created_utc": 1612809122,
        "id": "gmlwbr0",
        "permalink": "/r/wallstreetbets/comments/lf9huy/daily_discussion_thread_for_february_08_2021/gmlwbr0/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1612837922.0
    },
    {
        "author": "moblo231",
        "body": "2018 post: “I’m gay, retarded, and autistic. I like MU stonk to be 90”\n\n2021 post: “I’m gay, retarded, and autistic. I was sent by CNBC.”",
        "created_utc": 1612337985,
        "id": "glu71ar",
        "permalink": "/r/wallstreetbets/comments/lb6aiq/what_are_your_moves_tomorrow_february_03_2021/glu71ar/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1612366785.0
    },
    {
        "author": "Resylt",
        "body": "But seriously have you guys considered:  \n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nI only eat bananas, so don't consider me smart enough to advise your finances.",
        "created_utc": 1613763047,
        "id": "go1fsxh",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1fsxh/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1613791847.0
    },
    {
        "author": "-ihavenoname-",
        "body": "Did you say these? To the moon!!!?\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613761644,
        "id": "go1cmtn",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1cmtn/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1613790444.0
    },
    {
        "author": "badgerbacon6",
        "body": "🐄🐮 **MU**  💎🙌🏻",
        "created_utc": 1612323624,
        "id": "gltkmc5",
        "permalink": "/r/wallstreetbets/comments/lb6aiq/what_are_your_moves_tomorrow_february_03_2021/gltkmc5/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1612352424.0
    },
    {
        "author": "NKisAlive",
        "body": "AMD, ON, MU, INTC 🚀🚀🚀🚀🚀🚀\n\nSupply &amp; demand bitches",
        "created_utc": 1613171993,
        "id": "gn44qwn",
        "permalink": "/r/wallstreetbets/comments/likmpp/weekend_discussion_thread_for_the_weekend_of/gn44qwn/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1613200793.0
    },
    {
        "author": "clown-penisdotfart",
        "body": "I'm throwing money at semiconductors now. If anything the entire industry is undervalued. Semis are the linchpin of society. They are everywhere and will only grow in application space. More Moore is where it's at. But don't think of just the manufacturers (though I agree Intel will pop huge once they get their shit together or spin out manufacturing, either way), don't forget the suppliers to the manufacturers like Applied Materials, Lam Research, ASML, etc. Whether it be TSMC, Samsung, Intel, Micron, SK Hynix, or any other manufacturer or fabless company doing well, those companies win big. \n\nI hold a lot of $SOXX because of this.",
        "created_utc": 1613080352,
        "id": "gmzlx48",
        "permalink": "/r/investing/comments/lhve2c/why_intel_will_reap_huge_benefits_from_biden/gmzlx48/",
        "score": 6,
        "subreddit": "investing",
        "created": 1613109152.0
    },
    {
        "author": "danby457",
        "body": "You know this sub has changed when mu is at 90 and no one cares 😢",
        "created_utc": 1613149669,
        "id": "gn2rykj",
        "permalink": "/r/wallstreetbets/comments/li8ul6/daily_discussion_thread_for_february_12_2021/gn2rykj/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1613178469.0
    },
    {
        "author": "zertxoxo",
        "body": "MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX and also these\n\nEQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nI'm not a financial advisor anything I say or may not say will not profit you and only me",
        "created_utc": 1613762543,
        "id": "go1enzp",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1enzp/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1613791343.0
    },
    {
        "author": "realister",
        "body": "**GME gang welcome to the elite club!** \n\nYou are joining such titans as: \n\n**RKT** gang\n\n**Tanker** gang\n\n**Mattress** gang\n\n**SLV** gang\n\n**Corn** gang\n\n**MU $90** gang\n\n**MSFT $220 in september** gang\n\n**SLV** gang again.\n\n*Thank you for your service.*",
        "created_utc": 1612291841,
        "id": "glrkbja",
        "permalink": "/r/wallstreetbets/comments/layuxv/daily_discussion_thread_for_february_02_2021_part/glrkbja/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1612320641.0
    },
    {
        "author": "dixiemaisie",
        "body": "MU 90 will soon be a reality!!!",
        "created_utc": 1612816514,
        "id": "gmmcspb",
        "permalink": "/r/wallstreetbets/comments/lf9huy/daily_discussion_thread_for_february_08_2021/gmmcspb/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1612845314.0
    },
    {
        "author": "doctordickphd",
        "body": "Who remembers the $MU bag holders gang? The cope starts to feel like that on steroids. \n\nFYI After playing the stock I got out with around 30% loss, which was due to a retarded last minute greed bet, but whatever I had a number I wanted to reach and so be it. I’m happy that I made the WS bleed, even if I lost a bit in the end. \n\nI hope for all the bag holders that there will be a miracle and / or people understand not to gamble with something they’re not willing to lose. Rest of my money is going to $MSOS, to get back to zero.",
        "created_utc": 1612310472,
        "id": "glstnt3",
        "permalink": "/r/wallstreetbets/comments/lb6aiq/what_are_your_moves_tomorrow_february_03_2021/glstnt3/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1612339272.0
    },
    {
        "author": "DestroyerOfPussy69",
        "body": "Lol MU is the OG meme stock",
        "created_utc": 1612166533,
        "id": "glkrsuw",
        "permalink": "/r/wallstreetbets/comments/l9wner/what_are_your_moves_today_february_01_2021/glkrsuw/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1612195333.0
    },
    {
        "author": "sloth2",
        "body": "or mu $90 july calls last year b/c wsb too poor for naked calls and too stupid for spreads\n\nroku trading like tsla these days",
        "created_utc": 1612327705,
        "id": "glts85w",
        "permalink": "/r/wallstreetbets/comments/lb7rg4/gme_overnight_pajama_party_megathread_9000/glts85w/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1612356505.0
    },
    {
        "author": "macaarondonald",
        "body": "&gt;LIGMA,  \n&gt;  \n&gt; MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS,   \n&gt;  \n&gt;BALLS\n\nI've YOLO'd most of my money into **LIGMA** and **BALLS.**\n\nI also like\n\n MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613758596,
        "id": "go15ptz",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go15ptz/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1613787396.0
    },
    {
        "author": "callsignGrinch",
        "body": "Post proof of the last $MU position you held or ban!",
        "created_utc": 1612176069,
        "id": "gll2pie",
        "permalink": "/r/wallstreetbets/comments/l9wner/what_are_your_moves_today_february_01_2021/gll2pie/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1612204869.0
    },
    {
        "author": "RAGE_CAKES",
        "body": "Pulled my portfolio from the shadow realm this week after an extensive losing streak. Started off with TSCO calls and played MU mid way through Wednesday, timed VIX calls perfectly and then back to MU. It's good to have some skin in the game again. God damn I love options, can go from broke to being up to being a bag holder again in the course of a week.",
        "created_utc": 1613179079,
        "id": "gn4htr8",
        "permalink": "/r/wallstreetbets/comments/likmpp/weekend_discussion_thread_for_the_weekend_of/gn4htr8/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1613207879.0
    },
    {
        "author": "S_Chaplin",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nEdit: i am not a financial professional...this is financial advice for cats only. I am not a cat",
        "created_utc": 1613761410,
        "id": "go1c3ub",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go1c3ub/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1613790210.0
    },
    {
        "author": "Confusion777",
        "body": "\"&gt;LIGMA,  \n&gt;  \n&gt; MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS,   \n&gt;  \n&gt;BALLS\n\nI've YOLO'd most of my money into **LIGMA** and **BALLS.**\n\nI also like\n\n MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS\" \n\nYo that's a good point",
        "created_utc": 1613759011,
        "id": "go16neu",
        "permalink": "/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/go16neu/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1613787811.0
    },
    {
        "author": "JhoLow_1MDB",
        "body": "How have we not talked about $AMAT, $LRCX, $TSM, $KLAC, $MU, $ASML....?\n\nSemiconductor suppliers are where real quality action is at. Forget penny stock garbage.",
        "created_utc": 1613063887,
        "id": "gmyiw36",
        "permalink": "/r/wallstreetbets/comments/lhifig/daily_discussion_thread_for_february_11_2021/gmyiw36/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1613092687.0
    },
    {
        "author": "rexbee52",
        "body": "? AMD, MU, and NVDA are OG WSB",
        "created_utc": 1613110971,
        "id": "gn16s0y",
        "permalink": "/r/wallstreetbets/comments/lhumfo/what_are_your_moves_tomorrow_february_12_2021/gn16s0y/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1613139771.0
    },
    {
        "author": "Gahvynn",
        "body": "Watch my account go up 20% at open, take profit here and there, buy dips an hour or so later, watch account bleed all day, finish 5-10% down from previous close.\n\nPray for PLTR/MU/MSFT/JPM",
        "created_utc": 1614028008,
        "id": "godu2nf",
        "permalink": "/r/wallstreetbets/comments/lpzquu/what_are_your_moves_tomorrow_february_23_2021/godu2nf/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614056808.0
    },
    {
        "author": "BearyAnal",
        "body": "I'm posting my loss porn today I guess. Tesla, fb,apple,microsoft and mu. Someone here told me it was going to be over last friday and buy up all the dips. Guh",
        "created_utc": 1614016232,
        "id": "god32yv",
        "permalink": "/r/wallstreetbets/comments/lplby9/daily_discussion_thread_for_february_22_2021/god32yv/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614045032.0
    },
    {
        "author": "MojoDohDoh",
        "body": "&gt;I sold off the MU stock\n\nGenerally speaking you want to be staying in something for \\*longer\\* than 1 day of red... buy something you have conviction in, if not toss your money into an S&amp;P500 tracking ETF and don't look at it for 10 yrs",
        "created_utc": 1614035262,
        "id": "goe9yog",
        "permalink": "/r/investing/comments/lpkesg/daily_general_discussion_and_spitballin_thread/goe9yog/",
        "score": 5,
        "subreddit": "investing",
        "created": 1614064062.0
    },
    {
        "author": "anonimalman",
        "body": "AMD and MU had decent DD too if you weeded through all the Subae love posts.\n\nBB long term 🚀",
        "created_utc": 1613166920,
        "id": "gn3uh4e",
        "permalink": "/r/wallstreetbets/comments/likmpp/weekend_discussion_thread_for_the_weekend_of/gn3uh4e/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1613195720.0
    },
    {
        "author": "DestroyerOfPussy69",
        "body": "Lol MU is the OG meme stock",
        "created_utc": 1612166533,
        "id": "glkrsuw",
        "permalink": "/r/wallstreetbets/comments/l9wner/what_are_your_moves_today_february_01_2021/glkrsuw/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1612195333.0
    },
    {
        "author": "callsignGrinch",
        "body": "Post proof of the last $MU position you held or ban!",
        "created_utc": 1612176069,
        "id": "gll2pie",
        "permalink": "/r/wallstreetbets/comments/l9wner/what_are_your_moves_today_february_01_2021/gll2pie/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1612204869.0
    },
    {
        "author": "Corporate_shill78",
        "body": "I know it's sad. I used to mod here back in 2017/18/19 and spend hours a day posting before my son was born in March 2019 and all my free time disappeared and they eventually removed me because I stopped doing anything. My old account was poopDOLLLA. We had 200-300ish thousands users back then and MU was all the rage (RIP marty). It's unfortunate but I don't think WSB is ever going to be the same after this insane growth. Maybe in a year or so after these millions of new people lose interest again",
        "created_utc": 1612189626,
        "id": "gllniha",
        "permalink": "/r/wallstreetbets/comments/la1o04/there_is_no_silver_short_squeeze_happening_none/gllniha/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1612218426.0
    },
    {
        "author": "2010G37x",
        "body": "How do i show you mu purchases",
        "created_utc": 1612199972,
        "id": "glmeng8",
        "permalink": "/r/wallstreetbets/comments/la1om4/bb_when_the_market_opens/glmeng8/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612228772.0
    },
    {
        "author": "Starrsmill13",
        "body": "Is MU a good play long term? I think it’s gonna test 90 at some point soon",
        "created_utc": 1612191918,
        "id": "gllta8u",
        "permalink": "/r/wallstreetbets/comments/la0nb6/unpinned_daily_discussion_thread_for_february_01/gllta8u/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612220718.0
    },
    {
        "author": "StockLesner",
        "body": "Obligatory first play: $MU 90c 2/5",
        "created_utc": 1612200120,
        "id": "glmf176",
        "permalink": "/r/wallstreetbets/comments/la8evj/i_think_its_time_to_do_what_you_retards_say/glmf176/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612228920.0
    },
    {
        "author": "Fawlford",
        "body": "Silly question as i haven't traded in AMD since the $17 mark while having to dodge all the $MU posts, but could it be that downward price movement is mainly tied to recent positive sentiment for $INTL? Could people be pricing in the possible adjustment of intel to better fight AMDs rise?",
        "created_utc": 1612193121,
        "id": "gllwjcm",
        "permalink": "/r/wallstreetbets/comments/la4pt3/incredible_amd_financial_report_that_seemingly/gllwjcm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612221921.0
    },
    {
        "author": "CallsOnAlcoholism",
        "body": "My MU position is on life support.",
        "created_utc": 1612196107,
        "id": "glm4qcx",
        "permalink": "/r/wallstreetbets/comments/la0nb6/unpinned_daily_discussion_thread_for_february_01/glm4qcx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612224907.0
    },
    {
        "author": "HenFreu",
        "body": "&gt;dy fekin Mu\n\nHow? The market isn't even open yet...",
        "created_utc": 1612183803,
        "id": "gllcr1c",
        "permalink": "/r/wallstreetbets/comments/la0n4z/daily_discussion_thread_for_february_01_2021/gllcr1c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612212603.0
    },
    {
        "author": "2DankforU",
        "body": "(Vancouver, British-Columbia) February 1, 2021 - Lomiko Metals Inc. (TSX-V: LMR, OTC: LMRMF, FSE: DH8C) (Lomiko or the “Company”) is pleased to announce it has completed its 100% acquisition of the La Loutre Flake Graphite project with a $ 1,125,000 payment to the vendor Quebec Precious Minerals Corporation.  Transfer of the property rights have commenced and will be completed as soon as possible.\n\nA. Paul Gill, CEO states, “We are at the beginning of an Electric Vehicle (EV) Revolution that will launch a battery materials bull market.  More than 100 Lithium-ion mega-factories will produce Li-ion batteries worldwide.  Lomiko sees an opportunity to supply graphite under a Canada-US agreement on Critical Minerals.”\n\nLomiko looks forward to assessing Preliminary Economic Assessment (PEA) proposals to advance the project.  The development of a strategy that identifies value-added products is necessary to establish a long-term, profitable business model prior to extensive capital outlay and is crucial to the success of the company.   \n\nGraphite Sector Analysis\n\nThe price for 95% C (purity), 15 micron Spherical Graphite is $2,700-2,800 USD/tonne, far above the price of other forms of graphite.  A Preliminary Economic Assessment (PEA) will include costs and the potential market for this key product. The World Bank has identified spherical graphite demand will increase by 500% by 2040 due to Li-ion batteries mega-factories which will be built to supply EVs.  \n\nGraphite electrodes are another long-term market for natural flake graphite.  Graphite conductors which release electric energy in the form of an electric arc, are used to heat and melt the steel scraps in an electric arc furnace. They are currently the only products with high electrical conductivity and can maintain extremely high heat generation in this demanding environment. With the growing demand for quality steel in the aerospace, automotive and electronics industries, graphite electrodes are also becoming increasingly popular.",
        "created_utc": 1612187729,
        "id": "glljjqs",
        "permalink": "/r/pennystocks/comments/la3jkb/lomiko_completes_100_la_loutre_purchase_and_sets/glljjqs/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1612216529.0
    },
    {
        "author": "thismonkeyiscool",
        "body": "You could have spent the money on spy and be up today.  Hold mu bags real quick 😂",
        "created_utc": 1612200123,
        "id": "glmf1ho",
        "permalink": "/r/wallstreetbets/comments/la5s8i/gme_discussion_thread_for_february_01_2021_part_2/glmf1ho/",
        "score": -23,
        "subreddit": "wallstreetbets",
        "created": 1612228923.0
    }
]