[
    {
        "author": "cav5",
        "body": "Wasn't just these two. $AAPL, $TSLA, $RKT, $BB, $NNDM, $NDX, $FCEL, the list goes on. Pretty much all my portfolio had this dip, at the exact same time. I don't know what happened, but someone, somewhere, is kinda fucked, I guess.",
        "created_utc": 1615415348,
        "id": "gqi385w",
        "score": 614,
        "subreddit": "wallstreetbets",
        "created": 1615444148.0
    },
    {
        "author": "Mr_JerryS",
        "body": "$GOEV\n\n1. Undervalued when compared to other EV plays, despite having nearly double the employees and over 3 times as many vehicles set to go into production in the next 3 years.\n\n\n\n\n2. They've only been around since 2018. In that time, they've locked up a manufacturing agreement with magna, secured deal with Hyundai to produce vehicles using their chassis architecture, brought a vehicle from idea to production in just 19 months (average time 4-5 years), and even received a buyout bid from Apple... and had the balls to say no. Lucid, for example has been around since 2006 and has 1 vehicle going into production.\n\n\n\n\n3. The multi-purpose delivery vehicle can reach distances up to 250 mi and will be sold at a starting point of $33,000. The workhorse vehicle for comparison can reach 100 mi and sells at $52,000. It does however have 200 cubic feet more space, but over 400 ft of exterior space making it more difficult to maneuver in a city. The engineering behind Canoos vehicles is simply much better.\n\n\n\n\n4. Their skateboard chassis and their steer by wire technology make up 70% of the vehicle. This means that the cost of production is drastically lower since research and development, testing, and production are already complete on any future vehicle. this will allow them to bring new vehicles into production much quicker than their competitors. This point is validated by their partnership with Hyundai.\n\n\n\n\n5. Don't underestimate the news that Apple sought a takeover bid. Apple could have targeted any EV company in the world, and they chose to go after Canoo. It is the only vehicle truly designed to be ridden in rather than driven. The engineers were clear that they were designing a vehicle to be eventually be fully autonomous.",
        "created_utc": 1614778088,
        "id": "gpj4nzb",
        "score": 372,
        "subreddit": "stocks",
        "created": 1614806888.0
    },
    {
        "author": "Captain_Yolo_",
        "body": "You retards really fucking underestimate the power of holding a stock for months.\n\n\n\nI have had 100 shares of AAPL since August, and have gained a very cool $7.63 😎",
        "created_utc": 1615500223,
        "id": "gqmfyot",
        "score": 197,
        "subreddit": "wallstreetbets",
        "created": 1615529023.0
    },
    {
        "author": "1811pharmx",
        "body": "* First, $AAPL dropped to $140, and we were told this is a must-buy price and we'll never get it again. \n* Then, $AAPL went to $130, and were told this was a steal and it will never go below this price.\n* Next, $AAPL went to $120, and we were told this is black Friday pricing and you would need a room-temperature IQ to think otherwise.\n\n\nAnd now..... Now we're at $116.\n\nFuck",
        "created_utc": 1615237617,
        "id": "gq97gcz",
        "score": 165,
        "subreddit": "wallstreetbets",
        "created": 1615266417.0
    },
    {
        "author": "Acc373828",
        "body": "It’s AAPL bro just buy",
        "created_utc": 1614863948,
        "id": "gpne5o5",
        "score": 164,
        "subreddit": "stocks",
        "created": 1614892748.0
    },
    {
        "author": "codemonkey14",
        "body": "“Ok stay away from meme stocks, just invest in AAPL, a solid, cash flush company with physical products, reasonable P/E, record earnings, and nothing but bright sky’s ahead” \n\nAnnnnnnnnd its down 13%. Fuk",
        "created_utc": 1615237902,
        "id": "gq983o7",
        "score": 119,
        "subreddit": "wallstreetbets",
        "created": 1615266702.0
    },
    {
        "author": "nevetando",
        "body": "Are there some tech stocks that are overvalued? yes. \n\nis all of tech overvalued? no.\n\nBut the whole sector is suffering because of a few. Just take a deep breath and relax. if you own any solid, diversified, mainstay tech (apple, Microsoft, even intel and AMD) you are going to be fine in the long run. \n\nIf you are in emerging tech, new companies, growing companies... well, godspeed. it is going to be bumpy. \n\nHistory favors tech though. but like all things, it goes in and out of favor with the people.",
        "created_utc": 1614881504,
        "id": "gpogfr3",
        "score": 100,
        "subreddit": "stocks",
        "created": 1614910304.0
    },
    {
        "author": "EP40BestInDaLee",
        "body": "I've lost more money on AAPL than I have buying their products.",
        "created_utc": 1615237512,
        "id": "gq977sq",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1615266312.0
    },
    {
        "author": "ThrallDoomhammer",
        "body": "Imagine buying AAPL cause they made $110 billion last quarter to have it tank 20%.  Instead buy a theater company that lost billions to have it go up 10%.",
        "created_utc": 1615416157,
        "id": "gqi4wzd",
        "score": 97,
        "subreddit": "wallstreetbets",
        "created": 1615444957.0
    },
    {
        "author": "Gnome_Village",
        "body": "P/E might be my biggest deciding factor when unsure on a buy. Buying apple around a P/E of 11 a few years ago was one of the best investments I’ve made. It was made solely because I just couldn’t understand why they were so cheap compared to the market.",
        "created_utc": 1614791191,
        "id": "gpjwub8",
        "score": 93,
        "subreddit": "stocks",
        "created": 1614819991.0
    },
    {
        "author": "jay_goff",
        "body": "My apple watch has asked me if im having a heart attack several times today.",
        "created_utc": 1615401745,
        "id": "gqh7mau",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1615430545.0
    },
    {
        "author": "shroomenheimer",
        "body": "\"GME has ruined /r/wallstreetbets\" he typed furiously. In his rage he had broken into a sweat and the wet meaty slap of his fingers against the mechanical keyboard echoed throughout his mother's basement. Fondly he reminisced of the first time he saw a \"guh\" commented in another subreddit. The joy of typing \"/r/wallstreetbets is leaking\" had brought him to near orgasm. Defeated, he typed in /r/investing, desperately looking for someone that cared about his AAPL calls.",
        "created_utc": 1615930579,
        "id": "gr641re",
        "score": 79,
        "subreddit": "wallstreetbets",
        "created": 1615959379.0
    },
    {
        "author": "Soda444",
        "body": "I have AAPL that I’ve held for 20+ years. I put that in GME today.",
        "created_utc": 1615511641,
        "id": "gqn2ezz",
        "score": 79,
        "subreddit": "wallstreetbets",
        "created": 1615540441.0
    },
    {
        "author": "Waffle_Authority",
        "body": "From +$1500 to -$97. God damn you apple.",
        "created_utc": 1615237437,
        "id": "gq971s2",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1615266237.0
    },
    {
        "author": "Bbeatlab",
        "body": "Apple baby!!!! Pickem while they hang low. Hopefully the tech sector recovers a bit by friday. There is so much bullish news surrounding apple, I cant believe it’s lost so much momentum. I guess if there had been worse news we might see $110 levels.\n\nI want to to see $130 by the end of the week, but it’s not looking bright",
        "created_utc": 1614818521,
        "id": "gpll2fv",
        "score": 75,
        "subreddit": "stocks",
        "created": 1614847321.0
    },
    {
        "author": "CallMeAnanda",
        "body": "Buying AAPL leaps at current prices feels like stealing.",
        "created_utc": 1614788453,
        "id": "gpjqe4s",
        "score": 73,
        "subreddit": "stocks",
        "created": 1614817253.0
    },
    {
        "author": "BretMichaelsWig",
        "body": "Gonna be honest with you guys: i sold\n\n\n\n\n\n\n\n\n\n...my apple stock to buy more GME",
        "created_utc": 1615233493,
        "id": "gq8xxso",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1615262293.0
    },
    {
        "author": "LtBillnotLtDan",
        "body": "Let this sink in...Apple closed at around $120 &amp; GME closed around $131....juicy!!!!",
        "created_utc": 1614891883,
        "id": "gpp5cx4",
        "score": 59,
        "subreddit": "wallstreetbets",
        "created": 1614920683.0
    },
    {
        "author": "HeftyButton",
        "body": "Why exactly would it matter that Apple stores and Lucid studios are near each other? If Lucid was going to have a deal with Apple, are they hoping that people will stop in for an ipad and then get referred over for a &gt;$100k car down the road?\n\nIs it perhaps possible that Lucid has spots in high end shopping areas, which are the same places that tend to have Apple stores, along with a dozen other brands?",
        "created_utc": 1614805322,
        "id": "gpktntj",
        "score": 57,
        "subreddit": "SPACs",
        "created": 1614834122.0
    },
    {
        "author": "IITEZiII",
        "body": "Arkf and aapl",
        "created_utc": 1614900644,
        "id": "gppof2l",
        "score": 56,
        "subreddit": "stocks",
        "created": 1614929444.0
    },
    {
        "author": "SinaSyndrome",
        "body": "Cant handle this. My apple watch called 911 for me because of my heart rate and rythym. My bpm was over 230 and was having palpitations. Was genuinely concerned so I told dispatch im just watching the gme ticker and not to worry because my hands are made of fucking diamond.",
        "created_utc": 1615400185,
        "id": "gqh3nca",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1615428985.0
    },
    {
        "author": "coolnasir139",
        "body": "Apple has so much money to buy shares back and so many good things coming you have to be foolish to panic sell Apple. Nice post OP",
        "created_utc": 1614832490,
        "id": "gpmba88",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1614861290.0
    },
    {
        "author": "leafgum",
        "body": "An aapl a day keeps the doctor away",
        "created_utc": 1614867027,
        "id": "gpnjsk5",
        "score": 55,
        "subreddit": "stocks",
        "created": 1614895827.0
    },
    {
        "author": "Chesterumble",
        "body": "The years 2028. Deepfuckingvalue is now the CEO of the largest company in the world.  GameStop enterprises.  He just bought out Amazon and Apple, and is planning the first warehouse on Mars with Elon musk (who is finally looking older). US president Ryan Cohen has sold Alaska to a few GME alumni,  renaming it Apelaska.  There is finally universal peace due to the great nation of Apelaska buying and dismantling all the worlds nuclear weapons. And providing universal marijuana to all nations.  \n\nOh and Jim Cramer was launched into the sun.",
        "created_utc": 1617117861,
        "id": "gst57cx",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1617146661.0
    },
    {
        "author": "Whatevers2011",
        "body": "guess i bought at the peak because my amazon and apple shares are both down 12%",
        "created_utc": 1614881954,
        "id": "gpohiqh",
        "score": 49,
        "subreddit": "stocks",
        "created": 1614910754.0
    },
    {
        "author": "ixvst01",
        "body": "Who are the people out there actually selling their AAPL and MSFT shares (and techs in general) to buy bonds that went up by .5% in yield? Wall Street is just looking excuses to take profits.",
        "created_utc": 1614791840,
        "id": "gpjyd1x",
        "score": 49,
        "subreddit": "stocks",
        "created": 1614820640.0
    },
    {
        "author": "je_veux_sentir",
        "body": "Insanely undervalued now. \n\nApple is a solid company with probably the best balance sheets you’ll find. It’s hard to go wrong if you are in it for the long term. \n\nThat being said. Don’t expect to double your money each year. Apple will do well, and probably will beat the market, but it isnt going to double each year.",
        "created_utc": 1614864656,
        "id": "gpnfd6n",
        "score": 46,
        "subreddit": "stocks",
        "created": 1614893456.0
    },
    {
        "author": "RandomlyGenerateIt",
        "body": "That better be true, because I bought a bunch of AAPL/AMD/NVDA on margin on that first \"dip\", and now it doesn't feel so much like \"free money\" anymore...",
        "created_utc": 1614811378,
        "id": "gpl776l",
        "score": 46,
        "subreddit": "stocks",
        "created": 1614840178.0
    },
    {
        "author": "YOLOQuant",
        "body": "On speculative tech stocks which promise positive cash flows far into the future. The frothier stocks might go even lower. TSLA for example has already had a 25% drop and I think more is on the table. Growth stocks with solid cash flows (AAPL) likely bottoms out around 10-15%. Value stocks will continue to edge higher.\n\nMy base case for the S+P is around 10-15% from ATH.",
        "created_utc": 1614900149,
        "id": "gppnfi3",
        "score": 45,
        "subreddit": "investing",
        "created": 1614928949.0
    },
    {
        "author": "mnpeanut",
        "body": "Added some AAPL yesterday but stayed on the sidelines today.",
        "created_utc": 1614900584,
        "id": "gppoant",
        "score": 45,
        "subreddit": "stocks",
        "created": 1614929384.0
    },
    {
        "author": "SudoRmRfRs",
        "body": "Apple user here, I prefer Spotify over Apple Music / iTunes anytime",
        "created_utc": 1615319193,
        "id": "gqd5i2n",
        "score": 44,
        "subreddit": "investing",
        "created": 1615347993.0
    },
    {
        "author": "ph0xer",
        "body": "Hmmm. I always hear about people who bought Apple, msft, or tsla 10 years ago and are now millionaires.\n\n&amp;#x200B;\n\nI think i'll be one of the first to say i bought those 2 months ago and now im bankrupt.",
        "created_utc": 1614735017,
        "id": "gphg66u",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1614763817.0
    },
    {
        "author": "iFANTASYFOOTBALL",
        "body": "my daily gain just moved from +$15,000 to $-9000, i ate an apple. nbd.",
        "created_utc": 1615399483,
        "id": "gqh1sr3",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1615428283.0
    },
    {
        "author": "bufferoverflo",
        "body": "Here's my DD:\n\nOnce Apple starts going up again, we know that it was the bottom. The play after that is Levis.\n\nApple bottom -&gt; Jeans.",
        "created_utc": 1615258641,
        "id": "gqacc8d",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1615287441.0
    },
    {
        "author": "Sweetbone",
        "body": "Apple News reporting that 295.50 was the high for the entire day without this day being over yet. Let’s prove them wrong!",
        "created_utc": 1615570636,
        "id": "gqpmpoh",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1615599436.0
    },
    {
        "author": "shintaro_the_doggo",
        "body": "When I was in middle school, my friend and I were in an extracurricular activity where we played a virtual \"stock market\" game over the course of the year with 100,00 virtual dollars, competing with kids across the state. We were supposed to take the class time (something like an hour after school each week) to research stocks, invest in companies that seemed promising, etc.\n\nMy buddy and I YOLO'd the entire 100k into Apple so we could just fuck around and play video games on the internet instead of actually doing research and working. At the end of the competition period we had made more money than any other kids in the state, came in 1st in the competition, and went to the capitol to get an award.",
        "created_utc": 1615493693,
        "id": "gqm1auq",
        "score": 39,
        "subreddit": "stocks",
        "created": 1615522493.0
    },
    {
        "author": "AutoModerator",
        "body": "#It's AAPL you moran!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
        "created_utc": 1615870267,
        "id": "gr3bpei",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1615899067.0
    },
    {
        "author": "modsarefailures",
        "body": "AAPL dropped 1.50 on Wednesday. You know how many people panicked?  Fucking zero. \n\nIf you believe - and you do or you wouldn’t be here - go rub one out to the fact that we’re up ***$110*** on the week. \n\nIt was never gonna rise at an 80° angle in perpetuity. \n\nHold tight and shut up",
        "created_utc": 1615496860,
        "id": "gqm8gdu",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1615525660.0
    },
    {
        "author": "suphater",
        "body": "I think if aapl falls much further than 120 we are in for a real bad March. I got two aapl today.",
        "created_utc": 1614864961,
        "id": "gpnfwvx",
        "score": 37,
        "subreddit": "stocks",
        "created": 1614893761.0
    },
    {
        "author": "ComfortMailbox",
        "body": "I just sold Apple to buy more GME @ 289. This better to to 300 today i beg.",
        "created_utc": 1615392032,
        "id": "gqghsrf",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1615420832.0
    },
    {
        "author": "wiarumas",
        "body": "Today was the equivalent of buying and holding Apple for 6 months.  No worries.",
        "created_utc": 1615582972,
        "id": "gqqdlmn",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1615611772.0
    },
    {
        "author": "ChefStamos",
        "body": "The year is 2030.  Amazon is owned by Gamestop.  Apple is owned by Gamestop.  Ryan Cohen is the president of the US, Keith Gill is chief justice of the supreme court, USD are worthless and gamestop shares are the dominant global currency.  In schools they require students to take a course on gamestopology to graduate.  The entire field of economics and finance have thrown up their hands and gone home.  Life is good.",
        "created_utc": 1615310373,
        "id": "gqcm2nt",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1615339173.0
    },
    {
        "author": "fannypackbuttsnack",
        "body": "This week will see a massive tech rally, and AAPL will close the week out a whopping -0.06%.",
        "created_utc": 1615759655,
        "id": "gqy8nkj",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1615788455.0
    },
    {
        "author": "xbaassassin",
        "body": "Tesla has become the same as Apple. Fans jizz over any little new thing which will probably keep the stonks fairly high.",
        "created_utc": 1614896960,
        "id": "gppgtns",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1614925760.0
    },
    {
        "author": "apolloanthony",
        "body": "GME is currently worth more than AAPL 😂😂🌙",
        "created_utc": 1614883069,
        "id": "gpok6n6",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1614911869.0
    },
    {
        "author": "AutoModerator",
        "body": "#It's AAPL you moran!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
        "created_utc": 1615945920,
        "id": "gr6y1tr",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1615974720.0
    },
    {
        "author": "DoesntUnderstandJoke",
        "body": "AAPL gang where you at?? 💰📈📈🚀 🍎",
        "created_utc": 1615846773,
        "id": "gr283kp",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1615875573.0
    },
    {
        "author": "TheOriginalRK",
        "body": "This market has made me completely depressed. Was up so much on tech and renewable stocks and just didn’t take profit. Maxed out my margin and kept throwing everything I had trying to get rich. Now it’s down 60% and I legit don’t have any hope. I could of out all that money into a safe etf or apple and just sat and enjoyed my life. I really fucked up and really don’t know how I’m going to get over this feeling. I failed my family and myself hugely but being a greedy idiot",
        "created_utc": 1615240148,
        "id": "gq9d58u",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1615268948.0
    },
    {
        "author": "zerozeronada",
        "body": "PLTR, ARKF, AAPL. I picked all the winners!",
        "created_utc": 1615237702,
        "id": "gq97n6e",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1615266502.0
    },
    {
        "author": "jbawgs",
        "body": "#holy shit did you see AAPL jump 1¢",
        "created_utc": 1615493648,
        "id": "gqm178w",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1615522448.0
    },
    {
        "author": "gn0mak",
        "body": "It's like watching two guys trade an apple back and forth, asking for less each time they do, while a third guy with the receipt for it jerks off on the side and flings poop at them.",
        "created_utc": 1617124628,
        "id": "gstkdic",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1617153428.0
    },
    {
        "author": "Wet_Bubble_Fart",
        "body": "ARKk  ARKG, apple, zsan and thinking about quadrupling DMTK",
        "created_utc": 1614901104,
        "id": "gpppc36",
        "score": 32,
        "subreddit": "stocks",
        "created": 1614929904.0
    },
    {
        "author": "19jdog",
        "body": "Apple fucking rise you old slut",
        "created_utc": 1615414848,
        "id": "gqi25y1",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1615443648.0
    },
    {
        "author": "Jaycray95",
        "body": "Yep Apple is the way. That company knows how to make money, I don’t think people have grasped the fact that the richest company on the planet is gonna be making an EV.",
        "created_utc": 1614789529,
        "id": "gpjswn3",
        "score": 31,
        "subreddit": "stocks",
        "created": 1614818329.0
    },
    {
        "author": "TheRumpletiltskin",
        "body": "$GME poised to be worth more per share than $AAPL. \n\nlove to see it.",
        "created_utc": 1614871135,
        "id": "gpnsfwc",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1614899935.0
    },
    {
        "author": "GGEuroHEADSHOT",
        "body": "Apple: Correct me if I’m wrong but...\n\nMarket: Ok",
        "created_utc": 1615420932,
        "id": "gqiecxq",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1615449732.0
    },
    {
        "author": "huvva",
        "body": "GME stock now worth more than AAPL. What a time to be alive",
        "created_utc": 1614884494,
        "id": "gponl9s",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614913294.0
    },
    {
        "author": "madmax299",
        "body": "Epic retardedness: selling all of my apple to fomo into GME on the absolute bottom of that dip.",
        "created_utc": 1615400378,
        "id": "gqh4567",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1615429178.0
    },
    {
        "author": "sirdrumalot",
        "body": "Just sold off AAPL and DIS, the last of my big holds, to put another $5k in GME. I’ll be averaging up my 10 shares @174, but now holding 25 shares!",
        "created_utc": 1615574843,
        "id": "gqpw3xr",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1615603643.0
    },
    {
        "author": "blackpods",
        "body": "I'll cry for you tonight apple will fuck you",
        "created_utc": 1615504862,
        "id": "gqmph0t",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1615533662.0
    },
    {
        "author": "dbgtboi",
        "body": "The fact that Boeing, a company that sells airplanes which have a tendency to cliffdive into mountains, is outperforming AAPL lately, shows you how much big fuk this market is",
        "created_utc": 1615247324,
        "id": "gq9rl3m",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1615276124.0
    },
    {
        "author": "calm_incense",
        "body": "Why is Apple doing so badly when their product line has basically never been better?\n\nIn the computer world, everyone is raving about how incredible their new M1 chip is, and how future Macs are going to be even more amazing. And yet you wouldn't know it by looking at AAPL's performance since August.",
        "created_utc": 1614743201,
        "id": "gphw0jf",
        "score": 29,
        "subreddit": "investing",
        "created": 1614772001.0
    },
    {
        "author": "NoDrinksBefore12",
        "body": "Can't wait for AAPL to erase all of today's gains tomorrow",
        "created_utc": 1617225953,
        "id": "gsykxa7",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1617254753.0
    },
    {
        "author": "ClaidArremer",
        "body": "I was up $650 with Tesla before it dipped hard. Same with Apple. Now I've sold my shares at a loss to buy more GME.",
        "created_utc": 1615224270,
        "id": "gq8c638",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1615253070.0
    },
    {
        "author": "diliberto123",
        "body": "#GME you’re boring me with these %, what is this? Apple?",
        "created_utc": 1615479146,
        "id": "gql3pl8",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1615507946.0
    },
    {
        "author": "Einhander_pilot",
        "body": "I sold my PLTR and MSFT because I’ll only lose buying power and my funds will be a lot safer in GME. AAPL might be next.",
        "created_utc": 1615834637,
        "id": "gr1k2ik",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1615863437.0
    },
    {
        "author": "Silverjax",
        "body": "Sold my Apple stocks to buy more GME!! Let's go boys🚀🚀",
        "created_utc": 1614712585,
        "id": "gpg415d",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614741385.0
    },
    {
        "author": "chewks",
        "body": "brah, im a huge bull on aapl, and i keep telling myself this is the end of the dip... but it never stops dipping... so fuck it!!! aapl 110 by EOW!",
        "created_utc": 1615237936,
        "id": "gq986fk",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1615266736.0
    },
    {
        "author": "boopinhi",
        "body": "I feel like they've got to dump a ton of shares on the market in the next few days... The HF's can't be out of ammo. It's been moving consistently upward by big percentages day over day. \n\nCould they really be running out of Ammo and waiting until Friday close to do any dumping?\n\nThis movement isn't really volatile it's only been in one direction and that is eerie to me. Maybe this is what it normally feels like to be an AAPL holder.... haha  \n\nI held through 40 so I'm not scared it's just eerie.",
        "created_utc": 1615335153,
        "id": "gqe3jes",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1615363953.0
    },
    {
        "author": "SinghInNYC",
        "body": "Alright AAPL, you can get up now. We all know you're faking it.",
        "created_utc": 1615226730,
        "id": "gq8i77c",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1615255530.0
    },
    {
        "author": "LusoAustralian",
        "body": "I let my mates convince me to put a stop at 200 which triggered while I was asleep. It was only on 2 shares I bought at 120. To amend for being a bitch I sold my TSLA and AAPL and put 2k into GME. Let's do this.",
        "created_utc": 1615405803,
        "id": "gqhhe8s",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1615434603.0
    },
    {
        "author": "dantoucan",
        "body": "You're going to want to put as much as you can into Apple before they start building cars. That's my logic. They built computers, then mp3 players, then phones, and in the future, cars. What could go wrong? lol.",
        "created_utc": 1614867218,
        "id": "gpnk5ql",
        "score": 27,
        "subreddit": "stocks",
        "created": 1614896018.0
    },
    {
        "author": "Day2205",
        "body": "why sell a solid stock like AAPL at a loss? it's going to go back up again. the other reply had it right, average down and sell out on the way back up. one's portfolio is hardly ever perfectly balanced, nothing wrong with a position being overweight temporarily if it makes cents 😉",
        "created_utc": 1614808753,
        "id": "gpl1iot",
        "score": 27,
        "subreddit": "stocks",
        "created": 1614837553.0
    },
    {
        "author": "voneahhh",
        "body": "It’s so sad that Apple is going out of business. 😔\n\nPour one out for the homie and be sure to sell all your shares right now",
        "created_utc": 1615235271,
        "id": "gq921e9",
        "score": 27,
        "subreddit": "stocks",
        "created": 1615264071.0
    },
    {
        "author": "rs6866",
        "body": "Here's a great example: TSLA.\n\nI think tsla is a great company and is going to grow and gain market share.  It has a reasonable chance of entirely dominating the EV space for years to come.\n\nPE &gt; 1000.  Yeah, but no.  Other mega cap tech names like MSFT or AAPL are around 30.  AMZN is 75.  TSLA needs to fall ~97% to achieve fair value.  Even if they grow 10x in the next 2-3 years (doubtful they can get there), they'd need to fall 30%.  Stay the hell away.",
        "created_utc": 1614894457,
        "id": "gppbadn",
        "score": 27,
        "subreddit": "stocks",
        "created": 1614923257.0
    },
    {
        "author": "shepdaddy",
        "body": "Got a high heart rate alert on my Apple Watch during the nuke. Now I’m pissed off. Still not going anywhere. 💎💎💎",
        "created_utc": 1615404456,
        "id": "gqhe7zi",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1615433256.0
    },
    {
        "author": "TheOriginalRK",
        "body": "I was doing so god damn well, my long term stock portfolio was flying with ev , solar and spac plays. Now I’m down 40% almost $200k in 2 weeks and I honestly feel depressed. I’ve never felt like this or imagined just losing this much money this fast. I don’t even know what to do just get out of Everything and take my cash for now or just hold these stocks for years. Top positions LUCID, AAPL, ENPH , NIO, SQ, Plug. I’ve felt like such garbage last 2 weeks while just seeing everything I worked for just fade and fade. Literally just feel helpless seeing that much money vanish this fast. I really fucked up",
        "created_utc": 1614811575,
        "id": "gpl7m4k",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614840375.0
    },
    {
        "author": "Aclrian",
        "body": "Just sold apple, buying more at this discount. I just love this stock.",
        "created_utc": 1615565247,
        "id": "gqpakzg",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1615594047.0
    },
    {
        "author": "youarenotalone2",
        "body": "People who write APPL instead of AAPL deserve to lose money on it.",
        "created_utc": 1617033605,
        "id": "gsp73v0",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1617062405.0
    },
    {
        "author": "TheMariannWilliamson",
        "body": "That's pretty normal for a hedge fund. It's not Apple, these guys are gambling with billions",
        "created_utc": 1615848226,
        "id": "gr2adqf",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1615877026.0
    },
    {
        "author": "Caranthiir",
        "body": "Why is AAPL going down so much?",
        "created_utc": 1614813668,
        "id": "gplbwun",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1614842468.0
    },
    {
        "author": "repoman147",
        "body": "Sold my AAPL at a loss, to ape back in to GME",
        "created_utc": 1615307419,
        "id": "gqcefv9",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1615336219.0
    },
    {
        "author": "JiggazInParis",
        "body": "$AAPL to $125 would be nice",
        "created_utc": 1617134619,
        "id": "gsu6jpt",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1617163419.0
    },
    {
        "author": "FuzzyFox1",
        "body": "I’ve gone deep into AAPL to try and prevent further loss. Closed a few other positions to do so that were either green or no less than 10% red.",
        "created_utc": 1614878907,
        "id": "gpoabvh",
        "score": 26,
        "subreddit": "stocks",
        "created": 1614907707.0
    },
    {
        "author": "lohith15",
        "body": "Apple has a new product - to cure insomnia \n\nIt is their stock .",
        "created_utc": 1617222652,
        "id": "gsydubu",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1617251452.0
    },
    {
        "author": "jbawgs",
        "body": "AAPL $143 EOW finna be my time",
        "created_utc": 1615861804,
        "id": "gr2xwpu",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1615890604.0
    },
    {
        "author": "Mcchickenborn",
        "body": "I bought some shares once I heard the talks with apple. It just seems common sense that this “skate” technology is the way forward. Cheaper modular cars. It will be like buying a more expensive iPhone every year or two. Incredibly undervalued company.",
        "created_utc": 1614781569,
        "id": "gpjb5tq",
        "score": 25,
        "subreddit": "stocks",
        "created": 1614810369.0
    },
    {
        "author": "GoddardsPlumber",
        "body": "Bro take a deep breath and crack a beer or go on a walk or something. I'm blown away at the amount of people on this sub who have gotten themselves in so deep that they can't even believe in a complex world full of unrelated chaos anymore. When someone gets run over texting on a Pixel in a crosswalk do you think it's AAPL trying to spread FUD to drop GOOGL prices? This shit is way bigger than some scary looking bald dude in an underwater cave pulling levers to raise and drop all stocks in unison. \n\nThat having been said, holding my 60 GME @ $118.02 till I can retire on them...just not going to get too Heaven's Gate with them. 🍻🚀",
        "created_utc": 1614762088,
        "id": "gpilewd",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1614790888.0
    },
    {
        "author": "Whole-Ad-7659",
        "body": "I have a mix of options, warrants and commons. Pretty much all of my long term holds are in tech. Probably my biggest problem is timing. Right around the time chamath da with sofi I decided I wanted more spacs so I used pretty much all my reserves to buy more spacs. Then after the first big drop I saw it as an “opportunity” so I sold some commons in exchange for warrants. Well pretty much all those warrants are down 30%-60% since I bought them on the “dip”. \n\nAnd that is how you lose a years worth of gains in 2 weeks. And that’s really saying something because my portfolio has been propped up big time from Tesla, nio, apple and arkk over the last year. Live and learn I guess",
        "created_utc": 1614877613,
        "id": "gpo7bom",
        "score": 25,
        "subreddit": "SPACs",
        "created": 1614906413.0
    },
    {
        "author": "StarryNight321",
        "body": "Hey, it's good news, you know what that means? \n\nAAPL stock will be at a discount tomorrow.",
        "created_utc": 1615414736,
        "id": "gqi1x9x",
        "score": 25,
        "subreddit": "stocks",
        "created": 1615443536.0
    },
    {
        "author": "No-Pay3755",
        "body": "What are you holding? In the long run stonks go up. I’ve had plenty of companies that I wish I held on to but sold for small gains. NVDA at $9 that I sold in the $20’s 200 shares of AMD that I couldn’t wait to unload at $5.25 only to see it rip. 365 shares of AAPL at $65 that split many times since I sold it. I would have had 10,000+ shares by now but I sold at $85. I would have done better if I didn’t login at all sometimes. Hang tight. They will turn around. If you have to sell, just sell enough so you can sleep at night.",
        "created_utc": 1614802064,
        "id": "gpkm4mo",
        "score": 25,
        "subreddit": "stocks",
        "created": 1614830864.0
    },
    {
        "author": "Imadethisuponthespot",
        "body": "This is just evidence that you don’t understand why you’re incorrect. There is no “opposite” in something like a stock market. \n\nThat would be like trying to find the opposite of apple pie.",
        "created_utc": 1614714112,
        "id": "gpg7l6b",
        "score": 24,
        "subreddit": "stocks",
        "created": 1614742912.0
    },
    {
        "author": "Romanian_",
        "body": "how the fuck is Apple down 4% are you serious, Tim 🍏explain.",
        "created_utc": 1615246448,
        "id": "gq9pwwr",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1615275248.0
    },
    {
        "author": "GSofMind",
        "body": "Tim Cook wants his own legacy defining endeavor. He wants his Apple Kart.",
        "created_utc": 1614876551,
        "id": "gpo4v0o",
        "score": 24,
        "subreddit": "stocks",
        "created": 1614905351.0
    },
    {
        "author": "AMARIS86",
        "body": "Did you not see Apple plummet on their last earnings call? Throughout the call I kept hearing, record breaking numbers, blah blah. Then it sinks",
        "created_utc": 1615840531,
        "id": "gr1xeui",
        "score": 24,
        "subreddit": "options",
        "created": 1615869331.0
    },
    {
        "author": "Logano1553",
        "body": "Man they really like scare tactics. I just sold tsla and apple to put in gme when this gets as low as it will. More rocket fuel! 🚀",
        "created_utc": 1615398060,
        "id": "gqgxl1b",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1615426860.0
    },
    {
        "author": "howtoliveonearth",
        "body": "AAPL delisted EOD",
        "created_utc": 1615220816,
        "id": "gq83wy7",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1615249616.0
    },
    {
        "author": "AutoModerator",
        "body": "#It's AAPL you moran!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
        "created_utc": 1615870366,
        "id": "gr3bu17",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1615899166.0
    },
    {
        "author": "GirthIgnorer",
        "body": "Bro once people find out about this Apple company it’s gonna moon. They make cell phones",
        "created_utc": 1615916217,
        "id": "gr58fyx",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1615945017.0
    },
    {
        "author": "Dave_Tribbiani",
        "body": "Apple is literally sitting at a 2T valuation and the comments here make it seem like it's going bankrupt lmao",
        "created_utc": 1615225884,
        "id": "gq8g7jh",
        "score": 23,
        "subreddit": "stocks",
        "created": 1615254684.0
    }
]