[
    {
        "author": "Linkomies",
        "body": "I don't know about any of you guys, but just today I sent my employer the keys to my workplace among with a written letter of resignation.\n\nIn February GameStop gave me fuck you-money. I still have a stake in the company, although cashed some profits along the way.\n\nOur memes made my dreams.\nI will go pursue the rest of my physics degree with what you gave me.\n\nAlso I will buy more nintendo-gift cards for my little brother, preferably from GameStop as always.\n\nI can't imagine the world being a worse place with one more science degree and lots of Fortnite skins.\n\nGod speed fellow retards, to Andromeda and beyond",
        "created_utc": 1615478529,
        "id": "gql2cbo",
        "permalink": "/r/wallstreetbets/comments/m2q39b/gme_megathread_for_march_11_2021/gql2cbo/",
        "score": 102,
        "subreddit": "wallstreetbets",
        "created": 1615507329.0
    },
    {
        "author": "theamazingcalculator",
        "body": "not to get anyone excited about dates or anything but....\n\nApril 16th was the date that Shorts expected GME to be bankrupted thus clearing all of their shorts and giving them the keys to the castle so to speak for free.\n\nIts looking good for the apes.\n\nhmmm.....",
        "created_utc": 1617052572,
        "id": "gsqclb5",
        "permalink": "/r/wallstreetbets/comments/mfoivk/gme_megathread_for_march_29_2021/gsqclb5/",
        "score": 59,
        "subreddit": "wallstreetbets",
        "created": 1617081372.0
    },
    {
        "author": "DeathN0va",
        "body": "I'll never forget my first real vacation. There I was, a kid of 11 from the New York Snow Belt, basking in the warm sun of the Florida Keys. \n\n\nOn my last day there, I went to the juice bar outside out hotel, on the beach. While I was waiting for my fresh tropical juice smoothie, I overheard two men talking. \n\n\n\"Geez, Bill. That Conga line really took it out of me!\" Said one of the men, clean shaven except a bristly mustache above his lip. \n\n\n\"I know, Ted. My legs are on fire! I haven't danced like that since college! Let's hurry up and get back there!\"\n\n\nThe men, both wearing neon swim trunks, raced off over a sand dune and out of sight. \n\n\nI loved dancing! Tropical line dancing sounded so amazing to do right now! I grabbed my drink and sped off over the sand dune towards the sound of music. \n\n\nI followed the music into a secluded opening in a patch of palm trees and undergrowth. There, to my horror, was thirty men in a circle, each fucking the ass of the man in front of him while simultaneously being fucked from behind. \n\n\nMany years later I heard this is sometimes called a \"daisy chain\", or a \"gay Conga line\". \n\n\nIt's the second gayest thing I've ever seen, next to Jim Cramer.",
        "created_utc": 1615568270,
        "id": "gqphe3j",
        "permalink": "/r/wallstreetbets/comments/m3hkjf/gme_megathread_for_march_12_2021/gqphe3j/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1615597070.0
    },
    {
        "author": "EmperorTrashPlanet",
        "body": "So glad we gave these guys keys to the market, they seem super swell.",
        "created_utc": 1615927119,
        "id": "gr5wl6l",
        "permalink": "/r/wallstreetbets/comments/m6iptw/citadel_regulatory_breaches_know_thy_enemy_dd/gr5wl6l/",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1615955919.0
    },
    {
        "author": "Rpark444",
        "body": "No one is gonna give retail the keys to the house.",
        "created_utc": 1614883346,
        "id": "gpokufk",
        "permalink": "/r/wallstreetbets/comments/lxr40r/how_wsb_will_become_melvins_strongest_weapon/gpokufk/",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1614912146.0
    },
    {
        "author": "siuado",
        "body": "Glad I’m on vacation this week. Wife: “we’re in the Keys, let’s do something fun” Me: “I am!”",
        "created_utc": 1615478154,
        "id": "gql1ib3",
        "permalink": "/r/wallstreetbets/comments/m2q39b/gme_megathread_for_march_11_2021/gql1ib3/",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1615506954.0
    },
    {
        "author": "MaxKlootzak",
        "body": "Jim Cramer forgets his car keys on purpose so he can walk back in to stores and say \"Guess I'm not going anywhere without these!\"",
        "created_utc": 1615943483,
        "id": "gr6ti1q",
        "permalink": "/r/wallstreetbets/comments/m67ywm/gme_megathread_for_march_16_2021/gr6ti1q/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1615972283.0
    },
    {
        "author": "2ezyo",
        "body": "Y’all have any spare F5 keys layout around? Completely burned through mine.",
        "created_utc": 1615340938,
        "id": "gqeef8d",
        "permalink": "/r/wallstreetbets/comments/m16emz/gme_megathread_for_march_09_2021/gqeef8d/",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1615369738.0
    },
    {
        "author": "willy-fistergash08",
        "body": "Things we should keep in mind today:\n\n\n•\t⁠There is no way to predict when the squeeze will happen\n\t⁠•\t⁠There will be crazy price action in both directions\n\t⁠•\t⁠This can go on as long as the shorts remain solvent\n\t⁠•\t⁠The longer they drag this out, the higher it goes\n\t⁠•\t⁠People might say, \"Lift-Off in 10!\" But they're just excited\n\t⁠•\t⁠Nobody knows when it'll happen or how high it will go\n\nBasically, don't believe the hype, but feel free to join in. You should do your own research, read the DD, and make informed decisions. Don't invest money you can't afford to lose.\n\nIn other words, fuck safely, or you'll get fucked.\n\n•\t⁠There is no \"we.\"\n\t⁠•\t⁠I'm holding because that's my choice. I believe in GME\n\t⁠•\t⁠I will not buy because someone else says to do so\n\t⁠•\t⁠I will not encourage others to buy\n\t⁠•\t⁠Nothing I say is financial advice\n\t⁠•\t⁠If you're confused, read the rules. No market manipulation.\n\nReport posts that encourage everyone to buy at the same time. The primary reason for this is legal, but the secondary is that the media will cherry-pick comments like this to give us a bad name and put more negativity out there through their articles, broadcasts, etc.\n\n•\t⁠There will be plenty of FUD (or \"fear, uncertainty, and doubt\")\n\t⁠•\t⁠I am including this out of belief, if not pure spite\n\t⁠•\t⁠There are redditors being paid to scare you\n\t⁠•\t⁠There are bots made to SPAM negativity\n\t⁠•\t⁠There are people profiting when you sell\n\t⁠•\t⁠This starts ramping up in the afternoon\n\nThere are two sides to this fight, and we have to remember that there are people profiting if we fail. There are people playing the other side who will come into the thread and try to throw us off track by ruining the morale. We mustn't give in to them. Besides, they can't even provide any good DD for their bear-case, it's all just \"sElL iT's OvEr.\"\n\n•\t⁠This is the motherfucking GME Megathread\n\t⁠•\t⁠Do not push other tickers\n\t⁠•\t⁠Do not jingle keys in our faces\n\t⁠•\t⁠Fuck you\n\nI, personally, go out of my way to CTRL/CMD+F and search for other tickers. If you're bringing up non-GME stocks in order to distract the thread, I'm one of the downvotes on your comment. Sue me.\n\n•\t⁠We can fucking do this\n\t⁠•\t⁠We have them where we want them\n\t⁠•\t⁠We can name our price\n\t⁠•\t⁠As long as we hold, we have what they want\n\t⁠•\t⁠They will pay out the ass to get it\n\nThey'll do whatever they can (manipulate the market, short the stock further, short EFTs, etc.) for as long as they can manage, all hoping we'll give up and sell (Hell, they've even tried to bore us to death). But they don't understand just how dumb we really are. We are far too stupid to be afraid of their fearmongering, and we'll hold 'til the moon.\n\n•\t⁠If you're new, this may not be for you\n\t⁠•\t⁠This is something you have to be really brave or really stupid for\n\t⁠•\t⁠You will either see enormous gains or enormous losses\n\t⁠•\t⁠Invest wisely, don't spend your rent money, and read the DD\n\t⁠•\t⁠Read the DD\n\t⁠•\t⁠Read the DD\n\t⁠•\t⁠DD is short for Due Diligence, and it's basically just researching a stock before you buy in. There's plenty of great DD on this sub, and you can sort by the DD flair to see the highest-voted posts. Do that before asking dumb questions and risking your karma.\n\nIf you think there's anything else I should add, please reply and tell me.",
        "created_utc": 1614701394,
        "id": "gpfe7vq",
        "permalink": "/r/wallstreetbets/comments/lw4qgi/fuck_it_heres_your_daily_gme_threadmegathread_3221/gpfe7vq/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614730194.0
    },
    {
        "author": "Finneagan",
        "body": "This must be how dogs feel when they hear your keys jingling outside the front door....",
        "created_utc": 1615579276,
        "id": "gqq5pju",
        "permalink": "/r/wallstreetbets/comments/m3hkjf/gme_megathread_for_march_12_2021/gqq5pju/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1615608076.0
    },
    {
        "author": "XNoob_SmokeX",
        "body": "I'm not even scared anymore. Everyone saying the squeeze was squoze but can't explain the jump in price. Everyone in their mother dangling silver, weed stocks and RKT in front of us like keys. At this point it could drop back down to 40 or even lower and I still wouldn't be scared.",
        "created_utc": 1614888811,
        "id": "gpoy1di",
        "permalink": "/r/wallstreetbets/comments/lxkint/gme_megathread_for_march_04_2021/gpoy1di/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1614917611.0
    },
    {
        "author": "orcula",
        "body": "Hedge Fund meetings 2022: \"Remember the time we tricked the apes waiting for GME to rocket to the moon by distracting them with a stock called rocket AHAHAHAHAHAHA\".   \n\n\nPeople are literally being distracted by a boomer shaking toy keys in front of your face while they put the lambo keys in their pocket",
        "created_utc": 1614789613,
        "id": "gpjt3tu",
        "permalink": "/r/wallstreetbets/comments/lwtejk/gme_megathread_for_march_3rd_2021/gpjt3tu/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1614818413.0
    },
    {
        "author": "TheMallard1",
        "body": "Goddamn it I lost my fucking boat keys. Think I left them on my bumper and drove off, oh and lost the spare too. Pure retard.",
        "created_utc": 1615520953,
        "id": "gqnju43",
        "permalink": "/r/wallstreetbets/comments/m30mij/what_are_your_moves_tomorrow_march_12_2021/gqnju43/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1615549753.0
    },
    {
        "author": "WillSmiff",
        "body": "I'm in this mom &amp; pop hardware store. Buddy in front of me pulled up in a Lambo and is currently bargaining on the 2x $4 keys he's having copied. Better not be one of you retards.",
        "created_utc": 1617128049,
        "id": "gstrzi2",
        "permalink": "/r/wallstreetbets/comments/mgewny/gme_megathread_for_march_30_2021/gstrzi2/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1617156849.0
    },
    {
        "author": "shemppp",
        "body": "If you ever drop your keys into a river of molten lava, let 'em go, because man, they're gone.",
        "created_utc": 1617043597,
        "id": "gspt5cq",
        "permalink": "/r/wallstreetbets/comments/mfoivk/gme_megathread_for_march_29_2021/gspt5cq/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1617072397.0
    },
    {
        "author": "_sarahhhhhhh",
        "body": "This is basically like when your ex keys your car",
        "created_utc": 1615399954,
        "id": "gqh30zp",
        "permalink": "/r/wallstreetbets/comments/m237es/gme_megathread_part_2_for_march_10_2021/gqh30zp/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615428754.0
    },
    {
        "author": "cursed-blackie",
        "body": "200 new floor baby lessgoooo\n\nW keys all round",
        "created_utc": 1615225233,
        "id": "gq8ek0d",
        "permalink": "/r/wallstreetbets/comments/m0fpgd/gme_megathread_for_march_08_2021/gq8ek0d/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615254033.0
    },
    {
        "author": "RonnyCC",
        "body": "#Maybe we just forgot the keys to the rocket ?",
        "created_utc": 1617136798,
        "id": "gsuba3o",
        "permalink": "/r/wallstreetbets/comments/mgewny/gme_megathread_for_march_30_2021/gsuba3o/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1617165598.0
    },
    {
        "author": "xXmurderpigeonXx",
        "body": "Read about Ryan Cohen's vision and execution at his former company Chewy. His focus on the player and creating an attractive, fun and easy to use e-commerce platform will be the keys to long term gme success imo",
        "created_utc": 1614817764,
        "id": "gpljvph",
        "permalink": "/r/wallstreetbets/comments/lx5yjb/gmes_future_steamkiller/gpljvph/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614846564.0
    },
    {
        "author": "Sopater_",
        "body": "Jim Cramer puts his keys under the welcome mat.",
        "created_utc": 1617114898,
        "id": "gssyre4",
        "permalink": "/r/wallstreetbets/comments/mgewny/gme_megathread_for_march_30_2021/gssyre4/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1617143698.0
    },
    {
        "author": "the_oogie_boogie_man",
        "body": "SEC handed them the fucking keys and said \"have fun\" \n\nThey don't drive this car",
        "created_utc": 1615399864,
        "id": "gqh2shw",
        "permalink": "/r/wallstreetbets/comments/m237es/gme_megathread_part_2_for_march_10_2021/gqh2shw/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615428664.0
    },
    {
        "author": "mob55",
        "body": "Rocket has literally all the keys to success:\n\nContactless lending and closing\n\nLow overhead compared to traditional lenders\n\nAccess to the next generation of home buyers who are making a killing in the quarantine economy \n\nI don’t see how rocket wouldn’t at least hold steady while adding auto loans to the market.\n\nI invested a month ago when 3 friends all used rocket for their home",
        "created_utc": 1614706771,
        "id": "gpfqh90",
        "permalink": "/r/wallstreetbets/comments/lw6hoh/rkt_megathread_for_march_2nd_2021/gpfqh90/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614735571.0
    },
    {
        "author": "10589991",
        "body": "Ok retards. I lost  20k last week on $RKT. In hindsight maybe it was retarded move. I dont know if it was Melvin and Citadel doing on psy OP, pumping and dumping. I can see they wanted me to either sell or forget about  GME and focus on Something else.  Maybe they wanted me to lose money so when GME  soars I will sell and not hold out like I did on RKT. \n\nGood news is that I didn't sell any GME. Held like a diamond hands. \n\nAnd I don't learn lessons. I only eat crayons.  You want  my GME  stock? Give me the keys to your  house,  I'll come in crap on your bed and then tell you I'm not selling...\n\n🐒🐒🐒🐒🐒🐒🐒🐒💎👐",
        "created_utc": 1615226680,
        "id": "gq8i322",
        "permalink": "/r/wallstreetbets/comments/m0fpgd/gme_megathread_for_march_08_2021/gq8i322/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615255480.0
    },
    {
        "author": "realaccountforsure",
        "body": "CMS systems log almost everything that is done in them, so if they really want to cover it up they'll have to get someone to surgically doctor all sorts of timestamps in the database of their system.  Not just timestamps though because everything they do is going to end up getting put into the db with ID's that increment up every time something is put in, and anything done in the db after the article was initially published will have ID's higher than that article's entries, so hey can doctor the timestamp but they'll also have to change all of the keys for all of the entries related to the article or someone will still be able to dig up when they actually published it as a range of \"between when the thing before it was done and the thing after it was done\".",
        "created_utc": 1615412303,
        "id": "gqhwivm",
        "permalink": "/r/wallstreetbets/comments/m27zg5/gme_megathread_part_iii/gqhwivm/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615441103.0
    },
    {
        "author": "jcamp028",
        "body": "I’ll take my wife with me because I married up, but hand over the keys to the house.",
        "created_utc": 1615336644,
        "id": "gqe6cq0",
        "permalink": "/r/wallstreetbets/comments/m16emz/gme_megathread_for_march_09_2021/gqe6cq0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615365444.0
    },
    {
        "author": "gingerbakerisgod",
        "body": "The Black Keys knew this would happen with Rocket so they made a song. Good listening while you camp ur chart: [Black Keys \"Lo/ Hi\"](https://www.youtube.com/watch?v=JILfwu5AWIQ&amp;lc=UgwwQx-Cy1z8i9s49KB4AaABAg)",
        "created_utc": 1614788262,
        "id": "gpjpy4d",
        "permalink": "/r/wallstreetbets/comments/lw6hoh/rkt_megathread_for_march_2nd_2021/gpjpy4d/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614817062.0
    },
    {
        "author": "yoloornoglow",
        "body": "VIX DROPPING LIKE CARTON OF EGGS IN ELDERLY GENTLEMANS HANDS TRYING TO FUMBLE FOR HIS KEYS TO OPEN CAR",
        "created_utc": 1615564074,
        "id": "gqp7y2q",
        "permalink": "/r/wallstreetbets/comments/m3f9fp/daily_discussion_thread_for_march_12_2021/gqp7y2q/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615592874.0
    },
    {
        "author": "wishtrepreneur",
        "body": "Keys to winning the stock market:\n\n1. Always average down if you like the stonk\n2. Don't sell for lower than what you paid for",
        "created_utc": 1614778738,
        "id": "gpj5ssj",
        "permalink": "/r/smallstreetbets/comments/lwq3xy/whatever_happened_to_nok/gpj5ssj/",
        "score": 5,
        "subreddit": "smallstreetbets",
        "created": 1614807538.0
    },
    {
        "author": "Whaleflop229",
        "body": "Keys to the bananas? I don't understand, but I don't have to get it to love it!",
        "created_utc": 1615221309,
        "id": "gq852om",
        "permalink": "/r/wallstreetbets/comments/m0jjoo/aso_yolo_update_got_the_keys_to_the_bananas_here/gq852om/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1615250109.0
    },
    {
        "author": "everyday_malakia",
        "body": "Bear case - \n\nIt’s China. I’ve lived there, have been visiting there since I was like 12, and even studied Chinese for several years in high school and uni - so I’m coming from a place of personal experience as a non-Chinese person with some real Chinese experience. \n\nThe government changes pace overnight with decisions made at the speed of light. It’s not like the west, where decisions are made after weeks or months of discussions. \n\nIf the party decides coal is out, coal is out. You’re done. \n\nIf the party decides your mine belongs to them, they’ll determine a valuation and hand you a check and take the keys. That’s it. No conversation. \n\nIf the party decides your mine is no longer considered clean, you can’t mine anymore. You’re done. \n\nIf the party decides the CEO is an opponent he can be arrested and his assets seized. PRCX is done. \n\nI think there’s a lot of value in investing in China, but I would only do it with someone who lives there and someone who is friendly with the party. And even then, I would he very careful. \n\nPosition - 9k shares on PRCX and bullish. My PT is $1.5, the price the Wandi mine was bought for ($60M in shares valued at $1.5 ea).",
        "created_utc": 1615485879,
        "id": "gqlj8wy",
        "permalink": "/r/pennystocks/comments/m2t21z/prcx_why_prcx_is_atrociously_undervalued_update/gqlj8wy/",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1615514679.0
    },
    {
        "author": "Zestyclose_Hippo",
        "body": "A drop of 10% triggers the short sale rule (ssr), meaning shorts can only short on upticks. If there’s no ssr, they can short to drop the price. If there is, they can only short to stabilize the price, so it basically becomes impossible for them to prevent a gamma squeeze (as long as there’s still buying pressure). It’s likely what the smart money is waiting for. GME will trade sideways, more or less, until ssr gets triggered in. Make a note, every morning, of what 90% of yesterday’s close is. \n\nAgain, not advice, I’m a monkey randomly hitting keys.",
        "created_utc": 1614897832,
        "id": "gppinej",
        "permalink": "/r/Wallstreetbetsnew/comments/lxvq09/just_paid_26k200130_gme_to_hold_130_line_buy_and/gppinej/",
        "score": 4,
        "subreddit": "Wallstreetbetsnew",
        "created": 1614926632.0
    },
    {
        "author": "Frumpy_little_noodle",
        "body": "You'd think they do, but with the filibuster still in effect they have no way of advancing literally any agenda without Republican support that doesn't deal with budget reconciliation.  So GOP still holds the keys to the kingdom, so to speak.",
        "created_utc": 1614744099,
        "id": "gphxng8",
        "permalink": "/r/wallstreetbets/comments/lwiacq/aso_academy_sports_and_outdoors_next_rkt_similar/gphxng8/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614772899.0
    },
    {
        "author": "Basilthebatlord",
        "body": "Alrighty we're handing the keys over to AH. Don't fail me now!",
        "created_utc": 1614718760,
        "id": "gpgihvx",
        "permalink": "/r/wallstreetbets/comments/lw6hoh/rkt_megathread_for_march_2nd_2021/gpgihvx/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614747560.0
    },
    {
        "author": "kapnklutch",
        "body": "Correct. SoFi, RH, PayPal let you buy Bitcoin but you don’t actually own the crypto. It’s not in your wallet, you don’t own the private keys, it’s not your crypto.",
        "created_utc": 1617205671,
        "id": "gsxce6k",
        "permalink": "/r/investing/comments/mh6l6f/goldman_sachs_is_close_to_offering_bitcoin_and/gsxce6k/",
        "score": 4,
        "subreddit": "investing",
        "created": 1617234471.0
    },
    {
        "author": "ShiftBunny",
        "body": "Literally almost every entity with capital that isn't retail is leveraged easily 10:1.   Fed is the bartender, everyone getting blasted, no cutoffs and here are your keys.",
        "created_utc": 1617052477,
        "id": "gsqce2k",
        "permalink": "/r/wallstreetbets/comments/mfy3xf/what_are_your_moves_tomorrow_march_30_2021/gsqce2k/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617081277.0
    },
    {
        "author": "CalligrapherOneTwo3",
        "body": "A lot of people are investing in Bitcoin ETFs and Bitcoin mining companies  without realizing some issues such as the fact that you will not own actual Bitcoin. Also, you will not be insured if anything happens to the ETF. Here are a few points which may or may not be helpful to you from my perspective regarding buying this alternative asset class, cold storage, taxation, and the cheapest method of accumulating/procuring it in Canada:\n\n1. Personally, I only buy on the Newton app since they currently have the lowest purchasing fees out of all of the available exchanges in Canada. Newton's average spread varies from 0.50% to 0.60% which is 2-3 times cheaper than most of the other available exchanges that are available to us as Canadians. I also use the ShakePay app to earn free Bitcoin on a daily basis by physically shaking my phone once a day. Trust me, I know that sounds ridiculous, stupid, and suspicious, but ShakePay is a legitimate company based out of Montréal which is regulated by both FINTRAC and AMF while it is also legally licensed as a Money Service Business. I never actually buy from ShakePay because of their high purchasing spreads (which is approximately 1.75%) and I simply use them for the free daily accumulation of Bitcoin. Anyone who uses ShakePay can attest to this and easily confirm their legitimacy. \n\n2. Since I actually want to own the underlying asset, I withdraw my Bitcoin from both of those exchanges and I put my assets into a cold storage wallet. In Canada, this is currently the cheapest method of accumulating Bitcoin and truly owning the assets by storing them \"offline\" in a cold storage wallet. However, in order to unlock the ShakingSats feature in ShakePay to earn free Bitcoin, you will need to be referred as per their current terms and conditions. I can assist you with that in addition to answering any general questions that you may have regarding buying, selling, converting, and taxation-related issues if you want to message me directly as I am always willing to help educate others in this space with whatever knowledge and/or experience that I have gained over the years.\n\n3. If you want tax free capital gains, you can buy QBTC or BTCC in your TFSA. For QBTC, it is certainly expensive in terms of its historical premiums (5%-20%) and MER (1.95%); however, if you are long/bullish in Bitcoin as an alternative asset class, then perhaps it does not really matter. With that said, you do not truly own Bitcoin with QBTC or BTCC because they are a fund; and therefore, you own shares of the fund and not Bitcoin itself. As the saying goes and as you may have heard if you have done your due diligence: \"not your keys, not your Bitcoin\". As such, you run and operate with all of the associated risks of leaving your coins on an exchange which is why I choose to own the real thing and use a cold storage wallet. These products are not insured and same goes with the newly released ETF called BTCC. Big risk, but tax free in a TFSA.\n\n4. You may have heard of a Canadian company named Quadriga. In short, many investors did not truly own their Bitcoin with them since Quadriga sold \"entitlements to receive crypto assets or fiat currency from Quadriga\" while Quadriga held the \"keys\" to the real Bitcoin and investors lost around 135 million dollars CAD, but up to 250 million dollars CAD according to Wikipedia. This is verifiable information, a famous story, and a perfect example of \"not your keys, not your Bitcoin\" as well as a lack of insurance of clients.\n\n5. Unfortunately, with BTCC, QBTC and WealthSimple Crypto, you cannot take your Bitcoin off of their exchanges because, again, you do not truly own Bitcoin with them. Rather, you own shares of the fund whereas those organizations truly own the asset since they have the \"keys\". They are the ones who own the real asset (Bitcoin) and simply run the fund with the Bitcoin backing that fund as they make money through their ridiculously overpriced premiums and spread/fees (WealthSimple's spread is around 1.5-2.0% if not higher and BTCC's MER is about 1%).\n\n6. In regards to taxes, if you truly own the asset (Bitcoin), it is subject to capital appreciation tax whenever you trigger a taxable event such as selling it, buying things with it, and/or converting crypto-to-crypto. As such, you need to be prudent in your bookkeeping behavior and calculate your \"adjusted cost base\" for each transaction. There is no legal requirement forcing you to calculate your \"adjusted cost base\" for each transaction, but it just saves you a lot of headaches later on when you need to pay taxes. This is no different than investing in traditional equities in a taxable account after you have maxed out your TFSA, RRSP, RESP, etc.\n\n7. Before you invest in anything regardless of the asset class, make sure you understand what you are putting your money towards, understand your risk tolerance, understand the proper asset allocation percentages for your risk tolerance, and formulate a clear plan of what you want to achieve. For me, the biggest investment is not really the Bitcoin itself, but rather, it is in the underlying technology and innovation of the blockchain infrastructure which serves as a massive global public ledger leading to the decentralization of this digital currency as well as its invincibility and independence from overbearing governing bodies whereby the Bitcoin unit itself simply has a monetary value relative to fiat currency. Disclaimer: I am super long Bitcoin.\n\nNow, here are some general points of interests to help you understand cold storage wallets:\n\n1. There is a big misconception that if you decide to operate as your own bank (i.e.truly own your Bitcoin) and use a cold storage wallet device (i.e. physical hardware connected via USB to your PC), that your assets (Bitcoin) will be transferred and stored onto that physical USB device. This is the part that confuses a lot of people. In short, Bitcoin is not stored on that device, it will never be stored there, and this is because Bitcoin can never leave its \"blockchain\".\n\n2. So, what does your cold storage device do? The device allows you to have a \"key\" to your asset (Bitcoin) on the blockchain. How is this \"key\" established? Without going too deep into the technical aspects, when you initially setup the hardware wallet device, you will be given a 24-word \"seed phrase\" and it is literally 24 words. From a computer science perspective, this 24-word \"seed phrase\" actually represents and is transcribed into a huge series/string of alphanumeric characters. This 24-word \"seed phrase\" is essentially your \"keys\" to your assets on the blockchain.\n\n3. Your 24-word \"seed phrase\" is what is most important if you decide to act as your own bank and truly own Bitcoin since this is what gives you access to it. It does not matter if you lose your physical device and it does not matter if your physical device was destroyed. Why? Again, your assets are on the blockchain and not on the physical device. So, if you lose your physical device, you can simply replace it with another one (and this can be one from a different manufacturer too), set it up with your original 24-word \"seed phrase\" and you will once again have access to your assets since they are on the blockchain. In essence, never lose your \"keys\" because then you will have truly lost your Bitcoin. \n\n4. As you can probably see now, your 24-word \"seed phrase\" is extremely important (and more important than the physical hardware device itself). Therefore, when you first take note of your 24-word \"seed phrase\" during the initial setup of your physical hardware device, make sure that no one is watching, there are no cameras around you (including your mobile phone), etc. Only you should know your \"keys\". Never type it out on any digital device, never e-mail it to yourself, never take a photo of it, never upload it to a cloud database such as Google Docs and never try to encrypt it and put it on a regular USB drive. You want this 24-word seed phrase as private as possible. So, if anyone/anything asks you for your \"keys\", never give it out. Period.\n\n5. What is a blockchain? It is a transparent, public, and append-only ledger. Basically, you can add data to this transparent, open, and public ledger, but you can never edit/delete previously established data within it. This is executed by a mechanism of consensus creation between geographically scattered parties (i.e. computers) that do not need to trust each other. The parties only need to trust the consensus mechanism itself. Blockchain infrastructure relies on some form of challenge such that no single party on the network can consistently and systematically solve this challenge more than everyone else on the network. This randomizes the consensus mechanism of confirming transactions and ensures that no single party can force the blockchain ledger to accept a particular entry onto the ledger that others disagree with. This is a peer-to-peer network that can maintain updates to the ledger and verify those updates in such a way that it is impossible to defraud and impossible to alter an entry after it has been confirmed via consensus.\n\nI sincerely hope that this has been helpful to you and good luck!",
        "created_utc": 1615747280,
        "id": "gqxbtmz",
        "permalink": "/r/CanadianInvestor/comments/m4vnx3/any_reason_to_invest_in_bitcoins_miners_instead/gqxbtmz/",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1615776080.0
    },
    {
        "author": "jamesrobbo1",
        "body": "keys. all kinds of keys.",
        "created_utc": 1615342518,
        "id": "gqehcl0",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqehcl0/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1615371318.0
    },
    {
        "author": "Tommy-Styxx",
        "body": "I also read that there are combinations of keys that reset the password back to what you mentioned in the event that they did set a password.",
        "created_utc": 1615417235,
        "id": "gqi74fu",
        "permalink": "/r/wallstreetbets/comments/m29uzz/highway_sign_us_9_south/gqi74fu/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615446035.0
    },
    {
        "author": "Lentil_SoupOrHero",
        "body": "I've also heard horror stories of people losing access to their keys",
        "created_utc": 1617072317,
        "id": "gsre2ek",
        "permalink": "/r/CanadianInvestor/comments/mg2j39/canadian_securities_administrators_announce_that/gsre2ek/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1617101117.0
    },
    {
        "author": "CallNPut",
        "body": "Give them car keys and let them figure it out. Just like how noobs figure out options.",
        "created_utc": 1615493773,
        "id": "gqm1h82",
        "permalink": "/r/wallstreetbets/comments/m2nosq/unpinned_daily_discussion_thread_for_march_11_2021/gqm1h82/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615522573.0
    },
    {
        "author": "mesaymikey",
        "body": "Holding on for dear life like quivering bum cheeks while fiddling with keys in the door after a date with the refried beans and hot sauce.",
        "created_utc": 1614792437,
        "id": "gpjzr9u",
        "permalink": "/r/wallstreetbets/comments/lwtejk/gme_megathread_for_march_3rd_2021/gpjzr9u/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614821237.0
    },
    {
        "author": "EverythingGunz",
        "body": "IB has hot keys and the options table is super clean which makes trading options on IB super easy. I find most times I’m filled instantly as long as my price isn’t way out. IB also has some of the best margin rates. The only thing I absolutely hate about IB is charting on TWS. The charting is absolutely horrendous, so many glitches and loading errors. Sometimes charts won’t load, sometimes they glitch into rainbows of nothingness, they are terribly slow switching timeframes or securities. I have started using TradingView for charting and find it much better. Just annoying switching back and forth to enter exit trades. You must also purchase market data for IB and not all data packs are created equal.",
        "created_utc": 1616884364,
        "id": "gsip8s8",
        "permalink": "/r/options/comments/menbhy/tastyworks_vs_interactive_brokers_for_daytrading/gsip8s8/",
        "score": 3,
        "subreddit": "options",
        "created": 1616913164.0
    },
    {
        "author": "Archibaldy3",
        "body": " I'm not sure i understand, are you saying because this is WSB nobody cares about any fundamentals of the company they're buying? It's one of the keys to not getting burned trying to make money for me.",
        "created_utc": 1614901463,
        "id": "gppq1pz",
        "permalink": "/r/wallstreetbets/comments/lxjkg6/shortsellers_lost_813_million_on_rocket_companies/gppq1pz/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614930263.0
    },
    {
        "author": "notoptimal13",
        "body": "What would you think of a stock that moved from $0.68 to $1.47 between Oct 1 and now?  That's a 116% gain over that time span.  That's exactly what the yields on the 10-year treasury have done.  An interest rate rise like that is going to make people pay attention given how much money in the system keys off those rates.  On a daily basis a 0.02% yield rate change is small in absolute terms but it's almost a 1.4% daily increase.",
        "created_utc": 1614831933,
        "id": "gpmacpj",
        "permalink": "/r/options/comments/lxb1x1/journey_to_1_million_march_3rd_2021/gpmacpj/",
        "score": 3,
        "subreddit": "options",
        "created": 1614860733.0
    },
    {
        "author": "Your_savory_savior",
        "body": "I know these institutions look out for themselves at the end of the day but Blackrock is \"the comeback kid\" when all this goes through. Have a little bias for them because BLAKROC is the name of an absolute killer album. The Black Keys collabing with some rappers out in New York. Fucking timeless. Before I go, just to quote it, \"if it don't make dollars then it don't make sense\".",
        "created_utc": 1614846213,
        "id": "gpmt8uf",
        "permalink": "/r/Wallstreetbetsnew/comments/lxecfu/the_institutional_investors_in_both_gme_and_amc/gpmt8uf/",
        "score": 3,
        "subreddit": "Wallstreetbetsnew",
        "created": 1614875013.0
    },
    {
        "author": "CheapSeatRadio",
        "body": "Edit: If the keys are for your Lambo, feel free to jingle",
        "created_utc": 1614704268,
        "id": "gpfkr94",
        "permalink": "/r/wallstreetbets/comments/lw4qgi/fuck_it_heres_your_daily_gme_threadmegathread_3221/gpfkr94/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614733068.0
    },
    {
        "author": "iplay4Him",
        "body": "Thanks, I appreciate the reply!  Hot keys isn’t the end of the world, but it is nice. Just trying to evaluate all options. Last question, can you add contracts to watch lists? Can’t seem to find it online.",
        "created_utc": 1616883898,
        "id": "gsiocc1",
        "permalink": "/r/options/comments/menbhy/tastyworks_vs_interactive_brokers_for_daytrading/gsiocc1/",
        "score": 2,
        "subreddit": "options",
        "created": 1616912698.0
    },
    {
        "author": "garthzilla",
        "body": "\"They were able to get cryptographic secrets for single sign-on cookies and remote access, full source code control contents, and signing keys exfiltration,” Adam said.\"  \n\nIt's even worse than just the passwords. If they can forge the single sign ons (probably for firmware updates), it's honestly game over. It's just a matter of how many devices already have back doors put into them. Firmware reset and upgrades across all devices (or throw them away) if you're using them for anything enterprise that is exposed.",
        "created_utc": 1617153695,
        "id": "gsv8830",
        "permalink": "/r/wallstreetbets/comments/mgonpu/whistleblower_ubiquiti_breach_catastrophic/gsv8830/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617182495.0
    },
    {
        "author": "babamanali",
        "body": "Can I have the keys to the restroom?",
        "created_utc": 1617225587,
        "id": "gsyk5om",
        "permalink": "/r/wallstreetbets/comments/mhecu3/what_are_your_moves_tomorrow_april_01_2021/gsyk5om/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617254387.0
    },
    {
        "author": "findspeopleforfun",
        "body": "I think GameStop should do something like G2A and sell keys for games on Steam rather than trying to compete with Steam. This would make them the most recognizable name in the Steam key business and would tie their success to Steam's success, which like you said is basically already a monopoly on PC gaming. Also this would be much less expensive and require less licensing than attempting to create a platform for downloading and playing the actual games, not to mention whatever else they would have to do to outcompete Steam. They could also sell keys for games on other platforms like Origin and Epic and tie their success to Steam and Origin and Epic.",
        "created_utc": 1614859362,
        "id": "gpn7e2n",
        "permalink": "/r/wallstreetbets/comments/lx5yjb/gmes_future_steamkiller/gpn7e2n/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614888162.0
    },
    {
        "author": "ShowIpRoute",
        "body": "Scared of what exactly? Never forget JPOW holds the keys to the green kingdom",
        "created_utc": 1614864301,
        "id": "gpnerae",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpnerae/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614893101.0
    },
    {
        "author": "Snark_x",
        "body": "Lol I set 20% of my tiny portfolio on fire on FDs at open on this today. Sometimes ya have to pay for the knowledge via experience... I’m in this sub because I stuck my mom’s car keys in an electrical outlet when I was a kid. Twice.",
        "created_utc": 1614831862,
        "id": "gpma8ew",
        "permalink": "/r/wallstreetbets/comments/lx33ta/wish_me_luck_dumping_100k_on_uwm/gpma8ew/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614860662.0
    },
    {
        "author": "baker5586",
        "body": "The only downfall to having dogs. I’m sorry for your loss. I have both of my best friends tags on my keys and even though it’s been years, I see them everyday when I grab my keys. They’re still putting a smile on my face every day after all these years. Your boy had the best life and you gave that to him. He and my BFs are probably in an argument about who had the best parent(s), right now. Take care of yourself, brother.",
        "created_utc": 1615246296,
        "id": "gq9pmn3",
        "permalink": "/r/wallstreetbets/comments/m0qjfm/i_had_to_put_my_dog_down_today_hardest_thing_ive/gq9pmn3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615275096.0
    },
    {
        "author": "THEE_6149",
        "body": "It's Friday night and I feel all right\nThe party is here on the Moon\nSo I reach for my GME and I turn it up\nDesignated driver take the keys to my Lambo",
        "created_utc": 1615391420,
        "id": "gqgg81v",
        "permalink": "/r/wallstreetbets/comments/m1xhlc/gme_megathread_for_march_10_2021/gqgg81v/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615420220.0
    },
    {
        "author": "babypj",
        "body": "LMAOOOO can't start the rocket till we get the keys",
        "created_utc": 1615400946,
        "id": "gqh5lpk",
        "permalink": "/r/wallstreetbets/comments/m237es/gme_megathread_part_2_for_march_10_2021/gqh5lpk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615429746.0
    },
    {
        "author": "FluffyCowNYI",
        "body": "And the State give up its power? You nuts, bruh?\n\nThe three keys to an iron fist of control over a population are to take away its rights, it's morale, and it's wealth. Do it slowly enough, and they won't know what happened.",
        "created_utc": 1615421093,
        "id": "gqiensf",
        "permalink": "/r/wallstreetbets/comments/m25g2s/so_sec_and_senate_staff_investigators/gqiensf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615449893.0
    },
    {
        "author": "IAmInCa",
        "body": "Literally, everything about this SCREAMS credibility.  \n\n1. Red satin shirt.  I mean, who can pull this off but this guy?\n2. Thin non-matching tie. He clearly still has keys to his parent's house and stole his dad's tie from 1984.  Clearly, he's trustworthy.\n3. The hair.  He supports the hair gel industry when others have abandoned it.\n4. He has long fingers.  Now, watch it again.  You won't be able to see anything else. Clearly, he could be playing guitar or some other instrument with ease, but no.....he encourages his fellow apes during times of struggle. \n5.  He's got 16 shares of GME. A BALLER if I ever saw one!\n6. He only blinks once in the video.  (While on displayed rocketship traveling to moon. I mean, who wouldn't blink once?)\n\nOther reasons?",
        "created_utc": 1614793803,
        "id": "gpk2yyr",
        "permalink": "/r/wallstreetbets/comments/lwow6b/someone_posted_an_ad_on_youtube_for_gme_and_im/gpk2yyr/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614822603.0
    },
    {
        "author": "Content-Yellow-933",
        "body": "Looks good to me.  Keys stop by nasa",
        "created_utc": 1614872454,
        "id": "gpnvfai",
        "permalink": "/r/wallstreetbets/comments/lxmngq/i_like_this_stonk_so_i_bought_more_almost_at_709/gpnvfai/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614901254.0
    },
    {
        "author": "usernamewamp",
        "body": "I love how you got the fancy ass card in-front of those old ass car keys.",
        "created_utc": 1614705835,
        "id": "gpfoc43",
        "permalink": "/r/wallstreetbets/comments/lw7coj/everyone_trading_should_get_one_made_makes_me_not/gpfoc43/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614734635.0
    },
    {
        "author": "Bengbab",
        "body": "Who even likes wind chimes? They sound like shit. Close second: child randomly pushing keys on a piano.",
        "created_utc": 1616953770,
        "id": "gslmpqx",
        "permalink": "/r/wallstreetbets/comments/mdx2d0/weekend_discussion_thread_for_the_weekend_of/gslmpqx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1616982570.0
    },
    {
        "author": "Lezzles",
        "body": "Those discount keys exist because they're stolen. GME would have to seriously start bottom-feeding to get into the stolen key resale market.",
        "created_utc": 1615827106,
        "id": "gr1337m",
        "permalink": "/r/wallstreetbets/comments/m5ksy9/bb_and_gme_a_race_to_tendie_town/gr1337m/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615855906.0
    },
    {
        "author": "CalligrapherOneTwo3",
        "body": "Here are a few points which may or may not be helpful to you from my perspective regarding buying this alternative asset class, cold storage, taxation, and the cheapest method of accumulating/procuring it in Canada:\n\n1. Personally, I only buy on the Newton app since they currently have the lowest purchasing fees out of all of the available exchanges in Canada. Newton's average spread varies from 0.50% to 0.60% which is 2-3 times cheaper than most of the other available exchanges that are available to us as Canadians. I also use the ShakePay app to earn free Bitcoin on a daily basis by physically shaking my phone once a day. Trust me, I know that sounds ridiculous, stupid, and suspicious, but ShakePay is a legitimate company based out of Montréal which is regulated by both FINTRAC and AMF while it is also legally licensed as a Money Service Business. I never actually buy from ShakePay because of their high purchasing spreads (which is approximately 1.75%) and I simply use them for the free daily accumulation of Bitcoin. Anyone who uses ShakePay can attest to this and easily confirm their legitimacy. \n\n2. Since I actually want to own the underlying asset, I withdraw my Bitcoin from both of those exchanges and I put my assets into a cold storage wallet. In Canada, this is currently the cheapest method of accumulating Bitcoin and truly owning the assets by storing them \"offline\" in a cold storage wallet. However, in order to unlock the ShakingSats feature in ShakePay to earn free Bitcoin, you will need to be referred as per their current terms and conditions. I can assist you with that in addition to answering any general questions that you may have regarding buying, selling, converting, and taxation-related issues if you want to message me directly as I am always willing to help educate others in this space with whatever knowledge and/or experience that I have gained over the years.\n\n3. If you want tax free capital gains, you can buy QBTC or BTCC in your TFSA. For QBTC, it is certainly expensive in terms of its historical premiums (5%-20%) and MER (1.95%); however, if you are long/bullish in Bitcoin as an alternative asset class, then perhaps it does not really matter. With that said, you do not truly own Bitcoin with QBTC or BTCC because they are a fund; and therefore, you own shares of the fund and not Bitcoin itself. As the saying goes and as you may have heard if you have done your due diligence: \"not your keys, not your Bitcoin\". As such, you run and operate with all of the associated risks of leaving your coins on an exchange which is why I choose to own the real thing and use a cold storage wallet. These products are not insured and same goes with the newly released ETF called BTCC. Big risk, but tax free in a TFSA.\n\n4. You may have heard of a Canadian company named Quadriga. In short, many investors did not truly own their Bitcoin with them since Quadriga sold \"entitlements to receive crypto assets or fiat currency from Quadriga\" while Quadriga held the \"keys\" to the real Bitcoin and investors lost around 135 million dollars CAD, but up to 250 million dollars CAD according to Wikipedia. This is verifiable information, a famous story, and a perfect example of \"not your keys, not your Bitcoin\" as well as a lack of insurance of clients.\n\n5. Unfortunately, with BTCC, QBTC and WealthSimple Crypto, you cannot take your Bitcoin off of their exchanges because, again, you do not truly own Bitcoin with them. Rather, you own shares of the fund whereas those organizations truly own the asset since they have the \"keys\". They are the ones who own the real asset (Bitcoin) and simply run the fund with the Bitcoin backing that fund as they make money through their ridiculously overpriced premiums and spread/fees (WealthSimple's spread is around 1.5-2.0% if not higher and BTCC's MER is about 1%).\n\n6. In regards to taxes, if you truly own the asset (Bitcoin), it is subject to capital appreciation tax whenever you trigger a taxable event such as selling it, buying things with it, and/or converting crypto-to-crypto. As such, you need to be prudent in your bookkeeping behavior and calculate your \"adjusted cost base\" for each transaction. There is no legal requirement forcing you to calculate your \"adjusted cost base\" for each transaction, but it just saves you a lot of headaches later on when you need to pay taxes. This is no different than investing in traditional equities in a taxable account after you have maxed out your TFSA, RRSP, RESP, etc.\n\n7. Before you invest in anything regardless of the asset class, make sure you understand what you are putting your money towards, understand your risk tolerance, understand the proper asset allocation percentages for your risk tolerance, and formulate a clear plan of what you want to achieve. For me, the biggest investment is not really the Bitcoin itself, but rather, it is in the underlying technology and innovation of the blockchain infrastructure which serves as a massive global public ledger leading to the decentralization of this digital currency as well as its invincibility and independence from overbearing governing bodies whereby the Bitcoin unit itself simply has a monetary value relative to fiat currency. Disclaimer: I am super long Bitcoin.\n\nNow, here are some general points of interests to help you understand cold storage wallets:\n\n1. There is a big misconception that if you decide to operate as your own bank (i.e.truly own your Bitcoin) and use a cold storage wallet device (i.e. physical hardware connected via USB to your PC), that your assets (Bitcoin) will be transferred and stored onto that physical USB device. This is the part that confuses a lot of people. In short, Bitcoin is not stored on that device, it will never be stored there, and this is because Bitcoin can never leave its \"blockchain\".\n\n2. So, what does your cold storage device do? The device allows you to have a \"key\" to your asset (Bitcoin) on the blockchain. How is this \"key\" established? Without going too deep into the technical aspects, when you initially setup the hardware wallet device, you will be given a 24-word \"seed phrase\" and it is literally 24 words. From a computer science perspective, this 24-word \"seed phrase\" actually represents and is transcribed into a huge series/string of alphanumeric characters. This 24-word \"seed phrase\" is essentially your \"keys\" to your assets on the blockchain.\n\n3. Your 24-word \"seed phrase\" is what is most important if you decide to act as your own bank and truly own Bitcoin since this is what gives you access to it. It does not matter if you lose your physical device and it does not matter if your physical device was destroyed. Why? Again, your assets are on the blockchain and not on the physical device. So, if you lose your physical device, you can simply replace it with another one (and this can be one from a different manufacturer too), set it up with your original 24-word \"seed phrase\" and you will once again have access to your assets since they are on the blockchain. In essence, never lose your \"keys\" because then you will have truly lost your Bitcoin. \n\n4. As you can probably see now, your 24-word \"seed phrase\" is extremely important (and more important than the physical hardware device itself). Therefore, when you first take note of your 24-word \"seed phrase\" during the initial setup of your physical hardware device, make sure that no one is watching, there are no cameras around you (including your mobile phone), etc. Only you should know your \"keys\". Never type it out on any digital device, never e-mail it to yourself, never take a photo of it, never upload it to a cloud database such as Google Docs and never try to encrypt it and put it on a regular USB drive. You want this 24-word seed phrase as private as possible. So, if anyone/anything asks you for your \"keys\", never give it out. Period.\n\n5. What is a blockchain? It is a transparent, public, and append-only ledger. Basically, you can add data to this transparent, open, and public ledger, but you can never edit/delete previously established data within it. This is executed by a mechanism of consensus creation between geographically scattered parties (i.e. computers) that do not need to trust each other. The parties only need to trust the consensus mechanism itself. Blockchain infrastructure relies on some form of challenge such that no single party on the network can consistently and systematically solve this challenge more than everyone else on the network. This randomizes the consensus mechanism of confirming transactions and ensures that no single party can force the blockchain ledger to accept a particular entry onto the ledger that others disagree with. This is a peer-to-peer network that can maintain updates to the ledger and verify those updates in such a way that it is impossible to defraud and impossible to alter an entry after it has been confirmed via consensus.\n\nI sincerely hope that this has been helpful to you and good luck!",
        "created_utc": 1615267234,
        "id": "gqaqil4",
        "permalink": "/r/CanadianInvestor/comments/m0qz9d/what_platform_do_you_use_to_buy_crypto_in_cad/gqaqil4/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1615296034.0
    },
    {
        "author": "yaMomsChestHair",
        "body": "big balls and they jangle like a lotta keys",
        "created_utc": 1615407504,
        "id": "gqhld1p",
        "permalink": "/r/wallstreetbets/comments/m1v1e6/daily_discussion_thread_for_march_10_2021/gqhld1p/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615436304.0
    },
    {
        "author": "No_Reservations_",
        "body": "Very nice and thanks for sharing the AI site, I will dig into it a little more.  Volatility is our best friend when it comes to day trade. Identify a solid setup, risk reward, always set stop loss and scale out your profit are keys.  Happy trading and cheers!",
        "created_utc": 1615421482,
        "id": "gqifdx1",
        "permalink": "/r/options/comments/m1nut1/always_taking_the_wrong_side_in_option/gqifdx1/",
        "score": 2,
        "subreddit": "options",
        "created": 1615450282.0
    },
    {
        "author": "HairyDiamondHands",
        "body": "Hold on tight the keys to the factory will be yours soon.",
        "created_utc": 1614881034,
        "id": "gpofc4p",
        "permalink": "/r/Wallstreetbetsnew/comments/lxoe5t/dfv_the_roaring_kitty_just_tweeted_this_lets/gpofc4p/",
        "score": 2,
        "subreddit": "Wallstreetbetsnew",
        "created": 1614909834.0
    },
    {
        "author": "justmystepladder",
        "body": "That is the most accurate thing I’ve read all day. I love it here. My wife, her boyfriend, and I payed for our entire vacation in the Keys with what I made TODAY. And that’s without even touching my meme stocks.",
        "created_utc": 1615316309,
        "id": "gqcz4ak",
        "permalink": "/r/wallstreetbets/comments/m16emz/gme_megathread_for_march_09_2021/gqcz4ak/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615345109.0
    },
    {
        "author": "asymptoticessence",
        "body": "I assess the \"jingle the keys\" theory has merit. Stimmies here or coming, a YOLO zeitgeist, pump AMC a bit which has an attractive price point for the uninitiated looking for a meme stock and some action. Keep people away/move people from GME.",
        "created_utc": 1615842362,
        "id": "gr21h65",
        "permalink": "/r/wallstreetbets/comments/m5jn1y/gme_megathread_for_march_15_2021/gr21h65/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615871162.0
    },
    {
        "author": "Slappinbeehives",
        "body": "&gt;*Gross was accused in 2018 of spraying his $20m home with fart spray after he was forced to hand over the keys to the property to his ex-wife in their divorce*\n\nSeems like a stable sane adult to me!",
        "created_utc": 1615939514,
        "id": "gr6lyrb",
        "permalink": "/r/wallstreetbets/comments/m6h3hy/thats_some_chump_change_yahoo_when_it_moons_hodl/gr6lyrb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615968314.0
    },
    {
        "author": "rojack86",
        "body": "No worries, besides those are keys to other vehicles out here at work. My work whip is a 2017 turbo ram 2500.",
        "created_utc": 1614706636,
        "id": "gpfq688",
        "permalink": "/r/wallstreetbets/comments/lw7coj/everyone_trading_should_get_one_made_makes_me_not/gpfq688/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614735436.0
    },
    {
        "author": "lil_gigantic",
        "body": "Im a balding man in my 30's this video just made me giggle like a baby playing with a set of keys.",
        "created_utc": 1615244381,
        "id": "gq9lzde",
        "permalink": "/r/wallstreetbets/comments/m0mfuy/i_am_not_a_cat/gq9lzde/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615273181.0
    },
    {
        "author": "Zorian_Passmore",
        "body": "I've never had that problem with the mamba wireless, though it happens with my dethadder elite, where keys will get stuck down every once and a while. Might be better off with a logitech or something though. Razer isn't known for its longevity, though logitech is.",
        "created_utc": 1615232662,
        "id": "gq8w04d",
        "permalink": "/r/wallstreetbets/comments/m0kf6k/i_programmed_my_leds_to_change_colours_depending/gq8w04d/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615261462.0
    },
    {
        "author": "Dadpool33",
        "body": "My wife's boyfriend forgot his keys and then they kicked me out of the house.  I'm now at Target, in the Starbucks.",
        "created_utc": 1615476072,
        "id": "gqkwwwc",
        "permalink": "/r/wallstreetbets/comments/m2sk51/serious_question_if_you_sold_everyones_favorite/gqkwwwc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615504872.0
    },
    {
        "author": "icbcrepair",
        "body": "We are a long ways off from the government coming and seizing Bitcoin.  Hold your own keys to make it as hard as possible for them to do so and if they get to that point you better off owning a gun and having a food supply.",
        "created_utc": 1615428554,
        "id": "gqisub7",
        "permalink": "/r/CanadianInvestor/comments/m20pu8/housing_market_activity_has_been_much_stronger/gqisub7/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1615457354.0
    },
    {
        "author": "Tucker-French",
        "body": "The fundamentals that are touted as keys to the stock market hold true for every company according to economists.\n\nIf Tesla is overvalued when it has redefined consumer vehicles and renewables across the globe, does a mortgage company that operates in less than 20 states deserve the same generous 30x multiplier?\n\nTarget crushed earnings posting over 1 billion in net income yet has dropped 20 dollars in 5 days.",
        "created_utc": 1614787191,
        "id": "gpjnhry",
        "permalink": "/r/wallstreetbets/comments/lwtgh5/rkt_megathread_for_march_3rd_2021/gpjnhry/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614815991.0
    },
    {
        "author": "bvttfvcker",
        "body": "Which is why *I* prepared and stuffed my car keys *up my ass*",
        "created_utc": 1617145996,
        "id": "gsutu6f",
        "permalink": "/r/wallstreetbets/comments/mgpobi/cramer_is_losing_it/gsutu6f/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617174796.0
    },
    {
        "author": "spaceminion",
        "body": "That brings a whole new meaning to \"sticky keys\".",
        "created_utc": 1614889422,
        "id": "gpozgwi",
        "permalink": "/r/wallstreetbets/comments/lxkint/gme_megathread_for_march_04_2021/gpozgwi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614918222.0
    },
    {
        "author": "kolbekhan",
        "body": "I like giving my keys to the drunkest person outside of a bar in a flippant manner and call them valets. See if they park it.",
        "created_utc": 1615300650,
        "id": "gqbxd9f",
        "permalink": "/r/wallstreetbets/comments/m16emz/gme_megathread_for_march_09_2021/gqbxd9f/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615329450.0
    },
    {
        "author": "dr_shastafarian",
        "body": "Aruba, Jamaica, oh I want to take ya\nBermuda, Bahama, come on pretty mama\nKey Largo, Montego, baby why don't we go, Jamaica\nOff the Florida Keys, there's a place called Kokomo\nThat's where you wanna go to get away from it all\nBodies in the sand, tropical drink melting in your hand\nWe'll be falling in love to the rhythm of a steel drum band\nDown in Kokomo",
        "created_utc": 1615302010,
        "id": "gqc0j20",
        "permalink": "/r/wallstreetbets/comments/m182j0/where_we_can_go/gqc0j20/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615330810.0
    },
    {
        "author": "IntenseScrolling",
        "body": "Has anyone seen my car keys",
        "created_utc": 1615381574,
        "id": "gqfwdjx",
        "permalink": "/r/wallstreetbets/comments/m1v741/its_a_sign/gqfwdjx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615410374.0
    },
    {
        "author": "Similar-Molasses4786",
        "body": "He left his car keys as collateral",
        "created_utc": 1615429749,
        "id": "gqiv4ay",
        "permalink": "/r/wallstreetbets/comments/m27zg5/gme_megathread_part_iii/gqiv4ay/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615458549.0
    },
    {
        "author": "therestruth",
        "body": "Did a bot make that username or did you just mash a bunch of keys? I hope the sentiment bots are having a hell of a time keeping up with this sub.",
        "created_utc": 1615438001,
        "id": "gqj9a0y",
        "permalink": "/r/wallstreetbets/comments/m27xop/gme_today/gqj9a0y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615466801.0
    },
    {
        "author": "Dog4theKid",
        "body": "Switch the m and n keys on their keyboard",
        "created_utc": 1615395857,
        "id": "gqgrj52",
        "permalink": "/r/wallstreetbets/comments/m1xhlc/gme_megathread_for_march_10_2021/gqgrj52/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615424657.0
    },
    {
        "author": "VodkaClubSofa",
        "body": "Added 220 more @ 227 in my TDA acct bc boomer Merril thinks I’m too autistic to give me the keys AH.",
        "created_utc": 1615504974,
        "id": "gqmpows",
        "permalink": "/r/wallstreetbets/comments/m32d9i/nvax_just_dropped_a_bomb/gqmpows/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615533774.0
    },
    {
        "author": "jelly_bro",
        "body": "Not your keys, not your Bitcoin.",
        "created_utc": 1615474310,
        "id": "gqkt34b",
        "permalink": "/r/CanadianInvestor/comments/m0qz9d/what_platform_do_you_use_to_buy_crypto_in_cad/gqkt34b/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1615503110.0
    },
    {
        "author": "squiggleymac",
        "body": "Na that’s the thing, it’s only used through 3rd parties these days, very few people really truly have their cryptos, use a real wallet or hold the keys to it. Nothing to stop Coinbase and the like freezing your assets if not happy how your using it. It’s also not very unique, it’s been duplicated and split so many times by a disruptive community. \n\nAnd no didn’t sell, I used them. I still hold a fair amount and have many of the forked projects, yes it’s great fun with all the memes and I like day trading and buying shitcoins but all that is an absolute mental circus that will implode eventually.",
        "created_utc": 1615683900,
        "id": "gqurv8f",
        "permalink": "/r/StockMarket/comments/m46plk/bitcoin_hits_60000_mark_for_the_first_time/gqurv8f/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1615712700.0
    },
    {
        "author": "CallNPut",
        "body": "Did a lot of ja ja ja ja ja ja ja ja on this thread...\n\nFor those who don't know, if you press the keys j and a in Reddit Enhancement suite you can go comment by comment and up vote it. J is vor moving the cursor down and a if for upvote..\n\nja ja ja ja ja",
        "created_utc": 1615686228,
        "id": "gquvuan",
        "permalink": "/r/wallstreetbets/comments/m3f9er/unpinned_daily_discussion_thread_for_march_12_2021/gquvuan/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615715028.0
    },
    {
        "author": "thesundayinvestor",
        "body": "I'd suggest a diversified approach like the one you're thinking is more appropriate than a single investment in a banking stock, no matter how fortunate your parents have been in the past. Right now the S&amp;P 500 is a high P/E, high growth-dependent ETF whereas TD is probably set up to do well if interest rates rise - things are just a little easier for them in those environments. \n\nHave you considered any all-in-one ETFs that give you Canadian equity and fixed-income exposure as well? Maybe not much fixed-income considering your age and income needs (I'm assuming you'll be getting enough from your employment), but there are all-in-one ETFs that are 100% equities, just different allocations to each region (Canada, U.S., Europe, Emerging Markets, etc). \n\nYou're young - keep the fees ultra-low, and find your motivation to stay invested. Many successful investors use dividends as a motivator. Even though they theoretically don't change an investor's total returns (the share price is automatically reduced by the exchange on the stock's ex-dividend date), the psychology of receiving a regular stream of payments is enough to keep them focused on their long-term plan. Once you find your motivator for staying invested even through the hard times, you'll find the keys to long-term success.\n\nGood luck!",
        "created_utc": 1615760065,
        "id": "gqy9ngd",
        "permalink": "/r/CanadianInvestor/comments/m55ha5/first_time_investor/gqy9ngd/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1615788865.0
    },
    {
        "author": "KisaTheMistress",
        "body": "Orangutans are known to try and save humans that are swimming. They have the same problem as chimps as they cannot swim. They identify humans as apes also and apply their own understanding of themselves onto humans and panic thinking a human will drown in water.\n\nAnother thing humans have that other apes don't, is their dexterity. Humans are weak in muscle strength, but are built for endurance and delicate manipulation of objects. Things like putting keys in pad locks and basket weaving are easy for a human, but other great apes will struggle and/or not be able to do. Humans can also out walk any animal to the point of death, as they are adapted to sweat instead of pant to release heat build up.",
        "created_utc": 1615705540,
        "id": "gqvnep2",
        "permalink": "/r/wallstreetbets/comments/m4mp80/wsb_and_apes_rn/gqvnep2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615734340.0
    },
    {
        "author": "murph331",
        "body": "Yeah hold on.  You have thr keys.  Bring me the ones shes wearing eith keys",
        "created_utc": 1615664038,
        "id": "gqtsg3k",
        "permalink": "/r/pennystocks/comments/m4b2sa/its_almost_stimi_time/gqtsg3k/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1615692838.0
    },
    {
        "author": "DeathN0va",
        "body": "Thanks! Maybe you'd like more of my writing! This one gained some adoration the other day. \n\n\nI'll never forget my first real vacation. There I was, a kid of 11 from the New York Snow Belt, basking in the warm sun of the Florida Keys. \n\n\nOn my last day there, I went to the juice bar outside our hotel, on the beach. While I was waiting for my fresh tropical juice smoothie, I overheard two men talking. \n\n\n\"Geez, Bill. That Conga line really took it out of me!\" Said one of the men, clean shaven except a bristly mustache above his lip. \n\n\n\"I know, Ted. My legs are on fire! I haven't danced like that since college! Let's hurry up and get back there!\"\n\n\nThe men, both wearing neon swim trunks, raced off over a sand dune and out of sight. \n\n\nI loved dancing! Tropical line dancing sounded so amazing to do right now. I grabbed my drink and sped off over the sand dune towards the sound of music. \n\n\nI followed the music into a secluded opening in a patch of palm trees and undergrowth. There, to my horror, was thirty men in a circle, each fucking the ass of the man in front of him while simultaneously being fucked from behind. \n\n\nMany years later I heard this is sometimes called a \"daisy chain\", or a \"gay Conga line\". \n\n\nIt's the second gayest thing I've ever seen, next to Jim Cramer.",
        "created_utc": 1615745820,
        "id": "gqx7ujt",
        "permalink": "/r/wallstreetbets/comments/m4vzcr/dian_fossey_gorilla_fund_has_updated_their/gqx7ujt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615774620.0
    },
    {
        "author": "Accomplished_Lie4011",
        "body": "99% of the biggest key sellers are legit. GOG, Humble Bundle and the hundred of other legit key sellers aren't getting stolen keys for CyberPunk and all the other new releases... \n\n&amp;#x200B;\n\nThese game companies don't have exclusive deals with selling their games primarily on Xbox's game store.... All GME has to do is literally talk to the publisher and the publisher will literally sell them keys at the exact price they sell them to Xbox...Developers want to sell copies of their game they don't give a fuck whether its on Amazon, Target, Best Buy or GameStop or whether its sold on a game console....you're telling me developers will discriminate against gamestop or something lmao?",
        "created_utc": 1615827342,
        "id": "gr13mg7",
        "permalink": "/r/wallstreetbets/comments/m5ksy9/bb_and_gme_a_race_to_tendie_town/gr13mg7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615856142.0
    },
    {
        "author": "NoDesk",
        "body": "Just buy bitcoin. If you don’t own the private keys, it’s not your bitcoin.",
        "created_utc": 1615847005,
        "id": "gr28gq4",
        "permalink": "/r/options/comments/m5adzs/btc_exposure/gr28gq4/",
        "score": 1,
        "subreddit": "options",
        "created": 1615875805.0
    },
    {
        "author": "compounding",
        "body": "Salaries have to be much higher on the money managers when one or a few of them can coordinate to make a single irreversible transaction to steal all 5 billion within an hour and then fuck off to another country as a literal billionaire.\n\nIt’s not even hypothetical, a major exchange CEO “died” and officially “took the private keys to the grave” but the coins mysteriously kept moving...",
        "created_utc": 1615820118,
        "id": "gr0ndze",
        "permalink": "/r/investing/comments/m58453/the_evidence_is_in_on_negative_interest_rate/gr0ndze/",
        "score": 1,
        "subreddit": "investing",
        "created": 1615848918.0
    },
    {
        "author": "Accomplished_Lie4011",
        "body": "People buy steam keys all the time from sites other than steam because they don't have good deals anymore. Any new game on MSFT or Sony's store remains at $60 for essentially 4-5 years before being brought down to $45-50.....any other seller sells the same game for $30-$40.\n\n&amp;#x200B;\n\nHonestly it's dumb as fuck to buy games directly from MSFT or Sony now, there are always better deals and GameStop could be the designation for those deals",
        "created_utc": 1615822966,
        "id": "gr0tq0c",
        "permalink": "/r/wallstreetbets/comments/m5ksy9/bb_and_gme_a_race_to_tendie_town/gr0tq0c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615851766.0
    },
    {
        "author": "MRuleZ",
        "body": "Capitulation would mean a uncontrollable influx in demand, by doing that they'd double dip on their losses.\n\nThey bet too much and can't get out they got their car keys and the house on the table and if anyone \"knew\" they had 2-7 they'd go for the yacht with their pocket aces.",
        "created_utc": 1615886714,
        "id": "gr3sxqq",
        "permalink": "/r/wallstreetbets/comments/m5zoos/gme_how_the_dip_today_was_due_to_etf_shares_being/gr3sxqq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615915514.0
    },
    {
        "author": "goqhammer900",
        "body": "Ya but remember 08 housing crash when you gave idiots keys to numerous mortgages?    No different",
        "created_utc": 1615830869,
        "id": "gr1bmaq",
        "permalink": "/r/stocks/comments/m5nf90/online_casinos_losing_money/gr1bmaq/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615859669.0
    },
    {
        "author": "r-T00Littl3Time",
        "body": "Has anyone played this?  I set up and account and \"played\" if you call it that.  I bought the stock, but I don't know.  I was sort of bored with it.  I was playing on my computer with arrow keys.  Apparently I was the \"murderer\" but has no idea how to use my knife.  So I ran around picking up coins only to mostly get beat out because some people are likely using a controller.  before you knew it, everyone was surrounding me but I couldn't do anything.  The chat box is covered by game stuff, so I couldn't see what I was typing and couldn't read the answers I was given as to what key strokes are needed to use the knife to win the game.  And what the hell anyway, to win I have to murder someone.  Kids today are already messed up and this just is more of the same.",
        "created_utc": 1615555872,
        "id": "gqoridy",
        "permalink": "/r/stocks/comments/m3c0lk/roblox_is_insanely_overpriced/gqoridy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615584672.0
    },
    {
        "author": "James-Lerch",
        "body": "While many complain about Fidelity and their Options application processes, I honestly think they are doing it right.\n\nIt took over a month for my application to be approved, and I spent that time educating myself and paper trading.  When I was approved, I was disappointed with the Level 1 access they restricted me to.   \n\nHowever, the limitations of Level 1 access have actually been a benefit IMHO, it has forced me to learn and pay attention to the details. It is rewarding to see my effort starting to pay out!  I'm also starting to realize that writing losing option contracts with level-1 access, while not impossible, is unlikely as long as a little effort is applied.  I think the biggest risk is being flagged as a Pattern Day Trader, which could happen even without options access.  \n\nHad Fidelity just handed me the keys and left me to my own devices I would have been overwhelmed and most likely royally screwed up my account, or worse.  \n\nBTW, selling covered calls has a '*hidden*' benefit I hadn't anticipated, which is simply amazing.   \n The anxiety of watching the price of the stock I own fall or trade sideways is GONE!  \n\n* Stock price went down?  Excellent, I can buy my calls back sooner and sell them again and make money.\n* Stock price went WAY down?  Excellent, I can buy more stock and my calls back sooner and sell more calls and make money.\n* Stock price went sideways?  Excellent, I'm a day closer to expiration and got to burn theta and make money.\n* Stock price went up? Excellent, great time to sell a contract for higher premiums and make money.\n* Stock price blew past my strike price?  Excellent, I get to exit my stock position while its high, and at my desired price point, and make money.\n\nI also know these luxuries come at the expense of no longer becoming an overnight millionaire due to blind luck, and I'm OK with that! :)",
        "created_utc": 1615531984,
        "id": "gqnzyn7",
        "permalink": "/r/options/comments/m37yy3/psa_for_those_of_us_new_to_options/gqnzyn7/",
        "score": 1,
        "subreddit": "options",
        "created": 1615560784.0
    },
    {
        "author": "MoonHunterDancer",
        "body": "Pick up map raid gw2 style. Eye on the keys and loot boxes bitches.",
        "created_utc": 1615559447,
        "id": "gqoy8kn",
        "permalink": "/r/wallstreetbets/comments/m3hkjf/gme_megathread_for_march_12_2021/gqoy8kn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615588247.0
    },
    {
        "author": "Red_Sea_Pedestrian",
        "body": "Bad analogy, since you can order the keys for most construction equipment right on Amazon: https://www.amazon.com/dp/B07MZRR3QG/\n\nIt’s honestly amazing more construction equipment doesn’t go missing because of this.",
        "created_utc": 1615135077,
        "id": "gq3yvpq",
        "permalink": "/r/SPACs/comments/lzink6/do_not_answer_the_phone/gq3yvpq/",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1615163877.0
    },
    {
        "author": "TayahuaJ",
        "body": "SQ, PYPL, AMZN, GOOG, MSFT, NVDA are all \"tech growth\" stocks I own, each about 5% of my non-retirement bucket.",
        "created_utc": 1614876912,
        "id": "gpo5p65",
        "permalink": "/r/stocks/comments/lxo7om/warren_buffets_stock_strategy_is_more_relevant/gpo5p65/",
        "score": 58,
        "subreddit": "stocks",
        "created": 1614905712.0
    },
    {
        "author": "conti555",
        "body": "I think people are taking the DCF valuation theory too seriously. Thinking back to 2018, AMD, Nvidia, Google etc were all soaring despite the 10 year treasury reaching over 3%. What percentage of the market values companies purely in DCF anyway?\n\nI think this is more a broader correction around fears that the Fed will not live up to it's word on 'average inflation targeting' and will have to raise rates sooner and quicker than normal. I personally can't see this happening, as the Fed has shown itself to be extremely dovish and is trying to recover the real economy first (jobs ans solvency issues). \n\nThere is also the huge debt problem they now have from all the money printing they've done, the easiest way for them to solve that is to inflate it away as quickly as possible, so long term high inflation seems like something they would try for. I can't see the USA going into any kind of austerity to pay it off.",
        "created_utc": 1614894009,
        "id": "gppa9gs",
        "permalink": "/r/investing/comments/lxs4ue/the_relationship_between_stocks_and_interest_rates/gppa9gs/",
        "score": 49,
        "subreddit": "investing",
        "created": 1614922809.0
    },
    {
        "author": "RandomlyGenerateIt",
        "body": "That better be true, because I bought a bunch of AAPL/AMD/NVDA on margin on that first \"dip\", and now it doesn't feel so much like \"free money\" anymore...",
        "created_utc": 1614811378,
        "id": "gpl776l",
        "permalink": "/r/stocks/comments/lx4prb/do_not_panic_sell/gpl776l/",
        "score": 46,
        "subreddit": "stocks",
        "created": 1614840178.0
    },
    {
        "author": "billwaters",
        "body": " \n\nPositions: [https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o\\_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing](https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing) (not updated for today's shit performance)\n\nBeen doing exclusively put credit spreads since November, NVDA helped me get up to $144k gain, which is now all but wiped away from NVDA and TSLA in the last two weeks. GUH",
        "created_utc": 1614829809,
        "id": "gpm6lm3",
        "permalink": "/r/wallstreetbets/comments/lxbssi/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpm6lm3/",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1614858609.0
    },
    {
        "author": "theredmage333",
        "body": "I keep buying nvda on the big dips, no reason for them to be down",
        "created_utc": 1614829584,
        "id": "gpm67d3",
        "permalink": "/r/wallstreetbets/comments/lxbssi/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpm67d3/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614858384.0
    },
    {
        "author": "No-Pay3755",
        "body": "What are you holding? In the long run stonks go up. I’ve had plenty of companies that I wish I held on to but sold for small gains. NVDA at $9 that I sold in the $20’s 200 shares of AMD that I couldn’t wait to unload at $5.25 only to see it rip. 365 shares of AAPL at $65 that split many times since I sold it. I would have had 10,000+ shares by now but I sold at $85. I would have done better if I didn’t login at all sometimes. Hang tight. They will turn around. If you have to sell, just sell enough so you can sleep at night.",
        "created_utc": 1614802064,
        "id": "gpkm4mo",
        "permalink": "/r/stocks/comments/lx2vvg/ive_accepted_my_portfolio_is_going_to_zero/gpkm4mo/",
        "score": 25,
        "subreddit": "stocks",
        "created": 1614830864.0
    },
    {
        "author": "gerjerb",
        "body": "AAPL 145c 4/16\n\nNVDA 600c 4/16\n\nAMD 100c 4/16\n\nPLTR 35c 5/21\n\nTSLA 1000c 5/21\n\nABNB 250c 5/21\n\n\nI’m totally bullish on tech still. In a perfect storm, it’s barely shaken. Buy lots of cheap otm calls with over 30dte and meet me in the Seychelles.",
        "created_utc": 1614806314,
        "id": "gpkvyif",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpkvyif/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1614835114.0
    },
    {
        "author": "JonathanL73",
        "body": "I dont own Pltr, and I haven't bought NIO for a long time, until recently today after it was brought down a couple notches,and seem to hit a floor. $38 is a big difference from it being in the $60's. What I bought most of today was NVIDIA. I also got FNGU, NNDM. \n\nAlso I finally decided to pull the trigger on buying some tsla today at around $600, the last time I bought Tesla it was about $500\n\nI havent really bought much of anything for a while now until this week.\n\nEvery tech stock may be a meme stock, but I don't fomo buy when everybody else does. I buy when people are panic selling or if the market is red. The long-term bull-case for TSLA &amp; NIO is still strong despite the temporary semiconducter shortage. We are in a recovering economy not a collapsing one.\n\nI also bought some Costco &amp; Disney. Not all my stocks are tech. My ALLY financial stock has been doing great lately.",
        "created_utc": 1614895634,
        "id": "gppdxax",
        "permalink": "/r/StockMarket/comments/lxs16s/when_in_doubt_zoom_out/gppdxax/",
        "score": 22,
        "subreddit": "StockMarket",
        "created": 1614924434.0
    },
    {
        "author": "billwaters",
        "body": "Positions: [https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o\\_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing](https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing) (not updated for today's shit performance)\n\nBeen doing exclusively put credit spreads since November, NVDA helped me get up to $144k gain, which is now all but wiped away from NVDA and TSLA in the last two weeks. GUH",
        "created_utc": 1614829432,
        "id": "gpm5xan",
        "permalink": "/r/wallstreetbets/comments/lxbttu/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpm5xan/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1614858232.0
    },
    {
        "author": "calamitymic",
        "body": "Current gen ryzen chips are touted to be better than current gen intel. GPU game is gaining on nvidia. Ai software starting to utilize amd gpu. I think they are ready to take more market share. \n\nHaven’t bought the dip but I’m waiting for slight buying pressure. Then, I’m gonna go in dry as fuck because I need them to feel pain when I insert myself.\n\nTLDR: I’m bull dick bullish on AMD",
        "created_utc": 1614866733,
        "id": "gpnj8yg",
        "permalink": "/r/wallstreetbets/comments/lxl5ef/recent_dips_in_semiconductors_an_opening/gpnj8yg/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1614895533.0
    },
    {
        "author": "Krios625",
        "body": "Also invested in semiconductors with SMH, don't worry about anything serious. AMD and Nvidia had incredible quarters and their stock dropped, so it's more of an irrational market. Never forget that the stock market rewards the patient",
        "created_utc": 1614801066,
        "id": "gpkju1i",
        "permalink": "/r/stocks/comments/lx2i7z/wondering_if_anyone_here_can_offer_any_insight_on/gpkju1i/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1614829866.0
    },
    {
        "author": "billwaters",
        "body": "Cathie Wood sold NVDA wtf",
        "created_utc": 1614827972,
        "id": "gpm34r8",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpm34r8/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1614856772.0
    },
    {
        "author": "AllProWomenRespecter",
        "body": "Looks like this week is the one that I finally am fully BTFO\n\nLearn from me boys. Don't buy calls on companies that are actually fundamentally sound and report flawless earnings with huge current catalysts like NVDA.\n\nBuy calls on an ancient mortgage originator with a huge market cap and no growth potential instead.",
        "created_utc": 1614718387,
        "id": "gpghln9",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpghln9/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1614747187.0
    },
    {
        "author": "reginaldvs",
        "body": "I'm honestly shocked AMD is falling. I built my first AMD PC last year and Ryzen is killing it. Not to mention, their Radeon division is competitive with NVIDIA. But anyways, Is it because of the chip shortage? Who knows.",
        "created_utc": 1614824970,
        "id": "gplx68v",
        "permalink": "/r/options/comments/lx6g9c/amd_analysis_update/gplx68v/",
        "score": 13,
        "subreddit": "options",
        "created": 1614853770.0
    },
    {
        "author": "blastoff__",
        "body": "$NVDA is going to make people rich at this price. Their earnings were unbelievable, it’s only a matter of time before the acquisition of Arm Holdings goes through, and at that point they’ll have chips in 90% of the products we use daily. Not to mention EV’s &amp; crypto are in their future. I will say I’m in for a few shares at $580 so maybe not my smartest move, but I’m happy holding for the next 10 years.",
        "created_utc": 1614790335,
        "id": "gpjutlx",
        "permalink": "/r/stocks/comments/lwt9oz/what_stocks_do_you_believe_are_currently/gpjutlx/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1614819135.0
    },
    {
        "author": "Caesorius",
        "body": "She’s held NVDA shares for years, she’s 4X’d her $ on it. Plus it’s the same price it was a year ago. She needed $ for more PLTR",
        "created_utc": 1614839236,
        "id": "gpml5sh",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpml5sh/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1614868036.0
    },
    {
        "author": "RobotBrunch",
        "body": "AMD SOXL NVIDIA\n\nAll great stocks to own",
        "created_utc": 1614820835,
        "id": "gployh1",
        "permalink": "/r/stocks/comments/lx4prb/do_not_panic_sell/gployh1/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1614849635.0
    },
    {
        "author": "HaHawk",
        "body": "Exclusive advanced stock ratings from [Investing.com](https://Investing.com):\n\nApple: Strong Sell.\n\nAlphabet: Strong Sell.\n\nTesla: Strong Sell.\n\n[Amazon.com](https://Amazon.com): Strong Sell.\n\nFacebook: Strong Sell.\n\nNVIDIA: Strong Sell.\n\nThank you [investing.com](https://investing.com), very cool!",
        "created_utc": 1614827097,
        "id": "gpm1fpe",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpm1fpe/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614855897.0
    },
    {
        "author": "soonseen",
        "body": "Jim cramer. Buy nvda. \n\nRetail. Ok.\n\nNvda. Down 7 percent.",
        "created_utc": 1614791993,
        "id": "gpjypyg",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpjypyg/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614820793.0
    },
    {
        "author": "gerjerb",
        "body": "I’m not doing anything, we’ve seen an epic melt up in commodities and bonds. \n\n\nWe’re seeing real numbers for unemployment and the consequences of the covid shutdown and now the Texas deep freeze. \n\n\nNow it’s time for some insanity because algorithms are going to go crazy because we’re coming up on the anniversary of the covid crash from last year. \n\n\nThat being said: put your mouth guard in, strap into your seat, get ready for liftoff, and hope you don’t die of stroke on the way up.\n\n\nTSLA 720c 3/19\n\nAAPL 145c 4/16\n\nNVDA 600c 4/16\n\nAmd 100c 4/16\n\nPltr 35c 4/16\n\nTsla 1000c 5/21\n\nAbnb 250c 5/21\n\n\nThe chip hyper cycle is coming and EV and autonomous driving hype is consolidating into the real player in that space, Tesla. \n\n\nBut if y’all are scared, just buy $ARKK.",
        "created_utc": 1614865256,
        "id": "gpnggd1",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpnggd1/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614894056.0
    },
    {
        "author": "kaibasean",
        "body": "Nvidia is about to break the 500 barrier.\n\nAMD nearly at 79.\n\nWhat the fuck.",
        "created_utc": 1614850773,
        "id": "gpmxxk2",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpmxxk2/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614879573.0
    },
    {
        "author": "levon105",
        "body": "NVDA: Blowout earnings, record profits, beat all estimates\n\nMarket: Let's dump this bad boy -10%+ in 1 week.",
        "created_utc": 1614718465,
        "id": "gpghsfo",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpghsfo/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614747265.0
    },
    {
        "author": "kemar7856",
        "body": "Cathy lost it sells nvda to buy pltr",
        "created_utc": 1614818319,
        "id": "gplkr22",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gplkr22/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614847119.0
    },
    {
        "author": "wrb3",
        "body": "$700 price target for NVDA by several analysts. Is that  realistic?",
        "created_utc": 1614839611,
        "id": "gpmln2e",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpmln2e/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614868411.0
    },
    {
        "author": "soonseen",
        "body": "Quick!\n\n Let me sell my nvda and tesla for wd40 and sport clips!\n\n-facepalm-",
        "created_utc": 1614830626,
        "id": "gpm8215",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpm8215/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614859426.0
    },
    {
        "author": "goldcakes",
        "body": "Intel: 5.86B net income, 250B valuation.\n\nNvidia: 1.46B net income, 317B valuation.\n\nIntel is staging a turnaround and can easily become a growth play in the next 2-4 years, with the new technical CEO. As a PC parts enthusiast, they are already stepping up cadences and launching competitive lineups that are actually in stock, because they are being produced much more than TSMC's bottlenecked's fabs.\n\nThey are the company to watch.",
        "created_utc": 1614868663,
        "id": "gpnn1je",
        "permalink": "/r/investing/comments/lx6lm2/biden_administration_will_continue_chinese_tech/gpnn1je/",
        "score": 8,
        "subreddit": "investing",
        "created": 1614897463.0
    },
    {
        "author": "ThrallDoomhammer",
        "body": "Nvidia less than 500 is a huge buy and will mark the start of the tech rally again.  You heard it here first",
        "created_utc": 1614811401,
        "id": "gpl78ud",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpl78ud/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614840201.0
    },
    {
        "author": "billwaters",
        "body": "I sold these when NVDA was at 565 a week ago, though it couldn't go tits up lmao",
        "created_utc": 1614831781,
        "id": "gpma3e3",
        "permalink": "/r/wallstreetbets/comments/lxbssi/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpma3e3/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614860581.0
    },
    {
        "author": "rededreded",
        "body": "Sold my AMD......to buy Nvidia.",
        "created_utc": 1614806915,
        "id": "gpkxbwq",
        "permalink": "/r/stocks/comments/lx4prb/do_not_panic_sell/gpkxbwq/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1614835715.0
    },
    {
        "author": "TCGYT",
        "body": "I want a fucking GPU Nvidia, man. \n\nI wish this semi shortage would end, it would be good for my portfolio and my current waiting to build a new pc.",
        "created_utc": 1614794058,
        "id": "gpk3khe",
        "permalink": "/r/stocks/comments/lwqqa4/rstocks_daily_discussion_wednesday_mar_03_2021/gpk3khe/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1614822858.0
    },
    {
        "author": "siberianmi",
        "body": "As long as it's money you don't need now be patient, keep investing.\n\nWhen the crash came in 2007-2008 I was only a year or two into seriously investing into my retirement account.  That end of year statement was a bit of a \"Guh\" moment since everything I had earned plus some basically had evaporated.   But, wasn't like I was going to touch that money then.  I did nothing to change the strategy I had picked for investing and instead doubled up on my 401k contributions.\n\nBest decision I ever made in regards to my retirement investments -- I came out way ahead because I was able to buy more while everything was recovering.\n\nMy biggest regret over the last year is when COVID hit I was too focused on the disaster itself and neglected to make any real changes to how I was investing to take better advantage of it.  If this continues and goes deeper - don't look at it as a loss if your investing for the long term.  Look at as an opportunity to get more potential long term value out of the money you put in now. \n\nAs a current example - I bought NVIDIA because I believed they have a potential for real growth through the autonomous vehicle industry.  But, yeah stocks down since I invested in it.  Bought more this morning - why?  I **STILL** believe it's going to grow in the next 5-years because of the rise of autonomous vehicles tech.  *It's just on sale now.*",
        "created_utc": 1614887139,
        "id": "gpou1pe",
        "permalink": "/r/StockMarket/comments/lxr1jo/weird_times/gpou1pe/",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1614915939.0
    },
    {
        "author": "HarbingersRefuge",
        "body": "NVDA too",
        "created_utc": 1614747433,
        "id": "gpi37yg",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpi37yg/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614776233.0
    },
    {
        "author": "ErectHippo",
        "body": "NVDA is a no-brainer under $500",
        "created_utc": 1614890122,
        "id": "gpp14sx",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpp14sx/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614918922.0
    },
    {
        "author": "Invincilble",
        "body": "Nvidia can fuck off. So fucking gay",
        "created_utc": 1614779212,
        "id": "gpj6naq",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpj6naq/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614808012.0
    },
    {
        "author": "-Lemony",
        "body": "It's only too late the moment I invest in it. They have trackers on my tail, watching every trade I make. \n\nApple? Dropped like a rock after I put a buy order of 10 of em. Nvidia? How about I fall 5% the moment you finalize your trade. The Dow? How about we drop 300+ points, we saw you checking on it through your mobile app",
        "created_utc": 1614732592,
        "id": "gphbht8",
        "permalink": "/r/stocks/comments/lwf73q/will_rkt_drop_tomorrow_thoughts/gphbht8/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1614761392.0
    },
    {
        "author": "718cs",
        "body": "This dumbass thought he was buying 100k of NVDA calls for next month but was trying to get the trade in quick so I accidentally bought 100k that expire in 2 days.\n\nSold that shit real quick 15 mins later for 118k. Glad I noticed the ex date sooner rather than later.",
        "created_utc": 1614788135,
        "id": "gpjpnjr",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpjpnjr/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614816935.0
    },
    {
        "author": "rededreded",
        "body": "So high on NVDA not only for their GPUs. Data center sector and their CUDA programming IMO is huge, on top of those guaranteed sales.",
        "created_utc": 1614809172,
        "id": "gpl2gcx",
        "permalink": "/r/stocks/comments/lx4prb/do_not_panic_sell/gpl2gcx/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1614837972.0
    },
    {
        "author": "Clutch3131",
        "body": "You’re comparing GameStop ($8.6B MC) to Amazon, Apple, Facebook, google, nvidia and amd? Companies that are worth hundreds of billions/trillions of dollars? Lmao. What do you think is easier to manipulate? A company worth $2 trillion or a company worth $8 billion. You sir, are in fact, the retard here.",
        "created_utc": 1614811582,
        "id": "gpl7mll",
        "permalink": "/r/wallstreetbets/comments/lx5p2j/gme_and_citadel_why_the_consolidation/gpl7mll/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614840382.0
    },
    {
        "author": "AllProWomenRespecter",
        "body": "Praying that NVDA can gap up to $512 tomorrow which is *checks notes* what they were trading at at noon today.",
        "created_utc": 1614896878,
        "id": "gppgnat",
        "permalink": "/r/wallstreetbets/comments/lxva6s/what_are_your_moves_tomorrow_march_05_2021/gppgnat/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614925678.0
    },
    {
        "author": "HarbingersRefuge",
        "body": "NVDA looks poised to spring up tomorrow. Up in AH after falling to form a double bottom today. Normally jumps up bigly after a day this red.",
        "created_utc": 1614750654,
        "id": "gpi7yv3",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpi7yv3/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614779454.0
    },
    {
        "author": "NaNaNaNaNaNaNaNaNa65",
        "body": "Honestly the play is always apple and nvidia",
        "created_utc": 1614741065,
        "id": "gphs08c",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gphs08c/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614769865.0
    },
    {
        "author": "billwaters",
        "body": "I for one welcome our new RKT overlords over GME  \n\n\nalso fuck you NVDA   \n\n\nAMZN 4450c 8/21\n\n(This is financial advice)",
        "created_utc": 1614718945,
        "id": "gpgiy0e",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpgiy0e/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614747745.0
    },
    {
        "author": "NikkiXoLynnn",
        "body": "NVDA for me as well. Almost got them last month but chose other ones instead. NTDOY has to go up with that new game. Put them off last month as well to buy EA and GLUU so I’ll add them now. NFLX and AAPL just because I haven’t gotten around to those two yet. SIX isn’t down and hasn’t been in over a month but they’re doing so well for my simulator that I’m getting FOMO and might toss a bit their way as well. And want to add to my PINS.",
        "created_utc": 1614820111,
        "id": "gplnnxf",
        "permalink": "/r/stocks/comments/lx8dqb/what_are_we_buying_during_this_sale/gplnnxf/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1614848911.0
    },
    {
        "author": "NrdRage",
        "body": "I mean, the chasers (I'm looking at you UWMC, RKT, GME) are fucking themselves, but in a broader market perspective, it's really starting to look like the hedge funds strategy to beat the era of instant information is to simply lean their chipstack in to try and get retail to leave the market and never come back.  Some of this price action the last couple of weeks just defies any semblance of logic.  Companies like $NVDA should be sitting at 600 right now.  There's zero reason why $BE (the most interesting story in the energy space, IMO) goes from 42 to 27 in 2 weeks.  Texas has a once-in-a-generation snowstorm and all of a sudden all the solar plays are dead?  Commodity semis literally can't make their product fast enough and they get hammered. First trillion dollar quarter in history and it sells off, etc.",
        "created_utc": 1614792973,
        "id": "gpk10up",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpk10up/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614821773.0
    },
    {
        "author": "billwaters",
        "body": "NVDA FUCK YOUUUUUU",
        "created_utc": 1614795051,
        "id": "gpk5vu1",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpk5vu1/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614823851.0
    },
    {
        "author": "laetus",
        "body": "What company isn't 'growth and integration into every facet of modern life' at the moment? Every company will claim that. \n\nAnd even if it's true, that doesn't mean the stock has to grow with it (see Amazon stock ~2000).\n\nAlso, NVDA missed earnings estimate. (basically every time)",
        "created_utc": 1614841440,
        "id": "gpmnutt",
        "permalink": "/r/wallstreetbets/comments/lxbssi/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpmnutt/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614870240.0
    },
    {
        "author": "billwaters",
        "body": "NVDA is the most punished stock in the market right now no cap.   \n\n\nNVDA gang been down bad for a  while :( hang in there fam",
        "created_utc": 1614883859,
        "id": "gpom2nu",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpom2nu/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614912659.0
    },
    {
        "author": "Prune-Spare",
        "body": "Tomorrow is a broken record. Adding a little more #UAL #CUK and #NVDA if they are red at any point in the day   Nice to see #RKT paying off. Got principal out and now riding all profit.",
        "created_utc": 1614734427,
        "id": "gphf0vx",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gphf0vx/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614763227.0
    },
    {
        "author": "billwaters",
        "body": "NVDA GUH  \n\n\nDumps when market is green  \nDumps when market is red",
        "created_utc": 1614716995,
        "id": "gpgeao0",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpgeao0/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614745795.0
    },
    {
        "author": "billwaters",
        "body": "3 more days of pain and praying NVDA stays above 535 god fucking dammit",
        "created_utc": 1614728126,
        "id": "gph2rzp",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gph2rzp/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614756926.0
    },
    {
        "author": "notpr1m",
        "body": "Yes. Buy AMD. Better tech than Intel but cheaper than NVIDIA, no fabrication operations because they were losing money on it a few years ago so sold it off to focus on design, which I think gives them more flexibility to adapt to capitalize on any investments that could be coming from the public sector, and they probably aren’t bleeding money from production constraints like the others. Probably the best CEO in the space as well. \n\nI also like Qualcomm a lot for similar reasons, but also because they’re positioned to win big in 5G and will probably do well in the IoT space as well. Much more mature company too with a nice dividend ($.65/share).",
        "created_utc": 1614828778,
        "id": "gpm4pgl",
        "permalink": "/r/wallstreetbets/comments/lxat6o/chip_shortages_and_auto_plant_shutdowns_holy/gpm4pgl/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614857578.0
    },
    {
        "author": "molinasnecktat",
        "body": "Nvda a buy? This looks so juicy",
        "created_utc": 1614868972,
        "id": "gpnnowo",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpnnowo/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614897772.0
    },
    {
        "author": "rich01992",
        "body": "NvDa a buy at $494??",
        "created_utc": 1614900498,
        "id": "gppo4fd",
        "permalink": "/r/wallstreetbets/comments/lxva6s/what_are_your_moves_tomorrow_march_05_2021/gppo4fd/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614929298.0
    },
    {
        "author": "stayLegend",
        "body": "Are you telling me that putting my networth into chewy, nvidia, and palantir was a bad idea",
        "created_utc": 1614784631,
        "id": "gpjhq06",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpjhq06/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614813431.0
    },
    {
        "author": "italiangreenbeans",
        "body": "It really depends on what happens in the future in terms of new chip sets and cards. The newest Ryzen chips are incredible, in terms of price to performance, and their newest set of graphics cards, while suffering from the same shortage as their only real competition, nVidia, have on par performance specs for 25% less. I've been an Intel/nVidia user since I built my first PC years ago, but in the last few generations of chips and cards, I've always recommended AMD products to my friends looking to build PCs. In fact, if you look on the logicalincrements website, which is a very popular resource for speccing out a new PC, each and every recommended CPU is AMD. They were small, and overlooked in the past, but they are dominating as of late.\n\nLooking at the prices of the stocks, AMD is still less than 1/3 the market cap of NVDA, despite the fact that NVDA only makes GPUs, while AMD makes both CPUs and GPUs. If you look at Intel, they have 2.5x the market cap of AMD, and they only make CPUs.\n\nWith the way AMD's chips have been performing, and the fact that they are outperforming on both isles of the PC gaming industry, I think they'll end up doing very well. A stock price of $250+ is not out of the question imo.",
        "created_utc": 1614800213,
        "id": "gpkhuq3",
        "permalink": "/r/wallstreetbets/comments/lx1xqn/dd_on_amd_and_why_i_believe_it_is_undervalued/gpkhuq3/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614829013.0
    },
    {
        "author": "LeoFireGod",
        "body": "God I need $NVDA and $TSLA to have big weeks next week",
        "created_utc": 1614803473,
        "id": "gpkpctn",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpkpctn/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614832273.0
    },
    {
        "author": "kaos424",
        "body": "Im 35. Have a small roth ira. I put money in disney, nvidia, Walmart, pinterest, prnt, arkk, vt, msos, qcln, and betz. Getting slaughtered lately. I recognize most of market is red lately but I feel extra red lol. Should I make some adjustments or ride it out?",
        "created_utc": 1614801692,
        "id": "gpklaae",
        "permalink": "/r/investing/comments/lwqaj9/daily_advice_thread_all_basic_help_or_advice/gpklaae/",
        "score": 6,
        "subreddit": "investing",
        "created": 1614830492.0
    },
    {
        "author": "cartpusherbilly",
        "body": "Wtf is wrong with NVDA I’m pretty sure it’s just waiting for me to sell my dam call.",
        "created_utc": 1614713190,
        "id": "gpg5gcr",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpg5gcr/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614741990.0
    },
    {
        "author": "RPMayhem",
        "body": "NVDA you bitch",
        "created_utc": 1614785996,
        "id": "gpjkruf",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpjkruf/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614814796.0
    },
    {
        "author": "RPMayhem",
        "body": "call me retarded but my 20k on NVDA calls have a good feeling about march",
        "created_utc": 1614753032,
        "id": "gpib5ge",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpib5ge/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614781832.0
    },
    {
        "author": "IchBleibZuhause",
        "body": "Buy again bro, that’s an opportunity! The way is clear for Nvidia. \nSome Sektors can be ignored, but Nvidia can’t be.",
        "created_utc": 1614846816,
        "id": "gpmtvl4",
        "permalink": "/r/options/comments/lxfzv8/holding_nvda_dec_call_and_down_30/gpmtvl4/",
        "score": 5,
        "subreddit": "options",
        "created": 1614875616.0
    },
    {
        "author": "billwaters",
        "body": "What are the odds that I can hold these NVDA 535p I sold that expire on Friday either:\n\na) Expire ITM and don't get assigned\n\nb) Magically expire worthless due to a magical pump from the heavens\n\nc) Requires me to $ROPE",
        "created_utc": 1614826070,
        "id": "gplzf4x",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gplzf4x/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614854870.0
    },
    {
        "author": "cloudburn24",
        "body": "GOD DAMN, Nvidia out here fuckin DYIN'",
        "created_utc": 1614895764,
        "id": "gppe81u",
        "permalink": "/r/wallstreetbets/comments/lxva6s/what_are_your_moves_tomorrow_march_05_2021/gppe81u/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614924564.0
    },
    {
        "author": "auscontract",
        "body": "I’ve been taking a bath on NVDA also man it’s some unusual price action after earnings that’s to say the least.",
        "created_utc": 1614832446,
        "id": "gpmb7mq",
        "permalink": "/r/wallstreetbets/comments/lxbssi/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpmb7mq/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614861246.0
    },
    {
        "author": "gb2075",
        "body": "I’ve been researching semi-conductors in depth the past few days. \n\nI’m eyeing the big retail guys like INTC, NVDA, AMD (agreed with you that AMD is the most promising).\n\nThe other segment is the fabricators, they don’t sell chips they just produce them for other companies. I’m keeping tabs on AMAT, TSM, LRCX, NXPI, FORM, UMC).\n\nThen finally the rare earth metals.. companies like MP, AMAT, VALE (I was long on these guys then they got a fucking $7B fine for killing 300 people in a dam explosion.... oops).\n\nLook into Biden’s recent executive order, not only does he address the global semiconductor shortage, but plans to bring jobs back to the states and invest in American companies. MP Materials is the only US based company REM company. \n\nThis all looks so obvious as a long term play. I forget where I read it, but the global semiconductor usage is going to 10x or something insane like that in the next 10 years.\n\nI don’t know why all of these companies are down recently, I haven’t looked into it. I bought $10 worth of every stock listed above so I could keep tabs on them. All of them have followed the same negative trajectory the last month or so. If you zoom out to 5 year though, almost every single company shows insane growth. I imagine that growth will only compound long term. Do you have any thoughts on the reason for this recent downward trend? \n\nI’m considering making a pretty massive 5-10 year long play on semiconductors.",
        "created_utc": 1614872359,
        "id": "gpnv7ia",
        "permalink": "/r/wallstreetbets/comments/lxl5ef/recent_dips_in_semiconductors_an_opening/gpnv7ia/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614901159.0
    },
    {
        "author": "Aspire17",
        "body": "Nvidia looks nice... but don't let me divert your attention from GME",
        "created_utc": 1614764290,
        "id": "gpinozz",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpinozz/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614793090.0
    },
    {
        "author": "Master_Relative",
        "body": "Could NVDA have one Green Day?????????",
        "created_utc": 1614782213,
        "id": "gpjchhm",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpjchhm/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614811013.0
    },
    {
        "author": "billwaters",
        "body": "Welp lads, it's been a fun ride: -83k&gt;144k&gt;70k&gt;40k&gt;down to my last 12k.  \nIt'll go to almost 0 if NVDA doesn't go back to 535 EOW b/c my put credit spreads.  \n\n\nGUH",
        "created_utc": 1614801843,
        "id": "gpklmus",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpklmus/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614830643.0
    },
    {
        "author": "diamondxtyler",
        "body": "Any insight on NVDA? All i can see in research is positives, but it just keeps going down..",
        "created_utc": 1614718824,
        "id": "gpginhs",
        "permalink": "/r/stocks/comments/lvz0ry/rstocks_daily_discussion_technicals_tuesday_mar/gpginhs/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1614747624.0
    },
    {
        "author": "and-again-and-again",
        "body": "NVDA could you please just stop doing whatever it is your are doing",
        "created_utc": 1614794144,
        "id": "gpk3rvd",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpk3rvd/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614822944.0
    },
    {
        "author": "AlfaGiuliaQ2",
        "body": "I god damn hope so. Wtf man I’m getting smooooked in nvda",
        "created_utc": 1614824272,
        "id": "gplvqxb",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gplvqxb/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614853072.0
    },
    {
        "author": "Invincilble",
        "body": "Hope Nvidia and Roku pop off tomorrow",
        "created_utc": 1614743655,
        "id": "gphwubn",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gphwubn/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614772455.0
    },
    {
        "author": "chris_g17",
        "body": "Nvda, Crsr, U, psth",
        "created_utc": 1614903048,
        "id": "gppt4us",
        "permalink": "/r/stocks/comments/lxydzc/what_stocks_did_you_buy_today/gppt4us/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1614931848.0
    },
    {
        "author": "Master_Relative",
        "body": "NVDA $465 EOD",
        "created_utc": 1614878920,
        "id": "gpoaczr",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpoaczr/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614907720.0
    },
    {
        "author": "BedtimeTorture",
        "body": "Yeeeaah these SPY puts and NVDA puts are making me hella green despite everything else I own bleeding fast",
        "created_utc": 1614880304,
        "id": "gpodllc",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpodllc/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614909104.0
    },
    {
        "author": "billwaters",
        "body": "NVDA is so agonizing, like just fly already, $600 is where you belong",
        "created_utc": 1614700471,
        "id": "gpfc5k2",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpfc5k2/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614729271.0
    },
    {
        "author": "InternJedi",
        "body": "Life is bad. But it can be badder.\n\nI remember selling BA at like 199 thinking that yeah it was total toast. But now it's the only thing that has been rising since last week. All my drivers: NVDA, TSLA, AMD all drove themselves straight into a lemon tree.",
        "created_utc": 1614869587,
        "id": "gpnozqg",
        "permalink": "/r/stocks/comments/lxhle7/rstocks_daily_discussion_options_trading_thursday/gpnozqg/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1614898387.0
    },
    {
        "author": "SteveAM1",
        "body": "&gt; Thinking back to 2018, AMD, Nvidia, Google etc were all soaring despite the 10 year treasury reaching over 3%.\n\nAnd what were the valuations of those compared to today?",
        "created_utc": 1614894174,
        "id": "gppan35",
        "permalink": "/r/investing/comments/lxs4ue/the_relationship_between_stocks_and_interest_rates/gppan35/",
        "score": 5,
        "subreddit": "investing",
        "created": 1614922974.0
    },
    {
        "author": "HarbingersRefuge",
        "body": "NVDA",
        "created_utc": 1614752125,
        "id": "gpi9yn2",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpi9yn2/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614780925.0
    },
    {
        "author": "Bonhomme7h",
        "body": "There is a primal part in my brain that still feel like a kid in a candy store and see these prices as amazing buying opportunities. Until the memory part remind it what appended when we tried to buy the dip 2 weeks ago. And average down last week. Still! Sub 500 NVDA! 🤩",
        "created_utc": 1614895471,
        "id": "gppdkdw",
        "permalink": "/r/wallstreetbets/comments/lxva6s/what_are_your_moves_tomorrow_march_05_2021/gppdkdw/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614924271.0
    },
    {
        "author": "soonseen",
        "body": "Cramer: buy nvda! \n\n*been trading sideways all year*",
        "created_utc": 1614726725,
        "id": "gph00ft",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gph00ft/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614755525.0
    },
    {
        "author": "billwaters",
        "body": "Just need NVDA to go back to 535 by friday ezpz  \n$10 gap up tomorrow, $15 gap up friday",
        "created_utc": 1614809513,
        "id": "gpl37go",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpl37go/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614838313.0
    },
    {
        "author": "RyChrome",
        "body": "Nvda below $500 😔",
        "created_utc": 1614870751,
        "id": "gpnrkgg",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpnrkgg/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614899551.0
    },
    {
        "author": "LeoFireGod",
        "body": "Cause I bought NVDA. Instead",
        "created_utc": 1614836841,
        "id": "gpmhzh2",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpmhzh2/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614865641.0
    },
    {
        "author": "TrashOfOil",
        "body": "HAL, SQ &amp; NVDA if you’re curious. I didn’t get into GME until October I believe",
        "created_utc": 1614848572,
        "id": "gpmvojk",
        "permalink": "/r/wallstreetbets/comments/lx850f/1400_to_75k_in_the_past_year/gpmvojk/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614877372.0
    },
    {
        "author": "alfapredator",
        "body": "Inverse Cathie Wood\n\nputs on ARKK calls on NVDA",
        "created_utc": 1614828129,
        "id": "gpm3g6f",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpm3g6f/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614856929.0
    },
    {
        "author": "JonathanL73",
        "body": "I didnt buy nasdaq funds, the stocks i bought were down more than that. I bought NVIDIA the most. Ive been waiting for a while for that one to go on sale",
        "created_utc": 1614896951,
        "id": "gppgszk",
        "permalink": "/r/StockMarket/comments/lxs16s/when_in_doubt_zoom_out/gppgszk/",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1614925751.0
    },
    {
        "author": "Master_Relative",
        "body": "Jesus NVDA",
        "created_utc": 1614882931,
        "id": "gpojuvq",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpojuvq/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614911731.0
    },
    {
        "author": "cathedralbones",
        "body": "How would NVDA see a spike from this? Roblox will be huge. I do like Unity as I recently became more aware of just how much is done in the engine. EA can suck it I don’t much care for them.",
        "created_utc": 1614798029,
        "id": "gpkcsho",
        "permalink": "/r/wallstreetbets/comments/lx13n5/when_gamestonk_moons_what_stocks_will_follow_the/gpkcsho/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614826829.0
    },
    {
        "author": "Individual_Error_428",
        "body": "Nah she manages her portfolio so big blue chip tech like nvda. Amazon, apple. And all these stocks are like cash storage... so she’s really going hard into dips rn. Mama wood I hope ur right but I’m scafed",
        "created_utc": 1614824410,
        "id": "gplw12p",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gplw12p/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614853210.0
    },
    {
        "author": "FreyBentos",
        "body": "SEmi conductors are made from silicon, the most abundnat material on eartth. We literally can extract it from sand lol, the whole \"semi conductor shortage\" is over blown nonsense if you actually know anything about them. The only thing there is a shortage of is slots at TSMC's fabrication plant as they are the best in the business and AMD(and therefore the xbox/ps5 is affected), Nvidia, Apple and now Intel want them all to make their processors for them. The processors for everything else well we have plenty of fabrication plants that can make them not everything needs to be leading edge 7nm",
        "created_utc": 1614843520,
        "id": "gpmqa3l",
        "permalink": "/r/pennystocks/comments/lxclrh/dnn_flow_through_shares_looming_supercycle/gpmqa3l/",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1614872320.0
    },
    {
        "author": "wsb-narrator",
        "body": "If nvda hits 400 this week. 15 ice cubes in my ass.",
        "created_utc": 1614703403,
        "id": "gpfir6l",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpfir6l/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614732203.0
    },
    {
        "author": "geospec24",
        "body": "Why be bullish on GME? Pokemon and Nvidia. Also, you can go preorder Brilliant Diamond and Shining Pearl on their website.",
        "created_utc": 1614740663,
        "id": "gphr5f2",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gphr5f2/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614769463.0
    },
    {
        "author": "Den_er_i_vinkel",
        "body": "Besides the usual meme suspects, I got the following Tickers I think have a huge upside:\n\nCRSR  \nBABA  \nFB  \nNVDA  \nDIS\n\nAlready balls deep in DIS and CRSR, I will buy some BABA today",
        "created_utc": 1614762012,
        "id": "gpilc17",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpilc17/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614790812.0
    },
    {
        "author": "bagtf3",
        "body": "Need nvda to not do me dirty here...",
        "created_utc": 1614779722,
        "id": "gpj7kv7",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpj7kv7/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614808522.0
    },
    {
        "author": "FromSinbad2Sinworse",
        "body": "NVDA - \"Come on, man!\"",
        "created_utc": 1614783392,
        "id": "gpjf01w",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpjf01w/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614812192.0
    },
    {
        "author": "Kembawalker1",
        "body": "What dip is our favorite men? NIO? NVDA? NFLX? Too many to choose",
        "created_utc": 1614861519,
        "id": "gpnadph",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpnadph/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614890319.0
    },
    {
        "author": "papaelontakemetomars",
        "body": "GME Shares &amp; Nvidia Puts...\n\nGood day",
        "created_utc": 1614870098,
        "id": "gpnq407",
        "permalink": "/r/wallstreetbets/comments/lxkint/gme_megathread_for_march_04_2021/gpnq407/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614898898.0
    },
    {
        "author": "Miker1730",
        "body": "bought some NVDA , this dip",
        "created_utc": 1614795386,
        "id": "gpk6nqy",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpk6nqy/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614824186.0
    },
    {
        "author": "budispro",
        "body": "can NVDA go bacc up plz, i'm tired of rolling these spreads... I never thought this stock would drop 100, but stock was high just wanted to be high longer lol",
        "created_utc": 1614889021,
        "id": "gpoyj1y",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpoyj1y/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614917821.0
    },
    {
        "author": "TayahuaJ",
        "body": "SQ, PYPL, AMZN, GOOG, MSFT, NVDA are all \"tech growth\" stocks I own, each about 5% of my non-retirement bucket.",
        "created_utc": 1614876912,
        "id": "gpo5p65",
        "permalink": "/r/stocks/comments/lxo7om/warren_buffets_stock_strategy_is_more_relevant/gpo5p65/",
        "score": 58,
        "subreddit": "stocks",
        "created": 1614905712.0
    },
    {
        "author": "conti555",
        "body": "I think people are taking the DCF valuation theory too seriously. Thinking back to 2018, AMD, Nvidia, Google etc were all soaring despite the 10 year treasury reaching over 3%. What percentage of the market values companies purely in DCF anyway?\n\nI think this is more a broader correction around fears that the Fed will not live up to it's word on 'average inflation targeting' and will have to raise rates sooner and quicker than normal. I personally can't see this happening, as the Fed has shown itself to be extremely dovish and is trying to recover the real economy first (jobs ans solvency issues). \n\nThere is also the huge debt problem they now have from all the money printing they've done, the easiest way for them to solve that is to inflate it away as quickly as possible, so long term high inflation seems like something they would try for. I can't see the USA going into any kind of austerity to pay it off.",
        "created_utc": 1614894009,
        "id": "gppa9gs",
        "permalink": "/r/investing/comments/lxs4ue/the_relationship_between_stocks_and_interest_rates/gppa9gs/",
        "score": 49,
        "subreddit": "investing",
        "created": 1614922809.0
    },
    {
        "author": "RandomlyGenerateIt",
        "body": "That better be true, because I bought a bunch of AAPL/AMD/NVDA on margin on that first \"dip\", and now it doesn't feel so much like \"free money\" anymore...",
        "created_utc": 1614811378,
        "id": "gpl776l",
        "permalink": "/r/stocks/comments/lx4prb/do_not_panic_sell/gpl776l/",
        "score": 46,
        "subreddit": "stocks",
        "created": 1614840178.0
    },
    {
        "author": "billwaters",
        "body": " \n\nPositions: [https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o\\_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing](https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing) (not updated for today's shit performance)\n\nBeen doing exclusively put credit spreads since November, NVDA helped me get up to $144k gain, which is now all but wiped away from NVDA and TSLA in the last two weeks. GUH",
        "created_utc": 1614829809,
        "id": "gpm6lm3",
        "permalink": "/r/wallstreetbets/comments/lxbssi/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpm6lm3/",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1614858609.0
    },
    {
        "author": "theredmage333",
        "body": "I keep buying nvda on the big dips, no reason for them to be down",
        "created_utc": 1614829584,
        "id": "gpm67d3",
        "permalink": "/r/wallstreetbets/comments/lxbssi/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpm67d3/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614858384.0
    },
    {
        "author": "No-Pay3755",
        "body": "What are you holding? In the long run stonks go up. I’ve had plenty of companies that I wish I held on to but sold for small gains. NVDA at $9 that I sold in the $20’s 200 shares of AMD that I couldn’t wait to unload at $5.25 only to see it rip. 365 shares of AAPL at $65 that split many times since I sold it. I would have had 10,000+ shares by now but I sold at $85. I would have done better if I didn’t login at all sometimes. Hang tight. They will turn around. If you have to sell, just sell enough so you can sleep at night.",
        "created_utc": 1614802064,
        "id": "gpkm4mo",
        "permalink": "/r/stocks/comments/lx2vvg/ive_accepted_my_portfolio_is_going_to_zero/gpkm4mo/",
        "score": 25,
        "subreddit": "stocks",
        "created": 1614830864.0
    },
    {
        "author": "gerjerb",
        "body": "AAPL 145c 4/16\n\nNVDA 600c 4/16\n\nAMD 100c 4/16\n\nPLTR 35c 5/21\n\nTSLA 1000c 5/21\n\nABNB 250c 5/21\n\n\nI’m totally bullish on tech still. In a perfect storm, it’s barely shaken. Buy lots of cheap otm calls with over 30dte and meet me in the Seychelles.",
        "created_utc": 1614806314,
        "id": "gpkvyif",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpkvyif/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1614835114.0
    },
    {
        "author": "JonathanL73",
        "body": "I dont own Pltr, and I haven't bought NIO for a long time, until recently today after it was brought down a couple notches,and seem to hit a floor. $38 is a big difference from it being in the $60's. What I bought most of today was NVIDIA. I also got FNGU, NNDM. \n\nAlso I finally decided to pull the trigger on buying some tsla today at around $600, the last time I bought Tesla it was about $500\n\nI havent really bought much of anything for a while now until this week.\n\nEvery tech stock may be a meme stock, but I don't fomo buy when everybody else does. I buy when people are panic selling or if the market is red. The long-term bull-case for TSLA &amp; NIO is still strong despite the temporary semiconducter shortage. We are in a recovering economy not a collapsing one.\n\nI also bought some Costco &amp; Disney. Not all my stocks are tech. My ALLY financial stock has been doing great lately.",
        "created_utc": 1614895634,
        "id": "gppdxax",
        "permalink": "/r/StockMarket/comments/lxs16s/when_in_doubt_zoom_out/gppdxax/",
        "score": 22,
        "subreddit": "StockMarket",
        "created": 1614924434.0
    },
    {
        "author": "billwaters",
        "body": "Positions: [https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o\\_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing](https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing) (not updated for today's shit performance)\n\nBeen doing exclusively put credit spreads since November, NVDA helped me get up to $144k gain, which is now all but wiped away from NVDA and TSLA in the last two weeks. GUH",
        "created_utc": 1614829432,
        "id": "gpm5xan",
        "permalink": "/r/wallstreetbets/comments/lxbttu/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpm5xan/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1614858232.0
    },
    {
        "author": "calamitymic",
        "body": "Current gen ryzen chips are touted to be better than current gen intel. GPU game is gaining on nvidia. Ai software starting to utilize amd gpu. I think they are ready to take more market share. \n\nHaven’t bought the dip but I’m waiting for slight buying pressure. Then, I’m gonna go in dry as fuck because I need them to feel pain when I insert myself.\n\nTLDR: I’m bull dick bullish on AMD",
        "created_utc": 1614866733,
        "id": "gpnj8yg",
        "permalink": "/r/wallstreetbets/comments/lxl5ef/recent_dips_in_semiconductors_an_opening/gpnj8yg/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1614895533.0
    },
    {
        "author": "RipInPepz",
        "body": "Selling my rtx3080 today to buy 10 more shares. Gt1030 here I come. I like the stock. Fuck you nvidia.",
        "created_utc": 1615218505,
        "id": "gq7yk32",
        "permalink": "/r/wallstreetbets/comments/m0fpgd/gme_megathread_for_march_08_2021/gq7yk32/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1615247305.0
    },
    {
        "author": "ihavenipplefocker",
        "body": "Dude is a clown. Ripping Cathie Wood and two seconds later talking with Dave Portnoy about an ETF he’s involved with that tracks social media stocks (meme stocks). Meanwhile Cramer telling people to buy NVIDIA 10% ago and nothing is to be said.",
        "created_utc": 1615248598,
        "id": "gq9u06x",
        "permalink": "/r/stocks/comments/m0t7z9/wheres_cramer/gq9u06x/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1615277398.0
    },
    {
        "author": "al_walid4",
        "body": "Nvidia literally can't produce enough to keep up with demand\n\nClearly that means the stock must tank by over 20%",
        "created_utc": 1615234527,
        "id": "gq90b4i",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq90b4i/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1615263327.0
    },
    {
        "author": "bagtf3",
        "body": "I got 99 problems and 3 of them are GOEV NVDA and AAPL.",
        "created_utc": 1615265941,
        "id": "gqaompw",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqaompw/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1615294741.0
    },
    {
        "author": "BryGuyTI",
        "body": "TSLA, NVDA, and ARKK have been fucking me so hard.",
        "created_utc": 1615237694,
        "id": "gq97mjz",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq97mjz/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1615266494.0
    },
    {
        "author": "captainstrange94",
        "body": "Lol bro companies like amd, nvidia, amzn have lost gains going back to july 2020.",
        "created_utc": 1615234617,
        "id": "gq90isn",
        "permalink": "/r/stocks/comments/m0cz9v/rstocks_daily_discussion_monday_mar_08_2021/gq90isn/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1615263417.0
    },
    {
        "author": "Krios625",
        "body": "Also invested in semiconductors with SMH, don't worry about anything serious. AMD and Nvidia had incredible quarters and their stock dropped, so it's more of an irrational market. Never forget that the stock market rewards the patient",
        "created_utc": 1614801066,
        "id": "gpkju1i",
        "permalink": "/r/stocks/comments/lx2i7z/wondering_if_anyone_here_can_offer_any_insight_on/gpkju1i/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1614829866.0
    },
    {
        "author": "billwaters",
        "body": "Cathie Wood sold NVDA wtf",
        "created_utc": 1614827972,
        "id": "gpm34r8",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpm34r8/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1614856772.0
    },
    {
        "author": "AllProWomenRespecter",
        "body": "Looks like this week is the one that I finally am fully BTFO\n\nLearn from me boys. Don't buy calls on companies that are actually fundamentally sound and report flawless earnings with huge current catalysts like NVDA.\n\nBuy calls on an ancient mortgage originator with a huge market cap and no growth potential instead.",
        "created_utc": 1614718387,
        "id": "gpghln9",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpghln9/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1614747187.0
    },
    {
        "author": "reginaldvs",
        "body": "I'm honestly shocked AMD is falling. I built my first AMD PC last year and Ryzen is killing it. Not to mention, their Radeon division is competitive with NVIDIA. But anyways, Is it because of the chip shortage? Who knows.",
        "created_utc": 1614824970,
        "id": "gplx68v",
        "permalink": "/r/options/comments/lx6g9c/amd_analysis_update/gplx68v/",
        "score": 13,
        "subreddit": "options",
        "created": 1614853770.0
    },
    {
        "author": "blastoff__",
        "body": "$NVDA is going to make people rich at this price. Their earnings were unbelievable, it’s only a matter of time before the acquisition of Arm Holdings goes through, and at that point they’ll have chips in 90% of the products we use daily. Not to mention EV’s &amp; crypto are in their future. I will say I’m in for a few shares at $580 so maybe not my smartest move, but I’m happy holding for the next 10 years.",
        "created_utc": 1614790335,
        "id": "gpjutlx",
        "permalink": "/r/stocks/comments/lwt9oz/what_stocks_do_you_believe_are_currently/gpjutlx/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1614819135.0
    },
    {
        "author": "areweinnarnia",
        "body": "do it! over the years I've just invested in stuff I like from companies I believed in - Jack in the box after I had their dollar tacos for the first time, AMD and Nvidia when I did my first pc build, Nintendo in the Wii U era when everyone thought the Wii U was shit and that a mobile game catching pokemon would never work.  \nMy only regret is that I didn't have more then a couple hundred in each of them.",
        "created_utc": 1615243926,
        "id": "gq9l32v",
        "permalink": "/r/wallstreetbets/comments/m0q5bm/gme_yolo_update_mar_8_2021/gq9l32v/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615272726.0
    },
    {
        "author": "Caesorius",
        "body": "She’s held NVDA shares for years, she’s 4X’d her $ on it. Plus it’s the same price it was a year ago. She needed $ for more PLTR",
        "created_utc": 1614839236,
        "id": "gpml5sh",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpml5sh/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1614868036.0
    },
    {
        "author": "Blackboxeq",
        "body": "First Nvidia.. then AMD... then PS5.... now Xbox bundles.  is nothing in stock anymore?",
        "created_utc": 1615327164,
        "id": "gqdnfxt",
        "permalink": "/r/wallstreetbets/comments/m1gs84/we_like_the_stock/gqdnfxt/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615355964.0
    },
    {
        "author": "FearlessTrader",
        "body": "NVDA basically wiped out 6 months of its gains. 😒😒😒",
        "created_utc": 1615227442,
        "id": "gq8jvow",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8jvow/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615256242.0
    },
    {
        "author": "maxkingusa",
        "body": "So basically Cathie said... if you liked these stocks 2 months ago, you should looooove them today.  She sees bigger gains now that they had these drops.  On one hand you want to puke up your lunch but on the other hand.... we should want this drop in tech and the chance to buy back the key growth companies.  \n\nI bought AAPL, NVDA, AMD, AVGO, XLE and DB (to add some more financials and energy to my portfolio).  This keeps me balanced and I can wait out the pain that tech is providing.  \n\nMy biggest gains that I have held are from VIAC, SBUX, HP, JPM, STOR, LUMN, SPY, and a host of others.\n\nLet's see if adding to tech this week will pay off.",
        "created_utc": 1615237290,
        "id": "gq96pxs",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq96pxs/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615266090.0
    },
    {
        "author": "RobotBrunch",
        "body": "AMD SOXL NVIDIA\n\nAll great stocks to own",
        "created_utc": 1614820835,
        "id": "gployh1",
        "permalink": "/r/stocks/comments/lx4prb/do_not_panic_sell/gployh1/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1614849635.0
    },
    {
        "author": "RTRC",
        "body": "Today alone has wiped out a year worth of losses. Last year lost money on Spy puts when they pumped up the market with fake cash. GME gets to $300 and i'll also get back the money I lost on Nvidia puts in 2018. Had calls during the RTX 2000 series launch and switched to puts because I knew the new series was garbage. But my calls expired a week too early and I lost it all.",
        "created_utc": 1615224539,
        "id": "gq8ct0g",
        "permalink": "/r/wallstreetbets/comments/m0fpgd/gme_megathread_for_march_08_2021/gq8ct0g/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615253339.0
    },
    {
        "author": "Much_Butterscotch279",
        "body": "HERE WE GO PPL!!!! FUCK APPLE AND FUCK NVDA.. I LOVE GME",
        "created_utc": 1615220559,
        "id": "gq83bxp",
        "permalink": "/r/wallstreetbets/comments/m0j7d6/gamestop_stock_is_flying_again_the_transformation/gq83bxp/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1615249359.0
    },
    {
        "author": "HaHawk",
        "body": "Exclusive advanced stock ratings from [Investing.com](https://Investing.com):\n\nApple: Strong Sell.\n\nAlphabet: Strong Sell.\n\nTesla: Strong Sell.\n\n[Amazon.com](https://Amazon.com): Strong Sell.\n\nFacebook: Strong Sell.\n\nNVIDIA: Strong Sell.\n\nThank you [investing.com](https://investing.com), very cool!",
        "created_utc": 1614827097,
        "id": "gpm1fpe",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpm1fpe/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614855897.0
    },
    {
        "author": "soonseen",
        "body": "Jim cramer. Buy nvda. \n\nRetail. Ok.\n\nNvda. Down 7 percent.",
        "created_utc": 1614791993,
        "id": "gpjypyg",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpjypyg/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614820793.0
    },
    {
        "author": "the_billyjack",
        "body": "NVDA, TSLA, ADBE straddles. These bad boys are moving tomorrow, one way or another.",
        "created_utc": 1615340558,
        "id": "gqedpml",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqedpml/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1615369358.0
    },
    {
        "author": "FearlessTrader",
        "body": "Chip demand keeps on going up, NVDA? Back to August 2020 levels. This is some bullshit 😒😒😒",
        "created_utc": 1615257826,
        "id": "gqaav7p",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqaav7p/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615286626.0
    },
    {
        "author": "gerjerb",
        "body": "I’m not doing anything, we’ve seen an epic melt up in commodities and bonds. \n\n\nWe’re seeing real numbers for unemployment and the consequences of the covid shutdown and now the Texas deep freeze. \n\n\nNow it’s time for some insanity because algorithms are going to go crazy because we’re coming up on the anniversary of the covid crash from last year. \n\n\nThat being said: put your mouth guard in, strap into your seat, get ready for liftoff, and hope you don’t die of stroke on the way up.\n\n\nTSLA 720c 3/19\n\nAAPL 145c 4/16\n\nNVDA 600c 4/16\n\nAmd 100c 4/16\n\nPltr 35c 4/16\n\nTsla 1000c 5/21\n\nAbnb 250c 5/21\n\n\nThe chip hyper cycle is coming and EV and autonomous driving hype is consolidating into the real player in that space, Tesla. \n\n\nBut if y’all are scared, just buy $ARKK.",
        "created_utc": 1614865256,
        "id": "gpnggd1",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpnggd1/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614894056.0
    },
    {
        "author": "kaibasean",
        "body": "Nvidia is about to break the 500 barrier.\n\nAMD nearly at 79.\n\nWhat the fuck.",
        "created_utc": 1614850773,
        "id": "gpmxxk2",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpmxxk2/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614879573.0
    },
    {
        "author": "Dismiss",
        "body": "NVDA literally cannot produce GPUs fast enough to keep up with demand. This means that it must go -26% in 3 weeks.",
        "created_utc": 1615234417,
        "id": "gq901z6",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq901z6/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615263217.0
    },
    {
        "author": "levon105",
        "body": "NVDA: Blowout earnings, record profits, beat all estimates\n\nMarket: Let's dump this bad boy -10%+ in 1 week.",
        "created_utc": 1614718465,
        "id": "gpghsfo",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpghsfo/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614747265.0
    },
    {
        "author": "Alepman",
        "body": "Who the fuck selling $NVDA and Buying $GE !!!! Fuck your boomer legacy companies",
        "created_utc": 1615223852,
        "id": "gq8b60o",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8b60o/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615252652.0
    },
    {
        "author": "OsamaBinTrading",
        "body": "So happy to be cash gang. Big RIP to ARKK and Nvidia call holders.",
        "created_utc": 1615231400,
        "id": "gq8t3fk",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8t3fk/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615260200.0
    },
    {
        "author": "kemar7856",
        "body": "Cathy lost it sells nvda to buy pltr",
        "created_utc": 1614818319,
        "id": "gplkr22",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gplkr22/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614847119.0
    },
    {
        "author": "CratesOfSocks85",
        "body": "TSLA was first, NVDA is next 🚀🚀🚀🚀",
        "created_utc": 1615332514,
        "id": "gqdyhe7",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqdyhe7/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615361314.0
    },
    {
        "author": "RPMayhem",
        "body": "GameStop should buy nvidia if these trends hold much longer",
        "created_utc": 1615257692,
        "id": "gqaamkf",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqaamkf/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615286492.0
    },
    {
        "author": "wrb3",
        "body": "$700 price target for NVDA by several analysts. Is that  realistic?",
        "created_utc": 1614839611,
        "id": "gpmln2e",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpmln2e/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614868411.0
    },
    {
        "author": "soonseen",
        "body": "Quick!\n\n Let me sell my nvda and tesla for wd40 and sport clips!\n\n-facepalm-",
        "created_utc": 1614830626,
        "id": "gpm8215",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpm8215/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614859426.0
    },
    {
        "author": "siebren014",
        "body": "+ they work together with Nvidia on their technology, are going to Europe in the near future and have laid some big fundamentals lately for smooth growth",
        "created_utc": 1615246483,
        "id": "gq9pza6",
        "permalink": "/r/wallstreetbets/comments/m0t3vy/why_nio_is_a_good_buy/gq9pza6/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615275283.0
    },
    {
        "author": "goldcakes",
        "body": "Intel: 5.86B net income, 250B valuation.\n\nNvidia: 1.46B net income, 317B valuation.\n\nIntel is staging a turnaround and can easily become a growth play in the next 2-4 years, with the new technical CEO. As a PC parts enthusiast, they are already stepping up cadences and launching competitive lineups that are actually in stock, because they are being produced much more than TSMC's bottlenecked's fabs.\n\nThey are the company to watch.",
        "created_utc": 1614868663,
        "id": "gpnn1je",
        "permalink": "/r/investing/comments/lx6lm2/biden_administration_will_continue_chinese_tech/gpnn1je/",
        "score": 8,
        "subreddit": "investing",
        "created": 1614897463.0
    },
    {
        "author": "BlaCkPeZuS",
        "body": "Comparable to apple, nvidia and square. Sure brah",
        "created_utc": 1615248935,
        "id": "gq9umgb",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9umgb/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615277735.0
    },
    {
        "author": "ThrallDoomhammer",
        "body": "Nvidia less than 500 is a huge buy and will mark the start of the tech rally again.  You heard it here first",
        "created_utc": 1614811401,
        "id": "gpl78ud",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpl78ud/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614840201.0
    },
    {
        "author": "billwaters",
        "body": "I sold these when NVDA was at 565 a week ago, though it couldn't go tits up lmao",
        "created_utc": 1614831781,
        "id": "gpma3e3",
        "permalink": "/r/wallstreetbets/comments/lxbssi/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpma3e3/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614860581.0
    },
    {
        "author": "rededreded",
        "body": "Sold my AMD......to buy Nvidia.",
        "created_utc": 1614806915,
        "id": "gpkxbwq",
        "permalink": "/r/stocks/comments/lx4prb/do_not_panic_sell/gpkxbwq/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1614835715.0
    },
    {
        "author": "TCGYT",
        "body": "I want a fucking GPU Nvidia, man. \n\nI wish this semi shortage would end, it would be good for my portfolio and my current waiting to build a new pc.",
        "created_utc": 1614794058,
        "id": "gpk3khe",
        "permalink": "/r/stocks/comments/lwqqa4/rstocks_daily_discussion_wednesday_mar_03_2021/gpk3khe/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1614822858.0
    },
    {
        "author": "Hadron90",
        "body": "\\&gt;$NVDA and $AMD tanking\n\n\\&gt;$GME mooning\n\nPCbros, I don't feel so good...",
        "created_utc": 1615234287,
        "id": "gq8zr50",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8zr50/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615263087.0
    },
    {
        "author": "tendeeznuts",
        "body": "NVDA officially down -25% from its highs\n\nCorrTechTion gotta be close to over rr.rr.rrright?",
        "created_utc": 1615242784,
        "id": "gq9irze",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9irze/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615271584.0
    },
    {
        "author": "randomcharachter1101",
        "body": "C'mon Nvidia don't be a twat. \n\nYour home is in the 500 range, why don't you wanna go home..? Are you too good for your home?",
        "created_utc": 1615312800,
        "id": "gqcrnb7",
        "permalink": "/r/stocks/comments/m13rgb/rstocks_daily_discussion_technicals_tuesday_mar/gqcrnb7/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1615341600.0
    },
    {
        "author": "siberianmi",
        "body": "As long as it's money you don't need now be patient, keep investing.\n\nWhen the crash came in 2007-2008 I was only a year or two into seriously investing into my retirement account.  That end of year statement was a bit of a \"Guh\" moment since everything I had earned plus some basically had evaporated.   But, wasn't like I was going to touch that money then.  I did nothing to change the strategy I had picked for investing and instead doubled up on my 401k contributions.\n\nBest decision I ever made in regards to my retirement investments -- I came out way ahead because I was able to buy more while everything was recovering.\n\nMy biggest regret over the last year is when COVID hit I was too focused on the disaster itself and neglected to make any real changes to how I was investing to take better advantage of it.  If this continues and goes deeper - don't look at it as a loss if your investing for the long term.  Look at as an opportunity to get more potential long term value out of the money you put in now. \n\nAs a current example - I bought NVIDIA because I believed they have a potential for real growth through the autonomous vehicle industry.  But, yeah stocks down since I invested in it.  Bought more this morning - why?  I **STILL** believe it's going to grow in the next 5-years because of the rise of autonomous vehicles tech.  *It's just on sale now.*",
        "created_utc": 1614887139,
        "id": "gpou1pe",
        "permalink": "/r/StockMarket/comments/lxr1jo/weird_times/gpou1pe/",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1614915939.0
    },
    {
        "author": "Really_Very_Expert",
        "body": "My dick is the size of a grain of rice\n\n$NVDA $500c Mar12",
        "created_utc": 1615331520,
        "id": "gqdwjak",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqdwjak/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615360320.0
    },
    {
        "author": "KingDedeMemes",
        "body": "My Plan:  \n\\- Ride $GME to the Moon   \n\\- $NVDA on super sale for long hold  \n\\- Wait for $AAPL to hit $112 or lower   \n\\- Try my damndest to dollar cost average down on my investments as this shit crumbles to the ground then sit on my fucking hands before I give myself a heart attack.",
        "created_utc": 1615244896,
        "id": "gq9myzz",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9myzz/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615273696.0
    },
    {
        "author": "Upset_Bear",
        "body": "Shrek looks wonderful on NVDA graphics cards",
        "created_utc": 1615327924,
        "id": "gqdp2ii",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqdp2ii/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615356724.0
    },
    {
        "author": "HarbingersRefuge",
        "body": "NVDA too",
        "created_utc": 1614747433,
        "id": "gpi37yg",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpi37yg/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614776233.0
    },
    {
        "author": "SwagglesMcNutterFuk",
        "body": "Kramer - buy NVDA it will be great",
        "created_utc": 1615263788,
        "id": "gqal9u1",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqal9u1/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615292588.0
    },
    {
        "author": "BedtimeTorture",
        "body": "*checks notes* ahhh yes, had I held NVDA for an hour longer today I would’ve made another $5000 love it \nOh well that’s why we are here",
        "created_utc": 1615315509,
        "id": "gqcxdyz",
        "permalink": "/r/wallstreetbets/comments/m144ua/daily_discussion_thread_for_march_09_2021/gqcxdyz/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615344309.0
    },
    {
        "author": "ErectHippo",
        "body": "NVDA is a no-brainer under $500",
        "created_utc": 1614890122,
        "id": "gpp14sx",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpp14sx/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614918922.0
    },
    {
        "author": "MidwestMoguhl",
        "body": "NVDA plesss stop",
        "created_utc": 1615223274,
        "id": "gq89tbm",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq89tbm/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615252074.0
    },
    {
        "author": "ozpcmr",
        "body": "bruh the NASDAQ is back to december and NVDA is below the bottom of the September correction.",
        "created_utc": 1615234401,
        "id": "gq900m9",
        "permalink": "/r/stocks/comments/m0cz9v/rstocks_daily_discussion_monday_mar_08_2021/gq900m9/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1615263201.0
    },
    {
        "author": "fgfuyfyuiuy0",
        "body": "NVDA and AAPL are gonna slide all the way. \n\nAMD to but I have calls on that so I dont wanna admit it.",
        "created_utc": 1615237811,
        "id": "gq97way",
        "permalink": "/r/wallstreetbets/comments/m0j7d6/gamestop_stock_is_flying_again_the_transformation/gq97way/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615266611.0
    },
    {
        "author": "MilesOfKings",
        "body": "RIP NVDA",
        "created_utc": 1615242428,
        "id": "gq9i18m",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9i18m/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615271228.0
    },
    {
        "author": "ionized_fallout",
        "body": "March 8 (Reuters) - The Dow climbed on Monday, led by stocks poised to benefit the most from an economic rebound as the $1.9 trillion COVID-19 relief bill awaited a final Congressional vote this week, and heavyweight tech-related stocks swung between gains and losses.\n\nAfter the legislation won U.S. Senate approval on Saturday, President Joe Biden said he hoped for a quick passage of the revised coronavirus relief package by the Democrat-controlled House of Representatives so he could sign it and send $1,400 direct payments to Americans.\n\nProspects of more government spending and faster economic growth have stoked fears of a spike in inflation, sending the benchmark 10-year Treasury yield to near one-year highs.\n\nU.S. Treasury Secretary Janet Yellen, however, said on Monday the package would fuel a \"very strong\" U.S. recovery and she did not expect the economy to run too hot because of the increased spending.\n\nThe Dow hit a new record intraday high and was trading above its Feb. 24 record close. In the S&amp;P 500, the financial sector was the biggest boost, hitting a record as higher interest rates and a steeper yield curve helped banks. Industrials were right behind, also reaching a record high, while the materials sector neared an all-time peak. The technology sector was deepest in the red.\n\n\"This is an ideal traders' market with certain sectors and individual stocks performing better than the wider market, as investors pick and choose individual stocks that will perform better as the economy reopens,\" said Anthony Denier, chief executive officer of trading platform Webull.\n\nA slide in the big tech stocks that have driven the rally in equities since pandemic-induced lows of last March continued, with Apple Inc(AAPL), Nvidia Corp(NVDA), Tesla Inc(TSLA) and Alphabet Inc's(GOOG) Google leading declining shares on Nasdaq.\n\nTech stocks are particularly sensitive to rising yields because their value rests heavily on earnings in the future, which are discounted more deeply when bond returns go up.\n\nThe divergence between the tech stocks and non-tech stocks explains trading today, said Joe Saluzzi, partner and co-founder of Themis Trading in Chatham, New Jersey.\n\n\"The stimulus package will be certainly helping the bigger cap names,\" Saluzzi said, referring to non-tech stocks. \"The get-out and non-stay at home stocks are doing better now,\" he said.\n\nBy 3:09 p.m. ET (2009 GMT), the Dow Jones Industrial Average rose 416.64 points, or 1.32%, to 31,912.94, the S&amp;P 500 lost 3.83 points, or 0.10%, to 3,838.11 and the Nasdaq Composite dropped 259.71 points, or 2.01%, to 12,660.44.\n\nBanks added about 1.7% as the yield on the benchmark 10-year note stood near a 13-month high, while airlines jumped about 5%.\n\nWalt Disney Co (DIS) jumped about 5.8% as California health officials set new rules that would allow Disneyland and other theme parks, stadiums and outdoor entertainment venues to reopen as early as April 1.\n\nGameStop Corp (GME) surged about 33% after the company said it had tapped shareholder Ryan Cohen to lead a transition to an e-commerce business.\n\nAdvancing issues outnumbered declining ones on the NYSE by a 1.68-to-1 ratio; on Nasdaq, a 1.28-to-1 ratio favored advancers.\n\nThe S&amp;P 500 posted 124 new 52-week highs and no new lows; the Nasdaq Composite recorded 390 new highs and 21 new lows.\n\n(Reporting by Herbert Lash in New York, Karen Pierog in Chicago and Medha Singh and Shashank Nayar in Bengaluru; Editing by Shounak Dasgupta and Lisa Shumaker)",
        "created_utc": 1615235598,
        "id": "gq92sor",
        "permalink": "/r/wallstreetbets/comments/m0fpgd/gme_megathread_for_march_08_2021/gq92sor/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615264398.0
    },
    {
        "author": "nintendotyu",
        "body": "I just cannot ignore the deals in $NVDA and $AMD at this time.",
        "created_utc": 1615240616,
        "id": "gq9e62f",
        "permalink": "/r/stocks/comments/m0cz9v/rstocks_daily_discussion_monday_mar_08_2021/gq9e62f/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1615269416.0
    },
    {
        "author": "Srs-Biznes",
        "body": "From my understanding, no. TSMC manufactures, AMD/NVDA designs. This info is also available on the first page of Google results, just so you know",
        "created_utc": 1615231452,
        "id": "gq8t7v1",
        "permalink": "/r/stocks/comments/m0muo6/chip_makers_nvda_vs_amd_vs_tsm/gq8t7v1/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1615260252.0
    },
    {
        "author": "Invincilble",
        "body": "Nvidia can fuck off. So fucking gay",
        "created_utc": 1614779212,
        "id": "gpj6naq",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpj6naq/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614808012.0
    },
    {
        "author": "-Lemony",
        "body": "It's only too late the moment I invest in it. They have trackers on my tail, watching every trade I make. \n\nApple? Dropped like a rock after I put a buy order of 10 of em. Nvidia? How about I fall 5% the moment you finalize your trade. The Dow? How about we drop 300+ points, we saw you checking on it through your mobile app",
        "created_utc": 1614732592,
        "id": "gphbht8",
        "permalink": "/r/stocks/comments/lwf73q/will_rkt_drop_tomorrow_thoughts/gphbht8/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1614761392.0
    },
    {
        "author": "718cs",
        "body": "This dumbass thought he was buying 100k of NVDA calls for next month but was trying to get the trade in quick so I accidentally bought 100k that expire in 2 days.\n\nSold that shit real quick 15 mins later for 118k. Glad I noticed the ex date sooner rather than later.",
        "created_utc": 1614788135,
        "id": "gpjpnjr",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpjpnjr/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614816935.0
    },
    {
        "author": "rededreded",
        "body": "So high on NVDA not only for their GPUs. Data center sector and their CUDA programming IMO is huge, on top of those guaranteed sales.",
        "created_utc": 1614809172,
        "id": "gpl2gcx",
        "permalink": "/r/stocks/comments/lx4prb/do_not_panic_sell/gpl2gcx/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1614837972.0
    },
    {
        "author": "Clutch3131",
        "body": "You’re comparing GameStop ($8.6B MC) to Amazon, Apple, Facebook, google, nvidia and amd? Companies that are worth hundreds of billions/trillions of dollars? Lmao. What do you think is easier to manipulate? A company worth $2 trillion or a company worth $8 billion. You sir, are in fact, the retard here.",
        "created_utc": 1614811582,
        "id": "gpl7mll",
        "permalink": "/r/wallstreetbets/comments/lx5p2j/gme_and_citadel_why_the_consolidation/gpl7mll/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614840382.0
    },
    {
        "author": "AllProWomenRespecter",
        "body": "Praying that NVDA can gap up to $512 tomorrow which is *checks notes* what they were trading at at noon today.",
        "created_utc": 1614896878,
        "id": "gppgnat",
        "permalink": "/r/wallstreetbets/comments/lxva6s/what_are_your_moves_tomorrow_march_05_2021/gppgnat/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614925678.0
    },
    {
        "author": "mrchakra7",
        "body": "NVDA down 25% in like 2 weeks and still bleeding",
        "created_utc": 1615234464,
        "id": "gq905vx",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq905vx/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615263264.0
    },
    {
        "author": "AltcoinTraderNy",
        "body": "Nvda ?",
        "created_utc": 1615259030,
        "id": "gqad1m9",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqad1m9/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615287830.0
    },
    {
        "author": "_saucemaster",
        "body": "Nvda is oversold",
        "created_utc": 1615264014,
        "id": "gqaln6t",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqaln6t/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615292814.0
    },
    {
        "author": "fdatbish",
        "body": "NVDA has given me nothing but STRESS these last two weeks",
        "created_utc": 1615264096,
        "id": "gqalrz4",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqalrz4/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615292896.0
    },
    {
        "author": "MalevolentMinion",
        "body": "I did yesterday.  NVDA, AAPL, MSFT, NNDM, BA, and DIS.  Some LEAPs and some stock.  Wrote CCs on some of my other positions today that are green.",
        "created_utc": 1615325120,
        "id": "gqdiwnv",
        "permalink": "/r/options/comments/m1g3cg/anyone_else_go_on_a_shopping_spree_today/gqdiwnv/",
        "score": 6,
        "subreddit": "options",
        "created": 1615353920.0
    },
    {
        "author": "HarbingersRefuge",
        "body": "NVDA looks poised to spring up tomorrow. Up in AH after falling to form a double bottom today. Normally jumps up bigly after a day this red.",
        "created_utc": 1614750654,
        "id": "gpi7yv3",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpi7yv3/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614779454.0
    },
    {
        "author": "HazardousMako",
        "body": "why are semiconductors taking such a massive dump?\n\nlooking at NVDA and AMD... NVDA just broke its 200D MA and the 6 month channel evaporated. it looks like last time it dump and got cut by almost 2/3s\n\nreally think we see NVDA 300?",
        "created_utc": 1615228531,
        "id": "gq8mff7",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8mff7/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615257331.0
    },
    {
        "author": "voneahhh",
        "body": "NVDA @ $552, the pain is real",
        "created_utc": 1615237416,
        "id": "gq96zgc",
        "permalink": "/r/stocks/comments/m0cz9v/rstocks_daily_discussion_monday_mar_08_2021/gq96zgc/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1615266216.0
    },
    {
        "author": "omniron",
        "body": "Shitty but I’ve been here before and I basically know If I sit on this nvidia it will recover. Might take a year or longer though. I’m off the roller coaster for a bit",
        "created_utc": 1615258837,
        "id": "gqacozo",
        "permalink": "/r/wallstreetbets/comments/m0wvvb/nvidia_yolo_gme_put_over_the_past_month/gqacozo/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615287637.0
    },
    {
        "author": "billwaters",
        "body": "If NVDA somehow magically ends up expiring above 492.5 this Friday, mods ban me for a month, for my name aint /u/billwaters",
        "created_utc": 1615238753,
        "id": "gq9a1dp",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9a1dp/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615267553.0
    },
    {
        "author": "CaptMercaptan",
        "body": "As long as they aren't offering $5 for a gently used Nvidia RTX 3080 whilst selling a roughly used one for $200 like the racket they used to pull, I'd say this is a great idea with much promise.\n\nLets be honest.  Its been a fun ride and it looks like things are turning around but there was more reason to short GME than just the waning of brick-and-mortar stores.",
        "created_utc": 1615332391,
        "id": "gqdy8pf",
        "permalink": "/r/wallstreetbets/comments/m1cl9t/nintendo_goes_allin_on_gme_3_new_amiibo_will_be/gqdy8pf/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615361191.0
    },
    {
        "author": "NaNaNaNaNaNaNaNaNa65",
        "body": "Honestly the play is always apple and nvidia",
        "created_utc": 1614741065,
        "id": "gphs08c",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gphs08c/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614769865.0
    },
    {
        "author": "billwaters",
        "body": "I for one welcome our new RKT overlords over GME  \n\n\nalso fuck you NVDA   \n\n\nAMZN 4450c 8/21\n\n(This is financial advice)",
        "created_utc": 1614718945,
        "id": "gpgiy0e",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpgiy0e/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614747745.0
    },
    {
        "author": "NikkiXoLynnn",
        "body": "NVDA for me as well. Almost got them last month but chose other ones instead. NTDOY has to go up with that new game. Put them off last month as well to buy EA and GLUU so I’ll add them now. NFLX and AAPL just because I haven’t gotten around to those two yet. SIX isn’t down and hasn’t been in over a month but they’re doing so well for my simulator that I’m getting FOMO and might toss a bit their way as well. And want to add to my PINS.",
        "created_utc": 1614820111,
        "id": "gplnnxf",
        "permalink": "/r/stocks/comments/lx8dqb/what_are_we_buying_during_this_sale/gplnnxf/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1614848911.0
    },
    {
        "author": "NrdRage",
        "body": "I mean, the chasers (I'm looking at you UWMC, RKT, GME) are fucking themselves, but in a broader market perspective, it's really starting to look like the hedge funds strategy to beat the era of instant information is to simply lean their chipstack in to try and get retail to leave the market and never come back.  Some of this price action the last couple of weeks just defies any semblance of logic.  Companies like $NVDA should be sitting at 600 right now.  There's zero reason why $BE (the most interesting story in the energy space, IMO) goes from 42 to 27 in 2 weeks.  Texas has a once-in-a-generation snowstorm and all of a sudden all the solar plays are dead?  Commodity semis literally can't make their product fast enough and they get hammered. First trillion dollar quarter in history and it sells off, etc.",
        "created_utc": 1614792973,
        "id": "gpk10up",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpk10up/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614821773.0
    },
    {
        "author": "billwaters",
        "body": "NVDA FUCK YOUUUUUU",
        "created_utc": 1614795051,
        "id": "gpk5vu1",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpk5vu1/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614823851.0
    },
    {
        "author": "The_Weekend_DOW",
        "body": "NVDA glitching AH for anyone else...?",
        "created_utc": 1615244147,
        "id": "gq9litr",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9litr/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615272947.0
    },
    {
        "author": "NeverITMalwaysOTM",
        "body": "When everyone’s in fear buy fucking nvda 480 weeklies. Check back in with me Friday. \n\nThat’s my gamble but my actual play is BA 230 month out LFG",
        "created_utc": 1615245512,
        "id": "gq9o5gw",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9o5gw/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615274312.0
    },
    {
        "author": "MetalliTooL",
        "body": "Some of this tech dump makes no sense.\n\nWhy is NVDA worth less now than in August, when its earnings weren't even close to what they are now?",
        "created_utc": 1615233263,
        "id": "gq8xek6",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8xek6/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615262063.0
    },
    {
        "author": "BedtimeTorture",
        "body": "BREAKING: Hulk himself is said to insert his penis inside each and every new NVIDIA graphics card, use this information as you will\n\n3/12 $500 Calls, because I’m retarded and sold my puts at 470",
        "created_utc": 1615235242,
        "id": "gq91yx2",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq91yx2/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615264042.0
    },
    {
        "author": "al_walid4",
        "body": "The cucked boomers are dumping tech because of muh inflation. WTF even is inflation? Ploughing more money into NVDA",
        "created_utc": 1615234910,
        "id": "gq9171n",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq9171n/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615263710.0
    },
    {
        "author": "evokesins",
        "body": "Anyone have price predictions of NVDA for the rest of the week?",
        "created_utc": 1615343908,
        "id": "gqejxgb",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqejxgb/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615372708.0
    },
    {
        "author": "blindsk02",
        "body": "NVDA getting slaughtered today.....",
        "created_utc": 1615223672,
        "id": "gq8aqmi",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8aqmi/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615252472.0
    },
    {
        "author": "laetus",
        "body": "What company isn't 'growth and integration into every facet of modern life' at the moment? Every company will claim that. \n\nAnd even if it's true, that doesn't mean the stock has to grow with it (see Amazon stock ~2000).\n\nAlso, NVDA missed earnings estimate. (basically every time)",
        "created_utc": 1614841440,
        "id": "gpmnutt",
        "permalink": "/r/wallstreetbets/comments/lxbssi/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpmnutt/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614870240.0
    },
    {
        "author": "billwaters",
        "body": "NVDA is the most punished stock in the market right now no cap.   \n\n\nNVDA gang been down bad for a  while :( hang in there fam",
        "created_utc": 1614883859,
        "id": "gpom2nu",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpom2nu/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614912659.0
    }
]