[
    {
        "author": "RajivChaudrii",
        "body": "It’s all about growth.  NVDA rev growth yoy ~55%, AMD rev growth yoy 65%.  Both are accelerating in high margin products.  Intel yoy rev growth -1%, with margins trending down.",
        "created_utc": 1637255963,
        "id": "hl55pxp",
        "score": 398,
        "subreddit": "stocks",
        "created": 1637284763.0
    },
    {
        "author": "Mystic_dwarf",
        "body": "INTC",
        "created_utc": 1636902522,
        "id": "hklf6f7",
        "score": 180,
        "subreddit": "stocks",
        "created": 1636931322.0
    },
    {
        "author": "KGOAT1",
        "body": "INTC bulls never understand this",
        "created_utc": 1637275150,
        "id": "hl6i0wu",
        "score": 174,
        "subreddit": "stocks",
        "created": 1637303950.0
    },
    {
        "author": "BannerlordAdmirer",
        "body": "Intel under Paul Otellini is the ur-example of this. He focused completely on shutting down AMD for a good part of a decade, but completely missed the boat on the smartphone.",
        "created_utc": 1635998120,
        "id": "hj8qery",
        "score": 153,
        "subreddit": "stocks",
        "created": 1636026920.0
    },
    {
        "author": "xboodaddyx",
        "body": "Intel. Chip company that's a loser during a chip shortage, takes talent",
        "created_utc": 1636001816,
        "id": "hj8wfyf",
        "score": 137,
        "subreddit": "stocks",
        "created": 1636030616.0
    },
    {
        "author": "Tunaman456",
        "body": "I started with about $25k with my main investments being $AAPL $SPY $INTC $SPOT just to name a few, but over the years I deposited 1-5k over various different tickers based on my belief in their fundamentals. If it dropped or traded sideways for months on end, I re-evaluated their future potential and went from there. If it dropped for no apparent reason, I added to existing positions by buying more shares. Really rinse and repeat from there. \n\nOverall there’s about 50-60k of my own money in there. The rest is growth.",
        "created_utc": 1636394103,
        "id": "hjtvsc1",
        "score": 120,
        "subreddit": "stocks",
        "created": 1636422903.0
    },
    {
        "author": "TrioxinTwoFortyFive",
        "body": "Why give money to Nvidia?  It does not manufacture chips.  It does not even manufacture the cards using chips.  It is all contracted out.\n\nAnd that 150,000 jobs sounds ridiculous.  Intel currently has a total of 110,000 employees.",
        "created_utc": 1637197814,
        "id": "hl29c0e",
        "score": 96,
        "subreddit": "stocks",
        "created": 1637226614.0
    },
    {
        "author": "UWG-Grad_Student",
        "body": "Nvidia isn't worried about intel because intel isn't trying to take on the GPU space the same way AMD does. intel wants discrete graphics first then low power consumption stuff mostly for laptops. They won't get any real market share in server or dedicated graphics for a long time. NVDA is still a great buy n hold stock, but if you own it get AMD too. That way, when one falls, the other rises.",
        "created_utc": 1637927234,
        "id": "hm597qx",
        "score": 92,
        "subreddit": "stocks",
        "created": 1637956034.0
    },
    {
        "author": "sweYoda",
        "body": "Or perhaps we think more long term. AMD is a great company, just like Intel, but I just think the valuation is too high. Just like Intel has had mistakes and some stagnation I think AMD will eventually stagnate a bit, while I do believe Intels new fabs, products and their foundry business will be pretty solid in 2025.",
        "created_utc": 1637276632,
        "id": "hl6lho6",
        "score": 88,
        "subreddit": "stocks",
        "created": 1637305432.0
    },
    {
        "author": "sunstersun",
        "body": "I might actually be converted to an Intel bull despite being scared of Nvidia and TSMC competition. \n\nBasically the argument is the US gov will not let intel fail in its fab dreams this time.",
        "created_utc": 1636866539,
        "id": "hkjuq9n",
        "score": 84,
        "subreddit": "stocks",
        "created": 1636895339.0
    },
    {
        "author": "FreeEuropeYouCunts",
        "body": "Remember when according to many people AMD was \"way too overvalued\" at $115 and INTC was teh epic value play. Lmao",
        "created_utc": 1636390178,
        "id": "hjtlv18",
        "score": 82,
        "subreddit": "stocks",
        "created": 1636418978.0
    },
    {
        "author": "soAsian",
        "body": "1. x86 - AMD is now a fabless. all their resources goes to design\n\n2. foundry - Can Intel catch up with TSMC and Samsung? TSMC have 50% of the market share. its a pure play foundry with no conflict of interest unlike Intel. all TSMC's resources goes to foundry\n\n3. alternative chip - Apple shown us ARM is viable alternative to Intel's x86. AWS, Google and Alibaba is all in on design their own chip. \n\n\nCan Intel catch up?",
        "created_utc": 1635795519,
        "id": "hix63tc",
        "score": 71,
        "subreddit": "investing",
        "created": 1635824319.0
    },
    {
        "author": "bbb123711",
        "body": "My god how many shares of Intel are you bagholding?",
        "created_utc": 1636148175,
        "id": "hjgy1l4",
        "score": 66,
        "subreddit": "investing",
        "created": 1636176975.0
    },
    {
        "author": "RNKKNR",
        "body": "Intel releasing GPU's is good, but only if they end up beating the competition in performance/price. Considering that Intel has never released a ground breaking GPU in all its history - I remain skeptical.",
        "created_utc": 1636055856,
        "id": "hjbp2ry",
        "score": 61,
        "subreddit": "StockMarket",
        "created": 1636084656.0
    },
    {
        "author": "KGOAT1",
        "body": "My goodness the INTC pumping on this sub is ridiculous",
        "created_utc": 1637427526,
        "id": "hlej1x1",
        "score": 59,
        "subreddit": "stocks",
        "created": 1637456326.0
    },
    {
        "author": "SnipahShot",
        "body": "I think you might not know the difference between insiders and institutions. Insiders are officers and directors of the companies. Institutions are hedge funds.\n\nRetail investors probably don't have the money to keep it going up, but hedges do.\n\nIt isn't that hard to check what he is saying about insiders selling. Insider selling means that they believe the current price is too high for their company, otherwise they would have kept the stocks.\n\nLook at a few companies and their insider activity -\n\nTesla: 10 shares were bought in the last 12 months. Almost 9.2mil shares sold in that time.\n\nAMD: 0 shares were bought in the last 12 months. Almost 3mil shares sold in that time.\n\nNvidia: 206k shares were bought in the last 12 months. Almost 1.5mil shares sold in that time.\n\nModerna: 0 shares were bought in the last 12 months. 13.6mil shares were sold in that time.\n\n&amp;#x200B;\n\nNow let's look at companies whose value didn't spike.\n\nAnalog Devices: 840k shares were bought in the last 12 months. 310k shares were sold in that time.\n\nIntel: 430k shares were bought in the last 12 months. 250k were sold in that time.\n\nNorwegian Cruise: 480k shares were bought in the last 12 months. 370k shares were sold in the last 3 months.\n\n&amp;#x200B;\n\nIt does not indicate whether the market will crash, but it indicates what insiders think of the valuation of the company they are part of.",
        "created_utc": 1637250704,
        "id": "hl4sf0s",
        "score": 58,
        "subreddit": "StockMarket",
        "created": 1637279504.0
    },
    {
        "author": "KingDongSixtyNine",
        "body": "Go half-half with NVDA and AMD. That way you won't kick yourself when one of them smashes it out of the park. AMD is better priced but is competing with Intel on CPU's. NVDA basically controls 90% of the GPU market, and this market will only grow because of the rise of AR/VR/Metaverse.",
        "created_utc": 1637253276,
        "id": "hl4yv5m",
        "score": 58,
        "subreddit": "stocks",
        "created": 1637282076.0
    },
    {
        "author": "X-Zed87",
        "body": "Intel is attempting a turnaround. You dont buy a turnaround at the start when all the cash is burning. You buy a year or two from now when most of the cash burn has been spent. I wont buy intel until they are close to finishing their usa plants.",
        "created_utc": 1637028948,
        "id": "hksvcc7",
        "score": 57,
        "subreddit": "stocks",
        "created": 1637057748.0
    },
    {
        "author": "aksalamander",
        "body": "Hahahaha. Name of this thread is funny. Intc is a classic value trap. Notice it always falls off a cliff every 3 months for the last couple years? That’s the sell off every time they announce earnings. Then the value investors buy it all up for the next 90 days until they have poor earnings again, and the cycle repeats.",
        "created_utc": 1636078802,
        "id": "hjd7gpr",
        "score": 55,
        "subreddit": "stocks",
        "created": 1636107602.0
    },
    {
        "author": "AcademicParticular69",
        "body": "fuck you (snap), fuck you (rklb), fuck you (intc), youre cool (blnk), fuck you (lcid), im out (of money).",
        "created_utc": 1636664703,
        "id": "hk90i9a",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1636693503.0
    },
    {
        "author": "RayPissed",
        "body": "This is the 42563838th INTC pump this week.",
        "created_utc": 1636199230,
        "id": "hjjftz1",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1636228030.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "body": "AMD is not a manufacturer. They hire companies such as TSMC to make their chips for them.\n\nMuch of this funding plus possibly more in the future, seems likely to go to Intel (INTC).\n\nI dont think the US gov is interested in paying foreign companies to build in the US since it wont really help the US to be independent. eg. TSMC only builds factories for their inferior products outside of Taiwan since they are worried about their tech getting stolen in other locations.",
        "created_utc": 1636667772,
        "id": "hk97yg0",
        "score": 52,
        "subreddit": "stocks",
        "created": 1636696572.0
    },
    {
        "author": "InquisitorCOC",
        "body": "&gt;US gov will not let Intel fail \n\nAIG, Fannie/Freddie, GM, PGE investors: Lol\n\nThe US government is going to **FLAY** equity investors alive in 'bailouts'\n\nNo, my bullish Intel thesis is they can successfully engineer a turnaround under Pat Gelsinger's leadership",
        "created_utc": 1636875052,
        "id": "hkk8i0p",
        "score": 51,
        "subreddit": "stocks",
        "created": 1636903852.0
    },
    {
        "author": "paulc19802",
        "body": "Still plenty of market share left to take from Intel. Trending up strongly. Already overtaking in the desktop space. \n\nThey might even make a good GPU next year as they're beating Nvidia to the MCM game. \n\nI'm yet to add semiconductors long term to my portfolio. But to be honest it's such a cornered market I intend to just split my investment evenly between AMD, Intel and Nvidia when I eventually do. Basically a small semiconductor ETF of my own that automatically hedges itself because it contains all the competitors.",
        "created_utc": 1637519362,
        "id": "hljeixc",
        "score": 49,
        "subreddit": "stocks",
        "created": 1637548162.0
    },
    {
        "author": "hexydes",
        "body": "This is *exactly* why you invest in infrastructure and innovative industries during the good times. We need our computer/Internet revolution of the 21st-century. We ran into this in the 1970s-80s too, where inflation was high, wage growth was low, and economic activity was treading water. Then we had the computer revolution with Microsoft, Apple, Cisco, Intel, and about 100 other players that pulled us through the 80s when rates were hiked way up. Then rates came back down to something reasonable (i.e. not 0%) and we had the Internet revolution with Amazon, AOL (lol I know), Google, Facebook, and others.\n\nBut *all of that* was made possible because we made big investments during the 40s-60s in things like computers, transistors, Arpanet, etc. These things take time to pay off, some of them don't pan out, but that's why you:\n\n1. Invest.\n2. Diversify.\n\nOver the last 40 years, the investment in infrastructure and basic research has been whittled away by the Republican party. They constantly gripe about \"socialism...or communism...one of them\" and not spending money. Then they turn around and spend $1 trillion on the War on Drugs and $3 trillion on wars in the Middle East. That's $4 trillion that could have gone to infrastructure investments. And then when the Democratic party tries to get $2 trillion in new infrastructure investments over a decade, suddenly it's back to \"THAT'S COMMUNISM AND WE CAN'T AFFORD IT!\"\n\nWe should be absolutely pouring resources into clean energy infrastructure, broadband access, and biomedical technology right now. And yet we have to sit here and watch Republicans (and two Democrats) sit on their hands and scream about \"NO COMMUNISM! TOO MUCH MONEY!\"\n\nClock is ticking for the US...",
        "created_utc": 1636390986,
        "id": "hjtnx3f",
        "score": 47,
        "subreddit": "investing",
        "created": 1636419786.0
    },
    {
        "author": "harmlessloafofbread",
        "body": "Thats funny, I've only got Baba and Intel and I'm extremely bullish on them.\n\nThe more FUD the better, especially when they have such great prospects ahead of them.",
        "created_utc": 1637697903,
        "id": "hlt5jwy",
        "score": 47,
        "subreddit": "stocks",
        "created": 1637726703.0
    },
    {
        "author": "Euler007",
        "body": "Yup. Anyone blasting INTC usually has a post about AMD not far down their posting history.",
        "created_utc": 1636910071,
        "id": "hklwp4l",
        "score": 44,
        "subreddit": "stocks",
        "created": 1636938871.0
    },
    {
        "author": "Bigghead1231",
        "body": "Where were all these posts last summer when Ford was $5 and I got called a Boomer when shilling it everyday?\n\nRemember, retail is usually late. Take this how you want, I'm cutting my profits. GG\n\nIntel is next",
        "created_utc": 1636393753,
        "id": "hjtuwi6",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1636422553.0
    },
    {
        "author": "PepeMcPeperson",
        "body": "Seems you made a mistake in the TSMC column. Using the market cap in USD and the earnings and revenue in TWD. Their Earnings should be 19.2B with revenue of 48B.\n\nI have been following the semi market closely for the past year and altough intel have made some mistakes in underinvesting the new CEO really is correcting these mistakes with a great roadmap for regaining the top position in the comming years.",
        "created_utc": 1635792507,
        "id": "hiwyr7x",
        "score": 41,
        "subreddit": "investing",
        "created": 1635821307.0
    },
    {
        "author": "sugarbabysdaddy",
        "body": "Self made at least.  Was lucky enough to be a 5 % owner (first employee) in a tech start up.   When we sold I went all in AMD from reading the amd_stock subreddit.  It had me deep into understanding the tidal shift happening between AMD and Intel.  My dive into cannabis was meant to be temporary and I got caught for years.   I was confident AMD was on its way to 100. And kept watching it go up as my APHA was stuck after a short report.  \n\nOh well there will be others…",
        "created_utc": 1636393746,
        "id": "hjtuvv3",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1636422546.0
    },
    {
        "author": "jabootiemon",
        "body": "Very bullish on AMD NVDA and INTEL",
        "created_utc": 1636947968,
        "id": "hkofm9d",
        "score": 40,
        "subreddit": "StockMarket",
        "created": 1636976768.0
    },
    {
        "author": "henkgaming",
        "body": "Just purchased INTC. Under 10 P/E seems cheap, everybody is a little bit too depressed about INTC in my opinion",
        "created_utc": 1637692935,
        "id": "hlssvf4",
        "score": 39,
        "subreddit": "stocks",
        "created": 1637721735.0
    },
    {
        "author": "Past_Syrup",
        "body": "Value trap. Look at the 5 years chart. Intel is buying back shares for ages to maintain the price.",
        "created_utc": 1636207785,
        "id": "hjjvywe",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1636236585.0
    },
    {
        "author": "RichieWOP",
        "body": "If you had put money into Nvidia and AMD every time there was a INTC pump post on this sub this year you may literally be up close to 100% on your money.",
        "created_utc": 1637429006,
        "id": "hlemk52",
        "score": 37,
        "subreddit": "stocks",
        "created": 1637457806.0
    },
    {
        "author": "awesomedan24",
        "body": "If Intel could make their chips as small as this DD, they'd really get a leg up on AMD",
        "created_utc": 1636128779,
        "id": "hjfj2gg",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1636157579.0
    },
    {
        "author": "ChoochMMM",
        "body": "https://www.reuters.com/article/us-intel-manufacturing/intel-to-spend-20-billion-on-u-s-chip-plants-as-ceo-challenges-asia-dominance-idUSKBN2BF2WU\n\nI LOVE how they are bolstering their US production. If this supply chain stuff has taught us anything, in house production ESPCIALLY of something with defense implications, could be huge for the bottom line. \n\nI think the time to buy low in Intel is happening now.",
        "created_utc": 1636047977,
        "id": "hjb51ao",
        "score": 35,
        "subreddit": "stocks",
        "created": 1636076777.0
    },
    {
        "author": "porncrank",
        "body": "You missed the point of the timeline — the private sector (Apple, Microsoft, Cisco, Intel) was made possible by decades of government investments that were not directly profitable at the time (computers, transistors, arpanet). The relationship played out again with NASA and SpaceX — there would be no market for SpaceX if NASA hadn’t spent millions creating a viable market for satellites.\n\nSo what unprofitable endeavor is the government putting money into now that will pay off for the country in 20 years? The private sector can not and will not work unprofitably on such a long timeline, which is what government spending is all about.",
        "created_utc": 1636393265,
        "id": "hjttoe2",
        "score": 35,
        "subreddit": "investing",
        "created": 1636422065.0
    },
    {
        "author": "onehandedbackhand",
        "body": "Watching an interview with Pat Gelsinger and seeing him doing pushups on Twitter was all the DD I needed to stay the fuck away from Intel.",
        "created_utc": 1636907948,
        "id": "hklrkgr",
        "score": 35,
        "subreddit": "stocks",
        "created": 1636936748.0
    },
    {
        "author": "techmagenta",
        "body": "I cannot imagine a reality where a company like Intel beats the SP500",
        "created_utc": 1636876941,
        "id": "hkkb6g1",
        "score": 34,
        "subreddit": "stocks",
        "created": 1636905741.0
    },
    {
        "author": "wy51uwv",
        "body": "Intel is basically like Cisco. Great company to start with but sleeping for last decade with close to 0 innovation.",
        "created_utc": 1636192667,
        "id": "hjj6qwn",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1636221467.0
    },
    {
        "author": "msnf",
        "body": "I'm just about 8 years into my investing journey. Here are some of my milestones, though YMMV:\n\n**Year 0-1**\n\n* Being surprised that a stock beat on earnings and went down.\n\n* Buying an unprofitable stock on hype, watching it go down 10-20% and hoping it goes up so you can sell it for a smaller loss (TWTR for me).\n\n* Wondering how you're ever supposed to get to 30 stocks, when you're sitting at 5 and tempted to go all in on your biggest holding.\n\n* Reading lots of Buffet/value stuff and memorizing cliche quotes.\n\n* Caring at all about technical analysis, stop losses, shorting, dividends, splits or the specific price of a share.\n\n* Buying stocks because of M&amp;A.\n\n**Years 2-3**\n\n* Buying a large cap value stock that went down and doing the surprised pikachu when it keeps going down. (INTC).\n\n* Selling your first double-bagger for a profit... and watching it 5x in the future. (W)\n\n* Learning about factors, Sharpes, Shiller P/Es, Buffet ratios and worrying about macros in general.\n\n* Thinking about sectors, fundamentals, valuation ratios, growth etc.\n\n* Spotting an ETF that's been beating you (with lower risk) all this time.\n\n* Learning how to buy on the dip.\n\n**Years 4-6**\n\n* Being ok selling a long-term loser.\n\n* Feeling good about buying a broad-based ETF.\n\n* Diversifying by choice and not necessity.\n\n* Not playing earnings and focusing on the long term.\n\n* Holding all your capital gains to long-term.\n\n* Thinking about share dilutions, buybacks, cash flows, cap ex., moats and network effects.\n\n* Kind of half-assed doing some DCFs and valuations, and then moving on.\n\n**Years 7+**\n\n* Thinking about position sizes, correlations, macros, yields and rates.\n\n* Playing small positions in earnings again because it's cheap beta lol.\n\n* Sticking with allocations even if they're uncomfortable. Wondering why you'd ever go 25+% on one move.\n\n* Searching out guidance on the 10Q.\n\n* Being OK selling on the dip.",
        "created_utc": 1637630404,
        "id": "hlpo53w",
        "score": 33,
        "subreddit": "stocks",
        "created": 1637659204.0
    },
    {
        "author": "Ja_Nee_Misschien",
        "body": "Intel is mainly behind because they failed to order a lot of EUV machines early unlike TSMC and Samsung. This can be fixed by spending a bigger share of the profits on capex and buying a lot of these advanced EUV machines themselves and that is exactly what they are going to do and what pissed of some investors. Intel announced they will be the first to receive the next iteration of even more advanced EUV machines soon.\n\nBy being a foundry Intel can use all their IP for their customers. This will give them an advantage over TSMC and Samson for a sizable chunk of the market. Simply because they can throw in this IP so customers can design product only intel can make. Their packaging techniques are not the same as those of TSMC and at least a sizable share of the market will benefit from these. I'm not going to claim they will steamroll TSMC but they will be able to take market share. It's a new market. It will be the same as AMD doubling their data center business by taking a few percentages of market share from Intel. In the foundry business TSMC will be like Intel and Intel will be like AMD.\n\nAs a foundry you can make whatever the client designs. Intel clearly stated they will go for a mix and match strategy where clients can combine external IP like ARM with Intel IP like packaging or networking. X86 will always have a place but Intel clearly accepted that it's not only x86 anymore and they are adapting.",
        "created_utc": 1635797782,
        "id": "hixbq51",
        "score": 32,
        "subreddit": "investing",
        "created": 1635826582.0
    },
    {
        "author": "rockinoutwith2",
        "body": "This news just *continues* to humiliate those who keep peddling INTC over AMD - including many nuts on this very sub.  Stop fighting the trend guys, and wake up to the reality that AMD is increasing its technological prowess over Intel on a daily basis.",
        "created_utc": 1636389966,
        "id": "hjtlbpp",
        "score": 32,
        "subreddit": "stocks",
        "created": 1636418766.0
    },
    {
        "author": "longGERN",
        "body": "Can intel run animal crossing?",
        "created_utc": 1636422101,
        "id": "hjvqhzr",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1636450901.0
    },
    {
        "author": "dafootballer",
        "body": "Because hindsight. AMD was a flat trade for years and years. Nvidia and Intel outclassed it by a mile. Lisa Su comes in, tons of hype. Bulldozer is mediocre but there’s some promise. I had AMD at like $12 and that shit didn’t move for a LOOONG time. No regrets getting out because it made sense at the time. I’m now making more on AMD calls now anyway.",
        "created_utc": 1636849314,
        "id": "hkituxy",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1636878114.0
    },
    {
        "author": "Joshsandy074",
        "body": "Lmao whats up with this dude. He’s been stroking his wee wee to Intel on every stock related subreddit there is.",
        "created_utc": 1636060517,
        "id": "hjc0yb1",
        "score": 31,
        "subreddit": "StockMarket",
        "created": 1636089317.0
    },
    {
        "author": "EtadanikM",
        "body": "Not really crazy. I mean, yes, it's hard to predict how high it'd go, but the trend of investing in chips, CPUs, and other advanced hardware is a follow up to present day economic and geopolitical news - ie the competition between the West and China, which is centered around chips; and the global chip shortage, which is the result of various supply issues, that is factoring into their price.\n\nThe market might seem random at times, but it's rational in the *long-term*. Global trends eventually transform into market facts. \n\nFor example:\n\n* Peak oil + climate change -&gt; rise of electric vehicle and new energy companies\n\n* Money printing + global corporate taxes -&gt; rise of bit coin and other ways to avoid taxes / hedge against inflation\n\n* Chip supply issues + competition vs. China -&gt; rise of chip companies\n\nWhat's hard in all this is picking the winners. Just because chip companies are on the rise doesn't mean all of them are doing well. Example: Intel. Just because people are dumping more money into bit coin, doesn't mean all of the currencies are doing well. Just because the market is loving electric vehicles, doesn't mean all electric vehicle companies are having gains like Tesla.\n\nThe noise is there and will always be there. You either live with it and buy into an ETF and accept modest gains, or you try to gamble on which company is going to take it all. That's where the challenge is.",
        "created_utc": 1636404449,
        "id": "hjulelw",
        "score": 31,
        "subreddit": "stocks",
        "created": 1636433249.0
    },
    {
        "author": "rockinoutwith2",
        "body": "Just from a few hours ago\n\n&gt; Intel Corp. ceded more than 2 percentage points of market share to Advanced Micro Devices Inc. in the third quarter, marking another setback for a chip pioneer that has lost some of its technology edge. \n\n\nhttps://www.bnnbloomberg.ca/intel-loses-ground-to-amd-as-demand-for-chromebook-chips-wanes-1.1677165",
        "created_utc": 1636078346,
        "id": "hjd6ikf",
        "score": 31,
        "subreddit": "stocks",
        "created": 1636107146.0
    },
    {
        "author": "roniadotnet",
        "body": "It seems at this point in time where literally any GPU is desirable, as long as Intel can manufacture a volume of OK or better GPUs, there is a potential that those will sell like crazy.\n\nIt’s also not like Intel has never made GPUs before. Many of their CPUs have integrated GPUs in them. Intel needs to make dedicated, bigger versions of those while I recognize that may not be as easy as I wrote it. I mean they are not completely new to the game.",
        "created_utc": 1636060114,
        "id": "hjbzy56",
        "score": 30,
        "subreddit": "StockMarket",
        "created": 1636088914.0
    },
    {
        "author": "TexasInvestor86",
        "body": "INTC earns more in EBITDA than AMD &amp; NVDA both generate in Revenue.. let that sink in, while INTC is 1/4 the market cap of NVDA. I love you retards creating this epic bubble. AMD and NVDA are going to get a massive hair cut and all of you dweebs will be panic selling. hahahahaha",
        "created_utc": 1636148373,
        "id": "hjgyk1b",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1636177173.0
    },
    {
        "author": "Bombboy85",
        "body": "Taiwan semiconductor is building a massive plant here north of Phoenix. Talking a building that will end up being nearly 1 mile in length. Also intel is expanding in the chandler/Gilbert area",
        "created_utc": 1636951813,
        "id": "hkomu93",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1636980613.0
    },
    {
        "author": "Kukukuku1",
        "body": "I give you an upvote for your way of writing. I was fun reading it. Good job!\n\nBut I do not agree with your opinion. Intel is a massive company with a massive market share. \n\nBUT AMD has the better products and can eat away from Intel's market share step by step. Also some of the other companies did start to realize the benefits of arm processor's (Apple, google etc.) \n\nI am pretty sure you will gain better results if you invest your money into some other companies in this Sektor.",
        "created_utc": 1636445939,
        "id": "hjwwswz",
        "score": 27,
        "subreddit": "stocks",
        "created": 1636474739.0
    },
    {
        "author": "thinkxy",
        "body": "5 nodes jump in 4 years. Begging the govt for money for their two plans that won’t come online for the next 2 years. They’re throwing a Hail Mary. They have to be perfect in every aspect and giving their track records, it’s a slim chance…intel is just a PowerPoint presentation company at this point.",
        "created_utc": 1637422842,
        "id": "hle860w",
        "score": 27,
        "subreddit": "stocks",
        "created": 1637451642.0
    },
    {
        "author": "Mean-Cabinet-9322",
        "body": "Yeah but intel bet a chunk of money on building new infrastructure for mfg chips in US and europe. So that would mean when the plants are online they would be in the middle of a glut.",
        "created_utc": 1636950171,
        "id": "hkojw4x",
        "score": 27,
        "subreddit": "StockMarket",
        "created": 1636978971.0
    },
    {
        "author": "rasp215",
        "body": "It’s not as simple as buying ASML machines. Intel has been losing engineering talent for years now. Their management has been crap. Classic case study on a tech company being run by mbas and middle managers, not engineers. It’ll be hard for them to catch up.",
        "created_utc": 1637327236,
        "id": "hl90q5h",
        "score": 26,
        "subreddit": "stocks",
        "created": 1637356036.0
    },
    {
        "author": "sarrsb",
        "body": "INTC",
        "created_utc": 1636905226,
        "id": "hkll7ka",
        "score": 26,
        "subreddit": "stocks",
        "created": 1636934026.0
    },
    {
        "author": "CHERCK_FLOKI",
        "body": "Please tell me this is a joke.\n\nIntel can’t hire half decent engineers. Their entire ecosystem is antiquated beyond belief. \n\nIf you can’t hire the brightest minds because your pay and equity structure is literally laughed at in the industry, then how you change structurally?\n\nEngineers laugh at intel because it’s a joke. Please don’t waste your money. This is the IBM of chip makers. Put that money elsewhere. Anywhere. Just not intel",
        "created_utc": 1636908847,
        "id": "hkltpxe",
        "score": 26,
        "subreddit": "stocks",
        "created": 1636937647.0
    },
    {
        "author": "Mushrooms4we",
        "body": "Intel is a good play just buy, hold and think about something else. No need to try and pump it. Go pump your wife instead.",
        "created_utc": 1636809215,
        "id": "hkgc8e7",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1636838015.0
    },
    {
        "author": "skilliard7",
        "body": "Even if Intel continues to lag behind AMD on performance, it doesn't matter because AMD cannot produce at volumes that allows them to beat Intel market share due to the semiconductor shortage. And even if AMD does manage to source enough fab volume to push Intel out, Intel's fabs that will be subsidized by taxpayers can produce a lot of revenue for significant profit.\n\nThere's so much more downside for AMD than Intel.",
        "created_utc": 1637602760,
        "id": "hlnurc0",
        "score": 25,
        "subreddit": "stocks",
        "created": 1637631560.0
    },
    {
        "author": "tacobff",
        "body": "Im just really concerned about intel holding onto legacy x86 architecture when apple has proven with the m1 that arm can be efficient and powerful at the same time. Company culture is hard to change and by all respects in tech Intel is a dinosaur\n\n&amp;#x200B;\n\nI think ARM will just eat up the x86 market. Its been a long time coming at least AMD will have GPUs to back it up.",
        "created_utc": 1636441586,
        "id": "hjwrgtd",
        "score": 25,
        "subreddit": "stocks",
        "created": 1636470386.0
    },
    {
        "author": "ffsudjat",
        "body": "Tim AAPL? MSFT indeed. For semiconductor I am just too lazy so I buy SMH albeit knowing NVDA, TSMC, ASML, AMD (maybe INTC) should have quite a moat.",
        "created_utc": 1637599629,
        "id": "hlnmwsu",
        "score": 25,
        "subreddit": "stocks",
        "created": 1637628429.0
    },
    {
        "author": "cdazzo1",
        "body": "&gt;THE issue I have with this is not only do I want to know NYTs motives,\n\n[https://www.youtube.com/watch?v=sQN4c3uN\\_tA](https://www.youtube.com/watch?v=sQN4c3uN_tA)\n\nIt's incredibly long but it is a much better answer than I can give, but I'll still try to give you the cliff notes version.  \n\nYuri Bezmenov is often referred to as a \"former KGM agent\".  But he wasn't really an agent, although he obviously helped them.  He was a \"journalist\" but his job description was mostly to \"entertain\" American visitors.  These Americans were carefully vetted before being invited to Russia and upon arrival he did things like get them drunk, make Russia look really good, and try to get them in slightly compromised situations.  Things like pictures of them in the same room as prostitutes or drinking too much so they'd be unsure of what they did the previous day/night and if they said or did something wrong.  He'd then use this as leverage to get them to say favorable things about Russia in the US.\n\nThat was it.  It was all about perception.  That was the majority of KGB \"spy\" operations.\n\nWhen it comes to Evergrand, cui bono? China.  So whether intentionally carrying weight for China or just useful idiots victimized by CCP intel operations, NYT is carrying water for the **CCP who desperately wants to unload assets before the rest of the world catches on**.  This is the exact **same play they ran for the pandemic** when they vacuumed up PPE across the globe while denying human to human transmission.",
        "created_utc": 1636856100,
        "id": "hkj8tvn",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1636884900.0
    },
    {
        "author": "4858693929292",
        "body": "The screenshot says that organization (eg one part of intel.) \n\nIt’s Q4, they probably already hit their hiring budget agreed to last year and are waiting for the approval of their next year budget to re-open hiring. \n\nThis is bog standard corporate stuff.",
        "created_utc": 1636425386,
        "id": "hjvxva7",
        "score": 24,
        "subreddit": "stocks",
        "created": 1636454186.0
    },
    {
        "author": "Kierik",
        "body": "Oracle, Intel, verizon, time warner, IBM,",
        "created_utc": 1636484447,
        "id": "hjywzm6",
        "score": 23,
        "subreddit": "investing",
        "created": 1636513247.0
    },
    {
        "author": "Dadd_io",
        "body": "The dot-com bubble wasn't just dot-coms.  Cisco had a PE over 100 just like NVidia does today since it was \"the building blocks of the internet\".  Intel hit their all-time high then and still haven't surpassed it.  AOL and Yahoo! were Google and Facebook of back then.  Microsoft was ... well, Microsoft back then.  And all those companies were extremely profitable, but traded at ridiculous multiples just like today.  Amazon PE over 70 and Tesla over 300 is dot-com-esque.",
        "created_utc": 1637768421,
        "id": "hlwtj95",
        "score": 23,
        "subreddit": "investing",
        "created": 1637797221.0
    },
    {
        "author": "Anth916",
        "body": "The biggest downside with Intel is that the stock will barely move for long stretches of time and it seems like your money is just wasting away, not really doing anything.",
        "created_utc": 1637027845,
        "id": "hksstx4",
        "score": 23,
        "subreddit": "stocks",
        "created": 1637056645.0
    },
    {
        "author": "fatezeroking",
        "body": "I’m sleeping on Intel hard. They are getting smoked by an iPad processor lol there’s just no comeback from that.\n\nOver the past 5 years, they’ve returned 9.8% vs the S&amp;P 16.7% \n\nIntel is straight dog water.",
        "created_utc": 1637268100,
        "id": "hl60mt5",
        "score": 23,
        "subreddit": "stocks",
        "created": 1637296900.0
    },
    {
        "author": "Unlucky_Gap_4430",
        "body": "LOL this guy posts every day and shills Intel.",
        "created_utc": 1636152637,
        "id": "hjh9a65",
        "score": 23,
        "subreddit": "investing",
        "created": 1636181437.0
    },
    {
        "author": "KGOAT1",
        "body": "INTC is dead money.",
        "created_utc": 1636906823,
        "id": "hklowpm",
        "score": 23,
        "subreddit": "stocks",
        "created": 1636935623.0
    },
    {
        "author": "Soultan1",
        "body": "Dudes a total INTC bag holder!",
        "created_utc": 1636072998,
        "id": "hjcukn8",
        "score": 22,
        "subreddit": "StockMarket",
        "created": 1636101798.0
    },
    {
        "author": "REIRN",
        "body": "INTC",
        "created_utc": 1636117240,
        "id": "hjerdx6",
        "score": 22,
        "subreddit": "stocks",
        "created": 1636146040.0
    },
    {
        "author": "artsmith27",
        "body": "I like Intel, AMD and Nvidia. I do think Intel is going to make a comeback, but it will take some time. I’m long INTC.",
        "created_utc": 1636422581,
        "id": "hjvrkkl",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1636451381.0
    },
    {
        "author": "GeneralSpacey",
        "body": "Isn’t the solution just to give Intel federal resources to finish their current expansion? Alternatively TSMC Arizona? These projects have already started and won’t be done until 2024+. Starting a new project now? It’s gonna be a decade at least before we see the first chip.",
        "created_utc": 1636700854,
        "id": "hkb1nht",
        "score": 22,
        "subreddit": "stocks",
        "created": 1636729654.0
    },
    {
        "author": "OhioBaseball",
        "body": "Intel has A1/A+ credit ratings with $40B of cash on their balance sheet at 9/30/2021. They don't need gov't money but if they can get subsidies that's a good thing.\n\nIntel has made numerous mistakes in the past, but not using EUV lithography is one of the biggest and it's being corrected. If you put TSM's 15x EV/EBITDA multiple on INTC, it goes from $49/share to $124/share. There's hidden value in INTC and EUV lithography utilization is worth a lot (just look at ASML).",
        "created_utc": 1637423945,
        "id": "hleapn6",
        "score": 22,
        "subreddit": "stocks",
        "created": 1637452745.0
    },
    {
        "author": "RajivChaudrii",
        "body": "Worst part is that Pat keeps openly talking about how they'll be \"regaining\" the technology lead in 2025... essentially admitting they'll keep bleeding market share and margins until 3 years from now.  And that's IF Intel regains process lead and TSMC just sits idle.",
        "created_utc": 1637260936,
        "id": "hl5ihc8",
        "score": 22,
        "subreddit": "stocks",
        "created": 1637289736.0
    },
    {
        "author": "EchoServ",
        "body": "Intel has 23 billion in cash. IBM’s problem was they stopped innovating and used their cash on hand to buy back stock and make their exec team rich.",
        "created_utc": 1636909095,
        "id": "hkluazj",
        "score": 21,
        "subreddit": "stocks",
        "created": 1636937895.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "body": "Not everyone has patience to hold for them to get their new factories online. The reddit crowd are into fast moving stocks that they can YOLO all in on options.\n\nIn a few years INTC may 2-5x their current prices, but thats not good for traders who need daily action and crazy movements. Sometimes you buy and hold and keep your head down for a while.",
        "created_utc": 1637268023,
        "id": "hl60g05",
        "score": 21,
        "subreddit": "stocks",
        "created": 1637296823.0
    },
    {
        "author": "L3artes",
        "body": "I'm long AMD, but this is beyond irrational. NVIDIA is even worse. I cut my position recently and now I'm free riding and watching it go. There is only very little time left that they can grow at these rates, then there is a brick wall when the market is saturated. And I 100% agree, Intel will not yield the market easily.",
        "created_utc": 1636062720,
        "id": "hjc6fsb",
        "score": 21,
        "subreddit": "StockMarket",
        "created": 1636091520.0
    },
    {
        "author": "MineConsistent20845",
        "body": "I don't hold Intel or amd but these comments from obvious amd share holders are Cringe as fuck. These guys sound like a bunch of morons who started investing with gme. Intel just released alder lake and it outperforms amd chips. Now they just need to beat epyc chips with new xeon chips, I will make my decision once amd releases their zen3d chips but I kind of hope all of these low IQ amd shills learn the hard way in 2 quarters",
        "created_utc": 1636912581,
        "id": "hkm2vi6",
        "score": 21,
        "subreddit": "stocks",
        "created": 1636941381.0
    },
    {
        "author": "boneywankenobi",
        "body": "Farmers are becoming consolidated yeah, but they operate still on thin margins.  And we actually tried to pitch this to agri futs traders who were our customers for other ag intel products a few years ago and they didn't care.  Weren't even trying to sell it, just gauge interest.  This was first hand feedback from the potential customers. \n\nSo you say I don't understand the usefulness, I'd say most people overestimate it.  I led the project to do this professionally at a $100m+ company.  Realtime data is nice and all, but how are you going to monetize it?  Gotta pay for R&amp;D and the imagery, then act on the imagery in a way you couldn't do otherwise to generate a profit.  Oh, and it can't be specific enough that going a week without data will screw it up because clouds are gonna happen.\n\nI actually worked on the tech and pitching of the listed commercializing ideas listed as a customer of $DMYQ for 3 years, and our existing customers didn't want it.  Not oil, not ag, not traders, not hedgies.  There is some demand out there, but it's niche, few, and far between.  No where near what they say.",
        "created_utc": 1636857886,
        "id": "hkjcrfd",
        "score": 21,
        "subreddit": "SPACs",
        "created": 1636886686.0
    },
    {
        "author": "djOH1",
        "body": "Apple make iPhone And services + car 2025\n\nMSFT software and Xbox \n\nAmd chips and intel market share\n\nNVDA everything it seems\n\nThat’s all I need to know",
        "created_utc": 1637333799,
        "id": "hl9ebxi",
        "score": 21,
        "subreddit": "stocks",
        "created": 1637362599.0
    },
    {
        "author": "MiniZimmer",
        "body": "It because people look at PE and think they’ve done enough research…. AMD’s management is something else whilst intel have a lot to prove. Still own both however.",
        "created_utc": 1636390440,
        "id": "hjtmj8o",
        "score": 21,
        "subreddit": "stocks",
        "created": 1636419240.0
    },
    {
        "author": "JonA3531",
        "body": "Got in AMD at around $4. Sold around $45 unfortunately.\n\nThought process? They are the only other CPU and GPU maker aside from Intel (CPU only) and Nvidia (GPU only), and they got exclusive contract with Playstation and Xbox.\n\nBut in a hindsight, it was a bit of a gamble. Their current success was entirely hinged on their new chip architecture design (Ryzen) to be a good one and Intel to screw up their chip fabrications.\n\nIf Ryzen ended up being mediocre or Intel could still compete with TSMC with their fabs, AMD would not have been as successful as they are now.",
        "created_utc": 1636601873,
        "id": "hk5rgke",
        "score": 21,
        "subreddit": "stocks",
        "created": 1636630673.0
    },
    {
        "author": "browow1",
        "body": "Saying it beat a year old product at double the power draw is not as big a win as you think, mayhaps. I do agree the potential is there for Intel to really do a turn around but it's still got a long way to go before they can even prove they are on the right track - this is just the bare bones minimum start.",
        "created_utc": 1636046947,
        "id": "hjb2dph",
        "score": 20,
        "subreddit": "stocks",
        "created": 1636075747.0
    },
    {
        "author": "rageinrageout",
        "body": "Don't care what anyone says.....INTC is extremely undervalued.  They do half of their total market cap in revenue annually.  They've brought in $21B in income this year alone.  They manufacture their own chips with plans to build new plants in the future subsidized by the US government to help take away reliability on foreign nations for chips.  Say what you want about them, but their numbers don't lie and they are extremely undervalued (P/E less than 10 for a semiconductor company, the largest chip manufacturer on the planet at that, priced at AMD levels and 1/4 of NVDA market cap).",
        "created_utc": 1637196858,
        "id": "hl279dv",
        "score": 20,
        "subreddit": "stocks",
        "created": 1637225658.0
    },
    {
        "author": "Ojninz",
        "body": "Definitely true, intel is definitely behind, but next year I think it was around March that I two is releasing a gaming lineup, more powerful, and to get a foot into the door and catch up, it'll probably be at the same or lower prices as AMD and Nvidia, I've also been wondering if I should buy amd",
        "created_utc": 1638007144,
        "id": "hm9cjxv",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1638035944.0
    },
    {
        "author": "GigaChadEnergy",
        "body": "I wouldn't count Intel out just yet. I think they will come back eventually. Also, it would only take China to park their gunboats outside of Taiwan for 1 day, not talking invasion, just blockage for short amount of time and all of a sudden we only have 1 advanced chip company and its not AMD.",
        "created_utc": 1636390660,
        "id": "hjtn39r",
        "score": 20,
        "subreddit": "stocks",
        "created": 1636419460.0
    },
    {
        "author": "Ja_Nee_Misschien",
        "body": "Everyone know TSMC is using a different naming scheme to make it look like their nodes are more advanced. It's true that Intel had some delays and therefore some of their designs got stuck waiting on the new nodes. \n\nThe last time we have been looking at relative older designs made on older nodes. People seem to believe this os all Intel has but this is obviously not true. They have been developing new IP just like the rest of the industry.\n\nRocket lake is made on Intel 14nm and their chips offer better performance than similarly priced AMD chips made on 7nm. \n\nAlder lake is made on 10nm and outperforms even the more expensive AMD chips made on 7nm.\n\nEither Intel is able to make incredible designs that beat chip designs by AMD even if they are made on more advance nodes or TSMC wasn't really hones when naming the nodes. We'll see when Intel get's their EUV machines.\n\nWhat has changed is new leadership with a lot of technical expertise getting everything moving again.",
        "created_utc": 1635799532,
        "id": "hixg448",
        "score": 20,
        "subreddit": "investing",
        "created": 1635828332.0
    },
    {
        "author": "ese_men",
        "body": "Intel. The AMD and NVDA moves have been off the charts. The new Intel will focus on foundry and Software. They just caught up to AMD, next they will move into NVDA's turf with GPUs early next year. Intel makes their own chips, so they can sell as many as they can make (since i think demand will persist). Best of all they're not constrained by TSM. I think a 3x over the next few years is possible. People have no allegiance, it's all about making money. If Intel executes they could get the AMD/NVDA stock treatment. Maybe a trillion dollar company by the end of the decade.",
        "created_utc": 1636314160,
        "id": "hjpo8dq",
        "score": 20,
        "subreddit": "stocks",
        "created": 1636342960.0
    },
    {
        "author": "Financial-Angle8703",
        "body": "I've a small stake in INTC after it's post earnings tumble. The biggest factor going for it is the DoD will want to prop it up due to potential supply chain issues and it being critical infrastructure.",
        "created_utc": 1636279889,
        "id": "hjnp1dw",
        "score": 20,
        "subreddit": "ValueInvesting",
        "created": 1636308689.0
    },
    {
        "author": "dmitsuki",
        "body": "AMD. Intel's new tech stack basically was \"copy Apple, but using 4 times the power for barely any perf gains\" and things look even worse for the server market, because to hit good speeds Intel literally uses as much power as a GPU. AMD's processors are over twice as efficient, cost the same (so they save data centers a shitload of money) and the tech they have in the pipe means they should also be faster, possibly by over 40%. It's also about to fuse with another profitable company that's IP can straight up just give AMD more offerings to more people for more things. Not to mention if they can get a good API out for their graphics cards, they can be a serious competitor in AI. \n\n&amp;#x200B;\n\nThey are just waiting to explode.",
        "created_utc": 1636133144,
        "id": "hjfuela",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1636161944.0
    },
    {
        "author": "filtervw",
        "body": "The market looks for future results. Intel at the moment looks like IBM when Azure and AWS came around. All promises, no gain. I worked at IBM in those times, the entire company could see what was happening, only the leadership and VPs were busy ignoring reality just to make their quarterly bonuses.",
        "created_utc": 1637257368,
        "id": "hl59c1q",
        "score": 19,
        "subreddit": "stocks",
        "created": 1637286168.0
    },
    {
        "author": "comboverice",
        "body": "INTC",
        "created_utc": 1635998821,
        "id": "hj8rmh7",
        "score": 19,
        "subreddit": "stocks",
        "created": 1636027621.0
    },
    {
        "author": "lingswe",
        "body": "Then intel is the play now, seems most people hate intel in here",
        "created_utc": 1636529416,
        "id": "hk1jv75",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1636558216.0
    },
    {
        "author": "GusTheKnife",
        "body": "A high of $58 to $49 isn’t a “beat down.”  It’s a totally normal move. \n\nThey will be spending a lot on new factories and restructuring, so chip investors think NVDA and others are better.  INTC insiders, however, have been buying INTC regularly for 2 weeks.",
        "created_utc": 1637258925,
        "id": "hl5dc5n",
        "score": 19,
        "subreddit": "stocks",
        "created": 1637287725.0
    },
    {
        "author": "Mine_is_nice",
        "body": "I am holding Intel nervously, feel like Nvidia and AMD are crushing them.",
        "created_utc": 1637712163,
        "id": "hlu41s2",
        "score": 19,
        "subreddit": "stocks",
        "created": 1637740963.0
    },
    {
        "author": "PepeMcPeperson",
        "body": "I am mostly a conservative investor so for the moment i'm only invested in INTC and texas instruments. If i had to open any other positions i would mostly go to the foundry businesses like TSMC or Samsung. \n\nI feel intel, samsung and tsmc are the more sure bets and have been the only ones able to participate in Moore's law the past few years making the leading edge really a oligoply.\n\nIntel since it is traing really cheap at a sub 10 PE with the companies management expecting the revenue to increase by 10% per year and margins only decreasing only 2-3%. With dividend and buybacks combined they return aboud 7% per year if their revenue of profits wouldn't increase which they almost certainly will.\n\nSamsung makes most of it's money from it's foundy business and retail electronics. If it's foundry business' orders decrease they can fill up the remaining space with their own needs. (same as intel)\n\nTsmc is the real leader in the industry with customers having reserved all capacity for years ahead.\n\nFor price targets i would recomend [this DFCF tool](https://tracktak.com/dashboard). You fill in what revenue growth you expect the comming years, how much the ROIC is and what margins you expect.\n\nNVDA and AMD seem like really good companies but they are priced for perfection.",
        "created_utc": 1635797149,
        "id": "hixa529",
        "score": 19,
        "subreddit": "investing",
        "created": 1635825949.0
    },
    {
        "author": "stickman07738",
        "body": "Do not forget NVDA still dominates the markets and do not rule out INTC.   I love AMD and has been since \\~$2/share.  Thankful for Dr. Su leadership.",
        "created_utc": 1636456318,
        "id": "hjx8m3g",
        "score": 19,
        "subreddit": "investing",
        "created": 1636485118.0
    },
    {
        "author": "harmlessloafofbread",
        "body": "The thing that keeps me secure is Intel has actual revenues and a low PE ratio, if theres a crash they will drop the least of the 3.  They have huge government subsidies from their new fabs, due to the chip shortage.  They are entering the GPU market and machine learning, and Mobileye is doing phenomenally.",
        "created_utc": 1637715995,
        "id": "hluca2b",
        "score": 19,
        "subreddit": "stocks",
        "created": 1637744795.0
    },
    {
        "author": "soAsian",
        "body": "https://semiwiki.com/semiconductor-manufacturers/tsmc/304446-highlights-of-the-tsmc-open-innovation-platform-ecosystem-forum/\n\nFoundry is simply not buying off the shelf equipment and hope for the best. this is why TSMC have over 50% market share. TSMC's ecosystem is much better than Intel.",
        "created_utc": 1635799050,
        "id": "hixex56",
        "score": 18,
        "subreddit": "investing",
        "created": 1635827850.0
    },
    {
        "author": "LegitimateShameHands",
        "body": "Gus Richard upgraded AMD on October 27th and downgraded them today while upgrading INTC. How can you change your mind and upgrade and again downgrade within 4 days wtf",
        "created_utc": 1635768886,
        "id": "hivj5jc",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635797686.0
    },
    {
        "author": "mrlumpus98",
        "body": "My intel $47.50c for 11/5 might actually print",
        "created_utc": 1635768922,
        "id": "hivj7im",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635797722.0
    },
    {
        "author": "mrkaluzny",
        "body": "Don’t sell AAPL. I think they’re going to 200 in 22 (depends on chips shortage) new MacBooks are flying off the shelves AAPL is supply bound but the margin on their own devices is higher then Intel-based ones. And this is not priced in IMO.",
        "created_utc": 1635753576,
        "id": "hiv110b",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635782376.0
    },
    {
        "author": "Wazoo_destroyer",
        "body": "1. Intel has been heavily supporting their share price, where would it be without them? Sub $40?\n2. Their p/e ratio reflects their market saturation, who are they going to steal market share from? They are the incumbent.\n3. And they will need every cent to build new fabs.\n4. Never say never, Intel is going to have to take on massive debt, in addition to the 30B they carry at present, to fund IDM2.0. If the CFO is looking for cash the dividend is easy pickings.\n\nTheir new weird CEO has stated intc is aiming for leadership in 2025, 3-4 years away. One thing to remember is this super cycle aside, the semiconductor biz is cyclical, boom and bust. In 3 or 4 years when demand drops off and both TSMC and INTC have built massive chip foundry capacity, where will the customers go? To the foundry with the best process. Whoever has overbuilt will suffer.",
        "created_utc": 1635760375,
        "id": "hiv80az",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635789175.0
    },
    {
        "author": "Wazoo_destroyer",
        "body": "&gt; The nm stuff isn't really accurate for any of them anymore so not worried about a rebrand.\n\nGate leakage and ultimately performance per watt is the real measure of a process. If one compares Tsmc and Intel fabbed processors on what both call 7nm, the tsmc silicon is easily better.",
        "created_utc": 1635759591,
        "id": "hiv75y6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635788391.0
    },
    {
        "author": "Gy7479",
        "body": "Well you create an account with them, then open a BTC or Eth wallet and send your crypto using the wallet adress (Bitcoin to Bitcoin, Eth to Eth). You have one free withdrawal per month, no length terms. Blockfi is only lending to institutions. Please take the time to read their whole website and FAQ, and take the time to read about sending and receiving cryptos, gas fees (transfer fees that you pay for every transaction), etc. I treat my cryptos like my stocks: long term hodler, passive income, aiming for 5% in cryptos for my portfolio. Mainly Btc and Eth, will add a few smaller coins eventually. \n\nAs usual, not your keys not your coins warning.",
        "created_utc": 1635775763,
        "id": "hivvreo",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1635804563.0
    },
    {
        "author": "TheRootOfMostEvil",
        "body": "The keys to financial independence are meme stocks and cryptos. 🔑🔑",
        "created_utc": 1635785768,
        "id": "hiwidpk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635814568.0
    },
    {
        "author": "simplysufficient88",
        "body": "To be entirely fair here, this whole thing’s based on a really bad article title. Everyone’s quoting the CNN article that makes it sound as though the WFP director was claiming all you’d need is $6 billion to solve all hunger. When the actual statement he made was that it would help to fix the growth in world hunger issues we’ve seen recently, not that it would solve hunger entirely. He very specifically mentions that this is a one time donation that would help 42 million people that need immediate aid, but that wouldn’t be a long term fix. Even the CNN article itself now has a correction at the very bottom acknowledging this was a misleading title. \n\nObviously this is all an over simplification of the issue and you can’t just throw money at it to fix it, but the point he was trying to make wasn’t that one donation from one billionaire would permanently solve all hunger but that a one time donation from MULTIPLE of the world’s wealthiest individuals would help save a lot of people in the short term. I think that’s a pretty massive difference.",
        "created_utc": 1635772963,
        "id": "hivq68e",
        "score": 3191,
        "subreddit": "wallstreetbets",
        "created": 1635801763.0
    },
    {
        "author": "Radiant-Experience21",
        "body": "I need to learn how to read complicated texts. Simply88 is my teacher now.\n\nAnd besides, we all know that secretly there are quite a few bright cookies on this sub pretending to be degenerates ;-)",
        "created_utc": 1635775483,
        "id": "hivv6cp",
        "score": 95,
        "subreddit": "wallstreetbets",
        "created": 1635804283.0
    },
    {
        "author": "Naked_Apples",
        "body": "Right now someone is typing how the next crash is inevitable after blowing their account on tesla puts.",
        "created_utc": 1635773286,
        "id": "hivqsef",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1635802086.0
    },
    {
        "author": "Funktastic34",
        "body": "You guess first. If your guess is more than one penny off we audit you and now own your family",
        "created_utc": 1635770022,
        "id": "hivkykn",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1635798822.0
    },
    {
        "author": "jerseyse410",
        "body": "$7.6MM is probably going to be the estimated loss right now, but by the time they get done paying all the expenses associated with the transactions to offload the homes, the total loss will be the $9.xMM.",
        "created_utc": 1635771356,
        "id": "hivn91i",
        "score": 50,
        "subreddit": "StockMarket",
        "created": 1635800156.0
    },
    {
        "author": "flanflan5",
        "body": "Back in July 2020, my account was worth around 350k of TSLA but I lost 70k in one day from gambling. So I sold $700 Covered Calls expiring March 2022 for about $60k. \n\nI kept fucking up after that too and rolled my calls forward (sometimes at the same strike price) to make up for my gambling.\n\nI used to have 1500 shares at one point too. But now I'm down to 1200",
        "created_utc": 1635784440,
        "id": "hiwf7x2",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1635813240.0
    },
    {
        "author": "CodyPomeray_",
        "body": "ugh, I thought it was Certified Robinhood Accountant. Now I gotta re-read whole convo",
        "created_utc": 1635782746,
        "id": "hiwbb17",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1635811546.0
    },
    {
        "author": "DannyDirtStar",
        "body": "Back from yet another ban, turns out taunting the more fragile autists during the DWAC run up was unacceptable. I'll now begin my walk of atonement.\n\n*SHAME* 🔔\n\n*SHAME* 🔔\n\n*SHAME* 🔔",
        "created_utc": 1635761639,
        "id": "hiv9ffh",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1635790439.0
    },
    {
        "author": "chrisbe2e9",
        "body": "Because there are other coins that you can grab early. And if they ramp up a few thousand percent, that buy in price is worth it. \n\nRemember, this isn't investing. It's a casino. \n\nCheck out MANA (decenterland) for example. I bought in at a buck. It went up to 4.50 a few days later. Sold, made some money. Now i'm looking for the next one to swing. \n\nBut again, this isn't investing. So if that's more your thing. I would avoid crypto.",
        "created_utc": 1635775695,
        "id": "hivvmc4",
        "score": 32,
        "subreddit": "CanadianInvestor",
        "created": 1635804495.0
    },
    {
        "author": "SquirrelyInvestor",
        "body": "Kinda sad that 95% of spac talk is now just “which pump and dump should we all join next.”\n\nEven sadder is that it’s probably working out better than the “extensive DD” everyone used to post/talk/trade off of.\n\nHappy Monday everyone.",
        "created_utc": 1635772489,
        "id": "hivpaht",
        "score": 32,
        "subreddit": "SPACs",
        "created": 1635801289.0
    },
    {
        "author": "kstorm88",
        "body": "Holy shit I think people actually went out dressed up in wsb costumes... Fuck this place sucks now.",
        "created_utc": 1635761372,
        "id": "hiv94ff",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1635790172.0
    },
    {
        "author": "Minimum_Contributor",
        "body": "I too YOLO’d on a ton of chairs. The garage is full of chairs now but I haven’t seen a 1000% gain. Did I do it wrong?",
        "created_utc": 1635779787,
        "id": "hiw4kkb",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1635808587.0
    },
    {
        "author": "Humber221",
        "body": "Dont do anything.. study some.. you bought nio almost at an ath and now you want to sale at the lows. I don’t think it’s been 6 months since the ath… . just hold and average down. Nio is a good company..",
        "created_utc": 1635772753,
        "id": "hivprzd",
        "score": 28,
        "subreddit": "investing",
        "created": 1635801553.0
    },
    {
        "author": "quantomian",
        "body": "are you saying $100 now or\nin 2040?",
        "created_utc": 1635774339,
        "id": "hivsuq1",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1635803139.0
    },
    {
        "author": "HighPriestofShiloh",
        "body": "I still haven’t even seen an episode yet lol.  I guess it’s old now lol.",
        "created_utc": 1635774931,
        "id": "hivu1nh",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1635803731.0
    },
    {
        "author": "chrisg42",
        "body": "Give it time. I felt like they bought homes at their peak summer prices and now the prices are falling",
        "created_utc": 1635769990,
        "id": "hivkwon",
        "score": 23,
        "subreddit": "StockMarket",
        "created": 1635798790.0
    },
    {
        "author": "rioferd888",
        "body": "Who the fuck is buying all this TSLA...\n\nLike seriously..\n\nI love it but its just ridiculous now lol",
        "created_utc": 1635785147,
        "id": "hiwgvzt",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1635813947.0
    },
    {
        "author": "stumblios",
        "body": "Coke bought 15% of Bodyarmor in 2018, so they've had access to Coke's distribution network for a few years now. With this, they just bought the remaining 85%.",
        "created_utc": 1635780327,
        "id": "hiw5scq",
        "score": 21,
        "subreddit": "stocks",
        "created": 1635809127.0
    },
    {
        "author": "happy_facts",
        "body": "Yeah, now we just pay property taxes on top of income taxes, nothing like that right.",
        "created_utc": 1635778393,
        "id": "hiw1icv",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1635807193.0
    },
    {
        "author": "PhaseFull6026",
        "body": "people thought we'd have flying cars and shit in 2020. Now everyone thinks they're going to be living forever.",
        "created_utc": 1635760392,
        "id": "hiv80z8",
        "score": 20,
        "subreddit": "stocks",
        "created": 1635789192.0
    },
    {
        "author": "FallingSky1",
        "body": "I've been thinking SPY needs a pullback for weeks now and have avoided short term calls but it doesn't seem to be budging at all.",
        "created_utc": 1635771501,
        "id": "hivni3o",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1635800301.0
    },
    {
        "author": "AromaticWealth412",
        "body": "I’m almost a year in now (24) and I have learned a lot with just the experience. I’m still very new but as time goes on you start to pick up on things. Focus on a couple stock and just look them up. See when the earnings is and how the numbers are! I put about 10-15 hours of research in before pulling the trigger on LCID about a month ago and it feels good seeing returns based on a good company and not meme stocks",
        "created_utc": 1635763800,
        "id": "hivc266",
        "score": 17,
        "subreddit": "stocks",
        "created": 1635792600.0
    },
    {
        "author": "SavorySkills_",
        "body": "Tesla now accepting $TSLA as payment. 📈📈📈",
        "created_utc": 1635781809,
        "id": "hiw95pi",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1635810609.0
    },
    {
        "author": "Tfarecnim",
        "body": "Yeah no, there's way too many accounts trying to push this crap stock right before a share unlock.  Stop it.\n\nAsk yourself a question, if it is really such a great company, then why did 80% of shareholders turn in their shares for $10 rather than hold on to them?  There's a reason they are so high, and it's not because it's a great company at a low price.\n\nThis play isn't new and has been seen by many previously low float deSPACs such as OPAD, SPIR and IRNT.\n\nAs for my play?  I don't know when the unlock will happen, but I suspect it will be sometime between now and December, so in about a week or so, I will be picking up 15P and waiting for the inevitable drop that's implied by the warrant-common gap.\n\nRemember that the PIPE has a $10 cost basis and unlike dumb Redditors, they will take a guaranteed 80% return on an investment and won't diamond hand it to 0.  And relative to the current float, the PIPE is huge so the drop will be very big, possibly even below 10.\n\nSeriously, after GME everyone is always looking for the next \"squeeze\", but chances are, if you've just heard of it it's too late.\n\n\nWe are not here to carry your bags for you, stop gambling on garbage hoping for an unrealistic return and pick a solid company like SOFI.  Seriously, 2023 25c LEAPs on SOFI will print better than 90% of these shitty squeeze plays.  Sure it might not be the 500% returns in 2 weeks that people seem to be hoping for, but at least you won't be -70% after a month bagholding something that someone told you would go higher.",
        "created_utc": 1635769770,
        "id": "hivkjul",
        "score": 17,
        "subreddit": "SPACs",
        "created": 1635798570.0
    },
    {
        "author": "maejsh",
        "body": "Long NIO, they are growing, expanding, building and innovating, they and you got caught up in the hype, but now it should be a more healthy grow, they are still hurting from chinas regulations and from the anti china-pro us sentiment a lot of places, reddit most of all. \nHeard them named as a good play just this morning on a big investment podcast/live show here. Made me even more bullish.",
        "created_utc": 1635779498,
        "id": "hiw3xhu",
        "score": 16,
        "subreddit": "investing",
        "created": 1635808298.0
    },
    {
        "author": "lambo630",
        "body": "Oh no, TSLA dropped $20 and now is only UP $15 in pre-market. See how stupid y’all sound?",
        "created_utc": 1635770766,
        "id": "hivm8a6",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1635799566.0
    },
    {
        "author": "Mike82BE",
        "body": "Too dangerously close now to S1 and subsequent pipe dump. Better plays out there",
        "created_utc": 1635765646,
        "id": "hiveh34",
        "score": 15,
        "subreddit": "SPACs",
        "created": 1635794446.0
    },
    {
        "author": "RiverFrogs",
        "body": "Those are all under yum brands now but I could be missing something about if yum was just a spin-off or something",
        "created_utc": 1635784757,
        "id": "hiwfys6",
        "score": 14,
        "subreddit": "stocks",
        "created": 1635813557.0
    },
    {
        "author": "skyplt29",
        "body": "So...let me get this straight; during the last three months while TLRY and the sector were declining Cantor held their 18USD forecast.  Now TLRY is in the 10s and they revise to the 11s.  Methinks Pablo is not doing his job very well.  Or perhaps more realistic, some paying clients want to accumulate?  Free analyst advice is worth exactly what you pay for it...nothing.",
        "created_utc": 1635776099,
        "id": "hivwgno",
        "score": 14,
        "subreddit": "weedstocks",
        "created": 1635804899.0
    },
    {
        "author": "AboveAll2017",
        "body": "Tesla right now: “listen.. listen.. I am the market now”",
        "created_utc": 1635769115,
        "id": "hivjibh",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1635797915.0
    },
    {
        "author": "OSRSkarma",
        "body": "I would sell now while you are ahead my guy\n\nFirst one is free",
        "created_utc": 1635765962,
        "id": "hivewlt",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635794762.0
    },
    {
        "author": "kk7766",
        "body": "Elon Musk offers to sell Tesla stock 'right now' if UN can show how $6 billion would solve world hunger\n\nYou know he could actually do this lol",
        "created_utc": 1635781533,
        "id": "hiw8j4q",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635810333.0
    },
    {
        "author": "dbgtboi",
        "body": "bruh that was its PE this morning, its at 380 now, get with the times",
        "created_utc": 1635783067,
        "id": "hiwc1dc",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635811867.0
    },
    {
        "author": "WhyDude420",
        "body": "Who knew that a virus that would end up killing 740k+ Americans in under 2 years would be the best thing to ever happen to the stock market. Classic. Can’t wait for the documentaries years from now.",
        "created_utc": 1635785141,
        "id": "hiwgvh3",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635813941.0
    },
    {
        "author": "Deeperfuckinvalue",
        "body": "Well with IV off the roof , i doubt its a good time to buy now",
        "created_utc": 1635783279,
        "id": "hiwcizi",
        "score": 12,
        "subreddit": "options",
        "created": 1635812079.0
    },
    {
        "author": "Agirre8",
        "body": "OCGN is the move now.",
        "created_utc": 1635783642,
        "id": "hiwdcsa",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1635812442.0
    },
    {
        "author": "AnxiousScientistDude",
        "body": "Small cap is now considered $1.5B market cap, when it used to be $1.0B. Inflation's a bitch.",
        "created_utc": 1635751394,
        "id": "hiuyrc1",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1635780194.0
    },
    {
        "author": "chedrich446",
        "body": "Bro fuck AAL. I flew them last weekend and like always my flight got delayed 5 hours it ruined my weekend. Happens every single time I fly American. Delta or United only from now on.",
        "created_utc": 1635782621,
        "id": "hiwb0ta",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1635811421.0
    },
    {
        "author": "SmallHandsMallMindS",
        "body": "There are 3 ways to make money in the markets: Be smarter, Be Earlier, and cheat. Now you arent smarter, and you dont know how to cheat, so next time be early\n\nTLDR: Buy GME when its at 4$ instead of 400$, and youll be fine",
        "created_utc": 1635781496,
        "id": "hiw8g1u",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1635810296.0
    },
    {
        "author": "Far_Bass_7284",
        "body": "I see you now, works_best_alone.",
        "created_utc": 1635762136,
        "id": "hiva0e4",
        "score": 10,
        "subreddit": "StockMarket",
        "created": 1635790936.0
    },
    {
        "author": "Danlovestofly",
        "body": "Now we are talking!!",
        "created_utc": 1635781836,
        "id": "hiw97yg",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1635810636.0
    },
    {
        "author": "Deesco5",
        "body": "You missed the fact that Elon solved world hunger and TSLA shares are now the reserve currency for earth AND Mars",
        "created_utc": 1635784222,
        "id": "hiwepf8",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1635813022.0
    },
    {
        "author": "fugov",
        "body": "&gt;It seems like information is never free and it feels like everyone has a secret they want to sell you.\n\nThis is exactly the case. These people were at some point in time in the same place as you are now. They have put in a lot of work and probably lost a lot of money to get where they are now. Now they know a \"shortcut\" that they can teach you about, well not directly, just enough to keep you intrigued.\n\nProblem is, even if you buy their stuff, you will never be as good as them because what is missing is the foundation that they have build and the exposure to the topic that they got. It pays off to work and learn for yourself, even tho it is painful and dagerous and tedious af.\n\nYou will never become a great musician, artist, programmer or investor by watching videos. What will get you there is reading books and grinding. Grinding, grinding, grinding.\n\nAnd most people are not willing to do that. So doing that already will bring you in the top 1% of people who COULD be successful.",
        "created_utc": 1635766076,
        "id": "hivf25g",
        "score": 9,
        "subreddit": "stocks",
        "created": 1635794876.0
    },
    {
        "author": "msg582",
        "body": "Look at me Mods. This is the daily thread now.",
        "created_utc": 1635757219,
        "id": "hiv4q8r",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635786019.0
    },
    {
        "author": "bonejohnson8",
        "body": "Now I drive a Tesla and can't find oxys anymore.",
        "created_utc": 1635771243,
        "id": "hivn1uu",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635800043.0
    },
    {
        "author": "giggy13",
        "body": "Good day for renewables (ZCLN/HCLN) &amp; NOU.   \n\n\nVOYG did a 100% in a few days, now at 20$+ ps",
        "created_utc": 1635775185,
        "id": "hivuk6y",
        "score": 9,
        "subreddit": "CanadianInvestor",
        "created": 1635803985.0
    },
    {
        "author": "AlE833",
        "body": "You’ll probably start getting DMs/spam from people telling you they can find shares for you, like I am now",
        "created_utc": 1635778470,
        "id": "hiw1oj5",
        "score": 9,
        "subreddit": "stocks",
        "created": 1635807270.0
    },
    {
        "author": "SpacedSlayer",
        "body": "His point?\n\nSome big shot said: 2% of Elon's net worth would solve world hunger.\n\nElon said: show us all the math openly and I'll give the 2%.\n\nYou don't have to agree with someone to agree with their point. The guy talking about Elon's net worth needs to prove his point. Openly where everyone can judge it. That's the move right now.",
        "created_utc": 1635773415,
        "id": "hivr1dl",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635802215.0
    },
    {
        "author": "kk7766",
        "body": "When Tesla's market cap was the same as Walmart I thought it was over-valued. Now it's 3x as much as Walmart",
        "created_utc": 1635783534,
        "id": "hiwd3ts",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635812334.0
    },
    {
        "author": "Crowleyer",
        "body": "+$60 was reached due to hype, where Nio was portrayed as \"Chinese Tesla\". \nNow the narrative is different, because there are other competitors to bet on. It's a growing company, so I believe that stock has a potential for $50 EOY or in the next few months. For now, it will probably consolidate between $35-$45 for a while. \n\nI can be wrong tho.",
        "created_utc": 1635768266,
        "id": "hivi7r4",
        "score": 8,
        "subreddit": "investing",
        "created": 1635797066.0
    },
    {
        "author": "supergnawer",
        "body": "I left my career of 20+ years in IT (including FAANG companies) and now I draw web comics. I had a burnout, took an year off, then applied to another company. Worked for 2 months, saw all the same bullshit, couldn't handle it anymore. Thankfully I have savings and I am fine with no income for now.",
        "created_utc": 1635755068,
        "id": "hiv2ju4",
        "score": 8,
        "subreddit": "investing",
        "created": 1635783868.0
    },
    {
        "author": "The-Night-Raven",
        "body": "Well I suck at the casino market, so went to the real casino this past weekend made $4 grand and now dumping in the casino market this morning...what a vicious cycle.",
        "created_utc": 1635772758,
        "id": "hivpsb4",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635801558.0
    },
    {
        "author": "Clambucket1",
        "body": "Got some TSLA 11/12 1475c. So now it will tank",
        "created_utc": 1635775053,
        "id": "hivuahk",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635803853.0
    },
    {
        "author": "bifburger",
        "body": "Gonna be one of those LARGE times...\nGot LCID, MTTR, PLUG and MQ.\n\nNow open the Casino!",
        "created_utc": 1635768359,
        "id": "hivicrj",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635797159.0
    },
    {
        "author": "Leon2274",
        "body": "I forgot and had a wank this morning. I start now lol",
        "created_utc": 1635772187,
        "id": "hivoqf6",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635800987.0
    },
    {
        "author": "antelope591",
        "body": "Sold my Chinese stocks at the top last week then went all in a SPAC that's up 60% right now pre-market....wtf is this feeling? I usually just lose money.",
        "created_utc": 1635762411,
        "id": "hivaccd",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635791211.0
    },
    {
        "author": "420Secured",
        "body": "Man I changed my username when 420 was just a pipe dream and Elon got investigated by the SEC for it. Now look, my little TSLA is all grown up!",
        "created_utc": 1635770676,
        "id": "hivm2mr",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635799476.0
    },
    {
        "author": "maz-o",
        "body": "now of all times?",
        "created_utc": 1635781700,
        "id": "hiw8wog",
        "score": 8,
        "subreddit": "stocks",
        "created": 1635810500.0
    },
    {
        "author": "GeorgeWashingtonTFP",
        "body": "Lol no daily thread. Top confirmed, mods were paid to not post daily thread so now no one knows what's going on. ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)",
        "created_utc": 1635757196,
        "id": "hiv4pdg",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635785996.0
    },
    {
        "author": "mousepop321",
        "body": "https://www.reddit.com/r/wallstreetbets/comments/qjxg0m/what_are_your_moves_tomorrow_november_01_2021/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf looks like I’m mod now 🥸",
        "created_utc": 1635757829,
        "id": "hiv5c8i",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635786629.0
    },
    {
        "author": "productivitydev",
        "body": "Do you think company as a whole has value? If not would you give any company away for free? And if the company has value, why wouldn't small piece of that have value?\n\nBut of course... I understand why you are asking this question. Because if you just buy a stock and you let it stay there, unless the company gives dividends you will receive nothing in return. So you agree that a company that gives dividends does have value? Let's say a company that gives 10% of dividends each year, will make you back that money in 10 years and from there everything else is a bonus.\n\nNow. What is the reason why every company doesn't give dividends? The reason is growth. They and their shareholders both think it's better to invest the potential dividends back into growing the company. \n\nBut the company always will have \"potential\" to give out dividends, once they decide they don't need to grow anymore - they could start giving out dividends, but meanwhile you can think of dividends as constantly being automatically invested back into the company, however due to company growing the potential also increases an you can still cash out the \"dividends\" by selling the stock at higher price due to potential of dividends having been grown.\n\nDoes that make sense?",
        "created_utc": 1635753072,
        "id": "hiv0idn",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635781872.0
    },
    {
        "author": "sherhil",
        "body": "Ok now I’m starting to not understand Tesla 🤔",
        "created_utc": 1635785362,
        "id": "hiwhe56",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635814162.0
    },
    {
        "author": "ShnyMnstr",
        "body": "Welp glad to see my SPY 460c that expired friday are good now 👍",
        "created_utc": 1635773848,
        "id": "hivrvhl",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635802648.0
    },
    {
        "author": "treebarkcharlie",
        "body": "Sold FUBO on Thursday and it's now up 11%. You're welcome to those who still own it",
        "created_utc": 1635780744,
        "id": "hiw6q2k",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635809544.0
    },
    {
        "author": "DovahkiinAF",
        "body": "Any commons with solid risk/reward left? DCRC and the crypto SPACs near $10 were great but they’re all at or over $11 now. I’ve scooped DMYQ as a similar play but I’m blanking on others.",
        "created_utc": 1635764136,
        "id": "hivchjs",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1635792936.0
    },
    {
        "author": "Investnew",
        "body": "What they list it for doesn’t matter right now. Every house in the neighborhoods I’m looking for are going well over ask like 20% or more.  \n\nThis article probably is a non story.  If the are listing houses 50k less than they paid and they end up going for 200k more than they list, it’s a win.",
        "created_utc": 1635758024,
        "id": "hiv5jai",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635786824.0
    },
    {
        "author": "CalyShadezz",
        "body": "LCID is people looking for TSLA 2.0.\n\nI think most here understand that TSLA does a lot beyond their EV production and the market is pricing in a very optimistic future versus their other ventures (as well as increased auto sales).\n\nLCID is a luxury EV supplier. They have some positives in their tech but overall they're just an EV company. They're somewhere in the ballpark of 10k preorders.\n\nNow compare them to a company like Ford who has a similar market cap at the moment. Ford does about 4m in New vehicle sales per year. \n\nThink about that. The market is very irrational right now but nothing justifies LCID's current valuation besides \"Bro EV is the future, get the next TSLA before you miss out.\"\n\nI expect LCID will keep running tho...the market seems to love high valuations with zero justification.",
        "created_utc": 1635770846,
        "id": "hivmd65",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635799646.0
    },
    {
        "author": "sloanemonroe",
        "body": "How do these two statements make sense?  1. All these cnbc people have said for 1.5 years is that due to QE of $120b per month the market will keep going up. And now, they all say tapering down of QE won’t make a difference. My dumb mind can’t see how both can be true.",
        "created_utc": 1635783602,
        "id": "hiwd9gr",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635812402.0
    },
    {
        "author": "slammerbar",
        "body": "Good Morning!!!\n\nMcDonald’s is now selling a McRib NFT. https://wordpress.futurism.com/mcdonalds-mcrib-nft",
        "created_utc": 1635750255,
        "id": "hiuxjo7",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1635779055.0
    },
    {
        "author": "wafflepiezz",
        "body": "Of course, after I lost $20k on Microvast $MVST, now it seems that things are starting to pick up.\n\nI hope my $3k in March 2022 calls can make it all back lol",
        "created_utc": 1635766202,
        "id": "hivf8cl",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635795002.0
    },
    {
        "author": "SwetzAurus",
        "body": "do you have a structured settlement, but need cash now???",
        "created_utc": 1635776847,
        "id": "hivy3is",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635805647.0
    },
    {
        "author": "Olgrateful-IW",
        "body": "Your entire make believe scenario belies the fact that every other first world free nation pays better and closer to (and above) a living wage and the world didn’t end as a result. Every little business didn’t shut down. \n\nIt turns out when people have actual purchasing power instead of barely affording the means to live (or not affording it) despite working full time that they are then able to support the very businesses they can’t afford to shop at now. The small ones.\n\nWhat doesn’t track is the American attitude that “this is the best it could work” that you seem to have when other places are literally doing it all better. Better wages, economies for the middle class, healthcare, and overall financial security.\n\nThe irony of what you are worried about is currently happening under the system we have now. But due to a total lack of regulation. Giant companies crushing start ups. Giant companies treating their employees poorly. Monopolies and to big to fail due to lack of regulations and mergers being allowed that shouldn’t. \n\nUnregulated capitalism is causing all the things you FEAR fair wages would create. \n\nIsn’t that funny? But I’m out as this obviously not going anywhere productive.",
        "created_utc": 1635780645,
        "id": "hiw6hys",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635809445.0
    },
    {
        "author": "Zenstugus",
        "body": "If the market burst now what's the fed going to do? Dump even more money into the economy or let the country stagnate for the next decade?",
        "created_utc": 1635781304,
        "id": "hiw8069",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635810104.0
    },
    {
        "author": "Haratara1",
        "body": "Ocgn is exploding. This idiot has been telling you to buy for a week now.",
        "created_utc": 1635773547,
        "id": "hivraje",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635802347.0
    },
    {
        "author": "SugarMapleSawFly",
        "body": "Everyone get in the ocean right now. Everyone. Now. If you’re alive after 48 hours, you can come back on land for the feast with the other champions.",
        "created_utc": 1635781903,
        "id": "hiw9dii",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635810703.0
    },
    {
        "author": "diamondhands95",
        "body": "**Get in OCGN now**",
        "created_utc": 1635782394,
        "id": "hiwaif3",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635811194.0
    },
    {
        "author": "TurielD",
        "body": "Yup, gpt burned on that kind of pullback last year. Take profits now and re-buy, there *will* be opportunity",
        "created_utc": 1635761082,
        "id": "hiv8sej",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635789882.0
    },
    {
        "author": "Semperfi74",
        "body": "PLUG/VLTA/CHPT/TSLA - and you still asking how to make money or go green today ??? C\\`mon ,tards,grab those now",
        "created_utc": 1635764958,
        "id": "hivdjpd",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635793758.0
    },
    {
        "author": "OogdayAyday",
        "body": "Bakkt is quite the weird one. It started off dumping and now it's halted at $43.06 after some sudden massive buy.\n\nThe price action on this one has been nothing short of stunning.",
        "created_utc": 1635774628,
        "id": "hivtff8",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1635803428.0
    },
    {
        "author": "AboveAll2017",
        "body": "How I have not been assigned my $970 CC by now is beyond me",
        "created_utc": 1635781386,
        "id": "hiw86tb",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635810186.0
    },
    {
        "author": "sockalicious",
        "body": "That chart of market caps as red and green squares is interesting to stare at for a minute.\n\nTSLA is now as large as all other automakers put together.\n\nThe world's second largest automaker is NIO.\n\nMeanwhile, these long dated Ford calls I've been holding are quietly printing a little every week.  Ford is somewhere on this chart but its square is almost too small to see.\n\nI do go outside sometimes.  When I do, I see Toyotas and Hondas.  I see lots of Fords.",
        "created_utc": 1635780816,
        "id": "hiw6vsp",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635809616.0
    },
    {
        "author": "Scatamarano89",
        "body": "Now i don't know jack about this company etc but i know that gambling is something you should always invest on, on par with guns and Becky",
        "created_utc": 1635759552,
        "id": "hiv74fh",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635788352.0
    },
    {
        "author": "SarcasticTrumpet",
        "body": "I want to believe in SPY right now but I have an itch I'm going to actually listen to this time, for better or worse",
        "created_utc": 1635778983,
        "id": "hiw2sww",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635807783.0
    },
    {
        "author": "LastPotato1214",
        "body": "I think people waited fearing a pipe dump, and now are fomoing in.\n\nWarrants haven't been called, some pipes still locked up, and insider's have actually just added.  (Nea)",
        "created_utc": 1635763156,
        "id": "hivb919",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1635791956.0
    },
    {
        "author": "upbeat_controller",
        "body": "Dead money, like almost all pre-DAs right now",
        "created_utc": 1635771632,
        "id": "hivnqbf",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1635800432.0
    },
    {
        "author": "startsmall_getbig",
        "body": "Any good LEAP to get right now to get started?",
        "created_utc": 1635773056,
        "id": "hivqcmo",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635801856.0
    },
    {
        "author": "eireks",
        "body": "it has been accepted, DCRCW will now moon 50% from here",
        "created_utc": 1635770264,
        "id": "hivld6o",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1635799064.0
    },
    {
        "author": "A-SPAC_Rocky",
        "body": "Now we go up?",
        "created_utc": 1635779268,
        "id": "hiw3f8w",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635808068.0
    },
    {
        "author": "GenghisFrog",
        "body": "I hate having money sitting not invested right now when the market is running wild. Busy at work and don’t have time to research anything. Arghhh.",
        "created_utc": 1635784207,
        "id": "hiweo2k",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635813007.0
    },
    {
        "author": "SamDeutschRich",
        "body": "just to mention that Cathie is unloading her position since two weeks now.",
        "created_utc": 1635781558,
        "id": "hiw8l6z",
        "score": 6,
        "subreddit": "options",
        "created": 1635810358.0
    },
    {
        "author": "Artistic_Data7887",
        "body": "That’s one thing that I feel a lot of people still haven’t fully realized. The fact that everyone has the ability to trade/invest at their finger tips now. Pairing that with low/no fees, and information being available almost instantly, should result in the roaring 20s 2.0…followed by…",
        "created_utc": 1635782092,
        "id": "hiw9tcq",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635810892.0
    },
    {
        "author": "SeanSeanSean94",
        "body": "Is that what they’re telling themselves now?",
        "created_utc": 1635779834,
        "id": "hiw4oec",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635808634.0
    },
    {
        "author": "CHAiN76",
        "body": "Well done holding. Hasn't always been easy. \n\n$1145 now in pre-market. $1250 this week?",
        "created_utc": 1635759427,
        "id": "hiv6zp2",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635788227.0
    },
    {
        "author": "Mike82BE",
        "body": "yes but I also feel too many people are trying to pump it now\n\nso someone wants to make a massive dump ;-) not only the shorts",
        "created_utc": 1635767806,
        "id": "hivhj7f",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1635796606.0
    },
    {
        "author": "Narradisall",
        "body": "Why did I make that 950 banbet against Tesla? Now I feel like a poor Michael Burry",
        "created_utc": 1635778770,
        "id": "hiw2cax",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635807570.0
    },
    {
        "author": "Itsnotjustadream",
        "body": "This is EXACTLY whats happening at my fortune 100 except last year they cut benefits and bonus effectively reducing our total comp by about 13-15 percent (the benefits were stellar.. WERE).  This year they were all SHOCKED that attrition in highly skilled areas hit 15-18% so to combat it they took their sweet ass time and decided pay raises were in order.  The CEO sent out a company wide email basically saying expect a conversation with your manager as we're making changes.\n\nThey touched only the areas with the highest attrition (about 60% of workforce) and the starting salary.  We now have folks who have been here 1-5 years who are going to make the same as a new hire.  We now have folks who have been here 10 years who are going to be making $1-$5 more than a new hire.  We now have specialized technical experts getting paid the same as a college hire.  Good luck if the bonus this year sucks because the folks I hang out with who were absolutely dedicated to making this a place we retired from are all tooling up and looking.",
        "created_utc": 1635775551,
        "id": "hivvbfu",
        "score": 6,
        "subreddit": "investing",
        "created": 1635804351.0
    },
    {
        "author": "Life_is_Truff",
        "body": "Wait, girls have brains now? Thanks article, this is very insightful hahaha",
        "created_utc": 1635776849,
        "id": "hivy3lr",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1635805649.0
    },
    {
        "author": "cnelson711",
        "body": "I'm all for house prices raising at or near the inflation rate.  But if my home value went up $100k because of the local market, it'd be bittersweet.  Yes, I picked the right market and am now a beneficiary of that market's appreciated prices.  But it also means my kids would have harder times affording a house.  It means if I wanted to move to a bigger house in the same area I'd have to pay a lot more.  It means more property taxes soon.",
        "created_utc": 1635771598,
        "id": "hivno78",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635800398.0
    },
    {
        "author": "Thanathos52",
        "body": "Why's the dialy thread hidden now or am I retarded?",
        "created_utc": 1635750077,
        "id": "hiuxcq7",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635778877.0
    },
    {
        "author": "Phrankespo",
        "body": "Its maang now, lmao!",
        "created_utc": 1635774930,
        "id": "hivu1lx",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635803730.0
    }
]