[
    {
        "author": "Investing8675309",
        "body": "Haha true true, and yeah, in my head immediately pops Amazon and I shake my head. Point taken, I should probably be thinking of them more like Accenture. As long as they have some growth and keep sending that dividend I’m good!",
        "created_utc": 1615902585,
        "id": "gr4eee7",
        "score": 1,
        "subreddit": "investing",
        "created": 1615931385.0
    },
    {
        "author": "AlbarBear",
        "body": "Anyone looking at Accenture? Has had some good news stories out recently and earnings coming up soon",
        "created_utc": 1614777279,
        "id": "gpj3b4y",
        "score": 1,
        "subreddit": "investing",
        "created": 1614806079.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 16th of March\n\n\n\n## Upcoming events for Tuesday, March 16th\n\n - Expected earnings:\n\n  ABIO, ADVWW, ALSK, APG, ASPU, AYLA, BDSX, BMTX, CAL, CALA, CLPR, CNF, COUP, CRIS, CRTX, CRWD, CTRN, CUE, DBI, DFFN, DL, DLNG, DTIL, ELDN, EMAN, EOLS, ETON, FANH, FCEL, FF, FLNT, FORTY, FREE, FTK, FUSN, FUTU, GBIO, HIL, HJLI, HUGE, IDN, IMNM, IMOS, INFI, INPX, IPHA, IRCP, JBL, JILL, KIN, KIQ, KODK, KROS, LEN, LEN.B, LTBR, MICT, MOTS, NBEV, NES, NEW, NFE, NPK, NTN, NYC, OCX, ORGO, OTEL, PFMT, PLRX, PMD, PRLD, PRTH, REDU, REI, RMED, RNA, RUHN, SHSP, SMAR, SRGA, STSA, SUMR, SYNC, TLC, TOUR, TRIL, TSQ, VBFC, VEL, VFF, VIRX, VOLT, WF, WKEY, XGN, XNET, YMTX, YTEN\n\n - Ex-div:\n\n  ACCO, ALLE, ARES, BKCC, CEN, CINF, CIZN, CXE, CXH, DMB, DYFN, ESCA, FINS, FLXS, FNF, FOF, FSFG, FSK, FSKR, GAB, GDL, GDV, GGZ, GNT, GRX, GUT, GWRS, HCA, HES, HI, HMN, HOFT, ICE, ITT, IVH, KSS, LDP, LRCX, MCR, MCY, MIE, MIN, MMT, MRTN, NJR, NMFC, NWS, NWSA, OPP, OXLC, OXSQ, PGZ, PHI, PSF, PTA, RA, RE, RFM, RIV, RMI, RMM, RNP, RNST, RQI, RSF, RYN, SJI, SLGN, STFC, SWBI, TCPC, TDS, TY, UHT, UTF, UTMD, VSH, VST, WH, WU\n\n - Economic events and announcements:\n\n    - 20-Year TIPS Auction (previous: 1.920%)\n    - API Weekly Crude Oil Stock (previous: 12.792M)\n    - Business Inventories (consensus: 0.3%, previous: 0.6%)\n    - Capacity Utilization Rate (consensus: 75.5%, previous: 75.6%)\n    - Core Retail Sales (consensus: -0.1%, previous: 5.9%)\n    - Export Price Index (consensus: 0.9%, previous: 2.5%)\n    - Export Price Index (previous: 2.3%)\n    - Import Price Index (consensus: 1.2%, previous: 1.4%)\n    - Import Price Index (previous: 0.9%)\n    - Industrial Production (consensus: 0.3%, previous: 0.9%)\n    - Industrial Production (previous: -1.83%)\n    - Manufacturing Production (consensus: -0.1%, previous: 1.0%)\n    - NAHB Housing Market Index (consensus: 83, previous: 84)\n    - Redbook (previous: -18.1%)\n    - Redbook (previous: 8.0%)\n    - Retail Control (consensus: -0.9%, previous: 6.0%)\n    - Retail Inventories Ex Auto (previous: -0.2%)\n    - Retail Sales (consensus: -0.5%, previous: 5.3%)\n    - Retail Sales (previous: 7.43%)\n    - Retail Sales Ex Gas/Autos (previous: 6.1%)\n\n## Upcoming events for Wednesday, March 17th\n\n - Expected earnings:\n\n  AOUT, AP, ARCO, AXLA, CEPU, CETX, CFRX, CMCL, CRHM, CSAN, CTAS, CTIC, DPW, ELP, EPSN, ETNB, ETTX, EYEG, FIVE, FPH, FPI, GES, GEVO, GIFI, HBB, IMTX, IMV, INFU, IPWR, JCS, KC, KRKR, KRON, LE, MDRR, MLHR, MLND, NAVB, NFH, NM, NMCI, NXE, ONTF, OSMT, OVID, OXSQ, PD, PDD, PNRG, PW, QD, RCMT, RIDE, RNET, SCYX, SGBX, SID, SINA, SMTC, SNDL, SPRB, SPRT, TEO, TH, THMO, UBX, UEC, UPST, VINP, VSTM, WHLR, WLFC, WPG, WSM, WVVI, ZTO\n\n - Ex-div:\n\n  AAN, ADT, AFT, AIF, AIMC, AJX, ALEX, ARD, BANX, BBY, BPOP, CHMG, CUBA, EBSB, FSLF, GAIN, GLAD, GOOD, HBAN, HRZN, LAND, MAV, MHI, MNDO, MPW, MYE, NUW, PFLT, PHD, PHT, PNNT, SITC, SLRC, SNV, SUNS, TSM, VRS\n\n - Economic events and announcements:\n\n    - Building Permits (consensus: 1.750M, previous: 1.886M)\n    - Building Permits (previous: 10.7%)\n    - Crude Oil Imports (previous: -0.919M)\n    - Crude Oil Inventories (consensus: 2.715M, previous: 13.798M)\n    - Cushing Crude Oil Inventories (previous: 0.526M)\n    - Distillate Fuel Production (previous: 0.806M)\n    - EIA Refinery Crude Runs  (previous: 2.407M)\n    - EIA Weekly Distillates Stocks (consensus: -3.470M, previous: -5.504M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 5.1%, previous: 13.0%)\n    - FOMC Economic Projections\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision\n    - Gasoline Inventories (consensus: -3.134M, previous: -11.869M)\n    - Gasoline Production (previous: 0.704M)\n    - Heating Oil Stockpiles (previous: 0.544M)\n    - Housing Starts (consensus: 1.560M, previous: 1.580M)\n    - Housing Starts (previous: -6.0%)\n    - IEA Monthly Report\n    - Interest Rate Projection - 1st Yr (previous: 0.10)\n    - Interest Rate Projection - 2nd Yr (previous: 0.1)\n    - Interest Rate Projection - Current (previous: 0.1)\n    - Interest Rate Projection - Longer (previous: 2.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.26%)\n    - MBA Mortgage Applications (previous: -1.3%)\n    - MBA Purchase Index (previous: 289.0)\n    - Mortgage Market Index (previous: 783.8)\n    - Mortgage Refinance Index (previous: 3,658.8)\n\n## Upcoming events for Thursday, March 18th\n\n - Stock splits:\n\n    - ELPVY @ **10:1** (Payable date: 03/17/2021)\n    - ELP @ **10:1** (Payable date: 03/17/2021)\n\n - Expected earnings:\n\n  ACN, ACTG, ADCT, ADMA, AFIB, AIV, AKUS, ALPN, ALTG, ALXO, AMTI, ARMP, ASLN, ATHA, AVIR, BCOW, BLCM, BSGM, BSQR, CATO, CBMB, CBPO, CDAK, CELP, CIB, CMC, CRT, CRVS, CSIQ, CTK, CVV, CWBR, CZNC, DG, DLTH, DTIL, EFOI, ENTX, ESGC, EYES, FBRX, FDX, FMTX, FRSX, FURY, GECC, GHSI, GIII, GLMD, GOL, HEXO, HHR, HIMS, HOOK, HWCC, INZY, ITOS, JG, JOBS, KINS, LAIX, LAZR, LAZY, LEGN, LEU, LX, MAXN, MBRX, MMX, MOSY, MP, MRUS, MTCR, MTEM, MYSZ, NEN, NKE, NKSH, NKTX, NLTX, NNA, NSYS, NVGS, NVIV, OCDX, OCGN, OLLI, ORIC, PAX, PBLA, PCVX, PDSB, PESI, PFSW, PHAT, PLX, PROG, RDHL, REED, RFL, RLH, RMTI, SCHL, SCPE, SHIP, SIG, SLDB, SLRX, SMTS, SMTX, SPPI, SQFT, SQZ, STG, SVRA, SYBX, SYPR, TATT, TITN, TMBR, TOMZ, UG, UONE, UONEK, URGN, USAU, UTZ, VBLT, VIRI, VIVE, VNRX, VTRS, WB, WOOF, WRN, XTLB, YI\n\n - Ex-div:\n\n  AAP, AIN, AINV, AL, ALRS, BBSI, BIG, CB, CRH, CTS, DEX, DKS, FISI, FSS, GEF, GEF.B, HPP, IGR, MGU, MLI, MNRL, PLD, PLOW, QCRH, QTS, RBCAA, RPT, SBSW, SPR, THQ, THW, TPB, VCIF, VGR, WEYS, WMT\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.987%)\n    - 4-Week Bill Auction (previous: 0.030%)\n    - 8-Week Bill Auction (previous: 0.035%)\n    - Continuing Jobless Claims (consensus: 4,070K, previous: 4,144K)\n    - Initial Jobless Claims (consensus: 700K, previous: 712K)\n    - Jobless Claims 4-Week Avg. (previous: 759.00K)\n    - Natural Gas Storage (consensus: -73B, previous: -52B)\n    - Philadelphia Fed Manufacturing Index (consensus: 23.0, previous: 23.1)\n    - Philly Fed Business Conditions (previous: 39.5)\n    - Philly Fed CAPEX Index (previous: 25.20)\n    - Philly Fed Employment (previous: 25.3)\n    - Philly Fed New Orders (previous: 23.4)\n    - Philly Fed Prices Paid (previous: 54.40)\n    - US Leading Index (consensus: 0.3%, previous: 0.5%)\n\n## Upcoming events for Friday, March 19th\n\n - Expected earnings:\n\n  ADIL, AIM, ANAT, ATLC, ATLO, AYRO, BH.A, BHAT, BRID, CCNC, CEI, CHEK, CMPI, COMS, CVR, ENSV, ERJ, EXN, FENC, FGBI, FHTX, FSEA, FSTX, GGAL, HMG, HUSA, ITCB, LMNL, MIST, NBAC, NWLI, OLB, PCSA, PNBK, PRPO, PXS, RBCN, SJ, SPLP, STTK, TEDU, TGS, UONE, UONEK, VSTA, WTT\n\n - Ex-div:\n\n  ARDC, AVGO, CSGS, CTO, DX, FGBI, GBLI, HRC, JCI, JJSF, LAMR, NCMI, NEWT, PCF, PINE, PM, TIPT, WRE\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 4.1K)\n    - CFTC Copper speculative net positions (previous: 51.4K)\n    - CFTC Corn speculative net positions (previous: 503.4K)\n    - CFTC Crude Oil speculative net positions (previous: 537.4K)\n    - CFTC Gold speculative net positions (previous: 175.2K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -12.5K)\n    - CFTC Natural Gas speculative net positions (previous: -0.0K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 17.8K)\n    - CFTC Silver speculative net positions (previous: 36.1K)\n    - CFTC Soybeans speculative net positions (previous: 224.7K)\n    - CFTC Wheat speculative net positions (previous: 26.1K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 310)\n    - U.S. Baker Hughes Total Rig Count (previous: 403)\n\n^^^^2021-03-16",
        "created_utc": 1615888816,
        "id": "gr3uymn",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1615917616.0
    },
    {
        "author": "TheFuckNameYouWant",
        "body": "ACN",
        "created_utc": 1617024468,
        "id": "gsooaud",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617053268.0
    },
    {
        "author": "Afrofreak1",
        "body": "Alright smoothbrain, here's some math so you realize how ridiculous what you're suggesting is. Try and keep up.\n\nIf SPY drops 20%, then a 40% overlap between the two means QQQ drops (0.4 * 0.2) = 8%.\nIn order to make up the remaining 33.4% - 8% = 25.4% drop, the remaining 60% of QQQ must drop by (0.254/0.6) = 42.3%. \n\nTo suggest that the remaining stocks will drop at a rate more than *double* that of the other stocks in both SPY and QQQ is ridiculous from the get go, but it's even more absurd when you consider the following:\n\n1. Although QQQ is tech-heavy, it is not *only* tech, there is a sizeable chunk of consumer cyclical and healthcare stocks, some of which are not in the S&amp;P500 and provide QQQ with sector-diversification. A crash in tech alone would not be enough to reach the -33.4% mark.\n\n2. There are *many* tech companies that are part of the S&amp;P500 but not listed on the NASDAQ: Salesforce ($CRM), Visa ($V), Mastercard ($MA), Accenture ($ACN), IBM ($IBM), etc. The situation that you are describing would affect these companies just as much as those listed on the NASDAQ. \n\nIn what conceivable scenario do **all** QQQ stocks drop, *across* sectors, but somehow the SPY stocks in those same industries remain relatively untouched such that the QQQ stocks not part of the S&amp;P500 drop more than **double** that of their counterparts? Please enlighten me.  \n\nIf you're getting so hung up on the circuit breakers, just go with $UPRO, but either way the scenario you concocted in your head is just not realistic by any means. The 20% circuit breaker will go before we hit -33.4% on QQQ.",
        "created_utc": 1615437012,
        "id": "gqj7pot",
        "score": 1,
        "subreddit": "investing",
        "created": 1615465812.0
    },
    {
        "author": "predated0",
        "body": "I have seen Phillips, Trotec and Plasmamade being mentioned in active testing. Besides that, Microsoft and Ansys are closely following the project.   \n\n\nSource: (you probably need to translate it through Google, but you can simply ctrl+f the above names)\n\n[https://www.ed.nl/eindhoven/tu-e-onderzoek-biedt-sportscholen-hoop-apparaten-verwijderen-aerosolen-uit-lucht\\~a0ea76e3/](https://www.ed.nl/eindhoven/tu-e-onderzoek-biedt-sportscholen-hoop-apparaten-verwijderen-aerosolen-uit-lucht~a0ea76e3/)  \n\n\nAs for sales, it's not for sale yet. People have been researching and developing this technology recently. The biggest issue is that purifiers are extremely costly and can cause more harm than good if they arent installed properly. They want to spend a lot of money on marketing to properly educate people how and where to install it, so I doubt its going to cost 45k$, probably more towards 50-60k$, but that is still a massive difference.\n\nAs for how it will end up performing on the stock market, I doubt the stock will keep rising, but I am fairly certain that it will at the very least spike once it is proven to have any positive results on covid, let alone that a lot of aging purifiers can be replaced with higher end hardware for the same cost.  \n\n\nAs for which ticker belongs to the company providing the new technology, I have no clue exactly, but according to other comments, there is vyst(for cheap play), LLC, trox, carr, jci(carr and jci might already be too late to invest), xiaomi, haier and midea(last three for china market). Not to forget the prototype companies Phillips, Trotec and Plasmamade ofcourse.",
        "created_utc": 1615174311,
        "id": "gq699lr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615203111.0
    },
    {
        "author": "OliveSorry",
        "body": "I like ansys at its current levels- i am an engineer and have experience with their products. However i am waiting for it to stop falling before i buy",
        "created_utc": 1614796583,
        "id": "gpk9gji",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614825383.0
    },
    {
        "author": "Lil_Pump_Jetski",
        "body": "ppl gonna take profits but either way should br fine",
        "created_utc": 1614739958,
        "id": "gphpq61",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614768758.0
    },
    {
        "author": "Althonse",
        "body": "I bought an ITM RKT 3/5 33c at $41 for $10. Was this stupid? Should I have waited for the new calls to be released? Seems I'd br risking the entire premium in both cases, but the upside would be much better for the OTM. I thought this would be safer but idk. Might sell it tomorrow morning for an OTM.",
        "created_utc": 1614750598,
        "id": "gpi7w2z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614779398.0
    },
    {
        "author": "BrokeDayTrader",
        "body": "Damn Im really wasting 6 hours of my life everyday watching a chart go red and green.... who’s ready to do it again tomorrow?",
        "created_utc": 1614718858,
        "id": "gpgiqjl",
        "score": 297,
        "subreddit": "wallstreetbets",
        "created": 1614747658.0
    },
    {
        "author": "jaxpied",
        "body": "I've posted this this morning already, but once again the math checks out so i'll repeat myself: \n\n \n\nHistory repeats itself (GME)\n\nThe last \"squeeze\" runup looks just like this time\n\n1/11/21 / 19.94 || 2/22/21 / 46.00\n\n1/12/21 / 19.95 || 2/23/21 / 44.97\n\n1/13/21 / 31.40 || 2/24/21 / 91.71\n\n1/14/21 / 39.91 || 2/25/21 / 108.73\n\n1/15/21 / 35.50 || 2/26/21 / 101.74\n\n1/19/21 / 39.36 || 3/1/21 / 120.41\n\n1/20/21 / 39.12 || 3/2/21 / 118.00 (&lt;-Update)\n\n1/21/21 / 43.03 || 3/3/21\n\n1/22/21 / 65.01 || 3/4/21\n\nSqueeze 💎 🚀💎 🚀 💎 🚀💎 🚀\n\nprice moves just like it did last time. We're gonna moon bois! So proud of y'all!",
        "created_utc": 1614719038,
        "id": "gpgj5no",
        "score": 109,
        "subreddit": "wallstreetbets",
        "created": 1614747838.0
    },
    {
        "author": "bacha03",
        "body": "Bought RKT at $40 because I’m an idiot cant wait to sell it when it dips tomorrow",
        "created_utc": 1614719099,
        "id": "gpgjapm",
        "score": 101,
        "subreddit": "wallstreetbets",
        "created": 1614747899.0
    },
    {
        "author": "KirokeHarper",
        "body": "TO EVERYONE WHO POSTED DD ON THIS PLAY--\n\nTHANK YOU.\n\nHonestly. I'm not at a point right now where I know how to do my own DD. And reading is still really hard for my smooth brain. But I saw the DD on this yesterday, I read it all, and I realized  I was a little late to the game but I played today anyway.\n\nIt's not much but I turned a $600 investment into $1200 today. I now own 14.77 shares of RKT at avg 39.61 AND ALL OF IT IS HOUSE MONEY. This feels like a big win for me, so I just wanted to give my thanks for the DD on this play.",
        "created_utc": 1614718977,
        "id": "gpgj0o4",
        "score": 89,
        "subreddit": "wallstreetbets",
        "created": 1614747777.0
    },
    {
        "author": "dadamoi",
        "body": "GUYS!!!!!!!!!!!!!!!!!!!!!!!! DO NOT CHANGE TO RKT MOST OF US HERE HAVE NEVER HEARD OF IT UNTIL THE MODZ HAVE DECIDED TO PIN THEIR MEGATHREAD I MEAN LOOK THEY HAVE 98 UPVOTES FOR 9MILLION MEMBERS HERE!!! DO NOT BE DUMB! HF's ARE TRYING TO DIVIDE OUR ATTENTION. IF YOU HAVE READ THE ART OF WAR ( YOU PROBABLY HAVENT YOU APES ) THE BEST WAY TO CONQUER A NATION IS TO INTERNALLY DIVIDE IT'S FORCE!!!\n\nWE ARE SO CLOSE TO THE MOTHER OF SQUEEZES DO NOT FALL FOR THEIR TACTICS\n\nDO NOT LISTEN TO ME IM UNRILIABLE",
        "created_utc": 1614719325,
        "id": "gpgjtkx",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1614748125.0
    },
    {
        "author": "GTKFANL",
        "body": "RKT is a different situation than GME. It's not the ultra-mega-gamma-squeeze-to-end-all-squeezes. It is a good stock priced below its value and has experienced some catalyst events pushing it higher with a higher-than-usual percentage of float shorted. I wouldn't be surprised if it runs to $35 - $40 a share by Friday, but I wouldn't hold it any higher than that. Yes, there is always a chance it can explode one day and good for you if you catch it, but don't buy at $60. That's all!",
        "created_utc": 1614705848,
        "id": "gpfod6e",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1614734648.0
    },
    {
        "author": "fleischbag",
        "body": "It's easy to upvote when it isn't your money. +1",
        "created_utc": 1614703009,
        "id": "gpfhusf",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1614731809.0
    },
    {
        "author": "Imsuperracist",
        "body": "Gme is currently 87% of my portfolio... if my smooth brain is correct I think I should make it 100% right?",
        "created_utc": 1614714594,
        "id": "gpg8p3t",
        "score": 71,
        "subreddit": "wallstreetbets",
        "created": 1614743394.0
    },
    {
        "author": "sshro13",
        "body": "Anyone bitching about this play not being GME: one of the most important rules of trading is to not fall in love with a stock. We are all here to make money. Take a second to look at the facts about why RKT is a good play. It is a much more surefire way to tendie town than GME currently is. Option prices were dirt cheap yesterday, and still pretty cheap compared to GME. This is about making money, period. Be smart.",
        "created_utc": 1614705043,
        "id": "gpfmiv0",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1614733843.0
    },
    {
        "author": "Punch_Your_Facehole",
        "body": "If GME doesn’t like $130 then let’s just skip it and go to $140",
        "created_utc": 1614708039,
        "id": "gpfteqw",
        "score": 62,
        "subreddit": "wallstreetbets",
        "created": 1614736839.0
    },
    {
        "author": "MyPostIs",
        "body": "Guys - last week at this time, GME was trading at $43. We're trading at 300% over last week. We're crushing it, stay calm!",
        "created_utc": 1614709948,
        "id": "gpfxt5o",
        "score": 61,
        "subreddit": "wallstreetbets",
        "created": 1614738748.0
    },
    {
        "author": "Lecture_Several",
        "body": "WTF THIS IS THE BIGGEST APE MOVE IVE SEEN\n(LOVE IT)",
        "created_utc": 1614702949,
        "id": "gpfhptn",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1614731749.0
    },
    {
        "author": "Gnomish8",
        "body": "Stock falls 1% since open while still up 100% from last week...\n\n\"Ahhh, it's red, I can't take it anymore!!\"\n\nPaper handed bitches. Get off my rocket and make space for some worthy astronauts.",
        "created_utc": 1614718741,
        "id": "gpgig9v",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1614747541.0
    },
    {
        "author": "uncowisdo",
        "body": "no one ever went broke taking a profit. save it for the next company to squeeze, wsb dd is a gold-mine",
        "created_utc": 1614718351,
        "id": "gpghii5",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1614747151.0
    },
    {
        "author": "nonflexual",
        "body": "you'll be the one making money while they watch once it squeezes. just gotta be patient enough to hold till that happens:)",
        "created_utc": 1614719315,
        "id": "gpgjso5",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1614748115.0
    },
    {
        "author": "Sabiis",
        "body": "I had $110 leftover so I couldn't buy another GME. What'd I do? Bought RKT, flipped it to $138 and bought another GME!",
        "created_utc": 1614713115,
        "id": "gpg5a4g",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1614741915.0
    },
    {
        "author": "trufflebutteredsteak",
        "body": "WE WE WERE WARNED 2 DAYS AGO THAT THE SENTIMENT WOULD CHANGE AROUND HERE. RKT IS A DISTRACTION, LIQUIDATING GME NOW TO BUY RKT IS BASICALLY GIVING UP ON THE HARD WORK THAT YOU AND ALL OF OF THE APES INVOLVED HAVE PUT IN.  HOLDING COST **NOTHING** BUT NO ONE SAID IT WOULD BE EASY. WE HAVE APES WE PROMISED TO PICK UP AT 300+, I'M KEEPING MY END.",
        "created_utc": 1614717174,
        "id": "gpgeq2l",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1614745974.0
    },
    {
        "author": "Rick-afk",
        "body": "Gotta mention the flood of bot accounts just telling to buy it, Silver 2.0",
        "created_utc": 1614716446,
        "id": "gpgd02u",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1614745246.0
    },
    {
        "author": "BiteMyShinyMetalAth",
        "body": "The way i look at it, chasing profits after 200% already seems pretty greedy.  Getting that type of trading in your mindset has bad news all over it, id rather leave 1200 on the table than see a % 200 profit and think 'ahh yeah i can get this bitch to 1500%', and then lose it all, plus your investment.\n\nmaybe a more experience fella woulda known to hold these longer, but ay, im not experienced so ill take my 200%.",
        "created_utc": 1614717178,
        "id": "gpgeqe9",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1614745978.0
    },
    {
        "author": "jaxpied",
        "body": "I posted this this morning already but I just want to let you know that it looks like THIS is exactly what's happening:\n\n \n\nHistory repeats itself (GME)\n\nThe last \"squeeze\" runup looks just like this time\n\n1/11/21 / 19.94 || 2/22/21 / 46.00\n\n1/12/21 / 19.95 || 2/23/21 / 44.97\n\n1/13/21 / 31.40 || 2/24/21 / 91.71\n\n1/14/21 / 39.91 || 2/25/21 / 108.73\n\n1/15/21 / 35.50 || 2/26/21 / 101.74\n\n1/19/21 / 39.36 || 3/1/21 / 120.41\n\n1/20/21 / 39.12 || 3/2/21 &lt;-we are here\n\n1/21/21 / 43.03 || 3/3/21\n\n1/22/21 / 65.01 || 3/4/21\n\nSqueeze 💎 🚀💎 🚀 💎 🚀💎 🚀\n\nbased on this, today might be the last chance to buy low. (not financial advice)",
        "created_utc": 1614711976,
        "id": "gpg2l9p",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1614740776.0
    },
    {
        "author": "JiggazInParis",
        "body": "# I see this as a win, think about it. On a day where another stock had so much attention (some would call it a pump &amp; dump, not naming any names tho) we still managed to hold the line. Good work apes",
        "created_utc": 1614719010,
        "id": "gpgj3cc",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1614747810.0
    },
    {
        "author": "unholyg0at",
        "body": "Fuck it. Sold all my AMC and went all in on GME. Maybe AMC shouldn’t have given their execs millions in bonus after we rallied and save their asses. Fuck em",
        "created_utc": 1614708829,
        "id": "gpfv7m4",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1614737629.0
    },
    {
        "author": "anchelus",
        "body": "Robinhood. But I don't recommend it. Try schwab or fidelity instead. Or tastyworks for options",
        "created_utc": 1614718406,
        "id": "gpghndz",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1614747206.0
    },
    {
        "author": "KnockKnock200",
        "body": "I paper handed it. Need to make up for buying GME at 380 and selling at 170 like a little bitch.",
        "created_utc": 1614719149,
        "id": "gpgjeuc",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1614747949.0
    },
    {
        "author": "Datboiicarl69",
        "body": "Was RKT a distraction from GME? Maybe. But jokes on them I made 80% profit from RKT and put it right back into GME. They underestimate my retardedness",
        "created_utc": 1614713495,
        "id": "gpg65rf",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1614742295.0
    },
    {
        "author": "Battle-Santa",
        "body": "Congrats RKT gang!!\n\nI’m not in it, but MAKE THAT MONEY!!!!\n\nHappy for you fucks",
        "created_utc": 1614719498,
        "id": "gpgk8da",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1614748298.0
    },
    {
        "author": "GoAbsoluteApesh1t",
        "body": "Listen to me. I know how you feel. \n\nYou see it dip. You read some comments. Nasty comments. People are gonna bail. They are typing some shit about shares available to short is going up, shit our nutbrains barely understand, but it sounds clever, they seem to know what they're talking about. \n\nBut you forget one thing. One fundamental thing.\n\nDFV is still in. 98% people in here are holding, we just don't care about writing it all the time. We are with you, son. DFV is with you. Don't listen to the negatives, remember the fundamentals.",
        "created_utc": 1614711512,
        "id": "gpg1huz",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1614740312.0
    },
    {
        "author": "kytran40",
        "body": "Upside down gives you the same chart. Turn it 90 degrees",
        "created_utc": 1614705247,
        "id": "gpfmzl8",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1614734047.0
    },
    {
        "author": "poopybumbum1",
        "body": "if gme closes above 500 by end of week, I will donate 2000 dollars to St. Jude's. If it closes above 800, I will give 5000 dollars to St. Jude's. I will post proof as well.",
        "created_utc": 1614702901,
        "id": "gpfhm1k",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1614731701.0
    },
    {
        "author": "cwalzzzer",
        "body": "Do you guys not realize that moving from GME to RKT is exactly what the hedgies want?!? Divide and conquer. Don’t fall for it. Stick with GME and we will go to the moon!!",
        "created_utc": 1614716098,
        "id": "gpgc75h",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1614744898.0
    },
    {
        "author": "Space_Captainface",
        "body": "funny as AMC shot up 80% and nothing on the news...RKT goes up 40% and the system shits itself. the new WSB regime is pushing RKT and encouraging sells of AMC to buy RKT, while AMC has less than 4% volume left to buy. i wouldnt trust it either. profit if you can but this isnt the gamma people think it is.",
        "created_utc": 1614716484,
        "id": "gpgd3az",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1614745284.0
    },
    {
        "author": "hibbjibbity",
        "body": "It’s seems like half the people are cool as cucumber and expecting to moon around the 19th, the other half wanna cut their eyes out every second it doesn’t go up a thousand dollars lol",
        "created_utc": 1614715582,
        "id": "gpgb081",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1614744382.0
    },
    {
        "author": "Mackie5Million",
        "body": "Preface: this is not financial advice.\n\nThe past hour or so has been dominated by aggressive shorting of the stock.  [Borrowdesk](https://iborrowdesk.com/report/RKT) is tracking the available short shares, which are quickly diminishing.  Once there are none left, short sellers won't be able to force the market down anymore.\n\nDiamond hands, people.  This has happened before - it can happen again.",
        "created_utc": 1614714518,
        "id": "gpg8ipe",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1614743318.0
    },
    {
        "author": "brybull1970",
        "body": "Made $4k on RKT today and am dumping it into GME at the dip!",
        "created_utc": 1614718140,
        "id": "gpgh082",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1614746940.0
    },
    {
        "author": "CheeseYogi",
        "body": "It was only a small second mortgage of $30k (10% of my home value). Once GME gets back to 350, I’m good.",
        "created_utc": 1614716517,
        "id": "gpgd60c",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1614745317.0
    },
    {
        "author": "trippy_fingernails",
        "body": "I hold GME and RKT, why are so many apes acting like it has to be one or the other lmao y'all are so stupid",
        "created_utc": 1614704111,
        "id": "gpfkdvr",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1614732911.0
    },
    {
        "author": "heyzeuzz",
        "body": "Maybe. It's not quite ready yet. I'm still tuning the algorithm. It gets some things wrong, but I've seen an increase in better alerts lately as I improve it. With this and a few other alerts the last 3 weeks I've made close to $200k in profit. Would people be interested in using my bot?",
        "created_utc": 1614718138,
        "id": "gpgh03e",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1614746938.0
    },
    {
        "author": "_Atom_5",
        "body": "Should I say fuck it and make my portfolio 100% Gamestonk??",
        "created_utc": 1614705973,
        "id": "gpfonnx",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1614734773.0
    },
    {
        "author": "perfecto_falcon",
        "body": "well fuck it seriously considering selling off the weed stocks and emptying the moneymarket acct to buy more GME. i guess i just REALLY LIKE THE STOCK.",
        "created_utc": 1614709864,
        "id": "gpfxm9n",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1614738664.0
    },
    {
        "author": "Skywalk88",
        "body": "He saves bro! My cousin did it. My cousin had 4 houses by the time he was 3.",
        "created_utc": 1614713900,
        "id": "gpg73bv",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1614742700.0
    },
    {
        "author": "One_Wafer_45",
        "body": "I did it guys sold for 10% loss on AMC FOR POTENTIAL 1000% GAIN IN GME! 🚀🚀",
        "created_utc": 1614705827,
        "id": "gpfobfi",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1614734627.0
    },
    {
        "author": "YellowCity",
        "body": "Just a quick bitching vent for some of you guys - \n\nIBORROWDESK JUST ADDED MORE SHARES TO SHORT AND THE NUMBER HAS NO RELEVANCE. **IT DOES THIS EVERY FUCKING DAY YET YOU GUYS CONTINUE TO USE IT AS A CATALYST OF ANYTHING!!!** 100,000 SHARES, 1 MIL SHARES, 50 SHARES, IT DOESN'T MATTER AT ALL\n\nJUST STOP! Ignore any and all iborrow data as being beneficial, or any type of catalyst for us.",
        "created_utc": 1614709820,
        "id": "gpfxikh",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1614738620.0
    },
    {
        "author": "sadboyz00",
        "body": "Stop the BS comments about ‘200 EOD’ 😂\n\nThis is making people sell when it dips\n\nTRUST THE DD AND ENJOY THE RIDE",
        "created_utc": 1614713158,
        "id": "gpg5dpb",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1614741958.0
    },
    {
        "author": "ak47ps16",
        "body": "YOUR RKT GAINS ARE AWESOME BUT REALIZE IT WAS ONLY PUMPED BY HEDGIES TO DISTRACT FROM GME. IF YOU TAKE YOUR GAINS FROM RKT AND HEAD TO GME YOU BECOME THEIR WORST NIGHTMARE. 80% OF THE REDDITORS ON THE RKT THREAD ARE BOTS TELLING YOU TO HOLD UNTIL NEXT WEEK SO NO MORE SHARES OF GME ARE BOUGHT. THINK WITH YOUR SOFT 🧠 AND RISE UP AMONGST THE REST OF THE PLANET OF THE APES\n\n🦍🦍🦍💎💎💎🚀🚀🚀💎💎💎🦍🦍🦍",
        "created_utc": 1614714290,
        "id": "gpg7zuh",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1614743090.0
    },
    {
        "author": "Chickenfrend",
        "body": "Yes lmao. Especially in the context of the other 20k you somehow accumulated. You are a rich kid. It's okay, you should just acknowledge it and be honest about it though",
        "created_utc": 1614711366,
        "id": "gpg15hg",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1614740166.0
    },
    {
        "author": "jessicavotingacc",
        "body": "Not bashing RKT, but does anyone find it weird that they have a pinned mega thread and our mega thread was late today?\n\nAlso our thread isn’t pinned now and the mod pins his post linking the RKT mega thread in OUR mega thread???",
        "created_utc": 1614705057,
        "id": "gpfmjz2",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1614733857.0
    },
    {
        "author": "Xadma24",
        "body": "Buy RKT if you think it'll go higher. But selling GME at a loss to buy RKT, while it's already shot up, is a bad thing to do. You're buying high, selling low.\n\nIf you believe in the GME squeeze, keep holding. Otherwise, you'll have FOMO regrets once it shoots up to 500+.",
        "created_utc": 1614714186,
        "id": "gpg7r86",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1614742986.0
    },
    {
        "author": "New_Assignment_5486",
        "body": "To state the obvious RKT is a distraction. Only boomers would choose a “rocket ship” ticker and drive the price up to try to confuse retarded apes with something shiny. If I was to guess the powers that be are somehow using it to profit to use those funds to further short our stonk. At the very least they are trying to pull us off our beloved GME trip to VALHALLA.  Fuck them. Together ape strong. HODL. 🦍🦍🦍🚀🚀🚀💎💎💎",
        "created_utc": 1614713939,
        "id": "gpg76mw",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1614742739.0
    },
    {
        "author": "P_RYDA",
        "body": "Omg it dipped. The squeeze is over omg omg\n\nLol yall need to stfu and hold",
        "created_utc": 1614718085,
        "id": "gpggvg8",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1614746885.0
    },
    {
        "author": "Greatjones213",
        "body": "Yeah, literally ate up 2 weeks of my life. Had to constantly check fidelity and the news. Not worth it for me.",
        "created_utc": 1614716593,
        "id": "gpgdce4",
        "score": 33,
        "subreddit": "stocks",
        "created": 1614745393.0
    },
    {
        "author": "CalebH428",
        "body": "I don’t get why people get mad about RKT. Not only does it have legit reasons to buy in, but it has been mentioned around WSB since IPO. This is just the first time it’s had any movement in awhile",
        "created_utc": 1614704966,
        "id": "gpfmcht",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1614733766.0
    },
    {
        "author": "GR8NBED11",
        "body": "I just need it to be known that I literally wiped out every stock I have to buy GME the last few weeks. It's been a hell of a ride but I'm officially all in. Keep it up APES and believe in the process. Buy stocks/shares not options right now. They need them...all of them. This is the way. HODL\n\nNot financial advice just a green crayon eating AuTiSt",
        "created_utc": 1614709386,
        "id": "gpfwi4m",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1614738186.0
    },
    {
        "author": "Evening-General",
        "body": "$120 floor is triple what it was like...a week and a half ago. Pretty sweet.",
        "created_utc": 1614715589,
        "id": "gpgb0rd",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1614744389.0
    },
    {
        "author": "jaxpied",
        "body": "Guys stop saying R.,K,.-.,T. Our boomer Mods think they deserve a thread because it got mentioned so much yesterday. Even though interest in GME is obv way higher (see upvotes and outcry after we almost didn't get a thread). The gay bear stock is just a distraction to try and get us off GME so they can save their powdered asses. Just look at that thread. It's all shills it's ridiculous. GME Apes stronk!",
        "created_utc": 1614715955,
        "id": "gpgbv81",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1614744755.0
    },
    {
        "author": "Columbian-Roaster",
        "body": "Wtf I just got notified by Trading 212 that RKT got 50% up and that CNBC says that it may be a ‘Reddit short target’ 😂\n\nThis shit is fucking orchestrated. What broker announces you about that..",
        "created_utc": 1614714416,
        "id": "gpg8a9z",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1614743216.0
    },
    {
        "author": "Puzzleheaded-Team677",
        "body": "This whole GME saga the last few months makes me feel like I’m some kind of market genius, but I’m actually just fucking retarded, and I love it",
        "created_utc": 1614708968,
        "id": "gpfvj9k",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1614737768.0
    },
    {
        "author": "SontagWrong",
        "body": "So they made a RKT megathread...\n\nPINNED IT...\n\nwhile this thread is still sorted by \"best.\" \n\n# THEY ARE TRYING TO KEEP US DOWN. DO NOT LET EM",
        "created_utc": 1614705711,
        "id": "gpfo1xs",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1614734511.0
    },
    {
        "author": "Hokguailo",
        "body": "I took the biggest lost of my life in October in SPAQ. Now it has tripled in price. I learned my lesson. Never sell your SPACS during a market correction like this, it will rebound, but will take some patience.",
        "created_utc": 1614715444,
        "id": "gpgaonr",
        "score": 31,
        "subreddit": "SPACs",
        "created": 1614744244.0
    },
    {
        "author": "findspeopleforfun",
        "body": "Why did GME's price **quadruple in the span of a day** last week AFTER the biggest players in the game attempted for weeks to snuff it out? To not only resist dropping back to early January numbers after being illegally manipulated by the most powerful investors in the world, but rather **QUADRUPLE** in the face of this adversity is the most blatant sign that it's still a great investment to literally anyone who's not an absolute dog brained retard. Even a child with Downs syndrome could look at the absurdly lopsided ask prices for GME calls vs puts, which as of right now show that **$500 calls are worth the same amount as $66 puts,** and see with absolute clarity how bullish the market is for this stock. Even boomer analysts and extremely popular trading platforms are bullish on GME. Anyone still shilling silver and weed, get Melvin's dick out of your mouth and get in on this historically massive bull run you apes.",
        "created_utc": 1614703416,
        "id": "gpfis92",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1614732216.0
    },
    {
        "author": "thedizzycat",
        "body": "I'm not personally invested in this, but it has been absolutely compelling reading over the past few weeks. You people are absolute heroes with what you are doing. and If I had money to lose I would be right beside you. Enjoy the ride and I hope your dreams come true.",
        "created_utc": 1614704752,
        "id": "gpflv1x",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614733552.0
    },
    {
        "author": "gargully",
        "body": "OP did you work full time while in high school? 20k a year works out to about $9.50 an hour working 40 hours a week full time. And that’s literally not spending a fucking dime. That’s some true fucking diamond hands on cash and then betting it all on black? Savage",
        "created_utc": 1614713837,
        "id": "gpg6y74",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614742637.0
    },
    {
        "author": "fortifier22",
        "body": "If DFV and Cohen can hold at $480, we can hold as well.\n\nIf you bought GME at any price, you believed in the stock and in the company.\n\nDon’t let your belief waiver! You ride until it is done!",
        "created_utc": 1614716910,
        "id": "gpge3cp",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614745710.0
    },
    {
        "author": "sadboyz00",
        "body": "PEOPLE stop making up false bs about ‘this is going to blow EOD’ or ‘squeeze end of week’\n\nThis discourages newbies who invest and do not get these results.\n\nTRUST THE DD AND LETS KEEP IT POSITIVE",
        "created_utc": 1614707082,
        "id": "gpfr6ys",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614735882.0
    },
    {
        "author": "Nerdicane",
        "body": "Line it up! Let’s go!",
        "created_utc": 1614718900,
        "id": "gpgiubk",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614747700.0
    },
    {
        "author": "baconara",
        "body": "Found people wondering why RKT had 3x the volume of GME but it wasn't \"squeezing right\".\n\nFor RKT folks browsing this megathread: it won't squeeze the same because RKT is an artificial squeeze - engineered by the CEO. It's not an organic squeeze. GME was years in building. \n\nRKT looks like a fish, swims like a fish, but when you go to eat it you realize it's a robot fish. Same amount of fun fishing, though.",
        "created_utc": 1614718782,
        "id": "gpgiju3",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614747582.0
    },
    {
        "author": "Saxamaphooone",
        "body": "I want to thank everyone in these threads for helping me get through my days. I only have 7 shares @169, but I’m hoping any profits help pay some medical bills. \n\nI found out a month ago why I’ve been so sick over the past year: I have a tumor in my brain growing on my pituitary gland. The type of tumor it is means it’s likely non-cancerous (thankfully), but it secretes hormones which causes hormone imbalances, migraines, and weird vision issues. I spend weeks at a time trapped in my bed, unable to move or eat solid food without throwing up. Reading this sub and these threads makes those days a little easier!",
        "created_utc": 1614708321,
        "id": "gpfu1vq",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614737121.0
    },
    {
        "author": "Slothe1978",
        "body": "Aw, but the bills to pay it back are",
        "created_utc": 1614703897,
        "id": "gpfjw4h",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614732697.0
    },
    {
        "author": "SpeaksInHexadecimals",
        "body": "Remember, the second CNBC mentions this, you sell. Then buy back when they stop mentioning it. That is the way.",
        "created_utc": 1614703955,
        "id": "gpfk0w0",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614732755.0
    },
    {
        "author": "0wl-Exterminator",
        "body": "At this point its almost like theyve given up on pushing it way down and are just hoping they keep it exactly where it was lmao",
        "created_utc": 1614717307,
        "id": "gpgf1eb",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614746107.0
    },
    {
        "author": "jessicavotingacc",
        "body": "Not bashing RKT, but does anyone find it weird that they have a pinned mega thread and our mega thread was late today?\n\nAlso our thread isn’t pinned now",
        "created_utc": 1614704932,
        "id": "gpfm9pt",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614733732.0
    },
    {
        "author": "HeavyHandedWarlord",
        "body": "LPT: If you refresh the GME daily thread every 30 seconds it helps the price go up",
        "created_utc": 1614702695,
        "id": "gpfh5ag",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614731495.0
    },
    {
        "author": "Pryml710",
        "body": "If GME hits $220 EOD I’ll literally shit myself - hold me to it retards🚀",
        "created_utc": 1614701396,
        "id": "gpfe80z",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614730196.0
    },
    {
        "author": "lampingninja",
        "body": "Don't succumb to the RKT craze, bots &amp; shills are doing everything they can to make it look appealing to distract us apes from the real show.   \n\n\nHODL &amp; BUY THE DIPS!!!",
        "created_utc": 1614712454,
        "id": "gpg3q1y",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614741254.0
    },
    {
        "author": "TRUFFL3PIG",
        "body": "DO NOT SELL WHEN $RKT EXPLODES IN THE MORNING. IT IS JUST THE BEGINNING",
        "created_utc": 1614719027,
        "id": "gpgj4q8",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614747827.0
    },
    {
        "author": "Myasshurts12001",
        "body": "If it hits $200 today I will go to taco bell, order 12 beef burritos, take 10 ex laxs, vomit 200 on the wall, post it on reddit.",
        "created_utc": 1614706172,
        "id": "gpfp447",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614734972.0
    },
    {
        "author": "Successful_Prize_904",
        "body": "If it hits 50 I’m getting a tattoo",
        "created_utc": 1614713644,
        "id": "gpg6i7d",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614742444.0
    },
    {
        "author": "XVDev",
        "body": "# Paper hands leave if you want, don’t complain when it hits $60-100 tomorrow\n\nHolding my calls overnight , don’t care if i lose it all",
        "created_utc": 1614712573,
        "id": "gpg406q",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614741373.0
    },
    {
        "author": "muggbeert",
        "body": "Rkt has its own thread surprisingly, but they’re still in here pumping it 🤔🤔 says a a lot",
        "created_utc": 1614712585,
        "id": "gpg417b",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614741385.0
    },
    {
        "author": "pastrybaker",
        "body": "Is anyone else pretty impressed that it's holding at these levels even though it's off the SSR today? \n\nAccording to [https://iborrowdesk.com/report/GME](https://iborrowdesk.com/report/GME), there was some big shorting going on this morning through Interactive Brokers. So, we could assume the same was happening with other brokers. At the same time, I know that at least TDA isn't allowing short selling of GME at all (was on the phone with them the other day, and the guy told me they haven't allowed it since the end of January).\n\nStill, the price has not only held, but risen pretty significantly today. I'm having a hard time seeing the downside to continuing to hold, I just don't think it's a wise thing to sell at this point. The gamma squeeze seems like it'll happen, the short squeeze is likely too. And even if it's not, the company is pivoting and may become a big player in the years to come. All those things are why I will keep holding.\n\nAt the same time, if you haven't covered your initial investment, please do so. I sold off enough at the end of January to pay off almost $50k of CC debt and to have a bit leftover to provide for me and my kids. Now I'm playing with house money, so it's easier for me to weather the dips.\n\nI'm holding 307 shares @ \\~$70 per share. I also have a 17 calls for different dates.",
        "created_utc": 1614701474,
        "id": "gpfeebn",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614730274.0
    },
    {
        "author": "doctordesktop",
        "body": "If it hits 150 today i'll buy the winrar full version",
        "created_utc": 1614711881,
        "id": "gpg2d9q",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614740681.0
    },
    {
        "author": "h4wk1ns",
        "body": "Congrats to anyone that took profits today. \n\nRemember, this shit is volatile as fuck and could come back down at any time. I’m playing this like it could be running all week, but who knows. Just remember to celebrate gains and own your losses.",
        "created_utc": 1614719363,
        "id": "gpgjwps",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614748163.0
    },
    {
        "author": "CallsonBobRoss2024",
        "body": "Am I perfect? No. Do I hold? You fuckin know it. Met a paper handed bitch in real life once. He was sucking dick for pocket change. Scary stuff. \n\n🖐🏼💎",
        "created_utc": 1614715616,
        "id": "gpgb33q",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614744416.0
    },
    {
        "author": "bpi89",
        "body": "Those RKT cucks think a couple hundred of them can force a squeeze, when a few million are fighting every day for a GME squeeze? They do understand that if GME doesn’t squeeze with all this effort going into it that RKT, AMC whatever the fuck else sure as shit won’t. They’re gonna get crushed. \n\nPuts on RKT.",
        "created_utc": 1614706414,
        "id": "gpfpo0y",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614735214.0
    },
    {
        "author": "Sparkin4500",
        "body": "Bought $500 to push us through $130....it didn't work",
        "created_utc": 1614708147,
        "id": "gpftnng",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614736947.0
    },
    {
        "author": "ANDRELLAREN2K",
        "body": "DO NOT SELL TO BUY BACK CHEAPER! this will prevent the squeeze by allowing more shares for the hedge funds to cover their shorted shares making it more difficult for squeeze to occur. Repost everywhere you can think of!",
        "created_utc": 1614706580,
        "id": "gpfq1kx",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614735380.0
    },
    {
        "author": "willy-fistergash08",
        "body": "Things we should keep in mind today:\n\n\n•\t⁠There is no way to predict when the squeeze will happen\n\t⁠•\t⁠There will be crazy price action in both directions\n\t⁠•\t⁠This can go on as long as the shorts remain solvent\n\t⁠•\t⁠The longer they drag this out, the higher it goes\n\t⁠•\t⁠People might say, \"Lift-Off in 10!\" But they're just excited\n\t⁠•\t⁠Nobody knows when it'll happen or how high it will go\n\nBasically, don't believe the hype, but feel free to join in. You should do your own research, read the DD, and make informed decisions. Don't invest money you can't afford to lose.\n\nIn other words, fuck safely, or you'll get fucked.\n\n•\t⁠There is no \"we.\"\n\t⁠•\t⁠I'm holding because that's my choice. I believe in GME\n\t⁠•\t⁠I will not buy because someone else says to do so\n\t⁠•\t⁠I will not encourage others to buy\n\t⁠•\t⁠Nothing I say is financial advice\n\t⁠•\t⁠If you're confused, read the rules. No market manipulation.\n\nReport posts that encourage everyone to buy at the same time. The primary reason for this is legal, but the secondary is that the media will cherry-pick comments like this to give us a bad name and put more negativity out there through their articles, broadcasts, etc.\n\n•\t⁠There will be plenty of FUD (or \"fear, uncertainty, and doubt\")\n\t⁠•\t⁠I am including this out of belief, if not pure spite\n\t⁠•\t⁠There are redditors being paid to scare you\n\t⁠•\t⁠There are bots made to SPAM negativity\n\t⁠•\t⁠There are people profiting when you sell\n\t⁠•\t⁠This starts ramping up in the afternoon\n\nThere are two sides to this fight, and we have to remember that there are people profiting if we fail. There are people playing the other side who will come into the thread and try to throw us off track by ruining the morale. We mustn't give in to them. Besides, they can't even provide any good DD for their bear-case, it's all just \"sElL iT's OvEr.\"\n\n•\t⁠This is the motherfucking GME Megathread\n\t⁠•\t⁠Do not push other tickers\n\t⁠•\t⁠Do not jingle keys in our faces\n\t⁠•\t⁠Fuck you\n\nI, personally, go out of my way to CTRL/CMD+F and search for other tickers. If you're bringing up non-GME stocks in order to distract the thread, I'm one of the downvotes on your comment. Sue me.\n\n•\t⁠We can fucking do this\n\t⁠•\t⁠We have them where we want them\n\t⁠•\t⁠We can name our price\n\t⁠•\t⁠As long as we hold, we have what they want\n\t⁠•\t⁠They will pay out the ass to get it\n\nThey'll do whatever they can (manipulate the market, short the stock further, short EFTs, etc.) for as long as they can manage, all hoping we'll give up and sell (Hell, they've even tried to bore us to death). But they don't understand just how dumb we really are. We are far too stupid to be afraid of their fearmongering, and we'll hold 'til the moon.\n\n•\t⁠If you're new, this may not be for you\n\t⁠•\t⁠This is something you have to be really brave or really stupid for\n\t⁠•\t⁠You will either see enormous gains or enormous losses\n\t⁠•\t⁠Invest wisely, don't spend your rent money, and read the DD\n\t⁠•\t⁠Read the DD\n\t⁠•\t⁠Read the DD\n\t⁠•\t⁠DD is short for Due Diligence, and it's basically just researching a stock before you buy in. There's plenty of great DD on this sub, and you can sort by the DD flair to see the highest-voted posts. Do that before asking dumb questions and risking your karma.\n\nIf you think there's anything else I should add, please reply and tell me.",
        "created_utc": 1614701394,
        "id": "gpfe7vq",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614730194.0
    },
    {
        "author": "SirioBombas",
        "body": "If you haven’t already. Read this... A few lines about GME (please read)\n\n1. Price doesn't matter until the squeeze has been squoze.\n2. The best time to buy GME was 2 months ago, the second best time is NOW.\n3. Buy shares, not options. Invest only the money you can afford to lose.\n4. Don't fall for FUD. Any account can be a shill/bot, even the ones created before January. They are PAYING users to spread fear and enroll you to post negative comments/posts.\n5. GME has been and will always be the only play. Anything else is a distraction to limit the impact GME can have. (Yes, even RKT). Never will the planets align this perfectly again to trigger the biggest short squeeze of your lifetime.\n6. The most important point : Don't sell. Supply and demand : you have something they want, we all do. So YOU set the price you want. And the price can actually go up to infinity. This is going to be the biggest transfer of wealth the world has ever seen, don't ruin it being a paper hand and selling low.\n7. Hold. Hold. Hold. Selling at 1k is trolling. They want you to sell at 1k, that's why they keep spamming comments saying they put stop limits at 1k. 1k is lowball. 1k could just be a gamma squeeze. 10k is lowball.\n8. As stated by u/Polihanna, the squeeze will last multiple days. Don't be afraid that it lasts a few seconds and you'll miss it. You won't. \n9. Don't day-trade GME. It's extremely volatile, and you actually help them by selling shares that they can buy for cheap. You delay the squeeze and reduce its impact if you day-trade.\n10. THIS IS NOT A GAME OF GREED. IT IS A GAME OF TRUST.",
        "created_utc": 1614710700,
        "id": "gpfzks5",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614739500.0
    },
    {
        "author": "New_Assignment_5486",
        "body": "RKT is a distraction. Only boomers would choose a “rocket ship” ticker and drive the price up to try to confuse retarded apes with something shiny. If I was to guess the powers that be are somehow using it to profit to use those funds to further short our stonk. At the very least they are trying to pull us off our beloved GME trip to VALHALLA.  Fuck them. Together ape strong. HODL. 🦍🦍🦍🚀🚀🚀💎💎💎",
        "created_utc": 1614713753,
        "id": "gpg6r8c",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614742553.0
    },
    {
        "author": "Burnt_Couch",
        "body": "We're about to enter power hour here comrades. \n\nIt's important to keep in mind that seeing a dip would not be unexpected. It could dip below $110, or even $100. This is nothing to worry about.\n\nIf you believe in the fundamentals of this stock you'll know what to do. Take advantage of sales when you see them if you feel so inclined. But if you believe in the fundamentals, and that this stock will see &gt;$150, &gt;$200, &gt;$500, etc...a small dip now should not worry you. \n\nHOLD STRONG LADS.",
        "created_utc": 1614714318,
        "id": "gpg823n",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614743118.0
    },
    {
        "author": "Emphermal",
        "body": "British army green beret commandos checking in, followed from 480 all the way back down to 40 and lost money but gained some amount of laughs, also, it is me and my friend who is in on this with me, $200+ EOD and a few upvotes and we will both get a diamond palm tattoo and a rocket on there too, long live the apes.",
        "created_utc": 1614702748,
        "id": "gpfh9jp",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614731548.0
    },
    {
        "author": "GR8Cobb",
        "body": "You guys are a bunch of retards... Investing into a single stock that has no real upside and is hanging its hope on one man and a vision. Dumping countless dollars into stocks and options that are going to bring you nothing but heartburn and headaches... And you know what? I dig it. I like the direction of the company. I like the upside. I'm a fucking gamer. And I'd love nothing more than to see these rich fucks squirming like they are in thay scene from Dark Knight Rises... \"Exile or death?\" Fuck it... I'm in. Keeping what I have and buying the dips again and again and again. Way to go you autistic fucking diamond handed apes. I love you all but most importantly, I love the fucking stock. Oh, and I'm not financial advisor for whatever that is worth 🤷‍♂️. 🦍💪2-Gether 💎🖐 4-Eva",
        "created_utc": 1614701848,
        "id": "gpff8so",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614730648.0
    },
    {
        "author": "AJDillonsMiddleLeg",
        "body": "Yes RKT diverts attention from GME. But calling them shills is dumb af. It's up over 60% today from a clear gamma squeeze (every option on the chain is ITM). I missed out on it, which is fine but congrats and fuck you to those that didn't miss it.",
        "created_utc": 1614711899,
        "id": "gpg2eqi",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614740699.0
    },
    {
        "author": "Columbian-Roaster",
        "body": "So 1 stock goes 70% up a day wow.. Let’s fucking make it the megathread now.\n\nGME saw way better increases not once bitches\n\nThis is the way. GME To the moon 💎🙌🚀🚀",
        "created_utc": 1614717214,
        "id": "gpgeti5",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614746014.0
    },
    {
        "author": "South_Onion",
        "body": "8K comments in the first hour of this thread. Imagine thinking it was a good idea to **not** have a dedicated GME thread. \n\n\nLets get it boys. 🚀🚀🚀🚀🚀🚀🚀",
        "created_utc": 1614703600,
        "id": "gpfj7ck",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614732400.0
    },
    {
        "author": "Korso213",
        "body": "I bought a $50c 3/19 yesterday around noon and nearly shit my pants when I checked it today to see it up 4100%",
        "created_utc": 1614717654,
        "id": "gpgfupf",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614746454.0
    },
    {
        "author": "lucy_1204",
        "body": "I want AMC to go up a bit so I can cut my losses and put it all into GME 🙌🏼🚀💎",
        "created_utc": 1614709926,
        "id": "gpfxrdy",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614738726.0
    },
    {
        "author": "apogreba",
        "body": " \"So lets pump gay rocket stock (im not going to name) Then as it's going  up, we'll synthetically drop GME at the same time with our borrowed  shares to make it appear that there's a sell-off. That should work,  right.\"\n\n\"What?! The retards just bought more?!!!! What the fuck?!\"\n\nmelvin",
        "created_utc": 1614714507,
        "id": "gpg8hu9",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614743307.0
    },
    {
        "author": "sirpe_008",
        "body": "it's funny how a lot of u are saying that u wait for the dip and when it dips u get scared. \n\nhold. 💎🙌",
        "created_utc": 1614718547,
        "id": "gpghzlr",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614747347.0
    },
    {
        "author": "samgarita",
        "body": "RKT is such a distraction. Fucking boomer way of thinking “Look fellow kids! A ROCKET stock! Catchy name, catchy ticker symbol! You guys can 🚀🚀!!”\nI’m not buying it.",
        "created_utc": 1614704875,
        "id": "gpfm55j",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1614733675.0
    },
    {
        "author": "Zen0d0x",
        "body": "**To the ones who ditched us for stock that shall not be named,** \n\nI hope you realize that is a pump, and that stock has no backing on that vastly inflated price. I hope you all regret it tomorrow morning as it fucking crashes. I hope GME opens so GODDAMN strong tomorrow you all lose your positions. \n\nFurthermore, I hope you wake up to a flat tire, with no spare. I hope you get caught in traffic. I hope when you eventually make it in to work, the coffee is out. I hope when you wake up your work PC around your colleagues it's overloaded with gay fucking porn. I hope you find out your wife has been fucking one of your family members. I hope you come home to no fucking dinner. I hope you catch Syphilis and your dick falls off. \n\nWith Love, \n\n**A true fucking Hodler.**\n\n**(Eat a dick, better yet... eat a million.)**",
        "created_utc": 1614716949,
        "id": "gpge6op",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1614745749.0
    }
]