[
    {
        "author": "WornOutBoot",
        "body": "I think having an America-centric outlook on canna is going to make folks miss out. Glad the aph/til has a strong global focus and I suspect the US market will be very chopped up between growers. All due respect to places like California and Washington, but the world knows the British Columbia reputation for quality first. Sweetwater is going introduce Americans to Broken Coast, which is the company that made me invest in Aphria in the first place. Too many financial squares with no real understanding of the industry. Consumers, both medical and rec will catch on soon and demand quality. Crazy it is dropping today but I am used to the ridicousness at this point and will be patiently sitting on my shares.",
        "created_utc": 1619809874,
        "id": "gwgjlix",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619838674.0
    },
    {
        "author": "lunkbeck",
        "body": "How about them aph earnings 😬",
        "created_utc": 1618617695,
        "id": "gusajvx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618646495.0
    },
    {
        "author": "Shotgun516",
        "body": "It’s definitely not a good company. It’s stock is massively diluted and they burn through cash like the joker. The reason the price goes up is because when cannabis stocks are hot, people can buy ACB on RH. They see the low price and the low priced calls so it’s either that, CGC, APH or tilray",
        "created_utc": 1617405049,
        "id": "gt6w5tg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617433849.0
    },
    {
        "author": "m0arducks",
        "body": "Shares?  If so look at the share conversion and decide based on price I guess, If I remember right it’s .83:1 aph/til",
        "created_utc": 1617887890,
        "id": "gtt2alr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617916690.0
    },
    {
        "author": "TeddyYolos",
        "body": "Well I’m balls deep in Tilray so if your in Aph and we rocket we’ll see each other on the moon 🌙",
        "created_utc": 1617582152,
        "id": "gteh2x4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617610952.0
    },
    {
        "author": "maximus9966",
        "body": "You're right. As of april 2021 APH isn't a solid company, but they were solid between 2018 and 2020 when their stock was getting hammered. They had a solid cash float and their revenues were increasing for a while quarter after quarter. They were making great investments and compared to the competition like Canopy and Tilray, they had the soundest business model going but for some reason theit stock wasn't seen as sexy as Canopy. \n I bought in at around $14 in mid 2018 and bag held until early 2021 when I could finally make a profit. Nearly 3 years of bag holding at a loss anywhere between 20-60% sucks, especially when I didn't know if I'd ever get it back.",
        "created_utc": 1618448798,
        "id": "gujzncw",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1618477598.0
    },
    {
        "author": "ChronicMasterBlazer",
        "body": "One APH us!",
        "created_utc": 1618836512,
        "id": "gv2qa98",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1618865312.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 27th of April\n\n\n\n## Upcoming events for Tuesday, April 27th\n\n - Stock splits:\n\n    - NSPR @ **1:15**\n\n - Expected earnings:\n\n  AAN, AAT, ABB, ABG, ACCO, ACGL, ACH, ADM, AHC, AJRD, AMD, AMGN, AMX, APAM, ARAY, ARVN, ATEN, ATNI, ATRC, AUDC, AWI, AWRE, BP, BSBR, BUSE, BXP, BYD, CAC, CALX, CASH, CB, CEQP, CHE, CHRW, CNC, COF, CROX, CRSP, CSGP, CYBE, CZWI, DTE, EBMT, ECL, EGP, EHC, EIX, ENPH, ENTG, EQR, ESBK, ESS, FBNC, FCBP, FCF, FCPT, FELE, FEYE, FFIC, FFIV, FFNW, FFWM, FIBK, FISV, FRST, FSV, FTI, GE, GLW, GOOD, GOOG, GOOGL, GPK, GRFS, HA, HAFC, HAS, HBCP, HEES, HFBL, HIW, HNP, HOPE, HRZN, HSBC, HUBB, HVT, HVT.A, IBA, IBCP, IEX, ILMN, IVZ, JBLU, JNPR, KNSA, KTCC, LBC, LBRT, LDL, LECO, LLY, MANH, MATX, MDLZ, MMC, MMM, MRC, MSCI, MSFT, MVBF, MXIM, NAVI, NCR, NOV, NVS, NXRT, ODT, OKE, OLN, OMAB, OPRA, OXSQ, PCAR, PFG, PHM, PII, PINS, PJT, PPBI, PPD, PROV, PSB, QCRH, QTS, RCKY, RNDB, RNST, ROIC, ROP, RRD, RTX, RXN, SAN, SBUX, SCL, SF, SFST, SHW, SPFI, SQNS, SSTK, ST, SYF, SYK, SYX, TENB, TER, TFII, TKC, TPB, TRMK, TRMT, TRU, TSBK, TX, TXN, UBS, UDR, UMBF, UPS, USNA, V, VALE, VBTX, VIST, WDR, WM, WNEB, WSBC, WSBF, YUMC\n\n - Ex-div:\n\n  AM, ATR, BK, CALM, ENTG, IFS, QADA, QADB, VSEC\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 1.300%)\n    - API Weekly Crude Oil Stock (previous: 0.436M)\n    - CB Consumer Confidence (consensus: 113.0, previous: 109.7)\n    - Dallas Fed Services Revenues (previous: 21.6)\n    - House Price Index (previous: 1.0%)\n    - House Price Index (previous: 12.0%)\n    - House Price Index (previous: 316.7)\n    - Redbook (previous: -17.2%)\n    - Redbook (previous: 13.5%)\n    - Richmond Manufacturing Index (previous: 17)\n    - Richmond Manufacturing Shipments (previous: 22)\n    - Richmond Services Index (previous: 16)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 11.7%, previous: 11.1%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.1%, previous: 1.2%)\n    - Texas Services Sector Outlook (previous: 28.9)\n\n## Upcoming events for Wednesday, April 28th\n\n - Expected earnings:\n\n  AAPL, ADP, AER, AFL, AGI, AKO.A, AKO.B, AKR, ALGN, ALIM, ALKS, ALRS, ALSN, ALTA, AM, AMED, APH, APLS, AR, ARCC, ASGN, ASH, ATOM, ATUS, AUY, AVB, AVT, AVTR, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BHE, BHLB, BLKB, BPOP, BRKL, BSMX, BSX, BXMT, CAKE, CAMT, CBTX, CCS, CDE, CHEF, CHX, CINF, CIT, CLR, CME, CMO, CNMD, CNO, CONE, CPF, CPSS, CREE, CSTM, CUBI, CYH, DAN, DISCA, DISCB, DISCK, DMRC, DRE, DRVN, DX, EAT, EBAY, ECHO, EQIX, ESI, ESRT, ETR, EVA, EVR, EXR, EXTR, F, FARO, FB, FCNCA, FISI, FIX, FORM, GD, GIB, GRMN, GRUB, GSK, GTY, HBNC, HELE, HES, HESM, HNI, HOLX, HT, HUM, IART, ICAD, ICLR, INOV, INVH, IPG, IR, IRT, ISBC, JAKK, JBSS, KALU, KNL, KRA, KRC, LC, LFUS, LIVN, LOGI, LXU, MAA, MAS, MC, MCO, MCRI, MDXG, MEOH, MGM, MGRC, MHH, MHO, MKL, MLCO, MLP, MN, MOH, MORN, MPX, MSA, MSC, MSVB, MTDR, MTH, MUSA, MXL, MYRG, NBR, NGVT, NLY, NOA, NOVA, NOW, NSC, NTB, NYCB, OBNK, OC, OI, OII, OIS, OPK, ORLY, ORN, OSK, OVV, PAG, PB, PDM, PEGA, PGRE, PI, PPC, PSA, PTC, QCOM, R, RBBN, RE, RES, RJF, RNR, ROK, ROL, RWT, SAIA, SC, SGC, SHOO, SHOP, SIGI, SIRI, SIX, SJW, SLAB, SLGN, SMED, SNY, SONY, SP, SPOK, SPOT, SRDX, SREV, SRI, SSB, SWK, SXC, TDOC, TDY, TECK, TEVA, TKR, TNL, TR, TROX, TTEK, TTMI, TWOU, TYL, UCTT, UFI, UMC, URI, UVE, UVSP, VET, VKTX, VNE, VRT, VRTS, VSEC, VVV, WCN, WELL, WERN, WH, WHG, WING, WNC, WRE, WWW, YNDX, YUM\n\n - Ex-div:\n\n  BPMP, BSRR, CFG, FRC, ITUB, KEN, KNOP, MAIN\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.416M)\n    - Crude Oil Inventories (consensus: 0.375M, previous: 0.594M)\n    - Cushing Crude Oil Inventories (previous: -1.318M)\n    - Distillate Fuel Production (previous: -0.088M)\n    - EIA Refinery Crude Runs  (previous: -0.286M)\n    - EIA Weekly Distillates Stocks (consensus: -0.163M, previous: -1.074M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 1.0%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision\n    - Gasoline Inventories (consensus: 0.425M, previous: 0.086M)\n    - Gasoline Production (previous: -0.229M)\n    - Goods Trade Balance (previous: -87.07B)\n    - Heating Oil Stockpiles (previous: 0.563M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 8.6%)\n    - MBA Purchase Index (previous: 295.5)\n    - Mortgage Market Index (previous: 724.8)\n    - Mortgage Refinance Index (previous: 3,219.9)\n    - Retail Inventories Ex Auto (previous: 1.2%)\n    - Wholesale Inventories (previous: 0.6%)\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARES, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLMN, BMRN, BMY, BPMC, BSIG, BSVN, BTU, BVN, BWB, BY, BZH, CARR, CASA, CAT, CBRE, CBZ, CCOI, CCXI, CFFN, CFR, CFX, CG, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COR, COWN, CPT, CQP, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CURO, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DRQ, DVA, DVD, DXCM, EBC, EBS, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, ERIE, ERII, ERJ, ETH, EVBN, EVLO, EVTC, EXLS, EXPO, FBC, FBHS, FCN, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FSP, FTAI, FTNT, FTV, FWRD, GEO, GFF, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GPI, GRA, GSHD, GWB, HAYN, HGV, HP, HSY, HTGC, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INDT, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBAI, LBPS, LEVL, LFVN, LH, LIND, LKQ, LLNW, LMAT, LPLA, LTC, LTRX, LYG, MA, MATW, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MO, MPW, MRK, MRLN, MSTR, MTLS, MTRN, MTSI, MVIS, NATI, NDLS, NEM, NIO, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, OCFC, OFC, OMCL, ONEW, ONTO, OPI, OPOF, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCG, PCSB, PEB, PFPT, PH, PMBC, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RCL, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SAND, SCX, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SNDR, SNP, SO, SPGI, SPSC, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TPX, TREE, TROW, TRS, TRTN, TRUP, TW, TWTR, TXRH, TXT, ULBI, ULH, USAK, USM, VC, VCRA, VICI, VIRC, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PLBC, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SLG, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 49B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 4.7%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n^^^^2021-04-27",
        "created_utc": 1619517616,
        "id": "gw17s1h",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619546416.0
    },
    {
        "author": "skinniks",
        "body": "Amp is clearly the sector in press release to sales ratio. Best I've seen since NUU. \n\nBut hopefully, for Aph shareholders, a different outcome than NUU.",
        "created_utc": 1617795335,
        "id": "gtodfgo",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1617824135.0
    },
    {
        "author": "bananastock",
        "body": "And the M&amp;A continues!\nWait until you see the banana breakout today!\nAPH to the 🌙\nSchumer get off your ass and put some paper down!",
        "created_utc": 1617886478,
        "id": "gtszllq",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1617915278.0
    },
    {
        "author": "Agitainer",
        "body": "I can’t believe I had to scroll this far to see a mention. \n\nI don’t really come here as often as I used to when Canada was starting to legalize but it’s still nothing but APH fandom and it is as bewildering to me now as it was then.",
        "created_utc": 1617896760,
        "id": "gttlrq5",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1617925560.0
    },
    {
        "author": "mrhairybolo",
        "body": "Happens to weedstocks too. Specially APH back in the day",
        "created_utc": 1617846653,
        "id": "gtre6q7",
        "score": 1,
        "subreddit": "shroomstocks",
        "created": 1617875453.0
    },
    {
        "author": "Zanhard",
        "body": "I bought right before legalization and it's been down 40+% ever since. It made a small resurgence bet never came back all the way up. I had APH too but it came up enough I was able to sell it basically at cost so my cash wasn't locked in with it anymore. I think its possible that eventually, years from now it may hit that price again, but who knows for real.",
        "created_utc": 1618377678,
        "id": "guggmwx",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1618406478.0
    },
    {
        "author": "SpinDocktor",
        "body": "I'm very bullish on CHPT. They're either the largest or one of the largest providers of charging stations. It's heavily shorted last I checked. (Not the 'next GME' as other articles might say). But I've seen projections for it to go up to $40 to $50. And looking at the trade volume seems to me like it's really trying hard to break the barrier around $32. \n\nTEL and APH might be a good play too.",
        "created_utc": 1617925807,
        "id": "gtvfae1",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1617954607.0
    },
    {
        "author": "el-squatcho",
        "body": "&gt; not as good for lp's as everybody thought?\n\nEverybody didn't think this news would benefit LPs much. I didn't. \n\nAnd everybody who thinks uplisting will be a guaranteed rocket ride probably weren't around when APH, ACB, etc uplisted. If my memory isn't complete shit at this point, people got all excited only for those tickers to get beat down to hell pretty quickly. \n\nI'm definitely tired of getting excited about SAFE over the past several years, but I haven't lost hope. Still transferring money regularly out of my bank account into my broker. Still buying on the dips and trying not to think about the greener days that are surely ahead.\n\nBut yeah, I'm definitely not buying LPs for US catalysts. I still hold some but I'm only buying MSOs and selling the LPs when they pop like APHA did back in Feb.",
        "created_utc": 1618929022,
        "id": "gv7eetc",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1618957822.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 28th of April\n\n\n\n## Upcoming events for Wednesday, April 28th\n\n - Expected earnings:\n\n  AAPL, ADP, AER, AFL, AGI, AKO.A, AKO.B, AKR, ALGN, ALIM, ALKS, ALRS, ALSN, ALTA, AM, AMED, APH, APLS, AR, ARCC, ASGN, ASH, ATOM, ATUS, AUY, AVB, AVT, AVTR, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BHE, BHLB, BLKB, BPOP, BRKL, BSMX, BSX, BXMT, CAKE, CAMT, CBTX, CCS, CDE, CHEF, CHX, CINF, CIT, CLR, CME, CMO, CNMD, CNO, CONE, CPF, CPSS, CREE, CSTM, CUBI, CYH, DAN, DISCA, DISCB, DISCK, DMRC, DRE, DRVN, DX, EAT, EBAY, ECHO, EQIX, ESI, ESRT, ETR, EVA, EVR, EXR, EXTR, F, FARO, FB, FCNCA, FISI, FIX, FORM, GD, GIB, GRMN, GRUB, GSK, GTY, HBNC, HELE, HES, HESM, HNI, HOLX, HT, HUM, IART, ICAD, ICLR, INOV, INVH, IPG, IR, IRT, ISBC, JAKK, JBSS, JOE, KALU, KNL, KRA, KRC, LC, LFUS, LIVN, LOGI, LXU, MAA, MAS, MC, MCO, MCRI, MDXG, MEOH, MGM, MGRC, MHH, MHO, MKL, MLCO, MLP, MN, MOH, MORN, MPX, MSA, MSC, MTDR, MTH, MUSA, MXL, MYRG, NBR, NGVT, NLY, NOA, NOVA, NOW, NSC, NTB, OBNK, OC, OI, OII, OIS, OPK, ORLY, ORN, OSK, OVV, PAG, PB, PDM, PEGA, PGRE, PI, PPC, PSA, PTC, QCOM, R, RBBN, RE, RES, RJF, RNR, ROK, ROL, RWT, SAIA, SC, SGC, SHOO, SHOP, SIGI, SIRI, SIX, SJW, SLAB, SLGN, SMED, SNY, SONY, SP, SPOK, SPOT, SRDX, SREV, SRI, SSB, SWK, SXC, TDOC, TDY, TECK, TEVA, TKR, TNL, TR, TROX, TTEK, TTMI, TWOU, TYL, UCTT, UFI, UMC, URI, UVE, UVSP, VET, VKTX, VNE, VRT, VRTS, VSEC, VVV, WCN, WELL, WERN, WH, WHG, WING, WNC, WRE, WWW, YNDX, YUM\n\n - Ex-div:\n\n  BPMP, BSRR, CFG, FRC, ITUB, KEN, KNOP, MAIN\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.416M)\n    - Crude Oil Inventories (consensus: 0.659M, previous: 0.594M)\n    - Cushing Crude Oil Inventories (previous: -1.318M)\n    - Distillate Fuel Production (previous: -0.088M)\n    - EIA Refinery Crude Runs  (previous: -0.286M)\n    - EIA Weekly Distillates Stocks (consensus: -0.648M, previous: -1.074M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 1.0%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - Gasoline Inventories (consensus: 0.508M, previous: 0.086M)\n    - Gasoline Production (previous: -0.229M)\n    - Goods Trade Balance (previous: -87.07B)\n    - Heating Oil Stockpiles (previous: 0.563M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 8.6%)\n    - MBA Purchase Index (previous: 295.5)\n    - Mortgage Market Index (previous: 724.8)\n    - Mortgage Refinance Index (previous: 3,219.9)\n    - Retail Inventories Ex Auto (previous: 1.2%)\n    - U.S. President Biden Speaks\n    - Wholesale Inventories (previous: 0.6%)\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARD, ARES, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLMN, BMRN, BMY, BPMC, BSIG, BSVN, BTU, BVN, BWB, BY, BZH, CACC, CARR, CASA, CAT, CBRE, CBZ, CCBG, CCOI, CCXI, CFFN, CFR, CFX, CG, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COR, COWN, CPLP, CPT, CQP, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CURO, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DRQ, DVA, DVD, DXCM, EBC, EBS, ECOL, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, ERIE, ERII, ERJ, ETH, EVBN, EVLO, EVTC, EXLS, EXPO, FBHS, FBIZ, FBRX, FCN, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FSP, FTAI, FTNT, FTV, FWRD, GEO, GFF, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GOL, GPI, GRA, GSHD, GWB, HAYN, HGV, HP, HSY, HTGC, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INDT, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBAI, LBPS, LEVL, LFVN, LH, LIND, LKQ, LLNW, LMAT, LPLA, LTC, LTRX, LYG, MA, MATW, MBIN, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MNOV, MO, MPW, MRK, MRLN, MSTR, MTLS, MTRN, MTSI, MVIS, NATI, NDLS, NEM, NIO, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, OCFC, OFC, OMCL, ONEW, ONTO, OPI, OPOF, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCG, PCSB, PEB, PH, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RCL, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SAND, SCX, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SNDR, SNP, SO, SPGI, SPSC, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TPX, TREE, TROW, TRS, TRTN, TRUP, TUSK, TW, TWTR, TXRH, TXT, ULBI, ULH, USAK, USM, VC, VCRA, VICI, VIRC, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PLBC, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SLG, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 49B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 5.0%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n## Upcoming events for Friday, April 30th\n\n - Expected earnings:\n\n  ABBV, AON, AROC, AROW, ASIX, AVNT, AZN, B, BCPC, BRID, BSAC, CBOE, CCLP, CHTR, CL, CLX, CRI, CVEO, CVX, CWBC, DCOM, E, EEX, ESXB, FSBW, GT, GWW, HRC, HUN, IMO, IRMD, ITCB, ITW, JCI, JELD, LAZ, LFC, LHX, LSBK, LYB, MGP, MOG.A, MOG.B, NWHM, NWL, OFIX, OIIM, PBI, PFS, PIPR, PNM, POR, PSX, PSXP, QSR, SBFG, SHLX, SLCA, SPCB, WETF, WPC, WY, XOM\n\n - Ex-div:\n\n  AON, ASRV, BX, C, CARR, CASY, CBAN, CLB, CMCO, CNBKA, CZNC, DGICA, DGICB, DMLP, ELP, EVTC, EWBC, FAT, HAS, HEP, HESM, HFBL, KOF, KRP, LCUT, LYTS, MCI, NRG, NSEC, O, OHI, ORRF, PBCT, PEBO, PNW, SBNY, SBS, SGU, SPFI, SXT, SYF, TKC, TXN, WABC\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.4K)\n    - CFTC Copper speculative net positions (previous: 42.9K)\n    - CFTC Corn speculative net positions (previous: 522.7K)\n    - CFTC Crude Oil speculative net positions (previous: 500.0K)\n    - CFTC Gold speculative net positions (previous: 181.5K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.1K)\n    - CFTC Natural Gas speculative net positions (previous: -50.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -52.2K)\n    - CFTC Silver speculative net positions (previous: 41.7K)\n    - CFTC Soybeans speculative net positions (previous: 243.2K)\n    - CFTC Wheat speculative net positions (previous: 21.0K)\n    - Chicago PMI (consensus: 65.3, previous: 66.3)\n    - Core PCE Price Index (consensus: 0.3%, previous: 0.1%)\n    - Core PCE Price Index (consensus: 1.8%, previous: 1.4%)\n    - Dallas Fed PCE (previous: 1.80%)\n    - Employment Benefits (previous: 0.60%)\n    - Employment Cost Index (consensus: 0.7%, previous: 0.7%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.70%)\n    - Michigan Consumer Expectations (previous: 79.7)\n    - Michigan Consumer Sentiment (consensus: 87.4, previous: 86.5)\n    - Michigan Current Conditions (previous: 97.2)\n    - Michigan Inflation Expectations (previous: 3.7%)\n    - PCE Price index (previous: 1.6)\n    - PCE price index (previous: 0.2%)\n    - Personal Income (consensus: 20.3%, previous: -7.1%)\n    - Personal Spending (consensus: 4.1%, previous: -1.0%)\n    - Real Personal Consumption (previous: -1.2%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 344)\n    - U.S. Baker Hughes Total Rig Count (previous: 439)\n\n^^^^2021-04-28",
        "created_utc": 1619604015,
        "id": "gw5lmui",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619632815.0
    },
    {
        "author": "larryjuana",
        "body": "Just want to take second to talk about Aphria.\n\nWhen the short attack happened I thought I had picked the wrong company. \n\nRecently they are growing in Germany, sold their operations in Jamaica, bought an AWESOME craft brewery in the USA and now are taking over TLRY.\n\nI am proud of you APH 🥲",
        "created_utc": 1619795953,
        "id": "gwfndg1",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1619824753.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 26th of April\n\n\n\n## Upcoming events for Monday, April 26th\n\n - Expected earnings:\n\n  ACI, AGNC, AIN, AMG, AMKR, AMP, ARE, ARLP, AXTA, BCLI, BOH, BRO, CATY, CBU, CCB, CDNS, CHKP, CNI, CVLG, DGICA, DGICB, DHIL, DORM, EBTC, EFSC, FBK, FBP, FCAP, FIX, FLXS, FNCB, FRAF, FRBA, HBT, HLX, HMST, HONE, HSII, HSTM, HTLF, IBTX, ILPT, JBT, JJSF, KOF, KREF, LII, LKFN, LXFR, LXRX, MASI, MEDP, MEDS, MKSI, MPB, MRBK, MSB, NBTB, NRIM, NTP, NWBI, NXPI, OMF, OTIS, OVBC, PCH, PEBK, PHG, PKG, PKX, PRK, PW, RBB, RMBI, RRC, SANM, SBAC, SCCO, SEB, SFBC, SSBI, SSD, SSNC, SUI, SVBI, TBI, TCF, TNET, TOWN, TSLA, TV, UHS, UHT, WIRE, WRI\n\n - Ex-div:\n\n  AZZ, CVLY, QIWI, SPNS\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.152%)\n    - 3-Month Bill Auction (previous: 0.025%)\n    - 5-Year Note Auction (previous: 0.850%)\n    - 6-Month Bill Auction (previous: 0.040%)\n    - Core Durable Goods Orders (consensus: 1.6%, previous: -0.9%)\n    - Dallas Fed Mfg Business Index (previous: 28.9)\n    - Durable Goods Orders (consensus: 2.5%, previous: -1.2%)\n    - Durables Excluding Defense (previous: -0.8%)\n    - Goods Orders Non Defense Ex Air (consensus: 1.5%, previous: -0.9%)\n    - Investing.com Gold Index (actual: 52.0%, previous: 48.9%)\n    - Investing.com S&amp;P 500 Index (actual: 33.1%, previous: 39.6%)\n\n## Upcoming events for Tuesday, April 27th\n\n - Stock splits:\n\n    - NSPR @ **1:15**\n\n - Expected earnings:\n\n  AAN, AAT, ABB, ABG, ACCO, ACGL, ACH, ADM, AHC, AJRD, AKO.A, AKO.B, AMD, AMGN, AMX, APAM, ARAY, ARVN, ATEN, ATNI, ATRC, AUDC, AWI, AWRE, BFST, BP, BSBR, BUSE, BXP, BYD, CAC, CALX, CASH, CB, CEQP, CHE, CHRW, CNC, COF, CROX, CRSP, CSGP, CYBE, CZWI, DTE, EBMT, ECL, EGP, EHC, EIX, ENPH, ENTG, EQR, ESBK, ESS, FBNC, FCF, FCPT, FELE, FEYE, FFIC, FFIV, FFNW, FFWM, FIBK, FISV, FRST, FSV, FTI, GE, GFF, GLW, GOOD, GOOG, GOOGL, GPK, HA, HAFC, HAS, HBCP, HEES, HFBL, HIW, HOPE, HRZN, HSBC, HUBB, HVT, HVT.A, IBA, IBCP, IEX, ILMN, IRBT, IVZ, JBLU, JNPR, KNSA, KTCC, LBC, LBRT, LDL, LECO, LLY, MANH, MATX, MDLZ, MKL, MMC, MMM, MRC, MSCI, MSFT, MSTR, MVBF, MXIM, NAVI, NCR, NOV, NVS, NXRT, ODT, OKE, OLN, OMAB, OPRA, OXSQ, PCAR, PFG, PHM, PII, PINS, PJT, PPBI, PPD, PROV, PSB, PTSI, QCRH, QTS, RCKY, RNDB, RNST, ROIC, ROP, RRD, RTX, RXN, SAN, SBUX, SCL, SFST, SHW, SMIT, SPFI, SQNS, SSTK, ST, SYF, SYK, SYX, TENB, TER, TFII, TKC, TPB, TRMK, TRMT, TRU, TSBK, TX, TXN, UBS, UDR, UMBF, UPS, USNA, V, VALE, VBTX, VET, VIST, WDR, WM, WNEB, WSBC, WSBF, WW, YUMC\n\n - Ex-div:\n\n  AM, ATR, BK, CALM, ENTG, IFS, QADA, QADB, VSEC\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 1.300%)\n    - API Weekly Crude Oil Stock (previous: 0.436M)\n    - CB Consumer Confidence (consensus: 113.0, previous: 109.7)\n    - Dallas Fed Services Revenues (previous: 21.6)\n    - House Price Index (previous: 1.0%)\n    - House Price Index (previous: 12.0%)\n    - House Price Index (previous: 316.7)\n    - Redbook (previous: -17.2%)\n    - Redbook (previous: 13.5%)\n    - Richmond Manufacturing Index (previous: 17)\n    - Richmond Manufacturing Shipments (previous: 22)\n    - Richmond Services Index (previous: 16)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 11.7%, previous: 11.1%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.1%, previous: 1.2%)\n    - Texas Services Sector Outlook (previous: 28.9)\n\n## Upcoming events for Wednesday, April 28th\n\n - Expected earnings:\n\n  AAPL, ADP, AER, AFL, AGI, AKR, ALGN, ALRS, ALSN, ALTA, AM, AMED, APH, AR, ARCC, ASGN, ATOM, ATUS, AUY, AVB, AVT, AVTR, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BHLB, BLKB, BPOP, BRKL, BSMX, BSX, BXMT, CAKE, CAMT, CBTX, CCS, CDE, CHEF, CHX, CINF, CIT, CLR, CME, CMO, CNMD, CNO, CONE, CPF, CSTM, CUBI, CYH, DAN, DISCA, DISCB, DISCK, DMRC, DRE, DX, EBAY, ECHO, EQIX, ESI, ESRT, ETR, EVA, EVR, EXR, EXTR, F, FARO, FB, FCNCA, FISI, FNF, FORM, GD, GIB, GRMN, GRUB, GSK, GTY, HBNC, HELE, HES, HESM, HNI, HOLX, HT, HUM, IART, ICAD, ICLR, INOV, INVH, IPG, IRT, ISBC, JAKK, KALU, KNL, KRA, KRC, LC, LFUS, LIVN, LOGI, LXU, MAA, MAS, MC, MCO, MCRI, MEOH, MGM, MGRC, MHH, MHO, MLP, MN, MOH, MORN, MPX, MSVB, MTDR, MTH, MUSA, MXL, NBR, NGVT, NLY, NOA, NOVA, NOW, NSC, NTB, NYCB, OBNK, OC, OI, OII, OIS, ORLY, ORN, OSK, OVLY, OVV, PAG, PB, PDM, PEGA, PGRE, PI, PPC, PSA, PTC, QCOM, R, RBBN, RE, RES, RJF, RNR, ROK, ROL, RWT, SAIA, SC, SGC, SHOO, SHOP, SIGI, SIRI, SIX, SJW, SLAB, SLGN, SMED, SNY, SONY, SP, SPOT, SRDX, SREV, SRI, SSB, SWK, SXC, TDOC, TDY, TECK, TEVA, TKR, TNL, TR, TROX, TTEK, TTMI, TWOU, TYL, UCTT, UFI, UMC, URI, UVE, UVSP, VNE, VRT, VRTS, VSEC, VVV, WCN, WELL, WERN, WH, WING, WNC, WRE, WWW, YNDX, YUM\n\n - Ex-div:\n\n  BPMP, BSRR, CFG, FRC, ITUB, KEN, KNOP, MAIN\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.416M)\n    - Crude Oil Inventories (previous: 0.594M)\n    - Cushing Crude Oil Inventories (previous: -1.318M)\n    - Distillate Fuel Production (previous: -0.088M)\n    - EIA Refinery Crude Runs  (previous: -0.286M)\n    - EIA Weekly Distillates Stocks (consensus: -0.956M, previous: -1.074M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.7%, previous: 1.0%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision\n    - Gasoline Inventories (consensus: 0.464M, previous: 0.086M)\n    - Gasoline Production (previous: -0.229M)\n    - Goods Trade Balance (previous: -87.07B)\n    - Heating Oil Stockpiles (previous: 0.563M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 8.6%)\n    - MBA Purchase Index (previous: 295.5)\n    - Mortgage Market Index (previous: 724.8)\n    - Mortgage Refinance Index (previous: 3,219.9)\n    - Retail Inventories Ex Auto (previous: 1.2%)\n    - Wholesale Inventories (previous: 0.6%)\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALGT, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARES, ARW, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLDR, BLMN, BMRN, BMY, BSIG, BSVN, BVN, BWB, BY, BZH, CARR, CASA, CAT, CBNK, CBRE, CBZ, CCOI, CDNA, CENX, CFR, CFX, CG, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COP, COR, COWN, CPT, CQP, CRAI, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CURO, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DVD, DXCM, EBC, EBS, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, ERIE, ERII, ERJ, ETH, EVBN, EVTC, EXLS, EXPO, FBC, FBHS, FCN, FDUS, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FSP, FTAI, FTNT, FTV, FWRD, GEO, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GPI, GRA, GSHD, GT, GWB, HAYN, HGV, HIG, HP, HSY, HTGC, HUBG, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INSM, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBAI, LBPS, LEVL, LFVN, LH, LKQ, LLNW, LMAT, LOCO, LPLA, LTC, LTRX, LYG, MA, MATW, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MO, MRK, MRLN, MTLS, MTRN, MTSI, MTZ, NATI, NDLS, NEM, NIO, NLSN, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, OCFC, OFC, OMCL, ONEW, ONTO, OPI, OPOF, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCB, PCG, PCSB, PEB, PFPT, PH, PMBC, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SCX, SF, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SMMF, SNDR, SNP, SO, SPGI, SPSC, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TPL, TPR, TPX, TREE, TROW, TRS, TRTN, TRUP, TW, TWTR, TXRH, TXT, UBSI, ULBI, ULH, USAK, USM, UTL, VC, VCRA, VICI, VIRC, VKTX, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 49B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 4.7%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n^^^^2021-04-26",
        "created_utc": 1619431217,
        "id": "gvww79d",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619460017.0
    },
    {
        "author": "thefanniesniffer",
        "body": "agree InTheMoneyALex. and bananastock you're right though, APHA holders are biased by the fact that it's one of the way better canadian companies. \n\nWhen APH was 30 I considered selling and moving entirely into cresco and friends. \n\nHolding the bags though and averaging into a $6 avg. on aphria helped massively. \n\nboth answers seem to have some right in them? (I know nada.)",
        "created_utc": 1617727401,
        "id": "gtl5af7",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1617756201.0
    },
    {
        "author": "larryjuana",
        "body": "Can’t believe after this week and all these years I am going to have to say goodbye to my beloved APH(A) ticker 🥲\n\n\nTLRY is my new best friend now.",
        "created_utc": 1619279639,
        "id": "gvpwlmn",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1619308439.0
    },
    {
        "author": "Adb6488",
        "body": "Breaker breaker, come in Earth, this is GME rocket ship 27. The hedgies fucked over the carbonator on engine 4, I'm going to try to refuckulate it and land on Juniper. Hopefully they got some space weed. Over.",
        "created_utc": 1618496213,
        "id": "gulux06",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1618525013.0
    },
    {
        "author": "Aelsar",
        "body": "All in 4/16 JNPR 26C\n\nLarge IHS on the daily and weekly chart. Expecting the breakout to bring us to 27-28 a share\n\nTo tendyland we go.",
        "created_utc": 1617313337,
        "id": "gt2tgo5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617342137.0
    },
    {
        "author": "Ironleg01",
        "body": "There are still reasonably valued equities. Mostly your usual value names, some older tech companies and there are few currently hated companies. \nValue ones are some defence names like GD or RTX, I think they are still cheap, there are others too. Then old tech companies (but not necessarily bad ones) are HPE, JNPR, CSCO and few others. Finally hated names (I love buying hated but good companies for cheap) are INTC, GM and few others. There are some special situations too (like VRSK still hasn't fully recovered) and internationally there are interesting equities as well priced cheap. Popular names are expensive but they are popular so... But if you look outside of what people talk about on Reddit you can find some value.",
        "created_utc": 1617914082,
        "id": "gtuqc5x",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617942882.0
    },
    {
        "author": "Formal_Ground",
        "body": "JNPR gonna moon so fucking hard Monday",
        "created_utc": 1617384324,
        "id": "gt5ruqv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617413124.0
    },
    {
        "author": "dr3amboy3657",
        "body": "Cramer said it once on taxes.  Don’t worry about not paying the taxes so much, the market might take care of that for you.  What that means is that say your stock is @100 and you sell now and pay 35% in taxes or hold it and the stock goes down to 70 anyway.  \n\nNow, the example is too simple but that’s the concept.  I like what the other OP said to reset your cost basis every now and then so it becomes more manageable.  It has become a huge problem for me too.   I too have massive long LGTC &gt;500k on a stock that I’m not sure I want to hold for the next 5 years just so I can sell ~100k a year to reduce taxes.\n\nYou say TODAY you want to hold MSFT for a long time but at some point, you will have to pay the taxes.  MSFT might not be around when you retire in 20-30 years.  Just because MSFT has been doing well for the last 5 years doesn’t mean it will do well the next 25.   What if you had massive capital gains in Yahoo, Enron, Xom, Cisco, juniper, ibm, or GME(lol)?   Some are long gone and some have became dead money for years.",
        "created_utc": 1618403669,
        "id": "guhb3i8",
        "score": 1,
        "subreddit": "options",
        "created": 1618432469.0
    },
    {
        "author": "metnavman",
        "body": "So you're selling 4/16 26c CCs on JNPR eh?",
        "created_utc": 1617633895,
        "id": "gtgieee",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617662695.0
    },
    {
        "author": "NeptuneAgency",
        "body": "My intern signed me up. I swear. She's a monkey and just bashes keys on the keyboard.",
        "created_utc": 1617295138,
        "id": "gt1pxu0",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1617323938.0
    },
    {
        "author": "competitivebunny",
        "body": "🧐\n\n\nOh btw have you started moving?! You get the keys this week right?",
        "created_utc": 1617322982,
        "id": "gt3bn7x",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617351782.0
    },
    {
        "author": "Valen51",
        "body": "Jim Cramer wears his keys on his belt loop.",
        "created_utc": 1617289095,
        "id": "gt1cjdg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617317895.0
    },
    {
        "author": "BossMcHogg",
        "body": "Need collateral.  Can u get me wifes boyfriends car keys?",
        "created_utc": 1617296280,
        "id": "gt1shy1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617325080.0
    },
    {
        "author": "RedditLovesChina2021",
        "body": "CRM $240C 7/16\n\nI've been in the cuck shed for months but I hear the chastity keys jangling",
        "created_utc": 1617289809,
        "id": "gt1e3e2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617318609.0
    },
    {
        "author": "justjared725",
        "body": "Yeah + $40k of equipment.  But the real story was the correction statement: \"Not included in the 2020 Q1 financials are the previously referenced Bitcoin buys of 513 BTC (circa 2014) and the conflicting 576 BTC (circa 2016) as seen and carried over from previous managements reports. As of Q1 2020 current management has yet to receive any company (CCTL) books, statements, bank info, property, assets or proof of any Bitcon holdings from old management. All previous financial reports 2018 and 2019 were mostly reconstructed from previous reports filed by Coin Citadel and old CEO Bill Schaefer. Without substantive proof of current Bitcoin holdings still held by old management, or that a loss was incurred from an unusual event and or negligent action by prior management due to lost access to private keys and or wallets, or Bitcoin was sold and previous sale was never disclosed to new management, Coin Citadel cannot continue to reference the aforementioned Bitcoin Treasury in its financials moving forward.\"\n\nSo it's either been a scam or someone pocketed 500+ bitcoin, or someone lost access to wallets. NO ONE JUST MISPLACES THE KEYS TO $30m OF BITCOIN.",
        "created_utc": 1617330175,
        "id": "gt3o120",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1617358975.0
    },
    {
        "author": "TCB47",
        "body": "Vanguard has some very good funds available in the US &amp; I would assume they have something similar in the UK.  My wife &amp; I have our primary investments housed with Fidelity Investment here in the U.S. and they are all in a diversified retirement account.\n\nCurrent distribution is 40/60 with 40% in bond &amp; 60% stock mutuals.  We are retirement age hence the heavier allocation to bonds.  You could get by with a heavier stock weighting.\n\nOur stocks are split among growth funds, medical, technology and communications.  The keys for us have been to not panic and let things ride during some of the downturns.  I do rebalance the account at the first of the year to try to keep the bond/stock split close to my desired weighting.\n\nWith retirement funds, I have stayed away from straight stock ownership and for us, that has worked very well.  It's amazing what the compounding will accomplish by allowing the funds to reinvest the dividends and capital gains back info the funds.  Good luck.\n\nBTW, I am using Robinhood to \"play\" with options with some disposable, not going to miss it, funds.  I just won't get wild with the retirement account.",
        "created_utc": 1617326241,
        "id": "gt3hayh",
        "score": 1,
        "subreddit": "investing",
        "created": 1617355041.0
    },
    {
        "author": "GME_retard-rocket",
        "body": "Joe Byeden triple bags his groceries, then leaves them in the parking lot after setting them down to find his car keys.",
        "created_utc": 1617410133,
        "id": "gt752us",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617438933.0
    },
    {
        "author": "dont-YOLO-ragequit",
        "body": "This really lack any due Diligence. \nAre you just trolling to get the answers fed to you or did you just poorly formulated a Change my view post? \n\nDoesn't reay matter who invented it as the basis of it has been optimized by the competition between all crypto currencies. In other words the un verified unsecured currencies died a decade plus ago from not being hack proof.\n\nThe currencies are currently competing with each other the same way the Yen, Euro, US dollar and more are competing with each other. They all have their own supply and demand and the more credible companies hop on, the more credible it will get.(compared to currencies being manipulated by stimulus packages, interest rates and buying other currencies). \n\n\nIt IS being regulated and audited. The mid February crash happened because some firm falsely stated that they found a double transaction. It was later backtracked but the damage was done. \n\nThe values is linked to how hard it is to mine 1 coin at this point. You could mine a coin with an idle computer so at the time it was chump change, now it takes high powered hardware, a heavy electricity bill and a ton of cooling to get one so the price goes along with it + how it can only get harder to have one. \n\nYour coins are as secure as you make it. There are crypted USB keys  to keep your wallet safe but like everything, the more valuable it is, the more someone will have the patience to get it.\n\nThe future is in that it cuts currency exchange fees(the banks) and rates(the government) and financial institutions from host to client. You get a coin, you trade parts of it the way you want internationally or confidentially with no brick and mortar fees. \n\nThe GME saga showed big banks can and will interfere to make money over the well being of free market.\n\nBitcoin might not be the end all solution but something can be said about the infrastructure behind it where no \"package\"(hash) can be hacked since the time and date , the number of characters, sender and receivers , and so much of the the data that makes the hash can be used to encrypt it thus can't be \"reinserted\" in the blockchain.",
        "created_utc": 1617497772,
        "id": "gtavdj3",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1617526572.0
    },
    {
        "author": "tigger0jk",
        "body": "New csgo case keys are no longer tradeable or marketable since Oct 2019 https://blog.counter-strike.net/index.php/2019/10/26113/\n\nSo there is no supply to match the demand anymore, they trade at a premium not a discount on steam marketplace or dmarket or wherever.",
        "created_utc": 1617565309,
        "id": "gtdlw6a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617594109.0
    },
    {
        "author": "daenerbogson",
        "body": "Buyden handed Elon the spare keys to the printer room with this infrastructure bill. $TSLA",
        "created_utc": 1617600433,
        "id": "gtfaagb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617629233.0
    },
    {
        "author": "canucksunlimited",
        "body": "Have you considered cold storage? \n\nTrezor or Ledger are reputable brands and they can be purchased through licensed distributors in Canada if you check their websites to see who is licensed to sell them. With the price of spreads and fees on some of these custodians, the wallets practically pay for themselves. On top of this, you own the asset yourself instead of some third party (which is the whole point of decentralization). Not your keys not your coins kind of thing. \n\nAfter you’ve received your wallet and you’ve set it up, you use an exchange to purchase BTC or ETH and then transfer it into your Trezor or Ledger. As others have mentioned Shakepay is a  good exchange for Canadians. \n\nIf you want to sell, you transfer your funds back to shakepay and trade your BTC or ETH for CAD. From there you send the CAD off the exchange and back into your account through e-transfer. Shakepay’s only fees are  1.5% spread on buy and sell.",
        "created_utc": 1617557712,
        "id": "gtd77hu",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1617586512.0
    },
    {
        "author": "TurboRaptor",
        "body": "You can get even steeper discounts if you pay in Steam keys",
        "created_utc": 1617554711,
        "id": "gtd1axe",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617583511.0
    },
    {
        "author": "bahamut_is_my_cat",
        "body": "Hi peak travel season. The keys right now are full effect of tourist I know I live close by",
        "created_utc": 1617555387,
        "id": "gtd2mvc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617584187.0
    },
    {
        "author": "upupuplightweight",
        "body": "Punch the keys for god sake!",
        "created_utc": 1617632154,
        "id": "gtgewf7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617660954.0
    },
    {
        "author": "nodrugshereofficers",
        "body": "If you’re worried about ShakePay not giving you your keys, that’s not the case. I could transfer all the BTC/ETH I hold with them to cold storage if I wanted to. It’s honestly a very good platform to get started with crypto on. The Shaking Sats program they have is also a huge bonus, basically a free $100 after you shake your phone everyday for 200 days. If you need a referral then let me know and we’ll both get $30.",
        "created_utc": 1617559470,
        "id": "gtdanng",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1617588270.0
    },
    {
        "author": "iwanttobelieve42069",
        "body": "You underestimate how long it takes me to find my car keys",
        "created_utc": 1617543917,
        "id": "gtchftn",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1617572717.0
    },
    {
        "author": "Imaginary_Macaron599",
        "body": "I can’t read legit push keys hope for success",
        "created_utc": 1617465503,
        "id": "gt97ksz",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1617494303.0
    },
    {
        "author": "DS_Bridges_Road_Crew",
        "body": "My keys to success:\nBuy and hold houses for 22 years.\nWork a job you hate for pinheads and squirrel away everything you can for 25 years. Try not to lose it all in each recession.\nBe there for your parents when they die and sell their houses, roll their retirements into yours.",
        "created_utc": 1617483832,
        "id": "gta7bpj",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617512632.0
    },
    {
        "author": "Abragram_Stinkin",
        "body": "Well yeah, that's called larceny. Which, if that were a true fear here, then I would posit the parent is the irresponsible one for giving the thief the keys to the kingdom.\n\nSounds like this parent has a good handle on it.",
        "created_utc": 1617263289,
        "id": "gt09p7w",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1617292089.0
    },
    {
        "author": "Abject-Mixture-8926",
        "body": "Ew...how about a real beach house...East Hampton, Amagansett, Montauk. Or even the Keys.",
        "created_utc": 1617374946,
        "id": "gt58z0a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617403746.0
    },
    {
        "author": "IllBiteYourLegsOff",
        "body": "they likely meant 'tanks' seeing as 'r' and 't' are neighbouring keys",
        "created_utc": 1617567812,
        "id": "gtdqopr",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1617596612.0
    },
    {
        "author": "matthewvz",
        "body": "Go figure that everyone forgot TF2 keys and ref get you even bigger discounts.",
        "created_utc": 1617557420,
        "id": "gtd6me8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617586220.0
    },
    {
        "author": "richtofin115",
        "body": "😳. Idek where to begin 😬\n\nOne that comes to mind: senior year of hs. Get grounded for some shit or another probably skipping school or smoking or being a douche. It’s Halloween. Mom blocks my car in the driveway says she’s taking my keys. Am like fuck no, I got plans. Drive out on the grass. Pick up friends from college like 40 minutes away to go to a huge Halloween thing by *an unnamed* university known for its huge Halloween thing every year. Go to sorority party dance and make out with sorority chicks 😎. Then went back to my friend’s drm for the night. Was grounded long time for that one\n\nYou’re up",
        "created_utc": 1617584863,
        "id": "gtelvg1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617613663.0
    },
    {
        "author": "MichaelTruly",
        "body": "I’m gonna need to see more DD on KEYS before I’m in",
        "created_utc": 1617591218,
        "id": "gtewuyt",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1617620018.0
    },
    {
        "author": "Imaginary_Macaron599",
        "body": "Just pushed keys hoped it’s made words",
        "created_utc": 1617631168,
        "id": "gtgd07q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617659968.0
    },
    {
        "author": "NotLarryT",
        "body": "Be that as it may, you're probably going to want a set of bump keys at the least to pick up a more common car. Something only a few years old. Just spitballing, though.",
        "created_utc": 1617601678,
        "id": "gtfbtjr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617630478.0
    },
    {
        "author": "banana_splote",
        "body": "It won't. \nMy guess is that $800 - $1,000 is the max. There will be intervention if it becomes too high. \n\nIf the H fund gets margin called and they can't cover, they just give the keys back and \"foock it\".\n\n(Please don't kill me for not drinking the same kool aid)",
        "created_utc": 1617489234,
        "id": "gtah0yf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617518034.0
    },
    {
        "author": "Gwanzi",
        "body": "They get confused if you tell them your car is only on it’s 15th mile because you lost the keys and never bothered to find them",
        "created_utc": 1617542430,
        "id": "gtcf3n4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617571230.0
    },
    {
        "author": "tico42",
        "body": "Just bought 50k shares in this guy's car keys. Holding LONG!",
        "created_utc": 1617549921,
        "id": "gtcrz9n",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1617578721.0
    },
    {
        "author": "NeptuneAgency",
        "body": "My intern signed me up. I swear. She's a monkey and just bashes keys on the keyboard.",
        "created_utc": 1617295138,
        "id": "gt1pxu0",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1617323938.0
    },
    {
        "author": "competitivebunny",
        "body": "🧐\n\n\nOh btw have you started moving?! You get the keys this week right?",
        "created_utc": 1617322982,
        "id": "gt3bn7x",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617351782.0
    },
    {
        "author": "Valen51",
        "body": "Jim Cramer wears his keys on his belt loop.",
        "created_utc": 1617289095,
        "id": "gt1cjdg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617317895.0
    },
    {
        "author": "BossMcHogg",
        "body": "Need collateral.  Can u get me wifes boyfriends car keys?",
        "created_utc": 1617296280,
        "id": "gt1shy1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617325080.0
    },
    {
        "author": "RedditLovesChina2021",
        "body": "CRM $240C 7/16\n\nI've been in the cuck shed for months but I hear the chastity keys jangling",
        "created_utc": 1617289809,
        "id": "gt1e3e2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617318609.0
    },
    {
        "author": "justjared725",
        "body": "Yeah + $40k of equipment.  But the real story was the correction statement: \"Not included in the 2020 Q1 financials are the previously referenced Bitcoin buys of 513 BTC (circa 2014) and the conflicting 576 BTC (circa 2016) as seen and carried over from previous managements reports. As of Q1 2020 current management has yet to receive any company (CCTL) books, statements, bank info, property, assets or proof of any Bitcon holdings from old management. All previous financial reports 2018 and 2019 were mostly reconstructed from previous reports filed by Coin Citadel and old CEO Bill Schaefer. Without substantive proof of current Bitcoin holdings still held by old management, or that a loss was incurred from an unusual event and or negligent action by prior management due to lost access to private keys and or wallets, or Bitcoin was sold and previous sale was never disclosed to new management, Coin Citadel cannot continue to reference the aforementioned Bitcoin Treasury in its financials moving forward.\"\n\nSo it's either been a scam or someone pocketed 500+ bitcoin, or someone lost access to wallets. NO ONE JUST MISPLACES THE KEYS TO $30m OF BITCOIN.",
        "created_utc": 1617330175,
        "id": "gt3o120",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1617358975.0
    },
    {
        "author": "TCB47",
        "body": "Vanguard has some very good funds available in the US &amp; I would assume they have something similar in the UK.  My wife &amp; I have our primary investments housed with Fidelity Investment here in the U.S. and they are all in a diversified retirement account.\n\nCurrent distribution is 40/60 with 40% in bond &amp; 60% stock mutuals.  We are retirement age hence the heavier allocation to bonds.  You could get by with a heavier stock weighting.\n\nOur stocks are split among growth funds, medical, technology and communications.  The keys for us have been to not panic and let things ride during some of the downturns.  I do rebalance the account at the first of the year to try to keep the bond/stock split close to my desired weighting.\n\nWith retirement funds, I have stayed away from straight stock ownership and for us, that has worked very well.  It's amazing what the compounding will accomplish by allowing the funds to reinvest the dividends and capital gains back info the funds.  Good luck.\n\nBTW, I am using Robinhood to \"play\" with options with some disposable, not going to miss it, funds.  I just won't get wild with the retirement account.",
        "created_utc": 1617326241,
        "id": "gt3hayh",
        "score": 1,
        "subreddit": "investing",
        "created": 1617355041.0
    },
    {
        "author": "GME_retard-rocket",
        "body": "Joe Byeden triple bags his groceries, then leaves them in the parking lot after setting them down to find his car keys.",
        "created_utc": 1617410133,
        "id": "gt752us",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617438933.0
    },
    {
        "author": "Imaginary_Macaron599",
        "body": "I can’t read legit push keys hope for success",
        "created_utc": 1617465503,
        "id": "gt97ksz",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1617494303.0
    },
    {
        "author": "DS_Bridges_Road_Crew",
        "body": "My keys to success:\nBuy and hold houses for 22 years.\nWork a job you hate for pinheads and squirrel away everything you can for 25 years. Try not to lose it all in each recession.\nBe there for your parents when they die and sell their houses, roll their retirements into yours.",
        "created_utc": 1617483832,
        "id": "gta7bpj",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617512632.0
    },
    {
        "author": "Abragram_Stinkin",
        "body": "Well yeah, that's called larceny. Which, if that were a true fear here, then I would posit the parent is the irresponsible one for giving the thief the keys to the kingdom.\n\nSounds like this parent has a good handle on it.",
        "created_utc": 1617263289,
        "id": "gt09p7w",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1617292089.0
    },
    {
        "author": "Abject-Mixture-8926",
        "body": "Ew...how about a real beach house...East Hampton, Amagansett, Montauk. Or even the Keys.",
        "created_utc": 1617374946,
        "id": "gt58z0a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617403746.0
    },
    {
        "author": "banana_splote",
        "body": "It won't. \nMy guess is that $800 - $1,000 is the max. There will be intervention if it becomes too high. \n\nIf the H fund gets margin called and they can't cover, they just give the keys back and \"foock it\".\n\n(Please don't kill me for not drinking the same kool aid)",
        "created_utc": 1617489234,
        "id": "gtah0yf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617518034.0
    },
    {
        "author": "NeptuneAgency",
        "body": "My intern signed me up. I swear. She's a monkey and just bashes keys on the keyboard.",
        "created_utc": 1617295138,
        "id": "gt1pxu0",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1617323938.0
    },
    {
        "author": "competitivebunny",
        "body": "🧐\n\n\nOh btw have you started moving?! You get the keys this week right?",
        "created_utc": 1617322982,
        "id": "gt3bn7x",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617351782.0
    },
    {
        "author": "Valen51",
        "body": "Jim Cramer wears his keys on his belt loop.",
        "created_utc": 1617289095,
        "id": "gt1cjdg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617317895.0
    },
    {
        "author": "BossMcHogg",
        "body": "Need collateral.  Can u get me wifes boyfriends car keys?",
        "created_utc": 1617296280,
        "id": "gt1shy1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617325080.0
    },
    {
        "author": "RedditLovesChina2021",
        "body": "CRM $240C 7/16\n\nI've been in the cuck shed for months but I hear the chastity keys jangling",
        "created_utc": 1617289809,
        "id": "gt1e3e2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617318609.0
    },
    {
        "author": "justjared725",
        "body": "Yeah + $40k of equipment.  But the real story was the correction statement: \"Not included in the 2020 Q1 financials are the previously referenced Bitcoin buys of 513 BTC (circa 2014) and the conflicting 576 BTC (circa 2016) as seen and carried over from previous managements reports. As of Q1 2020 current management has yet to receive any company (CCTL) books, statements, bank info, property, assets or proof of any Bitcon holdings from old management. All previous financial reports 2018 and 2019 were mostly reconstructed from previous reports filed by Coin Citadel and old CEO Bill Schaefer. Without substantive proof of current Bitcoin holdings still held by old management, or that a loss was incurred from an unusual event and or negligent action by prior management due to lost access to private keys and or wallets, or Bitcoin was sold and previous sale was never disclosed to new management, Coin Citadel cannot continue to reference the aforementioned Bitcoin Treasury in its financials moving forward.\"\n\nSo it's either been a scam or someone pocketed 500+ bitcoin, or someone lost access to wallets. NO ONE JUST MISPLACES THE KEYS TO $30m OF BITCOIN.",
        "created_utc": 1617330175,
        "id": "gt3o120",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1617358975.0
    },
    {
        "author": "TCB47",
        "body": "Vanguard has some very good funds available in the US &amp; I would assume they have something similar in the UK.  My wife &amp; I have our primary investments housed with Fidelity Investment here in the U.S. and they are all in a diversified retirement account.\n\nCurrent distribution is 40/60 with 40% in bond &amp; 60% stock mutuals.  We are retirement age hence the heavier allocation to bonds.  You could get by with a heavier stock weighting.\n\nOur stocks are split among growth funds, medical, technology and communications.  The keys for us have been to not panic and let things ride during some of the downturns.  I do rebalance the account at the first of the year to try to keep the bond/stock split close to my desired weighting.\n\nWith retirement funds, I have stayed away from straight stock ownership and for us, that has worked very well.  It's amazing what the compounding will accomplish by allowing the funds to reinvest the dividends and capital gains back info the funds.  Good luck.\n\nBTW, I am using Robinhood to \"play\" with options with some disposable, not going to miss it, funds.  I just won't get wild with the retirement account.",
        "created_utc": 1617326241,
        "id": "gt3hayh",
        "score": 1,
        "subreddit": "investing",
        "created": 1617355041.0
    },
    {
        "author": "GME_retard-rocket",
        "body": "Joe Byeden triple bags his groceries, then leaves them in the parking lot after setting them down to find his car keys.",
        "created_utc": 1617410133,
        "id": "gt752us",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617438933.0
    },
    {
        "author": "dont-YOLO-ragequit",
        "body": "This really lack any due Diligence. \nAre you just trolling to get the answers fed to you or did you just poorly formulated a Change my view post? \n\nDoesn't reay matter who invented it as the basis of it has been optimized by the competition between all crypto currencies. In other words the un verified unsecured currencies died a decade plus ago from not being hack proof.\n\nThe currencies are currently competing with each other the same way the Yen, Euro, US dollar and more are competing with each other. They all have their own supply and demand and the more credible companies hop on, the more credible it will get.(compared to currencies being manipulated by stimulus packages, interest rates and buying other currencies). \n\n\nIt IS being regulated and audited. The mid February crash happened because some firm falsely stated that they found a double transaction. It was later backtracked but the damage was done. \n\nThe values is linked to how hard it is to mine 1 coin at this point. You could mine a coin with an idle computer so at the time it was chump change, now it takes high powered hardware, a heavy electricity bill and a ton of cooling to get one so the price goes along with it + how it can only get harder to have one. \n\nYour coins are as secure as you make it. There are crypted USB keys  to keep your wallet safe but like everything, the more valuable it is, the more someone will have the patience to get it.\n\nThe future is in that it cuts currency exchange fees(the banks) and rates(the government) and financial institutions from host to client. You get a coin, you trade parts of it the way you want internationally or confidentially with no brick and mortar fees. \n\nThe GME saga showed big banks can and will interfere to make money over the well being of free market.\n\nBitcoin might not be the end all solution but something can be said about the infrastructure behind it where no \"package\"(hash) can be hacked since the time and date , the number of characters, sender and receivers , and so much of the the data that makes the hash can be used to encrypt it thus can't be \"reinserted\" in the blockchain.",
        "created_utc": 1617497772,
        "id": "gtavdj3",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1617526572.0
    },
    {
        "author": "iwanttobelieve42069",
        "body": "You underestimate how long it takes me to find my car keys",
        "created_utc": 1617543917,
        "id": "gtchftn",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1617572717.0
    },
    {
        "author": "Imaginary_Macaron599",
        "body": "I can’t read legit push keys hope for success",
        "created_utc": 1617465503,
        "id": "gt97ksz",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1617494303.0
    },
    {
        "author": "DS_Bridges_Road_Crew",
        "body": "My keys to success:\nBuy and hold houses for 22 years.\nWork a job you hate for pinheads and squirrel away everything you can for 25 years. Try not to lose it all in each recession.\nBe there for your parents when they die and sell their houses, roll their retirements into yours.",
        "created_utc": 1617483832,
        "id": "gta7bpj",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617512632.0
    },
    {
        "author": "Abragram_Stinkin",
        "body": "Well yeah, that's called larceny. Which, if that were a true fear here, then I would posit the parent is the irresponsible one for giving the thief the keys to the kingdom.\n\nSounds like this parent has a good handle on it.",
        "created_utc": 1617263289,
        "id": "gt09p7w",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1617292089.0
    },
    {
        "author": "Abject-Mixture-8926",
        "body": "Ew...how about a real beach house...East Hampton, Amagansett, Montauk. Or even the Keys.",
        "created_utc": 1617374946,
        "id": "gt58z0a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617403746.0
    },
    {
        "author": "banana_splote",
        "body": "It won't. \nMy guess is that $800 - $1,000 is the max. There will be intervention if it becomes too high. \n\nIf the H fund gets margin called and they can't cover, they just give the keys back and \"foock it\".\n\n(Please don't kill me for not drinking the same kool aid)",
        "created_utc": 1617489234,
        "id": "gtah0yf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617518034.0
    },
    {
        "author": "Gwanzi",
        "body": "They get confused if you tell them your car is only on it’s 15th mile because you lost the keys and never bothered to find them",
        "created_utc": 1617542430,
        "id": "gtcf3n4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617571230.0
    },
    {
        "author": "Dematsa",
        "body": "AMAT, LRCX, AMD, KLAC, TSM",
        "created_utc": 1617574171,
        "id": "gte2qpz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617602971.0
    },
    {
        "author": "ThisPomelo4",
        "body": "Your analysis is probably true for delta, but the problem with playing those names using vol is that the IV is higher. Options trading is most useful when you get the gamma cheap while also calling the direction right.\n\nI'm buying INTC 23Apr 70c because resistance at 65 has kept IV muted. My bet is that INTC will break through that resistance on 6Apr or 23Apr. I hate talking in terms of resistance in general, but looking at the long-term chart as well as price action in the morning after the Intel Unleashed event, it certainly seems like you'd need a big catalyst to justify a breakout beyond 65. I'd probably play those profits -- if any -- into AMD puts through to May, because I think hedge fund selling will take place when Lisa Su inevitably acknowledges the incorrectness of her prediction that supply \"tightness\" would clear up by 2H21.\n\nI also believe that the Archegos liquidation is another sign that correlated hedge fund losses will spell disaster for the market. We saw this already with GME and the other short-squeeze names. Chipmakers like to lay out their capex as close to production ramp-up as possible, which means that LRCX/AMAT/ASML/KLIC/KLAC/CAJ/etc won't book profits immediately even if billions of dollars are allocated to the roadmap. So I'm waiting for a big selloff this summer to get into those names as a long-term position. May try to play that selloff using hedgie favorites and names that have a lot of room to fall. ARKK, TSLA, TSM, NVDA come to mind. TSM seems counterintuitive but you get the added potential catalyst of Chinese brinkmanship as well as a deepening of the water supply woes.\n\nI mention CAJ because it gives a good read on DUV demand. Their equipment segment had a lot of profit growth last quarter. But it's not as good a play as the others because only a fifth of its revenue comes from that segment.",
        "created_utc": 1617331929,
        "id": "gt3qzmp",
        "score": 1,
        "subreddit": "options",
        "created": 1617360729.0
    }
]