[
    {
        "author": "Hacksaw171",
        "body": "2/24 Jim Cramer said to buy these 12 stocks instead of GME. Let’s see how they’re doing:\n\n                 2/24               Current\n\nAmazon - 3166.75       3067      -3.1%\n\nChipotle - 539.80        511         -5.3%\n\nTrade Desk - 790.52    726.41   -8.1%\n\nTesla -    711.45          682.55     -4.1%\n\nIntuitive Surgical - 743.73  721.04 -3.1%\n\nAlign Technology - 560.13  519.39  -7.3%\n\nNvidia - 564.91    506.98          -10.3%\n\nLam Research - 556.16    533.41  -4.1%\n\nServiceNow - 545.50    488.46   -10.5%\n\nNetflix - 539.80     508.74      -5.8%\n\nHubSpot - 505.73      467.31    -7.2%\n\nAlphabet - 2030      2023      -0.3%\n\nAll red. How about GME?\n\nGamestop - 44.70   330   +638%\n\nHmm.",
        "created_utc": 1615395574,
        "id": "gqgqu6a",
        "permalink": "/r/wallstreetbets/comments/m1xhlc/gme_megathread_for_march_10_2021/gqgqu6a/",
        "score": 83,
        "subreddit": "wallstreetbets",
        "created": 1615424374.0
    },
    {
        "author": "gb2075",
        "body": "I’ve been researching semi-conductors in depth the past few days. \n\nI’m eyeing the big retail guys like INTC, NVDA, AMD (agreed with you that AMD is the most promising).\n\nThe other segment is the fabricators, they don’t sell chips they just produce them for other companies. I’m keeping tabs on AMAT, TSM, LRCX, NXPI, FORM, UMC).\n\nThen finally the rare earth metals.. companies like MP, AMAT, VALE (I was long on these guys then they got a fucking $7B fine for killing 300 people in a dam explosion.... oops).\n\nLook into Biden’s recent executive order, not only does he address the global semiconductor shortage, but plans to bring jobs back to the states and invest in American companies. MP Materials is the only US based company REM company. \n\nThis all looks so obvious as a long term play. I forget where I read it, but the global semiconductor usage is going to 10x or something insane like that in the next 10 years.\n\nI don’t know why all of these companies are down recently, I haven’t looked into it. I bought $10 worth of every stock listed above so I could keep tabs on them. All of them have followed the same negative trajectory the last month or so. If you zoom out to 5 year though, almost every single company shows insane growth. I imagine that growth will only compound long term. Do you have any thoughts on the reason for this recent downward trend? \n\nI’m considering making a pretty massive 5-10 year long play on semiconductors.",
        "created_utc": 1614872359,
        "id": "gpnv7ia",
        "permalink": "/r/wallstreetbets/comments/lxl5ef/recent_dips_in_semiconductors_an_opening/gpnv7ia/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614901159.0
    },
    {
        "author": "mushlafa123",
        "body": "Buy an amat or lrcx weekly. When micron reports tomorrow and announced huge capex these will fly",
        "created_utc": 1617125546,
        "id": "gstmfuk",
        "permalink": "/r/wallstreetbets/comments/mgcgcy/daily_discussion_thread_for_march_30_2021/gstmfuk/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617154346.0
    },
    {
        "author": "mushlafa123",
        "body": "It's not uncommon for amat and lrcx to outperform mu  after mu earnings call. Since huge capex isn't really great for mu but is very good for their suppliers like amat and lrcx. Maybe we get some news about government chip subsidies and BOOM goes the suppliers... Wishful thinking I know but one can dream.",
        "created_utc": 1617125732,
        "id": "gstmuni",
        "permalink": "/r/wallstreetbets/comments/mgcgcy/daily_discussion_thread_for_march_30_2021/gstmuni/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617154532.0
    },
    {
        "author": "MementoMori97",
        "body": "Just put a majority into a total market etf and let it sit. Also, 1500 of your 5k in GE? 30% in a single stock is likely never a good idea, even if you think you are 100% sure on it. I don't like going over 7.5% or so on a single stock in my portfolio. Only exception to that is LRCX which has grown so much it's at 11% and I'm not selling it.\n\nIt sounds like you can't handle those big swings that you're going to get with a fund like ARKF if you're selling at a loss then buying back in higher again later. I would definitely put at a minimum 50% into ITOT, VTI, or something similar, but if you want to take more risk, it's your choice to make.",
        "created_utc": 1615340538,
        "id": "gqedo9t",
        "permalink": "/r/stocks/comments/m1m02l/eli5_what_am_i_doing_wrong_advice_plz/gqedo9t/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1615369338.0
    },
    {
        "author": "milimiri",
        "body": "You might want to remove STX, AVGO, AAPL and etc. from the list, and add ASML, LRCX, MU and etc. to the list. \n\n\nI am working in semiconductor industry but not in fabrication. Basically the most fabs have been out of game for advanced technology nodes. For example, TXN has some fabs, but they are old technology (still a descent market especially for analog chips). MU has fabs but mainly for memory (memory and logic CMOS are different in manufacting). There are also markets for power semiconductor, optical sensors and etc. For advanced SoC chips, only major players left right now are TSM and INTC. Samsung is still in the game and SMIC is trying to catch up. But basically TSM takes the majority of the market. \n\nDisclosure: I have been holding TSM for a couple of years. I personally prefer fab+fabless and I am a little bearish on US-based fab. But I am not an expert in the field.",
        "created_utc": 1615222721,
        "id": "gq88ilq",
        "permalink": "/r/investing/comments/m0cz1m/us_semiconductor_fab_companies/gq88ilq/",
        "score": 2,
        "subreddit": "investing",
        "created": 1615251521.0
    },
    {
        "author": "ArroAce",
        "body": "AMAT, LRCX, and ICHR since they make the supplies for semiconductor fabrication.",
        "created_utc": 1615247960,
        "id": "gq9ssu1",
        "permalink": "/r/stocks/comments/m0ocqu/looking_to_buy_a_semiconductor_stock_while_theyre/gq9ssu1/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1615276760.0
    },
    {
        "author": "Porsche981Fan",
        "body": "I think TSM , LAM Research and AM will all be winners of this move as most governments internationally have the same plan. And TSM is the best performing player in chip production in my humble opinion.",
        "created_utc": 1614753773,
        "id": "gpic319",
        "permalink": "/r/wallstreetbets/comments/lwlohr/amd_analysis/gpic319/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614782573.0
    },
    {
        "author": "ndlsmmr",
        "body": "TY. Second tier semis...IHRC, UTCC. First is tied to LRCX/AMAT. Big concentration by revenue, but big spending coming specifically from AMAT this year with busted Chinese acquisition.",
        "created_utc": 1617219547,
        "id": "gsy71bk",
        "permalink": "/r/stocks/comments/mhbo2r/infrastructure_stock_recommendations/gsy71bk/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1617248347.0
    },
    {
        "author": "apooroldinvestor",
        "body": "That's a tough call.  You have to think out 5 years I think or more.  I think semis will all be worth more in 5 years!  Just an uneducated guess.\n\nI am negative ASML and my TSM and LRCX are approaching break even, but NO I'm holding!!\n\nThe reason I'm negative gain is because I added them 3 months ago or less!\n\n In investing you have to be patient as BUFFET says.  I'm pretty sure I'll have a positive gain in all my semis a year or two from now.\n\nMy NVDA is at 17% gain I think.  I just added 1 share for a total basis of $475 which I'm comfortable with.   Look up the price targets of those stocks.  They're much higher in a years time.  Not guaranteed but ....",
        "created_utc": 1614891866,
        "id": "gpp5blj",
        "permalink": "/r/stocks/comments/lvx2qs/lrcx_nvda_asml_avgo_and_tsm/gpp5blj/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614920666.0
    },
    {
        "author": "filth100",
        "body": "Big fan of ASML and LRCX",
        "created_utc": 1614894876,
        "id": "gppc8j3",
        "permalink": "/r/stocks/comments/lxo7om/warren_buffets_stock_strategy_is_more_relevant/gppc8j3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614923676.0
    },
    {
        "author": "MrMortons",
        "body": "I thought boomer stocks had taken over but I see TSLA &amp; LRCX were the biggest movers today. \n\nAbsolutely no one: \n\nme: As to vaccines, OCGN (Covaxxin) will be the dose everyone gets for the next 5 years. Maybe next ten years for school kids.",
        "created_utc": 1615301606,
        "id": "gqbzjkm",
        "permalink": "/r/smallstreetbets/comments/ly7w35/daily_market_discussion_thread/gqbzjkm/",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1615330406.0
    },
    {
        "author": "thavirg",
        "body": "Thanks for adding commentary.  Mind answering a few questions I've had in this space?\n\n - What do you predict will happen with the Biden admin and Dem Congress re: semiconductor supply chain?\n\n - Aside from TSMC's superiority, are there cost-savings by being based in Taiwan?  Perhaps govt subsidies?\n\n - What are your thoughts on $LRCX, $AMAT, $ASML, and $KLAX? Any of them stand out to you as better investments?\n\n - Is there much talk of silicon photonics and photonic integrated circuits amongst your colleagues?  If so, which companies seem to be developing hardest in this area?",
        "created_utc": 1615264604,
        "id": "gqaml9d",
        "permalink": "/r/investing/comments/m0cz1m/us_semiconductor_fab_companies/gqaml9d/",
        "score": 1,
        "subreddit": "investing",
        "created": 1615293404.0
    },
    {
        "author": "apooroldinvestor",
        "body": "LOTS!  UNH LRCX NVDA SQ AAPL JPM TMO CVX",
        "created_utc": 1615265553,
        "id": "gqao1qo",
        "permalink": "/r/stocks/comments/m0yerk/theres_nothing_to_worry_about_relax/gqao1qo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615294353.0
    },
    {
        "author": "JayArlington",
        "body": "LOVE the LRCX call here.  Lam Research may not be a company many are familiar with, but if need to build semiconductor manufacturing capacity LRCX is #1 on your speeddial. \n\nI prefer CLF right now to MT on the steel side simply because I think their greater exposure to the US market means a quicker win, but MT is going to have a great year.",
        "created_utc": 1615673661,
        "id": "gqua322",
        "permalink": "/r/stocks/comments/m3xppq/favorite_companies_per_industry/gqua322/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615702461.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "Read that AMD article. Idk how I missed that. Interesting that DUV was used for that level, and makes me wonder why is Intel so far behind it TSMC is able to use it for that size. I read that LRCX made a tool to further enhance the yields of 7nm. I forgot if it's dry or wet, I think it was drying it to ensure the product stays up (based on images, I'm not a lithography engineer) so maybe we'll see it be used to enhance yields. It should already be in use in 5nm, but I don't have that info.\n\nI've read the link you posted above. They only have an agreement on previous gen tech, and even then there is a request to restrict those it seems:\n\n&gt; On Monday, the National Security Commission on Artificial Intelligence, or NSCAI, recommended that the United States coordinate with the Netherlands and Japan to deny export licenses to China for key chipmaking equipment.\n\nI'm not seeing these products in the hands of SMIC, nor there seems to be strong hope that they'll be able to fully deliver without major hurdles.",
        "created_utc": 1615757666,
        "id": "gqy3zu7",
        "permalink": "/r/SecurityAnalysis/comments/m2yq02/hongxin_chinas_billion_dollar_semiconductor/gqy3zu7/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1615786466.0
    },
    {
        "author": "Beagleoverlord33",
        "body": "Hate T the company has a terrible track record of bad acquisitions and frankly doesn’t seem to understand their own industry. It’s also loaded in debt. Imo your much better off just buying a basic index fund it’s safer and your likely to get significantly better returns. If you go the T route is make it a smaller position.\n\nIf your not feeling an index some of my favorite divided plays would be MSFT AAPL ABBV JNJ LOW AMAT/LRCX. Most of those are more dividend growth.",
        "created_utc": 1615896205,
        "id": "gr43jxi",
        "permalink": "/r/stocks/comments/m611jl/dividend_stocks_or_what_to_do_with_300k/gr43jxi/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615925005.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I like LRCX and TSM also.  Thanks though. Decided to keep them all for diversity.",
        "created_utc": 1614718015,
        "id": "gpggpfu",
        "permalink": "/r/stocks/comments/lvx2qs/lrcx_nvda_asml_avgo_and_tsm/gpggpfu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614746815.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Right.  People are dumb.  Msft and AAPL LRCX hd unp unh etc.  It's not that difficult folks!",
        "created_utc": 1616967367,
        "id": "gsme3ko",
        "permalink": "/r/stocks/comments/mf6a9g/i_save_my_entire_income_and_cant_stop_losing_money/gsme3ko/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1616996167.0
    },
    {
        "author": "thebyus1",
        "body": "Patience is key in this game. A couple years (2014ish, I think) ago I sold a house in CA for a very handsome profit. Took the money, bought a sub to Motley Fool (I know) and started buying their monthly picks $2500 at a time.  18 months later I was frustrated because I had like 2 winners, a handful of dogs and a majority of a portfolio that was decidedly down, a lot. So I sold out, and shifted everything into VTSAX. Fast forward to today, and I am literally kicking myself: I was holding MSFT at 50, SBUX at 30, MELI at 120, LRCX at 100 and a bunch of others that tripled. And they were pushing SHOP, AMZN, NFLX, and CMG and I refused to buy based on my track record with their picks. If I'd stayed the course and waited it out I would literally be retired as a multi-millionaire.\n\nAs others have said: learn from your mistakes, be patient, and seek out learning opportunities. (ThinkorSwim's faux money account is a great way to start.) This is a long game, there's no rush. The market trends to double every 9 years or so. There will always be places to make money.",
        "created_utc": 1617070769,
        "id": "gsrbbl7",
        "permalink": "/r/StockMarket/comments/mfwa2o/today_i_learned_to_not_just_buy_off_what_others/gsrbbl7/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617099569.0
    },
    {
        "author": "mushlafa123",
        "body": "Easily amat or lrcx for tomorrow",
        "created_utc": 1617138322,
        "id": "gsuej09",
        "permalink": "/r/wallstreetbets/comments/mgol98/what_are_your_moves_tomorrow_march_31_2021/gsuej09/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617167122.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "I have the website up. I'll read more on it and sub. :)\n\nFor LRCX, this is what I'm talking about: https://blog.lamresearch.com/lam-introduces-euv-lithography-technology-breakthrough/",
        "created_utc": 1615992061,
        "id": "gr8p20e",
        "permalink": "/r/SecurityAnalysis/comments/m2yq02/hongxin_chinas_billion_dollar_semiconductor/gr8p20e/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1616020861.0
    },
    {
        "author": "I_like_to_build",
        "body": "Not sure how you managed that.  I got stupid lucky and decided to buy a few calls before GME became national news.  Paid something stupid like $10 for a GME $50C when GME was trading at $35.  And bought some AMC and BB.  Then GME hit $300 something.  Not knowing what I was doing I exercised and then sold off at like $300, $290 and $270.\n\nEnded up with 30 grand and decided to make it my options play money.  Lost a good chunk on NVDA when it shit but stayed about even overall cause I was playing MU LRCX AMAT DKNG and AMC.  Because you know like silicone chips and shortages.  Figured buy the guys that make silicone chip equipment.  Atleast I think some of those stocks do that shit.  And DKNG because like sin stocks are a good hedge for market down turns or some shit.\n\nSo I didn't make money for a while.  And I also learned how those stocks move.  I also learned if when the dip comes if you don't have any cash well then you are fucked.\n\nSo I waited for most of my calls to go back green and took barely any profit but got back to my original 30k.\n\nThen I did some ground breaking shit.  I didn't buy anything until the shit dipped for a few days.  And when it did I just bought a little and kept buying all the way down.  I also started buying calls 90 to 60 days out with strikes around the most recent high.\n\nSo when MU tanked I bought it all the way down to $82.  Same thing with AMAT and LRCX.  Also KLAC which doesn't run like those.  DKNG is hella cheap now, so is UWMC, and some of the cruise stocks.\n\nSo I did that and now Friday happened.\n\nAnd now I think I'm smarter than Warren Buffet.\n\nSo now I'm going to hold this shit for way to long until it goes red and expires.\n\nAnd then I'll listen to my wife banging her boyfriend while I figure out if I have anything of value to pawn other than my mouth.",
        "created_utc": 1616902476,
        "id": "gsjojnx",
        "permalink": "/r/wallstreetbets/comments/mduic5/every_single_time_i_buy_a_call_it_expires/gsjojnx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1616931276.0
    },
    {
        "author": "Hacksaw171",
        "body": "Cramer Stonks check-in (he said to buy these instead of GME on 2/24):\n\nStonk    2/24 Open   3/30 Open    Change\n\nAmazon 3166.75    3072.8            -2.97%\n\nChipotle 1417.73     1417.                -0.05%\n\nTrade Desk 790.52   605.01           -23.47%\n\nTesla    711.45        601.92             -15.40%\n\nIntuitive Surgical 743.73  719.11     -3.31%\n\nAlign Technology 560.13 516.22.  -7.84%\n\nNvidia 564.91    512.56.                 -9.27%\n\nLam Research 556.16  565            +1.59%\n\nServiceNow 545.5  481.88           -11.66%\n\nNetflix      539.8     510.21.             -5.48%\n\nHubSpot 505.73   420.62.            -16.83%\n\nAlphabet 2030     2052.46.            +1.11%\n\nTotal      12132.41   11474.79         -5.42%\n\nTwo whole stonks green up just over 1%. Impressively terrible. Pretty sure you could fling crap at the wall and buy the stonks the corn sticks to and do better. Meanwhile:\n\nGME        44.7          187.5           +319.46%\n\nHe recently tweeted that his family and friends wish he would spend more time with them and less time studying the market. While I can’t personally imagine wanting to spend any amount of time with him, I think he could safely save everyone money by not giving any more “tips” and taking some more personal time.",
        "created_utc": 1617112062,
        "id": "gssszkc",
        "permalink": "/r/wallstreetbets/comments/mgewny/gme_megathread_for_march_30_2021/gssszkc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617140862.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Yeah but I'm already 20% in msft aapl.  Add to that nvda fb SQ pypl etc!  Yikes!!  Joking!  But I'm bout 60% tech if you include my ASML LRCX AVGO TSM",
        "created_utc": 1617159248,
        "id": "gsvi7z0",
        "permalink": "/r/stocks/comments/mgulkv/buy_3_shares_goog_am_i_nuts/gsvi7z0/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617188048.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Yeah I sort of feel the same though bout AAPL lately though  lol!  I'm in with 50 shares @ 90.\n\nI also have fb msft and nvda ASML LRCX AVGO also.  How am I looking?  I also have non tech like UNH HD TMO UNP etc.",
        "created_utc": 1617155723,
        "id": "gsvbyxc",
        "permalink": "/r/stocks/comments/mgulkv/buy_3_shares_goog_am_i_nuts/gsvbyxc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617184523.0
    },
    {
        "author": "mushlafa123",
        "body": "Amat or lrcx. Perfect storm. MU gonna report more capex tonight and Joe schmo going to announce something chip related in that 2.2t bill",
        "created_utc": 1617194137,
        "id": "gswps4e",
        "permalink": "/r/wallstreetbets/comments/mh2ryh/daily_discussion_thread_for_march_31_2021/gswps4e/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617222937.0
    },
    {
        "author": "FelWill",
        "body": "Just look at semiconductors. Buy anything from ON to LRCX you won't be dissapponted in a month",
        "created_utc": 1614889573,
        "id": "gpoztlw",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpoztlw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614918373.0
    },
    {
        "author": "snyder810",
        "body": "Personally I hold both AMAT &amp; LRCX. For other options ASML has some leading tech or you could look at KLAC",
        "created_utc": 1615337202,
        "id": "gqe7f3x",
        "permalink": "/r/stocks/comments/m1jv58/asx_vs_amkr_best_semiconductor/gqe7f3x/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615366002.0
    },
    {
        "author": "MementoMori97",
        "body": "Full disclosure: I own all of these. \n\nOnly one I would be wary about is LRCX being up so kuch the past 6 months or so. My most confident pick is MT for the next 12-24 months.",
        "created_utc": 1615604947,
        "id": "gqrhmuu",
        "permalink": "/r/stocks/comments/m3xppq/favorite_companies_per_industry/gqrhmuu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615633747.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I just invest in the companies that make chips and machines that make them.  TSM LRCX and ASML.  I have NVDA also though.  And AAPL as well.",
        "created_utc": 1615592087,
        "id": "gqqvdzv",
        "permalink": "/r/stocks/comments/m3j30i/qcom_currently_a_buy_for_long_term/gqqvdzv/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615620887.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I got soxx but I think you do better IF you pick the right ones.  In betting lrcx amat tsm right now.  Maybe I'll be right maybe wrong who knows ...",
        "created_utc": 1615436117,
        "id": "gqj6914",
        "permalink": "/r/stocks/comments/m1orcz/does_tsmc_rely_on_lrcx_amat_klac_etc/gqj6914/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615464917.0
    },
    {
        "author": "ThisPomelo4",
        "body": "Why Micron and not a different name? There's a lot of correlation in the sector. I get that it's a swing trade but why this particular instrument? You could probably look through for stuff that's dislocated and has cheaper IV.\n\nThinking longer term...\n\nI think eventually we are going to see the IDM companies outperform the fabless companies -- partially because the fabless companies have had such a massive run in the past half-decade -- but for now, there's not much dispersion.\n\nEventually, I like KLAC LRCX AMAT and ASML because I think there will be some major investment in new fab facilities (or refitting of old ones I guess). Leading edge and legacy nodes are at pretty high utilization right now, due to demand for autos, PCs, and all the other good stuff.",
        "created_utc": 1614766569,
        "id": "gpiq10g",
        "permalink": "/r/options/comments/lwl7pm/mu_analysis/gpiq10g/",
        "score": 1,
        "subreddit": "options",
        "created": 1614795369.0
    },
    {
        "author": "knowledgemule",
        "body": "Not going to really dive more past this comment because at a certain point I keep thoughts behind my semiconductor focused substack LOL.\n\n1) pat is the hometown hero. He was one of the og engineers on one of their first hit products (80486 seriously read about it, a similar crisis), so if anyone has the cultural capital to do a turnaround... it’s him. Lots of wood to chop but expectations are so low. \n\n2) I’m confused about your LRCX comment. They are clearly not the only ones making themselves useful. Multiple parts of the supply chain has to turn over, like masks, foup cleaners, all kinds of other stuff. It’s complicated and EUV is far from the only step. You should look up ALD &amp; 3D etch because that’s really what LRCX does. There’s also a Japanese mask company that’s a beneficiary of EUV\n\n3) I mean, when I last talked to ASML mgmt they def wanted to sell tools! All things being equal it really doesn’t matter to the tool companies. Most American companies want to sell tools, it’s pretty hard to figure them out. And even when they do there is a lot of lock in and installed base management. \n\n\n4) so problem is this is the tightest screw we have on them and any kind of normalization starts with selling tools / EDA again. It depends on your view on nationalism. If you’re a US citizen and don’t like China sure, if you’re a cold hearted investor I think it’s in your interest for the tool companies to sell to China. They are struggling to use the tools not even make them. I think this risk is... a bit overblown. The success in this industry is very cumulative and there are maybe 2 real tool companies in China and both are tier 2 if not 3 companies. Anyways that’s all for today.",
        "created_utc": 1615775192,
        "id": "gqz0qns",
        "permalink": "/r/SecurityAnalysis/comments/m2yq02/hongxin_chinas_billion_dollar_semiconductor/gqz0qns/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1615803992.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 16th of March\n\n\n\n## Upcoming events for Tuesday, March 16th\n\n - Expected earnings:\n\n  ABIO, ADVWW, ALSK, APG, ASPU, AYLA, BDSX, BMTX, CAL, CALA, CLPR, CNF, COUP, CRIS, CRTX, CRWD, CTRN, CUE, DBI, DFFN, DL, DLNG, DTIL, ELDN, EMAN, EOLS, ETON, FANH, FCEL, FF, FLNT, FORTY, FREE, FTK, FUSN, FUTU, GBIO, HIL, HJLI, HUGE, IDN, IMNM, IMOS, INFI, INPX, IPHA, IRCP, JBL, JILL, KIN, KIQ, KODK, KROS, LEN, LEN.B, LTBR, MICT, MOTS, NBEV, NES, NEW, NFE, NPK, NTN, NYC, OCX, ORGO, OTEL, PFMT, PLRX, PMD, PRLD, PRTH, REDU, REI, RMED, RNA, RUHN, SHSP, SMAR, SRGA, STSA, SUMR, SYNC, TLC, TOUR, TRIL, TSQ, VBFC, VEL, VFF, VIRX, VOLT, WF, WKEY, XGN, XNET, YMTX, YTEN\n\n - Ex-div:\n\n  ACCO, ALLE, ARES, BKCC, CEN, CINF, CIZN, CXE, CXH, DMB, DYFN, ESCA, FINS, FLXS, FNF, FOF, FSFG, FSK, FSKR, GAB, GDL, GDV, GGZ, GNT, GRX, GUT, GWRS, HCA, HES, HI, HMN, HOFT, ICE, ITT, IVH, KSS, LDP, LRCX, MCR, MCY, MIE, MIN, MMT, MRTN, NJR, NMFC, NWS, NWSA, OPP, OXLC, OXSQ, PGZ, PHI, PSF, PTA, RA, RE, RFM, RIV, RMI, RMM, RNP, RNST, RQI, RSF, RYN, SJI, SLGN, STFC, SWBI, TCPC, TDS, TY, UHT, UTF, UTMD, VSH, VST, WH, WU\n\n - Economic events and announcements:\n\n    - 20-Year TIPS Auction (previous: 1.920%)\n    - API Weekly Crude Oil Stock (previous: 12.792M)\n    - Business Inventories (consensus: 0.3%, previous: 0.6%)\n    - Capacity Utilization Rate (consensus: 75.5%, previous: 75.6%)\n    - Core Retail Sales (consensus: -0.1%, previous: 5.9%)\n    - Export Price Index (consensus: 0.9%, previous: 2.5%)\n    - Export Price Index (previous: 2.3%)\n    - Import Price Index (consensus: 1.2%, previous: 1.4%)\n    - Import Price Index (previous: 0.9%)\n    - Industrial Production (consensus: 0.3%, previous: 0.9%)\n    - Industrial Production (previous: -1.83%)\n    - Manufacturing Production (consensus: -0.1%, previous: 1.0%)\n    - NAHB Housing Market Index (consensus: 83, previous: 84)\n    - Redbook (previous: -18.1%)\n    - Redbook (previous: 8.0%)\n    - Retail Control (consensus: -0.9%, previous: 6.0%)\n    - Retail Inventories Ex Auto (previous: -0.2%)\n    - Retail Sales (consensus: -0.5%, previous: 5.3%)\n    - Retail Sales (previous: 7.43%)\n    - Retail Sales Ex Gas/Autos (previous: 6.1%)\n\n## Upcoming events for Wednesday, March 17th\n\n - Expected earnings:\n\n  AOUT, AP, ARCO, AXLA, CEPU, CETX, CFRX, CMCL, CRHM, CSAN, CTAS, CTIC, DPW, ELP, EPSN, ETNB, ETTX, EYEG, FIVE, FPH, FPI, GES, GEVO, GIFI, HBB, IMTX, IMV, INFU, IPWR, JCS, KC, KRKR, KRON, LE, MDRR, MLHR, MLND, NAVB, NFH, NM, NMCI, NXE, ONTF, OSMT, OVID, OXSQ, PD, PDD, PNRG, PW, QD, RCMT, RIDE, RNET, SCYX, SGBX, SID, SINA, SMTC, SNDL, SPRB, SPRT, TEO, TH, THMO, UBX, UEC, UPST, VINP, VSTM, WHLR, WLFC, WPG, WSM, WVVI, ZTO\n\n - Ex-div:\n\n  AAN, ADT, AFT, AIF, AIMC, AJX, ALEX, ARD, BANX, BBY, BPOP, CHMG, CUBA, EBSB, FSLF, GAIN, GLAD, GOOD, HBAN, HRZN, LAND, MAV, MHI, MNDO, MPW, MYE, NUW, PFLT, PHD, PHT, PNNT, SITC, SLRC, SNV, SUNS, TSM, VRS\n\n - Economic events and announcements:\n\n    - Building Permits (consensus: 1.750M, previous: 1.886M)\n    - Building Permits (previous: 10.7%)\n    - Crude Oil Imports (previous: -0.919M)\n    - Crude Oil Inventories (consensus: 2.715M, previous: 13.798M)\n    - Cushing Crude Oil Inventories (previous: 0.526M)\n    - Distillate Fuel Production (previous: 0.806M)\n    - EIA Refinery Crude Runs  (previous: 2.407M)\n    - EIA Weekly Distillates Stocks (consensus: -3.470M, previous: -5.504M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 5.1%, previous: 13.0%)\n    - FOMC Economic Projections\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision\n    - Gasoline Inventories (consensus: -3.134M, previous: -11.869M)\n    - Gasoline Production (previous: 0.704M)\n    - Heating Oil Stockpiles (previous: 0.544M)\n    - Housing Starts (consensus: 1.560M, previous: 1.580M)\n    - Housing Starts (previous: -6.0%)\n    - IEA Monthly Report\n    - Interest Rate Projection - 1st Yr (previous: 0.10)\n    - Interest Rate Projection - 2nd Yr (previous: 0.1)\n    - Interest Rate Projection - Current (previous: 0.1)\n    - Interest Rate Projection - Longer (previous: 2.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.26%)\n    - MBA Mortgage Applications (previous: -1.3%)\n    - MBA Purchase Index (previous: 289.0)\n    - Mortgage Market Index (previous: 783.8)\n    - Mortgage Refinance Index (previous: 3,658.8)\n\n## Upcoming events for Thursday, March 18th\n\n - Stock splits:\n\n    - ELPVY @ **10:1** (Payable date: 03/17/2021)\n    - ELP @ **10:1** (Payable date: 03/17/2021)\n\n - Expected earnings:\n\n  ACN, ACTG, ADCT, ADMA, AFIB, AIV, AKUS, ALPN, ALTG, ALXO, AMTI, ARMP, ASLN, ATHA, AVIR, BCOW, BLCM, BSGM, BSQR, CATO, CBMB, CBPO, CDAK, CELP, CIB, CMC, CRT, CRVS, CSIQ, CTK, CVV, CWBR, CZNC, DG, DLTH, DTIL, EFOI, ENTX, ESGC, EYES, FBRX, FDX, FMTX, FRSX, FURY, GECC, GHSI, GIII, GLMD, GOL, HEXO, HHR, HIMS, HOOK, HWCC, INZY, ITOS, JG, JOBS, KINS, LAIX, LAZR, LAZY, LEGN, LEU, LX, MAXN, MBRX, MMX, MOSY, MP, MRUS, MTCR, MTEM, MYSZ, NEN, NKE, NKSH, NKTX, NLTX, NNA, NSYS, NVGS, NVIV, OCDX, OCGN, OLLI, ORIC, PAX, PBLA, PCVX, PDSB, PESI, PFSW, PHAT, PLX, PROG, RDHL, REED, RFL, RLH, RMTI, SCHL, SCPE, SHIP, SIG, SLDB, SLRX, SMTS, SMTX, SPPI, SQFT, SQZ, STG, SVRA, SYBX, SYPR, TATT, TITN, TMBR, TOMZ, UG, UONE, UONEK, URGN, USAU, UTZ, VBLT, VIRI, VIVE, VNRX, VTRS, WB, WOOF, WRN, XTLB, YI\n\n - Ex-div:\n\n  AAP, AIN, AINV, AL, ALRS, BBSI, BIG, CB, CRH, CTS, DEX, DKS, FISI, FSS, GEF, GEF.B, HPP, IGR, MGU, MLI, MNRL, PLD, PLOW, QCRH, QTS, RBCAA, RPT, SBSW, SPR, THQ, THW, TPB, VCIF, VGR, WEYS, WMT\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.987%)\n    - 4-Week Bill Auction (previous: 0.030%)\n    - 8-Week Bill Auction (previous: 0.035%)\n    - Continuing Jobless Claims (consensus: 4,070K, previous: 4,144K)\n    - Initial Jobless Claims (consensus: 700K, previous: 712K)\n    - Jobless Claims 4-Week Avg. (previous: 759.00K)\n    - Natural Gas Storage (consensus: -73B, previous: -52B)\n    - Philadelphia Fed Manufacturing Index (consensus: 23.0, previous: 23.1)\n    - Philly Fed Business Conditions (previous: 39.5)\n    - Philly Fed CAPEX Index (previous: 25.20)\n    - Philly Fed Employment (previous: 25.3)\n    - Philly Fed New Orders (previous: 23.4)\n    - Philly Fed Prices Paid (previous: 54.40)\n    - US Leading Index (consensus: 0.3%, previous: 0.5%)\n\n## Upcoming events for Friday, March 19th\n\n - Expected earnings:\n\n  ADIL, AIM, ANAT, ATLC, ATLO, AYRO, BH.A, BHAT, BRID, CCNC, CEI, CHEK, CMPI, COMS, CVR, ENSV, ERJ, EXN, FENC, FGBI, FHTX, FSEA, FSTX, GGAL, HMG, HUSA, ITCB, LMNL, MIST, NBAC, NWLI, OLB, PCSA, PNBK, PRPO, PXS, RBCN, SJ, SPLP, STTK, TEDU, TGS, UONE, UONEK, VSTA, WTT\n\n - Ex-div:\n\n  ARDC, AVGO, CSGS, CTO, DX, FGBI, GBLI, HRC, JCI, JJSF, LAMR, NCMI, NEWT, PCF, PINE, PM, TIPT, WRE\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 4.1K)\n    - CFTC Copper speculative net positions (previous: 51.4K)\n    - CFTC Corn speculative net positions (previous: 503.4K)\n    - CFTC Crude Oil speculative net positions (previous: 537.4K)\n    - CFTC Gold speculative net positions (previous: 175.2K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -12.5K)\n    - CFTC Natural Gas speculative net positions (previous: -0.0K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 17.8K)\n    - CFTC Silver speculative net positions (previous: 36.1K)\n    - CFTC Soybeans speculative net positions (previous: 224.7K)\n    - CFTC Wheat speculative net positions (previous: 26.1K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 310)\n    - U.S. Baker Hughes Total Rig Count (previous: 403)\n\n^^^^2021-03-16",
        "created_utc": 1615888816,
        "id": "gr3uymn",
        "permalink": "/r/RobinHood/comments/m65k0l/daily_discussion_thread_march_16th_2021/gr3uymn/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1615917616.0
    },
    {
        "author": "third_legatron",
        "body": "Thank you, albemarle I Definitely could've waited but it's a good time to average down (I haven't, lithium is a bit overweight imo). Sbsw is solid moving forward, it gives slight exposure to EVs due to the precious metals they require as well as the safety net of gold, and the CEO seems to be on the right track all together. \n\nI've held many value stocks through covid and I want to get more into tech as it seems to be in correction territory. I like american semiconductor stocks because I feel it has a few catalysts to come, although I do expect the cyclical downturns and plan on averaging down on my long holds down the road. I picked up lam research and i have owned intel for a while now. I want to own nvidia, but I want to wait a bit for them.",
        "created_utc": 1616960202,
        "id": "gslzysc",
        "permalink": "/r/stocks/comments/lc61wr/value_and_speculative_plays_for_2021_and_on/gslzysc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1616989002.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I got a lot of tech! 😆 I got lrcx ASML TSM doing pretty well in those.  I also have some WMT UNH TMO UNP etc.\n\nTrying to balance out from heavy tech.  Maybe I should add to my non tech?",
        "created_utc": 1617155936,
        "id": "gsvcd3c",
        "permalink": "/r/stocks/comments/mgulkv/buy_3_shares_goog_am_i_nuts/gsvcd3c/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617184736.0
    },
    {
        "author": "bigjawnmize",
        "body": "I like ASML and LRCX both as pick and shovel plays.  I am also looking at LSCC.  Field programmable gate arrays are going to be huge.  Altera and XLNX were both recently gobbled up.",
        "created_utc": 1615251882,
        "id": "gqa00zs",
        "permalink": "/r/stocks/comments/m0ocqu/looking_to_buy_a_semiconductor_stock_while_theyre/gqa00zs/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615280682.0
    },
    {
        "author": "Motherofalleffers",
        "body": "Which tickers are you referring to that have low volume?\nI’m going down my list and all I see is above average:\nQQQ 76.87M-avg 40.18M\nAAPL 129.5M- avg 111.1M\nAMZN 4.03M- avg 3.76M\nMSFT 33.08M- avg 29.71M\nSPOT 2.42M- avg 1.629M\nLRCX 1.72M- avg 1.57M\nNVDA 12.74M- avg 7.93M\nNXPI 3.47M- avg 2.64M\nTSM 17.44M- avg 12.17M\nPYPL 12.07M- avg 9.6M\nSQ 14.25M- avg 10.56M\n\nAll well above average",
        "created_utc": 1615345520,
        "id": "gqemvsp",
        "permalink": "/r/stocks/comments/m1de6g/so_the_question_is_bull_trap_or_actual_reversal/gqemvsp/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615374320.0
    },
    {
        "author": "FelWill",
        "body": "Yes and ASML and LRCX and AMAT",
        "created_utc": 1615356006,
        "id": "gqf31z5",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqf31z5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615384806.0
    },
    {
        "author": "apooroldinvestor",
        "body": "You have to pick good companies like MSFT AAPL PYPL GOOG UNH TMO JNJ LRCX NVDA etc.\n\nIf these companies go down 50% and NEVER recover, we're screwed anyways.",
        "created_utc": 1615257806,
        "id": "gqaatvu",
        "permalink": "/r/stocks/comments/m0ohdg/whats_the_reason_that_tech_is_just_taking_a/gqaatvu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615286606.0
    },
    {
        "author": "I_like_to_build",
        "body": "After this correction earlier this week, so much awesome opportunity!  $MU in the low 80's, $AMAT sub $110, crazy discounts on $LRCX...  buying that shit at the top of the market is for suckered.  Hell $NVDA was below $500.  I bought the fuck out of calls on all of those.  Just paid the premium for July expirys, but unless the world ends that shits gold.",
        "created_utc": 1615601502,
        "id": "gqrbql3",
        "permalink": "/r/wallstreetbets/comments/m3ns7b/i_turned_1k_into_87k_with_logi_using_sell_and/gqrbql3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615630302.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "Good stuff. Good news for my ASML stock, but I'm surprised that they're not being blocked. I'll read more on this.\n\nDidn't TSMC use EUV for 7nm? EUV is specifically stated for 7nm and below, but DUB for 10nm+ I haven't seen anything about DUV doing 7nm at TSMC.\n\nEither way, it's previous gen. Idk what Intel is doing because they don't really delve into it too much. ASML publishes videos and presentations discussing in detail how EUV and their machines work. Even LRCX does that. Haven't seen as much detail with Intel or TSMC, but maybe I'll look deeper later.",
        "created_utc": 1615680577,
        "id": "gqum53h",
        "permalink": "/r/SecurityAnalysis/comments/m2yq02/hongxin_chinas_billion_dollar_semiconductor/gqum53h/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1615709377.0
    },
    {
        "author": "apooroldinvestor",
        "body": "AAPL MSFT LRCX etc",
        "created_utc": 1615747824,
        "id": "gqxddnr",
        "permalink": "/r/stocks/comments/m4uv8i/wall_street_week_ahead_for_the_trading_week/gqxddnr/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615776624.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "I agree. I've been following Intel for a while and used some of their products. They have a leadership/culture issue. Idk how the new CEO is supposed to fix that, it's not easy to innovate in this space and they waited to be cornered to decide to innovate.\n\nYes, that. Interesting. I bought LRCX because they're the only ones who made themselves useful in EUV. I looked at others and didn't find them offering anything there. Do you know otherwise?\n\nI didn't see anything from Europe/ASML that's indicating they're unhappy with not being able to sell to China, but I also know Europe as a whole seems to be okay with that and buying too. A few years ago there was a massive selling of German companies to Chinese owners to move manufacturing there. I think if it wasn't for having a massive backlog at ASML they'd have been unhappy, but they don't have any shortage of customers and are barely keeping up.\n\nI completely understand, but giving the tools is the start for them to understand it, I'm not saying they do now. If it was Russia I'd say okay we got time. They don't have that expertise. China has some of that expertise though and are hell bent on being fully independent in this field. We're definitely years ahead, but that won't be forever.",
        "created_utc": 1615772519,
        "id": "gqyw7gd",
        "permalink": "/r/SecurityAnalysis/comments/m2yq02/hongxin_chinas_billion_dollar_semiconductor/gqyw7gd/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1615801319.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 15th of March\n\n\n\n## Upcoming events for Monday, March 15th\n\n - Stock splits:\n\n    - LEE @ **1:10**\n    - RDEXF @ **1:10**\n    - VRNS @ **3:1** (Payable date: 03/12/2021)\n\n - Expected earnings:\n\n  ABEO, ACEL, ACRX, AESE, AGEN, AGLE, AKRO, ALAC, AMPH, AMR, ANIX, ANNX, ARCE, ASLE, ATNF, AUVI, AVEO, AVRO, AXAS, AZRX, BEKE, BPT, CASI, CINR, CMCT, CODA, CPRX, CRBP, CRMD, CRNX, CWCO, DM, EBIX, EML, ENZ, FBIO, FENG, FTEK, GALT, GBOX, GEN, GOED, GRIL, GRNQ, GTT, HCDI, HFFG, HPK, HQY, HTBX, ISUN, JAN, JOBS, JVA, KDNY, LFT, LOGC, LOTZ, MBIO, MDWT, MHLD, MNTX, MOR, MTNB, NETE, NMM, NMTR, NOAH, NRP, OCC, PAND, PANL, PAR, PBT, PME, POLA, PROG, PRT, PVL, QFIN, RDI, RESN, SBR, SESN, SHLS, SIC, SJT, SNES, SRAX, SRT, STRO, STRS, SVVC, TAIT, TDAC, TG, TLMD, TRCH, TRVI, TZOO, UAMY, UAVS, UCL, USAS, UUUU, VCNX, VRME, VUZI, WPRT, XBIT, YALA, YY, ZDGE, ZEPP, ZNTL\n\n - Ex-div:\n\n  AGM, AIG, AVNT, BGCP, CRAI, ECL, ESSA, ETN, EVC, FCAP, FFIN, FRT, GBL, HRB, KAMN, LPLA, MCN, MRCC, MTEX, OLED, PSA, PSB, ROST, SHOO, SOR, SPOK, SWCH, TMO, TROW, XFLT, XPER\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.045%)\n    - 6-Month Bill Auction (previous: 0.060%)\n    - Investing.com Gold Index (actual: 57.6%, previous: 55.9%)\n    - Investing.com S&amp;P 500 Index (actual: 46.8%, previous: 57.4%)\n    - NY Empire State Manufacturing Index (consensus: 14.50, previous: 12.10)\n    - Overall Net Capital Flow (previous: -0.60B)\n    - TIC Net Long-Term Transactions (previous: 121.0B)\n    - TIC Net Long-Term Transactions including Swaps (previous: 76.20B)\n    - US Foreign Buying, T-bonds (previous: -20.70B)\n\n## Upcoming events for Tuesday, March 16th\n\n - Expected earnings:\n\n  ABIO, ADVWW, ALSK, APG, ASPU, AYLA, BDSX, BMTX, CAL, CALA, CNF, COUP, CRESY, CRIS, CRTX, CRWD, CTRN, CUE, DBI, DFFN, DL, DTIL, ELDN, EMAN, EOLS, ETON, FANH, FCEL, FF, FLNT, FORTY, FREE, FTK, FUSN, FUTU, GBIO, HIL, HJLI, HUGE, IDN, IMNM, IMOS, INFI, INPX, IPHA, IRCP, JBL, JILL, KIN, KIQ, KODK, KROS, LEN, LEN.B, LTBR, MICT, MOTS, NBEV, NES, NEW, NFE, NPK, NTN, NYC, OCX, ORGO, OTEL, PFMT, PLRX, PMD, PRLD, PRTH, REDU, REI, RMED, RNA, RUHN, SHSP, SMAR, SRGA, STSA, SUMR, SYNC, TLC, TOUR, TRIL, TSQ, VBFC, VEL, VFF, VIRX, VOLT, WF, WKEY, XGN, XNET, YMTX, YTEN\n\n - Ex-div:\n\n  ACCO, ALLE, ARES, BKCC, CEN, CINF, CIZN, CXE, CXH, DMB, DYFN, ESCA, FINS, FLXS, FNF, FOF, FSFG, FSK, FSKR, GAB, GDL, GDV, GGZ, GNT, GRX, GUT, GWRS, HCA, HES, HI, HMN, HOFT, ICE, ITT, IVH, KSS, LDP, LRCX, MCR, MCY, MIE, MIN, MMT, MRTN, NJR, NMFC, NWS, NWSA, OPP, OXLC, OXSQ, PGZ, PHI, PSF, PTA, RA, RE, RFM, RIV, RMI, RMM, RNP, RNST, RQI, RSF, RYN, SJI, SLGN, STFC, SWBI, TCPC, TDS, TY, UHT, UTF, UTMD, VSH, VST, WH, WU\n\n - Economic events and announcements:\n\n    - 20-Year TIPS Auction (previous: 1.920%)\n    - API Weekly Crude Oil Stock (previous: 12.792M)\n    - Business Inventories (consensus: 0.3%, previous: 0.6%)\n    - Capacity Utilization Rate (consensus: 75.6%, previous: 75.6%)\n    - Core Retail Sales (consensus: -0.1%, previous: 5.9%)\n    - Export Price Index (consensus: 1.0%, previous: 2.5%)\n    - Import Price Index (consensus: 1.2%, previous: 1.4%)\n    - Industrial Production (consensus: 0.4%, previous: 0.9%)\n    - Industrial Production (previous: -1.83%)\n    - Manufacturing Production (consensus: 0.2%, previous: 1.0%)\n    - NAHB Housing Market Index (consensus: 83, previous: 84)\n    - Redbook (previous: -18.1%)\n    - Redbook (previous: 8.0%)\n    - Retail Control (consensus: -1.1%, previous: 6.0%)\n    - Retail Inventories Ex Auto (previous: -0.2%)\n    - Retail Sales (consensus: -0.6%, previous: 5.3%)\n    - Retail Sales (previous: 7.43%)\n    - Retail Sales Ex Gas/Autos (previous: 6.1%)\n\n## Upcoming events for Wednesday, March 17th\n\n - Expected earnings:\n\n  AOUT, AP, ARCO, AXLA, CETX, CFRX, CMCL, CSAN, CTAS, DPW, EPSN, ETNB, EYEG, FIVE, FPH, FPI, GES, GEVO, GIFI, HBB, IMTX, IMV, INFU, IPWR, KC, KERN, KRON, LE, MDRR, MLHR, NFH, NM, NMCI, ONTF, OSMT, OXSQ, PD, PNRG, PW, QD, RCMT, RDHL, RIDE, RNET, SGBX, SID, SINA, SMTC, SNDL, SPRB, SPRT, TEO, THMO, UPST, VINP, WHLR, WPG, WSM, ZTO\n\n - Ex-div:\n\n  AAN, ADT, AFT, AIF, AIMC, AJX, ALEX, ARD, BANX, BBY, BPOP, CHMG, CUBA, EBSB, FSLF, GAIN, GLAD, GOOD, HBAN, HRZN, LAND, MAV, MHI, MNDO, MPW, MYE, NUW, PFLT, PHD, PHT, PNNT, SITC, SLRC, SNV, SUNS, TSM, VRS\n\n - Economic events and announcements:\n\n    - Building Permits (consensus: 1.750M, previous: 1.886M)\n    - Building Permits (previous: 10.7%)\n    - Crude Oil Imports (previous: -0.919M)\n    - Crude Oil Inventories (consensus: 0.816M, previous: 13.798M)\n    - Cushing Crude Oil Inventories (previous: 0.526M)\n    - Distillate Fuel Production (previous: 0.806M)\n    - EIA Refinery Crude Runs  (previous: 2.407M)\n    - EIA Weekly Distillates Stocks (previous: -5.504M)\n    - EIA Weekly Refinery Utilization Rates (previous: 13.0%)\n    - FOMC Economic Projections\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision\n    - Gasoline Inventories (consensus: -3.467M, previous: -11.869M)\n    - Gasoline Production (previous: 0.704M)\n    - Heating Oil Stockpiles (previous: 0.544M)\n    - Housing Starts (consensus: 1.565M, previous: 1.580M)\n    - Housing Starts (previous: -6.0%)\n    - IEA Monthly Report\n    - Interest Rate Projection - 1st Yr (previous: 0.10)\n    - Interest Rate Projection - 2nd Yr (previous: 0.1)\n    - Interest Rate Projection - Current (previous: 0.1)\n    - Interest Rate Projection - Longer (previous: 2.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.26%)\n    - MBA Mortgage Applications (previous: -1.3%)\n    - MBA Purchase Index (previous: 289.0)\n    - Mortgage Market Index (previous: 783.8)\n    - Mortgage Refinance Index (previous: 3,658.8)\n\n## Upcoming events for Thursday, March 18th\n\n - Stock splits:\n\n    - ELPVY @ **10:1** (Payable date: 03/17/2021)\n    - ELP @ **10:1** (Payable date: 03/17/2021)\n\n - Expected earnings:\n\n  ACN, ADCT, AFIB, AIV, AKUS, ALTG, ALXO, AMTI, ARMP, ASLN, ATHA, BCOW, BSGM, BSQR, CATO, CBMB, CDAK, CELP, CIB, CMC, CRVS, CSIQ, CVV, CZNC, DG, DLTH, DOYU, EFOI, ESGC, EYES, FBRX, FDX, FMTX, FURY, GECC, GHSI, GIII, GOL, HEXO, HHR, HIMS, HOOK, INZY, ITOS, JG, KBNT, KINS, LAZR, LAZY, LEGN, MAXN, MBRX, MMX, MOSY, MP, MTCR, MTL, MYSZ, NKE, NKSH, NKTX, NNA, NSYS, NVGS, NVIV, OBLN, OCDX, OLLI, ORIC, PAX, PBLA, PCVX, PDSB, PESI, PHAT, RFL, RLH, SCHL, SCPE, SHIP, SIG, SMTS, SPPI, SQFT, STG, SYPR, TATT, TITN, TMBR, TOMZ, UG, UTZ, VBLT, VIVE, VNRX, VTRS, WB, WOOF, WRN, YI\n\n - Ex-div:\n\n  AAP, AIN, AINV, AL, ALRS, BBSI, BIG, CB, CRH, CTS, DEX, DKS, FISI, FSS, GEF, GEF.B, HPP, IGR, MGU, MLI, MNRL, PLD, PLOW, QCRH, QTS, RBCAA, RPT, SBSW, SPR, THQ, THW, TPB, VCIF, VGR, WEYS, WMT\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.987%)\n    - 4-Week Bill Auction (previous: 0.030%)\n    - 8-Week Bill Auction (previous: 0.035%)\n    - Continuing Jobless Claims (consensus: 4,220K, previous: 4,144K)\n    - Initial Jobless Claims (consensus: 705K, previous: 712K)\n    - Jobless Claims 4-Week Avg. (previous: 759.00K)\n    - Natural Gas Storage (consensus: -73B, previous: -52B)\n    - Philadelphia Fed Manufacturing Index (consensus: 23.1, previous: 23.1)\n    - Philly Fed Business Conditions (previous: 39.5)\n    - Philly Fed CAPEX Index (previous: 25.20)\n    - Philly Fed Employment (previous: 25.3)\n    - Philly Fed New Orders (previous: 23.4)\n    - Philly Fed Prices Paid (previous: 54.40)\n    - US Leading Index (consensus: 0.4%, previous: 0.5%)\n\n^^^^2021-03-15",
        "created_utc": 1615802418,
        "id": "gqzxch1",
        "permalink": "/r/RobinHood/comments/m5hbie/daily_discussion_thread_march_15th_2021/gqzxch1/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1615831218.0
    },
    {
        "author": "Actual-Ad-7209",
        "body": "Which is why I'm buying LRCX, AMAT and ASML. \n\nNo matter which company will run the fabs, they need semi-equipment.",
        "created_utc": 1615750181,
        "id": "gqxju1d",
        "permalink": "/r/stocks/comments/m4zabk/my_take_on_semiconductors_tsmc_dd/gqxju1d/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615778981.0
    },
    {
        "author": "FelWill",
        "body": "Tsm, asml, amat, lrcx",
        "created_utc": 1615328106,
        "id": "gqdpgeb",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqdpgeb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615356906.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Not all tech!  AAPL and MSFT LRCX ASML etc are good companies.  You have to know WHAT to invest in.  Not tsla!!!",
        "created_utc": 1616967286,
        "id": "gsmdxx6",
        "permalink": "/r/stocks/comments/mf6a9g/i_save_my_entire_income_and_cant_stop_losing_money/gsmdxx6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1616996086.0
    },
    {
        "author": "Hacksaw171",
        "body": "2/24 Cramer said to buy these 12 stocks instead of GME, updated the list this morning. Last time ALL 12 of his picks were red. A little improvement this time with 2 now green, overall down 4.6% (on mobile sorry if it looks like garbage)\n\nStonk          2/24 Open       3/29 Open        Change\n\nAmazon    3166.75            3055.98            -3.40%\n\nChipotle        1417.73        1437.13               +1.40%\n\nTrade Desk    790.52       668.04               -15.50%\n\nTesla           711.45          615.41.                -13.50%\n\nIntuitive Surg. 743.73     729.45              -1.90%\n\nAlign Tech.   560.13        523.19.             -6.60%\n\nNvidia         564.91           512                  -9.40%\n\nLam Research 556.16     578.23              +4%\n\nServiceNow     545.5     490.58.          -10.10%\n\nNetflix            539.8      505.83            -6.30%\n\nHubSpot      505.73     440.13           -19.70%\n\nAlphabet      2030      2022.34           -0.30%\n\nTotal       12132.41.     11578.31          -4.57%\n\n\nGME       44.7              181                 +305%",
        "created_utc": 1617026632,
        "id": "gsosdle",
        "permalink": "/r/wallstreetbets/comments/mfoivk/gme_megathread_for_march_29_2021/gsosdle/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617055432.0
    },
    {
        "author": "patright333",
        "body": "Still on the LRCX train...",
        "created_utc": 1617217338,
        "id": "gsy28fj",
        "permalink": "/r/wallstreetbets/comments/mh2ryh/daily_discussion_thread_for_march_31_2021/gsy28fj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617246138.0
    },
    {
        "author": "ThisPomelo4",
        "body": "I think the names of interest are the ones that would benefit from an outlay of semiconductor capital expenditure that focuses more on the United States: INTC, LRCX, ASML, KLAC, AMAT.\n\nJust my opinion. I have \"AMD 70\" written on my whiteboard as an entry trigger.",
        "created_utc": 1615565549,
        "id": "gqpb98o",
        "permalink": "/r/options/comments/m2yih9/would_you_buy_puts_today/gqpb98o/",
        "score": 1,
        "subreddit": "options",
        "created": 1615594349.0
    },
    {
        "author": "MementoMori97",
        "body": "LRCX - Semiconductors \n\nMT - Steel\n\nRAD - Pharmacies",
        "created_utc": 1615604833,
        "id": "gqrhfvf",
        "permalink": "/r/stocks/comments/m3xppq/favorite_companies_per_industry/gqrhfvf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615633633.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I don't see anything wrong.  I would add UNH LRCX TSM WMT and start an sp500 index in there like VOO.",
        "created_utc": 1615166796,
        "id": "gq5vukf",
        "permalink": "/r/stocks/comments/lzspkk/long_term_investor/gq5vukf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615195596.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Msft aapl hd tmo unp UNH sq pypl tsm lrcx ASML NVDA dg.  Don't sell .... Just hold for 10 years.",
        "created_utc": 1616880652,
        "id": "gsig028",
        "permalink": "/r/stocks/comments/me8kb3/5_considerations_when_picking_stocks_for_longterm/gsig028/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1616909452.0
    },
    {
        "author": "knowledgemule",
        "body": "mule.substack.com is my paid newsletter. I'm pausing subscriptions / posting since I'm about to do a hiatus.\n\n1) I mean if you read about their botchup w/ the ix3 or whatever that was supposed to succeed x86 - it was a pivotal if not one of the most defining moments in the companies history. Now who knows what he will do but clearly he was a key person in crisis in the past - and is likely another great one for the future.\n\n2) I really don't follow you on this. I think you are lacking in understanding as to what LRCX does? They are etch..... another completely separate step than lithography. While they are making a step that is going to be dry etch paired w/ EUV - its a separate step altogether.\n\n3/4) - sure",
        "created_utc": 1615991378,
        "id": "gr8no1f",
        "permalink": "/r/SecurityAnalysis/comments/m2yq02/hongxin_chinas_billion_dollar_semiconductor/gr8no1f/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1616020178.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Msft aapl sq pypl unp unh nvda hd crwd fskax pypl tsm lrcx tmo jpm.  Down 10%.  Not worried.",
        "created_utc": 1617083652,
        "id": "gsrugmv",
        "permalink": "/r/stocks/comments/mfxzyn/dont_stress_about_red_days_your_portfolio_being/gsrugmv/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617112452.0
    },
    {
        "author": "mushlafa123",
        "body": "Good gains in amat. Chip shortages means companies who build chips need to increase their capex dollars which go to amat and lrcx.\n\nSpeaking of. Free money machine starts tomorrow when micron reports and guides to increasing capex so buy amat or lrcx to benefit",
        "created_utc": 1617138045,
        "id": "gsudybg",
        "permalink": "/r/wallstreetbets/comments/mgcgcy/daily_discussion_thread_for_march_30_2021/gsudybg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617166845.0
    },
    {
        "author": "nuttygains",
        "body": "The oracle just posted. He is up $40,000,000 on this play after his epic double down.. what a legend",
        "created_utc": 1615241305,
        "id": "gq9fnrn",
        "permalink": "/r/wallstreetbets/comments/m0qjln/1_year_today_the_oracle_of_wsb/gq9fnrn/",
        "score": 223,
        "subreddit": "wallstreetbets",
        "created": 1615270105.0
    },
    {
        "author": "OGColorado",
        "body": "I knew an oracle would appear😜",
        "created_utc": 1614736886,
        "id": "gphjsbm",
        "permalink": "/r/wallstreetbets/comments/lwceqz/small_gains_compared_to_some_but_my_first_big_win/gphjsbm/",
        "score": 71,
        "subreddit": "wallstreetbets",
        "created": 1614765686.0
    },
    {
        "author": "jsntx",
        "body": "A few things to consider: the lockup expired on the 18th, but that meant that the shares could be made available for distribution at the investors' accounts. It would have taken 5-7 days (according to another DD) for the shares to be sellable. \n\nSoros promised to divest their 18.5M shares (as of Jan) on principle. Those should be hitting the market by now. \n\nThe tech selloff has also contributed to keeping PLTR depressed. Cathie, however, has been gobbling up the shares at every dip. \n\nFinally, unless you are an insider and know more than the rest of us, Palantir's software claims are pretty standard for enterprise software. Microsoft, Salesforce, SAP, Oracle, Siemens, etc., make those claims regularly. I don't think Palantir is special but they do have momentum and high profile clients. \n\nOverall I think PLTR is getting ready to take off, but they might find some resistance along the way. I'm in.",
        "created_utc": 1614820606,
        "id": "gploiwe",
        "permalink": "/r/wallstreetbets/comments/lx7i43/palantir_is_undervalued_and_is_time_for_it_to/gploiwe/",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1614849406.0
    },
    {
        "author": "bjt777",
        "body": "I have experience in setting up Snowflake in a Fortune 100 company. And I have also worked on Google Bigquery, AWS Redshift, and Azure DWH in the past. Here are my thoughts on its potentials.\n\n1. Snowflake is a way better product than Bigquery, Redshift, or Azure DWH. It automatically handles all legal database SQL syntax(Oracle, SQL Server, etc.). So data migration from the legacy database is less complex with a minimum learning curve. This is true not just for developers but for all the end-users like Analysts.   \n\n2. Multi-Cloud: It can be hosted in AWS, GCP, or  Azure. This might sound irrelevant. Here is why it's important. Let's say a company started using Bigquery because Google is the preferred partner. After a couple of years, things have changed, and the company decided to make Azure the company's preferred Cloud vendor. Now it's not that easy to migrate your Data warehouse from Bigquery to Azure DHW. With Snowflake, you are not tied up to a particular vendor. The point here is Snowflake gives flexibility, and enterprise companies love this flexibility. \n\n3. Snowflake integration is pretty neat. It integrates with GCS, AWS S3, etc., and with other APIs natively.  Sample use case. Running an ML model(API) on top of Snowflake data using SQL. You don't need to be an ML expert to run a model. Anyone with basic SQL can do this.  This is one example, Applications are endless.\n\n4. Data sharing and Data marketplace. They are building a data catalog complemented by the data sharing feature—essentially data as a service. More data demand -&gt; More data listed in catalog -&gt;  Network effect growth through sharing-&gt; Customer exponential growth-&gt;More money. I believe this will be huge, which is the main reason I'm bullish on Snowflake. Because snowflake supports multi-cloud,  it's not easy for other companies like Google/AWS to replicate this.\n\n5. Snowflake Customer retention is really high, and I strongly believe this will continue to remain so. Most of Snowflake's customers are Enterprises.  In my experience, companies switch or change databases for 3 main reasons. 1. Scaling or maintenance issue 2. License or hardware end of life or no longer supports 3—cost savings. Snowflake is highly scalable and utilizes cloud infrastructure with zero maintenance. So issues 1 and 2 do not exist. For the cost, it is charged per usage. It's way cheaper than any other legacy database like Oracle, HANA, etc. Basically, once an enterprise adopts Snowflake as their data warehouse, I don't see any reason for switching unless something terrible goes wrong.  Many companies still bear Oracle because of the complexity and cost of migration even though they really want to.\n\n6. They have some unique features. One that stands out for me is the feature called Time travel. ( Read about it https://docs.snowflake.com/en/user-guide/data-time-travel.html. This is mind-blowing. They also have the ability to create, schedule, run data pipelines without the need for any ELT/ETL tools. ( Including setting up dependencies). For enterprise companies, this may not be valid but definitely useful for startups.",
        "created_utc": 1614822314,
        "id": "gplrumx",
        "permalink": "/r/investing/comments/lx4ian/snowflake_eps_misses_by_026_beats_on_revenue/gplrumx/",
        "score": 37,
        "subreddit": "investing",
        "created": 1614851114.0
    },
    {
        "author": "God_BBS",
        "body": "I went to take a nap yesterday before it started rising... I'm taking a nap now. Buy if you want to. If this works I'm gonna feel like a fucking oracle.",
        "created_utc": 1614790962,
        "id": "gpjwb7k",
        "permalink": "/r/wallstreetbets/comments/lwtgh5/rkt_megathread_for_march_3rd_2021/gpjwb7k/",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614819762.0
    },
    {
        "author": "autismogranturismo",
        "body": "Just hold you damn dirty apes! The end game is near! DFV is a mythical oracle and holds the April calls. The man has had more discipline than a fucking Jedi knight through this whole thing! This is the way! 💎🙌🚀🚀🚀🚀",
        "created_utc": 1617128734,
        "id": "gstthu9",
        "permalink": "/r/wallstreetbets/comments/mgewny/gme_megathread_for_march_30_2021/gstthu9/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1617157534.0
    },
    {
        "author": "andrewsucks",
        "body": "DFV telling yall to stop looking to him as an oracle, he just likes the stock.",
        "created_utc": 1615906801,
        "id": "gr4n8zv",
        "permalink": "/r/wallstreetbets/comments/m67ywm/gme_megathread_for_march_16_2021/gr4n8zv/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1615935601.0
    },
    {
        "author": "Dmoan",
        "body": "Let’s all laugh at the boomers who dumped tech stocks for Oracle and GE.",
        "created_utc": 1615499855,
        "id": "gqmf5um",
        "permalink": "/r/wallstreetbets/comments/m30mij/what_are_your_moves_tomorrow_march_12_2021/gqmf5um/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615528655.0
    },
    {
        "author": "ShaidarHaran2",
        "body": "The Oracle of Brockton",
        "created_utc": 1615243387,
        "id": "gq9k0lf",
        "permalink": "/r/wallstreetbets/comments/m0qjln/1_year_today_the_oracle_of_wsb/gq9k0lf/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615272187.0
    },
    {
        "author": "whatwhatj",
        "body": "let me ask the fucking oracle",
        "created_utc": 1614720412,
        "id": "gpgme6q",
        "permalink": "/r/wallstreetbets/comments/lw6hoh/rkt_megathread_for_march_2nd_2021/gpgme6q/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1614749212.0
    },
    {
        "author": "imurvariance",
        "body": "Do NOT paper hands your tiny profits... it’s happening, just as the Oracle predicted...",
        "created_utc": 1615220106,
        "id": "gq829u8",
        "permalink": "/r/wallstreetbets/comments/m0fpgd/gme_megathread_for_march_08_2021/gq829u8/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615248906.0
    },
    {
        "author": "StartFast1",
        "body": "in the words of the Oracle from Omaha, trading is money changing hands from the impatient to the patient ones. To all my fella apps, come back to GME, be patient!!! Together we strong!",
        "created_utc": 1614786098,
        "id": "gpjkzxs",
        "permalink": "/r/wallstreetbets/comments/lwtejk/gme_megathread_for_march_3rd_2021/gpjkzxs/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1614814898.0
    },
    {
        "author": "ceskanda",
        "body": "This morning, I literally posted that us tech/chadsdaq bros we were all too excited pre market and that we would be crying after the bond auction. In typical retard fashion, I ignored my own comments/analysis and decided to buy SNOW 3/12 235C (down 35%) and Oracle FDs (will be 0 tmrw). Love you fuckers.",
        "created_utc": 1615419075,
        "id": "gqiataw",
        "permalink": "/r/wallstreetbets/comments/m28d30/what_are_your_moves_tomorrow_march_11_2021/gqiataw/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615447875.0
    },
    {
        "author": "UsernameTaken_123",
        "body": "Burry was right once and now thinks he's a fucking Oracle\n\nI bet he's a pain in the ass to be around",
        "created_utc": 1615590505,
        "id": "gqqshq6",
        "permalink": "/r/wallstreetbets/comments/m3r158/weekend_discussion_thread_for_the_weekend_of/gqqshq6/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615619305.0
    },
    {
        "author": "Boss1010",
        "body": "My move tomorrow is to short the boomer stock Oracle to send a message",
        "created_utc": 1615431179,
        "id": "gqixsz1",
        "permalink": "/r/wallstreetbets/comments/m28d30/what_are_your_moves_tomorrow_march_11_2021/gqixsz1/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615459979.0
    },
    {
        "author": "Boss1010",
        "body": "If you tards want to make money tomorrow, buy puts on Oracle. Overvalued with trash guidance",
        "created_utc": 1615431331,
        "id": "gqiy31j",
        "permalink": "/r/wallstreetbets/comments/m28d30/what_are_your_moves_tomorrow_march_11_2021/gqiy31j/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615460131.0
    },
    {
        "author": "No-Heart4574",
        "body": "Yo if thou Oracle Ryan C-dawg is saying he's about to shit all over the hedges this is going to be legendary",
        "created_utc": 1615502333,
        "id": "gqmkdzf",
        "permalink": "/r/wallstreetbets/comments/m2uy4f/gme_megathread_part_2_for_march_11_2021/gqmkdzf/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615531133.0
    },
    {
        "author": "JayLearn",
        "body": "Hey oracle, if you are so sure it’s a wonderful opportunity to spend all savings to by puts and you will be a billionaire in a year or so. Either you have the balls to do that or STFU.",
        "created_utc": 1617049932,
        "id": "gsq6y69",
        "permalink": "/r/stocks/comments/mflod9/rstocks_daily_discussion_monday_mar_29_2021/gsq6y69/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1617078732.0
    },
    {
        "author": "PorkchopSquats",
        "body": "I just farted and it smelled like chicken nuggets.  Taking it as a sign that we about to start shitting tendies today friends, the oracle has spoken.",
        "created_utc": 1614861803,
        "id": "gpnasmq",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpnasmq/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614890603.0
    },
    {
        "author": "FelixJuggl3r",
        "body": "My god boomer tech stock ORCL is making me money. I will go through earnings with it and inevitably lose the gains like a good retard.",
        "created_utc": 1615316654,
        "id": "gqczvg2",
        "permalink": "/r/wallstreetbets/comments/m144ua/daily_discussion_thread_for_march_09_2021/gqczvg2/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615345454.0
    },
    {
        "author": "TheIncredibleNurse",
        "body": "Will we close at 5% gain like Oracle Market Watch predicted this morning.",
        "created_utc": 1617132370,
        "id": "gsu1l48",
        "permalink": "/r/wallstreetbets/comments/mgewny/gme_megathread_for_march_30_2021/gsu1l48/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1617161170.0
    },
    {
        "author": "SagaDoto",
        "body": "Well, you are right in some way, that none of us is oracle and you should make decisions for yourself. Thats just my point of view and as I learned from Matrix and Transformers 2, Matrix is real and you produce your reality, so 40 by the end of the week! ![gif](emote|free_emotes_pack|table_flip)",
        "created_utc": 1614852917,
        "id": "gpn04jy",
        "permalink": "/r/wallstreetbets/comments/lxgry2/rkt_current_dd/gpn04jy/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614881717.0
    },
    {
        "author": "NrdRage",
        "body": "I'm not allowed to trade $ORCL because of a conflict of interest involving my VC, but...y'all should definitely type ORCL into your trading platform of choice, do the appropriate DD, and make a decision about $ORCL",
        "created_utc": 1615484459,
        "id": "gqlfx1e",
        "permalink": "/r/wallstreetbets/comments/m2not4/daily_discussion_thread_for_march_11_2021/gqlfx1e/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615513259.0
    },
    {
        "author": "Strongest-There-Is",
        "body": "Goddamnit! How the fuck do you guys keep doing this? GME, AMC, now RKT... is there an Oracle somewhere dropping prophecy to a select few Apes via Reddit DMs?",
        "created_utc": 1614721358,
        "id": "gpgok29",
        "permalink": "/r/wallstreetbets/comments/lwd3b0/rkt/gpgok29/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614750158.0
    },
    {
        "author": "Hard_on_Collider",
        "body": "Lol which ones, you're like a reverse oracle",
        "created_utc": 1614860974,
        "id": "gpn9lph",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpn9lph/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614889774.0
    },
    {
        "author": "YouAreAPyrate",
        "body": "I'm just here for the flair oracle from Promontorium Archerusia.",
        "created_utc": 1615317633,
        "id": "gqd21gp",
        "permalink": "/r/wallstreetbets/comments/m1cqod/why_im_selling_gme/gqd21gp/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615346433.0
    },
    {
        "author": "Vyruz2",
        "body": "For anyone who cares, theirs a rumor ORCL is pulling a TSLA today and announcing they bought shit-corn. Larry Ellison is on ORCL and TSLAs C-Suite. Earnings is today AH",
        "created_utc": 1615391309,
        "id": "gqgfylx",
        "permalink": "/r/wallstreetbets/comments/m1v1e6/daily_discussion_thread_for_march_10_2021/gqgfylx/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615420109.0
    },
    {
        "author": "littlegreenfern",
        "body": "Can someone tell me how ORCL beats expectations and is doing a buyback and increasing dividends but the price tanks?!  Wtf?!",
        "created_utc": 1615433098,
        "id": "gqj196b",
        "permalink": "/r/stocks/comments/m1ulx7/rstocks_daily_discussion_wednesday_mar_10_2021/gqj196b/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1615461898.0
    },
    {
        "author": "Dmoan",
        "body": "Boomers “let’s sell Apple and pile on Oracle since it’s value stock” after ER “ damn only 3% growth how come they are not growing at 20% like Apple”",
        "created_utc": 1615411629,
        "id": "gqhuyj9",
        "permalink": "/r/wallstreetbets/comments/m28d30/what_are_your_moves_tomorrow_march_11_2021/gqhuyj9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1615440429.0
    },
    {
        "author": "Heymaaaan",
        "body": "It's like the Dali Lama, they select a new baby to become the oracle of Omaha",
        "created_utc": 1615864725,
        "id": "gr3372b",
        "permalink": "/r/stocks/comments/m5wsyj/why_would_i_buy_berkshire/gr3372b/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1615893525.0
    },
    {
        "author": "Mr-turtlefucker",
        "body": "y u no predict 2k wise oracle ape",
        "created_utc": 1614710142,
        "id": "gpfy9n6",
        "permalink": "/r/wallstreetbets/comments/lw4qgi/fuck_it_heres_your_daily_gme_threadmegathread_3221/gpfy9n6/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614738942.0
    },
    {
        "author": "redditmodsRrussians",
        "body": "I left the entire industry after a series of events at work that blackpilled me a few years ago.  Eventually, you realize that all the month/year end reporting is just bullshit and SAP/Oracle/any of the smaller potential acquisition targets can and will automate that shit away sooner than later.  From recon to write offs, if the company is big enough, most of that shit can be auto scripted to the point where only 1 or 2 people need to see the report and even then they have virtually no real interaction with it beyond asking HP's help desk in Manila what some of the numbers mean.",
        "created_utc": 1615950977,
        "id": "gr775mh",
        "permalink": "/r/wallstreetbets/comments/m6j0h6/me_100/gr775mh/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1615979777.0
    },
    {
        "author": "timforbroke",
        "body": "Holy shit 100% what I expected!  I’m an oracle.",
        "created_utc": 1616886828,
        "id": "gsits2s",
        "permalink": "/r/wallstreetbets/comments/mdl9jj/unpinned_daily_discussion_thread_for_march_26_2021/gsits2s/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1616915628.0
    },
    {
        "author": "Illenaz",
        "body": "Short Cathy, long the Oracle of Omaha",
        "created_utc": 1614881760,
        "id": "gpoh1wj",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpoh1wj/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614910560.0
    },
    {
        "author": "IT_KID_AT_WORK",
        "body": "got halted 12 times on flash crash predicted by oracle MarketWatch man",
        "created_utc": 1615586421,
        "id": "gqqkoml",
        "permalink": "/r/wallstreetbets/comments/m3s1an/gme_yolo_loss_312_300c_138k_peak_wed_27k_give_me/gqqkoml/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1615615221.0
    },
    {
        "author": "MiscellaneousClutter",
        "body": "All hail the oracle DFV! Living the american wet dream!",
        "created_utc": 1615393948,
        "id": "gqgmnsh",
        "permalink": "/r/wallstreetbets/comments/m1xhlc/gme_megathread_for_march_10_2021/gqgmnsh/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1615422748.0
    },
    {
        "author": "Wacky_Water_Weasel",
        "body": "Oracle has been a printing press the past few weeks. They are going to post another earnings beat with 30%+ cloud growth again on Wednesday.",
        "created_utc": 1615254408,
        "id": "gqa4nia",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqa4nia/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1615283208.0
    },
    {
        "author": "Moral_Insanity",
        "body": " \n\nThe top-weighted technology sector (+1.9%) is the best performer in the early going while four other groups also show gains of 1.0% or more.\n\nKey factors driving today's performance include:\n\n* Leadership from high-beta chipmakers. The PHLX Semiconductor Index (+3.3%) has returned into positive territory for the week thanks to gains in all 30 components. The group is now up 1.9% for the week versus a 3.2% week-to-date gain in the Nasdaq (+2.0%). *South China Morning Post* reported overnight that the U.S. and China established a working group aimed at \"easing export controls\" and \"improving supply chain security.\"\n* Strong showing from the largest components by weight. **Apple** (**AAPL** 122.05, +2.07, +1.7%), **Microsoft** (**MSFT** 236.54, +4.12, +1.8%), and **Visa** (**V** 226.79, +3.62, +1.6%) are all up more than 1.0%.\n\n**Notable movers:**\n\n* **Qorvo** (**QRVO** 175.15, +9.78, +5.9%): best performer in the sector, rallying back above its 50-day moving average (174.20).\n* **ServiceNow** (**NOW** 498.88, +24.88, +5.3%): reclaiming its 200-day moving average (485.36).\n* **Skyworks** (**SWKS** 174.48, +6.82, +4.1%): rising back above its 50-day moving average (171.42).\n* **AMD** (**AMD** 79.96, +2.44, +3.2%): rising back above its 200-day moving average (78.77).\n* **NVIDIA** (**NVDA** 515.88, +17.15, +3.4%): trading near yesterday's high.\n* **PayPal** (**PYPL** 250.78, +8.71, +3.6%): rising toward its 50-day moving average (254.04).\n* **Fortinet** (**FTNT** 185.41, +4.95, +2.7%): rallying to a fresh record high.\n* **Broadcom** (**AVGO** 451.78, +14.19, +3.2%): rising toward its 50-day moving average (458.99).\n* **Visa** (**V** 226.79, +3.62, +1.6%): rallying to a fresh record.\n* **Apple** (**AAPL** 122.05, +2.07, +1.7%): rising to a one-week high.\n* **Oracle** (**ORCL** 66.81, -5.31, -7.4%): weakest performer in the sector despite beating Q3 expectations, issuing above-consensus guidance for Q4, and raising its dividend.",
        "created_utc": 1615480131,
        "id": "gql5x5x",
        "permalink": "/r/wallstreetbets/comments/m2not4/daily_discussion_thread_for_march_11_2021/gql5x5x/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1615508931.0
    },
    {
        "author": "Linuxifer",
        "body": "The Oracle of Delphi just called. The prophecy is real bois!",
        "created_utc": 1614888266,
        "id": "gpowrbz",
        "permalink": "/r/wallstreetbets/comments/lxkint/gme_megathread_for_march_04_2021/gpowrbz/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614917066.0
    },
    {
        "author": "Boss1010",
        "body": "Why did Oracle get beat down so bad",
        "created_utc": 1615417454,
        "id": "gqi7kcs",
        "permalink": "/r/wallstreetbets/comments/m28d30/what_are_your_moves_tomorrow_march_11_2021/gqi7kcs/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615446254.0
    },
    {
        "author": "Utopia_Bot",
        "body": "Doubled my money catching the falling ORCL knife by buying calls after it settled this morning. Might have sold them early as they already were at break even, but 100% gain in a day...im ok with that.",
        "created_utc": 1615494650,
        "id": "gqm3foq",
        "permalink": "/r/wallstreetbets/comments/m2not4/daily_discussion_thread_for_march_11_2021/gqm3foq/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615523450.0
    },
    {
        "author": "blandcole_mazdaboi",
        "body": "She is the oracle, she'll lead us all to greatness",
        "created_utc": 1615595032,
        "id": "gqr0mn7",
        "permalink": "/r/wallstreetbets/comments/m3r158/weekend_discussion_thread_for_the_weekend_of/gqr0mn7/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615623832.0
    },
    {
        "author": "duTemplar",
        "body": "I asked the great oracle.\n\n[It said “without a doubt”](https://magic-8ball.com/)",
        "created_utc": 1614847571,
        "id": "gpmunl6",
        "permalink": "/r/wallstreetbets/comments/lxg2ag/what_are_your_predictions_for_nio/gpmunl6/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614876371.0
    },
    {
        "author": "El-cid-98",
        "body": "The only thing I own that's green today is ORCL.  Taking a 5% hit in one day sucks.",
        "created_utc": 1614799159,
        "id": "gpkfdif",
        "permalink": "/r/stocks/comments/lwqqa4/rstocks_daily_discussion_wednesday_mar_03_2021/gpkfdif/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1614827959.0
    },
    {
        "author": "bigtimetimmyjim22",
        "body": "What percent are you up this week oracle?",
        "created_utc": 1614813218,
        "id": "gplb0g8",
        "permalink": "/r/SPACs/comments/lx4w0s/what_are_your_moves_tomorrow_mar042021/gplb0g8/",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1614842018.0
    },
    {
        "author": "SmackEh",
        "body": "NIO $45c 3/5\n\nThe Oracle made the prophecy, this is the One",
        "created_utc": 1614769617,
        "id": "gpit5ml",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpit5ml/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614798417.0
    },
    {
        "author": "tinzarian",
        "body": "So, you all knowing oracle, what is your next play?",
        "created_utc": 1615242518,
        "id": "gq9i846",
        "permalink": "/r/stocks/comments/m0o2pq/i_managed_to_avoid_the_tesla_crash_just_in_time/gq9i846/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1615271318.0
    },
    {
        "author": "morelsupporter",
        "body": "if he would have invested that $860 into:\n\n$AAPL it would be worth $500,387 today\n\n$AMZN it would be worth $208,472 today\n\n$ORCL it would be worth $17,977 today\n\n$EBAY it would be worth $64,236 today\n\n$MNST it would be worth $1,000,768 today\n\naaaand, it’s not WSB without (hypothetical) loss porn:\n\n$F it would be worth $760.21 today\n\n$ENRON it would be worth $0 today \n\n$ANF it would be worth $2074 today\n\n$TGLO it would be worth $1.03 today\n\n$GE would be $793.51",
        "created_utc": 1615353235,
        "id": "gqezclq",
        "permalink": "/r/wallstreetbets/comments/m1mgl2/dad_has_been_qualcomm_since_1998_5_splits_and/gqezclq/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615382035.0
    },
    {
        "author": "the_GuelahPapyrus",
        "body": "No way ORCL can stay down with a positive earnings report. Might take a week or so, but if tech and market are rising Oracle will have a big rebound. \n\nOne of the best single days for tech, second biggest software company in the world... C'mon",
        "created_utc": 1615503819,
        "id": "gqmnf84",
        "permalink": "/r/wallstreetbets/comments/m30mij/what_are_your_moves_tomorrow_march_12_2021/gqmnf84/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615532619.0
    },
    {
        "author": "reddituserzerosix",
        "body": "F for ORCL",
        "created_utc": 1615410892,
        "id": "gqhta20",
        "permalink": "/r/wallstreetbets/comments/m28d30/what_are_your_moves_tomorrow_march_11_2021/gqhta20/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615439692.0
    },
    {
        "author": "steeztalex",
        "body": "thinking of picking up some orcl calls",
        "created_utc": 1615484369,
        "id": "gqlfphq",
        "permalink": "/r/wallstreetbets/comments/m2not4/daily_discussion_thread_for_march_11_2021/gqlfphq/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615513169.0
    },
    {
        "author": "isospeedrix",
        "body": "[https://i.redd.it/ajzqfiksfel61.png](https://i.redd.it/ajzqfiksfel61.png)\n\nmost zzz earnings week.\n\nnotable: AMC, ORCL JD DOCU GoodRX ULTA",
        "created_utc": 1615325768,
        "id": "gqdkd6t",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqdkd6t/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615354568.0
    },
    {
        "author": "Ouiju",
        "body": "I like orcl for their tools anyway, long orcl",
        "created_utc": 1615391399,
        "id": "gqgg694",
        "permalink": "/r/wallstreetbets/comments/m1v1e6/daily_discussion_thread_for_march_10_2021/gqgg694/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615420199.0
    },
    {
        "author": "ImprovisedTaxShelter",
        "body": "&gt;You've basically said they have software that solves complicated problems.\n\nLOL for real. The post you're replying to is a generic description of every single enterprise software company's business. You could Find/Replace \"PLTR\" with SAP, IBM, Oracle, Salesforce, Azure, or AWS and it'd still be accurate (and not unique). As far as I can tell, Palantir's only differentiation is that it's tailored for Intelligence and Law Enforcement domains (and since I know pretty much nothing about those market segments I choose not to invest).",
        "created_utc": 1615404788,
        "id": "gqhf0hi",
        "permalink": "/r/investing/comments/m1nu6b/the_case_for_palantir_technologies/gqhf0hi/",
        "score": 2,
        "subreddit": "investing",
        "created": 1615433588.0
    },
    {
        "author": "AirborneReptile",
        "body": "lets go ORCL earnings!!!",
        "created_utc": 1615409715,
        "id": "gqhql5g",
        "permalink": "/r/wallstreetbets/comments/m1v1e6/daily_discussion_thread_for_march_10_2021/gqhql5g/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615438515.0
    },
    {
        "author": "gottheguapp321",
        "body": "orcl calls the move?",
        "created_utc": 1615476678,
        "id": "gqky8us",
        "permalink": "/r/wallstreetbets/comments/m2not4/daily_discussion_thread_for_march_11_2021/gqky8us/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615505478.0
    },
    {
        "author": "flyingmoose0913",
        "body": "So my perspective is that those two are actually in very different places from a regulation perspective.  \n\nGoogle is likely to get continually more regulated as time goes on and data privacy becomes a bigger issue.  I would say it doesn't actually fall under most current anti-trust legislation which is related to price competition and its revenue area is actually advertising where there is lots of competition BUT I agree that practically it is enough of a monopoly that it will likely get dragged into it.  I sold my Google and FB a few months ago, both just to take profits and because I think there's a solid chance they spend the next 2-4 years in continuous litigation and hearings over how to manage data more responsibly and how they should be regulated.  Doubt anyone can agree to anything, but it will put a damper on their acquisition and expansion sprees.\n\nAmazon is a very different case as Amazon isn't really a monopoly in any way, they just compete in SO MANY categories that it feels that way.  But when you look at it...in e-commerce, its hard to call someone a monopoly when Walmart, Target, Costco Best Buy and every other big box compete with them; AWS is fighting tooth and nail with Microsoft Azure, Google could, IBM, Oracle etc.; \n\nWe can keep going down the list - Prime video competes with Netflix and Hulu; Amazon logistics competes with UPS and Fedex and Uber Cargo...so while their everpresence in our lives makes it feel like it MUST be a monopoly, its actually hard to identify anywhere specifically that Amazon isn't subject to pretty intense competition by big players, thus hard to make a case for anti-competitive behavior or anti-trust violations.",
        "created_utc": 1615478145,
        "id": "gql1hkp",
        "permalink": "/r/ValueInvesting/comments/m2ecnt/what_is_your_highest_conviction_stock_and_why/gql1hkp/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1615506945.0
    },
    {
        "author": "JPowsBestie",
        "body": "I use oracle at work and can tell you it's absolutely dogshit...so buy as many OTM calls as possible",
        "created_utc": 1615489690,
        "id": "gqls6ow",
        "permalink": "/r/wallstreetbets/comments/m2not4/daily_discussion_thread_for_march_11_2021/gqls6ow/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615518490.0
    },
    {
        "author": "threecatsdancing",
        "body": "Good time to get ORCL or more free fall coming?",
        "created_utc": 1615473633,
        "id": "gqkro5d",
        "permalink": "/r/wallstreetbets/comments/m2not4/daily_discussion_thread_for_march_11_2021/gqkro5d/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615502433.0
    },
    {
        "author": "steeztalex",
        "body": "am i the only one buyingg orcl calls",
        "created_utc": 1615494398,
        "id": "gqm2v1e",
        "permalink": "/r/wallstreetbets/comments/m2not4/daily_discussion_thread_for_march_11_2021/gqm2v1e/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615523198.0
    },
    {
        "author": "Imnotfckingselling",
        "body": "Bought the dip on calls for ORCL today hope my courage pays off",
        "created_utc": 1615500346,
        "id": "gqmg7ya",
        "permalink": "/r/wallstreetbets/comments/m30mij/what_are_your_moves_tomorrow_march_12_2021/gqmg7ya/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615529146.0
    },
    {
        "author": "Citigroup_CEO",
        "body": "Mogul will integrate Chainlink, the market-leading blockchain oracle network, to bring more transparency and accessibility to film production and financing.",
        "created_utc": 1615911270,
        "id": "gr4x5ny",
        "permalink": "/r/investing_discussion/comments/m6ap0p/how_do_millennials_and_genz_perceive_sustainable/gr4x5ny/",
        "score": 2,
        "subreddit": "investing_discussion",
        "created": 1615940070.0
    },
    {
        "author": "chcknbscts",
        "body": "Woke up to 330% on ORCL calls. Nothin better than tendies on your bday week. Especially while on vacay at the casino.",
        "created_utc": 1617032388,
        "id": "gsp4gio",
        "permalink": "/r/wallstreetbets/comments/mfm3fg/daily_discussion_thread_for_march_29_2021/gsp4gio/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617061188.0
    },
    {
        "author": "Wrappa_",
        "body": "So you say $ORCL will be next weeks fud dildo that ‘all the retail investors that lost interest in GME are now buying up instead’. 😂",
        "created_utc": 1614812806,
        "id": "gpla6h5",
        "permalink": "/r/Wallstreetbetsnew/comments/lwt7bo/_/gpla6h5/",
        "score": 2,
        "subreddit": "Wallstreetbetsnew",
        "created": 1614841606.0
    },
    {
        "author": "steeztalex",
        "body": "oracle calls anyone",
        "created_utc": 1615489473,
        "id": "gqlro9c",
        "permalink": "/r/wallstreetbets/comments/m2not4/daily_discussion_thread_for_march_11_2021/gqlro9c/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615518273.0
    },
    {
        "author": "StrictDefinition4",
        "body": "My best stocks I’ve bought with the largest % gains. MGM INO MRNA RCL DIS AMD RKT SBUX FB APPL AMZN ORCL ABNB TMUS COST V BAC SNOW.",
        "created_utc": 1615512630,
        "id": "gqn4cdj",
        "permalink": "/r/stocks/comments/m2n9tl/rstocks_daily_discussion_options_trading_thursday/gqn4cdj/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1615541430.0
    },
    {
        "author": "EternityWeasel",
        "body": "ORCL wants to turn green so much!",
        "created_utc": 1615565274,
        "id": "gqpan6b",
        "permalink": "/r/wallstreetbets/comments/m3f9fp/daily_discussion_thread_for_march_12_2021/gqpan6b/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615594074.0
    },
    {
        "author": "Zoro11031",
        "body": "I have no idea, I'm not an oracle. I'm loading myself to the tits on SPY and TSLA puts tho",
        "created_utc": 1614812542,
        "id": "gpl9n4o",
        "permalink": "/r/Wallstreetbetsnew/comments/lwt7bo/_/gpl9n4o/",
        "score": 2,
        "subreddit": "Wallstreetbetsnew",
        "created": 1614841342.0
    },
    {
        "author": "GeckoRocket",
        "body": "Ah nice!  Yeah I did neglect to mention - those staying in longer, like before this was all done, that really was tough.  I am honestly glad they are getting their day though, finally.  Their tech is amazing, they deserve the credit and monies for what they accomplished.  There are very few things that can top some of the storage performance I work with, but that ability to run an oracle database in memory was untouchable.  The results speak for themselves, and Google stole all of it.",
        "created_utc": 1614813313,
        "id": "gplb7d3",
        "permalink": "/r/pennystocks/comments/lx22pm/netlist_nlst_dd_requesting_input_catalysts_coming/gplb7d3/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1614842113.0
    },
    {
        "author": "sule9na",
        "body": "I definitely agree with this. Consumer sentiment has changed and the way we work has changed. If anything we're more reliant on tech than ever as remote or at least hybrid work will be the norm going forward. This means companies like AAPL, MSFT, TEAM, etc. Are going to keep pulling great profits. There was no reason for those three (just as an example of comfortably entrenched tech companies) to crash down in this sell off. They're doing great and cash rich.\n\nAs an example, ORCL who provide very similar cloud services as those I just listed hasn't been hurt by this sell off at all. Look at their PE, upcoming plans and liquid capital and they're in no better a position than the others. No real explanation for it.",
        "created_utc": 1615256797,
        "id": "gqa8zpg",
        "permalink": "/r/stocks/comments/m0ohdg/whats_the_reason_that_tech_is_just_taking_a/gqa8zpg/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1615285597.0
    },
    {
        "author": "tsitchom",
        "body": "Oh dear WSB oracle, grant a retarded disciple your autistic sight.\n\nAm I right to smell an afternoon Mother dump ?!",
        "created_utc": 1615574864,
        "id": "gqpw5k6",
        "permalink": "/r/wallstreetbets/comments/m3f9fp/daily_discussion_thread_for_march_12_2021/gqpw5k6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615603664.0
    },
    {
        "author": "Stonkbull13",
        "body": "AMZN and MSFT are tucked into QQQ and SP500 which are my largest holdings so that's why I haven't added those. I'll have to look into CRM, WDAY, and ORCL. TSM is definitely on my list, I like NVDA but am a bit worried that is had such a crazy run the last few years that it might be quite a bit over valued, thoughts on that?",
        "created_utc": 1615862313,
        "id": "gr2ytz6",
        "permalink": "/r/stocks/comments/m5ybbt/advice_on_what_to_add_to_my_portfolio_needed/gr2ytz6/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1615891113.0
    },
    {
        "author": "sblct",
        "body": "I mean, I’m kinda messing around, but compared to Cathie, he’s been an oracle lately",
        "created_utc": 1617064176,
        "id": "gsqz2b2",
        "permalink": "/r/wallstreetbets/comments/mfy3xf/what_are_your_moves_tomorrow_march_30_2021/gsqz2b2/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617092976.0
    },
    {
        "author": "Dazumbolschitt",
        "body": "Have you ventured into Puts yet?  Made $100 gain off a RKT put today.  Bought an hour after open, sold 35min later.  Quick money. Turned around and bought an Oracle put. Likely selling tomorrow. Up $98 so far on that.",
        "created_utc": 1617057348,
        "id": "gsqm8gn",
        "permalink": "/r/options/comments/mffsh7/puzzled_about_f_long_calls/gsqm8gn/",
        "score": 2,
        "subreddit": "options",
        "created": 1617086148.0
    },
    {
        "author": "bdavid21wnec",
        "body": "Only thing keeping me even right now after this bloodbath. $ORCL, $GE, $XLE",
        "created_utc": 1614830410,
        "id": "gpm7nxn",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpm7nxn/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614859210.0
    },
    {
        "author": "AmenophisCat",
        "body": "This is a B2B service, not for small businesses.\n\nThe database is queried with SQL indeed, and that's a strength, and the output on screen like all databases will be boring rows of results. However that's not what matters for that part of the business: Everything's plumbed together with ETL stages, and queries that feed into other tools as needed. It's all about crunching TB or PB of data to make complicated correlations. The user interfaces are just there to prototype and run one-of queries, not run a business.\n\nFor data scientists the data would be fed into 3rd party, like python, R or GUI tools like Tableau to generate charts, via existing \"connectors\".\n\nThe things I consider is there's a vast amount of legacy data and processes in companies that are all databases and SQL scripts that need to be migrated. You can't move any of that without the compatibility.\n\nI think that's why there's no direct comparison to PLTR which offers tools to build from scratch your analytics. Furthermore I don't believe a small business would be the target customer for Palantir either. If anything Palantir will pull data from Snowflake as one of its many inputs.\n\nIf anything  small businesses would buy integrated solutions. These solutions can be implemented on top of Snowflake. In fact companies are created on top of Snowflake's infrastructure now. Would you expect a small business to run Oracle. no. A fortune 500 company? yes.",
        "created_utc": 1614903395,
        "id": "gppttfb",
        "permalink": "/r/wallstreetbets/comments/lxyc98/where_is_snow_heading/gppttfb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614932195.0
    },
    {
        "author": "Alepman",
        "body": "From now on I’m buying what Burry’s buying the man is an oracle",
        "created_utc": 1614857559,
        "id": "gpn55ag",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpn55ag/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614886359.0
    },
    {
        "author": "Strangerdanger8812",
        "body": "Quote me some Oracle of Omaha",
        "created_utc": 1615233881,
        "id": "gq8ytx0",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8ytx0/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615262681.0
    },
    {
        "author": "Canuck0987",
        "body": "Those eyes look like those of a wise rpg oracle that can see the future. Ask her what the ceiling will be. $10,000 per 1 bark",
        "created_utc": 1615347124,
        "id": "gqepow9",
        "permalink": "/r/wallstreetbets/comments/m1mnps/as_promised_in_the_gme_daily_thread_1_pet/gqepow9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615375924.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "Nobody hates Oracle more than their customers.\n\nThey still exist, they had a great year, but I won't be surprised when they end up back at 35 after the bubble bursts.👼",
        "created_utc": 1615440526,
        "id": "gqjddfi",
        "permalink": "/r/StockMarket/comments/m2g899/oracles_thirdquarter_revenue_was_us101_billion/gqjddfi/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1615469326.0
    },
    {
        "author": "Boss1010",
        "body": "Oracle puts tomorrow are literally free money",
        "created_utc": 1615442049,
        "id": "gqjg3ny",
        "permalink": "/r/wallstreetbets/comments/m28d30/what_are_your_moves_tomorrow_march_11_2021/gqjg3ny/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615470849.0
    },
    {
        "author": "BigBeezy905",
        "body": "Anyone else buying the Oracle dip?",
        "created_utc": 1615481738,
        "id": "gql9ltv",
        "permalink": "/r/wallstreetbets/comments/m2not4/daily_discussion_thread_for_march_11_2021/gql9ltv/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615510538.0
    },
    {
        "author": "Utopia_Bot",
        "body": "Tempted to try and catch the falling knife on ORCL. They crushed earnings and tanked anyway...",
        "created_utc": 1615475105,
        "id": "gqkusyu",
        "permalink": "/r/wallstreetbets/comments/m2not4/daily_discussion_thread_for_march_11_2021/gqkusyu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615503905.0
    },
    {
        "author": "the_GuelahPapyrus",
        "body": "$ORCL after-hours will leave you wishing you did",
        "created_utc": 1615492623,
        "id": "gqlyvk6",
        "permalink": "/r/wallstreetbets/comments/m2not4/daily_discussion_thread_for_march_11_2021/gqlyvk6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615521423.0
    },
    {
        "author": "steeztalex",
        "body": "oracle 70 3/19",
        "created_utc": 1615491638,
        "id": "gqlwm8x",
        "permalink": "/r/wallstreetbets/comments/m2not4/daily_discussion_thread_for_march_11_2021/gqlwm8x/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615520438.0
    },
    {
        "author": "luoyuke",
        "body": "Oracle was right lol",
        "created_utc": 1615399481,
        "id": "gqh1smy",
        "permalink": "/r/wallstreetbets/comments/m1xhlc/gme_megathread_for_march_10_2021/gqh1smy/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615428281.0
    },
    {
        "author": "Ice_Business",
        "body": "If I had listened to boomers, I would have bought into ORCL and GM last week. Sold ORCL a while ago when the tiktok deal wasn't happening.",
        "created_utc": 1615501975,
        "id": "gqmjncp",
        "permalink": "/r/wallstreetbets/comments/m30mij/what_are_your_moves_tomorrow_march_12_2021/gqmjncp/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615530775.0
    },
    {
        "author": "Soda444",
        "body": "Please report back to us about what the Oracle of EYES picks",
        "created_utc": 1615596110,
        "id": "gqr2iub",
        "permalink": "/r/wallstreetbets/comments/m3r158/weekend_discussion_thread_for_the_weekend_of/gqr2iub/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615624910.0
    },
    {
        "author": "EternityWeasel",
        "body": "is anyone holding ORCL calls over the weekend? It almost did it today, I wonder if the breakout starts early next week...",
        "created_utc": 1615580081,
        "id": "gqq7fk3",
        "permalink": "/r/wallstreetbets/comments/m3f9fp/daily_discussion_thread_for_march_12_2021/gqq7fk3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615608881.0
    },
    {
        "author": "WeaponizedAutism12",
        "body": "Lmao i loaded up heavy on oracle, what a joke that was",
        "created_utc": 1615316761,
        "id": "gqd03qq",
        "permalink": "/r/wallstreetbets/comments/m144ua/daily_discussion_thread_for_march_09_2021/gqd03qq/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615345561.0
    },
    {
        "author": "Pirate_Redbeard",
        "body": "More like Oracle Team USA vs Emirates Team New Zealand after a fucking 1-8 streak",
        "created_utc": 1615917060,
        "id": "gr5ad19",
        "permalink": "/r/wallstreetbets/comments/m67ywm/gme_megathread_for_march_16_2021/gr5ad19/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615945860.0
    },
    {
        "author": "crazyk2007",
        "body": "No cloud stocks?  Take your pick:\n\nAMZN, CRM, WDAY, MSFT, ORCL, or the smaller more aggressive niche ones.\n\nI’d drop INTC, add TSM and/or NVDA",
        "created_utc": 1615861841,
        "id": "gr2xz63",
        "permalink": "/r/stocks/comments/m5ybbt/advice_on_what_to_add_to_my_portfolio_needed/gr2xz63/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1615890641.0
    },
    {
        "author": "engr_rahman13",
        "body": "I am in the favor of Moghul. Mogulproductions to launch on mainnet with Chainlink oracle integration, providing transparent profit sharing with future film financing investors. Mogul will integrate Chainlink, the market-leading blockchain oracle network, to bring more transparency and accessibility to film production and financing.",
        "created_utc": 1615297158,
        "id": "gqbqkmd",
        "permalink": "/r/investing_discussion/comments/m15tf2/who_likes_frsx/gqbqkmd/",
        "score": 1,
        "subreddit": "investing_discussion",
        "created": 1615325958.0
    },
    {
        "author": "KyivComrade",
        "body": "I didnt know we had a certified oracle here, what an honour! Oh enlightened one, since you claim to know what the stocks will do can you tell us when the market will go up? How deep will it go? How many millions did you make timing the market?\n\n\n\nOr are you just another perma-bear getting excited by a few red days and, as always, saying the sky is falling when it isn't.",
        "created_utc": 1615296030,
        "id": "gqbokz7",
        "permalink": "/r/stocks/comments/m0yerk/theres_nothing_to_worry_about_relax/gqbokz7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615324830.0
    },
    {
        "author": "Serious-Mobile",
        "body": "Yea, I got some extra stock today.\n\nOracle has quarterly report this week (will buy more), and SONOS. They have a potential product unveil and will report finances today at the \"investor event\", which is 4 PM today (post-market). I don't see any risk of the stock going south today or tomorrow, provided the market as a whole is stable.",
        "created_utc": 1615302456,
        "id": "gqc1ls1",
        "permalink": "/r/stocks/comments/m0nnna/sonos_inc_financial_report_tomorrow_will_it_be/gqc1ls1/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615331256.0
    },
    {
        "author": "Risingsunsphere",
        "body": "I’ve made an 11.26% return on ORCL this year. Any suggestions on how long I should hold this. It seems like it just goes up every day. I mostly hold ETFs but have a few individual stocks. This one has panned out really well but it makes up about 5% of my short term investing portfolio and I’m starting to think about an exit strategy.",
        "created_utc": 1615227374,
        "id": "gq8jq0d",
        "permalink": "/r/investing/comments/m0ck8o/daily_advice_thread_all_basic_help_or_advice/gq8jq0d/",
        "score": 1,
        "subreddit": "investing",
        "created": 1615256174.0
    },
    {
        "author": "nmsjeat",
        "body": "Exact dates might give slightly different values, but I get quite different results from Eikon for some of the companies. 860USD investment with reinvested dividends would be: (1998/06/09 - 2021/03/09, later IPO's from first month value) \n\nAAPL: $479,359\nAMZN: $308,377\nORCL: $16,792\nEBAY: $92,533\nMNST: $912,710\n\nF: $712\nENRON: $1\nANF: $1881\nTGLO: $5\nGE: $817",
        "created_utc": 1615368782,
        "id": "gqfh5di",
        "permalink": "/r/wallstreetbets/comments/m1mgl2/dad_has_been_qualcomm_since_1998_5_splits_and/gqfh5di/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615397582.0
    },
    {
        "author": "plautusitmeltwater",
        "body": "BTFD on ORCL!",
        "created_utc": 1615433577,
        "id": "gqj24e0",
        "permalink": "/r/wallstreetbets/comments/m28d30/what_are_your_moves_tomorrow_march_11_2021/gqj24e0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615462377.0
    },
    {
        "author": "UsefulReplacement",
        "body": "I like the main product (Dropbox), but I never paid for it and don't know anyone that has. It's missing the easy integration of iCloud / OneDrive / Google Drive with a broader ecosystem of apps and tools.\n\nI think they missed the time to be competitive and are probably going to get acquired by one of the old school large corps like Oracle / IBM within a decade.",
        "created_utc": 1615445584,
        "id": "gqjlvon",
        "permalink": "/r/ValueInvesting/comments/m2ecnt/what_is_your_highest_conviction_stock_and_why/gqjlvon/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615474384.0
    },
    {
        "author": "Zoiberginadress",
        "body": "ORCL 4/16 67.5c, I like it. Dropped too much for my liking off of earnings.",
        "created_utc": 1615478741,
        "id": "gql2tj4",
        "permalink": "/r/wallstreetbets/comments/m2not4/daily_discussion_thread_for_march_11_2021/gql2tj4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615507541.0
    },
    {
        "author": "Mr-turtlefucker",
        "body": "y u no predict 2k wise oracle ape",
        "created_utc": 1614710142,
        "id": "gpfy9n6",
        "permalink": "/r/wallstreetbets/comments/lw4qgi/fuck_it_heres_your_daily_gme_threadmegathread_3221/gpfy9n6/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614738942.0
    },
    {
        "author": "beelo50",
        "body": "My wife works for ORCL and her stock fully vests in 4 years. What do you guys think ORCL will be worth by then?",
        "created_utc": 1614706857,
        "id": "gpfqod6",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpfqod6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614735657.0
    },
    {
        "author": "engr_rahman13",
        "body": "Mogulproductions to launch on mainnet with Chainlink oracle integration, providing transparent profit sharing with future film financing investors. Mogul will integrate Chainlink, the market-leading blockchain oracle network, to bring more transparency and accessibility to film production and financing.",
        "created_utc": 1614704622,
        "id": "gpflkhk",
        "permalink": "/r/CanadianInvestor/comments/lvs0t4/an_etf_is_being_launched_that_will_track/gpflkhk/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1614733422.0
    },
    {
        "author": "OGColorado",
        "body": "I am the oracle🤓 wtf",
        "created_utc": 1614700952,
        "id": "gpfd8b6",
        "permalink": "/r/wallstreetbets/comments/lw15gf/a_few_lines_about_gme_please_read/gpfd8b6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614729752.0
    },
    {
        "author": "sunlisun",
        "body": "got there today, my oracle friend",
        "created_utc": 1614710552,
        "id": "gpfz8ec",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpfz8ec/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614739352.0
    },
    {
        "author": "Kingace__",
        "body": "All aboard the oracle train",
        "created_utc": 1614707040,
        "id": "gpfr3k9",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpfr3k9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614735840.0
    },
    {
        "author": "Kingace__",
        "body": "ORACLE",
        "created_utc": 1614710240,
        "id": "gpfyhu6",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpfyhu6/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1614739040.0
    }
]