[
    {
        "author": "novoivittu",
        "body": "What if it goes backwards![img](emote|t5_2th52|4275)",
        "created_utc": 1635758186,
        "id": "hiv5p91",
        "score": 98,
        "subreddit": "wallstreetbets",
        "created": 1635786986.0
    },
    {
        "author": "scablime",
        "body": "I’ve been using [Finviz](https://finviz.com/) since day 1. Their screener will provide you with a ton of filtering options to discover new stocks. I’ve also come across [Wall St Rank](https://www.wallstrank.com/?r=1) elsewhere. It’s essentially a fast way to see what the pros recommend, right? [This guy](https://www.tiktok.com/@austinhankwitz/video/6982358874992954630?_d=secCgYIASAHKAESMgowrSM1k%2FSUsILuUJXci%2Bb2moBhNnVr8T8%2BFU6Xx2FFDI02nWtuhn%2BB6aFZ84ejdJFOGgA%3D&amp;checksum=bef4158f4f2cc7d7a2a0d94bddacc34144b55577606b6ee5aa4b024583fff0d0&amp;language=en&amp;preview_pb=0&amp;sec_user_id=MS4wLjABAAAA-J9vaQ2C1_KXg_UWpeE2ROMGuftpC1jAkQV70Bvbx6vTugbQyN1wIRRfuk3vaAuG&amp;share_app_id=1233&amp;share_item_id=6982358874992954630&amp;share_link_id=C443B476-8919-453A-BE81-5DD6B80913A5&amp;source=h5_m&amp;timestamp=1625708098&amp;tt_from=copy&amp;u_code=d3b1ad0mjla856&amp;user_id=6628757945272909830&amp;utm_campaign=client_share&amp;utm_medium=ios&amp;utm_source=copy&amp;_r=1&amp;is_copy_url=1&amp;is_from_webapp=v1) explains it better than their website tbh.",
        "created_utc": 1635754480,
        "id": "hiv1ygt",
        "score": 87,
        "subreddit": "stocks",
        "created": 1635783280.0
    },
    {
        "author": "ApplemooseGG",
        "body": "I feel the same as you. It seems like information is never free and it feels like everyone has a secret they want to sell you. I'm just looking for some type of basis to build upon, but for every piece of info there is someone else that thinks it's terrible.",
        "created_utc": 1635754346,
        "id": "hiv1thi",
        "score": 63,
        "subreddit": "stocks",
        "created": 1635783146.0
    },
    {
        "author": "Theta-Maximus",
        "body": "In a very small number of instances, that may be happening, but the heart of the matter is their data is telling them the market has turned and is rolling over. They've listed (LISTED!) 93% of their inventory in Phoenix below their acquisition cost.  Unless you think 93% of the homes they bought in Phoenix came encumbered with tenants, it's not a smart idea to extrapolate from a few anecdotes. Zillow knows when a market turns, it's better to cut losses and take them quickly than let them grow. That's what successful traders and stock flippers do too. The real losers are the other iBuyers that haven't figured out how to cut their losses and get to the sidelines. While Zillow is trying to cut their inventory, OPEN is growing theirs enormously. That's not gonna work out well. The question is, when this Fed-fueled stock market turns, will the apes here be like Zillow, cut their losses and book the gains, or will they be like OPEN and diamond-hand it all the way down.",
        "created_utc": 1635750817,
        "id": "hiuy586",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1635779617.0
    },
    {
        "author": "nonotreadit",
        "body": "As an agent, this is isn’t just a strategy, it’s a method used in 99% of listings where an owner will allow it.",
        "created_utc": 1635756111,
        "id": "hiv3lti",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1635784911.0
    },
    {
        "author": "ugottabekiddingmee",
        "body": "It's definitely going to do something. But it might not.",
        "created_utc": 1635757283,
        "id": "hiv4si7",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1635786083.0
    },
    {
        "author": "KupaPupaDupa",
        "body": "They do it by getting rid of local construction companies, easy peasy.",
        "created_utc": 1635758799,
        "id": "hiv6c06",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1635787599.0
    },
    {
        "author": "modi13",
        "body": "Your attitude is exactly what I'm talking about. You're so bent out of shape about not wanting to live in a province that only exists in your head that you're paying out the ass for the opportunity to live elsewhere.\n\nAlberta's medical professionals are the highest-paid in the country. Calgary is an engineering and transportation hub, and Edmonton is no slouch in that regard either. Alberta's lawyers and IT specialists are compensated as well as in any other province. There are jobs in law enforcement, forestry, and tourism. Alberta has almost every job that exists elsewhere in Canada, with a lower cost of living and way better wilderness and mountains than anything to the east.",
        "created_utc": 1635758897,
        "id": "hiv6fna",
        "score": 21,
        "subreddit": "CanadianInvestor",
        "created": 1635787697.0
    },
    {
        "author": "xGeneralMetalx",
        "body": "They never covered. They shorted it even more.",
        "created_utc": 1635757243,
        "id": "hiv4r3g",
        "score": 19,
        "subreddit": "StockMarket",
        "created": 1635786043.0
    },
    {
        "author": "Chgralac73",
        "body": "yeah and local construction crews prefer to work with their longtime local customers. its nearly impossible to scale as megacorp construction/renovation business, no idea how blackrock does it",
        "created_utc": 1635753342,
        "id": "hiv0sgj",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1635782142.0
    },
    {
        "author": "Wesssel_",
        "body": "You should look into ETFs like that track the S&amp;P500 for in stance. It basically means in this case that one share consists of all top 500 companies in the US. In general investing in these kinda ETFs will result in a yearly 10% (on average). Many people just invest in ETFs monthly for 10/20/30 years and do nothing else.",
        "created_utc": 1635755403,
        "id": "hiv2vxq",
        "score": 16,
        "subreddit": "stocks",
        "created": 1635784203.0
    },
    {
        "author": "murkygymnast",
        "body": "he's up on equity, whether you like it or not hater",
        "created_utc": 1635754663,
        "id": "hiv253f",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1635783463.0
    },
    {
        "author": "timeforachangee",
        "body": "I’m getting bored of losing money in BABA. Going to sell and buy TSLA before it tanks",
        "created_utc": 1635758535,
        "id": "hiv6288",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1635787335.0
    },
    {
        "author": "AnxiousScientistDude",
        "body": "Small cap is now considered $1.5B market cap, when it used to be $1.0B. Inflation's a bitch.",
        "created_utc": 1635751394,
        "id": "hiuyrc1",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1635780194.0
    },
    {
        "author": "teteban79",
        "body": "I mean ... TSLA, GME, other memes are severely overpriced. That is, in terms of fundamentals.\n\nAnd still, it would be extremely unwise and unsound to short them",
        "created_utc": 1635752892,
        "id": "hiv0bo4",
        "score": 10,
        "subreddit": "stocks",
        "created": 1635781692.0
    },
    {
        "author": "Difficult_Delay_8604",
        "body": "If you want to learn about technical analysis\n\n* Learn about trend indicators e.g. moving averages, momentum indicators e.g. Oscillators, volatility indicators e.g. Bollinger Bands, Volume indicators e.g. Chaikin Money Flow\n* Support and resistance lines\n* Read some books about technical analysis. This one is a good overview but it focuses more on futures but the stuff is generally applicable to stocks as well: \"Technical Analysis of the Financial Markets: A Comprehensive Guide to Trading Methods and Applications\". Use z-lib or some other book pirating sites\n* Try and stay away from price action because that's the most suspect of all technical analysis. On the other hand, algorithmic/system trading is arguably the most rigorous of technical analysis based strategies.\n\nIf you want to learn about fundamental analysis\n\n* Learn about multipliers and other fundamentals e.g. P/E, EBITA, EV.\n* Learn how to make financial models e.g. Here's Martin Shkreli teaching how to build a financial model with IBM as an example [https://www.youtube.com/watch?v=fASInVKShnM](https://www.youtube.com/watch?v=fASInVKShnM) (disclaimer, I think this particular valuation turned out to be wrong so focus more on the techniques/models used rather than specifics about the companies) and here's DeepFuckingValue valuing GME [https://www.youtube.com/watch?v=GZTr1-Gp74U](https://www.youtube.com/watch?v=GZTr1-Gp74U). I think they make this type of dry stuff more \"accessible\" for the average person?\n* Read some books. I've heard intelligent investor by Benjamin Graham is good, although I haven't read it so see what the others here think\n\nBut honestly, just buy ETFs and save enough to retire.",
        "created_utc": 1635755257,
        "id": "hiv2qos",
        "score": 9,
        "subreddit": "stocks",
        "created": 1635784057.0
    },
    {
        "author": "ShowerStraight7477",
        "body": "Not sure why you act like Halifax is cheap. Halifax has the highest taxes in the country. With the high home prices (goodluck getting a house on the peninsula for less than a mil) and high property, sales and income taxes it is far more expensive than Ottawa and Montreal.",
        "created_utc": 1635754384,
        "id": "hiv1uy9",
        "score": 9,
        "subreddit": "CanadianInvestor",
        "created": 1635783184.0
    },
    {
        "author": "lllVadimlll",
        "body": "Why did it seem like this thread took effort to find....... Instead rules were in place of where this should have been..",
        "created_utc": 1635753118,
        "id": "hiv0k68",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635781918.0
    },
    {
        "author": "Joseph-Chamberlain",
        "body": "It will be really easy to prove actually, since they're receiving mail at that residence and all their shit is in your house.  Have fun trying to dodge the murder charges when there's a clear relationship between your arrival, their disappearance, and an obvious motive.\n\nSquatters aren't homeless people (as in, crack addicted vagabonds) living in a house, they're often the working poor.  They have families and lives that can't be easily erased like that.\n\nIf you're willing to bear the legal risk to do something like that then maybe you'll be an effective landlord, but you're wagering a lot in exchange for very little.",
        "created_utc": 1635756631,
        "id": "hiv44tw",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635785431.0
    },
    {
        "author": "supergnawer",
        "body": "I left my career of 20+ years in IT (including FAANG companies) and now I draw web comics. I had a burnout, took an year off, then applied to another company. Worked for 2 months, saw all the same bullshit, couldn't handle it anymore. Thankfully I have savings and I am fine with no income for now.",
        "created_utc": 1635755068,
        "id": "hiv2ju4",
        "score": 8,
        "subreddit": "investing",
        "created": 1635783868.0
    },
    {
        "author": "foo121",
        "body": "Wow it reaches 22 already pre-market",
        "created_utc": 1635754091,
        "id": "hiv1k55",
        "score": 8,
        "subreddit": "SPACs",
        "created": 1635782891.0
    },
    {
        "author": "Right__Tackle",
        "body": "You should … stop trading because you’re obviously not very good at it",
        "created_utc": 1635759139,
        "id": "hiv6oq9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635787939.0
    },
    {
        "author": "productivitydev",
        "body": "Do you think company as a whole has value? If not would you give any company away for free? And if the company has value, why wouldn't small piece of that have value?\n\nBut of course... I understand why you are asking this question. Because if you just buy a stock and you let it stay there, unless the company gives dividends you will receive nothing in return. So you agree that a company that gives dividends does have value? Let's say a company that gives 10% of dividends each year, will make you back that money in 10 years and from there everything else is a bonus.\n\nNow. What is the reason why every company doesn't give dividends? The reason is growth. They and their shareholders both think it's better to invest the potential dividends back into growing the company. \n\nBut the company always will have \"potential\" to give out dividends, once they decide they don't need to grow anymore - they could start giving out dividends, but meanwhile you can think of dividends as constantly being automatically invested back into the company, however due to company growing the potential also increases an you can still cash out the \"dividends\" by selling the stock at higher price due to potential of dividends having been grown.\n\nDoes that make sense?",
        "created_utc": 1635753072,
        "id": "hiv0idn",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635781872.0
    },
    {
        "author": "Investnew",
        "body": "What they list it for doesn’t matter right now. Every house in the neighborhoods I’m looking for are going well over ask like 20% or more.  \n\nThis article probably is a non story.  If the are listing houses 50k less than they paid and they end up going for 200k more than they list, it’s a win.",
        "created_utc": 1635758024,
        "id": "hiv5jai",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635786824.0
    },
    {
        "author": "SunkenPretzel",
        "body": "I mean, can’t really prove it right? If I come back from Fiji and catch someone in my bed claiming my home is there’s, they are getting their knees broken and thrown out the side of one of those country highways. Good luck convincing a cop anything as a crackhead squatter.",
        "created_utc": 1635751415,
        "id": "hiuys6m",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635780215.0
    },
    {
        "author": "InIce1234",
        "body": "Gay mods to dumb to pin it.",
        "created_utc": 1635759215,
        "id": "hiv6rl5",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635788015.0
    },
    {
        "author": "iOceanLab",
        "body": "This is the real future for Apple. \n\nThey’re building a $1B campus in Research Triangle Park. \n\n&gt; Positions will be primarily in artificial intelligence, machine learning and software engineering\n\nPeople thought this is a hype play for autonomous driving development. It could be, but I don’t think that’s the main focus. RTP is home to tons of huge biotech companies and neighbors Duke and UNC (huge research hospitals) and NC State (massive engineering and computer science programs). \n\nApple Health is the future of the company and will make it worth well over $3T. Hell, the “an Apple a day…” marketing writes itself. \n\nhttps://www.wral.com/apple-picks-triangle-north-carolina-for-new-campus/19646410/",
        "created_utc": 1635751542,
        "id": "hiuyx2i",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635780342.0
    },
    {
        "author": "ProfessorHamHands",
        "body": "That’s not how it works. You want airspace? Cool, do what we say.\n\nCorporations run shit until the agency that takes half of every tax dollar steps in and says jump.",
        "created_utc": 1635757158,
        "id": "hiv4nwu",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635785958.0
    },
    {
        "author": "JamaicaPlainian",
        "body": "MVST is such a sleeper stock. When it goes up it will melt faces",
        "created_utc": 1635750101,
        "id": "hiuxdmp",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635778901.0
    },
    {
        "author": "tarletontexan",
        "body": "Sold a house to them for 35k more than I paid for it. A month later someone bought it for what I originally paid. That's after zillow sunk some money into it. No idea how that business operates. Whatever. I'll take that extra cash every time",
        "created_utc": 1635752255,
        "id": "hiuzo4j",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635781055.0
    },
    {
        "author": "schlonghornbbq8",
        "body": "The best proven investment strategy (Throwing it all into a large cap index fund) requires almost no research.",
        "created_utc": 1635754189,
        "id": "hiv1ns4",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635782989.0
    },
    {
        "author": "TheLastKyle",
        "body": "Very low prediction but if it does go higher, at least he had the direction correct lol",
        "created_utc": 1635753753,
        "id": "hiv17gi",
        "score": 5,
        "subreddit": "options",
        "created": 1635782553.0
    },
    {
        "author": "Freshoutbreezy",
        "body": "If your company mandated sucking dicks, you'd open your mouth up right? I'd be totally okay with YOUR company mandating that. By your comment, I think you secretly hope they do mandate it.",
        "created_utc": 1635750382,
        "id": "hiuxorl",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635779182.0
    },
    {
        "author": "1005thArmbar",
        "body": "enjoy it while it lasts, we make the switch back next Sunday at 2 AM",
        "created_utc": 1635754710,
        "id": "hiv26sk",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635783510.0
    },
    {
        "author": "acanafrog",
        "body": "1)Lots of people are saying it doesn't matter and to an extent that is correct. As 10% is 10%.\n\nThat being said if you are starting out lower shares could cause a few problems, mostly if you don't have access to a platform that allows fractional shares.\n\n1)Let's say you get a dividend of 10% a year as a simplified example. 1 share at $1000 you get $100 dividend. Great but now you need $900 more to get another 1 share.\n\nIf the price was $100 a share and you bought 10 (same $1000) you would be able to reinvest it and have 11 shares at the end of the year.\n\nWith the $1000 share you would have 1 share and $100 waiting for you to get enough to invest. This slows you down, this becomes less of a problem as you go but can be tough at the start. In this example it limits the ability for the compounding interest to be fully efficient.\n\n2) Smaller amounts of shares can be a problem if you wanted to rebalance or decide to change investments in the future.\n\nKeeping with the previous example of prices per share, if I had 3 shares at $1000 and it went up 10% I may want to take that 10% and invest it somewhere else. Sadly, I only have 3 shares so the best I could do is sell 1 share. So instead of just rebalancing with the 10% I would be limited to rebalancing with 33%.\n\nIf each share was $100, I would have been able to sell 3 shares. Keep my $3000 still invested but move the $300 to something else, vs selling 1 of the 3 shares for $1100.\n\n3) As others have said, it would also involves options, but as you are starting out, this could be something that isn't important to you.\n\nAll of this kinda revolves around you having a basic ideas and understanding of what you are doing, the risks and goals and plans for the investment.\n\nHopefully you understand the risks and basics of investing vs just trying to cash in on a way to get rich, because others have had luck. It is always a bit worrying when the only socks people reference are the \"popular\" picks at the time. \n\nIf you are starting out, please take some time to look at the basics and save yourself the costs of multiple small mistakes costing you your hard earned money. Also please take a look at ETF's as they can be particularly good for starting out while you figure out your long term strategy.",
        "created_utc": 1635751649,
        "id": "hiuz13h",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635780449.0
    },
    {
        "author": "WilhelmSuperhitler",
        "body": "What other value would you expect if you bought a 10% of a bookstore except maybe a share of a profit, or to sell it later to someone else?",
        "created_utc": 1635753128,
        "id": "hiv0kk6",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635781928.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/Gareaugorille69 (2/0) made a bet that OCGN would go to 12.97 when it was 9.61 and it did, congrats retard.",
        "created_utc": 1635754572,
        "id": "hiv21ve",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635783372.0
    },
    {
        "author": "Ali2307x",
        "body": "There used to be up to 400x on etoro then they reduced it.",
        "created_utc": 1635757704,
        "id": "hiv57rx",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635786504.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Lost\n\n/u/Freeheroesplz (0/1) made a bet that FB would go to 265.0 when it was 325.34 and it did not, so they were banned for a week.",
        "created_utc": 1635759506,
        "id": "hiv72p6",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635788306.0
    },
    {
        "author": "Corpsebean",
        "body": "I think they're only selling it as long as Pork NFTs are cheap though",
        "created_utc": 1635750404,
        "id": "hiuxpnp",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1635779204.0
    },
    {
        "author": "spreadsTrader",
        "body": "Wasn't it funny like a week ago?",
        "created_utc": 1635751749,
        "id": "hiuz4qv",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635780549.0
    },
    {
        "author": "MarkGaboda",
        "body": "I'd jump in but the volume is less than 1/3 when it needs 2-3x the average. It could stratosphere but if I had .10 for every stock that could but didn't .",
        "created_utc": 1635750762,
        "id": "hiuy36k",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1635779562.0
    },
    {
        "author": "Eyonizback",
        "body": "Read books and many YouTube videos, internet articles from quality sources, it takes time",
        "created_utc": 1635754110,
        "id": "hiv1kue",
        "score": 4,
        "subreddit": "stocks",
        "created": 1635782910.0
    },
    {
        "author": "InternalVersionr",
        "body": "I've been hearing about Warren Buffet's videos. I will give it a try. Thank you!",
        "created_utc": 1635754910,
        "id": "hiv2e55",
        "score": 4,
        "subreddit": "stocks",
        "created": 1635783710.0
    },
    {
        "author": "Affectionate-Fall597",
        "body": "Wow, never linked the 2 just thought they didn’t want it (not complying to mandate) never thought about high altitude the ahem part",
        "created_utc": 1635757640,
        "id": "hiv55hs",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635786440.0
    },
    {
        "author": "sqcirc",
        "body": "No, someone else will buy it from you for that amount because it has value.",
        "created_utc": 1635751249,
        "id": "hiuylq4",
        "score": 3,
        "subreddit": "investing",
        "created": 1635780049.0
    },
    {
        "author": "xxJunjiFritoxx",
        "body": "Please read my dick before I slap it on your mom's face",
        "created_utc": 1635750422,
        "id": "hiuxqee",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635779222.0
    },
    {
        "author": "peacockwallpaper",
        "body": "I love Vanguard stocks but their website isn't user friendly at all. It was always so complicated just trying to transfer money in or buy new stocks so I eventually gave up on them and moved everything to TDAmeritrade. So in your case, maybe just stick to buying Vangurd stocks in Schwab?",
        "created_utc": 1635750466,
        "id": "hiuxs42",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635779266.0
    },
    {
        "author": "brorix",
        "body": "All of it applies. \n\nIn general: \n\n- You get a fraction of what the company is earning. \n- You can sell your fraction and get the present market value in return.\n\nWhat is wrong about your statement:\n\n- Even if you own the company earnings are not certain. What if you didn't earn enough last year or need to reinvest. In addition, you can own the company and not lead it. For example, you inherited your father's company but you have no idea about the business. If the CEO tells you, we can't pay dividends because x.y.z, you likely get nothing.\n\n- You can't sell the company for the price it was purchased for. You can just sell it based on the present market value. Why is that? You need a buyer and he tells you what he is willing to pay. It's based like everything on supply and demand.",
        "created_utc": 1635755952,
        "id": "hiv3fyl",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1635784752.0
    },
    {
        "author": "herroEveryone",
        "body": "100%. Buy the dip if it dips and I only say they bc it’s been on a tear",
        "created_utc": 1635755277,
        "id": "hiv2re5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635784077.0
    },
    {
        "author": "The_Sanch1128",
        "body": "Danger, Will Robinson.\n\nNot danger as in the stock tanking, but danger as in there are much better areas in which to invest or speculate.\n\nMy unsolicited and possibly way off advice is to stick 75% of the cash in a broad market index fund and speculate with the rest.  Have some fun with it.\n\nIf you must go the airline route, my preference would be LUV or DAL.",
        "created_utc": 1635753800,
        "id": "hiv198c",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635782600.0
    },
    {
        "author": "Golden_Arple65",
        "body": "You scared it back down.",
        "created_utc": 1635756914,
        "id": "hiv4f58",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1635785714.0
    },
    {
        "author": "mushyroom92",
        "body": "I believe he's a software engineer who works in financial-tech. He's 29, bought a 700k house this summer and ordered a Tesla today, pretty surreal to see he's made it this far 7 years out of college.",
        "created_utc": 1635750428,
        "id": "hiuxqmk",
        "score": 3,
        "subreddit": "investing",
        "created": 1635779228.0
    },
    {
        "author": "UpperSpinach",
        "body": "why did he click twice\n\nthat means he pulled back the hammer, and then lowered it again ??",
        "created_utc": 1635751030,
        "id": "hiuydag",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635779830.0
    },
    {
        "author": "AlwaysBlamesCanada",
        "body": "It already blew up to $21. Wanted to sell but I don’t have access to do that in early Pre-market. Back down again now of course, but I wouldn’t sell at 18. This will scream up way past that today.\n\nUnrelated question: how do you get access to trade when Pre-market opens at 4:00am with Fidelity?",
        "created_utc": 1635756496,
        "id": "hiv3zsw",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1635785296.0
    },
    {
        "author": "audioaxes",
        "body": "Zillow is big enough to play around with stuff like this and if it fails just take the big L and move on.",
        "created_utc": 1635752168,
        "id": "hiuzkq6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635780968.0
    },
    {
        "author": "Chgralac73",
        "body": "did the chairman not take 8 bil home last year lol. but hey he owns Xis favorite sports club so who knows what will happen. maybe Xi will take it and put it under name of another friendly oligarch :P\n\nand yeah depends if this is a bond to a foreign investor? afaik the bill that got paid recently was usd denominated but to domestic investors",
        "created_utc": 1635752378,
        "id": "hiuzsqr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635781178.0
    },
    {
        "author": "Pitunolk",
        "body": "Personal experience - did 4 years, got a degree, did &amp; led projects - got rejected from every entry-level I applied to for 2 years. Switched careers to a former hobby. Now paid the most and have a blast doing it. Tech can fuck off until they figure their hiring practices out.\n\nThey've got to realize like every other mature industry that their perfect employee is not common, especially in entry level.",
        "created_utc": 1635759116,
        "id": "hiv6nvg",
        "score": 3,
        "subreddit": "investing",
        "created": 1635787916.0
    },
    {
        "author": "him7403",
        "body": "How does it impact? Higher interest rate means more profit and bank stocks going up?",
        "created_utc": 1635752646,
        "id": "hiv02sn",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1635781446.0
    },
    {
        "author": "Time_Kaleidoscope",
        "body": "Barclays with that Epstein connection 😂 can a stock go negative dollars because they deserve it at this point",
        "created_utc": 1635758250,
        "id": "hiv5rm0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635787050.0
    },
    {
        "author": "foo121",
        "body": "It keeps going crazy. It was 21 again and now back to 16. Honestly I'd sell for 20\\~, but that's just me.",
        "created_utc": 1635757851,
        "id": "hiv5d0t",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1635786651.0
    },
    {
        "author": "cheesenuggets2003",
        "body": "I imagine that this is part of their point. Wages are still being depressed even if the capital eventually settles over here (not that it necessarily does).",
        "created_utc": 1635757483,
        "id": "hiv4zm9",
        "score": 2,
        "subreddit": "investing",
        "created": 1635786283.0
    },
    {
        "author": "zaphrode",
        "body": "Probably gonna be downvoted but most people that buy Tesla don’t just see it as a car company. Its an AI company too and furthermore its owner Elon Musk has other ventures like SpaceX which has huge potential and no stock of its own. So its more of an Elon Musk stock than a car company stock.",
        "created_utc": 1635759571,
        "id": "hiv7561",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1635788371.0
    },
    {
        "author": "hanamoge",
        "body": "So true, didn’t check that SP500 showing it just crossed $4,000.",
        "created_utc": 1635750356,
        "id": "hiuxns0",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1635779156.0
    },
    {
        "author": "domitros",
        "body": "Agreed on both parts, but after seeing him on Dave Lee I read a little bit about him and I could have sworn it said he was Chinese, but just looked again and Forbes says he was born in Indonesia. From now on I’ll just refer to him as Korean since I apparently don’t know",
        "created_utc": 1635754567,
        "id": "hiv21ot",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635783367.0
    },
    {
        "author": "Ehralur",
        "body": "Fair point. Although I wonder what Amazon's PE was before they had such a dominant position in the market. I believe it was even higher than Tesla's current PE.",
        "created_utc": 1635755404,
        "id": "hiv2vzg",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635784204.0
    },
    {
        "author": "FudgeSlapp",
        "body": "I was in Snap for a bit as well but not in it anymore. I was big on the Snapchat streaks thing. Everyday no question I’d try to keep the streak going. Eventually it just got boring and I couldn’t be bothered keeping it up. \n\nThe thing with social media is, when you’re younger and have more time it’s perfectly fine to have a bajillion different social media but now I can only have time for 2. Snap didn’t make the cut.",
        "created_utc": 1635756917,
        "id": "hiv4f9m",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635785717.0
    },
    {
        "author": "rbatra91",
        "body": "Rainy day funds are meant for rainy days. There’s nothing you can invest in that without risk. Cut it down to 3 months or so if you think your job is very secure.",
        "created_utc": 1635755681,
        "id": "hiv361h",
        "score": 2,
        "subreddit": "investing",
        "created": 1635784481.0
    },
    {
        "author": "Time_Kaleidoscope",
        "body": "When I joined Wall Street bets it was about being a degenerate and gambling. Since Covid and GME a lot of normies have come here and think just because they’ve reached some net worth milestone it’s worth posting… and it really isn’t. There’s always a bigger fish and your portfolio isn’t special. Making a ten bagger on some wild otm option play with a few grand is immensely more impressive and cool than some loser sitting in Tesla shares for the past 2 years and I’m tired of people posting it like it’s some kinda accomplishment",
        "created_utc": 1635757069,
        "id": "hiv4kon",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635785869.0
    },
    {
        "author": "banking_complaints",
        "body": "Xi is popping the everything bubble instead of using trillion dollar butt plugs to stop Wall St's prolapsing asshole from completely falling out. Some blind asswipe yells 'Tossla for $3000' another asswipe also blind rushes in to buy it in hopes of selling it for $4000 or the current fake market, speculation gone wild scenario. China tried this, got wise and knows there are no options left, all assholes that speculated on greed vs actual long term investments will be hanged/left to die. Munger, Buffet are bait to lure in the last victims, marketing gimmicks like Jordan selling Nkikes.",
        "created_utc": 1635750193,
        "id": "hiuxh4w",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635778993.0
    },
    {
        "author": "Wombleshart",
        "body": "I’ve looked at both of these companies recently. You are braver than me if you pull the trigger. Reading their earnings call transcripts and reports, Chinese regulations in tech, data sharing and also interest rates are hammering profits. It may turn around, it may kill their profits. I’m not in a position to punt in this when there are plenty of quality US fintech/neobanks out there. If you do take a punt, best of luck to you. I’ll be watching the prices and cheering for you.",
        "created_utc": 1635755909,
        "id": "hiv3ef7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635784709.0
    },
    {
        "author": "HustlingHorse",
        "body": "  \n**Question about S&amp;P 500**\n\n  \nIs it stupid to put all my savings ($500) in the S&amp;P 500 for a while just to have compound growth? And any additional savings will go into different stocks which I personally think will succeed?  \nAge: 14  \nCountry: United Arab Emirates  \nEmployment: High School, allowance  \nObjectives: Savings for college  \nTime Horizon: 4 years  \nRisk tolerance: Don't mind losing money as long as it's not tremendous (60%)  \nHoldings: None  \nDebts: no  \nFinancial Information: N/A",
        "created_utc": 1635752242,
        "id": "hiuznm2",
        "score": 2,
        "subreddit": "investing",
        "created": 1635781042.0
    },
    {
        "author": "Main-Brilliant6231",
        "body": "Very true. I do an extremely high amount of due diligence on every position, and know warning signs to unpack myself if needed. I’m fortunate to have spent a life in manufacturing so a lot of the minutea (how is that word spelled?) is known to me. I do openly reject the diversification concept. For me, personally, I find the top performer and ride it. Way easier than trying to pick 10-20 securities.",
        "created_utc": 1635758638,
        "id": "hiv661l",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635787438.0
    },
    {
        "author": "Thereisnopurpose12",
        "body": "No one said he wasn't successful. The internet makes fun of everything and I just thought it was a funny joke and have nothing against the dude.",
        "created_utc": 1635758840,
        "id": "hiv6dit",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635787640.0
    },
    {
        "author": "thurst777",
        "body": "It's really a good faith system if the stock doesn't pay a dividend.  If they pay a dividend then people will want to own it for the dividend payment.  So you can see a physical, tangible value.  If there is no dividend, then you need to have faith that the stock have value, we all hope they go up as the company becomes more valuable.  Now if you own enough shares you get a stronger say in how the company is run through share voting.  If you own the majority of share you can actually dictate, to some extent, how the company is runned.  So the higher ups in the company tend to own a decent portion of the company to have these votes.  It's also always on the table for the company to buy back more shares, that way they can keep more of the profits in house.  \n\nBut you are not wrong in the way you are seeing things.  If everyone were to collectivelt say this piece of paper isn't worth shit, and try to sell off.  They could all be worth nothing.  But the system has been in place for a long time.  You also have legal rights as a share holder and there are other mechanisms that make the stock have a cash value.",
        "created_utc": 1635753055,
        "id": "hiv0hq8",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635781855.0
    },
    {
        "author": "bartturner",
        "body": "Would think the problem would be worse for the companies not named Google, Apple, Amazon, Facebook, Tesla or Microsoft.\n\nStill think the big guys are going to be able to attract the talent pretty easily.   I highly doubt Google is struggling to get resumes.\n\nBut the smaller tech companies it is going to get worse I suspect.  Specially if things economically start going bad.  That is what happened with the .Com bust.     Engineers gravitated more to safe jobs.   With more stable companies that they have heard of.  Like the big guys.",
        "created_utc": 1635758351,
        "id": "hiv5v98",
        "score": 2,
        "subreddit": "investing",
        "created": 1635787151.0
    },
    {
        "author": "Itonlygetshigher420",
        "body": "&gt;UGE \n\nny country and everything neighboring it nuclear free for about 10,000k in all direction. \n\nBut, almost every big house and commerical building is coming with panels that have 30 year minimum lives in them. Solar tech has come along way. Nuclear when done right, is the answer, but humans cant be trusted so it's a no from me.",
        "created_utc": 1635758778,
        "id": "hiv6b7d",
        "score": 2,
        "subreddit": "investing",
        "created": 1635787578.0
    },
    {
        "author": "TontineSoleSurvivor",
        "body": "But in the end the bet turned out to be a fraud and the guy couldn’t pay up…. A key part to the plot. It identified him as a fraud but that offered no solace to the guy whose vocal chords were severed.",
        "created_utc": 1635759254,
        "id": "hiv6t3i",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635788054.0
    },
    {
        "author": "Difficult-Garage8985",
        "body": "Lots of people here explaining fundamental reasons why they *should* have value (and these are valid reasons) but the honest answer 90% of the time is simply that they go up. Many popular stocks don't pay dividends, and most of the people buying them don't care about voting either. They buy them because they expect the value to increase over time. The value of most if not all stocks is significantly higher than it would be if they were bought for the real reasons they are supposed to exist and not due to speculation or inflation hedging. This is only amplified by the fact that most investing now is totally passive.",
        "created_utc": 1635751996,
        "id": "hiuze3e",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635780796.0
    },
    {
        "author": "Chgralac73",
        "body": "well kinda think about it. if blackrock buys everything out, what price would zillow as company have if they have no homes on sale on their website?",
        "created_utc": 1635753235,
        "id": "hiv0oif",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635782035.0
    },
    {
        "author": "ConceptAutomatic1673",
        "body": "Right. Well I'm in the very modest investment category and not wanting excessive risk so I feel longer term for me works best. I don't have the knowledge or the stomach to swing trade. I want to get enough $ in here before it goes to mainstream or gets too far along in trials to make it worth while. Soon I think this sector will become prob only 2o% of my portfolio.",
        "created_utc": 1635754993,
        "id": "hiv2h4o",
        "score": 2,
        "subreddit": "shroomstocks",
        "created": 1635783793.0
    },
    {
        "author": "Itonlygetshigher420",
        "body": "and many nations are nuclear free or are phasing away from it...just not worth it.\n\nSolar is becoming so much more adaptable and easier and growth has been crazy sector wide.",
        "created_utc": 1635758121,
        "id": "hiv5mvr",
        "score": 2,
        "subreddit": "investing",
        "created": 1635786921.0
    },
    {
        "author": "omen_tenebris",
        "body": "They can't do it, yet*",
        "created_utc": 1635756429,
        "id": "hiv3xdb",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635785229.0
    },
    {
        "author": "domitros",
        "body": "Said he needs 300b before he dies, so he can give it away. Guys crazy and determined",
        "created_utc": 1635756616,
        "id": "hiv449f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635785416.0
    },
    {
        "author": "OptimalVanilla",
        "body": "Do you have any specific places of where to start learning or good reading? I want to learn more about it but there is a lot of rubbish out there.",
        "created_utc": 1635758038,
        "id": "hiv5jsk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635786838.0
    },
    {
        "author": "HikariAnti",
        "body": "The question isn't weather or not a crash will happen, but when. So it's not about exiting now, it's about having an exit strategy for when it happens. And not just any exit strategy but something that will actually stay relatively stable. You don't want jump from a sinking ship to another that's already half under water.",
        "created_utc": 1635757877,
        "id": "hiv5dz4",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1635786677.0
    },
    {
        "author": "Several_Situation887",
        "body": "Is there some specific task that buying a Macbook will allow you to accomplish that will help you earn more money?\n\nIf not, then I'd vote for saving your money. The money will be more useful as a tool to grow your holdings, than it will fulfilling your want of a fancy laptop.",
        "created_utc": 1635759391,
        "id": "hiv6yc2",
        "score": 1,
        "subreddit": "options",
        "created": 1635788191.0
    },
    {
        "author": "crimeo",
        "body": "It is the amount that a private bank can get in interest overnight by handing over spare cash to the central bank to hold.",
        "created_utc": 1635752810,
        "id": "hiv08oi",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1635781610.0
    },
    {
        "author": "iamnewnewnew",
        "body": "I find the timing very odd that American airline is having the exact same issue LUV had. \"weather issues\"\n\nIm wondering if they are making sure to quote weather issues as 1 of the main problem so that it makes them not as liable for refunds.",
        "created_utc": 1635750329,
        "id": "hiuxmo9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635779129.0
    },
    {
        "author": "PlsDontNuke",
        "body": "My life has no purpose for me because all I wanted out of life was to find a really great girl that cares about me as much as I care about her and instead I found out females don't really care that much about guys like me. \n\nThis obviously gives me the urge to just let humanity go extinct, but since we're the only intelligent lifeform on the planet and we've already destabilized the biosphere, we kinda have to stick around to clean up our messes.\n\nSo despite my life having no purpose for me, it seems it has a purpose for everyone else, which is that I'm here to try to lead people through the crisis they've created and find some way to avoid extinction. \n\nI am indeed running for public office but not until 2036, if elections still exist by then. Either way, more importantly I'm saving up for a robot army that can solve the issue much more effectively than public office. \n\nAnyway, do you recycle? Or do you just put recyclable shit in a recycling bin and never find out where it actually goes? Because if you actually handle your own recycling then great, you're one of those few people who actually tries your best and I was wrong to call you my event. But if you just send your shit to go get co-mingled into the same landfill as your trash, and you call that recycling, shut the fuck up and deep throat my dick. \n\nBut guess what? You don't have to be a political figure or anything to just try your best. I've at least established a home on sustainable land where I help out with the farm when I can and I keep helping improve the property to prepare for what's to come. Thanks to me I have a pretty clear idea of how me and my loved ones can survive everything short of bunker time and I'm still working on something for bunker time. One year ago, I had no idea how I would survive grocery stores running out of food, and neither did any of my loved ones. These resources are available to us now and I have this connection with a farm and live in it now because of my effort and choices.\n\nSimply trying to live sustainably enough to survive is me taking responsibility for my survival and trying my best to avoid extinction at the simplest individual scale. Have you even done that? Have you even got a clear idea of how you're going to be keeping YOURSELF alive, let alone your loved ones, without draining resources that other, smarter, more responsible people prepared while you were jerking off about how you recycle? \n\nIf I have a vastly inflated sense of myself and no realistic conception of the world, that's wonderful. I can only hope I'll meet a really nice girl and we'll start a family and get old together while agriculture just keeps working fine and the weather somehow gets under control. Too bad that's not going to happen.",
        "created_utc": 1635759144,
        "id": "hiv6oxy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635787944.0
    },
    {
        "author": "teteban79",
        "body": "I've been looking at it for a while and having heated discussions in here about it. It's too risky for me either way. Although I lean to the bear side, I don't see a good risk reward relation to short it right now. \n\nI see it going mostly sideways, maybe slowly dipping, until year end. IV is still high  considering there will probably be no news until then. I'm probably going to sell a few .40 delta or so weekly strangles on this. Something like 42P/45C",
        "created_utc": 1635758497,
        "id": "hiv60se",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635787297.0
    },
    {
        "author": "AutoModerator",
        "body": "Your submission was removed because it is a short post. Any self-post below 400 characters in the body will be removed.  Please refer to rule 6 and make sure your post meets our standards of effort. Automod evasion will be met with a lengthy ban. Do not post just an article; highlight the parts of the article you find relevant or offer some commentary surrounding the article. Self-posts that offer some simple thoughts or questions like \"what do you think\", \"here's my thoughts\", etc. belong as comments to existing posts or the [Daily Advice Thread](https://www.reddit.com/r/investing/about/sticky?num=2).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
        "created_utc": 1635750717,
        "id": "hiuy1he",
        "score": 1,
        "subreddit": "investing",
        "created": 1635779517.0
    },
    {
        "author": "mellov22",
        "body": "SHIB, I mean, it can only go up right?",
        "created_utc": 1635750758,
        "id": "hiuy31a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635779558.0
    },
    {
        "author": "Wtfisthatt",
        "body": "As somebody that is teaching myself to program that gives me hope. I’m still not there yet, but I enjoy it and take pride in producing things of quality so hopefully that’ll come through when I start doing interviews. Still working on building a solid foundation.",
        "created_utc": 1635751042,
        "id": "hiuydr5",
        "score": 1,
        "subreddit": "investing",
        "created": 1635779842.0
    },
    {
        "author": "I_say_wrong_things",
        "body": "Everyone is tech bullish but my guess would be medicine stocks. \n\nCrispr should get its first steps in real life uses. Cure for cancer is being talked about. Probably more stuff we know nothing about. \n\nTech is nice but it feels like we hit ceiling, we get slightly better and faster stuff, but fundamentally we are stuck in a same place from like 2014 or even earlier. Phones, pcs and other tech have had numbers bump and nothing else. We will see if zucks plan will work out. How many people will buy this offer and live in his metaverse.",
        "created_utc": 1635750232,
        "id": "hiuxiqx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635779032.0
    },
    {
        "author": "audaciousmonk",
        "body": "Specifically that the 6 billion wouldn’t be spent effectively, nor would a lot of it actually be spent on expenses / initial estimate with direct impact",
        "created_utc": 1635751509,
        "id": "hiuyvs9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635780309.0
    },
    {
        "author": "daxtaslapp",
        "body": "yes it does not matter. you invest x amount and you are up a % or down. thats it. doesnt matter how many shares. I guess if you wanna see how many shares you own out of the total amount of shares available it would kind of matter. other than that it doesnt",
        "created_utc": 1635751708,
        "id": "hiuz3a5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635780508.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because it was either DD or Discussion and not a text post.",
        "created_utc": 1635752237,
        "id": "hiuznf5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635781037.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because was too short. Please make it a comment if it's not worth expounding on.",
        "created_utc": 1635755900,
        "id": "hiv3e4l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635784700.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because was too short. Please make it a comment if it's not worth expounding on.",
        "created_utc": 1635756343,
        "id": "hiv3u9b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635785143.0
    },
    {
        "author": "simplysufficient88",
        "body": "To be entirely fair here, this whole thing’s based on a really bad article title. Everyone’s quoting the CNN article that makes it sound as though the WFP director was claiming all you’d need is $6 billion to solve all hunger. When the actual statement he made was that it would help to fix the growth in world hunger issues we’ve seen recently, not that it would solve hunger entirely. He very specifically mentions that this is a one time donation that would help 42 million people that need immediate aid, but that wouldn’t be a long term fix. Even the CNN article itself now has a correction at the very bottom acknowledging this was a misleading title. \n\nObviously this is all an over simplification of the issue and you can’t just throw money at it to fix it, but the point he was trying to make wasn’t that one donation from one billionaire would permanently solve all hunger but that a one time donation from MULTIPLE of the world’s wealthiest individuals would help save a lot of people in the short term. I think that’s a pretty massive difference.",
        "created_utc": 1635772963,
        "id": "hivq68e",
        "score": 3191,
        "subreddit": "wallstreetbets",
        "created": 1635801763.0
    },
    {
        "author": "ABuddingScientist",
        "body": "Okay, now what if I whipped it all out and I'm still last?",
        "created_utc": 1635830275,
        "id": "hiz8ohm",
        "score": 1698,
        "subreddit": "wallstreetbets",
        "created": 1635859075.0
    },
    {
        "author": "ovad67",
        "body": "With the drink market it’s make it until you’re acquired by Coke, Pepsi or Nestle.",
        "created_utc": 1635777063,
        "id": "hivykkg",
        "score": 1638,
        "subreddit": "stocks",
        "created": 1635805863.0
    },
    {
        "author": "philiproberts1234",
        "body": "&gt; “If whipping it out is sure to result in victory, than you must whip it out, even though the ruler forbid it; if whipping it out will not result in victory, then you must not whip it out” ~ Sun Tzu",
        "created_utc": 1635831572,
        "id": "hizafqq",
        "score": 1296,
        "subreddit": "wallstreetbets",
        "created": 1635860372.0
    },
    {
        "author": "magnament",
        "body": "And it kept working",
        "created_utc": 1635792364,
        "id": "hiwyene",
        "score": 1144,
        "subreddit": "wallstreetbets",
        "created": 1635821164.0
    },
    {
        "author": "ATMcalls",
        "body": "Well it helps when you draw trend lines all over the place, however you want to 🤣",
        "created_utc": 1635792960,
        "id": "hiwzuxi",
        "score": 964,
        "subreddit": "wallstreetbets",
        "created": 1635821760.0
    },
    {
        "author": "5280StonksOnlyGoUp",
        "body": "I admire your inverse u/deepfuckinvalue approach. You may hit legendary WSB status when it hits $2,100 EOW, Godspeed.",
        "created_utc": 1635802660,
        "id": "hixnom4",
        "score": 814,
        "subreddit": "wallstreetbets",
        "created": 1635831460.0
    },
    {
        "author": "Stantron",
        "body": "Don't call my triangle descending!! It is brave and beautiful.",
        "created_utc": 1635792973,
        "id": "hiwzw1m",
        "score": 797,
        "subreddit": "wallstreetbets",
        "created": 1635821773.0
    },
    {
        "author": "theStunbox",
        "body": "And I kept doing it every month when I got another paycheck :-)",
        "created_utc": 1635792921,
        "id": "hiwzrm9",
        "score": 526,
        "subreddit": "wallstreetbets",
        "created": 1635821721.0
    },
    {
        "author": "skD1am0nd",
        "body": "Read the story of Bob, the worst market timer\n\nhttps://awealthofcommonsense.com/2014/02/worlds-worst-market-timer/\n\nAs others have stated, if you are in for long term then you should put your money in the market. It is unlikely you’ll be able to time the market. And as the saying goes “time in the market beats market timing”. \n\nIf really nervous then dollar cost average into the market over some time period.",
        "created_utc": 1635791302,
        "id": "hiwvtap",
        "score": 508,
        "subreddit": "investing",
        "created": 1635820102.0
    },
    {
        "author": "neko1985",
        "body": "Now make it $12 again.",
        "created_utc": 1635801673,
        "id": "hixlal3",
        "score": 505,
        "subreddit": "wallstreetbets",
        "created": 1635830473.0
    },
    {
        "author": "PanicAtTheFishIsle",
        "body": "Some retard online said it was going to millions so way the hell not hold it. I’m already up 5x…. plus I have a chronic gambling addiction.",
        "created_utc": 1635796066,
        "id": "hix7gix",
        "score": 448,
        "subreddit": "wallstreetbets",
        "created": 1635824866.0
    },
    {
        "author": "Dorktastical",
        "body": "if there is a dick measuring contest, I assure you it is me that will measure the most dicks",
        "created_utc": 1635835563,
        "id": "hizfb8a",
        "score": 435,
        "subreddit": "wallstreetbets",
        "created": 1635864363.0
    },
    {
        "author": "spacebar_x",
        "body": "They'll will probably buy Tesla and make it $12 B in a year.",
        "created_utc": 1635777208,
        "id": "hivyvvg",
        "score": 407,
        "subreddit": "wallstreetbets",
        "created": 1635806008.0
    },
    {
        "author": "dyndo101",
        "body": "Doesn't matter he sold them way too far out for it to be smart",
        "created_utc": 1635789251,
        "id": "hiwqtva",
        "score": 340,
        "subreddit": "wallstreetbets",
        "created": 1635818051.0
    },
    {
        "author": "chillintheforest",
        "body": "Seriously, it's crazy that CNN, Fox News, etc are allowed to call themselves \"news\" or even imply it in any way. They're all complete trash that at their best are misleading biased bullshit.\n\nThen like you said, when they inevitably get something horribly wrong they just throw a correction at the bottom, knowing damn well that the majority of people barely make it past the headline.",
        "created_utc": 1635774839,
        "id": "hivtux6",
        "score": 337,
        "subreddit": "wallstreetbets",
        "created": 1635803639.0
    },
    {
        "author": "Educational-Nail7583",
        "body": "A cornered foe will whip it all out.",
        "created_utc": 1635832029,
        "id": "hizb1hh",
        "score": 322,
        "subreddit": "wallstreetbets",
        "created": 1635860829.0
    },
    {
        "author": "Marcusaralius76",
        "body": "I asked my magic 8 ball what will go up next year.  It said \"you do you\"",
        "created_utc": 1635785080,
        "id": "hiwgqff",
        "score": 316,
        "subreddit": "investing",
        "created": 1635813880.0
    },
    {
        "author": "chodmode2",
        "body": "## With $6B I'll buy TSLA calls and cause a gamma squeeze. TSLA over $9000 called it here folks",
        "created_utc": 1635776203,
        "id": "hivwour",
        "score": 316,
        "subreddit": "wallstreetbets",
        "created": 1635805003.0
    },
    {
        "author": "Past_Ad5078",
        "body": "Great, see you when you lose it all, go in debt, and have to ![img](emote|t5_2th52|4267)",
        "created_utc": 1635844490,
        "id": "hizp2ar",
        "score": 292,
        "subreddit": "wallstreetbets",
        "created": 1635873290.0
    },
    {
        "author": "Rand_alThor_",
        "body": "It just came out you fucking zoomer",
        "created_utc": 1635766512,
        "id": "hivfnwi",
        "score": 280,
        "subreddit": "wallstreetbets",
        "created": 1635795312.0
    },
    {
        "author": "d10k6",
        "body": "If you don’t understand why people buy it then why did *you* buy it?",
        "created_utc": 1635774669,
        "id": "hivtii4",
        "score": 263,
        "subreddit": "CanadianInvestor",
        "created": 1635803469.0
    },
    {
        "author": "thatguy425",
        "body": "The entire company is making acquisitions. If they can’t buy something they will throw enough engineers at it to make something better. Probably the best stock you could own right now for a long hold.",
        "created_utc": 1635804782,
        "id": "hixsp95",
        "score": 235,
        "subreddit": "stocks",
        "created": 1635833582.0
    },
    {
        "author": "damnatio_memoriae",
        "body": "it was $12M not $12.... so.... incredible, yes, but not a gain...",
        "created_utc": 1635805994,
        "id": "hixvh4h",
        "score": 223,
        "subreddit": "wallstreetbets",
        "created": 1635834794.0
    },
    {
        "author": "may178",
        "body": "Everytime I do, it makes me laugh",
        "created_utc": 1635824107,
        "id": "hiyyx63",
        "score": 206,
        "subreddit": "wallstreetbets",
        "created": 1635852907.0
    },
    {
        "author": "dafazman",
        "body": "or when it goes to $210 🤷🏽‍♂️ I'm curious how this plays out since I have no horse in this race",
        "created_utc": 1635806040,
        "id": "hixvkzo",
        "score": 197,
        "subreddit": "wallstreetbets",
        "created": 1635834840.0
    },
    {
        "author": "radikul",
        "body": "I bought 41 shares when it dipped to $55 in late January and held EVERY. SINGLE. ONE.\n\nDIAMONDS ARE FOREVERRRRR 🙌🏼💎💎",
        "created_utc": 1635821356,
        "id": "hiythfh",
        "score": 197,
        "subreddit": "wallstreetbets",
        "created": 1635850156.0
    },
    {
        "author": "zlickrick",
        "body": "I mean, whos to say whats real in crypto anymore? We have CEOs of trillion dollar market caps pumping doge. Akita coin and shiba inu just happen to be dogs too, so I guess that makes them legit, also? Then theres Poo coin, CUM coin, you name it. Its basically a popularity contest. A giant game of 50/50.",
        "created_utc": 1635821329,
        "id": "hiytfhp",
        "score": 180,
        "subreddit": "CanadianInvestor",
        "created": 1635850129.0
    },
    {
        "author": "s1amvl25",
        "body": "Holy shit, so instead of learning why people buy it and how to buy it for cheaper you decided to go on reddit and say wow this thing sucks. Sick",
        "created_utc": 1635780190,
        "id": "hiw5h73",
        "score": 178,
        "subreddit": "CanadianInvestor",
        "created": 1635808990.0
    },
    {
        "author": "MrTinybrain",
        "body": "Yeah it looks totally different when you line it up correctly:\n\nhttps://imgur.com/a/XlR2Ynr",
        "created_utc": 1635797943,
        "id": "hixc4vg",
        "score": 176,
        "subreddit": "wallstreetbets",
        "created": 1635826743.0
    },
    {
        "author": "SnafuTurtle",
        "body": "Holy shit, just take all my money and dick around with it, you can keep half of the profits",
        "created_utc": 1635797453,
        "id": "hixawjo",
        "score": 164,
        "subreddit": "wallstreetbets",
        "created": 1635826253.0
    },
    {
        "author": "wild_b_cat",
        "body": "Take a look at any chart of the market, and zoom waaaaaaay out to look at decades. You will see that over time the trend line is strongly upwards and short-term wobbles don't have a huge impact. If you're investing for decades away, you can afford to be patient.\n\nNow, if your timeline is shorter than that, then you're right to be cautious. What's your ultimate goal with this money, and when do you expect to need it?",
        "created_utc": 1635790809,
        "id": "hiwum4o",
        "score": 162,
        "subreddit": "investing",
        "created": 1635819609.0
    },
    {
        "author": "dmitsuki",
        "body": "Holy fuck. How hard is it to just post what you are going to fucking do on Twitter. Go to Twitlonger. He literally can't comprehend not doing it behind closed doors. Elon Musk literally built a fucking battery array in Australia over a tweet, so he'd actually be good for it. This shit is insane. Make the fucking tweet.",
        "created_utc": 1635788787,
        "id": "hiwpp73",
        "score": 162,
        "subreddit": "wallstreetbets",
        "created": 1635817587.0
    },
    {
        "author": "Huge_Dot",
        "body": "No need for a deep dive, I know exactly what's happening. I finally sold a call against my stock and it skyrocketed today. I haven't sold any for the last 4 months which you can see is when it was trading flat. Anyone who is long, you're welcome.",
        "created_utc": 1635804634,
        "id": "hixsd1x",
        "score": 162,
        "subreddit": "wallstreetbets",
        "created": 1635833434.0
    },
    {
        "author": "wahchewie",
        "body": "Remember the famous live aid that queen did In the eighties? The one the entire freddy mercury movie revolved around . They raised over £40 million for Ethiopia  famine relief, it was amazing.\n\nMajority of that food, rotted. Sat on the docks and not distributed to the people that needed it . Indeed, much of the money was stolen by the government causing the famine in the first place\n\nWorld hunger can't be fixed by money.. not convinced it can be fixed by anything short of toppling governments and rebuilding countries which.. is never going to happen",
        "created_utc": 1635774946,
        "id": "hivu2pb",
        "score": 152,
        "subreddit": "wallstreetbets",
        "created": 1635803746.0
    },
    {
        "author": "SeeThroughBanana",
        "body": "Wsb has become trash. It used to be about investment bets. Now its all about meming over stupid topics with the most outrageous takes with no relevance to actual investing.",
        "created_utc": 1635817614,
        "id": "hiylj0v",
        "score": 150,
        "subreddit": "wallstreetbets",
        "created": 1635846414.0
    },
    {
        "author": "veilwalker",
        "body": "A lot of the commenting in here is missing the point.\n\nThe wealthy class and in particular the ultra-wealthy aren't paying much, if any, taxes on their earnings due to the way our system is setup. This isn't the forum for breaking down the US tax code but the last major overhaul was in the 1980s. It is well past time to clean up our tax code and put in a more efficient and fair system of taxation from the have-nots to the have-alots.\n\nI want to see a fairer system in place so that more of the wealth created under our system is put to use for the benefit of everyone in our system. \n\nEurope has issues as well but has a much stronger social safety net and is still a reasonably successful economy, etc.\n\nThe govt. does a lot of good things with the money that is collected through taxes and could do more good if everyone paid a similar % of their earnings, whether capital or earned.\n\nThe govt. also spends on items that different groups of us are opposed to but that is the give and take that we all must work with.\n\nFor every \"good\" ultra-wealthy there are multiple examples of \"bad\" ultra-wealthy. I have no opinion on where Elon falls on the scale of good to bad.",
        "created_utc": 1635789310,
        "id": "hiwqz24",
        "score": 148,
        "subreddit": "StockMarket",
        "created": 1635818110.0
    },
    {
        "author": "cosmic_backlash",
        "body": "You should write a short thesis paragraph on why each investment is a good investment going forward. Don't ask people for their DD. Look at their fundamentals - are they profitable? are they close to profitable?  Are their margins improving? Is their industry growing? Are the expanding into new product lines? Would you use their service?\n\nAfter you're done, sell the ones that fail to have a good thesis for holding. Don't think about how much you lost - it doesn't matter any more. What matters is you can use those funds to buy good stocks that do have a good thesis going forward.",
        "created_utc": 1635802165,
        "id": "hixmhkb",
        "score": 145,
        "subreddit": "StockMarket",
        "created": 1635830965.0
    },
    {
        "author": "Nuts4ducks",
        "body": "These two words did it to me 🤣",
        "created_utc": 1635816114,
        "id": "hiyi7ol",
        "score": 142,
        "subreddit": "options",
        "created": 1635844914.0
    },
    {
        "author": "1slinkydink1",
        "body": "I instinctively read it as Under Armor and was confused reading the details.",
        "created_utc": 1635781608,
        "id": "hiw8p77",
        "score": 139,
        "subreddit": "stocks",
        "created": 1635810408.0
    },
    {
        "author": "Requonio",
        "body": "I'm surprised they didn't own it already. My college campus is a coke campus (they only have coke products for drinks) and Bodyarmor is one of the drinks they serve in some of the grab and go dining areas.\n\nShits still way better than Powerade though",
        "created_utc": 1635777281,
        "id": "hivz1qi",
        "score": 131,
        "subreddit": "stocks",
        "created": 1635806081.0
    },
    {
        "author": "rsicher1",
        "body": "Every time someone says Tesla is overvalued, it goes up more out of spite",
        "created_utc": 1635822124,
        "id": "hiyv1rs",
        "score": 128,
        "subreddit": "wallstreetbets",
        "created": 1635850924.0
    },
    {
        "author": "mediumrarestonks",
        "body": "It's art really, to see the interview and see this can be made from it.\n\nAlchemy.",
        "created_utc": 1635780135,
        "id": "hiw5cua",
        "score": 127,
        "subreddit": "wallstreetbets",
        "created": 1635808935.0
    },
    {
        "author": "DrOctopus-",
        "body": "Please realize that we are also now looking at a potential stock split (last split stock rose 80% after announcement), Moody's credit rating to investment grade in December highly likely, Q4 earnings will kill it again, both Berlin and Texas factories come online with lots of press November &amp; December. This can keep going up for months.",
        "created_utc": 1635815464,
        "id": "hiygs81",
        "score": 117,
        "subreddit": "wallstreetbets",
        "created": 1635844264.0
    },
    {
        "author": "DarthMeta",
        "body": "My dick goes acroooooooooss the room, and it starts to drink your milkshake.  It drinks it up!",
        "created_utc": 1635832084,
        "id": "hizb421",
        "score": 117,
        "subreddit": "wallstreetbets",
        "created": 1635860884.0
    },
    {
        "author": "Anarchist73",
        "body": "You'll get there someday retarded king, just keep at it",
        "created_utc": 1635803716,
        "id": "hixq78w",
        "score": 116,
        "subreddit": "wallstreetbets",
        "created": 1635832516.0
    },
    {
        "author": "mavantix",
        "body": "Give it all to me, I can do it in under a week.",
        "created_utc": 1635823764,
        "id": "hiyya27",
        "score": 116,
        "subreddit": "wallstreetbets",
        "created": 1635852564.0
    },
    {
        "author": "Isaeu",
        "body": "It’s smart to take profits at this level, but it will still go up for no fucking reason.",
        "created_utc": 1635815514,
        "id": "hiygw6r",
        "score": 114,
        "subreddit": "stocks",
        "created": 1635844314.0
    },
    {
        "author": "banditcleaner2",
        "body": "i had 15k at 19 as well...from working full time jobs since 15 and having no bills. the key part is no bills. minimum wage ain't shit, but it is shit when you literally don't spend money and only work cuz ur parents made you",
        "created_utc": 1635793775,
        "id": "hix1tta",
        "score": 113,
        "subreddit": "wallstreetbets",
        "created": 1635822575.0
    },
    {
        "author": "lolb00bz_69",
        "body": "It hoits inside  but fair fair",
        "created_utc": 1635798582,
        "id": "hixdqys",
        "score": 104,
        "subreddit": "wallstreetbets",
        "created": 1635827382.0
    },
    {
        "author": "OmgYoshiPLZ",
        "body": "you could absolutely 1000% solve world hunger with 6 billion dollars. \n\n1. It would take 100 Nuclear warheads to completely wipe out all human life on the planet. \n2. The cost of one nuclear warhead is 28M dollars. \n3. detonating 100 nuclear warheads across the globe would initiate nuclear winter, and wipe out most if not all human life on the planet. \n\nboom, world hunger solved. And at a measly 2.8 billion dollars - merely half of musk's proposal.  as an added bonus, the soot release from these explosions would blanket the earth in darkness for over a decade, effectively solving Global warming, and droping the planets tempature by about 10 degrees globally, and we would also solve our trash oceans too, as they wont be adding any more trash to it! \n\nI'll take my 6 billion now mr musk. i'll use the other 3.2 billion to build a few vaults so we can rebuild in a hundred years or so.",
        "created_utc": 1635790580,
        "id": "hiwu252",
        "score": 104,
        "subreddit": "wallstreetbets",
        "created": 1635819380.0
    },
    {
        "author": "Ctofaname",
        "body": "How hard is it to actually know what the actual source said? They didn't say end world hunger or stop world hunger or even help solve all world hunger. They said it would help 42 million people critically at risk.",
        "created_utc": 1635791471,
        "id": "hiww87f",
        "score": 104,
        "subreddit": "wallstreetbets",
        "created": 1635820271.0
    },
    {
        "author": "bitchfart007",
        "body": "A sign of another 10% day tom. If you have been paying close attention to the past metrics and analytical data, whenever a TSLA logo has formed after hours it has signaled towards a rally on the next day. This is a trick papa Elon used to send signals to the 0.001% smart retards and I have managed to crack it for you guys.\n\nTSLA to the moon confirmation.",
        "created_utc": 1635826989,
        "id": "hiz3twy",
        "score": 101,
        "subreddit": "wallstreetbets",
        "created": 1635855789.0
    },
    {
        "author": "B34STM4CH1N3",
        "body": "I thought you said you didn't get it?",
        "created_utc": 1635773927,
        "id": "hivs14a",
        "score": 98,
        "subreddit": "wallstreetbets",
        "created": 1635802727.0
    },
    {
        "author": "novoivittu",
        "body": "What if it goes backwards![img](emote|t5_2th52|4275)",
        "created_utc": 1635758186,
        "id": "hiv5p91",
        "score": 98,
        "subreddit": "wallstreetbets",
        "created": 1635786986.0
    },
    {
        "author": "OystersClamsCuckolds",
        "body": "What doesnt make it so compelling is that both of them have immensely underperformed the s&amp;p for the past years.",
        "created_utc": 1635783029,
        "id": "hiwbya2",
        "score": 97,
        "subreddit": "stocks",
        "created": 1635811829.0
    },
    {
        "author": "Don_K_Stamper",
        "body": "Whoever invested in that was probably going to get a card with ⏺️🔼⏹️ on it anyways. So at least they will have a funny story to tell while competing.",
        "created_utc": 1635820232,
        "id": "hiyr5kg",
        "score": 95,
        "subreddit": "CanadianInvestor",
        "created": 1635849032.0
    },
    {
        "author": "sebach22",
        "body": "At least sell like 500 shares and secure something, last thing you want to do is piss away student loan repayment. Then again, who knows if you actually have loans, so fuck it why not let it ride",
        "created_utc": 1635828756,
        "id": "hiz6jrz",
        "score": 91,
        "subreddit": "wallstreetbets",
        "created": 1635857556.0
    },
    {
        "author": "DaoFerret",
        "body": "Thank you for reminding people that they’ll owe taxes when they “cash some chips out” on winnings.\n\nToo many people forget and are in for a surprise if they didn’t think to cover it (and the price drops unexpectedly so they suddenly CAN’T cover it).",
        "created_utc": 1635843934,
        "id": "hizohgb",
        "score": 90,
        "subreddit": "wallstreetbets",
        "created": 1635872734.0
    },
    {
        "author": "wsbt4rd",
        "body": "This!\n\nBasically, when you invest $10,000, and you have a really good (or bad) day, and your portfolio moved 3%... That's $300...  You can basically fill up your truck and take your girlfriend out for dinner... By the time you've paid taxes on this, you might get a decent meal at Wendy's.\nNow, when you've $100,000 in the bank, then a 3% move starts to be \"real money\".\nWhen i crossed that threshold, i noticed that i would still trade batches of $2,000. I have to \"force myself\" to dump $20,000 into a new stock.\nSo yeah, as others said: start thinking in percentages.\nAnd I'd say, unless you have lifechanges, basically just keep doing what you're doing.\n\nRemember it's as difficult to get from 10k to 100k, as it will be too get from 100k to your first million.",
        "created_utc": 1635828340,
        "id": "hiz5xd6",
        "score": 87,
        "subreddit": "stocks",
        "created": 1635857140.0
    },
    {
        "author": "scablime",
        "body": "I’ve been using [Finviz](https://finviz.com/) since day 1. Their screener will provide you with a ton of filtering options to discover new stocks. I’ve also come across [Wall St Rank](https://www.wallstrank.com/?r=1) elsewhere. It’s essentially a fast way to see what the pros recommend, right? [This guy](https://www.tiktok.com/@austinhankwitz/video/6982358874992954630?_d=secCgYIASAHKAESMgowrSM1k%2FSUsILuUJXci%2Bb2moBhNnVr8T8%2BFU6Xx2FFDI02nWtuhn%2BB6aFZ84ejdJFOGgA%3D&amp;checksum=bef4158f4f2cc7d7a2a0d94bddacc34144b55577606b6ee5aa4b024583fff0d0&amp;language=en&amp;preview_pb=0&amp;sec_user_id=MS4wLjABAAAA-J9vaQ2C1_KXg_UWpeE2ROMGuftpC1jAkQV70Bvbx6vTugbQyN1wIRRfuk3vaAuG&amp;share_app_id=1233&amp;share_item_id=6982358874992954630&amp;share_link_id=C443B476-8919-453A-BE81-5DD6B80913A5&amp;source=h5_m&amp;timestamp=1625708098&amp;tt_from=copy&amp;u_code=d3b1ad0mjla856&amp;user_id=6628757945272909830&amp;utm_campaign=client_share&amp;utm_medium=ios&amp;utm_source=copy&amp;_r=1&amp;is_copy_url=1&amp;is_from_webapp=v1) explains it better than their website tbh.",
        "created_utc": 1635754480,
        "id": "hiv1ygt",
        "score": 87,
        "subreddit": "stocks",
        "created": 1635783280.0
    },
    {
        "author": "ThePandaRider",
        "body": "Yeah if you look at all the branks Coke and Pepsi own it makes for a pretty compelling reason to invest. They make pretty much all American snacks and non-alcoholic beverages.",
        "created_utc": 1635779930,
        "id": "hiw4w36",
        "score": 86,
        "subreddit": "stocks",
        "created": 1635808730.0
    },
    {
        "author": "EmanEwl",
        "body": "If you're paying taxes it means you're making money.   All you have to consider",
        "created_utc": 1635767606,
        "id": "hivh8qq",
        "score": 83,
        "subreddit": "wallstreetbets",
        "created": 1635796406.0
    },
    {
        "author": "rob5i",
        "body": "Last time I was in Phoenix (late 90's), out of curiosity I checked the price of a tiny house that looked like it was one step above a trailer home. It was so high I thought they put the comma in the wrong spot.",
        "created_utc": 1635779962,
        "id": "hiw4yoc",
        "score": 83,
        "subreddit": "StockMarket",
        "created": 1635808762.0
    },
    {
        "author": "Vi0lentByt3",
        "body": "Someone wrote you a letter telling you what a shit trader you are. Its one thing from random internet people, but to put it to print! Thats just cold",
        "created_utc": 1635841487,
        "id": "hizlvzw",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1635870287.0
    },
    {
        "author": "tape_measures",
        "body": "Its not unexpected.  Everyone knew it was going to happen in January.   Its going to have a huge drop over the next 2 years.  Fuel prices always cause a huge construction downturn",
        "created_utc": 1635788204,
        "id": "hiwo9rd",
        "score": 79,
        "subreddit": "investing",
        "created": 1635817004.0
    },
    {
        "author": "gemorris9",
        "body": "Aight dude. CC seller here. \n\nDefinitely not that size of account value. But basically you just need the Capitol to close your position. I'd wait till Tesla settles down and the IV drops back significantly before you do. But basically at max level options trading you can sell your shares and then close your positions with the money from the shares. \n\nIf you don't have this level of trading/margin available call your broker and they will do this for you. You get the net. Invest 90% in an ETF and never touch it again since you have a gambling addiction. \n\nBut definitely wait till Tesla settles down. Even if it ramps up another 200 bucks over the month. Wait till it does it's thing where it kinda trades down/sideways for 3 months. The IV drop will probably save you 50-100k when closing that position. \n\n\n\nAnd finally, you're not retarded for selling CC. You just have yourself a guaranteed win in exchange for money up front.",
        "created_utc": 1635797076,
        "id": "hix9yfp",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1635825876.0
    },
    {
        "author": "Lofibeats1988",
        "body": "That's what makes me laugh about this retard argument. Sure for $6 billion you could ensure every starving person on Earth gets a sandwich and maybe a can of Coke but what about after? Also the U.S government spends like $6 billion an hour so go ask them to solve world hunger. Idiots fail to understand the actual grunt work it would take to solve world hunger. Gathering enough food is actually one of the easier parts. You need infrastructure and a stable government to aid in distribution. Most of the countries with a starving population live in places run by war lords who would just hoard any food rich countries gift them. But yeah a few billionaires like Elon making money are why people in bum fuck Africa are starving.",
        "created_utc": 1635793292,
        "id": "hix0no7",
        "score": 75,
        "subreddit": "wallstreetbets",
        "created": 1635822092.0
    },
    {
        "author": "send_me_your_GUH",
        "body": "Never selling. Fuck that. I promised to hold this stock to 2 trillion. My entire portfolio is in it. In at 600 for my newest position, but traded it on and off at even lower levels.",
        "created_utc": 1635802202,
        "id": "hixmkoc",
        "score": 73,
        "subreddit": "stocks",
        "created": 1635831002.0
    },
    {
        "author": "TradeIdeas_87",
        "body": "Totally misleading headline. That’s not what he said nor is it an accurate paraphrasing. He challenged the misleading statement from the UN Food Prgramme chief claiming that for $6 billion world hunger could be solved challenging musk and bezos to contribute. Musk said if the UN could shore  how that was possible and were fully transparent in their accounting for how money would be spent, he would pay for it. Of course the UN won’t be able to do that as or was a ridiculous statement in the first place for the UN to make.",
        "created_utc": 1635785505,
        "id": "hiwhqlg",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1635814305.0
    },
    {
        "author": "trickydog98",
        "body": "But guy, what if it went the other way…. -75000 doesn’t sound like free cash to me",
        "created_utc": 1635797744,
        "id": "hixbmow",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1635826544.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/WarrenBuffettsBuffet (1/0) made a bet that TSLA would go to 1200.0 when it was 870.28 and it did, congrats retard.",
        "created_utc": 1635797931,
        "id": "hixc3s8",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1635826731.0
    },
    {
        "author": "BullionSlut69",
        "body": "The thing is, realtors do serve a purpose. They are supposed to help you buy a good home, including getting inspections and also having access to industry knowledge. I had a guy I knew in the military who approached a realtor, the realtor already knew someone who wanted a house like theirs, and they were only on the market for 48 hours before the realtor set them up with the buyer they knew. Sold for 50k more than they put it up for, and they were done in a week. Zillow doesn’t really offer that experience, and to be honest, I’d never buy a HOUSE through a website. I’ve worked on houses, I know how many secrets an unscrupulous owner can hide. I’d doubt strongly that Zillow is checking these houses properly.",
        "created_utc": 1635770822,
        "id": "hivmbq0",
        "score": 68,
        "subreddit": "StockMarket",
        "created": 1635799622.0
    },
    {
        "author": "ATMcalls",
        "body": "What’s with people putting their age on their gain posts? Is that supposed to make it more impressive or?",
        "created_utc": 1635799380,
        "id": "hixfqls",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1635828180.0
    },
    {
        "author": "halfdecenttakes",
        "body": "Man, I saw somebody at a local YMCA fucking living it up at the donors expense. I can't imagine what huge charities are pulling in.   \n\n\nThey had bought a house and new vehicles and a ton of other shit and had it all down as company expenses. Shit is wild.",
        "created_utc": 1635774021,
        "id": "hivs7ve",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1635802821.0
    },
    {
        "author": "StonkGoUp",
        "body": "Every day I hate myself for not buying Tesla and every day I still resist the temptation to buy it",
        "created_utc": 1635800918,
        "id": "hixjhpf",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1635829718.0
    },
    {
        "author": "Dasky34",
        "body": "Amazon isn't a niche. It's broad. Gamestop can focus on niche and that's where big box cannot compete.\n\nThere's a market for specificity. RC has done it before, and many think he'll do it again.",
        "created_utc": 1635790589,
        "id": "hiwu2w9",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1635819389.0
    },
    {
        "author": "5280StonksOnlyGoUp",
        "body": "The AI is actually best in class by a mile and it gets better every day. We know your just upset b/c you've passed on this 20 bagger multiple times.",
        "created_utc": 1635808125,
        "id": "hiy0cq6",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1635836925.0
    },
    {
        "author": "RoyalFail6",
        "body": "Fundamentals don’t matter?\n\nIt never did.\n\n🌎 🧑‍🚀🔫👨‍🚀",
        "created_utc": 1635798131,
        "id": "hixclyw",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1635826931.0
    },
    {
        "author": "throwaway_0x90",
        "body": "The sequel to the movie The Big Short will be about whoever eventually guesses right on the timing of Tesla's downfall - instant billionaire, if it ever happens. At this rate though I think Tesla is more than just a car company and becoming _\"too big to fail\"_. \n\nI'm just waiting for them to start providing Tesla Bank accounts or Brokerage accounts",
        "created_utc": 1635807345,
        "id": "hixykkr",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1635836145.0
    },
    {
        "author": "KyOatey",
        "body": "&gt; somebody at a local YMCA fucking living it up\n\nThis is the first time I've ever seen \"living it up\" connected with the YMCA.",
        "created_utc": 1635782619,
        "id": "hiwb0pa",
        "score": 63,
        "subreddit": "wallstreetbets",
        "created": 1635811419.0
    },
    {
        "author": "ApplemooseGG",
        "body": "I feel the same as you. It seems like information is never free and it feels like everyone has a secret they want to sell you. I'm just looking for some type of basis to build upon, but for every piece of info there is someone else that thinks it's terrible.",
        "created_utc": 1635754346,
        "id": "hiv1thi",
        "score": 63,
        "subreddit": "stocks",
        "created": 1635783146.0
    },
    {
        "author": "Swimming__Bird",
        "body": "Jordan may still have the BB GOAT status, but Kobe definitely is in it for the investment side, especially after last year's $300M+ loss.",
        "created_utc": 1635787160,
        "id": "hiwlq86",
        "score": 62,
        "subreddit": "stocks",
        "created": 1635815960.0
    },
    {
        "author": "throwaway_0x90",
        "body": "Got it, all in HOOD Jan 21 '22 $170 Call",
        "created_utc": 1635814774,
        "id": "hiyf98b",
        "score": 62,
        "subreddit": "wallstreetbets",
        "created": 1635843574.0
    },
    {
        "author": "FSUnoles77",
        "body": "Back in 2013 I started playing that stock simulator on Investopedia. TSLA was at 4.60 so I bought 300 shares of it along with 300 shares of Dominos. If only I wasn't real life poor at the time and would've made the same trades in real life, smh.",
        "created_utc": 1635792383,
        "id": "hiwygdv",
        "score": 61,
        "subreddit": "wallstreetbets",
        "created": 1635821183.0
    },
    {
        "author": "I_SMELL_BUTT",
        "body": "This. I know someone that is extremely wealthy, like multi-generational money from the early 1900's and he looks and acts like anyone else you would meet. No fancy watch, normal clothes, normal car. It was only after a few years when he actually really talked about it, solid dude.",
        "created_utc": 1635825202,
        "id": "hiz0vpr",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1635854002.0
    },
    {
        "author": "Proof-Peace904",
        "body": "For someone who's just a newbie in investing sometimes listening from somebody else's POV can help them to feel more confident and prepare ahead.   \n\n\nYou don't have to trust their financial advice but you can use it to your advantage. You will be able to get to learn how to be comfortable and confident with your decisions. You get to ask them a lot of questions.   \n\r  \nSince you are their client they want to see you succeed. If you will think of it carefully it will be a win-win for both parties.",
        "created_utc": 1635781979,
        "id": "hiw9juf",
        "score": 60,
        "subreddit": "stocks",
        "created": 1635810779.0
    },
    {
        "author": "Canadiannurse1",
        "body": "Great. So we are going to make it harder for Canadian producers of oil, while allowing other countries to fill the gap. SMH",
        "created_utc": 1635794377,
        "id": "hix3agj",
        "score": 59,
        "subreddit": "CanadianInvestor",
        "created": 1635823177.0
    },
    {
        "author": "manofthewild07",
        "body": "Here's something I just noticed today, actually.  \n\n\nI still have a 401k from a company I left 4 years ago. That means I haven't touched that account in 4 years. I haven't added anything to it except reinvesting dividends.   \n\n\nWhen I left in Sept 2017 it had roughly $13k in it. Now 4 years later it is worth almost $25k... easiest $12k I've ever made!   \n\n\nAnd you know how many times I've heard people say the market was too hot over the past 4 years? How many people thought Dec 2018 was going to be a huge bear market? Then March 2019... and everyday since then? If I had sat out that whole time waiting for some other market I would have missed out on $12k in gains!   \n\n\nNow obviously that is one anecdote and past performance is not proof of future gains, but missing out on investing because some people claim to know better than everyone else is a terrible investment strategy.   \n\n\nMy only regret is not investing more when I was in my 20s!",
        "created_utc": 1635795402,
        "id": "hix5thc",
        "score": 59,
        "subreddit": "investing",
        "created": 1635824202.0
    },
    {
        "author": "Patrickstarho",
        "body": "If it keeps rising I think it will eventually split.",
        "created_utc": 1635814869,
        "id": "hiyfgqo",
        "score": 59,
        "subreddit": "stocks",
        "created": 1635843669.0
    },
    {
        "author": "Legejr",
        "body": "OECD countries give over 100 billion in development aid yearly (last year 161,2 billion) and it hasn't solved shit.",
        "created_utc": 1635778965,
        "id": "hiw2riz",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1635807765.0
    },
    {
        "author": "Mysterious----",
        "body": "The moment you short Zillow it’ll go 10x and destroy you. Or is it just me.",
        "created_utc": 1635820633,
        "id": "hiyrzyb",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1635849433.0
    },
    {
        "author": "euxene",
        "body": "if u fell for this obvious scam, u earned it lol",
        "created_utc": 1635822525,
        "id": "hiyvv1n",
        "score": 57,
        "subreddit": "CanadianInvestor",
        "created": 1635851325.0
    },
    {
        "author": "Oxytocinoverdose",
        "body": "Twitter doing Twitter things. Nobody said 6bn would solve world hunger, they took the quote and “accidentally” removed the word help. 6bn in taxes that Tesla dodges would help solve world hunger was the gist of it.",
        "created_utc": 1635777402,
        "id": "hivzbdh",
        "score": 57,
        "subreddit": "wallstreetbets",
        "created": 1635806202.0
    },
    {
        "author": "10xwannabe",
        "body": "For me it was picking an asset allocation and executing it with low cost index funds and then just being a machine.  I ALWAYS focused on how much I can save (something I can control).  Then just doing it over and over and over again.  It didn't matter if the market was up 20% or down 40%.  I just focused on saving as much as I could every month for the last 10+ years.  \n\nIn the end there are really only a few major levers:  Time, $$$ saved, and return.  You can control the first 2 and NOT the last.  Everyone spends all their time obsessed about return, but you can't control return.  You can control when you start and how much you save.",
        "created_utc": 1635824711,
        "id": "hiz00js",
        "score": 56,
        "subreddit": "stocks",
        "created": 1635853511.0
    },
    {
        "author": "Exciting-Layer1963",
        "body": "\"It literally cannot go tits up\" - Sun \"10 bags\" Tzu",
        "created_utc": 1635800575,
        "id": "hixino2",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1635829375.0
    },
    {
        "author": "chickenrooster",
        "body": "Bro 2 vaccines vs 3 square meals a DAY 😂\n\nIf it feels disappointing, that's because it is reality",
        "created_utc": 1635775343,
        "id": "hivuvu0",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1635804143.0
    },
    {
        "author": "callmecrude",
        "body": "He was worth billions decades before he invested in Tesla.. the guy had a business school named after him back in 2008 and he ran an international multi billion dollar IT company. \n\nNice yolo but misleading headline",
        "created_utc": 1635783178,
        "id": "hiwcalg",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1635811978.0
    },
    {
        "author": "Anarchist73",
        "body": "I had 7 shares pre split, so 35 after, would mean if have left it alone it's be worth now over $42k.\n\nIn November I put a lot of my day trading account into GameStop, and ended up with profits over $300k\n\nSo it worked out well",
        "created_utc": 1635803616,
        "id": "hixpypj",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1635832416.0
    },
    {
        "author": "WayneKrane",
        "body": "Yeah, money’s not the issue. Getting the food/resources to those that actually need it without it getting siphoned off through corruption is the hard part.",
        "created_utc": 1635791197,
        "id": "hiwvk7g",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1635819997.0
    },
    {
        "author": "Gy7479",
        "body": "Well you create an account with them, then open a BTC or Eth wallet and send your crypto using the wallet adress (Bitcoin to Bitcoin, Eth to Eth). You have one free withdrawal per month, no length terms. Blockfi is only lending to institutions. Please take the time to read their whole website and FAQ, and take the time to read about sending and receiving cryptos, gas fees (transfer fees that you pay for every transaction), etc. I treat my cryptos like my stocks: long term hodler, passive income, aiming for 5% in cryptos for my portfolio. Mainly Btc and Eth, will add a few smaller coins eventually. \n\nAs usual, not your keys not your coins warning.",
        "created_utc": 1635775763,
        "id": "hivvreo",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1635804563.0
    },
    {
        "author": "TheRootOfMostEvil",
        "body": "The keys to financial independence are meme stocks and cryptos. 🔑🔑",
        "created_utc": 1635785768,
        "id": "hiwidpk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635814568.0
    },
    {
        "author": "ysabeaublue",
        "body": "LRCX, AMAT, ASML, KLAC.",
        "created_utc": 1637134066,
        "id": "hkynmcd",
        "score": 17,
        "subreddit": "stocks",
        "created": 1637162866.0
    },
    {
        "author": "PCB4lyfe",
        "body": "I've been telling anyone who would listen to buy soxx. They are 25% of my holdings and I also have klac asml amat and lrcx. If semi's do dip I'll keep buying, in 10 years people are gonna be looking back wondering why they didnt buy more, sorta like how we look at aapl or msft right now.",
        "created_utc": 1636673071,
        "id": "hk9k2g9",
        "score": 9,
        "subreddit": "stocks",
        "created": 1636701871.0
    },
    {
        "author": "Ozymandias_12",
        "body": "There are better stocks in the semi conductor sector like AMAT, ASML, LRCX, KLIC, KLAC, UMC etc. that I would buy before I'd consider Intel. TSM and Samsung are both spending 100 billion each on fabs, and somehow Intel's 20 billion plus whatever subsidy they get from the US is suddenly gonna change everything?\n\nThe entire economic system can collapse and Intel will stay at the 40-60 range. Hell, even if the Sun expanded and half of Earth is disintegrated, Intel will stay in that range.",
        "created_utc": 1636150431,
        "id": "hjh3s79",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636179231.0
    },
    {
        "author": "merlinsbeers",
        "body": "LRCX, KLAC, ASE, and the 800-ton gorilla, ASML",
        "created_utc": 1636385979,
        "id": "hjtbh08",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636414779.0
    },
    {
        "author": "audaciousmonk",
        "body": "Someone else showing LRCX some love!\n\nBeen making bank off their stock for 5+ years",
        "created_utc": 1636759420,
        "id": "hke6q3d",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636788220.0
    },
    {
        "author": "seigy",
        "body": "My take is $TSM makes high-end chips for NVDA &amp; AMD, $GFS makes a mix of chips, $UMC makes legacy chips (main thing we are currently short on), $INTC makes their own chips.  There are others but I think these are the big fabs and foundries.  I believe $QCOM, $AVGO, $SKWS, $TXN make their own and get some from fans but I am not certain on them.  Other plays to consider are the equipment mfg who make the equipment, parts, and services the fabs are buying in order to make more chips.  Some big players here are $AMAT, $ASML, &amp; $LRCX.",
        "created_utc": 1636250691,
        "id": "hjmk5z2",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1636279491.0
    },
    {
        "author": "EatsbeefRalph",
        "body": "Where are they getting their fabrication equipment? \nLam Research $LRCX might be the real play here.",
        "created_utc": 1636365717,
        "id": "hjscr7d",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636394517.0
    },
    {
        "author": "vizk0sity",
        "body": "tool suppliers. I personally hold AMAT, LAM RESEARCH, KLAC, TSM. You can add in more such as ASML, Tokyo Electron Limited. ASML has a monopoly on the EUV but they are limited by the supplier's capacity (you can't make as many as you'd like). This is the same as the TSM problem. One thing to remember, semiconductor is a cyclical business and won't go up forever. When oversupply/stockage happens, it will last for a few quarters. Most of these stocks will pull back. I don't expect them to have any oversupply until possibly at the earliest, late 2022 however. Watch the capex as usually that indicates expansion in the industry.\n\nFyi, I work for process dev. engineer in a fab for 6 years. If my opinion matters to you.",
        "created_utc": 1637175556,
        "id": "hl0sqiy",
        "score": 4,
        "subreddit": "stocks",
        "created": 1637204356.0
    },
    {
        "author": "seigy",
        "body": "Yep, for some reason people seem to be blind as to just how big the market is and how much money is being invested.  I posted this as part of an assessment of money flows in a different subreddit last weekend.  I have even read a few more semi investment plans since.   \n\nSemiconductor fabs and foundries spending plans: \nSamsung $205B/3yrs, \nMicron $150B/10yrs, \nIntel $115B/3yrs, \nTaiwan Semi $100B/3yrs, \nUnited Micro $2B in 2022, \nSK Hynix $235B/10yrs. \nMajor plays $LRCX, $ASML, $AMAT, $TER. \nMinor plays $NUE, $X, $CLF, $VMC, $FCX, $URI, $CAT.\n\nMy favorite quote I read this week that shows just this was from Pat Gelsinger: “I think I have more concrete trucks working for me today than any other human on the planet,” Gelsinger said. “We have construction in Oregon, New Mexico, Arizona, Ireland and Israel. And we expect to plant our next major fabs in the U.S. and Europe before the end of this year.”",
        "created_utc": 1636680188,
        "id": "hk9ypl4",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1636708988.0
    },
    {
        "author": "Messi-00",
        "body": "What about KLAX LRCX AMAT??",
        "created_utc": 1636646840,
        "id": "hk7s3uh",
        "score": 4,
        "subreddit": "investing",
        "created": 1636675640.0
    },
    {
        "author": "Henry1502inc",
        "body": "I like WMT, bby, dkng (I expect 45-50 around Super Bowl if it doesn’t tank), dis (for pretty much a year has yoyoed 175-185), mu, lrcx, amd (before it shot up), amzn (3170-3300), ual (if you can get it cheap enough, I got in at 44 and got assigned at 46, so pissed), snap (although very scary), lmnd (62-64), hood (33 seems to be the bottom, 33-40), sofi, atvi, sbux (got assigned at 107), Ttd at 70 but I sold, upst (I sold at 110), viac but the premiums are way too low, Wynn (85-95), Uber (37-47), bac (39-44)",
        "created_utc": 1636903078,
        "id": "hklgecx",
        "score": 3,
        "subreddit": "options",
        "created": 1636931878.0
    },
    {
        "author": "WVUMD",
        "body": "Opinions on AMAT earnings this week? Looks like it's already broken out of 7 month consolidiation, but I'm skeptical because AMAT and LRCX rarely trade over P/E 25, and it's at 27. \n\nThen again, I've been missing out on AMAT since it was $55 a year ago, I'm kinda retarded",
        "created_utc": 1636950210,
        "id": "hkojytt",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636979010.0
    },
    {
        "author": "EatsbeefRalph",
        "body": "LRCX too",
        "created_utc": 1636079992,
        "id": "hjda072",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636108792.0
    },
    {
        "author": "MuiMui888",
        "body": "AMAT, LRCX, KLAC",
        "created_utc": 1637168080,
        "id": "hl09i6v",
        "score": 3,
        "subreddit": "stocks",
        "created": 1637196880.0
    },
    {
        "author": "spellbadgrammargood",
        "body": "yes on NVDA,LRCX, AMD, and YANG yes",
        "created_utc": 1636143392,
        "id": "hjglfol",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636172192.0
    },
    {
        "author": "Chippopotanuse",
        "body": "The old “the only guys to make money in the gold rush were selling shovels” approach. \n\nAnd it isn’t wrong here either. \n\nI’m long chip makers, but I’m big long on the equipment makers like LRCX and TER",
        "created_utc": 1636394984,
        "id": "hjtxx21",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636423784.0
    },
    {
        "author": "LovelySalientDreams",
        "body": "Aww buddy sorry to hear it. I like semiconductor companies like NVDA, AMD, ON, LRCX, ASML, TSM, MU",
        "created_utc": 1635997840,
        "id": "hj8pwvp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636026640.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "Buy the supply chain: ASML, LRCX, TSMC, AMD.",
        "created_utc": 1635799287,
        "id": "hixfihs",
        "score": 2,
        "subreddit": "investing",
        "created": 1635828087.0
    },
    {
        "author": "brutalpancake",
        "body": "LRCX is like AMD’s less uh…fortunate sibling. She’s definitely not AMD, but everyone is slobbering all over AMD all the time so it’s not like you’ve got a shot anyways. Then one day you’ve had a few too many a bit too early and you see her across the trading floor from juuust the right angle and it’s like woah….yeah…I guess I could make a lil trade here 😏",
        "created_utc": 1636758297,
        "id": "hke4bt7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636787097.0
    },
    {
        "author": "Time_Kaleidoscope",
        "body": "They just design the chips. The architecture behind them. TSM produces them. TSM probably sourced from a mix of ASML, AMAT, LRCX, etc",
        "created_utc": 1635872665,
        "id": "hj16lfg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635901465.0
    },
    {
        "author": "Lemonadetrade",
        "body": "That's a question for lam research",
        "created_utc": 1636777584,
        "id": "hkf7341",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636806384.0
    },
    {
        "author": "WVUMD",
        "body": "Thinking about AMAT, but it already broke out of a 7 month consolidation and don't know if it has room to move. Usually won't trade above P/E 25, and it's at 27. Unless it smashes, probably not the best bet. \n\nStill bullish on AMAT LRCX and ASML long term though, great growth",
        "created_utc": 1637029412,
        "id": "hkswf74",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1637058212.0
    },
    {
        "author": "Beagleoverlord33",
        "body": "A lot of good semiconductor related plays that provide both Amat lrcx qcom. I also like Low TGT and some of the home builders.",
        "created_utc": 1636930456,
        "id": "hkndcxn",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1636959256.0
    },
    {
        "author": "afroman645",
        "body": "Couldn’t get in LRCX, but was able to get in TEAMS 🤡",
        "created_utc": 1636124899,
        "id": "hjf93i0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636153699.0
    },
    {
        "author": "thePebble13",
        "body": "The biggest holdings in my portfolio\n\nVICI: 10%\n\nLRCX: 5%\n\nKLA: 5%\n\nAMAT: 5%\n\nQCOM: 5%\n\nFB: 5%\n\nUPST: 5%\n\nPLTR: 5%\n\nDD: 7.5%\n\nDOW: 7.5%\n\nVTRX: 5%\n\nMATX: 5%\n\nPANW: 5%\n\nC: 10%\n\nVMEO: 5%",
        "created_utc": 1636330597,
        "id": "hjqrx96",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636359397.0
    },
    {
        "author": "Internal_Necro47",
        "body": "LRCX",
        "created_utc": 1636242570,
        "id": "hjm32ao",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1636271370.0
    },
    {
        "author": "KillaIcon",
        "body": "LRCX\nLam research. Currently at $610 a share.",
        "created_utc": 1636280809,
        "id": "hjnq1x3",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1636309609.0
    },
    {
        "author": "ysabeaublue",
        "body": "I'm interested in this space, but why KLAC over say AMAT or LRCX?",
        "created_utc": 1636806003,
        "id": "hkg7k0b",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636834803.0
    },
    {
        "author": "Ozymandias_12",
        "body": "And I own ASML, KLAC, AMD and NVDA, all of which have had significantly better returns than Intel, including the dividends. There are tons of other semi-conductor companies like LRCX, AMAT, KLIC etc. that I would consider before buying intel.",
        "created_utc": 1637101730,
        "id": "hkwuber",
        "score": 1,
        "subreddit": "stocks",
        "created": 1637130530.0
    },
    {
        "author": "Porsche981Fan",
        "body": "I like Lam Research",
        "created_utc": 1636910932,
        "id": "hklyty8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636939732.0
    },
    {
        "author": "cmon_do_it",
        "body": "Here is Shiller's own Excess CAPE Yield metric which factors in interest rates:\n\n[https://en.macromicro.me/charts/27100/us-shiller-ecy](https://en.macromicro.me/spotlights/131/guan-jian-tu-biao-gu-jia-yi-jing-tai-gui-le-ma-le-ma-ren-shi-diao-zheng-hou-chao-e-ben-yi-bi-bao-chou-ECY)\n\nalso,\n\n[https://pse.is/3e9gf3](https://pse.is/3e9gf3)\n\nAccording to ECY, valuations are not as astronomical as they seem.",
        "created_utc": 1636132196,
        "id": "hjfryw4",
        "score": 132,
        "subreddit": "investing",
        "created": 1636160996.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "Paypal users 390 Million \n\nVisa Users 1280 Million\n\nMastercard users 840 Million",
        "created_utc": 1636704241,
        "id": "hkb5ysd",
        "score": 47,
        "subreddit": "stocks",
        "created": 1636733041.0
    },
    {
        "author": "wearahat03",
        "body": "&amp;#x200B;\n\n||PE RATIO|Recent REV GROWTH|\n|:-|:-|:-|\n|PYPL|44.7|13%|\n|AAPL|25.9|29%|\n|MSFT|39.1|22%|\n|GOOGL|28|41%|\n|FB|23.5|35%|\n|AMZN|80|15%|\n|V|34.9|29%|\n|MA|44|29%|\n\nPYPL is too expensive versus their growth rate. Their PE ratio is AFTER they've dropped.\n\nNot only are they more expensive than FAAMG but also more expensive than V and MA.\n\nOnly AMZN is more expensive and might correct in the future.",
        "created_utc": 1636821939,
        "id": "hkh1rf0",
        "score": 31,
        "subreddit": "stocks",
        "created": 1636850739.0
    },
    {
        "author": "TheDynamicKing",
        "body": "ain't nothing wrong with 50 years old living with ma and pa. this is the wall street way",
        "created_utc": 1636567568,
        "id": "hk3hamv",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1636596368.0
    },
    {
        "author": "Calm_Leek_1362",
        "body": "I've never heard of 'wumao'. I didn't think I was saying anything political... it's just how it is. The US Congress works for big money. CPC has complete control in China. Remember how some people thought Jack Ma was dead and nobody thought that sounded implausible? And not a single wall street banker that caused the 07 crash even had to pay a fine (in fact, they paid themselves bonuses with taxpayer money from bailouts), and nobody was surprised?\n\nI'm not judging either country, that's just the way it is.",
        "created_utc": 1636566641,
        "id": "hk3evsw",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1636595441.0
    },
    {
        "author": "EMTPirate",
        "body": "I checked your profile to see if you are another one of the Chinese profiles that keeps pushing junk investment, and I doubt a lawyer would need to buy a Turkish knockoff of a Glock, but I'll give you the benefit of the doubt that you are just a bad lawyer and can't afford anything better.\n\nI know a good deal about China, I know about the power struggle between Xi Jinping and the Jiang Zemin faction that is causing a lot of these crackdowns. I know the Army swears allegiance to the CCP instead of the nation. That the CCP rules as the please from Zhongnanhai without regard to laws.  They are content to practice hostage diplomacy like they did with the two Michael's to free Meng Wanzhou and they seem confused when western counties can't simply disregard the courts and do as they please like China. That the Belt and Road initiative is just neo colonialism to steal resources and strategic ports from poor nations. That the Uighurs face slave labor and genocide by controlling birth rates and harvesting organs like Falun Gong practitioners. \n\nChina is not a free, fair, or open market. Ask Jack Ma who got disappeared by them. Look at their national security laws, and how they annex neighborhoods and force their will on them. How they alter maps and globes to include the 9 dash line and pretend it is part of Chinese territory like the Scarborough shoal despite court rulings.\n\nSo tell me how elections matter when China can decide who is on the ballot to prevent a true opposition and use the national security law to disappear opposition?\n\nCall me a typical American, but my eyes are open to the actions of the CCP.",
        "created_utc": 1635853573,
        "id": "hj00l6f",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1635882373.0
    },
    {
        "author": "EtadanikM",
        "body": "You are all sorts of stupid if you think this wasn't caused by people like Jack Ma. It was precisely corporate greed that caused Chinese real estate companies to operate pyramid schemes where they would use the down payments from apartments that weren't even built to finish previous apartments that weren't even built. Ant Group would've made this infinitely worse with its \"wild west\" loan shark practices. Run away financialization IS the cause of over building.\n\nThis is a problem that Deng and his successors created. It isn't new.",
        "created_utc": 1636578439,
        "id": "hk49bcv",
        "score": 18,
        "subreddit": "stocks",
        "created": 1636607239.0
    },
    {
        "author": "Will_House",
        "body": "As a customer and holder of EQB, I'm very stoked for the Mastercard partnership",
        "created_utc": 1635896667,
        "id": "hj2vs48",
        "score": 15,
        "subreddit": "CanadianInvestor",
        "created": 1635925467.0
    },
    {
        "author": "moaiii",
        "body": "That doesn't work well with options most of the time due to gamma. You could have a fairly small pullback of the underlying down to a support line or MA which will knock 50% or more off the premium almost instantly. You close, because you couldn't get a fill at 20% down, but then the underlying confirms support and shoots right back up again past your entry point bringing those premiums straight back up with them. You just lost over 50% when the trade was always above support, still trending up, and doing just fine.\n\nTrade on the price action, not the P&amp;L, assume that the cost/margin to enter the trade is your \"at risk\" amount, and set your position size accordingly.",
        "created_utc": 1636242873,
        "id": "hjm3qei",
        "score": 14,
        "subreddit": "options",
        "created": 1636271673.0
    },
    {
        "author": "wsb202009",
        "body": "I keep adding PYPL daily dips, both shares and options. I hold V and MA Jan 22 options, buying IPAY ETF too.",
        "created_utc": 1635899035,
        "id": "hj31gmt",
        "score": 11,
        "subreddit": "stocks",
        "created": 1635927835.0
    },
    {
        "author": "Bacarchi",
        "body": "Wish is good company. Whenever I see their FB ads for male corzettes, various sex toys, fake night vission goggles, booletproof vests and shit like that it always makes me laugh.\n\nBut I ain't giving dime for that bag of shit. Jack Ma can eat them alive.",
        "created_utc": 1636585487,
        "id": "hk4qvcq",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1636614287.0
    },
    {
        "author": "CommunicationOld9321",
        "body": "I hate not having alot to invest.....but slowly I ma get there",
        "created_utc": 1636071979,
        "id": "hjcs8k6",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1636100779.0
    },
    {
        "author": "Litho360",
        "body": "I like T for sure. Surprised it hasn’t moved already, but the latest infrastructure bill passed has 65 billion dedicated to improve internet access. \n\nPayPal seems like it should have some nice movements seeing how Visa and Mastercard have been making some nice gains.",
        "created_utc": 1636380109,
        "id": "hjsyfdz",
        "score": 11,
        "subreddit": "stocks",
        "created": 1636408909.0
    },
    {
        "author": "LuxGang",
        "body": "Someone yesterday made a great post analysing the Fintech companies like V, MA, PYPL, SQ etc.\n\nThe point this user made boils down to:\n\nV, MA, SQ, PYPL etc still have inflated P/E ratios(30+), while companies like GOOG are trading below 30 P/E and growing faster. So why buy an overpriced Fintech when you can buy GOOG at a much better value?\n\nMakes sense to me. I was looking at buying one of the aforementioned stocks, but now I think I'll just stick to big tech, which to me looks like a much better long term buy. Thoughts?",
        "created_utc": 1635960635,
        "id": "hj69ojt",
        "score": 11,
        "subreddit": "stocks",
        "created": 1635989435.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "I don't agree.\n\nVisa can grow a lot in south east asia and Africa.\n\nIn Europe and the States, there are a lot of people that don't need/use Paypal and never will\n\nBut everybody has and will have sinxe they open a bank account debit and credit cards (V and MA)",
        "created_utc": 1636728508,
        "id": "hkc5y97",
        "score": 10,
        "subreddit": "stocks",
        "created": 1636757308.0
    },
    {
        "author": "SmallParade",
        "body": "&gt;43.5 payment transactions per active account on a trailing twelve months basis, growing 11%\n\nThat’s from PayPal’s last earnings report. People are using it 3.6 times a month on average. That’s about how often I use it. I don’t use cash much anymore either but I use it more than 3.6 times a month. And I use my debit MasterCard to pay from my bank account probably 60-100 times a month. You understand now why they wanted to buy Pinterest. Generally speaking, people aren’t going around flashing the PayPal app everyday to pay for things. They use it here and there.",
        "created_utc": 1635899940,
        "id": "hj33peq",
        "score": 10,
        "subreddit": "stocks",
        "created": 1635928740.0
    },
    {
        "author": "dzettel",
        "body": "For real. It’s a fair value now, about to pick up Visa and Mastercard at EOD",
        "created_utc": 1635881775,
        "id": "hj1twuu",
        "score": 10,
        "subreddit": "stocks",
        "created": 1635910575.0
    },
    {
        "author": "Testynut",
        "body": "I love MasterCard and Visa",
        "created_utc": 1636509139,
        "id": "hk0jxoo",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1636537939.0
    },
    {
        "author": "tothemoonandback01",
        "body": "&gt;86% of Chinese approve of their government compared to something like 30% in America.\n\nYes, if the Chinese don't approve they disappear to the re-education camp.  Ask Jack Ma if you don't believe me.",
        "created_utc": 1635856623,
        "id": "hj05qa7",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635885423.0
    },
    {
        "author": "VacationLover1",
        "body": "Can Jack Ma just come out of his forced rehabilitation and say ‘buy the baba dip bitches’ just so we can break into the $200’s.. I mean how much longer will it take to brainwash the guy, it’s been a year",
        "created_utc": 1636341115,
        "id": "hjre52r",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1636369915.0
    },
    {
        "author": "Tsukune_Surprise",
        "body": "I’ve said it before and I’ll say it again-\n\nGambling is why we are here. But when you gamble you know the odds and the rules of the game. (Mostly- I still don’t understand craps but I’ll lose money on it anyway)\n\nPoint is this- don’t fuck around with Chinese stocks.  They have no rules. The Chinese government is also instituting some new Jack Ma rules to keep companies from getting too strong. A Chinese company gets too big and the government will knock it down. \n\nDon’t fuck around with Chinese stocks.  (And you aren’t even really buying their stocks since foreigners can’t own Chinese stock directly). \n\nYou’re buying promise rings from virgins who haven’t figured out their sexuality while their ultra religious father tries to send them to straight camp.",
        "created_utc": 1635982342,
        "id": "hj7sm37",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1636011142.0
    },
    {
        "author": "discovery991",
        "body": "MA",
        "created_utc": 1636697398,
        "id": "hkawsdx",
        "score": 9,
        "subreddit": "stocks",
        "created": 1636726198.0
    },
    {
        "author": "james14cunningham",
        "body": "the corrections are done, this is ready to move up much higher, all aboard. imho\r  \nI ma sure there is going to be smashing news very soon,\r  \nstart of the phase 3\r  \ntoxicology report\r  \npartnership\r  \ncovid nasal spray progress  \n\n\n$ATOS along with JMP and $BTCS will give good green this month. DD",
        "created_utc": 1636367598,
        "id": "hjsewbl",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1636396398.0
    },
    {
        "author": "swingforthefence69",
        "body": "Is PYPL dragging down V and MA? Looking to add some more to my positions",
        "created_utc": 1636470038,
        "id": "hjxx6rr",
        "score": 8,
        "subreddit": "stocks",
        "created": 1636498838.0
    },
    {
        "author": "DDRaptors",
        "body": "Fuckin PayPal dragging down my V and MA.",
        "created_utc": 1636471906,
        "id": "hjy1kp1",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1636500706.0
    },
    {
        "author": "wsb202009",
        "body": "Big companies like PYPL, V and MA always meet the street expectations, but their forecast may differ depending on demand. \n\nWhen PYPL jumps, it goes like TSLA, no one can catch it !",
        "created_utc": 1635899175,
        "id": "hj31sz0",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635927975.0
    },
    {
        "author": "Successful_Okra6902",
        "body": "Price is below 200 MA, it's still going down.",
        "created_utc": 1636410526,
        "id": "hjv0jpq",
        "score": 7,
        "subreddit": "stocks",
        "created": 1636439326.0
    },
    {
        "author": "brooklynbest97",
        "body": "I need PYPL to jump the same way MA did after that drop two weeks ago",
        "created_utc": 1636729588,
        "id": "hkc8foc",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636758388.0
    },
    {
        "author": "Jayytimes2",
        "body": "&gt;(V, MA, PYPL, SQ, etc) are all dipping and being replaced with buys of cyber security etc. (Cloudflare, NET, DDOG, FASTLY, etc).\n\nWould you mind expanding on this?",
        "created_utc": 1636593664,
        "id": "hk59bku",
        "score": 7,
        "subreddit": "stocks",
        "created": 1636622464.0
    },
    {
        "author": "FEMA_Camp_Survivor",
        "body": "PayPal, Visa, MA, and others have been in the dumps lately. Godspeed homie.",
        "created_utc": 1636056486,
        "id": "hjbqoah",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636085286.0
    },
    {
        "author": "Queen__Elizabeth__2",
        "body": "Guys need some advice, I'm very interested in V, I believe is an awesome stock and is ready to go up but I have no ideia whats going on in that space. V, MA and PYPL have been dropping for a while... and I can't wrap my head around why. Can someone help?",
        "created_utc": 1636124479,
        "id": "hjf81tm",
        "score": 7,
        "subreddit": "stocks",
        "created": 1636153279.0
    },
    {
        "author": "Zackattackrat",
        "body": "Ma calls be a printin’ tmro",
        "created_utc": 1636589483,
        "id": "hk500i5",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636618283.0
    },
    {
        "author": "I_love_avocados1",
        "body": "It’s most payment processors, not just PayPal. Look what’s happening to old school competitors like $EEFT, $FIS, $FISV, $GPN, not to mention $MA, and $V.",
        "created_utc": 1635864325,
        "id": "hj0m8a9",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635893125.0
    },
    {
        "author": "Eslooie",
        "body": "Looks like no one is ever using electronic payments again. Totally makes sense V, MA, and Pypl have drilled.",
        "created_utc": 1635959531,
        "id": "hj66qrr",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635988331.0
    },
    {
        "author": "juaggo_",
        "body": "I think V. They are bigger and valuation more attractive. MA also has a lawsuit at the moment where they have their entire cash reserve worth of money on the line. I doubt they lose it all, just a thing to notice.",
        "created_utc": 1635975749,
        "id": "hj7czg2",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636004549.0
    },
    {
        "author": "FJBonks",
        "body": "Honest question here bc I was an investor in it but got out when Jack Ma faded out of the limelight.\n\nWhat are your reasons in putting money in a company that CCP likes to mess with?  Did you guys forget CCP cancelled the biggest IPO in the world for Ant group Nov 2020; And Alibaba just got fined $2.8 billion in April 2021.  Any success of Alibaba are being watched closely by the CCP.  \n\nI do hope this stock goes up for you if you’re still invested in it.",
        "created_utc": 1636570315,
        "id": "hk3oeg7",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636599115.0
    },
    {
        "author": "TheRandomnatrix",
        "body": "Me: \"Why can't you just have a green day?!\"\n\nVisa and MA: *screams*\n\nAt least DFS is carrying me today.",
        "created_utc": 1635952775,
        "id": "hj5oudc",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635981575.0
    },
    {
        "author": "The_Number_12",
        "body": "I got in at $187 last year, I think it's honestly going to keep sliding down for a while, it's likely gonna get to $160 maybe even $150\\~. T ROWE Price is one of the biggest holders and they've been shedding PYPL for a little while now, I think other large firms are doing the same en masse now. They were up over 100% if they bought a little over a year ago, time to sell it off hard. the P/E makes no sense compared to V amd MA which do the same service more or less (move money &amp; pay merchants).",
        "created_utc": 1636499404,
        "id": "hjzy4da",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636528204.0
    },
    {
        "author": "B1gChuckDaddySr",
        "body": "JACK MA",
        "created_utc": 1635951334,
        "id": "hj5l6pz",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635980134.0
    },
    {
        "author": "WasteNet2532",
        "body": "Baba was beat down bc Jack Ma made a mistake. And Xinnie the Pooh punished him greatly for it. So long as baba diversifies in areas where the government doesnt care so much ( which it seems to be doing)it is greatly undervalued, but in my situation, the risk *is* necessary. I lost 70% of my account. So im using the last few grand for a couple LEAPs. Lets just see how these earnings play out",
        "created_utc": 1636449169,
        "id": "hjx0eo7",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636477969.0
    },
    {
        "author": "WombatShwambat",
        "body": "When do you guys think Jack Ma will be done with his re-education?",
        "created_utc": 1636392801,
        "id": "hjtsi49",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636421601.0
    },
    {
        "author": "whatyoulookinatbud",
        "body": "MQ. I believe they can take on MasterCard and Visa. Or will get bought out.",
        "created_utc": 1635828550,
        "id": "hiz68o3",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635857350.0
    },
    {
        "author": "B1gChuckDaddySr",
        "body": "When is Jack Ma going to rescue BABA?",
        "created_utc": 1636601093,
        "id": "hk5pual",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636629893.0
    },
    {
        "author": "duskick",
        "body": "To me, SQ is an earlier version of PayPal.  They are in the process of creating their network.  The benefit they have in the long run in owning the hardware, software, and network, is that they can eliminate Visa and MasterCard from the equation.  If someone uses the Cash app to buy directly from a SQ terminal, the could reduce the charge from 2-3% (of which they get a small cut) to 0-5-1% (of which they get all).  SQ wins, merchant wins, but V and MC lose on such a transaction. PayPal is trying to build a similar network, but doesn’t have as much traction with in person terminals.",
        "created_utc": 1636724999,
        "id": "hkbyg2k",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636753799.0
    },
    {
        "author": "yaboiRich",
        "body": "Went to the bar last night and ran in to this girl I used to bang. She ignored me like she didn't who I was. Its alright bitch, I got your friends number and imma fuck her just to spite you. \n\nHave a safe weekend out there ma dudes",
        "created_utc": 1636782719,
        "id": "hkffflb",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636811519.0
    },
    {
        "author": "midnightscare",
        "body": "Brookfield bets on post-pandemic office demand with Alstria (German real estate company) €19.50/share in cash takeover offer \n\nhttps://www.reuters.com/article/alstria-office-ma-brookfield-asset-idUSL8N2RV4JP",
        "created_utc": 1636044593,
        "id": "hjawavk",
        "score": 5,
        "subreddit": "CanadianInvestor",
        "created": 1636073393.0
    },
    {
        "author": "Current-Promotion-31",
        "body": "Watertown MA offering $310 an hour for snow plow drivers.  Dat shit cray",
        "created_utc": 1636547171,
        "id": "hk265ub",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636575971.0
    },
    {
        "author": "Shandowarden",
        "body": "MQ and SOFI. Idk why this sub is so biased heavily onto old names when there are far better opportunities. Mastercard, Visa and Paypal already grew a shit ton during covid and their numbers were unjustified. SQ also blew up so much already and you can see it sitting stale st 230-270 levels forever. If you want to save money, sure buy those, but if you want more aggro future growth, go MQ and SoFi",
        "created_utc": 1635864854,
        "id": "hj0nhfx",
        "score": 4,
        "subreddit": "stocks",
        "created": 1635893654.0
    },
    {
        "author": "LazySoftwareEngineer",
        "body": "Buy almost any other payment processor, not PyPl. V, MA, SOFI, SQ, now UPST on the dip even. There will be a bounce, but I foresee a long sideways crawl for this.",
        "created_utc": 1636513592,
        "id": "hk0tukr",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1636542392.0
    },
    {
        "author": "epyonxero",
        "body": "Thats the dream but the banks and payment networks arent going to give up their cash cow without a fight. V and MA are already dipping their toes into crypto and blockchain payments. Banks tried and failed to kill crypto before and now theyre trying to co-opt it by making it so only banks can issue stable coins. \n\nIm bullish on Circle because they know this and have been very proactive in appeasing the regulators.",
        "created_utc": 1636683378,
        "id": "hka5jqg",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1636712178.0
    },
    {
        "author": "sf_warriors",
        "body": "Galileo is alone worth $20 billion imho. They are galloping at 100miles/hr with their expansion throughout the world, visa and mastercard have 10a of integrations in the news. It is regarded as one of the best and fastest growing payments processor. If Galileo to have a ipo today, they will easily raise $20 billion. Similar company called Marquetta(MQ) is valued $25 billion who went ipo this year",
        "created_utc": 1636694880,
        "id": "hkasr4p",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636723680.0
    },
    {
        "author": "polonaisefantaisie",
        "body": "Okay but Visa looks terribly oversold. It's way below the ath and lagging behind Mastercard.\n\nI think V leaps could be a nice play.",
        "created_utc": 1636828559,
        "id": "hkhhcpz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636857359.0
    },
    {
        "author": "Sell_Hour",
        "body": "They’re going into hiding like jack ma did",
        "created_utc": 1636046595,
        "id": "hjb1h21",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636075395.0
    },
    {
        "author": "Specialist_Coffee709",
        "body": "All in $INTC then since we all know they just need to do a better copycat of AMD shit. Alibaba did a good job……Pat needs to higher ma asap!",
        "created_utc": 1635864225,
        "id": "hj0lzpa",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635893025.0
    },
    {
        "author": "B1gChuckDaddySr",
        "body": "Jack Ma",
        "created_utc": 1636234787,
        "id": "hjllwq8",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636263587.0
    },
    {
        "author": "bidensaphag",
        "body": "MA!!! The Meatloaf!!",
        "created_utc": 1636307135,
        "id": "hjp67w6",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636335935.0
    },
    {
        "author": "atdharris",
        "body": "Venmo may be growing but apparently other parts of their business are not. PYPL is growing slower than V or MA yet trading at a premium to those two companies. That's likely why the stock is selling off.",
        "created_utc": 1636486120,
        "id": "hjz17za",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636514920.0
    },
    {
        "author": "Erion929",
        "body": "I understand, as a business….but they have some hard times coming in China.\n\nPolitically, BABA will continue to be depressed by the CCP….where’s Ma, anyway?",
        "created_utc": 1636564926,
        "id": "hk3afc0",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636593726.0
    },
    {
        "author": "Ok-Wasabi2873",
        "body": "I was arguing with my cousin, heavy value guy, about this. My argument against BABA is that Jack Ma has fallen out of favor with the CCP. And the CCP picks the winners. I don’t think they’re going to pick BABA.",
        "created_utc": 1636828645,
        "id": "hkhhjxz",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636857445.0
    },
    {
        "author": "Teekay53",
        "body": "Same. People are saying that the CCP is not going to kill their golden goose. However, I don't think that when the CCP looks at Alibaba they see a golden goose, but rather they see how capitalism can bring arrogance and power to someone who's supposed to listen to them, not question them (Jack Ma). It doesn't matter that Ma is out, my belief is that this is how they still see alibaba, as an entity that dared question their power.",
        "created_utc": 1636828862,
        "id": "hkhi1n2",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636857662.0
    },
    {
        "author": "CommunicationOld9321",
        "body": "Those new solar roof tiles look dope I ma invest in the companies",
        "created_utc": 1635827460,
        "id": "hiz4ktn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635856260.0
    },
    {
        "author": "daaabears1",
        "body": "I haven’t followed the company very closely but a short term headwind could be the reopening. It seems like PayPal is used mostly digitally. When i pay for stuff in person I use Visa or Mastercard (sometimes use a Square POS). I think there’s a big missed opportunity with a digital only (or mostly) platform. With that said, not an expert on the company so I could be wrong.",
        "created_utc": 1635816435,
        "id": "hiyiwwi",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635845235.0
    },
    {
        "author": "phohunna",
        "body": "I live in Canada and I recently visited friends in MA where weed was legalized in 2017. Many municipalities still ban the sale.\n\nIn Boston, they have like 2 recreational dispensaries for the entire city. We had to bike nearly a half hour from Cambridge, and there were several security guards for the sleepy store. You can't buy with a credit card because the lending banks want nothing to do with it.\n\nIn Canada by contrast, its much more like a small fancy liquor store. We have dispensaries every few blocks and zero security guards. You can go in and buy with your credit card.\n\nCompanies like TLRY wont take off until there is sufficient distribution and its easy to buy. That wont come until its nationally legalized. Its going to be a long time.",
        "created_utc": 1636037190,
        "id": "hjad7db",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636065990.0
    },
    {
        "author": "wsb202009",
        "body": "Ha ha ha ! That is for you to find out !! If the reason is genuine, PYPL stock down is justified. If not, you have chances to benefit !!!\n\nBTW: All payment sector is down with rotation, such as V, MA, PYPL..etc",
        "created_utc": 1636121692,
        "id": "hjf14bn",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636150492.0
    },
    {
        "author": "B1gChuckDaddySr",
        "body": "Jack Ma to the rescue",
        "created_utc": 1636336838,
        "id": "hjr58cn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636365638.0
    },
    {
        "author": "NaplesBrandon",
        "body": "You would be better served trading spreads on large, industry leading stocks like MA, SHOP, DG, AMZN etc. watching their 30-60 trading ranges and selling spreads far out of the money when they trade near the lower end of their range. OTM by 20% or more when possible or near 52 week low.",
        "created_utc": 1636728759,
        "id": "hkc6j0m",
        "score": 3,
        "subreddit": "options",
        "created": 1636757559.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/Telkorenar (2/0) made a bet that MA would go to 355.0 when it was 336.7 and it did, congrats autist.",
        "created_utc": 1636556226,
        "id": "hk2oiym",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636585026.0
    },
    {
        "author": "RingingInTheRain",
        "body": "I'm down at least 10k from my FB/Meta calls. I averaged down too. I feel you ma. I feel you..",
        "created_utc": 1636561944,
        "id": "hk32pd9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636590744.0
    },
    {
        "author": "MungerMentalModel",
        "body": "if you go to [tradingview.com](https://tradingview.com), go to the chart, click on \"indicators\" , then search for \"MA\".  add it to the chart and then you can change the settings for it to show 20 instead of the default which is 9.  The price action of a stock frequently interacts with the moving average, the moving average acts like a rubber band.  The farther the stock moves away from it, the stronger it wants to rebound back.",
        "created_utc": 1636512860,
        "id": "hk0s8o8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636541660.0
    },
    {
        "author": "The_Bill_Slayer",
        "body": "I love Canadian tire,  I really think they've been incredible lately.  Sears target closed, years later I'm checking out full toy isles in canadian tire lol loved it almost filled a void.   \nAlso love their website I swear it's better then walmarts website and costco I mean that says a lot imo!\n\nOnly reason I put it behind a railroad or a bank as my choice is because . . . .\n\nThe banks are expanding outside of Canada td bank northern USA, scotia bank south America.   I mean if your in a government corrupt country would you rather use Los Locale Banco  or Scotia bank to hold your tendies? \n\nRailroads are kind of limited to North America altho they can do buyouts for a bigger American presence I don't even think they have to worry too much there is 2 for canada they can share?!\n\nSeems more competition in stores?\n\nHow much more can they expand?  I love em use them all the time and have their Mastercard lol",
        "created_utc": 1636597871,
        "id": "hk5ishb",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1636626671.0
    },
    {
        "author": "iriechubs",
        "body": "I was day trading my mom txt me I’m like ma The meatloaf! Anyways by the time I got back from the txt like 1 min later I was down 2,500$. I was like note to self never answer txts while trading!",
        "created_utc": 1636812959,
        "id": "hkgioiw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636841759.0
    },
    {
        "author": "sreten-jr",
        "body": "Buy high, sell low ma brothas",
        "created_utc": 1635863552,
        "id": "hj0keez",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635892352.0
    },
    {
        "author": "wsb202009",
        "body": "Look of for IPAY, portfolio is V, MA, PYPL...etc all mobile payments.\n\nIf you look for stocks, my preference is for SID (3.95 now), but steel industry with good dividend 9% and low P/E. Results due by Nov 4th. I think it won't long last at this price.\n\nETF is SLX.\n\nPresently they are corrected high and will revive in future.\n\nStarting buying small qty, keep adding every dip.\n\nBTW: I own all of these, may be biased with my DD. You need to analyze before your decision.",
        "created_utc": 1635875661,
        "id": "hj1e57c",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635904461.0
    },
    {
        "author": "tracyXTMAC",
        "body": "lol okay. You will get there one day ma boi. And yeah dont ever bet against Elon. I did the same thing earlier this year and $8k evaporated in 3 days.",
        "created_utc": 1636175151,
        "id": "hjik6ve",
        "score": 3,
        "subreddit": "options",
        "created": 1636203951.0
    },
    {
        "author": "Particular-Cake-6430",
        "body": "Jack ma is rich as fuck though. That’s like a 5 point boost",
        "created_utc": 1636086011,
        "id": "hjdlf9q",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636114811.0
    },
    {
        "author": "BokitoIsMijnVriend",
        "body": "he was [overhere](https://nltrending.com/billionaire-and-alibaba-founder-jack-ma-brings-visit-to-the-netherlands/) last week",
        "created_utc": 1636392979,
        "id": "hjtsyeh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636421779.0
    },
    {
        "author": "bazookateeth",
        "body": "Also LLKKF for a lithium play. Has ties with Jeff Bezos, Bill Gates and Jack Ma.",
        "created_utc": 1636300841,
        "id": "hjoqcz6",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1636329641.0
    },
    {
        "author": "CHERCK_FLOKI",
        "body": "IRS be like.... Where's ma cut home.",
        "created_utc": 1636320868,
        "id": "hjq5b55",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636349668.0
    },
    {
        "author": "arbiter12",
        "body": "Ma dude... your innocence worries me so i will be harsh.\n\nDo you really think, if the recipe for making money was \"[just look for undervalued companies whereby their total share\\*value is lower than their Ebitda/cashvalue!](https://corporatefinanceinstitute.com/resources/knowledge/trading-investing/trading-below-cash/)\", professional trading houses would spend literal billions in research, algorithm and personnel?\n\n&amp;#x200B;\n\nWhat you should first learn about this industry, if you want to succeed in it is that if something is easy and/or predictable, then it doesn't work/won't happen. You may get lucky and expect the expected and it happens just as planned, but most often, the big players are contrarian to the market itself, meaning that if you think A is likely and a million people think A is likely, then B is almost guaranteed to happen (unless enough contrarians think B will happen, then probably C)\n\nTraders don't play the game fairly. They just harvest money from betting against the most number of people.",
        "created_utc": 1636552545,
        "id": "hk2gasj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636581345.0
    },
    {
        "author": "EyesEarsMouthNose",
        "body": "Just say EBITDA ma guy",
        "created_utc": 1636676194,
        "id": "hk9q7j4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636704994.0
    },
    {
        "author": "RumHam1",
        "body": "Valuing a stock is really difficult and it often boils down to a lot of different assumptions.  Even experts are routinely wrong, so keep that in mind.  What I do for one company normally takes 3-5 hours, and I try to do it quarterly for any company I own.\n\nI will usually start by collecting the company's past, current and future valuation metrics.  Things like price to sales, price to earnings, price to forward earnings, debt ratios, etc.  I compare the 5 year averages to what they currently are.  I also do for their competitors and companies in the same financial space (for example, I'd look at Visa, Mastercard, and other card companies together).  I look at past growth and projected growth to see if I think the valuations are justifiable where they currently are.\n\nI look through the financial statements and try to spot trends in cash flow, debt, margin, and many other things to see how the company is performing yoy and qoq.\n\nI look at how the company is engaging with the industry and where they are projecting their growth to come from.  Are the expanding market share, is the sector growing, etc.  I need the company to justify why it can achieve or surpass their growth estimates.\n\nI listen to their most recent conference calls and look though any articles I can find, but I heavily discount opinion pieces.  I actively seek out reasons why this company will fail.\n\nAfter all of this, I try to put together a balanced view of where the company is valued now vs historically and also vs their competition.  It requires a lot of projection and assumptions and I only do it for companies that I can understand their business model.  You have to go into the process without bias, and to be honest the majority of companies that I do this for aren't buys at the time.",
        "created_utc": 1636650548,
        "id": "hk81eep",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636679348.0
    },
    {
        "author": "sendokun",
        "body": "I would do 40% on V and PayPal, 20% on MA",
        "created_utc": 1636743617,
        "id": "hkd6o2e",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636772417.0
    },
    {
        "author": "rainbow0o",
        "body": "id rather invest in sofi, visa, mastercard, afrm, and square than paypal.",
        "created_utc": 1636818352,
        "id": "hkgtlx9",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636847152.0
    },
    {
        "author": "Im_Blind_And_Deaf",
        "body": "I wanna sheet on ma bed",
        "created_utc": 1635805147,
        "id": "hixtivs",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635833947.0
    },
    {
        "author": "mwing95",
        "body": "BKKT - Hugh volatility play but with their recent deal with Mastercard I'm liking their future. \n\nSLI - stable lithium company, decent volatility",
        "created_utc": 1635781568,
        "id": "hiw8lzl",
        "score": 3,
        "subreddit": "options",
        "created": 1635810368.0
    },
    {
        "author": "WSBrexiteer",
        "body": "Jack Ma new Chinese Premier after initiating a bloody coup with thousands of tanks bought over AliExpress",
        "created_utc": 1635800966,
        "id": "hixjlz7",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635829766.0
    },
    {
        "author": "WVEers89",
        "body": "Sold my $MA calls for a $400 loss yesterday morning.\nThey would have been worth $1900 at 2pm today.\nSick.",
        "created_utc": 1636145683,
        "id": "hjgrkv1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636174483.0
    },
    {
        "author": "Albedo100",
        "body": "&gt; Visa/Mastercard/Discover all charge the vendor a percentage of the transaction. This fee adds up. Blockchain can be substantially less.\n\nTraditional transaction fees *can* be less as well if they just chose to lower the fees. \n\nYou're missing the point that blockchains carry a premium cost to cover securing the network and it may never been competitive with closed systems. On blockchain *fees* are fundamental. In traditional systems, they aren't.",
        "created_utc": 1636313778,
        "id": "hjpna1h",
        "score": 3,
        "subreddit": "investing",
        "created": 1636342578.0
    },
    {
        "author": "Future_Expat_FIRE",
        "body": "Nice post and I like the set up rather than coming in hot.  Downside risk is limited to $200 IMO and they consistently meet or beat earnings because they are conservative by nature.  I’ve been waiting for this type of opportunity in a solid company for a long time.  Went with $300 Jan 24 leaps just in case I’m completely wrong about Monday, so I have time on my side :)  GLTA and hop on MA if your looking for a safer play that is already breaking out!",
        "created_utc": 1636198685,
        "id": "hjjexax",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636227485.0
    },
    {
        "author": "1200mademeaCommie",
        "body": "I’d go with the beat up Dow names and look for continuation. Axp. V. Ma. Cat. Ba. Dis.",
        "created_utc": 1636197552,
        "id": "hjjda9z",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636226352.0
    },
    {
        "author": "dontgetmadgetdata",
        "body": "I like it. The price is pretty elevated off it’s 50 day MA due to a nice post earnings drift. It has kissed its 50 day 5 times this year. To increase your probability of profit, I might wait until it consolidates/retraces to around this area and open up the position at that time. Possibly move the strike closer to that stock price to further increase the leverage. \n\nFor example, If it retraces to closer to $300 level and open contracts with $280-$300 strike. You would still need around $350 to break even if the cost is halved but you would have substantially more leverage per dollar.",
        "created_utc": 1636230931,
        "id": "hjldc8e",
        "score": 3,
        "subreddit": "options",
        "created": 1636259731.0
    },
    {
        "author": "migbyo",
        "body": "I think [this breakdown of M&amp;A in the biotech industry](https://www.evaluate.com/vantage/articles/data-insights/ma/following-ma-money-phase-and-therapy-area) is interesting.",
        "created_utc": 1636661759,
        "id": "hk8td8r",
        "score": 3,
        "subreddit": "shroomstocks",
        "created": 1636690559.0
    },
    {
        "author": "notreally49",
        "body": "agreed, baba price is 90% dependent on chinese gov easing the pressure and Jack Ma coming back, earnings alone wont take it above 180.",
        "created_utc": 1636757257,
        "id": "hke21z2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636786057.0
    },
    {
        "author": "PCB4lyfe",
        "body": ".75% ER seems high when their top holdings are SQ PYPL V and MA, I just bought those 4 companies and called it a day.",
        "created_utc": 1636820931,
        "id": "hkgzg3n",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636849731.0
    },
    {
        "author": "Mr-Acorns22",
        "body": "GIMME MA MONEY",
        "created_utc": 1635763211,
        "id": "hivbbig",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635792011.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "&gt; not afraid of risk\n\nThat's for sure.\n\nYou can't balance with solid long term plays. It isn't in your character. You'll buy whatever people tell you are long-term solid plays.\n\nLike I could tell you that MACAW is going to the moon, and you'd probably buy it. (I bought it. I'm bullish. Don't buy that, it's gambling, be a good boy.)\n\nSell your bags and buy VOO. If you own something shitty like BABA and it is up, sell that too. Where is the world is Jack Ma? Why would you still be holding that?",
        "created_utc": 1635818343,
        "id": "hiyn5j8",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1635847143.0
    },
    {
        "author": "Tendiemesilly",
        "body": "Imma keeep it lika island boy imma keep it like an island boy imma keep it like a guap ma man, ya ya ya",
        "created_utc": 1636044248,
        "id": "hjavepo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636073048.0
    },
    {
        "author": "Dmoan",
        "body": "It is still way below its highs and 200 day MA",
        "created_utc": 1635790047,
        "id": "hiwsrch",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635818847.0
    },
    {
        "author": "Beilsteiner",
        "body": "Also Jack Ma everything in Baba",
        "created_utc": 1635884708,
        "id": "hj21iye",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635913508.0
    },
    {
        "author": "polychris",
        "body": "[https://imgur.com/a/shou9yJ](https://imgur.com/a/shou9yJ) The MA(50) on the 5 min chart is the 250-min moving average.",
        "created_utc": 1636073524,
        "id": "hjcvsgc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636102324.0
    },
    {
        "author": "Joltarts",
        "body": "I paint you a highly probable bear scenario.\n\nTesla cant meet production demand because of microchip shortages. Tesla is the most chip dependant car company out there. They will get hit by a shortage in chips to produce their cars. The prices of chips will also shoot up so high, Tesla will have no choice but to sell their cars at even lesser margins.\n\nThe green credits which Tesla depends highly on to boost their profit numbers become less attractive in 2022 and it drops significantly. A big revenue stream for Tesla is about to go out of business.\n\nAutonomous driving experiences set back, Tesla cant deliver a workable solution and regulations ban the use of fully auto vehicles due to safety concerns.\n\nThe already crowded Tesla network is both costly to maintain and cant expand quick enough. Other players using standard charging ports catch up and overtake Tesla here. Especially in Europe and China. Since Tesla cars can only charge on Tesla ports, suddenly, Tesla cars are less attractive to own.",
        "created_utc": 1635831051,
        "id": "hiz9qo2",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635859851.0
    },
    {
        "author": "Paul_Ostert",
        "body": "TSM is a buy and hold.... they almost have a monopoly on high end microchip manufacturing.",
        "created_utc": 1636067986,
        "id": "hjcj197",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1636096786.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  4th of November\n\n\n\n## Upcoming events for Thursday, November  4th\n\n - Expected earnings:\n\n  AAOI, AAON, AAU, ABC, ABNB, ABUS, ACET, ACIW, ACMR, ACR, ACRX, ADAP, ADMA, ADMS, ADVM, ADXN, AE, AERI, AES, AEZS, AFCG, AG, AGLE, AGO, AGS, AHCO, AIG, AINV, AIV, AJX, AKBA, AL, ALBO, ALE, ALEX, ALGS, ALHC, ALKT, ALLO, ALRM, ALTR, AMEH, AMH, AMN, AMPY, AMRK, AMYT, ANGI, ANIK, AOSL, APD, APLE, APPN, APR, APRE, APT, APTV, AQMS, ARC, ARDX, ARNA, ARQT, ARVN, ARW, ASMB, ASPS, ASRT, ATAX, ATEC, ATLO, ATNX, ATRA, ATRS, ATSG, ATUS, AUMN, AUTO, AVLR, AVRO, AXNX, BABA, BALY, BAP, BATRA, BATRK, BBD, BBDO, BBIO, BCE, BCLI, BCOR, BCYC, BDX, BE, BEPC, BFS, BGNE, BGS, BHF, BIGC, BILL, BKD, BL, BLCM, BLDR, BLFS, BLI, BLL, BLPH, BNGO, BPMP, BRG, BSBK, BSGM, BXRX, CABO, CAI, CALA, CARS, CBAY, CBIO, CC, CCOI, CDR, CDTX, CDXS, CDZI, CEMI, CFLT, CFX, CGNX, CHH, CHUY, CI, CIR, CLBS, CLDT, CLDX, CLFD, CLI, CLLS, CLNE, CLXT, CMBM, CMRX, CMT, CNCE, CNDT, CNHI, CNP, CNQ, CNXN, COLD, COLL, COMM, CPLG, CPLP, CRAI, CRDF, CRMD, CRON, CRY, CS, CTHR, CTLP, CTMX, CTSO, CTT, CTXS, CUBE, CVCO, CVET, CVNA, CVRX, CWEN, CWEN.A, CWK, CXP, CYBR, CYCN, CYRX, DBRG, DBX, DDOG, DEN, DHC, DIN, DISH, DK, DKL, DLX, DMLP, DNB, DNLI, DNN, DOCN, DRH, DRNA, DUK, DVAX, DWSN, DYN, EBS, ECOR, ED, EGLE, EIGR, ELOX, ENDP, ENG, EOG, EPAM, ERF, ERII, ESTE, ETTX, EURN, EVC, EWCZ, EXPE, FARM, FAT, FATBB, FATE, FCRD, FDUS, FIS, FLNT, FND, FNKO, FOCS, FOLD, FOR, FOXF, FROG, FRT, FSLR, FTNT, FULC, FVCB, FVE, FWONA, FWONK, GBT, GDOT, GDP, GDYN, GEL, GEO, GERN, GH, GIL, GKOS, GLPG, GMED, GNE, GNL, GOGO, GOLD, GOLF, GOVX, GPP, GPRE, GPRO, GRFS, GROW, GRTS, GSBD, GTN, GTN.A, GTYH, HALL, HASI, HBI, HEAR, HHC, HII, HIMX, HL, HMHC, HMPT, HRTG, HSKA, HTA, HWM, HZN, IAC, IBOC, IBP, ICL, IDCC, IDRA, IFRX, IGMS, IHC, IHRT, III, ILMN, IMH, IMMR, IMRA, IMUX, INDP, INDT, ING, INGN, INOD, INS, IOVA, IRM, IRTC, IRWD, ISDR, ISPC, ITP, ITRI, JNCE, JYNT, K, KALA, KBAL, KDMN, KDNY, KFFB, KIQ, KMPH, KOP, KRP, KRTX, KTB, KURA, KVHI, KWR, KYMR, KZR, LABP, LASR, LAUR, LAZY, LBRDA, LBRDK, LCUT, LFVN, LGF.A, LGF.B, LITE, LLNW, LND, LNG, LNT, LNTH, LOCO, LORL, LPTH, LSPD, LSXMA, LSXMB, LSXMK, LTHM, LTRPA, LTRPB, LXP, LYV, MACK, MAIN, MASS, MBUU, MCHP, MDGL, MDRX, MED, MELI, MGEE, MGLN, MGTA, MGTX, MITK, MITO, MLAB, MLCO, MNDT, MNST, MP, MRIN, MRNA, MSC, MSGM, MSI, MTBC, MTD, MTEM, MTSI, MTX, MTZ, MUR, MUX, MXC, MYE, NATR, NE, NEO, NEPH, NET, NFG, NH, NHC, NINE, NKLA, NKSH, NKTR, NLOK, NMM, NNBR, NNI, NOMD, NPTN, NREF, NRG, NS, NSIT, NTCT, NTLA, NTRA, NTUS, NVAX, NVMI, NWS, NWSA, NXTC, OBSV, OEC, OGE, OHI, OLED, ONCT, ONTO, OPCH, OPTN, ORGS, ORIC, ORLA, OTEX, OTRK, OUT, OXY, OYST, PAC, PAE, PALT, PASG, PBA, PBH, PBYI, PCOR, PCTI, PCTY, PDCE, PDEX, PECO, PEI, PENN, PESI, PFSI, PGNY, PH, PHI, PINS, PLM, PLNT, PLX, PMT, PODD, PPL, PRCT, PRDO, PRMW, PROF, PRTA, PRVB, PSNL, PTMN, PTON, PWFL, PWP, PWR, PZG, PZZA, QDEL, QRTEA, QRTEB, QTRX, RBA, RC, RCUS, RDFN, REFR, REG, REGN, REPL, REYN, REZI, RFP, RGA, RGLS, RGS, RKT, RLJ, RMAX, RNGR, RUN, RWAY, SALM, SATS, SELB, SEM, SFE, SFM, SGA, SGMO, SHAK, SHO, SHYF, SID, SIGA, SKM, SLDB, SLQT, SLRX, SMHI, SMLP, SNPO, SO, SPRO, SQ, SRLP, SRRA, SRTS, SSYS, STFC, STKS, STNE, STOR, STRA, STRO, SVC, SVM, SVRA, SWCH, SWKS, SWX, SXI, SYBX, SYNA, TAL, TCX, TDC, TDS, TDW, TEF, TFFP, TGH, TGNA, TGP, TGTX, THR, TIPT, TK, TMCI, TMST, TNK, TPL, TRGP, TRHC, TRIN, TTOO, TTSH, TUEM, TWI, UBER, UEIC, UFCS, UIHC, UNIT, UONE, UONEK, USM, USPH, USWS, VATE, VCTR, VG, VHI, VIA, VIAC, VIACA, VIAO, VIAV, VIR, VLDR, VMC, VNT, VRAY, VRRM, VSAT, VSTO, VTVT, VVI, W, WCC, WD, WELL, WFCF, WLDN, WLL, WMC, WMS, WPM, WSC, WSTG, WW, WWE, WYNN, XENE, XFOR, XLRN, XOMA, XONE, XRAY, XTNT, XXII, Y, YELP, YMAB, YTRA, ZBH, ZEUS, ZGNX, ZTS\n\n - Ex-div:\n\n  AFB, AMX, ARLP, BKEP, BMRC, BPRN, CEQP, CFFN, CMCO, CMS, CPLP, CVCY, DAN, DKL, ET, FBC, FCBC, FCF, FE, FFWM, FRAF, FRBA, GPP, HCC, HSII, HWKN, HWM, IBCP, ICBK, IDA, INTC, JBHT, LBAI, LBC, LVHD, LW, MMLP, MMP, NSC, NWBI, NWLI, NYCB, OHI, PFE, PNFP, RELL, SIRI, SRLP, STZ, STZ.B, SUN, TGP, UL, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Challenger Job Cuts (previous: 17.895K)\n    - Continuing Jobless Claims (consensus: 2,118K, previous: 2,243K)\n    - Exports (previous: 213.70B)\n    - Imports (previous: 287.00B)\n    - Initial Jobless Claims (consensus: 275K, previous: 281K)\n    - Jobless Claims 4-Week Avg. (previous: 299.25K)\n    - Natural Gas Storage (consensus: 63B, previous: 87B)\n    - Nonfarm Productivity (consensus: -3.0%, previous: 2.1%)\n    - OPEC Meeting\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n    - Unit Labor Costs (consensus: 7.0%, previous: 1.3%)\n\n## Upcoming events for Friday, November  5th\n\n - Expected earnings:\n\n  AAMC, AENZ, AMCX, AMR, AMRX, AREC, ATNM, AXL, AY, AYRO, BBU, BCH, BEP, BH, BH.A, BRK.A, BRK.B, CGAU, CGC, CKX, CLMT, CNK, CNTY, CQP, CRNX, CRT, CVR, CZNC, D, DKNG, DOC, DSEY, DTM, DXPE, DXYN, EAF, ECOL, ELAN, ENB, ENIC, ENLV, EPZM, ESGR, ESNT, FET, FLR, FTSI, GBL, GBNY, GCI, GLP, GOOS, GRPN, GSAT, GT, GTS, HE, HMC, HMTV, HRC, HSON, INTT, JCI, JCS, KFS, KIM, LFT, LMRK, MBIO, MFA, MGA, MITT, MMI, MODV, MOG.A, MOG.B, MOSY, MTNB, NATH, NEN, NMRK, NOG, NOVN, NPO, NTP, NVIV, NVO, NWLI, NWN, OCGN, OFIX, OFS, ONCY, PAYA, PFSW, PHVS, PLYM, PNW, PVL, RAND, RSLS, SAMG, SBR, SCYX, SII, SRE, SRNE, SSP, SYRS, TELL, TEN, TGS, THM, TILE, TIXT, TKC, TM, TPHS, TRP, TSE, TU, TUSK, UBOH, UFS, UI, UK, VHC, VRS, VST, VTR, VWTR, WRN, WTM, XELA, YORW\n\n - Ex-div:\n\n  AAPL, AB, ALX, AMP, ARTNA, ASRV, BCO, BSBR, CLAR, CLB, CWT, DHF, ENBL, FBIZ, FBK, FHI, FIBK, GLOP, GLP, GWW, HAFC, HBCP, HBT, JHG, LAZ, LPX, MC, MCI, MN, MRLN, MUSA, NATI, NMM, NS, NSEC, OCFC, PCTI, PEAK, PEBO, PETS, RUSHA, RUSHB, RWAY, SCHN, SHEN, SJW, SXI, VNO, WABC, WMK, WVFC, X, XLNX\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.9%, previous: 4.6%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.6%)\n    - Average Weekly Hours (consensus: 34.8, previous: 34.8)\n    - CFTC Aluminium speculative net positions (previous: 4.2K)\n    - CFTC Copper speculative net positions (previous: 37.3K)\n    - CFTC Corn speculative net positions (previous: 307.8K)\n    - CFTC Crude Oil speculative net positions (previous: 423.7K)\n    - CFTC Gold speculative net positions (previous: 214.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.3K)\n    - CFTC Natural Gas speculative net positions (previous: -138.2K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 96.5K)\n    - CFTC Silver speculative net positions (previous: 37.5K)\n    - CFTC Soybeans speculative net positions (previous: 43.2K)\n    - CFTC Wheat speculative net positions (previous: 0.8K)\n    - Consumer Credit (consensus: 15.90B, previous: 14.38B)\n    - Government Payrolls (previous: -123.0K)\n    - Manufacturing Payrolls (consensus: 27K, previous: 26K)\n    - Nonfarm Payrolls (consensus: 450K, previous: 194K)\n    - Participation Rate (previous: 61.6%)\n    - Private Nonfarm Payrolls (consensus: 400K, previous: 317K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 443)\n    - U.S. Baker Hughes Total Rig Count (previous: 542)\n    - U6 Unemployment Rate (previous: 8.5%)\n    - Unemployment Rate (consensus: 4.7%, previous: 4.8%)\n\n^^^^2021-11-04",
        "created_utc": 1636020014,
        "id": "hj9i3rw",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1636048814.0
    },
    {
        "author": "eyerollingsex",
        "body": "Damn these MCHP lotto calls might pay 😤",
        "created_utc": 1636057045,
        "id": "hjbs4fb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636085845.0
    },
    {
        "author": "jaedubbs",
        "body": "Tesla has insane margins on their EVs and its clear that those margins are growing. The competition needs to sell 3+ EVs for every 1 that Tesla sells. And on top of that, Tesla produces cars in 1/3rd the time. Some OEMs are not profitable at all and each EV sold is a loss.\n\nAlso Tesla has car sales back logged for 6 months!\n\nAnd a simple youtube search of FSD 10.3 shows dozens of reviews and drives of the general public. Meanwhile the competition only reveals company videos of their absolute best drives.\n\nHow about autonomous distribution?\nHow many self driving cars can the competition roll out to with these geofenced cars that need lidar and radar? Compare that to Tesla, which can push an over the air update and sell FSD to millions in an instant.\n\nPeople keep calling Tesla just a car company, but what other car company is the:\n\nMajority part Supplier\nDealership\nFuel provider\nMicrochip maker\nAI developer\nSoftware developer",
        "created_utc": 1635888576,
        "id": "hj2bpld",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635917376.0
    },
    {
        "author": "eyerollingsex",
        "body": "Buying lottos on MCHP for earnings today \n\nMicrochips so hot rn",
        "created_utc": 1636050067,
        "id": "hjbacmu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636078867.0
    },
    {
        "author": "AcanthisittaVarious6",
        "body": "MCHP about to be Baby Nividia",
        "created_utc": 1635984705,
        "id": "hj7xyd0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636013505.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "I guess I’m getting a tattoo of a microchip being dipped into a bowl of French onion dip. \n\nI couldn’t be happier about this.",
        "created_utc": 1636033887,
        "id": "hja5eem",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636062687.0
    },
    {
        "author": "AcanthisittaVarious6",
        "body": "Don’t sleep on MCHP dudes!",
        "created_utc": 1636047497,
        "id": "hjb3s9w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636076297.0
    },
    {
        "author": "spctr13",
        "body": "&gt; in fact im fairly certain all of our parts are manufactured on US soil\n\nDown to what level though? Not many of the basic electronic components everything else is built from are made in the US. American companies like Vishay, Microchip, Texas Instruments, and Xilinx either operate factories in China or contract foundries in China or Taiwan. Other large supplies of ours are not even American such as Yageo and TE Connectivity aren't even headquartered in the US and manufacturer the bulk of their product in their home country. It's been a big issue for my portion of the defense industry the past couple of years because these factories in China are also sourcing a large portion of counterfeit electronic components on the market.\n\nI know we're not the only defense manufacturer using Chinese components because I've seen several news articles and reports from the DOD claiming this is a problem.\n\nhttps://www.washingtontimes.com/news/2020/dec/10/us-military-reliance-china-foreign-suppliers-expos/\n\nPanasonic and Murata (Japanese) used to produce critical components of our products, but have since stopped selling to us because they don't want their products used in munitions. When that happened the government fronted a lot of money to a couple American companies to produce an alternative since none existed.",
        "created_utc": 1635993895,
        "id": "hj8ic9d",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1636022695.0
    }
]