[
    {
        "author": "SeekingHentai",
        "body": "lol math memes 🤣😂🤣 [There are some pretty funny ones like that in this thread.](https://mathoverflow.net/questions/42512/awfully-sophisticated-proof-for-simple-facts) The first one with FlT would be great, except it’s wrong 😞",
        "created_utc": 1623422195,
        "id": "h1eoc4m",
        "permalink": "/r/wallstreetbets/comments/mrzztb/unpinned_daily_discussion_thread_for_april_16_2021/h1eoc4m/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1623450995.0
    },
    {
        "author": "Appropriate-Half-555",
        "body": "Dollarama, Nike, FLT, \n\nDOLLARAMA is a staple of Canadian living has a secure foothold and will only grow and prosper through the years\n\nNIKE known basically world wide appeals to many variety of people, young, old, athletic, casual and has a very strong presence in the sports world,  also JUST DO IT, \n\nFLT(Drone Delivery Canada Corp) FLT is my diamond in the rough , trading under 2$ cad in 2021 . FLT is the company implies isna drone delivery company, they currently have many drones of various sizes, being able to carry from 50 lbs to a few thousand per Drone, with the push towards a green planet and the ever growing desire for convenience and saving time, I strongly believe that Drone delivery will be heavily implemented in our near future,  and FLT  is already getting a good foothold in the sector before it becomes a nessecity",
        "created_utc": 1624382843,
        "id": "h2o8rwo",
        "permalink": "/r/ValueInvesting/comments/o4sc6t/you_get_to_choose_3_companies_to_buy_hold_and/h2o8rwo/",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1624411643.0
    },
    {
        "author": "boston101",
        "body": "Thoughts on FLT?",
        "created_utc": 1624224610,
        "id": "h2gy2iz",
        "permalink": "/r/wallstreetbets/comments/o4dpla/what_are_your_moves_tomorrow_june_21_2021/h2gy2iz/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624253410.0
    },
    {
        "author": "Appropriate-Half-555",
        "body": "You compose yourself very well! I wish I had half of your abilities in creating a appealing to they eye paragraph, I definitely have my fingers crossed that FLT becomes a Pamela!",
        "created_utc": 1624437663,
        "id": "h2qy4xc",
        "permalink": "/r/ValueInvesting/comments/o4sc6t/you_get_to_choose_3_companies_to_buy_hold_and/h2qy4xc/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1624466463.0
    },
    {
        "author": "ONT85BAKE",
        "body": "I think its still  far off, a lot of retailers have been pushing that this is the way of the future and have shown even test videos to suppliers/investors, but there is still of regulations to be moved forward.  Saying that I'm in FLT for 7% of my portfolio and think there is potential, but there is also a risk of someone bigger moving into this space quickly when things start ramping up.",
        "created_utc": 1623251234,
        "id": "h15swxq",
        "permalink": "/r/wallstreetbets/comments/nvxcf6/drone_delivery_canada_takof/h15swxq/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623280034.0
    },
    {
        "author": "Horizons_2481",
        "body": "Excellent choices, I like the diversity and the theme. I especially like the diamond in the rough. Pamela Anderson was once upon a time the Bitcoin of superstars. She was hot to print! Today seldom heard of… perhaps FLT is the tomorrows Pamela?",
        "created_utc": 1624407866,
        "id": "h2pp0e4",
        "permalink": "/r/ValueInvesting/comments/o4sc6t/you_get_to_choose_3_companies_to_buy_hold_and/h2pp0e4/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1624436666.0
    },
    {
        "author": "grayer9",
        "body": "VEQT - 43.93%\n\nAPPS - 17.91%\n\nCCIV - 7.55%\n\nETH.Q - 4.45%\n\nQBTC - 6.75%\n\nFLT - 2.29%\n\nMMED - 4.35%\n\nNUMI - 11%\n\nPYSK - 1.74%\n\nI also hold about 0.5 ETH. \n\n&amp;#x200B;\n\n25 years old, teacher. My goal is long term growth even though I have a strong pension as an educator. I would also love to purchase property in the near future, but am fine with renting and focusing my earnings on building my assets. I have just recently started investing in 2021, and am working on diversifying my portfolio. I realize that it's not the most appealing portfolio, but I plan on adding funds on a consistent basis (200-300/month). I would like to keep adding funds to VEQT. Any advice for a new investor? I love learning about this sector.",
        "created_utc": 1622648406,
        "id": "h0bp05m",
        "permalink": "/r/CanadianInvestor/comments/npqeoe/rate_my_portfolio_megathread_for_june_2021/h0bp05m/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1622677206.0
    },
    {
        "author": "BuyerOwn313",
        "body": "Can’t decide FLT or WELL 🤔",
        "created_utc": 1623621007,
        "id": "h1nzmu8",
        "permalink": "/r/wallstreetbets/comments/nz4kgk/what_are_your_moves_tomorrow_june_14_2021/h1nzmu8/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1623649807.0
    },
    {
        "author": "Eatern-Republic5884",
        "body": "TAKOF is good long term penny stock play.\n\n- Drone Delivery Canada Corp. (TSXV: FLT) (OTC QX: TAKOF) (Frankfurt: A2AMGZ) or (Frankfurt: ABB.F) (the \"Company\" or \"DDC\") is pleased to announce that, with the assistance of its sales agent Air Canada (TSX: AC), it has been selected by the University of British Columbia (\"UBC\") to deploy DDC's patented drone delivery solution at the Stellat'en First Nation, for UBC's \"Remote Communities Drone Transport Initiative\" program.\n\nDrone Delivery Canada Corp. Logo (CNW Group/Drone Delivery Canada Corp.)\nDrone Delivery Canada Corp. Logo (CNW Group/Drone Delivery Canada Corp.)\nThe project will enable defined-route deliveries utilizing DDC's Sparrow drone and its DroneSpot® takeoff and landing zones as well as additional drone flight infrastructure as required. The solution will be used to transport a variety of cargo for the benefit of the Stellat'en First Nation, located in the Fraser Lake area of Central Northern British Columbia, Canada.\n\nDDC and UBC will work towards finalizing a definitive agreement shortly. DDC is expected to commence deployment of site infrastructure summer of 2021 and expects to begin providing drone delivery services under the agreement in the second half of 2021. The drone project term is expected to be 12 months. This deployment will be DDC's fourth First Nations project and its first in British Columbia.\n\nAll operations will be conducted in accordance with appropriate Canadian regulations. Flights will be remotely monitored by DDC from its Operations Control Centre located in Vaughan, Ontario.\n\n\"We look forward to working with Drone Delivery Canada and all partners on this project for the benefit of the Stellat'en First Nation. Many First Nations communities in B.C. are on lockdown to reduce transmission of COVID-19, which has exacerbated inequitable access to health care supplies and services, ranging from personal protective equipment and medications to laboratory services such as COVID-19 testing and diagnostics for other medical conditions,\" said Dr. Michael Allard, Vice-Dean, Health Engagement &amp; Partnerships, UBC.\n\n\"Based on the isolated location of our community and the needs of our residents, drone transport may enhance our access to COVID-19 testing and medication without traveling and endangering other members of our community,\" said Chief Robert Michell of the Stellat'en First Nation, located about 100 kilometres west of Prince George. \"The futuristic potential of this initiative is exciting. With drone technology, there is so much you can do.\"\n\n\"We are pleased that UBC has chosen Drone Delivery Canada as part of their 'Remote Communities Drone Transportation Initiative' at the Stellat'en First Nation. The UBC Faculty of Medicine is a recognized global leader and we applaud their initiative to embrace drone delivery to benefit First Nations communities. As an award-winning global leader, DDC is pleased with our continued business successes in the drone delivery industry,\" said Michael Zahra, President &amp; CEO of DDC",
        "created_utc": 1623341323,
        "id": "h1amc3g",
        "permalink": "/r/pennystocks/comments/nwdvyd/the_loungedaily_plays_june_10_2021/h1amc3g/",
        "score": -1,
        "subreddit": "pennystocks",
        "created": 1623370123.0
    },
    {
        "author": "cricketfan2",
        "body": "Flower food \n\nMaximus\n\nBrunswick corporation \n\nBooz Allen Hamilton \n\nJ.B Hunt transport \n\nExpeditor International \n\nPulte Group \n\nOwen corning \n\nAmkor",
        "created_utc": 1622534495,
        "id": "h066677",
        "permalink": "/r/ValueInvesting/comments/np967b/finding_stocks_based_on_michael_burrys_early/h066677/",
        "score": 10,
        "subreddit": "ValueInvesting",
        "created": 1622563295.0
    },
    {
        "author": "juan62389",
        "body": "GLW",
        "created_utc": 1622563745,
        "id": "h07glj3",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h07glj3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622592545.0
    }
]