[
    {
        "author": "keksper",
        "body": "I see a lot of answers that say \"sell it!\" or \"don't sell it!\" but at the end of the day the way to make a rational decision is:\n\n*If you were handed that money right now in $10K in cash, would you spend it on IBM?* If not, you should put the money elsewhere.",
        "created_utc": 1624496143,
        "id": "h2u0nkb",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u0nkb/",
        "score": 5432,
        "subreddit": "investing",
        "created": 1624524943.0
    },
    {
        "author": "terribleatlying",
        "body": "I asked because there was no tax consideration in the calculation. it's not $10k of IBM vs $10k of VTI. You gotta sell and that's a taxable event",
        "created_utc": 1624499927,
        "id": "h2u7pue",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u7pue/",
        "score": 104,
        "subreddit": "investing",
        "created": 1624528727.0
    },
    {
        "author": "Working_onit",
        "body": "\"Innovative high-growth stocks\" are far from guaranteed to outperform IBM.",
        "created_utc": 1624539886,
        "id": "h2vpsmq",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2vpsmq/",
        "score": 79,
        "subreddit": "investing",
        "created": 1624568686.0
    },
    {
        "author": "terribleatlying",
        "body": "I asked because there was no tax consideration in the calculation. it's not $10k of IBM vs $10k of VTI. You gotta sell and that's a taxable event",
        "created_utc": 1624499954,
        "id": "h2u7rnq",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u7rnq/",
        "score": 67,
        "subreddit": "investing",
        "created": 1624528754.0
    },
    {
        "author": "AngeloMonharti",
        "body": "Copying and pasting from an earlier conversation I had today:\n\nNvidia has a few CMP HX partner models preparing to launch - these are the mining specific cards. They have no display output which means they can't be used for gaming. Nvidia is also revising ALL current 30 series (except 3090 I believe) to a LHR (light hash rate) version which is a physical difference in the silicon. They are doing this to nerf ETH mining performance on their 30 series cards at the hardware level.\n\nCurrently, Nvidia's CMP HX mining cards make no economic sense to mine on since they are way less power efficient, and have no resale value since they can't be used for gaming. However, if Nvidia completely locks down ETH hash rate on the 30 series, they can increase their TAM by preventing miners from cannibalizing their gaming sales. So far, the CMP HX cards look like they are built on 10 series architecture so they will be able to be produced cheaper and in parallel to 30 series.\n\nLastly, the ARM deal seems to be moving along. Qualcomm has voiced concerns and said they are ready to invest in ARM as a partner if the Nvidia deal falls through. Nvidia says it has 3 other silicon manufacturers who support the Nvidia deal but details aren't known yet. Nvidia's recent rise is likely due to the probability of the ARM deal actually becoming more likely.\n\nIn case you dont understand why the ARM deal is good for NVDA, it means that all ARM-based chip manufacturers are beholden to NVDA. ARM is the most dominant CPU architecture for all mobile CPUs including micro controllers in other devices. Apple, qualcomm, samsung, amd, intel, huawei, IBM all have ARM licenses\n\nIt allows NVDA to penetrate the mobile market. Nvidia has the highest profit margins on their mobile CPUs because they don't have to rely on partners to distribute chunky desktop cards. They sell the silicon directly. Every iphone and samsung galaxy could have an Nvidia-produced CPU and GPU.\n\nThe reason ARM is used for mobile is because of its power efficiency. If Nvidia knows what they are doing (they do) then they know how they can use their proprietary access to ARM to create ultra performant and efficient server chips, feeding into their datacenter revenue.\n\nNvidia has announced plans to enter the server CPU market. When they announced this, Intel and AMD stock tanked 5% or so. My bet is that they are already working with ARM to deliver their CPU server chips\n\nTL;DR - ARM deal going through would make NVDA pull a page out of 2020 TSLA's book. Downside is ARM deal delays, pricing in approval then having it get denied. Would crush the stock.",
        "created_utc": 1624894321,
        "id": "h3bw68t",
        "permalink": "/r/stocks/comments/o9lrfo/thoughts_on_nvda_and_their_upcoming_split/h3bw68t/",
        "score": 62,
        "subreddit": "stocks",
        "created": 1624923121.0
    },
    {
        "author": "russkhan",
        "body": "It's relevant. If OP would end up converting $10,000 worth of IBM into $7,000 of VOO, shouldn't that be considered when deciding what to do?",
        "created_utc": 1624500894,
        "id": "h2u9lvt",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u9lvt/",
        "score": 60,
        "subreddit": "investing",
        "created": 1624529694.0
    },
    {
        "author": "boon4376",
        "body": "So is the difference between keeping it in IBM vs an innovative high-growth stock for the one year capital gains term.",
        "created_utc": 1624506677,
        "id": "h2uk3a6",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2uk3a6/",
        "score": 59,
        "subreddit": "investing",
        "created": 1624535477.0
    },
    {
        "author": "Mariox",
        "body": "IBM is a solid dividend stock. They have never lowered their dividend, even in 2000 or 2008 and keep increasing it.\n\nWill not see big gains on IBM, but if the market ever crashes, IBM will continue to pay out the dividend.",
        "created_utc": 1624496661,
        "id": "h2u1mgc",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u1mgc/",
        "score": 45,
        "subreddit": "investing",
        "created": 1624525461.0
    },
    {
        "author": "Gorpachev",
        "body": "I forgot what the class was called, but it was business related and we entered a Long Island stock competition put on by Newsday.  We came in 3rd amongst hundreds of teams thanks to awesome stock tips from my Dad...this was early 90's and we were pouring our fake money into Microsoft, Adobe, IBM, and other tech stocks....while most other kids were buying Nike and Coke.  The two teams that beat us had returns several multiples above ours.  My teacher was convinced they were backdating their trades.  :-)  But whatever, it was a ton of fun and planted the seed for later in life.  That teacher wrote in my yearbook he expects a share of the first million I make in the market...I actually want to make good on that.",
        "created_utc": 1624252937,
        "id": "h2iatgt",
        "permalink": "/r/stocks/comments/o4n02o/why_dont_high_schools_have_classes_on_stock_market/h2iatgt/",
        "score": 42,
        "subreddit": "stocks",
        "created": 1624281737.0
    },
    {
        "author": "jmlinden7",
        "body": "Unless they have a huge product success and start regaining market share or maybe expanding successfully into other markets, it doesn't seem like they are likely to grow in the future. So they aren't being priced as a growth stock, but rather as a value stock like IBM.",
        "created_utc": 1624987464,
        "id": "h3gm8sw",
        "permalink": "/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/h3gm8sw/",
        "score": 38,
        "subreddit": "investing",
        "created": 1625016264.0
    },
    {
        "author": "SpookyKG",
        "body": "Would you buy 10k of IBM not?\n\nIf not, sell and go VOO.",
        "created_utc": 1624496742,
        "id": "h2u1rv7",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u1rv7/",
        "score": 34,
        "subreddit": "investing",
        "created": 1624525542.0
    },
    {
        "author": "sokpuppet1",
        "body": "Fidelity. Vanguard’s interface is only a step above using punch cards in a 1970s IBM terminal.",
        "created_utc": 1623468791,
        "id": "h1hav5x",
        "permalink": "/r/stocks/comments/nxwv3l/fidelity_vs_vanguard_for_individual_stocks/h1hav5x/",
        "score": 32,
        "subreddit": "stocks",
        "created": 1623497591.0
    },
    {
        "author": "RajivChaudrii",
        "body": "Noone thinks Intel will die off, but plenty, including I, think Intel may plateau like IBM did for the next decade or two.  Intel pouring billions into fabs doesn't guarantee technology leadership as TSMC is investing just as much and has a sizable lead.  \n\nPlus, having a working relationship with Intel, I can say there are still alot of entrenched \"old school\" management who don't do much but will fight tooth and nail to resist any change or challenge to their power.  Turning that titanic corporation around is going to be a slow and bloody process, way beyond just the CEO.",
        "created_utc": 1623689439,
        "id": "h1qyadj",
        "permalink": "/r/investing/comments/nzppgh/due_diligence_on_intel_intc/h1qyadj/",
        "score": 26,
        "subreddit": "investing",
        "created": 1623718239.0
    },
    {
        "author": "TheLastRedditUserID",
        "body": "Former IBM employee here. the stock has split many times I would sell 20% hold the rest. The majority of their business is the mainframe side. Customers also paid thousands of dollars per month for maintenance contracts because there was always some issue that needed to be fixed by a technician on site. A lot of companies did not have maintenance coverage and for those who didn't but needed service the system would create an HSI hourly service invoice once the tech arrived at the customers location. This HSI bill would be so high that the company would either pay it or ask if there was another option where we would offer to retroactively bill them for one year of maintenance coverage which 99% of the time was always significantly cheaper than paying the HSI. They have clients such as Walmart the scanner used is IBM the computer the register the mainframe, the cloud, the analytics and so on.",
        "created_utc": 1624510504,
        "id": "h2upwpf",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2upwpf/",
        "score": 24,
        "subreddit": "investing",
        "created": 1624539304.0
    },
    {
        "author": "Canadacapper",
        "body": "IBM is a soggy stock of yesteryear.  It’s done nothing for the last 20 years really.  (Especially when you take inflation into consideration)   I’d dump it for something else",
        "created_utc": 1624495464,
        "id": "h2tzdc4",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2tzdc4/",
        "score": 21,
        "subreddit": "investing",
        "created": 1624524264.0
    },
    {
        "author": "bunkerhunt",
        "body": "Sounds like IBM in the 80's",
        "created_utc": 1624997938,
        "id": "h3haeyd",
        "permalink": "/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/h3haeyd/",
        "score": 21,
        "subreddit": "investing",
        "created": 1625026738.0
    },
    {
        "author": "VioletChipmunk",
        "body": "Honestly though if you don't like IBM and would rather be more diversified then $8k in voo might be preferable.",
        "created_utc": 1624503852,
        "id": "h2uf90p",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2uf90p/",
        "score": 19,
        "subreddit": "investing",
        "created": 1624532652.0
    },
    {
        "author": "iwanttogolfallday",
        "body": "“Nice juicy milf with double d’s”\n\nMore like a geriatric, assisted living dwelling, walker toting, shriveled up raisin on death’s doorstep. \n\n\nHow incredibly flawed your understanding of Intel’s fabrication abilities and their architecture. How long have you been following Intel? 3 seconds? \n\nEnjoy being cucked by a dying boomer stock. Can’t wait to see your next contribution, telling everyone how IBM and GE are ready to moon too. \n\nAMD 9/17 (5)$85c, (10)$90c and (30) 1/20/23 $100c. \n\nYou go ahead and buy your $55c. Let’s see who wins cuckboi.",
        "created_utc": 1624709337,
        "id": "h33kq29",
        "permalink": "/r/wallstreetbets/comments/o85951/intel_23_itm_calls/h33kq29/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1624738137.0
    },
    {
        "author": "SomeSortOfBrit",
        "body": "Yeah but I thought IBM had the largest working computer (I could be wrong has been about a year since I've done any Quantum work) with plans to scale up to 1000 qbits in 3 years from then. They may have the largest working of a specific type though but it's hard to know which will have the best scalability.",
        "created_utc": 1623162723,
        "id": "h116lcb",
        "permalink": "/r/stocks/comments/nv4lcg/honeywell_quantum_solutions_and_cambridge_quantum/h116lcb/",
        "score": 17,
        "subreddit": "stocks",
        "created": 1623191523.0
    },
    {
        "author": "Available-Lunch3085",
        "body": "I don't see any other company positioned like this, not even apple/microsoft/ibm/samsung",
        "created_utc": 1622907601,
        "id": "h0p304s",
        "permalink": "/r/wallstreetbets/comments/nsy4uq/nok_nok_industry_40_web_30_iot/h0p304s/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1622936401.0
    },
    {
        "author": "dopexile",
        "body": "I would sell it all and swap it for an S&amp;P 500 ETF. IBM is a failing business, they have like 10 years of declining revenue. \n\nThey are mostly keeping their stock price afloat through financial engineering like accounting wizardry, debt, and share buybacks.\n\nA key data point is that Warren Buffett got involved and bought IBM shares when he thought they were a cheap value. He ended up reversing course and selling all his shares and then later talked about how it was an investment mistake.",
        "created_utc": 1624500580,
        "id": "h2u908v",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u908v/",
        "score": 16,
        "subreddit": "investing",
        "created": 1624529380.0
    },
    {
        "author": "Japoco82",
        "body": "T, XOM, IBM, PRU, etc. There's quite a few to choose from though oil might not be the most safe over a 40 year period.\n\nMost of their employees buy stock incentives like that for their retirement and its a proven strategy.",
        "created_utc": 1624726089,
        "id": "h34e4m1",
        "permalink": "/r/stocks/comments/o8akyg/are_dividends_worth_it/h34e4m1/",
        "score": 15,
        "subreddit": "stocks",
        "created": 1624754889.0
    },
    {
        "author": "Proffesssor",
        "body": "People say IBM is a dying dinosaur. But they have moved into cloud etc. It's usually best to hold your $10000 in IBM stock until you have a clear plan of what to do with your $9000 of IBM stock. Making a rash decision regarding your $8000 of IBM stock could end up costing you thousands of dollars of value that you had in your $7000 of IBM stock.",
        "created_utc": 1624501308,
        "id": "h2uae93",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2uae93/",
        "score": 14,
        "subreddit": "investing",
        "created": 1624530108.0
    },
    {
        "author": "slawre89",
        "body": "I like how this morning all the jerk offs from seeking alpha, investorplace, and yahoo finance did a complete 180 and put out positive PLTR articles. Talking about “PLTR is poised to dominate data” no shit? \n\nFor the past few months they’ve just been talking shit saying PLTR Is overpriced with competition from IBM and Alteryx...this whole thing is rigged af",
        "created_utc": 1622550696,
        "id": "h06pr2w",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h06pr2w/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1622579496.0
    },
    {
        "author": "Tyr312",
        "body": "IBM and GE leadership?  1000% short. They don’t now how to transform or make a profit.",
        "created_utc": 1623783060,
        "id": "h1vocih",
        "permalink": "/r/wallstreetbets/comments/o0llbl/pitney_bowes_inc_the_sleeping_giant/h1vocih/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1623811860.0
    },
    {
        "author": "sicklyslick",
        "body": "Would you buy 5K of IBM?",
        "created_utc": 1624496694,
        "id": "h2u1olo",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u1olo/",
        "score": 13,
        "subreddit": "investing",
        "created": 1624525494.0
    },
    {
        "author": "PappyGrant",
        "body": "These types of \"one size fits all\" approaches are incredibly misleading and gets people into more trouble than it should.\n\nFor example, on the \"Simplified Value Investing Cheat Sheet\" it states an \"undervalued\" PE is a Price-to-Earnings Ratio under 15.\n\n1) That ratio tells me nothing about the amount of debt a company has so I think PE is generally worthless.\n\n2) This does not factor in at all interest rates. So if you hold yourself to that standard, you would have never invested the past decade and you would have missed the biggest bull run in US history.\n\nAll of this to say, anytime I read \"cheat sheet\" or \"ways to beat the market\" I cringe. It oversimplifies the process and leads neophytes to covet the wrong things.\n\nCan numerical data help support your investment? Absolutely. Though they should not be your one-size-fits-all approach to investing. This kinda numerical thinking made Buffett invest in IBM, and the opportunity cost of that investment is one of his largest mistakes.",
        "created_utc": 1623687993,
        "id": "h1quypn",
        "permalink": "/r/ValueInvesting/comments/nzn9ik/the_complete_value_investing_cheat_sheet/h1quypn/",
        "score": 13,
        "subreddit": "ValueInvesting",
        "created": 1623716793.0
    },
    {
        "author": "mic_sco",
        "body": "Is IBM going to give you a 10% return consistently year over year for the next 30 years? I think not. But a S&amp;P 500 fund will. It’s an easy decision to be honest.",
        "created_utc": 1624496843,
        "id": "h2u1yjh",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u1yjh/",
        "score": 12,
        "subreddit": "investing",
        "created": 1624525643.0
    },
    {
        "author": "hrt1234",
        "body": "Chen is a brilliant turn around specialist. He sold Sybase to SAP.\n\nBB is severely undervalued and is currently working with IBM and AMZN. IBM/Amazon should buyout BB at a minimum 4x current market cap which will make the sale comparable to Zscaler and Okta. Apple is also a good candidate but they're too cheap.\n\nBB isn't a meme stock and shouldn't be classified with GME and AMC. For transparency, I own stock/options on GME and AMC.",
        "created_utc": 1623627296,
        "id": "h1ob2f6",
        "permalink": "/r/wallstreetbets/comments/nyyq9f/blackberry_undervaluationleader_in_ev_iot_and/h1ob2f6/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1623656096.0
    },
    {
        "author": "SirGlass",
        "body": "I would just add if you are buying an individual stock the hold forever plan isn't good. Now I am a long term investor if I buy a company I plan to hold for 5-10 years or forever. However 10 years is a lot less time then forever.\n\nI could give countless examples, in 1990 was IBM a great 10+ year hold 100% yes. In 2010 was it; very questionable because in the 20 years a lot of thing changed\n\nSo never plan to hold an individual security forever lots of thing can change\n\nMy only buy and hold forever are broad based index funds",
        "created_utc": 1623542605,
        "id": "h1ki1hg",
        "permalink": "/r/investing/comments/nyflp1/when_to_cut_and_run_vs_when_to_hold/h1ki1hg/",
        "score": 12,
        "subreddit": "investing",
        "created": 1623571405.0
    },
    {
        "author": "cariusQ",
        "body": "I don’t know anyone in tech who take IBM seriously. \n\nThey’re a joke of their former self. Acquisition of red hat help some but personally I’m still suspicious of the company.",
        "created_utc": 1624502140,
        "id": "h2ubza3",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2ubza3/",
        "score": 12,
        "subreddit": "investing",
        "created": 1624530940.0
    },
    {
        "author": "andrewerog",
        "body": "IBM is a dying business. Legacy tech, poor management. Why keep it when there is so much better?",
        "created_utc": 1624495977,
        "id": "h2u0cfr",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u0cfr/",
        "score": 12,
        "subreddit": "investing",
        "created": 1624524777.0
    },
    {
        "author": "ModernBuddha1",
        "body": "the number is based on comparison with peers. Crowdstrike, zscaler, ibm, vmware, okta. Microsoft too since they were competting with BB in car space but lost.",
        "created_utc": 1623600319,
        "id": "h1mthfn",
        "permalink": "/r/wallstreetbets/comments/nyyq9f/blackberry_undervaluationleader_in_ev_iot_and/h1mthfn/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1623629119.0
    },
    {
        "author": "geezer242",
        "body": "\"Stick to the fundamentals. That's how IBM and Hilton were built. Good things, sometimes, take time.\"",
        "created_utc": 1622585092,
        "id": "h08s8cv",
        "permalink": "/r/CanadianInvestor/comments/nq50de/suto_laggard/h08s8cv/",
        "score": 11,
        "subreddit": "CanadianInvestor",
        "created": 1622613892.0
    },
    {
        "author": "Python_Noobling",
        "body": "Yes.\n\nAlso research the whole ibm deal.\n\nKarp and thiel also rub elbows with the western elite. They attend bilderberg, davos etc. no accident that they are winning tons of awards from western govts",
        "created_utc": 1622959006,
        "id": "h0rnil4",
        "permalink": "/r/stocks/comments/ntek6r/since_data_is_the_new_oil_is_palantir_a_great/h0rnil4/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1622987806.0
    },
    {
        "author": "AtrociKitty",
        "body": "&gt;Samsung has a history of being a little \"generous\" with the description of their node sizes\n\nSo does TSMC, it's all marketing. Intel is being forced to rename their nodes because of how \"generous\" TSMC is, which has led to a lot of consumer confusion. For example, Intel's 10nm is actually smaller than both TSMC's 7nm and Samsung's 7nm, because the true equivalent sizes of these nodes are 9nm (Intel) and 10nm (TSMC and Samsung).\n\nHere's how manufacturing nodes rank based on half-pitch scaling of an equivalent (in transistor density) planar transistor node:\n\n15. 32nm Intel\n\n14. 28nm TSMC / 28nm UMC / 28nm Samsung/GlobalFoundries/IMB\n\n13. 22nm Intel /22nm IBM\n\n12. 20nm TSMC /20nm Samsung/20nm Intel (marketed as “22FFL)\n\n11. 18nm TSMC (marketed as “16nm”) / 18nm Samsung/GF (marketed as “14nm”)\n\n10. 17nm GF (marketed as “12nm” (12LP) by GF)\n\n09. 16nm TSMC (marketed as “12nm” (12FFC) by TSMC)\n\n08. 14nm Intel / 14nm Samsung (marketed as “10nm” by Samsung)\n\n07. 13nm Samsung (marketed as “8nm” by Samsung)\n\n06. 10nm TSMC (marketed as “7nm” (N7/N7P))/ 10nm Samsung (marketed as “7nm”)\n\n05. 9nm Intel (marketed as “10nm”)/ 9nm TSMC (marketed as 7nm (N7+))\n\n04. 6.7nm TSMC (marketed as “5nm”)\n\n03. 6.4nm Intel (marketed as “7nm”)\n\n02. 5nm TSMC (marketed as “3nm”)\n\n01. 4.5nm Intel (marketed as “5nm”)",
        "created_utc": 1624378252,
        "id": "h2nyjpw",
        "permalink": "/r/investing/comments/o5q8sq/recommendation_buy_the_shit_out_of_tsmc/h2nyjpw/",
        "score": 10,
        "subreddit": "investing",
        "created": 1624407052.0
    },
    {
        "author": "Ruffelz",
        "body": "I can see where they're coming from. The $10,000 of IBM is still going to get taxed when the shares are sold. So unless the endgame is to just grow old and die on a pile of IBM shares, they need to be sold eventually and the tax burden will probably be the same proportion. Moving to $7,000 of VOO means that the gains were realized and now selling the VOO only incurs taxes on every dollar earned above 7k.",
        "created_utc": 1624505959,
        "id": "h2uiwvx",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2uiwvx/",
        "score": 10,
        "subreddit": "investing",
        "created": 1624534759.0
    },
    {
        "author": "SnooCapers8443",
        "body": "the website of the company you want to buy stock from, just look up for example \"IBM investor relations\" and you find the quarterly and anual reports and results from audits.",
        "created_utc": 1622531217,
        "id": "h062mbf",
        "permalink": "/r/stocks/comments/npgwy0/does_anybody_have_yahoo_finance_plus_i_enjoy/h062mbf/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1622560017.0
    },
    {
        "author": "Adderalin",
        "body": "I can create a ton of back tests showing where IBM beats VOO and back tests where it doesn't. There is a real cost in that if OP sells they could only have effectively $8,500 to invest with instead that may or may not beat $10k of IBM in the future. \n\nVOO would have to grow 17.64% over IBM just to make up for realizing a 15% loss. \n\nGranted it's only $10,000 but you really don't want to be realizing costs either if you can avoid it. \n\nThere is a lot more things I'd suggest to the OP to invest in besides VOO but it was very important to point out a huge fact the rest of Reddit overlooked - there could be significant capital gains on this position if they sold the shares.",
        "created_utc": 1624506757,
        "id": "h2uk81o",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2uk81o/",
        "score": 10,
        "subreddit": "investing",
        "created": 1624535557.0
    },
    {
        "author": "AngieDaBaker",
        "body": "I feel like boring is where the most gains are. Take etfs for example. Voo and Vti are boring and they represent the benchmarks everyone is trying to compete with. Large cap well established companies are boring, but those are what drive the market. Ya you would make a lot of money finding a net net or the next Apple as a small cap, but for anyone that doesn’t invest for a living, being knowledgeable enough and patient enough to know that companies like Coca Cola and 3m will always be there and will more time than not offer you a great risk adjusted return is what i believe to be the key to long term investing. \n\nYou won’t find a lot of people here that have been investing in the market for 20+ years because of the lack of popularity, know how, and the cost barriers investing outside of a company ESOP or 401k; but the comments i have heard from some of the older guys i know and work with, they have either been buying into SPY, or things like MetLife, FPL, IBM, and the likes. They bought or kept buying and just let time do it’s thing",
        "created_utc": 1624673240,
        "id": "h32c0ce",
        "permalink": "/r/investing/comments/o808c7/is_it_normal_to_not_get_excited_about_the_stocks/h32c0ce/",
        "score": 10,
        "subreddit": "investing",
        "created": 1624702040.0
    },
    {
        "author": "Impressive-Sleep-622",
        "body": "right after CLF squeeze it KO and IBM, maybe GE",
        "created_utc": 1623260712,
        "id": "h16gor2",
        "permalink": "/r/wallstreetbets/comments/nvs38y/daily_discussion_thread_for_june_09_2021/h16gor2/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1623289512.0
    },
    {
        "author": "MaxStupidity",
        "body": "&gt;If you were handed that money right now in $10K in cash, would you spend it on IBM? If not, you should put the money elsewhere.\n\nBingo, aka sell it and buy something else.",
        "created_utc": 1624520988,
        "id": "h2v2pkf",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2v2pkf/",
        "score": 9,
        "subreddit": "investing",
        "created": 1624549788.0
    },
    {
        "author": "OddaJosh",
        "body": "OP has 10k worth, $IBM is around ~$144... they don't have 100 shares for options selling.",
        "created_utc": 1624505665,
        "id": "h2uifdn",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2uifdn/",
        "score": 9,
        "subreddit": "investing",
        "created": 1624534465.0
    },
    {
        "author": "ankole_watusi",
        "body": "Correct. By the way I voted your comment up even though people are going to vote my comment down because they disagree with my opinion And don’t want to admit that the CDN that they chose for their shitty little start up or agency isn’t the best because the best isn’t available to them.\n\nIt is true that Akamai is generally unapproachable to smaller Shops there are no pricing plans at less than about $1000 a month minimum.\n\nThere is a workaround through IBM and I use that for my own and client sites you only pay for usage and there is no minimum but the ordering is done through IBM cloud and there are some features not available And there’s no handholding and support comes through IBM not directly from Akamai. \n\nAnd yes, indeed, they are an enterprise-y call us for a quote operation for Enterprises.",
        "created_utc": 1623224921,
        "id": "h14mmhk",
        "permalink": "/r/stocks/comments/nvgoxq/fastlyfsly_had_a_worldwide_outage_today_resulting/h14mmhk/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1623253721.0
    },
    {
        "author": "refurboftheweek",
        "body": "IBM's revenue has been steadily declining, however they generate enough profit to pay for the dividend, repurchase their own shares their market cap is not that big compared to other companies.\n\nI would SLOWLY start selling some shares every time it moves up and also buy your ETF, same for the dividend, do not invest it back into IBM, invest those in your ETF and your investment will continue to grow.",
        "created_utc": 1624496576,
        "id": "h2u1grd",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u1grd/",
        "score": 9,
        "subreddit": "investing",
        "created": 1624525376.0
    },
    {
        "author": "deadjawa",
        "body": "All the highly paid software developers at Amazon that I know fucking hate it LOL.  But they do get paid a lot.\n\nOne possible explanation is that LinkedIn is used by people seeking to get a better job and get paid more money, not by people who are just happy with where they are at.\n\nI mean IBM is on this list and it’s a notoriously shitty place to work with a toxic management culture, other than a few small pockets.",
        "created_utc": 1624540534,
        "id": "h2vqz6d",
        "permalink": "/r/stocks/comments/o6mci7/what_if_you_invested_in_the_linkedin_top_10/h2vqz6d/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1624569334.0
    },
    {
        "author": "AllanBz",
        "body": "Assuming maximum loss to taxes is a much better comparison than $10k of IBM vs $10k of VOO, especially for a stock that’s grown “almost 1000%” since the mid-nineties. If it’s a gift, not a bequest, there is no adjustment to the cost basis. Since OP’s gift is the smallest of ten recipients of IBM stock, I think assuming it’s the result of a lifetime IBM worker’s stock options or a very long term buy-and-holder is not unwarranted.",
        "created_utc": 1624514031,
        "id": "h2uup45",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2uup45/",
        "score": 8,
        "subreddit": "investing",
        "created": 1624542831.0
    },
    {
        "author": "greg_r_",
        "body": "You're missing the point. 20 years ago, many thought IBM and Xerox would beat the market, but they were obviously wrong. What makes you so sure that Square and Zillow will overperform the market over the next 20? If it were that obvious, everyone would do it. The fact is that you do not know, none of us do, but it may be a risk worth taking.\n\nJust be aware it is indeed a risk, a gamble even.",
        "created_utc": 1624147280,
        "id": "h2dk3ql",
        "permalink": "/r/investing/comments/o3qxb7/proscons_of_investing_in_individual_stocks_versus/h2dk3ql/",
        "score": 8,
        "subreddit": "investing",
        "created": 1624176080.0
    },
    {
        "author": "Several_Garage",
        "body": "what i see people say a lot when facing these type of situations is, if you were given 10k would you buy IBM stock with it? If not or you think there’s a better chance why not sell it and go with your first choice. Not sure how taxes work with it tho, so that’s prolly something to keep in mind tho lol",
        "created_utc": 1624497690,
        "id": "h2u3ih9",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u3ih9/",
        "score": 8,
        "subreddit": "investing",
        "created": 1624526490.0
    },
    {
        "author": "DLew13",
        "body": "GME is like the IBM of meme stocks now 😂 Holding it’s own even on down days.",
        "created_utc": 1622824308,
        "id": "h0l1igz",
        "permalink": "/r/wallstreetbets/comments/ns1gd8/daily_discussion_thread_for_june_04_2021/h0l1igz/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1622853108.0
    },
    {
        "author": "Adderalin",
        "body": "IBM is $144.61 per share, OP would have 69 shares at $10k. There'd be a bit of risk having to cover 31 shares if assigned on an OTM call.",
        "created_utc": 1624505683,
        "id": "h2uighs",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2uighs/",
        "score": 8,
        "subreddit": "investing",
        "created": 1624534483.0
    },
    {
        "author": "jruff84",
        "body": "They have several government contracts and are the official provider for Canada. They also recently partnered with IBM and are focusing a lot on digital platforms and cyber security.",
        "created_utc": 1623251853,
        "id": "h15ug0w",
        "permalink": "/r/wallstreetbets/comments/nvsynu/daily_popular_tickers_thread_for_june_09_2021/h15ug0w/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1623280653.0
    },
    {
        "author": "SilkyThighs",
        "body": "Anyone else keep money on stocks like IBM and Intel so they don’t yolo it on dumb shit ? 😂 I consider them my bank accounts with some potential",
        "created_utc": 1623296947,
        "id": "h18ofa4",
        "permalink": "/r/wallstreetbets/comments/nw4vdx/what_are_your_moves_tomorrow_june_10_2021/h18ofa4/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1623325747.0
    },
    {
        "author": "Left-Dragonfruit-922",
        "body": "There’s something called opportunity cost as well so he may have to pay let’s say that $1500 in taxes he could very well make it back and then some on a better stock. If I were given $10 in IBM, it’d be sold in a heartbeat, and invested into something else. Too many other sexy options out there other then an old boomer stock that doesn’t seem to be interested in newer technologies or reinventing their brand.",
        "created_utc": 1624499754,
        "id": "h2u7dzl",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u7dzl/",
        "score": 8,
        "subreddit": "investing",
        "created": 1624528554.0
    },
    {
        "author": "badgebruce",
        "body": "IBM To Establish New Cybersecurity Center For US Federal Clients\n\nhttps://www.marketwatch.com/story/ibm-to-create-cybersecurity-center-for-u-s-federal-clients-271622630199?mod=mw\\_quote\\_news",
        "created_utc": 1622665973,
        "id": "h0cw24g",
        "permalink": "/r/stocks/comments/nqhts8/rstocks_daily_discussion_wednesday_jun_02_2021/h0cw24g/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1622694773.0
    },
    {
        "author": "badgebruce",
        "body": "IBM and their partnership with PLTR looks promising.",
        "created_utc": 1624306406,
        "id": "h2kpwng",
        "permalink": "/r/stocks/comments/o51q6z/discussion_the_future_of_cyber_security/h2kpwng/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1624335206.0
    },
    {
        "author": "dafuq343",
        "body": "Problem with Intel is that whatever they do, the market doesn't like the stock. Sure, AMD and Nvidia are eating into their share but the whole industry is exponentially growing and Intel will continue to make more and more money. They just need to get their 7nm right and they are back on track especially with their manufacturing capacity which no other chip company has. Will I invest in this stock? No, because they have this image of being the next IBM and almost everyone believes that and for the stock price that's very detrimental.",
        "created_utc": 1624986286,
        "id": "h3gjggs",
        "permalink": "/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/h3gjggs/",
        "score": 7,
        "subreddit": "investing",
        "created": 1625015086.0
    },
    {
        "author": "deadjawa",
        "body": "Dividends aren’t absolutely useless, but they are the least efficient method of earnings payouts.  Capital investments, R&amp;D, and stock buybacks are all more efficient than dividends.  And the fact that the culture of dividends is such that they need to be increased every year and should not go down in bad times makes them extremely dangerous as well.\n\nSome dividend stocks can get away with this, like REITs, but companies like IBM and T are wrecked by their rich dividend payouts.\n\nBut on the other hand, reaching that elusive 20% yield on cost number is pretty fucking awesome.  LOL.  A bond can’t do that.",
        "created_utc": 1624971927,
        "id": "h3fo8nl",
        "permalink": "/r/stocks/comments/oa4sm2/when_investing_in_stocks_what_important_truth_do/h3fo8nl/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1625000727.0
    },
    {
        "author": "Rin-Tohsaka-is-hot",
        "body": "Yup, maybe if IBM had done that things would be different right about now",
        "created_utc": 1625010533,
        "id": "h3i1lrn",
        "permalink": "/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/h3i1lrn/",
        "score": 7,
        "subreddit": "investing",
        "created": 1625039333.0
    },
    {
        "author": "mannyman34",
        "body": "I don't think IBM in the 80's had the moat that Intel does today.",
        "created_utc": 1625029289,
        "id": "h3j0bft",
        "permalink": "/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/h3j0bft/",
        "score": 7,
        "subreddit": "investing",
        "created": 1625058089.0
    },
    {
        "author": "Say_no_to_doritos",
        "body": "I'm in for $20k on BlackBerry but I gotta say that there is no comparison between them and IBM.",
        "created_utc": 1623612618,
        "id": "h1nikgk",
        "permalink": "/r/wallstreetbets/comments/nyyq9f/blackberry_undervaluationleader_in_ev_iot_and/h1nikgk/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1623641418.0
    },
    {
        "author": "PDXGolem",
        "body": "Even metoos can fail for a long while.  Sometimes it takes two or three generations for a technology to pick up steam. \n\nThere was a massive push for AI in the 1980's/1990's starting with IBM and only in the past 10 years have AI-centric companies in general become profitable.   For decades they failed, over and over.",
        "created_utc": 1624869199,
        "id": "h3augr2",
        "permalink": "/r/stocks/comments/o9b9fe/panasonic_sold_all_its_tesla_shares_and/h3augr2/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1624897999.0
    },
    {
        "author": "Nierdris",
        "body": "IBM is the king of computer building. They could never fail.",
        "created_utc": 1623608732,
        "id": "h1nal0a",
        "permalink": "/r/wallstreetbets/comments/nyvjsm/voice_of_reason_take_profits/h1nal0a/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1623637532.0
    },
    {
        "author": "thCuba",
        "body": "IBM pay good dividend and is always researching.",
        "created_utc": 1624515225,
        "id": "h2uw5zz",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2uw5zz/",
        "score": 6,
        "subreddit": "investing",
        "created": 1624544025.0
    },
    {
        "author": "Dwigt_Schroot",
        "body": "It takes only one day (after years of stall) for market sentiment to change. Be it IBM, CISCO, AAPL, or any company you pick.",
        "created_utc": 1624993646,
        "id": "h3h0na5",
        "permalink": "/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/h3h0na5/",
        "score": 6,
        "subreddit": "investing",
        "created": 1625022446.0
    },
    {
        "author": "AlbireoWolfe",
        "body": "I've only got a few bucks in, so I'm just riding out the day.   \n\n\nGot 2 Shares of CLF waiting to see if Cleveland treats me good, UWMC, BB, CLN, and WISH all at a share a piece. I'm a Gibbon among Apes, smallest of the apes. Maybe at some point one will give me a good jump and I can afford something nice. Or just more stock for a better position. GME and IBM fractions are there, but, well, they're there.",
        "created_utc": 1623363492,
        "id": "h1c2dwk",
        "permalink": "/r/wallstreetbets/comments/nwwxw6/what_are_your_moves_tomorrow_june_11_2021/h1c2dwk/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1623392292.0
    },
    {
        "author": "bongoissomewhatnifty",
        "body": "This is kind of a nonsensical comment if you think about it. That’s the definition of speculative investing. Apple is the OG meme company. Or going back further, IBM. \n\nInvesting in companies based on what they might do is pretty much the definition of investing. There are absolutely other types, like bonds and dividend stocks, but describing all speculative investing as a meme kind of takes away any meaning, no?",
        "created_utc": 1624547387,
        "id": "h2w56zf",
        "permalink": "/r/stocks/comments/o71cj8/ford_f_has_239b_ttm_free_cash_flow_and_only_61b/h2w56zf/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1624576187.0
    },
    {
        "author": "ChirpMcBender",
        "body": "Why not split the difference and put 5k in voo and keep 5k of ibm",
        "created_utc": 1624495528,
        "id": "h2tzhmv",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2tzhmv/",
        "score": 6,
        "subreddit": "investing",
        "created": 1624524328.0
    },
    {
        "author": "meows_at_idiots",
        "body": "There are a lot of companies using gcp. All the cloud services are about the same any server admin could use and figure them all out in a few hours to a day based on docs. They only people who actually do the training are the consultants in my experience. We are currently switching from azure to ... IBM. I argued for gcp, but I'm pleasantly surprised with IBM actually.",
        "created_utc": 1623842166,
        "id": "h1yf4te",
        "permalink": "/r/investing/comments/o0tr34/google_quietly_killing_it_in_2021_ytd_performance/h1yf4te/",
        "score": 6,
        "subreddit": "investing",
        "created": 1623870966.0
    },
    {
        "author": "jwlazar",
        "body": "If they *can* spend on R&amp;D, why don’t they?  Why don’t they bury AMD into obscurity like Andy Grove almost did when the Athlon started cutting into Intel’s low-end market share?\n\nYou speak of R&amp;D like an on/off or dimmer switch.  AMD has had the switch in the “on” position for the past several years and now things will Improve for Intel because they suddenly decided R&amp;D is important again?  Is that a decision or company culture you believe will inspire investors?\n\nYour same argument was as valid for IBM or HP or Cisco, and yet these companies for their vast accumulation of cash reserves and ostensible engineering prowess struggle.  Why is that?  Does it really have anything to do with having cash on hand or market share?",
        "created_utc": 1625007709,
        "id": "h3hvwfn",
        "permalink": "/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/h3hvwfn/",
        "score": 6,
        "subreddit": "investing",
        "created": 1625036509.0
    },
    {
        "author": "Anderson82",
        "body": "I feel like now that Cambridge and Honeywell are creating a new pure Quantum company, I really hope this new entity enters the public market via a SPAC.  I know Honeywell, IBM, Google, Intel and others all have significant investment in Quantum, but if we get a few more of these pure play companies out of the private sector into the public the Quantum space race will actually begin.  I LOVE IonQ, but would love to spread my quantum risk with some shares of Rigetti, Dwave, etc.  I don't want any companies in my imaginary quantum index that can totally pivot if things get less trendy or new walls arise.",
        "created_utc": 1623343158,
        "id": "h1aqv93",
        "permalink": "/r/SPACs/comments/nwoknp/dmyi_ionq_adds_integration_with_google_cirq/h1aqv93/",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1623371958.0
    },
    {
        "author": "HoleyProfit",
        "body": "In 2007 BB only went up. [https://imgur.com/a/WMMqHLm](https://imgur.com/a/WMMqHLm)\n\nIBM used to be MSFT [https://imgur.com/a/yhUlY28](https://imgur.com/a/yhUlY28)\n\n&amp;#x200B;\n\nI'd suggest you research the previous industry leaders and their current stock prices before deciding things are safe. You won't find many stock that dropped over 60% that didn't look awesome at the high.",
        "created_utc": 1623621303,
        "id": "h1o07hq",
        "permalink": "/r/stocks/comments/nz5r2i/etn_question/h1o07hq/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1623650103.0
    },
    {
        "author": "greg_r_",
        "body": "With regard to IBM, you have the power of hindsight. Of course the strategies used by IBM in the 90s and 00s won't work anymore. Square isn't competing with 90s IBM. For Square to beat the market over the next 20 years, it must beat hundreds of well run companies. That is something that's virtually impossible to predict.",
        "created_utc": 1624149438,
        "id": "h2dnt9x",
        "permalink": "/r/investing/comments/o3qxb7/proscons_of_investing_in_individual_stocks_versus/h2dnt9x/",
        "score": 6,
        "subreddit": "investing",
        "created": 1624178238.0
    },
    {
        "author": "GoBucks4928",
        "body": "Sell it. Garbage dinosaur company. No tech talent goes to IBM, just the devs that couldn’t get in anywhere else",
        "created_utc": 1624499460,
        "id": "h2u6thj",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u6thj/",
        "score": 6,
        "subreddit": "investing",
        "created": 1624528260.0
    },
    {
        "author": "epacella13",
        "body": "Saw an IBM ad on youtube and that’s all the DD I need to yolo life savings into OTM IBM calls",
        "created_utc": 1622608901,
        "id": "h0a1vfk",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h0a1vfk/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1622637701.0
    },
    {
        "author": "h7hh77",
        "body": "I imagine IBM looking like that for some reason.",
        "created_utc": 1624448818,
        "id": "h2rammi",
        "permalink": "/r/wallstreetbets/comments/o61v91/buybacks_are_bad_unless_im_profiting_from_them/h2rammi/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1624477618.0
    },
    {
        "author": "matrixreloaded",
        "body": "So are you saying if OP’s gifter bought the IBM stock for 1k back in the 90s and it’s worth 10k now, he’s still taxed as capital gains on the 9k?",
        "created_utc": 1624516131,
        "id": "h2ux990",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2ux990/",
        "score": 5,
        "subreddit": "investing",
        "created": 1624544931.0
    },
    {
        "author": "PapayaOk8743",
        "body": "I just got back from 1961 and IBM introduced the first electric typewriter, do with this information what you will",
        "created_utc": 1624893340,
        "id": "h3bu0nd",
        "permalink": "/r/wallstreetbets/comments/o9h5w0/daily_discussion_thread_for_june_28_2021/h3bu0nd/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1624922140.0
    },
    {
        "author": "SouthernYoghurt9",
        "body": "God why is this worth 230? I work in cybersecurity, and quantum has literally 0 useful applications right now. Its 20 years away from having machines with enough q-bits to solve any real problems. \n\nI'm not an IBM shill, but at least they are making a little money",
        "created_utc": 1623177485,
        "id": "h125mxg",
        "permalink": "/r/stocks/comments/nv4lcg/honeywell_quantum_solutions_and_cambridge_quantum/h125mxg/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1623206285.0
    },
    {
        "author": "kosborne40",
        "body": "My whole family invests, but it's in safe stocks, ones that are pretty much leveled off and set. They don't take risks with it. I've only known a few people outside of my family who invested. I know my ex's brother lost his shirt in some kind of stock in the mid-2000s. Ended up losing his entire life savings. But then there was my great aunt who invested in Pepsi and IBM stock really early, and invested a LOT, and she ended up set for life down the road. So it really all depends on luck I guess. Trying to predict human behavior isn't easy, and most people are just scared I think. Bet your dad wishes he'd researched your suggestion a little more lol",
        "created_utc": 1624307772,
        "id": "h2kswkw",
        "permalink": "/r/stocks/comments/o4n02o/why_dont_high_schools_have_classes_on_stock_market/h2kswkw/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1624336572.0
    },
    {
        "author": "NorthPoleStocks",
        "body": "It's $10,000 worth of IBM, not 10,000 shares of IBM.",
        "created_utc": 1624509674,
        "id": "h2uopf6",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2uopf6/",
        "score": 5,
        "subreddit": "investing",
        "created": 1624538474.0
    },
    {
        "author": "BenjaminKorr",
        "body": "Not even sure why IBM is the whipping boy always compared against in these discussions. IBM stagnated sure, but they didn't fall apart or crash in value.\n\nWere there better places to put your money if you had a crystal ball or were actively researching companies? Of course. But I wouldn't look at shares of IBM held since the 70s/80s as a bad investment. GE seems to better fit that bill.",
        "created_utc": 1625074066,
        "id": "h3kzyby",
        "permalink": "/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/h3kzyby/",
        "score": 5,
        "subreddit": "investing",
        "created": 1625102866.0
    },
    {
        "author": "Barney_Bets",
        "body": "Yeah, that’s why ibm gave up and decided to partner with PLTR…",
        "created_utc": 1624237623,
        "id": "h2hlh9b",
        "permalink": "/r/stocks/comments/o4cqxv/what_are_some_of_the_best_stocks_to_invest_in_for/h2hlh9b/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1624266423.0
    },
    {
        "author": "mild_apprehension",
        "body": "Right, that’s my point. It seems weird to randomly give out &gt;$100k in IBM shares. Inheritance is more plausible.",
        "created_utc": 1624539581,
        "id": "h2vp9j7",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2vp9j7/",
        "score": 5,
        "subreddit": "investing",
        "created": 1624568381.0
    },
    {
        "author": "chris_cacl",
        "body": "Its not a bad company per se, but people looking for a value stock can just go into the open market and buy IBM or Chevron .\n\nI have the impression that most SPAC investors are looking for that company that can change the world and has a chance of making them rich or at least give them a decent return. Like what happened with CCIV, or KCAC (QS) etc.......\n\n Making 10-20% a year is awesome for Ackman as 20% of $10 billion is an awesome $2billion, but for regular Joe's 20% of $1000 is just a $hitty $200 :-(",
        "created_utc": 1622785257,
        "id": "h0j9upx",
        "permalink": "/r/SPACs/comments/nrqgbw/bill_ackmans_psth_rumored_to_take_universal_music/h0j9upx/",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1622814057.0
    },
    {
        "author": "demolition_elf",
        "body": "IBM, MSFT, VISA",
        "created_utc": 1623633656,
        "id": "h1om7at",
        "permalink": "/r/StockMarket/comments/nza8uq/small_daily_investments_5_to_10_to_invest_per_day/h1om7at/",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1623662456.0
    },
    {
        "author": "nomindbody",
        "body": "I wouldn't start with Palanir visualizes data since eit takes a lot of database work to make those visualizations meaningful. I'd say that Palantir is like the combinations of all these piecemeal software products (e.g., MSFT, AXY, IBM, etc.,) put I to a full architecture suite. To me it makes actual machine learning possible since that first starts with getting the right data structure. It's essentially consolidating the machine learning tool space into MSFT like product. \n\nI'd like to see it rise and get more clients and become a standard since it's a great idea.",
        "created_utc": 1623729838,
        "id": "h1t9fzy",
        "permalink": "/r/wallstreetbets/comments/o03gln/pltr_dd_calling_all_palantards_what_is_pltr_and/h1t9fzy/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623758638.0
    },
    {
        "author": "DLew13",
        "body": "IBM, the wave of the future",
        "created_utc": 1623882603,
        "id": "h20thb0",
        "permalink": "/r/wallstreetbets/comments/o1dy21/what_are_your_moves_tomorrow_june_17_2021/h20thb0/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623911403.0
    },
    {
        "author": "Ideaambiguousawhole",
        "body": "TGT: Consumer staples are among the most defensive stocks on the market, and that tends to hold true with their dividends. While Target's dividend is currently not very competitive, I believe overtime that it will become more dominant. Target provides basically the same service as Walmart, but attracts higher wage earners than Walmart, resulting in higher profit margins. Target is also ahead of the fight for 15, having already committed to raising employee wages to 15 dollars an hour across the board. This has not stopped Target from shattering it's earnings Estimates every quarter since the start of the pandemic. There's no reason not to think that Target won't grow it's dividend overtime as it matures.\n\nPFE: Pfizer has a dividend yield of 3.83% compared to its market median of 2.26%. The company has steady revenue for a while with the demand for covid vaccines still rampant abroad, and the eventual need for booster shots will give them additional revenue. In addition, the company is situated to handle it's short and long term debts. \n\nIBM: Controversial company due to the fact that it recently quietly laid off its older workforce, some would argue a necessary evil in a tech company that needed to adapt. Having said that, IBM is a rare tech stock with a high dividend yield. While many would prefer tech stocks reinvest their earnings, IBM is a mature company that likely would not fully benefit from future reinvestment at this point.  IBM currently has a dividend yield of 4.36. IMO this stock is worth holding long term for the Quantum Computing potential alone, as IBM is working on Quantum Computers that while not currently applicable, have applications that can potentially increase productivity tenfold in the future, and thus would be massively profitable. This is a long shot, as other companies are working on such computers, but still significant upside nonetheless. \n\nCNQ: Did a DD on this stock [https://www.reddit.com/r/stocks/comments/nx2scl/cnq\\_dd\\_analysis/](https://www.reddit.com/r/stocks/comments/nx2scl/cnq_dd_analysis/)\n\nAFL: Safety is an important component of dividend stocks, and Life/Health Insurance is one of the safest industries out there. There will always be a demand for insurance products, and stocks like Aflac that are underpriced can make for great conservative investments as well. With a 2.35% dividend yield in a defensive industry, this stock is a safe bet to raise its dividend in the future. It also currently trades at a PE ratio of 7.22, which is very reasonable this day and age and undervalued from its earnings. The stock has been earning at a PE ratio of about 10, suggesting the stock is undervalued by 40%",
        "created_utc": 1623429340,
        "id": "h1f4n76",
        "permalink": "/r/stocks/comments/nxjdqz/dividend_stocks_that_will_never_ever_crash/h1f4n76/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1623458140.0
    },
    {
        "author": "KidBackOnEscalator",
        "body": "Does he have to pay taxes on the ibm shares tho when he sells??? What is his tax burden",
        "created_utc": 1624501271,
        "id": "h2uabq1",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2uabq1/",
        "score": 4,
        "subreddit": "investing",
        "created": 1624530071.0
    },
    {
        "author": "atdharris",
        "body": "Intel has gone through periods where other manufacturers beat them in performance. I remember the days of the Pentium 3 and 4 that were far behind what IBM/Motorola were producing, but Intel eventually figured it out and made a comeback with the Core Duo. Unless they go the way of IBM, I think they will find their way, but I would not want to buy the stock at this time until a turnaround is more clear.",
        "created_utc": 1622582777,
        "id": "h08nbvy",
        "permalink": "/r/investing/comments/npytvv/why_intel_intc_is_undervalued/h08nbvy/",
        "score": 4,
        "subreddit": "investing",
        "created": 1622611577.0
    },
    {
        "author": "Inquisitor1",
        "body": "I remember tesla, ibm, apple, all them guys were massively (well relatively) on sale a while back that day when the entire market was bleeding.",
        "created_utc": 1622703224,
        "id": "h0eu64i",
        "permalink": "/r/stocks/comments/nr1dkn/beware_of_what_amc_shorts_are_holding/h0eu64i/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1622732024.0
    },
    {
        "author": "baycommuter",
        "body": "Did I say that? If you concentrate on an industry for a long time, you can become pretty savvy about it. No one who understood tech would have followed Buffett into IBM 20 years after it lost its leadership.",
        "created_utc": 1623644048,
        "id": "h1p396j",
        "permalink": "/r/investing/comments/nz9dxc/is_bogles_style_passive_investing_really_better/h1p396j/",
        "score": 4,
        "subreddit": "investing",
        "created": 1623672848.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM kissing 152 and entering a technical breakout after 8 years of downturn? Also funny to add that the last 2 times it hit these levels were pre-covid drop and pre-fall 2018 drop 👀 \n\nBig difference between those two ramp ups, however, and now. It’s definitely poised to move higher into Summer and it’s almost guaranteed to move up even higher after ER shows good growth from their M&amp;A spree the past year. Lots to like there.. getting money from chip bill, eventually getting some run up near Q4 for spinoff, etc..",
        "created_utc": 1623613176,
        "id": "h1njpez",
        "permalink": "/r/wallstreetbets/comments/nxosm3/weekend_discussion_thread_for_the_weekend_of_june/h1njpez/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623641976.0
    },
    {
        "author": "bigturbine",
        "body": "IBM's future depends on what Krishna  (or other future CEOs) does with IBM. It may be so damaged at this point that it will never recover. Rometty oversaw a lot of decline at IBM during her tenure. I am optimistic that Krishna will do better, but that could take years.\n\nI would personally move it all to an index fund.",
        "created_utc": 1624496077,
        "id": "h2u0j4k",
        "permalink": "/r/investing/comments/o6pifl/i_was_gifted_10000_dollars_of_ibm_stock/h2u0j4k/",
        "score": 4,
        "subreddit": "investing",
        "created": 1624524877.0
    },
    {
        "author": "juan62389",
        "body": "Raise your hands🙋‍♂️ if you have a brain and realize the future is A.I. This pandemic only dramatically increased the time frame from 5-10 yrs to now. IBM,INTC,AMD,NVDA these will stay afloat when a lot other will sink in a flash crash.🤓🦍",
        "created_utc": 1624902237,
        "id": "h3ce7lz",
        "permalink": "/r/wallstreetbets/comments/o9h5w0/daily_discussion_thread_for_june_28_2021/h3ce7lz/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1624931037.0
    },
    {
        "author": "ResponsibilityNo9566",
        "body": "$BB QNX in 23 of 25 EV makers, IVY partnership with AWS .. and now BB x IBM ?  this is a real company with great products and services that many companies depend and rely on on a daily basis.   \n\nTLDR:  Retards that cant read or count, HODL ! $BB to the Moon!",
        "created_utc": 1623421124,
        "id": "h1elyc5",
        "permalink": "/r/wallstreetbets/comments/nx038v/the_key_to_blackberry/h1elyc5/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623449924.0
    },
    {
        "author": "StraightShowStopper",
        "body": "So OP can just sell his put, cash in the profits, and be done with it. Thanks.\n\nAs far as I understand, trading options is not a big deal then. Writing options, on the other hand...\n\nThis is all new to me. I am a boomer stock investor (think VT, UL and IBM), and just got into gambling with the big meme one (just with shares, though, I don’t have the cojones for r/wallstreetbets shenanigans). Their sub is fun, though...",
        "created_utc": 1622668945,
        "id": "h0d31gu",
        "permalink": "/r/investing/comments/nqrjup/why_is_my_put_option_gaining_value_if_the_stock/h0d31gu/",
        "score": 4,
        "subreddit": "investing",
        "created": 1622697745.0
    },
    {
        "author": "JizzM4rkie",
        "body": "Oh thank God, I’ve been worried the past 3 hours and 7 minutes that my wife would notice that I borrowed some money out of her boyfriend’s wallet. How do you set the clock from EST to PDT on a 1995 IBM notebook??",
        "created_utc": 1622845522,
        "id": "h0mdwll",
        "permalink": "/r/wallstreetbets/comments/ns8b2w/me_coming_back_to_wsb_after_a_100_loss_and_a_90/h0mdwll/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1622874322.0
    },
    {
        "author": "Lingweenie2",
        "body": "Well, VIAC is my largest stock position by equity, so my thoughts won’t come as a surprise:\n\nI think the negativity is overblown. They do own some pretty good content. At the end of the day that’s what matters most. Anyone can get a streaming platform. (With enough money and work, naturally.) \n\nI originally bought into them right after Viacom and CBS remerged. Though, I had temptations in both singular companies at first. Just didn’t have enough ‘uhmf.’ \n\nThe fact they are together again peaked my interest the most. I think people underestimate them too much, mainly because you’re high off Disney and Netflix’s fumes. I think they’re a solid company that’s doubted too much. \n\nI held through the onslaught it had in 2020. Bought more shares in the process. Sold off half my stake when the rally blasted off unexpectedly. (A bit early but hey, $80-$95 was damn good tendies.) \n\nAfter the implosion, bought back my half back, plus some. I intend to hang on to them for quite a while. Definitely very bullish. \n\nI like IBM quite a bit too. Own them too. A larger position of mine. Similar to VIAC, not loved much and overlooked. I think with the increasing technology advancements they’ll get their fair share of the pie.",
        "created_utc": 1624924842,
        "id": "h3ds7mw",
        "permalink": "/r/wallstreetbets/comments/o9q22o/viac_and_the_parable_of_microsoft_ibm/h3ds7mw/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1624953642.0
    }
]