[
    {
        "author": "rusbus720",
        "body": "Quick Cathie, sell off all your liquid positions and buy 30% of the Trimble daily volume  again to stop the bleeding in 4 of your funds",
        "created_utc": 1617812978,
        "id": "gtpd8ni",
        "permalink": "/r/wallstreetbets/comments/mlyq20/daily_discussion_thread_for_april_07_2021/gtpd8ni/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617841778.0
    },
    {
        "author": "GardenCat1551",
        "body": "Any thoughts on PLUG?  There is some unusual call activity...\n\nAny comments on BBBY, NUAN, TRMB would be appreciated!  TY",
        "created_utc": 1619734625,
        "id": "gwcqhk3",
        "permalink": "/r/stocks/comments/n10pzm/rstocks_daily_discussion_options_trading_thursday/gwcqhk3/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619763425.0
    },
    {
        "author": "ZehPowah",
        "body": "My disappointment is immeasurable and my day is ruined. \n\nNo, idk, I'm bummed that my space spacs don't have options but I'm still planning on holding them for years. \n\nI definitely am not huge on some ARKX holdings, but they're starting to make more sense. The top 10 holdings aren't as stupid as some of the stuff - L3Harris, Iridium, LockMart, and Thales are actual space companies. Trimble and Kratos are also pretty close to spacey. Obviously I'd prefer that they buy VACQ, GNPK, SFTW, etc instead of e-copter scams, but whatever, at least those are a smaller part of the fund...",
        "created_utc": 1618890832,
        "id": "gv5yb05",
        "permalink": "/r/SPACs/comments/mtsmja/announcements_x_daily_discussion_for_apr192021/gv5yb05/",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1618919632.0
    },
    {
        "author": "willyumn",
        "body": "where can i get good research on trimble? im very interested in this company as i pass it almost every time i hop on the road.",
        "created_utc": 1617333154,
        "id": "gt3syvj",
        "permalink": "/r/stocks/comments/mi84qf/where_should_i_put_10k/gt3syvj/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617361954.0
    },
    {
        "author": "DiligentResident9208",
        "body": "Any inclusion of TRMB Trimble stock",
        "created_utc": 1617662710,
        "id": "gti8scr",
        "permalink": "/r/StockMarket/comments/mktwol/here_is_a_market_recap_for_today_monday_april_5/gti8scr/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617691510.0
    },
    {
        "author": "G_roundC_offee",
        "body": "I was originally looking at it for reopening and probably selling in the fall. But I literally just now writing this realized a better day to sell would be the morning after the Super Bowl. I’m not a financial advisor and have been trading more on trends. Like movie theaters, resorts, etc. will go up organically as people start to get out. Gas prices rise in the summer, construction companies not running TRMB equipment will NOT be able to compete in the industry much longer(I use it at work and am up 20% in a year), things like that. But if this thing squeezes I’m definitely selling on the backside of the peak.",
        "created_utc": 1617560770,
        "id": "gtdd5tp",
        "permalink": "/r/pennystocks/comments/mk1jfg/hofv_the_play_with_a_little_bit_of_everything/gtdd5tp/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1617589570.0
    },
    {
        "author": "Im_Drake",
        "body": "TRMB bullish af",
        "created_utc": 1617712802,
        "id": "gtka0k2",
        "permalink": "/r/wallstreetbets/comments/ml86d3/daily_discussion_thread_for_april_06_2021/gtka0k2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617741602.0
    },
    {
        "author": "0zOvOx0",
        "body": "Trimble looks interesting",
        "created_utc": 1617683498,
        "id": "gtjbgk1",
        "permalink": "/r/wallstreetbets/comments/mktg0s/what_are_your_moves_tomorrow_april_06_2021/gtjbgk1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617712298.0
    },
    {
        "author": "StonkDoctor1000",
        "body": "TRMB the TSLA of ARKX, hmmmmm.",
        "created_utc": 1617503630,
        "id": "gtb50n6",
        "permalink": "/r/wallstreetbets/comments/mi3t1v/weekend_discussion_thread_for_the_weekend_of/gtb50n6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617532430.0
    },
    {
        "author": "bagtf3",
        "body": "Etf trimble even do",
        "created_utc": 1617503692,
        "id": "gtb54d8",
        "permalink": "/r/wallstreetbets/comments/mi3t1v/weekend_discussion_thread_for_the_weekend_of/gtb54d8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617532492.0
    },
    {
        "author": "DiligentResident9208",
        "body": "Didn’t you yourself already say you held % of your portfolio in Trimble??\n\nhttps://www.trimble.com/Corporate/About_at_Glance.aspx\n\nhttps://www.trimble.com/home-2021-v1\n\nI earnestly consider you to put a majority of your money in Trimble, Tesla too was once at a glance an 80 range stock. The market is closed but perhaps on Monday early afternoon pick up shares in bulk you will not be dissatisfied nor disappointed I’m sure.",
        "created_utc": 1617336386,
        "id": "gt3xu67",
        "permalink": "/r/stocks/comments/mi84qf/where_should_i_put_10k/gt3xu67/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617365186.0
    },
    {
        "author": "DiligentResident9208",
        "body": "Has the Trimble hype ran its course and maxed out? This has high potential to reach 100 dollar range",
        "created_utc": 1617365109,
        "id": "gt4swah",
        "permalink": "/r/stocks/comments/mi84qf/where_should_i_put_10k/gt4swah/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617393909.0
    },
    {
        "author": "oneuponwallstreetz",
        "body": "So I work for McLane Foodservice here in Houston, Tx and we were suppose to pick up Jack in the Box this summer. Due to us closing a deal with Whataburger, those JIB plans have been scrapped temporarily. What we were planning to do was send a empty trailer from Houston to Dallas and have a full load of JIB shuttled back to be distributed around the Houston area. We have done this in the past with companies such as Arby's and Panda Express. Multiple trailers go up empty while swapping trailers and coming back with 40k lbs of food product to be delivered. \n\n&amp;#x200B;\n\nOk, so now that I got that out of the way. McLane Foodservice is one of Berkishire Hathaways holdings. Been around since the year 1906, family owned until Sam Walton bought it and the old owner bought the Astros. (not important) Sam Walton eventually sold after Pepsi, AmeriServ, PFS, and Finally Berkshire. (might not be 100% accurate on timeline of ownership)\n\nRecently, McLane invested in Orange EV yard trucks (bobtails that move trailers around the parking lot and docked into building doors to be loaded) at some of their locations. As of January/February I was having a discussion with our director of operations and he said that we would not be hiring any extra drivers when we take on JIB this summer and trailers would be shuttled using the driverless technology in these trucks by AEVA. \n\nNow, it was cool to hear that but at the same time it was hard to believe that we would be incorporating a technology that hasn't even been figured out in mainstream automobiles to be 100% safe and we are expecting this company to have figured it out in Semi-Trucks. The technology would drive the truck from the Distribution Center in Dallas to the Distribution Center in Houston all the way to the entrance gate before a driver on location takes over. \n\nSince we have scrapped the JIB plans for now, I don't know much more about what is happening with this technology but it all started from what is going on with our DC is Arizona. I was told they are or have been using this in Phoenix with this driverless technology. I could attempt to find out more information but the company right now is not worth much. I think that once phones are mandatory, and everyone has internet as well as road ratings (driverless % ratings of auto-piolet disablement) with quick updates to construction through city contracts and policys, this will still not be 100%. Highway use may be a different story but like what just happened not to far from where I live in The Woodlands, Texas, that Tesla Car Crash is a concern because the technology didn't respond. \n\n&amp;#x200B;\n\nPublic (Stock) Companies we also use daily are Trimble, VMWare, Zebra, Volvo Trucks, Freightliner trucks. We service Yum Foods (Taco Bell, KFC, Pizza Hut), Chilies, Applebee's, IHOP, Whataburger, Buffalo Wild Wings, Chick Fil-A, Golden Coral, and others. Our grocery division has contracts with Walgreens as well. We are nation wide and that's what landed us the distribution contract with Whataburger. We make 65-100k+ a year and we are always hiring. 4 day work weeks but you can work more if you want more $. If you or anyone you know that has a CDL, is mentally tough, and has a good attitude but kinda edgy, please make them aware as job openings are ramping up and we want to help employ people that want to work at McLane. \n\nSummary; I gave you the inside scoop on our companies use of OP mentioned company and an potential job opportunity for you or someone you know",
        "created_utc": 1618823316,
        "id": "gv290nk",
        "permalink": "/r/wallstreetbets/comments/mtmvnz/tsp_tusimple_autonomous_truck_tech_that_ipod_this/gv290nk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618852116.0
    },
    {
        "author": "DiligentResident9208",
        "body": "If I had that kind of cash I wouldn’t flinch. Many may say to Van guard or SPACs or things of this type. This too can garner growth for your portfolio but I see strong upside in Trimble it’s consistently being batted about and spoken poorly of by various stock websites but Cathie Wood held these convictions for Tesla when these pundits were saying sell Tesla it’s going down etc. The Jim Cramers of the world always seem to get it wrong trust Ms. Wood she has the same convictions she holds for her beloved Tesla. This TRIMBLE can have that growth capacity easily.",
        "created_utc": 1617337027,
        "id": "gt3yriu",
        "permalink": "/r/stocks/comments/mi84qf/where_should_i_put_10k/gt3yriu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617365827.0
    },
    {
        "author": "Im_Drake",
        "body": "Thoughts on TRMB calls? Seems ridiculously bullish...",
        "created_utc": 1617505681,
        "id": "gtb8cat",
        "permalink": "/r/wallstreetbets/comments/mi3t1v/weekend_discussion_thread_for_the_weekend_of/gtb8cat/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617534481.0
    },
    {
        "author": "willyumn",
        "body": "ill invest in their largest position trimble. but not arkx",
        "created_utc": 1617504193,
        "id": "gtb5xf9",
        "permalink": "/r/stocks/comments/mjn2va/help_me_create_a_portfolio_with_10k_sexy_or_hot/gtb5xf9/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617532993.0
    },
    {
        "author": "Im_Drake",
        "body": "Gonna be watching TRMB and SGLB, as they have piqued my interest. Also frequently checking RKT, GME, and PLTR waiting for a rip.",
        "created_utc": 1617847639,
        "id": "gtrg57w",
        "permalink": "/r/wallstreetbets/comments/mmakl8/what_are_your_moves_tomorrow_april_08_2021/gtrg57w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617876439.0
    },
    {
        "author": "DontWantUrSoch",
        "body": "Not buying, but holding. Tesla, Arrival, Trimble, &amp; Matterport\n\nSide note: I would jump all over Cannondale if they went public, cycling might be the future",
        "created_utc": 1617979987,
        "id": "gtxq96o",
        "permalink": "/r/stocks/comments/mnikpr/so_biden_is_pouring_621_billion_into/gtxq96o/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618008787.0
    },
    {
        "author": "the_GuelahPapyrus",
        "body": "Oracle, Walgreens, Trimble, Ebang ⬆️\n\nHarley Davidson, Marathon Digital, AMC ⬇️\n\nGME ➡️",
        "created_utc": 1617683328,
        "id": "gtjb7l9",
        "permalink": "/r/wallstreetbets/comments/mktg0s/what_are_your_moves_tomorrow_april_06_2021/gtjb7l9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617712128.0
    },
    {
        "author": "mrfinnlee",
        "body": "I guess Cathie is done buying TRMB....",
        "created_utc": 1617725163,
        "id": "gtl04rp",
        "permalink": "/r/wallstreetbets/comments/ml86d3/daily_discussion_thread_for_april_06_2021/gtl04rp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617753963.0
    },
    {
        "author": "DiligentResident9208",
        "body": "TRIMBLE \nHas tremendous upside could be the equivalent of “getting in on” Tesla when it was at its earlier development in the double digits and not triple it is today. It’s an infrastructure play very strong within the US developing needs. It’s a strong stock and knowing that Ark has it invested in the same vein as their fanboy love of Tesla it could really be injected and have tremendous numbers and value growth by next year. Yes there are haters yes there are naysayers and people parading around screaming all the negative hysteria’s in the world. But in my eyes this stock has very very good numbers come May. Injecting 10k on TRIMBLE now, holding for a year?? Forget about it your gonna be mega rich in the Tesla numbers only you’d have been lucky to buy Tesla before it was over 80$ Tesla is now pushing 650-700 range nowadays",
        "created_utc": 1617331812,
        "id": "gt3qskg",
        "permalink": "/r/stocks/comments/mi84qf/where_should_i_put_10k/gt3qskg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617360612.0
    },
    {
        "author": "Moe_Greene_",
        "body": "bae Cathie Wood bought a shit ton of $TRMB today. Looking very bullish.",
        "created_utc": 1617752309,
        "id": "gtmo4y4",
        "permalink": "/r/wallstreetbets/comments/mlkbp6/what_are_your_moves_tomorrow_april_07_2021/gtmo4y4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617781109.0
    },
    {
        "author": "Head_Paleontologist",
        "body": "AWK 4/16 155c\n\nTRMB 4/16 90c",
        "created_utc": 1617777084,
        "id": "gtntcii",
        "permalink": "/r/wallstreetbets/comments/mlkbp6/what_are_your_moves_tomorrow_april_07_2021/gtntcii/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617805884.0
    },
    {
        "author": "always_plan_in_advan",
        "body": "Infrastructure software companies, Autodesk, Trimble, Bentley systems",
        "created_utc": 1617988664,
        "id": "gtya4yk",
        "permalink": "/r/stocks/comments/mnikpr/so_biden_is_pouring_621_billion_into/gtya4yk/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618017464.0
    },
    {
        "author": "mrfinnlee",
        "body": "My TRMB calls are printing",
        "created_utc": 1617632363,
        "id": "gtgfbac",
        "permalink": "/r/wallstreetbets/comments/mkh463/daily_discussion_thread_for_april_05_2021/gtgfbac/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617661163.0
    },
    {
        "author": "bkbrown30",
        "body": "Trimble calls here, Trimble calls. get em while they’re hot.",
        "created_utc": 1617633416,
        "id": "gtghf3p",
        "permalink": "/r/wallstreetbets/comments/mkh463/daily_discussion_thread_for_april_05_2021/gtghf3p/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617662216.0
    },
    {
        "author": "whoseyourdatadaddy",
        "body": "Okay why is no one talking about or doing DD on \n\n$TRMB ?\n\nI mean it’s astonishing wsb hasn’t blown this up . I mean I would but to lazy to start it .\nSo I vent here hahah",
        "created_utc": 1617490808,
        "id": "gtajram",
        "permalink": "/r/wallstreetbets/comments/mi3t1v/weekend_discussion_thread_for_the_weekend_of/gtajram/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617519608.0
    },
    {
        "author": "StonkDoctor1000",
        "body": "Trimble Inc provides location-based solutions that are used in global positioning system (GPS), laser, optical and inertial technologies. Its products portfolio includes 3D laser scanning, flow and application control systems, monitoring systems, water management, and navigation infrastructure. It also manufactures laser and optics-based products, and GPS products. The company serves various industries which include agriculture, architecture, civil engineering, survey and land administration, construction, geospatial among others. The company operates in four reportable segments namely, Buildings and Infrastructure, Geospatial, Resources and Utilities, and Transportation. It derives most of its revenues from the US and Europe with the rest coming from the Asia Pacific and other markets.",
        "created_utc": 1617503849,
        "id": "gtb5dij",
        "permalink": "/r/wallstreetbets/comments/mi3t1v/weekend_discussion_thread_for_the_weekend_of/gtb5dij/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617532649.0
    },
    {
        "author": "Kingshirez",
        "body": "Trimble is in ARK and in the lumber game",
        "created_utc": 1617929188,
        "id": "gtvltdt",
        "permalink": "/r/stocks/comments/mmsnc1/lumber_dd_cnbc_and_motley_fools_best_lumber/gtvltdt/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1617957988.0
    },
    {
        "author": "Science_Squid6629",
        "body": "I’ve listened to Motley Fool on two occasions: last year when they said to buy AZN over MRNA, and in 2019 when they said to buy XLNX. Needless to say, I don’t listen to them anymore",
        "created_utc": 1617811979,
        "id": "gtpavtx",
        "permalink": "/r/wallstreetbets/comments/mlyq20/daily_discussion_thread_for_april_07_2021/gtpavtx/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1617840779.0
    },
    {
        "author": "foxhalo",
        "body": "Peak autism, I forgot the AMD Xilinx merger vote was today.",
        "created_utc": 1617819229,
        "id": "gtprtz8",
        "permalink": "/r/wallstreetbets/comments/mlyq20/daily_discussion_thread_for_april_07_2021/gtprtz8/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1617848029.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "Over/under-valued is supposed to be fundamental. You should keep that separate from your opinion on it.\n\nYou should be psychologically and emotionally able to say, \"I recognize that the stock is currently over-valued, but I think it has a better future than the professionals realize, so I still like it at this price.\"\n\nWhen you're completely honest about your evaluation, you end up with better information about what your opinion actually is. In this case, do you actually have better information about Apple's future than everybody else? Is there some popular idea about Apple that pulls the stock price down, that you think is incorrect? Are they planning to move into some new area of business that you understand, and most people don't realize is important?\n\nFor example, AMD. My day job is firmware engineer. AMD put out a press release earlier this year about two new patents. All the analysis I read, both in the stock market, and on the engineering websites, presumed these are two different, unrelated things, that they just coincidentally talked about on the same day. I disagree; I think they're part of one new future product, that is also related to their Xilinx acquisition, and will bring real advantages to their server products. Right now their server market share is only 10%; the forecasts are that they will increase this to 20% in about 18 months. If they come out with a new product that enhances their competitive position in this area right when they're also already expanding their market share, that could be a huge driver for them and for the stock. So I think the stock is really worth at least 15% more than it can be objectively valued at now. But that doesn't mean it is undervalued now; just that I have a higher price target!\n\nAnother example is if a hedge fund releases research report that bad-mouths a company, and the stock goes down, and you read the report (most people don't even read it, they just sell!) and you think the report doesn't actually accuse them of anything. So then you might reasonably have a different evaluation than others.\n\nAs with all other parts of trading and investing, psychology is the most critical aspect of success. Don't be credulous of your own opinions; and treat your emotions with skepticism. When you love a stock, be nervous about your evaluation. You want to trade on what you rationally think will go up, not what you love.👼",
        "created_utc": 1617825665,
        "id": "gtq6x70",
        "permalink": "/r/StockMarket/comments/mma3q7/undervalued_and_overvalued_stocks/gtq6x70/",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1617854465.0
    },
    {
        "author": "throwawayaccountdown",
        "body": "The chart of AMD and Xilinx look exactly the same. Market manipulation!",
        "created_utc": 1617818797,
        "id": "gtpqthz",
        "permalink": "/r/wallstreetbets/comments/mlyq20/daily_discussion_thread_for_april_07_2021/gtpqthz/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617847597.0
    },
    {
        "author": "Odd_Illustrator_2480",
        "body": "Good time to get on amd? amd shareholder vote to merge with xlnx tomorrow",
        "created_utc": 1617744955,
        "id": "gtm9czf",
        "permalink": "/r/wallstreetbets/comments/mlkbp6/what_are_your_moves_tomorrow_april_07_2021/gtm9czf/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617773755.0
    },
    {
        "author": "MrTinkle5",
        "body": "They might buy Xilinx this week from what I’ve heard (well some vote to see if they want to).... no DD tho as I’m not invested into them. Wish I did when you did tho! Congratz",
        "created_utc": 1617910636,
        "id": "gtuicgg",
        "permalink": "/r/wallstreetbets/comments/mmzi3p/hit_the_20k_profit_mile_marker_for_these_amd/gtuicgg/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617939436.0
    },
    {
        "author": "Tradingisforloser5",
        "body": "Who’s got their amd xilinx plays ready for Wednesday",
        "created_utc": 1617649421,
        "id": "gthgjji",
        "permalink": "/r/wallstreetbets/comments/mkh463/daily_discussion_thread_for_april_05_2021/gthgjji/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617678221.0
    },
    {
        "author": "nahog99",
        "body": "Definite long play. Intel is literally, and I’m not exaggerating, years behind. They just put out their flagship desktop processor which is WORSE Than the one they put out last year, and far worse than ryzen. They also put out their brand new server processor which can’t compete with AMDs current OR last gen of processor. AMD is set up to dominate until at least 2023 and I haven’t even begun to discuss how much more money they can make with Xilinx who is a more profitable company than AMD that they bought for like 40 billion dollars.",
        "created_utc": 1617895124,
        "id": "gtthx3y",
        "permalink": "/r/wallstreetbets/comments/mmog6c/daily_discussion_thread_for_april_08_2021/gtthx3y/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617923924.0
    },
    {
        "author": "rocketkid20",
        "body": "[https://finance.yahoo.com/news/amd-xilinx-special-meetings-stockholders-211500266.html](https://finance.yahoo.com/news/amd-xilinx-special-meetings-stockholders-211500266.html)",
        "created_utc": 1617669379,
        "id": "gtilugm",
        "permalink": "/r/wallstreetbets/comments/mkxprj/xlnx_arbitrage_merger_with_amd_on_april_7th/gtilugm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617698179.0
    },
    {
        "author": "CormacWasTaken",
        "body": "Payday for me so that means more AMD and Xilinx - can't wait!",
        "created_utc": 1618525018,
        "id": "gunoimv",
        "permalink": "/r/wallstreetbets/comments/mrms60/what_are_your_moves_tomorrow_april_16_2021/gunoimv/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618553818.0
    },
    {
        "author": "I_am_just_saying",
        "body": "April 7th approval is basically assumed... positive price action from April 7th is minimal to zero \n\nOn the extremely small chance that the merger is declined the negative price action on XLNX would be extreme. \n\nThere is no real arbitrage opportunity, they will slowly start to trade more in line with eachother as a merger date gets closer and risk of no merger decreases... AMD can move down, XLNX can move up to achieve the \"correct\" price ratios. People can look at the APHA/TLRY merger if they want a current example of two companies doing the same thing right now. \n\nThere is limited to zero upside, the eventual merger is already assumed and mostly priced in, in the unlikely event of a rejection the downside would be massive and instantly make your XLNX calls worthless. April 7th date is irrelevant to your short term weeklies, you will lose a ton of theta and might even lose some to IV decrease after the approval.",
        "created_utc": 1617669788,
        "id": "gtimndf",
        "permalink": "/r/wallstreetbets/comments/mkxprj/xlnx_arbitrage_merger_with_amd_on_april_7th/gtimndf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617698588.0
    },
    {
        "author": "idgafau5",
        "body": "Shareholders approved AMD's acquisition of Xilinx",
        "created_utc": 1617844835,
        "id": "gtraliw",
        "permalink": "/r/wallstreetbets/comments/mm8wq8/here_is_another_small_update_on_my_long_amd_calls/gtraliw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617873635.0
    },
    {
        "author": "udgnim2",
        "body": "if you think AMD is a buy, then consider buying XLNX\n\nassuming the merger goes through (which I think it will), then divide XLNX share price by 1.734 to get the AMD share price",
        "created_utc": 1617503816,
        "id": "gtb5bks",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtb5bks/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617532616.0
    },
    {
        "author": "DQBIII",
        "body": "AMD - XLNX merger to be officially voted through by shareholders today. All in. \n\nQQQ, LULU and AAPL as well.",
        "created_utc": 1617794954,
        "id": "gtocvqm",
        "permalink": "/r/wallstreetbets/comments/mlyq20/daily_discussion_thread_for_april_07_2021/gtocvqm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617823754.0
    },
    {
        "author": "Tradingisforloser5",
        "body": "With Xilinx, 35bn deal",
        "created_utc": 1617804238,
        "id": "gtotk56",
        "permalink": "/r/wallstreetbets/comments/mlyq20/daily_discussion_thread_for_april_07_2021/gtotk56/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617833038.0
    },
    {
        "author": "RPMayhem",
        "body": "we're moonshooting thru 100 to 120+ after the xilinx merger confirms",
        "created_utc": 1617820312,
        "id": "gtpudka",
        "permalink": "/r/wallstreetbets/comments/mlyq20/daily_discussion_thread_for_april_07_2021/gtpudka/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617849112.0
    },
    {
        "author": "EmpZurg_",
        "body": "Can engine explain to an ape what happens to options during this type of merger?    To the 12x. XLNX calls get converted to 12x AMD ?   I'm so smooth brained.",
        "created_utc": 1617669234,
        "id": "gtiljey",
        "permalink": "/r/wallstreetbets/comments/mkxprj/xlnx_arbitrage_merger_with_amd_on_april_7th/gtiljey/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617698034.0
    },
    {
        "author": "FreeChickenDinner",
        "body": "Is that after the XLNX merger and share dilution?",
        "created_utc": 1617713300,
        "id": "gtkaw66",
        "permalink": "/r/wallstreetbets/comments/mkljmv/amd_increasing_production_by_20_in_q2_buy_before/gtkaw66/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617742100.0
    },
    {
        "author": "floodmayhem",
        "body": "I immediately fell into the habit of looking at AMD everyday back when it was announced Dr. Lisa Su was taking charge. It became almost ritual to hop on the computer every day to deep dive into the Semiconductor Industry and comb through news, data, and rumors. All my gaming buddies thought I was insane, touting within 5-10 years AMD would be the lead fabless chip designer in the industry. I bought $300 worth of stock through $5-17  and held onto it.\n\nI was extremely fucking bullish then, and have only remained as such now. \n\nThey execute their roadmaps flawlessly, maintain product portfolio diversity and scalability, company and team structure is rock solid and lead by experts in underlying fields, they possess numerous probable untapped markets through their full-stock acquisition of Xilinx and tech, maintain monster momentum in revenue and market share gains through industry-shaking partnership deals, have successful leapfrogging RnD teams for unmatched product performance gains annually, partner with fabrication leader TSMC for astounding chip yields and performance for most of its portfolio, etc......\n\nThey've only just begun imo.",
        "created_utc": 1617543415,
        "id": "gtcgmti",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtcgmti/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617572215.0
    },
    {
        "author": "JinnPhD",
        "body": "lam/xilinx doing too well but have fun. probs buying longer dated AMD calls",
        "created_utc": 1617553039,
        "id": "gtcy0hm",
        "permalink": "/r/wallstreetbets/comments/mi3t1v/weekend_discussion_thread_for_the_weekend_of/gtcy0hm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617581839.0
    },
    {
        "author": "SUPER_swan",
        "body": "Buy Xilinx then to get AMD at a discount?",
        "created_utc": 1617553353,
        "id": "gtcyn48",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtcyn48/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617582153.0
    },
    {
        "author": "pilotplater",
        "body": "Special meeting just finished, still pending regulatory approval.\n\nI don't know what I'm talking about, but I'm thinking given Xilinx does a lot of custom silicon manufacturing, and there's a wafer shortage right now, I'm betting will help top up AMD's manufacturing capacity with efficiency boosts for both product lines.\n\n[Linus talks about silicon shortage](https://youtu.be/3A4yk-P5ukY)",
        "created_utc": 1617815585,
        "id": "gtpjcc0",
        "permalink": "/r/wallstreetbets/comments/mm6vha/amd_and_xilinx_stockholders_overwhelmingly/gtpjcc0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617844385.0
    },
    {
        "author": "kb466",
        "body": "XLNX. It's free money unless you think the merger with AMD doesnt go through. You can essentially buy AMD shares at $75 right now",
        "created_utc": 1617880899,
        "id": "gtsprjq",
        "permalink": "/r/wallstreetbets/comments/mmog6c/daily_discussion_thread_for_april_08_2021/gtsprjq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617909699.0
    },
    {
        "author": "dansmith32",
        "body": "Prolly long term play since they have xilinx now, might go down short term due to xilinx merger and profit taking",
        "created_utc": 1618414219,
        "id": "guhwv6y",
        "permalink": "/r/wallstreetbets/comments/mqndra/daily_discussion_thread_for_april_14_2021/guhwv6y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618443019.0
    },
    {
        "author": "Runningflame570",
        "body": "Tomorrow is the deadline for the AMD/XLNX merger votes so don't be surprised if things get very frothy then.",
        "created_utc": 1617716625,
        "id": "gtkhani",
        "permalink": "/r/stocks/comments/ml7rbq/rstocks_daily_discussion_technicals_tuesday_apr/gtkhani/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617745425.0
    },
    {
        "author": "GearheadGaming",
        "body": "Don't feel like you missed out, I saw some discounted lotto tickets, so I made a post to the sub that likes buying lotto tickets.  But at the end of the day they're still just lotto tickets and there's a lot of risk here-- what if the valuation gap persists after the vote, what if the vote is no, what if AMD falls for an unrelated reason, etc\n\nXLNX is still a good stock to buy and hold if you like AMD, just like WORK is a good stock to buy and hold if you like Salesforce (same situation).  If you're really into these sort of valuation gap plays though, here's another pick you might be interested in, Naspers.  There's a huge valuation gap between them and the company they own a huge chunk in, Tencent.",
        "created_utc": 1617717371,
        "id": "gtkiu4s",
        "permalink": "/r/wallstreetbets/comments/mkxprj/xlnx_arbitrage_merger_with_amd_on_april_7th/gtkiu4s/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617746171.0
    },
    {
        "author": "hugh_g_reckshon",
        "body": "Just dump it all into xlnx",
        "created_utc": 1617728243,
        "id": "gtl7996",
        "permalink": "/r/stocks/comments/ml6tye/50_tickers_in_the_sp_500_are_at_least_15_below/gtl7996/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617757043.0
    },
    {
        "author": "dansmith32",
        "body": "With the dilution of AMD stock and Xilinx holders who will be taking profits, theres a good chance it wont go up short term IMO",
        "created_utc": 1617672081,
        "id": "gtir4qn",
        "permalink": "/r/wallstreetbets/comments/mkxprj/xlnx_arbitrage_merger_with_amd_on_april_7th/gtir4qn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617700881.0
    },
    {
        "author": "PowerOfTenTigers",
        "body": "would it be better to just buy XLNX at this point? based on current prices and assuming the merger goes through, you get more value buying XLNX and waiting for it to convert to AMD",
        "created_utc": 1617673450,
        "id": "gtitsnj",
        "permalink": "/r/wallstreetbets/comments/mkljmv/amd_increasing_production_by_20_in_q2_buy_before/gtitsnj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617702250.0
    },
    {
        "author": "Unplugthecar",
        "body": "What do make of AMD’s acquisition of Xilinx FPGAs?",
        "created_utc": 1617511589,
        "id": "gtbgy8j",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtbgy8j/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617540389.0
    },
    {
        "author": "achillesc",
        "body": "Although it’s not an earnings call, AMD has a shareholder meeting on Tuesday morning about the merger with Xilinx. Worth noting.",
        "created_utc": 1617495369,
        "id": "gtarf2q",
        "permalink": "/r/options/comments/mj7s1w/most_anticipated_earnings_releases_for_the_week/gtarf2q/",
        "score": 1,
        "subreddit": "options",
        "created": 1617524169.0
    },
    {
        "author": "tajmehalia",
        "body": "It will keep AMD competitive against an ever changing competitive market and physical limitations of CPUs alone. By merging with Xilinx, they’ll also increase their addressable TAM. It’s a win-win.",
        "created_utc": 1617520468,
        "id": "gtbr3st",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtbr3st/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617549268.0
    },
    {
        "author": "warrene00",
        "body": "In his defense, I believe he means he has 100 shares of AMD, and its a typo.\n\nHowever, im not sure how he can say “no recent history of triple digits” when it literally hit 99, and was trading in the 90s throughout January.\n\nAMD is gonna hit triples multiple times this year and that is no stretch.  Personally, I think it clears 100 after earnings, AND prob does when XLNX merger is official (since that helps em with the server market share).",
        "created_utc": 1617522267,
        "id": "gtbsxoo",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtbsxoo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617551067.0
    },
    {
        "author": "SpaceCatVII",
        "body": "My XLNX need this",
        "created_utc": 1617626490,
        "id": "gtg4lg7",
        "permalink": "/r/wallstreetbets/comments/mkh463/daily_discussion_thread_for_april_05_2021/gtg4lg7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617655290.0
    },
    {
        "author": "mustkillfriends",
        "body": "XLNX closed at 129.85 so 129.85÷1.734 = 74.88 and AMD closed at 80.74, which leaves a gap of ~$5.\n\nDoes this mean it makes more sense to buy XLNX calls then AMD?",
        "created_utc": 1617524387,
        "id": "gtbv11w",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtbv11w/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617553187.0
    },
    {
        "author": "CampinSinceNam",
        "body": "3D stacking is probably one of the biggest reasons AMD is buying Xilinx. They’ve been doing it for years!",
        "created_utc": 1617429470,
        "id": "gt7ygqa",
        "permalink": "/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/gt7ygqa/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617458270.0
    },
    {
        "author": "Bbear11",
        "body": "AMD is tie up with XLNX acquisition at the moment.  Stocks usually trade sideways until event is completed.",
        "created_utc": 1618472434,
        "id": "gukz0oz",
        "permalink": "/r/wallstreetbets/comments/mr03qi/80k_amd_yolo_day_1_babydick_gains/gukz0oz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618501234.0
    },
    {
        "author": "pridez818",
        "body": "I’m shooting for $125 by quarter 3. Probably the most impressive balance sheet and management team on the entire NYSE. They are going to take over so much market share from competitors very soon; especially with the mew Xilinx acquisition. It’s game over there’s a new champ now!",
        "created_utc": 1617318208,
        "id": "gt32yny",
        "permalink": "/r/wallstreetbets/comments/mi70a5/heres_a_small_update_on_my_long_amd_calls_i/gt32yny/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617347008.0
    },
    {
        "author": "SpaceCatVII",
        "body": "My XLNX deserved better, AMD is a bad influence.",
        "created_utc": 1618478375,
        "id": "gul4u9t",
        "permalink": "/r/wallstreetbets/comments/mqyoy9/what_are_your_moves_tomorrow_april_15_2021/gul4u9t/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618507175.0
    },
    {
        "author": "duanebarry69",
        "body": "Down 3-4% on a stock like AMD, in these interesting times, I would wait for 5% before buying the dip. But I would honestly wait for the AMD and Xilinx merger to go through at this point. I used to own it personally but sold because I have less faith in their future growth and TAM now. I prefer supports and fabs in the semi space and they are better valued and safer should the economy take a downturn or inflation go higher. But it’s a great company, great CEO I like it more than Nvidia.",
        "created_utc": 1618481282,
        "id": "gul7qmp",
        "permalink": "/r/stocks/comments/mr8ze9/question_about_averaging_down/gul7qmp/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618510082.0
    },
    {
        "author": "RajivChaudrii",
        "body": "Xilinx, which is being acquired by AMD.  Plus Lisa Su has said several times she’s open to ARM CPUs.",
        "created_utc": 1617293566,
        "id": "gt1mf44",
        "permalink": "/r/stocks/comments/mhxp3g/best_arm_companies_to_buy_how_to_buy_arm_holdings/gt1mf44/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617322366.0
    },
    {
        "author": "myironlung6",
        "body": "Xilinx merger will keep this under $90 for the foreseeable future. Look into the share ratio Xilinx shareholders will receive. AMD is buying them for $30 billion in stock which killed all the momentum this thing had",
        "created_utc": 1617506570,
        "id": "gtb9sk5",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtb9sk5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617535370.0
    },
    {
        "author": "oxedei",
        "body": "Seriously... How are literally no one mentioning Xilinx at the top posts? Surely the value of the stock and future will be impacted hugely by the acquisition of Xilinx.",
        "created_utc": 1617534673,
        "id": "gtc56zy",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtc56zy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617563473.0
    },
    {
        "author": "Mad691",
        "body": "Beyond PCs, their acquisition of Xilinx (which will get approved) gets them into the automotive, autonomous market. In this space Qualcomm, Intel (MobilEye) and Tesla have a chip making head start, but AMD seems smart enough to catch-up.\nAMD is a LONG-TERM hold, but short term it there are better opportunities and I have doubts that the Arm acquisition will go smoothly.",
        "created_utc": 1617538834,
        "id": "gtca20z",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtca20z/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617567634.0
    },
    {
        "author": "Brawndo_or_Water",
        "body": "Yes but what does it mean to you? the comnment you replied to bitches lack of DD but doesn't provide anything useful. I've been holding 1,000 shares of AMD for well over a year now and it's in my long investments. I didn't flinch when they bought Xilinx. So maybe you want to discuss about xilinx if you're so well versed in semiconductors?",
        "created_utc": 1617551667,
        "id": "gtcvccb",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtcvccb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617580467.0
    },
    {
        "author": "syros31",
        "body": "The way i read u/BigTurboAbarth GPU availability can be seen as an index (or signal) of where BTC/ETH is headed. Which makes perfect sense to me.  \nI guess i can add that Xilinx, purchased by AMD, seems to be exposed to the ASIC market, car chip market and other tech sectors seeing shortages nowadays, I think this will give the AMD stock a good boost the coming years.  \nNow PoW blockchains may one day see trouble in the Sustainability light. If i was a bank flying the sustainability flag I couldn't invest in BTC with a clean consciense. There will be alternatives, though.",
        "created_utc": 1617558246,
        "id": "gtd890q",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtd890q/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617587046.0
    },
    {
        "author": "katorome",
        "body": "I'm buying this stock for one reason only they are going to merge , buy out XLNX  this is a game changer last I checked it was 140.00 a share the price they offered .",
        "created_utc": 1617512055,
        "id": "gtbhjvo",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtbhjvo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617540855.0
    },
    {
        "author": "mugsoh",
        "body": "Yes, but the way he wrote it seemed to imply that both were taking place 4/7. The meeting 4/7 is for acquisition vote for Xilinx.",
        "created_utc": 1617504783,
        "id": "gtb6wfh",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtb6wfh/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617533583.0
    },
    {
        "author": "CormacWasTaken",
        "body": "AMD calls for earnings or Xilinx shares for the acquisition.",
        "created_utc": 1617804330,
        "id": "gtotr3f",
        "permalink": "/r/wallstreetbets/comments/mlyq20/daily_discussion_thread_for_april_07_2021/gtotr3f/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617833130.0
    },
    {
        "author": "CormacWasTaken",
        "body": "Just put my entire portfolio into AMD and Xilinx. Made me a lot of money in 2016, and I think its incredibly undervalued at the moment. Gonna be putting every cent I have in them until they're at least 90$ AMD and 140$ Xilinx.",
        "created_utc": 1617803491,
        "id": "gtorz92",
        "permalink": "/r/wallstreetbets/comments/mlyq20/daily_discussion_thread_for_april_07_2021/gtorz92/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617832291.0
    },
    {
        "author": "skeletonskunk87",
        "body": "I know this is super boring but couldn’t you get the arbitrage benefit buy buying XLNX shares, selling 4/9 XLNX CSPs?",
        "created_utc": 1617665635,
        "id": "gtiejju",
        "permalink": "/r/wallstreetbets/comments/mkxprj/xlnx_arbitrage_merger_with_amd_on_april_7th/gtiejju/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617694435.0
    },
    {
        "author": "isellamdcalls",
        "body": "I'm all in, but staring to get afraid. Xilinx vote tomorrow. Hope that helps",
        "created_utc": 1617736423,
        "id": "gtlpwxq",
        "permalink": "/r/wallstreetbets/comments/ml86d3/daily_discussion_thread_for_april_06_2021/gtlpwxq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617765223.0
    },
    {
        "author": "kenyard",
        "body": "The arbitage play is to short amd and long xilinx.    \nIt's a 2 or 3% return probably,",
        "created_utc": 1617724953,
        "id": "gtkznko",
        "permalink": "/r/wallstreetbets/comments/mkxprj/xlnx_arbitrage_merger_with_amd_on_april_7th/gtkznko/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617753753.0
    },
    {
        "author": "Tradingisforloser5",
        "body": "Get in on amd before merger vote with Xilinx on Wednesday",
        "created_utc": 1617716361,
        "id": "gtkgrg2",
        "permalink": "/r/wallstreetbets/comments/ml86d3/daily_discussion_thread_for_april_06_2021/gtkgrg2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617745161.0
    },
    {
        "author": "El-cid-98",
        "body": "When a company acquires another one, the purchasing company often has a drop in their stock but then rallies back later.  AMD was on its way up when this merger with Xilinx was announced.  AMD is down slightly today but probably going to start back up again, imo.  So, buy AMD calls?",
        "created_utc": 1617632091,
        "id": "gtges24",
        "permalink": "/r/wallstreetbets/comments/mkh463/daily_discussion_thread_for_april_05_2021/gtges24/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617660891.0
    },
    {
        "author": "ScroogeMcThrowaway",
        "body": "So there's this AMD special meeting of stockholders on Wed. Any ideas what it is about? Hopefully not lame news about XLNX. When moon?",
        "created_utc": 1617587642,
        "id": "gteqqx9",
        "permalink": "/r/wallstreetbets/comments/mk3mcj/what_are_your_moves_tomorrow_april_05_2021/gteqqx9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617616442.0
    },
    {
        "author": "mog75",
        "body": "The xlnx merger vote happens on the 7th, that's the catalyst for the powder keg",
        "created_utc": 1617639996,
        "id": "gtgvr90",
        "permalink": "/r/wallstreetbets/comments/mkljmv/amd_increasing_production_by_20_in_q2_buy_before/gtgvr90/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617668796.0
    },
    {
        "author": "skeletonskunk87",
        "body": "But for the sake of argument if someone had occasional boomer tendencies and wanted to get back in on AMD this could turn out nicely too. So downside risk would be 1. No vote by AMD or XLNX (seems unlikely) or 2. AMD share price drops. As long as I’m comfortable holding AMD long term (or XLNX if a No vote) at that position size then not much downside risk with buying XLNX shares or writing XLNX 4/9 CSPs\n\nEdit: I cashed out of all of my Semi stocks so I could go big on GME in January and wanted to get back into AMD.",
        "created_utc": 1617667679,
        "id": "gtiihfb",
        "permalink": "/r/wallstreetbets/comments/mkxprj/xlnx_arbitrage_merger_with_amd_on_april_7th/gtiihfb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617696479.0
    },
    {
        "author": "Yung_King_",
        "body": "Xilinx 🚀🚀🚀",
        "created_utc": 1617808868,
        "id": "gtp3p2i",
        "permalink": "/r/wallstreetbets/comments/mlyq20/daily_discussion_thread_for_april_07_2021/gtp3p2i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617837668.0
    },
    {
        "author": "Skilledthunder",
        "body": "Shareholder vote approved XLNX merger/acquisition",
        "created_utc": 1617819276,
        "id": "gtprxxc",
        "permalink": "/r/wallstreetbets/comments/mlyq20/daily_discussion_thread_for_april_07_2021/gtprxxc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617848076.0
    },
    {
        "author": "rocketkid20",
        "body": "Unanimously approved. Small movement in price (both AMD and XLNX); looks like it was already baked in.",
        "created_utc": 1617818023,
        "id": "gtpp0es",
        "permalink": "/r/wallstreetbets/comments/mkxprj/xlnx_arbitrage_merger_with_amd_on_april_7th/gtpp0es/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617846823.0
    },
    {
        "author": "Yung_King_",
        "body": "Xilinx 🚀🚀🚀",
        "created_utc": 1617728088,
        "id": "gtl6w9j",
        "permalink": "/r/wallstreetbets/comments/ml86d3/daily_discussion_thread_for_april_06_2021/gtl6w9j/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617756888.0
    },
    {
        "author": "DQBIII",
        "body": "AMD with the XLNX acquisition should be huge as well.",
        "created_utc": 1617972294,
        "id": "gtxafw6",
        "permalink": "/r/wallstreetbets/comments/mndw8t/daily_discussion_thread_for_april_09_2021/gtxafw6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618001094.0
    },
    {
        "author": "DQBIII",
        "body": "It’s $20 cheaper or 20% cheaper than it was last QT when it blew out earnings. Not even beginning to factor in Xilinx. This is a $120 stock easy.",
        "created_utc": 1618372171,
        "id": "gug8niq",
        "permalink": "/r/wallstreetbets/comments/mqaa3x/what_are_your_moves_tomorrow_april_14_2021/gug8niq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618400971.0
    },
    {
        "author": "Uknow_nothing",
        "body": "It gobbled up a company(Xilinx) that is 62% more expensive per share than them. How could anyone who invested in Xilinx at above $100 believe AMD+Xilinx together with a much broader list of customers isn’t a 130+ stock? Super undervalued.",
        "created_utc": 1617991163,
        "id": "gtyfup7",
        "permalink": "/r/wallstreetbets/comments/mndw8t/daily_discussion_thread_for_april_09_2021/gtyfup7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618019963.0
    },
    {
        "author": "JoeWelburg",
        "body": "The only problem is that XLNX option activity is same as my sex life\n\nThere like 3$ spreads on strike 1$ above current price",
        "created_utc": 1617674180,
        "id": "gtiv6sn",
        "permalink": "/r/wallstreetbets/comments/mkxprj/xlnx_arbitrage_merger_with_amd_on_april_7th/gtiv6sn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617702980.0
    },
    {
        "author": "mamoneis",
        "body": "Ignore the noise about the xilinx acquisition and the naysayers on the chip shortage and you're golden.",
        "created_utc": 1617412864,
        "id": "gt79pai",
        "permalink": "/r/smallstreetbets/comments/mibon3/decide_my_next_yolo_you_fuckers/gt79pai/",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1617441664.0
    },
    {
        "author": "CallNPut",
        "body": "AMD is buying out Xilinx for 35 billion dollars.",
        "created_utc": 1617588517,
        "id": "gtes9ba",
        "permalink": "/r/wallstreetbets/comments/mhs01t/unpinned_daily_discussion_thread_for_april_01_2021/gtes9ba/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617617317.0
    },
    {
        "author": "oxedei",
        "body": "I dont know enough about Xilinx to provide my opinion. I never said I did. I'm just highlighting the terrible dd in this thread and hoping someone with a clue would actually chime in, but unfortunately you don't seem to have one either.",
        "created_utc": 1617551883,
        "id": "gtcvrft",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtcvrft/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617580683.0
    },
    {
        "author": "GearheadGaming",
        "body": "My dude, I've got a way better YOLO for you.\n\nXLNX is merging with AMD.  Every XLNX share will be converted into 1.7234 shares of AMD.  AMD is currently worth $81, so a share of XLNX should be worth $139.  But it isn't, it's $130, because there is a small risk the deal wont go through.\n\nThe last major hurdle to the merger is the shareholder meeting on April 7th.  So take your 4k and buy 20 $132 XLNX calls exp 4/9.  If the price goes to $139 after the meeting, you go up 350%.",
        "created_utc": 1617467123,
        "id": "gt9an8f",
        "permalink": "/r/wallstreetbets/comments/micazy/someone_tell_tsla_do_that_rip_thingim_on_my_last/gt9an8f/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617495923.0
    },
    {
        "author": "GearheadGaming",
        "body": "[XLNX 4/9 calls.](https://old.reddit.com/r/wallstreetbets/comments/mjccll/a_yolo_suggestion_for_the_degenerates_out_there/)",
        "created_utc": 1617469781,
        "id": "gt9fqob",
        "permalink": "/r/wallstreetbets/comments/mhz8ff/down_over_81k_theres_no_hope_for_me_left_expires/gt9fqob/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617498581.0
    },
    {
        "author": "LinuxGamer2020",
        "body": "This is why the stock is taking a dip:\n\nhttps://fortune.com/2020/10/27/amd-acquire-xilinx-35-billion-deal/\n\nI'm the short term, AMD will dip. Long term AMD looks great as Intel needs to play catch-up and AMD is also inching closer to Nvidia. Solid stock, but there are short-term dips ahead still",
        "created_utc": 1617508324,
        "id": "gtbcft6",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtbcft6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617537124.0
    },
    {
        "author": "GeneralSpacey",
        "body": "I bought at $2.89 and sold at $28.90, and I've regretted that decision every second of every day. Definitely buy. \n\nPros - They are Intels only competitor, and with the acquisition of Xilinx, might be able to actually break into the server market more easily. When ( IF? ) AWS starts using AMD for EC2, AMD is going to the moon for sure.\n\ncons - Intel's new CEO Pat Gelsinger seems to be quite competent, and most of their announcements as of recent times have been a confidence boost in the face of their past failures.\n\nI think it's a good buy for the quarter at least.",
        "created_utc": 1617501894,
        "id": "gtb26yi",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtb26yi/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617530694.0
    },
    {
        "author": "Skilledthunder",
        "body": "AMD shareholder vote to merge with XLNX tomorrow. No idea when we'll get to see results, but i expect it to move the stock up",
        "created_utc": 1617738398,
        "id": "gtluj5a",
        "permalink": "/r/wallstreetbets/comments/ml86d3/daily_discussion_thread_for_april_06_2021/gtluj5a/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1617767198.0
    },
    {
        "author": "Miladyboi",
        "body": "my point all the other chip makers except XLNX surged, I know we're acquiring XLNX but what the fuck does that have to do with us dipping today",
        "created_utc": 1617999412,
        "id": "gtyxxxp",
        "permalink": "/r/stocks/comments/mnpj2z/what_the_fuck_is_wrong_with_amd/gtyxxxp/",
        "score": -1,
        "subreddit": "stocks",
        "created": 1618028212.0
    },
    {
        "author": "Miladyboi",
        "body": "I found a lead to possibly why it plummeted and XLNX also plummeted so it's a possibility maybe that people are fucking stupid and wanted to sell them for no reason",
        "created_utc": 1617999112,
        "id": "gtyxavn",
        "permalink": "/r/stocks/comments/mnpj2z/what_the_fuck_is_wrong_with_amd/gtyxavn/",
        "score": -3,
        "subreddit": "stocks",
        "created": 1618027912.0
    }
]