[
    {
        "author": "Hacksaw171",
        "body": "2/24 Jim Cramer said to buy these 12 stocks instead of GME. Let’s see how they’re doing:\n\n                 2/24               Current\n\nAmazon - 3166.75       3067      -3.1%\n\nChipotle - 539.80        511         -5.3%\n\nTrade Desk - 790.52    726.41   -8.1%\n\nTesla -    711.45          682.55     -4.1%\n\nIntuitive Surgical - 743.73  721.04 -3.1%\n\nAlign Technology - 560.13  519.39  -7.3%\n\nNvidia - 564.91    506.98          -10.3%\n\nLam Research - 556.16    533.41  -4.1%\n\nServiceNow - 545.50    488.46   -10.5%\n\nNetflix - 539.80     508.74      -5.8%\n\nHubSpot - 505.73      467.31    -7.2%\n\nAlphabet - 2030      2023      -0.3%\n\nAll red. How about GME?\n\nGamestop - 44.70   330   +638%\n\nHmm.",
        "created_utc": 1615395574,
        "id": "gqgqu6a",
        "score": 83,
        "subreddit": "wallstreetbets",
        "created": 1615424374.0
    },
    {
        "author": "gb2075",
        "body": "I’ve been researching semi-conductors in depth the past few days. \n\nI’m eyeing the big retail guys like INTC, NVDA, AMD (agreed with you that AMD is the most promising).\n\nThe other segment is the fabricators, they don’t sell chips they just produce them for other companies. I’m keeping tabs on AMAT, TSM, LRCX, NXPI, FORM, UMC).\n\nThen finally the rare earth metals.. companies like MP, AMAT, VALE (I was long on these guys then they got a fucking $7B fine for killing 300 people in a dam explosion.... oops).\n\nLook into Biden’s recent executive order, not only does he address the global semiconductor shortage, but plans to bring jobs back to the states and invest in American companies. MP Materials is the only US based company REM company. \n\nThis all looks so obvious as a long term play. I forget where I read it, but the global semiconductor usage is going to 10x or something insane like that in the next 10 years.\n\nI don’t know why all of these companies are down recently, I haven’t looked into it. I bought $10 worth of every stock listed above so I could keep tabs on them. All of them have followed the same negative trajectory the last month or so. If you zoom out to 5 year though, almost every single company shows insane growth. I imagine that growth will only compound long term. Do you have any thoughts on the reason for this recent downward trend? \n\nI’m considering making a pretty massive 5-10 year long play on semiconductors.",
        "created_utc": 1614872359,
        "id": "gpnv7ia",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614901159.0
    },
    {
        "author": "mushlafa123",
        "body": "Buy an amat or lrcx weekly. When micron reports tomorrow and announced huge capex these will fly",
        "created_utc": 1617125546,
        "id": "gstmfuk",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617154346.0
    },
    {
        "author": "mushlafa123",
        "body": "It's not uncommon for amat and lrcx to outperform mu  after mu earnings call. Since huge capex isn't really great for mu but is very good for their suppliers like amat and lrcx. Maybe we get some news about government chip subsidies and BOOM goes the suppliers... Wishful thinking I know but one can dream.",
        "created_utc": 1617125732,
        "id": "gstmuni",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617154532.0
    },
    {
        "author": "MementoMori97",
        "body": "Just put a majority into a total market etf and let it sit. Also, 1500 of your 5k in GE? 30% in a single stock is likely never a good idea, even if you think you are 100% sure on it. I don't like going over 7.5% or so on a single stock in my portfolio. Only exception to that is LRCX which has grown so much it's at 11% and I'm not selling it.\n\nIt sounds like you can't handle those big swings that you're going to get with a fund like ARKF if you're selling at a loss then buying back in higher again later. I would definitely put at a minimum 50% into ITOT, VTI, or something similar, but if you want to take more risk, it's your choice to make.",
        "created_utc": 1615340538,
        "id": "gqedo9t",
        "score": 3,
        "subreddit": "stocks",
        "created": 1615369338.0
    },
    {
        "author": "milimiri",
        "body": "You might want to remove STX, AVGO, AAPL and etc. from the list, and add ASML, LRCX, MU and etc. to the list. \n\n\nI am working in semiconductor industry but not in fabrication. Basically the most fabs have been out of game for advanced technology nodes. For example, TXN has some fabs, but they are old technology (still a descent market especially for analog chips). MU has fabs but mainly for memory (memory and logic CMOS are different in manufacting). There are also markets for power semiconductor, optical sensors and etc. For advanced SoC chips, only major players left right now are TSM and INTC. Samsung is still in the game and SMIC is trying to catch up. But basically TSM takes the majority of the market. \n\nDisclosure: I have been holding TSM for a couple of years. I personally prefer fab+fabless and I am a little bearish on US-based fab. But I am not an expert in the field.",
        "created_utc": 1615222721,
        "id": "gq88ilq",
        "score": 2,
        "subreddit": "investing",
        "created": 1615251521.0
    },
    {
        "author": "Porsche981Fan",
        "body": "I think TSM , LAM Research and AM will all be winners of this move as most governments internationally have the same plan. And TSM is the best performing player in chip production in my humble opinion.",
        "created_utc": 1614753773,
        "id": "gpic319",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614782573.0
    },
    {
        "author": "ndlsmmr",
        "body": "TY. Second tier semis...IHRC, UTCC. First is tied to LRCX/AMAT. Big concentration by revenue, but big spending coming specifically from AMAT this year with busted Chinese acquisition.",
        "created_utc": 1617219547,
        "id": "gsy71bk",
        "score": 2,
        "subreddit": "stocks",
        "created": 1617248347.0
    },
    {
        "author": "apooroldinvestor",
        "body": "That's a tough call.  You have to think out 5 years I think or more.  I think semis will all be worth more in 5 years!  Just an uneducated guess.\n\nI am negative ASML and my TSM and LRCX are approaching break even, but NO I'm holding!!\n\nThe reason I'm negative gain is because I added them 3 months ago or less!\n\n In investing you have to be patient as BUFFET says.  I'm pretty sure I'll have a positive gain in all my semis a year or two from now.\n\nMy NVDA is at 17% gain I think.  I just added 1 share for a total basis of $475 which I'm comfortable with.   Look up the price targets of those stocks.  They're much higher in a years time.  Not guaranteed but ....",
        "created_utc": 1614891866,
        "id": "gpp5blj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614920666.0
    },
    {
        "author": "filth100",
        "body": "Big fan of ASML and LRCX",
        "created_utc": 1614894876,
        "id": "gppc8j3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614923676.0
    },
    {
        "author": "MrMortons",
        "body": "I thought boomer stocks had taken over but I see TSLA &amp; LRCX were the biggest movers today. \n\nAbsolutely no one: \n\nme: As to vaccines, OCGN (Covaxxin) will be the dose everyone gets for the next 5 years. Maybe next ten years for school kids.",
        "created_utc": 1615301606,
        "id": "gqbzjkm",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1615330406.0
    },
    {
        "author": "thavirg",
        "body": "Thanks for adding commentary.  Mind answering a few questions I've had in this space?\n\n - What do you predict will happen with the Biden admin and Dem Congress re: semiconductor supply chain?\n\n - Aside from TSMC's superiority, are there cost-savings by being based in Taiwan?  Perhaps govt subsidies?\n\n - What are your thoughts on $LRCX, $AMAT, $ASML, and $KLAX? Any of them stand out to you as better investments?\n\n - Is there much talk of silicon photonics and photonic integrated circuits amongst your colleagues?  If so, which companies seem to be developing hardest in this area?",
        "created_utc": 1615264604,
        "id": "gqaml9d",
        "score": 1,
        "subreddit": "investing",
        "created": 1615293404.0
    },
    {
        "author": "apooroldinvestor",
        "body": "LOTS!  UNH LRCX NVDA SQ AAPL JPM TMO CVX",
        "created_utc": 1615265553,
        "id": "gqao1qo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615294353.0
    },
    {
        "author": "JayArlington",
        "body": "LOVE the LRCX call here.  Lam Research may not be a company many are familiar with, but if need to build semiconductor manufacturing capacity LRCX is #1 on your speeddial. \n\nI prefer CLF right now to MT on the steel side simply because I think their greater exposure to the US market means a quicker win, but MT is going to have a great year.",
        "created_utc": 1615673661,
        "id": "gqua322",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615702461.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "Read that AMD article. Idk how I missed that. Interesting that DUV was used for that level, and makes me wonder why is Intel so far behind it TSMC is able to use it for that size. I read that LRCX made a tool to further enhance the yields of 7nm. I forgot if it's dry or wet, I think it was drying it to ensure the product stays up (based on images, I'm not a lithography engineer) so maybe we'll see it be used to enhance yields. It should already be in use in 5nm, but I don't have that info.\n\nI've read the link you posted above. They only have an agreement on previous gen tech, and even then there is a request to restrict those it seems:\n\n&gt; On Monday, the National Security Commission on Artificial Intelligence, or NSCAI, recommended that the United States coordinate with the Netherlands and Japan to deny export licenses to China for key chipmaking equipment.\n\nI'm not seeing these products in the hands of SMIC, nor there seems to be strong hope that they'll be able to fully deliver without major hurdles.",
        "created_utc": 1615757666,
        "id": "gqy3zu7",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1615786466.0
    },
    {
        "author": "Beagleoverlord33",
        "body": "Hate T the company has a terrible track record of bad acquisitions and frankly doesn’t seem to understand their own industry. It’s also loaded in debt. Imo your much better off just buying a basic index fund it’s safer and your likely to get significantly better returns. If you go the T route is make it a smaller position.\n\nIf your not feeling an index some of my favorite divided plays would be MSFT AAPL ABBV JNJ LOW AMAT/LRCX. Most of those are more dividend growth.",
        "created_utc": 1615896205,
        "id": "gr43jxi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615925005.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I like LRCX and TSM also.  Thanks though. Decided to keep them all for diversity.",
        "created_utc": 1614718015,
        "id": "gpggpfu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614746815.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Right.  People are dumb.  Msft and AAPL LRCX hd unp unh etc.  It's not that difficult folks!",
        "created_utc": 1616967367,
        "id": "gsme3ko",
        "score": 1,
        "subreddit": "stocks",
        "created": 1616996167.0
    },
    {
        "author": "thebyus1",
        "body": "Patience is key in this game. A couple years (2014ish, I think) ago I sold a house in CA for a very handsome profit. Took the money, bought a sub to Motley Fool (I know) and started buying their monthly picks $2500 at a time.  18 months later I was frustrated because I had like 2 winners, a handful of dogs and a majority of a portfolio that was decidedly down, a lot. So I sold out, and shifted everything into VTSAX. Fast forward to today, and I am literally kicking myself: I was holding MSFT at 50, SBUX at 30, MELI at 120, LRCX at 100 and a bunch of others that tripled. And they were pushing SHOP, AMZN, NFLX, and CMG and I refused to buy based on my track record with their picks. If I'd stayed the course and waited it out I would literally be retired as a multi-millionaire.\n\nAs others have said: learn from your mistakes, be patient, and seek out learning opportunities. (ThinkorSwim's faux money account is a great way to start.) This is a long game, there's no rush. The market trends to double every 9 years or so. There will always be places to make money.",
        "created_utc": 1617070769,
        "id": "gsrbbl7",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617099569.0
    },
    {
        "author": "mushlafa123",
        "body": "Easily amat or lrcx for tomorrow",
        "created_utc": 1617138322,
        "id": "gsuej09",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617167122.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "I have the website up. I'll read more on it and sub. :)\n\nFor LRCX, this is what I'm talking about: https://blog.lamresearch.com/lam-introduces-euv-lithography-technology-breakthrough/",
        "created_utc": 1615992061,
        "id": "gr8p20e",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1616020861.0
    },
    {
        "author": "I_like_to_build",
        "body": "Not sure how you managed that.  I got stupid lucky and decided to buy a few calls before GME became national news.  Paid something stupid like $10 for a GME $50C when GME was trading at $35.  And bought some AMC and BB.  Then GME hit $300 something.  Not knowing what I was doing I exercised and then sold off at like $300, $290 and $270.\n\nEnded up with 30 grand and decided to make it my options play money.  Lost a good chunk on NVDA when it shit but stayed about even overall cause I was playing MU LRCX AMAT DKNG and AMC.  Because you know like silicone chips and shortages.  Figured buy the guys that make silicone chip equipment.  Atleast I think some of those stocks do that shit.  And DKNG because like sin stocks are a good hedge for market down turns or some shit.\n\nSo I didn't make money for a while.  And I also learned how those stocks move.  I also learned if when the dip comes if you don't have any cash well then you are fucked.\n\nSo I waited for most of my calls to go back green and took barely any profit but got back to my original 30k.\n\nThen I did some ground breaking shit.  I didn't buy anything until the shit dipped for a few days.  And when it did I just bought a little and kept buying all the way down.  I also started buying calls 90 to 60 days out with strikes around the most recent high.\n\nSo when MU tanked I bought it all the way down to $82.  Same thing with AMAT and LRCX.  Also KLAC which doesn't run like those.  DKNG is hella cheap now, so is UWMC, and some of the cruise stocks.\n\nSo I did that and now Friday happened.\n\nAnd now I think I'm smarter than Warren Buffet.\n\nSo now I'm going to hold this shit for way to long until it goes red and expires.\n\nAnd then I'll listen to my wife banging her boyfriend while I figure out if I have anything of value to pawn other than my mouth.",
        "created_utc": 1616902476,
        "id": "gsjojnx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1616931276.0
    },
    {
        "author": "Hacksaw171",
        "body": "Cramer Stonks check-in (he said to buy these instead of GME on 2/24):\n\nStonk    2/24 Open   3/30 Open    Change\n\nAmazon 3166.75    3072.8            -2.97%\n\nChipotle 1417.73     1417.                -0.05%\n\nTrade Desk 790.52   605.01           -23.47%\n\nTesla    711.45        601.92             -15.40%\n\nIntuitive Surgical 743.73  719.11     -3.31%\n\nAlign Technology 560.13 516.22.  -7.84%\n\nNvidia 564.91    512.56.                 -9.27%\n\nLam Research 556.16  565            +1.59%\n\nServiceNow 545.5  481.88           -11.66%\n\nNetflix      539.8     510.21.             -5.48%\n\nHubSpot 505.73   420.62.            -16.83%\n\nAlphabet 2030     2052.46.            +1.11%\n\nTotal      12132.41   11474.79         -5.42%\n\nTwo whole stonks green up just over 1%. Impressively terrible. Pretty sure you could fling crap at the wall and buy the stonks the corn sticks to and do better. Meanwhile:\n\nGME        44.7          187.5           +319.46%\n\nHe recently tweeted that his family and friends wish he would spend more time with them and less time studying the market. While I can’t personally imagine wanting to spend any amount of time with him, I think he could safely save everyone money by not giving any more “tips” and taking some more personal time.",
        "created_utc": 1617112062,
        "id": "gssszkc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617140862.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Yeah but I'm already 20% in msft aapl.  Add to that nvda fb SQ pypl etc!  Yikes!!  Joking!  But I'm bout 60% tech if you include my ASML LRCX AVGO TSM",
        "created_utc": 1617159248,
        "id": "gsvi7z0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617188048.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Yeah I sort of feel the same though bout AAPL lately though  lol!  I'm in with 50 shares @ 90.\n\nI also have fb msft and nvda ASML LRCX AVGO also.  How am I looking?  I also have non tech like UNH HD TMO UNP etc.",
        "created_utc": 1617155723,
        "id": "gsvbyxc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617184523.0
    },
    {
        "author": "mushlafa123",
        "body": "Amat or lrcx. Perfect storm. MU gonna report more capex tonight and Joe schmo going to announce something chip related in that 2.2t bill",
        "created_utc": 1617194137,
        "id": "gswps4e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617222937.0
    },
    {
        "author": "FelWill",
        "body": "Just look at semiconductors. Buy anything from ON to LRCX you won't be dissapponted in a month",
        "created_utc": 1614889573,
        "id": "gpoztlw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614918373.0
    },
    {
        "author": "snyder810",
        "body": "Personally I hold both AMAT &amp; LRCX. For other options ASML has some leading tech or you could look at KLAC",
        "created_utc": 1615337202,
        "id": "gqe7f3x",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615366002.0
    },
    {
        "author": "MementoMori97",
        "body": "Full disclosure: I own all of these. \n\nOnly one I would be wary about is LRCX being up so kuch the past 6 months or so. My most confident pick is MT for the next 12-24 months.",
        "created_utc": 1615604947,
        "id": "gqrhmuu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615633747.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I just invest in the companies that make chips and machines that make them.  TSM LRCX and ASML.  I have NVDA also though.  And AAPL as well.",
        "created_utc": 1615592087,
        "id": "gqqvdzv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615620887.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I got soxx but I think you do better IF you pick the right ones.  In betting lrcx amat tsm right now.  Maybe I'll be right maybe wrong who knows ...",
        "created_utc": 1615436117,
        "id": "gqj6914",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615464917.0
    },
    {
        "author": "ThisPomelo4",
        "body": "Why Micron and not a different name? There's a lot of correlation in the sector. I get that it's a swing trade but why this particular instrument? You could probably look through for stuff that's dislocated and has cheaper IV.\n\nThinking longer term...\n\nI think eventually we are going to see the IDM companies outperform the fabless companies -- partially because the fabless companies have had such a massive run in the past half-decade -- but for now, there's not much dispersion.\n\nEventually, I like KLAC LRCX AMAT and ASML because I think there will be some major investment in new fab facilities (or refitting of old ones I guess). Leading edge and legacy nodes are at pretty high utilization right now, due to demand for autos, PCs, and all the other good stuff.",
        "created_utc": 1614766569,
        "id": "gpiq10g",
        "score": 1,
        "subreddit": "options",
        "created": 1614795369.0
    },
    {
        "author": "knowledgemule",
        "body": "Not going to really dive more past this comment because at a certain point I keep thoughts behind my semiconductor focused substack LOL.\n\n1) pat is the hometown hero. He was one of the og engineers on one of their first hit products (80486 seriously read about it, a similar crisis), so if anyone has the cultural capital to do a turnaround... it’s him. Lots of wood to chop but expectations are so low. \n\n2) I’m confused about your LRCX comment. They are clearly not the only ones making themselves useful. Multiple parts of the supply chain has to turn over, like masks, foup cleaners, all kinds of other stuff. It’s complicated and EUV is far from the only step. You should look up ALD &amp; 3D etch because that’s really what LRCX does. There’s also a Japanese mask company that’s a beneficiary of EUV\n\n3) I mean, when I last talked to ASML mgmt they def wanted to sell tools! All things being equal it really doesn’t matter to the tool companies. Most American companies want to sell tools, it’s pretty hard to figure them out. And even when they do there is a lot of lock in and installed base management. \n\n\n4) so problem is this is the tightest screw we have on them and any kind of normalization starts with selling tools / EDA again. It depends on your view on nationalism. If you’re a US citizen and don’t like China sure, if you’re a cold hearted investor I think it’s in your interest for the tool companies to sell to China. They are struggling to use the tools not even make them. I think this risk is... a bit overblown. The success in this industry is very cumulative and there are maybe 2 real tool companies in China and both are tier 2 if not 3 companies. Anyways that’s all for today.",
        "created_utc": 1615775192,
        "id": "gqz0qns",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1615803992.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 16th of March\n\n\n\n## Upcoming events for Tuesday, March 16th\n\n - Expected earnings:\n\n  ABIO, ADVWW, ALSK, APG, ASPU, AYLA, BDSX, BMTX, CAL, CALA, CLPR, CNF, COUP, CRIS, CRTX, CRWD, CTRN, CUE, DBI, DFFN, DL, DLNG, DTIL, ELDN, EMAN, EOLS, ETON, FANH, FCEL, FF, FLNT, FORTY, FREE, FTK, FUSN, FUTU, GBIO, HIL, HJLI, HUGE, IDN, IMNM, IMOS, INFI, INPX, IPHA, IRCP, JBL, JILL, KIN, KIQ, KODK, KROS, LEN, LEN.B, LTBR, MICT, MOTS, NBEV, NES, NEW, NFE, NPK, NTN, NYC, OCX, ORGO, OTEL, PFMT, PLRX, PMD, PRLD, PRTH, REDU, REI, RMED, RNA, RUHN, SHSP, SMAR, SRGA, STSA, SUMR, SYNC, TLC, TOUR, TRIL, TSQ, VBFC, VEL, VFF, VIRX, VOLT, WF, WKEY, XGN, XNET, YMTX, YTEN\n\n - Ex-div:\n\n  ACCO, ALLE, ARES, BKCC, CEN, CINF, CIZN, CXE, CXH, DMB, DYFN, ESCA, FINS, FLXS, FNF, FOF, FSFG, FSK, FSKR, GAB, GDL, GDV, GGZ, GNT, GRX, GUT, GWRS, HCA, HES, HI, HMN, HOFT, ICE, ITT, IVH, KSS, LDP, LRCX, MCR, MCY, MIE, MIN, MMT, MRTN, NJR, NMFC, NWS, NWSA, OPP, OXLC, OXSQ, PGZ, PHI, PSF, PTA, RA, RE, RFM, RIV, RMI, RMM, RNP, RNST, RQI, RSF, RYN, SJI, SLGN, STFC, SWBI, TCPC, TDS, TY, UHT, UTF, UTMD, VSH, VST, WH, WU\n\n - Economic events and announcements:\n\n    - 20-Year TIPS Auction (previous: 1.920%)\n    - API Weekly Crude Oil Stock (previous: 12.792M)\n    - Business Inventories (consensus: 0.3%, previous: 0.6%)\n    - Capacity Utilization Rate (consensus: 75.5%, previous: 75.6%)\n    - Core Retail Sales (consensus: -0.1%, previous: 5.9%)\n    - Export Price Index (consensus: 0.9%, previous: 2.5%)\n    - Export Price Index (previous: 2.3%)\n    - Import Price Index (consensus: 1.2%, previous: 1.4%)\n    - Import Price Index (previous: 0.9%)\n    - Industrial Production (consensus: 0.3%, previous: 0.9%)\n    - Industrial Production (previous: -1.83%)\n    - Manufacturing Production (consensus: -0.1%, previous: 1.0%)\n    - NAHB Housing Market Index (consensus: 83, previous: 84)\n    - Redbook (previous: -18.1%)\n    - Redbook (previous: 8.0%)\n    - Retail Control (consensus: -0.9%, previous: 6.0%)\n    - Retail Inventories Ex Auto (previous: -0.2%)\n    - Retail Sales (consensus: -0.5%, previous: 5.3%)\n    - Retail Sales (previous: 7.43%)\n    - Retail Sales Ex Gas/Autos (previous: 6.1%)\n\n## Upcoming events for Wednesday, March 17th\n\n - Expected earnings:\n\n  AOUT, AP, ARCO, AXLA, CEPU, CETX, CFRX, CMCL, CRHM, CSAN, CTAS, CTIC, DPW, ELP, EPSN, ETNB, ETTX, EYEG, FIVE, FPH, FPI, GES, GEVO, GIFI, HBB, IMTX, IMV, INFU, IPWR, JCS, KC, KRKR, KRON, LE, MDRR, MLHR, MLND, NAVB, NFH, NM, NMCI, NXE, ONTF, OSMT, OVID, OXSQ, PD, PDD, PNRG, PW, QD, RCMT, RIDE, RNET, SCYX, SGBX, SID, SINA, SMTC, SNDL, SPRB, SPRT, TEO, TH, THMO, UBX, UEC, UPST, VINP, VSTM, WHLR, WLFC, WPG, WSM, WVVI, ZTO\n\n - Ex-div:\n\n  AAN, ADT, AFT, AIF, AIMC, AJX, ALEX, ARD, BANX, BBY, BPOP, CHMG, CUBA, EBSB, FSLF, GAIN, GLAD, GOOD, HBAN, HRZN, LAND, MAV, MHI, MNDO, MPW, MYE, NUW, PFLT, PHD, PHT, PNNT, SITC, SLRC, SNV, SUNS, TSM, VRS\n\n - Economic events and announcements:\n\n    - Building Permits (consensus: 1.750M, previous: 1.886M)\n    - Building Permits (previous: 10.7%)\n    - Crude Oil Imports (previous: -0.919M)\n    - Crude Oil Inventories (consensus: 2.715M, previous: 13.798M)\n    - Cushing Crude Oil Inventories (previous: 0.526M)\n    - Distillate Fuel Production (previous: 0.806M)\n    - EIA Refinery Crude Runs  (previous: 2.407M)\n    - EIA Weekly Distillates Stocks (consensus: -3.470M, previous: -5.504M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 5.1%, previous: 13.0%)\n    - FOMC Economic Projections\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision\n    - Gasoline Inventories (consensus: -3.134M, previous: -11.869M)\n    - Gasoline Production (previous: 0.704M)\n    - Heating Oil Stockpiles (previous: 0.544M)\n    - Housing Starts (consensus: 1.560M, previous: 1.580M)\n    - Housing Starts (previous: -6.0%)\n    - IEA Monthly Report\n    - Interest Rate Projection - 1st Yr (previous: 0.10)\n    - Interest Rate Projection - 2nd Yr (previous: 0.1)\n    - Interest Rate Projection - Current (previous: 0.1)\n    - Interest Rate Projection - Longer (previous: 2.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.26%)\n    - MBA Mortgage Applications (previous: -1.3%)\n    - MBA Purchase Index (previous: 289.0)\n    - Mortgage Market Index (previous: 783.8)\n    - Mortgage Refinance Index (previous: 3,658.8)\n\n## Upcoming events for Thursday, March 18th\n\n - Stock splits:\n\n    - ELPVY @ **10:1** (Payable date: 03/17/2021)\n    - ELP @ **10:1** (Payable date: 03/17/2021)\n\n - Expected earnings:\n\n  ACN, ACTG, ADCT, ADMA, AFIB, AIV, AKUS, ALPN, ALTG, ALXO, AMTI, ARMP, ASLN, ATHA, AVIR, BCOW, BLCM, BSGM, BSQR, CATO, CBMB, CBPO, CDAK, CELP, CIB, CMC, CRT, CRVS, CSIQ, CTK, CVV, CWBR, CZNC, DG, DLTH, DTIL, EFOI, ENTX, ESGC, EYES, FBRX, FDX, FMTX, FRSX, FURY, GECC, GHSI, GIII, GLMD, GOL, HEXO, HHR, HIMS, HOOK, HWCC, INZY, ITOS, JG, JOBS, KINS, LAIX, LAZR, LAZY, LEGN, LEU, LX, MAXN, MBRX, MMX, MOSY, MP, MRUS, MTCR, MTEM, MYSZ, NEN, NKE, NKSH, NKTX, NLTX, NNA, NSYS, NVGS, NVIV, OCDX, OCGN, OLLI, ORIC, PAX, PBLA, PCVX, PDSB, PESI, PFSW, PHAT, PLX, PROG, RDHL, REED, RFL, RLH, RMTI, SCHL, SCPE, SHIP, SIG, SLDB, SLRX, SMTS, SMTX, SPPI, SQFT, SQZ, STG, SVRA, SYBX, SYPR, TATT, TITN, TMBR, TOMZ, UG, UONE, UONEK, URGN, USAU, UTZ, VBLT, VIRI, VIVE, VNRX, VTRS, WB, WOOF, WRN, XTLB, YI\n\n - Ex-div:\n\n  AAP, AIN, AINV, AL, ALRS, BBSI, BIG, CB, CRH, CTS, DEX, DKS, FISI, FSS, GEF, GEF.B, HPP, IGR, MGU, MLI, MNRL, PLD, PLOW, QCRH, QTS, RBCAA, RPT, SBSW, SPR, THQ, THW, TPB, VCIF, VGR, WEYS, WMT\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.987%)\n    - 4-Week Bill Auction (previous: 0.030%)\n    - 8-Week Bill Auction (previous: 0.035%)\n    - Continuing Jobless Claims (consensus: 4,070K, previous: 4,144K)\n    - Initial Jobless Claims (consensus: 700K, previous: 712K)\n    - Jobless Claims 4-Week Avg. (previous: 759.00K)\n    - Natural Gas Storage (consensus: -73B, previous: -52B)\n    - Philadelphia Fed Manufacturing Index (consensus: 23.0, previous: 23.1)\n    - Philly Fed Business Conditions (previous: 39.5)\n    - Philly Fed CAPEX Index (previous: 25.20)\n    - Philly Fed Employment (previous: 25.3)\n    - Philly Fed New Orders (previous: 23.4)\n    - Philly Fed Prices Paid (previous: 54.40)\n    - US Leading Index (consensus: 0.3%, previous: 0.5%)\n\n## Upcoming events for Friday, March 19th\n\n - Expected earnings:\n\n  ADIL, AIM, ANAT, ATLC, ATLO, AYRO, BH.A, BHAT, BRID, CCNC, CEI, CHEK, CMPI, COMS, CVR, ENSV, ERJ, EXN, FENC, FGBI, FHTX, FSEA, FSTX, GGAL, HMG, HUSA, ITCB, LMNL, MIST, NBAC, NWLI, OLB, PCSA, PNBK, PRPO, PXS, RBCN, SJ, SPLP, STTK, TEDU, TGS, UONE, UONEK, VSTA, WTT\n\n - Ex-div:\n\n  ARDC, AVGO, CSGS, CTO, DX, FGBI, GBLI, HRC, JCI, JJSF, LAMR, NCMI, NEWT, PCF, PINE, PM, TIPT, WRE\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 4.1K)\n    - CFTC Copper speculative net positions (previous: 51.4K)\n    - CFTC Corn speculative net positions (previous: 503.4K)\n    - CFTC Crude Oil speculative net positions (previous: 537.4K)\n    - CFTC Gold speculative net positions (previous: 175.2K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -12.5K)\n    - CFTC Natural Gas speculative net positions (previous: -0.0K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 17.8K)\n    - CFTC Silver speculative net positions (previous: 36.1K)\n    - CFTC Soybeans speculative net positions (previous: 224.7K)\n    - CFTC Wheat speculative net positions (previous: 26.1K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 310)\n    - U.S. Baker Hughes Total Rig Count (previous: 403)\n\n^^^^2021-03-16",
        "created_utc": 1615888816,
        "id": "gr3uymn",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1615917616.0
    },
    {
        "author": "third_legatron",
        "body": "Thank you, albemarle I Definitely could've waited but it's a good time to average down (I haven't, lithium is a bit overweight imo). Sbsw is solid moving forward, it gives slight exposure to EVs due to the precious metals they require as well as the safety net of gold, and the CEO seems to be on the right track all together. \n\nI've held many value stocks through covid and I want to get more into tech as it seems to be in correction territory. I like american semiconductor stocks because I feel it has a few catalysts to come, although I do expect the cyclical downturns and plan on averaging down on my long holds down the road. I picked up lam research and i have owned intel for a while now. I want to own nvidia, but I want to wait a bit for them.",
        "created_utc": 1616960202,
        "id": "gslzysc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1616989002.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I got a lot of tech! 😆 I got lrcx ASML TSM doing pretty well in those.  I also have some WMT UNH TMO UNP etc.\n\nTrying to balance out from heavy tech.  Maybe I should add to my non tech?",
        "created_utc": 1617155936,
        "id": "gsvcd3c",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617184736.0
    },
    {
        "author": "ThisPomelo4",
        "body": "I think the names of interest are the ones that would benefit from an outlay of semiconductor capital expenditure that focuses more on the United States: INTC, LRCX, ASML, KLAC, AMAT.\n\nJust my opinion. I have \"AMD 70\" written on my whiteboard as an entry trigger.",
        "created_utc": 1615565549,
        "id": "gqpb98o",
        "score": 1,
        "subreddit": "options",
        "created": 1615594349.0
    },
    {
        "author": "MementoMori97",
        "body": "LRCX - Semiconductors \n\nMT - Steel\n\nRAD - Pharmacies",
        "created_utc": 1615604833,
        "id": "gqrhfvf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615633633.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I don't see anything wrong.  I would add UNH LRCX TSM WMT and start an sp500 index in there like VOO.",
        "created_utc": 1615166796,
        "id": "gq5vukf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615195596.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Msft aapl hd tmo unp UNH sq pypl tsm lrcx ASML NVDA dg.  Don't sell .... Just hold for 10 years.",
        "created_utc": 1616880652,
        "id": "gsig028",
        "score": 1,
        "subreddit": "stocks",
        "created": 1616909452.0
    },
    {
        "author": "knowledgemule",
        "body": "mule.substack.com is my paid newsletter. I'm pausing subscriptions / posting since I'm about to do a hiatus.\n\n1) I mean if you read about their botchup w/ the ix3 or whatever that was supposed to succeed x86 - it was a pivotal if not one of the most defining moments in the companies history. Now who knows what he will do but clearly he was a key person in crisis in the past - and is likely another great one for the future.\n\n2) I really don't follow you on this. I think you are lacking in understanding as to what LRCX does? They are etch..... another completely separate step than lithography. While they are making a step that is going to be dry etch paired w/ EUV - its a separate step altogether.\n\n3/4) - sure",
        "created_utc": 1615991378,
        "id": "gr8no1f",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1616020178.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Msft aapl sq pypl unp unh nvda hd crwd fskax pypl tsm lrcx tmo jpm.  Down 10%.  Not worried.",
        "created_utc": 1617083652,
        "id": "gsrugmv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617112452.0
    },
    {
        "author": "mushlafa123",
        "body": "Good gains in amat. Chip shortages means companies who build chips need to increase their capex dollars which go to amat and lrcx.\n\nSpeaking of. Free money machine starts tomorrow when micron reports and guides to increasing capex so buy amat or lrcx to benefit",
        "created_utc": 1617138045,
        "id": "gsudybg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617166845.0
    },
    {
        "author": "pdxp2b",
        "body": "Agree. I don’t follow any of the EV or space bullshit in this sub. I look at the next industry that no one is talking about. \n\nHuman capital is further along but still has so much realistic growth ahead of it; workday/paycom/etc. are really only the beginning of the possibilities and technologicification of the workplace and employment; they’re just trying to do it decently; the next iteration will be explosive and creative building off that. HR tech is like 50% built. \n\nAll that said about HR, Ed tech has 99% of an industry to grow. The actual industry itself has barely even begun to evolve. E-learning now officially legit forever—everyone from k-12 to higher education will be looking to not just survive but find long term solutions to thrive, impress and engage students and in higher Ed, highly paying students with high expectations. Who will land DOE contracts? Who will the major players be? All markets are open for taking. Good move Zoom could make would be Ed services expansion. Connect content providers to educational institutions. Students and teachers hate most of the software and platforms they’re using because they’re super old but accepted, or are ad hoc with lots of issues. \n\nOwn Adex, eac, more.",
        "created_utc": 1614829392,
        "id": "gpm5uls",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1614858192.0
    }
]