[
    {
        "author": "YEET_THE_VOTE",
        "body": "IBM developing COVID multi pass for NY - https://www.governor.ny.gov/news/governor-cuomo-announces-pilot-program-testing-excelsior-pass-madison-square-garden-and",
        "created_utc": 1614709101,
        "id": "gpfvuel",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpfvuel/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614737901.0
    },
    {
        "author": "JimJamSquatWell",
        "body": "I know you are getting flack for this but I think you have a point - look at palisamo/ginetty at IBM buying back shares to hit their arbitrary EPS metric promise.\n\nThe company is the definition of stagnation so buy backs were a way to influence that metric.\n\nI worked at IBM during that time and it was and still is a terrible place for 75% of the employees, that money did nothing to change IBMs ability to be competitive in the market.\n\nI don't think buy backs are always negative but they are certainly a lever to pull and companies can pull that lever too much.",
        "created_utc": 1614705228,
        "id": "gpfmxzr",
        "permalink": "/r/investing/comments/lw3v1m/warren_buffett_says_berkshires_apple_investment/gpfmxzr/",
        "score": 2,
        "subreddit": "investing",
        "created": 1614734028.0
    },
    {
        "author": "ilinula",
        "body": "IBM generates plenty of cash to cover its high dividend as well as share buy backs. What does that have to do with their ability to be competitive in the market? Free cash flow yield is a completely different metric, and it returns more value to shareholders for a company that is stagnating or declining. It's perfectly reasonable for them to buy back shares instead of sit on cash. I would prefer to hold a company like this than one that continually is able to be 'competitive in the market' but doesn't generate any cash so it has to issue shares year-over-year in order to supplement it's growth",
        "created_utc": 1614707972,
        "id": "gpft96t",
        "permalink": "/r/investing/comments/lw3v1m/warren_buffett_says_berkshires_apple_investment/gpft96t/",
        "score": 2,
        "subreddit": "investing",
        "created": 1614736772.0
    },
    {
        "author": "acppanday",
        "body": "IBM - it’s the hottest stock on the market",
        "created_utc": 1614711556,
        "id": "gpg1lp2",
        "permalink": "/r/wallstreetbets/comments/lw9kxm/a_picture_is_worth_a_thousand_words_next_stop_65/gpg1lp2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614740356.0
    }
]