[
    {
        "author": "hi-imBen",
        "body": "A)  They are trying to say the semiconductor shortage could be manufactured (intentionally shutting down factories/restricting supply to increase the price they can charge).  While this isn't an insane theory, it is not what is happening now.\n\n\nB)  Doesn't look like they are talking about any one stock specifically, but the semiconductor industry.\n\n\nC)  Please buy all the semiconductor stocks/ETFs I'm holding :)   ADI, MXIM, MCHP, TXN, SITM, MPWR, ON, NXPI, MRVL, QCOM, XLNX, SOXX, PSI, SMH",
        "created_utc": 1614809529,
        "id": "gpl38tb",
        "permalink": "/r/wallstreetbets/comments/lx4mu4/chip_shorttage_real_or_memorex/gpl38tb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614838329.0
    },
    {
        "author": "Amazing_Succotash677",
        "body": "AMD is still a buy, really anywhere below 90 imo, QCOM, AVGO, TXN, ADI all good value at current price",
        "created_utc": 1615928016,
        "id": "gr5yiv2",
        "permalink": "/r/ValueInvesting/comments/m6a9tc/looking_for_another_chip_company/gr5yiv2/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615956816.0
    },
    {
        "author": "East-Art1510",
        "body": "As a DIYer, I always had a sentimental connection to ADI, HON, MCPH, MXIM, and TXN. Lots of nice parts in their catalogs. They seem a bit overvalued right now though.",
        "created_utc": 1615906387,
        "id": "gr4mchv",
        "permalink": "/r/ValueInvesting/comments/m6a9tc/looking_for_another_chip_company/gr4mchv/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615935187.0
    },
    {
        "author": "bonejohnson8",
        "body": "TER - Teradyne DD - the name means a very powerful force. 1,000,000,000,000 dynes = 10 meganewtons (2,248,089 pounds-force or 1,019,716 kilograms-force). Now that's a lot of damage. \n\nTheir customers include Samsung, Qualcomm, Intel, Analog Devices, Texas Instruments and IBM.  They make automatic test equipment, which I imagine is giving the SAT to semiconductors. This will make the robots smarter. Smarter robots = more money. They are at a discount right now, this is a play that simply cannot go tits up.",
        "created_utc": 1616883314,
        "id": "gsin9f4",
        "permalink": "/r/wallstreetbets/comments/mdx2d0/weekend_discussion_thread_for_the_weekend_of/gsin9f4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1616912114.0
    },
    {
        "author": "Squidster777",
        "body": "VIX cup and handle. VIX golden cross upcoming. Treasury yield spiking. S&amp;P head and shoulders. DIX bottoming out. Quad Witching 3/19. I suspect the crash will be set off during the final hour of March 19th, and the big kaboom will be the Monday and Tuesday following. Those drops will spike the VIX into golden cross and sending treasury yield past 3.00 where J Pow will be forced to increase rates, ultimately cratering it even more. \n\nDIX and ADI have shown that the market breadth has been on decline. Pretty good clues that the institutions have sold off already and now retail investors are beginning to sell off. Quad Witching will lead to true price discovery.\n\nSPY puts $300 6/27 exp",
        "created_utc": 1615175562,
        "id": "gq6bfql",
        "permalink": "/r/stocks/comments/m043o7/advice_literally_the_only_times_i_have_made_large/gq6bfql/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615204362.0
    },
    {
        "author": "Itsme_eljefe",
        "body": "I’m still here buying the chip dip...\n\nAMAT, ON, MRVL, ADI, TSM, AMD, MU, CRUS, MX, SOXL, DD, SLCA.\n\nThe chip boom is about to go atomic!\n\n😁 heard it here first",
        "created_utc": 1617004394,
        "id": "gsnz6dc",
        "permalink": "/r/wallstreetbets/comments/mf8mct/what_are_your_moves_tomorrow_march_29_2021/gsnz6dc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617033194.0
    },
    {
        "author": "CDNthrowaway123",
        "body": "Yeah, this. They have been aggressively growing top line by basically undercutting every CDN on pricing. Basement level pricing for CDNs is not a viable long term strategy. They really changed their tune to security this earnings call which basically shows they know that they need to start getting away from pure traffic delivery, but they don’t have anywhere near the security portfolio that Akamai or Cloudflare can offer.  I work in the field and operationally the network is nothing special and they have a huge gap to make up when it comes to being able to compete in the security space.",
        "created_utc": 1614739712,
        "id": "gphp97d",
        "permalink": "/r/investing/comments/lw5uow/fastly_fsly_full_due_diligence_post_promising/gphp97d/",
        "score": 9,
        "subreddit": "investing",
        "created": 1614768512.0
    },
    {
        "author": "FDaHBDY8XF7",
        "body": "Amazon, Microsoft, and Google are hardly competitors. They offer cloud infrastructure (API's, virtual boxes, web services, etc. ). Cloudflare and its main competitors, Fastly and Akamai, focus on their Content Delivery Networks (CDN).\n\nAkamai was the first and is the largest CDN, but they use old technology and are making questionable choices for management positions. They are kind of old news.\n\nFastly and Cloudlfare started around the same time, but Cloudflare focused on scale and marketing, while Fastly focused on efficiency.\nFastly has the fewest Point of Presences, but more than made up for it with their incredibly efficient and powerful design. They seem to be dominating in the edge computing world with their compute@edge project, but Cloudflare isnt far behind. Fastly's founder and CEO stepped back last year to focus on the technology. In the past they have struggled to land large contracts due to lack of exposure, but I think their new CEO, and the proven performance are turning that around. Cloudflare is used by a lot of websites, probably most, but to name a few notable contracts for Fastly there is Shopify, Spotify, A&amp;E, Vimeo, Imgur, and many more. Also, to emphasize why Amazon and Microsoft arent competitors, Fastly is used by Github, and at least the Amazon Prime website. Unfortunately, TikTok was their biggest client before politics had to end that, which is a large part of why they missed earnings in Q4. Faslty's business model is also based on usage, which obviously has its pros and cons for the users, but leads toward an unsteady income and a bit of a concern for investors.\n\nCloudflare is way better than Akamai, way larger than Fastly, and more well known than both, but I think they are already the big dog. Sure they will grow, sure they will do well, sure they have more consistent revenue, but Fastly has much more room to grow, and much more reason to. I think Cloudflare is a solid stable company. Fastly has a stronger product, but they havent quiet found the support to become stable yet, I think that is coming.\n\nFastly is my largest holding, but then again I am a noobie, what do I know.",
        "created_utc": 1614835563,
        "id": "gpmg4ib",
        "permalink": "/r/stocks/comments/lwt9oz/what_stocks_do_you_believe_are_currently/gpmg4ib/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614864363.0
    },
    {
        "author": "pdmalo",
        "body": "Buying pure storage pstg tomorrow.  Holding Akamai.",
        "created_utc": 1615256981,
        "id": "gqa9c0m",
        "permalink": "/r/stocks/comments/m0ohdg/whats_the_reason_that_tech_is_just_taking_a/gqa9c0m/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615285781.0
    },
    {
        "author": "jake_cake_48",
        "body": "Feel like catching the knife's edge tomorrow fsly net akam",
        "created_utc": 1615270637,
        "id": "gqav2an",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqav2an/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615299437.0
    },
    {
        "author": "Day2205",
        "body": "Akamai is built on extremely outdated tech",
        "created_utc": 1614724971,
        "id": "gpgweg7",
        "permalink": "/r/stocks/comments/lw5xoa/fastly_fsly_full_due_diligence_post_promising/gpgweg7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614753771.0
    },
    {
        "author": "asapmatthew",
        "body": "NET is primarily a CDN. Their main competition is AKAM (Akamai)",
        "created_utc": 1614832045,
        "id": "gpmajjp",
        "permalink": "/r/stocks/comments/lwt9oz/what_stocks_do_you_believe_are_currently/gpmajjp/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614860845.0
    },
    {
        "author": "Shrek-nado",
        "body": "Aww man. Not NET. This same thing happened with “edge computing” in the 90s/2000 with Akamai",
        "created_utc": 1615278626,
        "id": "gqb3zq7",
        "permalink": "/r/investing/comments/lypic3/why_cathie_woods_once_hot_ark_innovation_etf_has/gqb3zq7/",
        "score": 1,
        "subreddit": "investing",
        "created": 1615307426.0
    },
    {
        "author": "Infinite-Professor-1",
        "body": "As someone who works with Akamai daily and who demoed fastly, yeah that's just not true.\n\nAkamai's rich media accelerator, and download delivery products completely destroy fastly's product, they're not even playing the same game lol. \n\nAkamai's product line is pretty much industry best in class.",
        "created_utc": 1614727311,
        "id": "gph16co",
        "permalink": "/r/stocks/comments/lw5xoa/fastly_fsly_full_due_diligence_post_promising/gph16co/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614756111.0
    },
    {
        "author": "Hotpocketsand",
        "body": "Tech bleeds, AKAM rises?  makes sense.",
        "created_utc": 1615822661,
        "id": "gr0t14w",
        "permalink": "/r/wallstreetbets/comments/m5hbpf/daily_discussion_thread_for_march_15_2021/gr0t14w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615851461.0
    },
    {
        "author": "meangenehackman",
        "body": "AKAM over 100?  this is a sign of the apocalypse.",
        "created_utc": 1615304044,
        "id": "gqc5j06",
        "permalink": "/r/wallstreetbets/comments/m144ua/daily_discussion_thread_for_march_09_2021/gqc5j06/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615332844.0
    },
    {
        "author": "futureIsYes",
        "body": "First week update.\n\nGot out of these with break even or little profit \n\nNetflix \nEHTH\nGood Natured products\n\n\nPut a limit sell order on these to exit on break even: \n\nKinder Morgan\nAkamai\nExact sciences\nOne\nLulu\nButterfly",
        "created_utc": 1615617363,
        "id": "gqrzcee",
        "permalink": "/r/stocks/comments/m22p06/help_me_trim_my_porfolio_i_want_to_have_max_10/gqrzcee/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615646163.0
    },
    {
        "author": "Infinite-Professor-1",
        "body": "The largest competitor is Akamai, which absolutely crushes them in features on the platform, as well as raw horse power. \n\nThis is a tough market.",
        "created_utc": 1614724070,
        "id": "gpguipd",
        "permalink": "/r/stocks/comments/lw5xoa/fastly_fsly_full_due_diligence_post_promising/gpguipd/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1614752870.0
    },
    {
        "author": "Moral_Insanity",
        "body": "General Grades you bunch of morons\n\n&amp;#x200B;\n\n **Others:**\n\n* Adobe (ADBE) resumed with an Outperform at Credit Suisse; tgt $575\n* Akamai Tech (AKAM) resumed with a Neutral at Credit Suisse; tgt $115\n* Autodesk (ADSK) resumed with an Outperform at Credit Suisse; tgt $340\n* Bill.com (BILL) initiated with a Neutral at Susquehanna; tgt $160\n* Check Point Software (CHKP) resumed with a Neutral at Credit Suisse; tgt $125\n* CrowdStrike (CRWD) resumed with a Neutral at Credit Suisse; tgt $225\n* Datadog (DDOG) resumed with a Neutral at Credit Suisse; tgt $115\n* Datto Holding (MSP) resumed with a Neutral at Credit Suisse; tgt $33\n* Domo (DOMO) resumed with a Neutral at Credit Suisse; tgt $75\n* D.R. Horton (DHI) initiated with an Outperform at Wolfe Research; tgt $94\n* East West Banc (EWBC) initiated with a Buy at Jefferies; tgt $89\n* Fastly (FSLY) resumed with a Neutral at Credit Suisse; tgt $90\n* Forestar (FOR) initiated with an Outperform at Wolfe Research\n* Fortinet (FTNT) resumed with a Neutral at Credit Suisse; tgt $165\n* Intuit (INTU) resumed with an Outperform at Credit Suisse; tgt $460\n* KB Home (KBH) initiated with an Outperform at Wolfe Research\n* MDC Holdings (MDC) initiated with a Peer Perform at Wolfe Research\n* Meritage (MTH) initiated with a Peer Perform at Wolfe Research\n* Microsoft (MSFT) resumed with an Outperform at Credit Suisse; tgt $265\n* NortonLifeLock (NLOK) resumed with a Neutral at Credit Suisse; tgt $24\n* NVR (NVR) initiated with a Peer Perform at Wolfe Research\n* Oracle (ORCL) resumed with an Outperform at Credit Suisse; tgt $77\n* Otis Worldwide (OTIS) initiated with a Buy at Berenberg; tgt $85\n* PagerDuty (PD) resumed with a Neutral at Credit Suisse; tgt $42\n* Palantir Technologies (PLTR) resumed with an Underperform at Credit Suisse; tgt $20\n* Palo Alto Networks (PANW) resumed with an Outperform at Credit Suisse; tgt $425\n* Ping Identity (PING) resumed with a Neutral at Credit Suisse; tgt $30\n* PulteGroup (PHM) initiated with a Peer Perform at Wolfe Research\n* Roblox (RBLX) initiated with a Buy at Stifel; tgt $85\n* Salesforce (CRM) resumed with an Outperform at Credit Suisse; tgt $260\n* Savara (SVRA) initiated with an Overweight at Piper Sandler; tgt $7\n* ServiceNow (NOW) resumed with an Outperform at Credit Suisse; tgt $615\n* Shopify (SHOP) resumed with a Neutral at Credit Suisse; tgt $1350\n* Slack (WORK) resumed with a Neutral at Credit Suisse; tgt $45\n* Snowflake (SNOW) resumed with a Neutral at Credit Suisse; tgt $275\n* SolarWinds (SWI) resumed with a Neutral at Credit Suisse; tgt $16\n* Splunk (SPLK) resumed with an Outperform at Credit Suisse; tgt $200\n* SS&amp;C Techs (SSNC) resumed with an Outperform at Credit Suisse; tgt $74\n* Taylor Morrison Home (TMHC) initiated with a Peer Perform at Wolfe Research\n* TechTarget (TTGT) initiated with a Market Perform at Cowen; tgt $86\n* Toll Brothers (TOL) initiated with a Peer Perform at Wolfe Research\n* TRI Pointe Homes (TPH) initiated with a Peer Perform at Wolfe Research\n* VMware (VMW) resumed with a Neutral at Credit Suisse; tgt $170\n* Workday (WDAY) resumed with a Neutral at Credit Suisse; tgt $235\n* ZoomInfo (ZI) resumed with an Outperform at Credit Suisse; tgt $70\n* Zoom Video (ZM) resumed with an Underperform at Credit Suisse; tgt $375\n* Zscaler (ZS) resumed with an Outperform at Credit Suisse; tgt $230",
        "created_utc": 1615904835,
        "id": "gr4j0xr",
        "permalink": "/r/wallstreetbets/comments/m65k4x/daily_discussion_thread_for_march_16_2021/gr4j0xr/",
        "score": -3,
        "subreddit": "wallstreetbets",
        "created": 1615933635.0
    }
]