[
    {
        "author": "WAGatorGunner",
        "body": "I said f it and sold most of my penny stocks about a month ago. Bought appl, intel, ibm, nem, clf and a few others. It is so much less stressful but definitely not going to hit that big one then. Luckily I did make some decent money on ABML and NSAV first.",
        "created_utc": 1618959332,
        "id": "gv9egvu",
        "permalink": "/r/pennystocks/comments/mv241k/not_checking_my_portfolio_for_a_month/gv9egvu/",
        "score": 34,
        "subreddit": "pennystocks",
        "created": 1618988132.0
    },
    {
        "author": "arikevs",
        "body": "“I think tech up tomorrow because of positive ibm earnings but don’t quote me lmao” - u/Krisboogy",
        "created_utc": 1618882513,
        "id": "gv5j5gw",
        "permalink": "/r/wallstreetbets/comments/mu949r/what_are_your_moves_tomorrow_april_20_2021/gv5j5gw/",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1618911313.0
    },
    {
        "author": "Mindfucker223",
        "body": "People sad the same about ibm and yahoo and like 10 other companies, and where are they now?",
        "created_utc": 1619080390,
        "id": "gvf96xs",
        "permalink": "/r/investing/comments/mvxcml/apple_to_boost_ads_business_as_iphone_changes/gvf96xs/",
        "score": 18,
        "subreddit": "investing",
        "created": 1619109190.0
    },
    {
        "author": "cloudyoutside",
        "body": "Guys stop don’t look at GME here *waves IBM frantically* look! This is a nice stock :) see? That’s nice huh?",
        "created_utc": 1619457400,
        "id": "gvy912b",
        "permalink": "/r/wallstreetbets/comments/myu6q2/daily_discussion_thread_for_april_26_2021/gvy912b/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1619486200.0
    },
    {
        "author": "Lousy_hater",
        "body": "&gt; I work in the tech industry and our wages are pretty high comparatively. I'm more worried about us following what happened to California than anything\n\nMaybe for certain company but I worked at IBM till January and my wage was $88k while my colleague who did same work as me with same salary level earned $100k+ in Texas.",
        "created_utc": 1619565479,
        "id": "gw3zc7q",
        "permalink": "/r/CanadianInvestor/comments/mzy108/netflix_chooses_toronto_for_its_canadian/gw3zc7q/",
        "score": 16,
        "subreddit": "CanadianInvestor",
        "created": 1619594279.0
    },
    {
        "author": "cokegum",
        "body": "IBM up 3% after hours. Something is wrong in the universe",
        "created_utc": 1618874406,
        "id": "gv539x1",
        "permalink": "/r/wallstreetbets/comments/mu949r/what_are_your_moves_tomorrow_april_20_2021/gv539x1/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1618903206.0
    },
    {
        "author": "AAAStarTrader",
        "body": "PLTR earnings on 11th May... ARK Invest still buying... q4 results forecast high growth this year. Given other tech results this week, I think PLTR could break out and end in the 26-28 range (or higher if the IBM partnership has started to drive global revenue already). 🚀",
        "created_utc": 1619607747,
        "id": "gw5pxcz",
        "permalink": "/r/wallstreetbets/comments/n0bepa/daily_discussion_thread_for_april_28_2021/gw5pxcz/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1619636547.0
    },
    {
        "author": "Krisboogy",
        "body": "I think tech up tomorrow because of positive ibm earnings but don’t quote me lmao",
        "created_utc": 1618882439,
        "id": "gv5j01d",
        "permalink": "/r/wallstreetbets/comments/mu949r/what_are_your_moves_tomorrow_april_20_2021/gv5j01d/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1618911239.0
    },
    {
        "author": "Important-Noise-6241",
        "body": "Guys, IBM about to fly too",
        "created_utc": 1619738324,
        "id": "gwcy9ws",
        "permalink": "/r/wallstreetbets/comments/n1ge8w/my_first_yolo_20k_in_t_stock/gwcy9ws/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1619767124.0
    },
    {
        "author": "JaspergeInEigenVocht",
        "body": "...IBM is partnered with PLTR",
        "created_utc": 1618863928,
        "id": "gv4ggqq",
        "permalink": "/r/stocks/comments/mtwwxf/rstocks_daily_discussion_monday_apr_19_2021/gv4ggqq/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1618892728.0
    },
    {
        "author": "paul__k",
        "body": "GOOGL, MSFT, IBM, and ORCL have all been trying to take on AWS, mostly with varying degrees of success. This Trump thing is going to be the first and only SPAC ever to file for bankruptcy pre merger.",
        "created_utc": 1619726427,
        "id": "gwc75q9",
        "permalink": "/r/SPACs/comments/n17der/trump_spac_alert_trump_pitched_on_launching_a/gwc75q9/",
        "score": 11,
        "subreddit": "SPACs",
        "created": 1619755227.0
    },
    {
        "author": "metallica11",
        "body": "It's april 16th 2022. \n\nGrowth stocks have continued to bleed, led by the chip shortage and rotation into value plays. the sentiment has moved past denial, anger, frustration straight into full acceptance. \n\nThe Dow is approaching 37,000. spy 500. Your boomer uncle Randy is mocking you daily as his IBM, JP morgan, Honeywell, and Cheesecake factory play has doubled since Feb 2021. \n\nyou look at your growth positions, now down 50% from february ATHs. Nio fizzling at 22, PLTR hovering around 15. TSLA struggling to break 600. WSB has reduced down to 3 million members, mostly bears. \n\nthe growth run up in nov 2020-feb 2021 now just registers as a brief, mini spike in the grand scheme of stocks the past 1.5 years. You didn't buy the dip. you bought the falling knife off a mountain that was never climbed again. \n\nGiving up, you rotate all your plays into SPY, close your fidelity app, and vow to never trade individual stocks again. \n\n\"This is the way\". \"This is the way\".  you mutter to yourself.",
        "created_utc": 1618601026,
        "id": "gurcby4",
        "permalink": "/r/stocks/comments/mrzmk2/rstocks_daily_discussion_fundamentals_friday_apr/gurcby4/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1618629826.0
    },
    {
        "author": "Space_Lord_MF",
        "body": "BlackBerry QNX has design wins with 23 of the world’s top 25 Electric Vehicle OEMs, who together have 68% of the EV market. This has increased from 19 of the top 25 last quarter.\n\nBlackBerry expands its partnership with Baidu to power next generation autonomous driving technology.\n\nScania chooses BlackBerry QNX as the safety critical operating system and hypervisor in its next generation of heavy goods vehicles.\n\nSony announces at CES that its Vision-S car will use BlackBerry® QNX® technology.\n\nBlackBerry and IBM integrate BlackBerry® Protect, BlackBerry® Optics and IBM QRadar.\n\nBlackBerry QNX Black Channel Communications to be used in Motional’s driverless platform.\n\nBlackBerry QNX working with Android Open Source Project (AOSP) for virtualization in automotive digital cockpits\n\nBlackBerry SecuSUITE® for Government is now used by 18 governments. BlackBerry Jarvis™ named ‘Best in Breed’ tool to protect mission critical software supply chains.\n\nBlackBerry 2021 annual threat report uncovers breadth of COVID-19 exploitation.\n\nBlackBerry IVY also made encouraging progress, with positive engagement from a number of leading automakers and the launch of our BlackBerry IVY Innovation Fund.” said John Chen, Executive Chairman &amp; CEO, BlackBerry.\n\nBlackBerry named a leader in 2021 IDC marketscape UEM",
        "created_utc": 1617650278,
        "id": "gthie9t",
        "permalink": "/r/wallstreetbets/comments/mkh463/daily_discussion_thread_for_april_05_2021/gthie9t/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1617679078.0
    },
    {
        "author": "desquibnt",
        "body": "I'm up about 15% with the dip buying but sure, your point stands. \n\nYou're obviously not the first IBM pessimist ever but there is a runway here and the legacy IT business is still weighing down the share price. \n\nIMO, the current valuation is very attractive for the long term investor.",
        "created_utc": 1618879473,
        "id": "gv5d9oh",
        "permalink": "/r/stocks/comments/mudaxr/ibm_ibm_reports_eps_of_177_against_consensus/gv5d9oh/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1618908273.0
    },
    {
        "author": "lattiboy",
        "body": "IBM: we’re what Planatir pretends to be!",
        "created_utc": 1618863266,
        "id": "gv4exko",
        "permalink": "/r/stocks/comments/mtwwxf/rstocks_daily_discussion_monday_apr_19_2021/gv4exko/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1618892066.0
    },
    {
        "author": "shiverstar",
        "body": "Are we going back in time? IBM and Xerox were a boomer's delight.",
        "created_utc": 1618874446,
        "id": "gv53cxp",
        "permalink": "/r/wallstreetbets/comments/mu949r/what_are_your_moves_tomorrow_april_20_2021/gv53cxp/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1618903246.0
    },
    {
        "author": "-------I-------",
        "body": "IBM has tried this with Watson Oncology without great success. I wish them good luck and it seems like a great idea, just not a feasible one.",
        "created_utc": 1619720780,
        "id": "gwbslve",
        "permalink": "/r/stocks/comments/n14tdv/palantirs_new_joint_venture_looks_to_tear_down/gwbslve/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1619749580.0
    },
    {
        "author": "Disastrous_Implement",
        "body": "Translated to English:\n\nPalantir Technologies (NYSE: PLTR ) offers data analysis software to clients. Founded in 2013, the company works with government agencies to collect and analyze data in order to make decisions. His clients include the CIA and the FBI. The PLTR share got off to a great start this year as its software was adopted by commercial customers.\n\nOver the past few years, companies have understood the importance of data and it is changing the way business is done. PLTR stock has recently shown volatility. It peaked at $ 45 in January and is currently trading at around $ 23.\n\nDespite the decline, the title seems attractive to me. It's a long-term buy with long-term growth prospects.\n\nGiven the demand for data analysis in the country, the recent drop is a great opportunity to add the stock to your portfolio. Here's why PLTR stock needs to be on your radar.\n\nPalantir has a huge market\nWith a market cap of $ 32 billion, PLTR stock may appear overvalued. The company has not reported a profit over the years, but there is a huge opportunity for growth that justifies the valuation. Palantir's business is very relevant today as business companies have realized the importance of data.\n\nThe company is making great strides in the market and has signed several contracts in recent months. The company recently signed contracts with IBM (NYSE: IBM ) and Amazon (NASDAQ: AMZN ) AWS. It only gained part of the market share, which means that there is huge potential for growth.\n\nPalantir reported over $ 1 billion in revenue for 2020 and fourth quarter revenue was $ 332.1 million, up from $ 229.36 million a year ago . Having signed 21 deals worth over $ 5 million, Palantir holds a strong position in the industry. The demand for data only increases from here and the company has the right software to meet the needs. The company plans to reach $ 4 billion in revenue by 2024 with a growth rate of 30%.\n\nStrong fundamentals coupled with growth opportunities make PLTR stocks a great buy right now.\n\nGovernment clients mean stability\nPalantir has had a lot of backlash for focusing on government contracts, but what's wrong? The company is well positioned in the industry as a provider of data analysis services for some of the major government agencies. The government sector generated 85% of total revenues in Q4 2020, or $ 132 million.\n\nThe government's demands will only increase in the years to come. Palantir is already working with NHS, the UK's public healthcare network, and there is no doubt that he will soon be an integral part of the US government. Recently, on April 22, the company was appointed as the UK Crown Business Services Provider.\n\nGovernment contracts are synonymous with stability and constant income.\n\nThe Bottom Line on PLTR Stock Cathie Wood's ARK Investir recently bought 1.1 million shares of PLTR. This is not the first time that the investment firm has bought PLTR shares.\n\nThe recent volatility of PLTR stocks offers a perfect opportunity for investors looking to add it to their portfolio. A huge amount of data needs to be stored and analyzed, and the demand for Palantir's software will only increase. With one foot in the government sector and the other in the commercial sector, Palantir Technologies is well positioned to conquer the market. He has a huge growth track for the next two years.\n\nI have been optimistic about Palantir in the past and reiterate my optimistic position today. The company reports its first quarter 2021 results on May 18.\n\nPLTR stock is a long term buy and hold.\n\nAt the date of publication, Vandita Jadeja did not hold (neither directly nor indirectly) any position in the securities mentioned in this article.",
        "created_utc": 1619611346,
        "id": "gw5uzzh",
        "permalink": "/r/stocks/comments/n0cxbh/stock_pltr_palantir_prêt_à_fournir_des_rendements/gw5uzzh/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1619640146.0
    },
    {
        "author": "Applesauce9210",
        "body": "Those $IBM earnings 💦💦💦. Boomer stocks 💦🚀💦",
        "created_utc": 1618876788,
        "id": "gv57zox",
        "permalink": "/r/wallstreetbets/comments/mu949r/what_are_your_moves_tomorrow_april_20_2021/gv57zox/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1618905588.0
    },
    {
        "author": "saiaf",
        "body": "You, sir, are going places. How would you like a job with us at IBM?",
        "created_utc": 1619570429,
        "id": "gw497az",
        "permalink": "/r/pennystocks/comments/mzzu5d/hitif_about_to_break_out_folks_who_averaged_down/gw497az/",
        "score": 7,
        "subreddit": "pennystocks",
        "created": 1619599229.0
    },
    {
        "author": "Blyadhole",
        "body": "\"Yea bby, IBM and T are prrrrinting dividends\" - Boomers probably",
        "created_utc": 1619457482,
        "id": "gvy985d",
        "permalink": "/r/wallstreetbets/comments/myu6q2/daily_discussion_thread_for_april_26_2021/gvy985d/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1619486282.0
    },
    {
        "author": "Rangemon99",
        "body": "They just started getting corporate customers and as time goes on more and more corporations will want their product. BP claims they got $1B worth of value from the Foundry software last year. If more and more claims like this come out it’ll either be adopt the software or watch your competitors blow past you. \n\nThey have to grow a lot which i believe is probable but nothing is guaranteed. It’s never been a short term play, but they aren’t going anywhere, and recently paid off debt while getting increased credit from multiple banks. \n\nThey are industry agnostic and can work with pretty much any company on the planet. Additionally their partnerships with AWS and IBM are telling imo to their product being good",
        "created_utc": 1617847357,
        "id": "gtrfkzz",
        "permalink": "/r/options/comments/mmeucz/pltr_run_up_to_the_first_demo_day_a_coincidence/gtrfkzz/",
        "score": 7,
        "subreddit": "options",
        "created": 1617876157.0
    },
    {
        "author": "kupka316",
        "body": "IBM ticker looking like top thrill dragster at cedar point.",
        "created_utc": 1618864400,
        "id": "gv4hjzk",
        "permalink": "/r/wallstreetbets/comments/mu949r/what_are_your_moves_tomorrow_april_20_2021/gv4hjzk/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1618893200.0
    },
    {
        "author": "ShiftBunny",
        "body": "IBM earnings in:. Shitty, but not as shitty as expected",
        "created_utc": 1618864720,
        "id": "gv4iaep",
        "permalink": "/r/wallstreetbets/comments/mu949r/what_are_your_moves_tomorrow_april_20_2021/gv4iaep/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1618893520.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "Death, taxes and IBM underperforming",
        "created_utc": 1618858449,
        "id": "gv43xrp",
        "permalink": "/r/wallstreetbets/comments/mtxaus/daily_discussion_thread_for_april_19_2021/gv43xrp/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1618887249.0
    },
    {
        "author": "PotentialFun3",
        "body": "And dividend stocks.  I'm paranoid so this year I bought things like T, ENB, MO, and IBM.  They're way up plus high dividends.  Apparently a lot of other investors are as paranoid as me.",
        "created_utc": 1618592919,
        "id": "guqu36d",
        "permalink": "/r/stocks/comments/ms71dg/someone_explain_the_madness_what_is_going_on/guqu36d/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1618621719.0
    },
    {
        "author": "surmoiFire",
        "body": "IBM earnings: cloud division beats expectation, good news for other growth cloud stocks as well",
        "created_utc": 1618867827,
        "id": "gv4pe6r",
        "permalink": "/r/wallstreetbets/comments/mu949r/what_are_your_moves_tomorrow_april_20_2021/gv4pe6r/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1618896627.0
    },
    {
        "author": "AAAStarTrader",
        "body": "PLTR looking good for 26-28 range at 11th May earnings. ARK Invest are still in and IBM partnership should start to show in revenue growth soon. Q4 call predicted strong growth this year and tech stocks are performing well this quarter. \n\nPLTR could break 24 today/tomorrow imo",
        "created_utc": 1619612704,
        "id": "gw5x80h",
        "permalink": "/r/wallstreetbets/comments/n0bepa/daily_discussion_thread_for_april_28_2021/gw5x80h/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1619641504.0
    },
    {
        "author": "Ctofaname",
        "body": "I buy ibm just for the dividend and stable floor on the price. The world can be collapsing and IBM stock moves 3 cents. I buy on regular intervals and DCA in one account. At the rate I fund it it's like my 3rd hedge for retirement at 65. Then my other account is my real money maker and yolos lol. If the yolos fail I have two stable retirements for 65 then my wife's as well. If my yolos succeed we suck that date in sooner.",
        "created_utc": 1618886010,
        "id": "gv5pvu9",
        "permalink": "/r/stocks/comments/mudaxr/ibm_ibm_reports_eps_of_177_against_consensus/gv5pvu9/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1618914810.0
    },
    {
        "author": "widespreadhammocks",
        "body": "anybody make money on IBM or DELL?  DELL was mooning for like 3 days straight",
        "created_utc": 1619151542,
        "id": "gvj4jlh",
        "permalink": "/r/wallstreetbets/comments/mwdc90/what_are_your_moves_tomorrow_april_23_2021/gvj4jlh/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1619180342.0
    },
    {
        "author": "OlyBomaye",
        "body": "IBM has a free float of 890 million shares.\n\nNot ape advice",
        "created_utc": 1618878360,
        "id": "gv5b33a",
        "permalink": "/r/wallstreetbets/comments/mu949r/what_are_your_moves_tomorrow_april_20_2021/gv5b33a/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1618907160.0
    },
    {
        "author": "FishnMagician",
        "body": "by any chance have you worked with or do you work for IBM India",
        "created_utc": 1618514743,
        "id": "gun1cip",
        "permalink": "/r/wallstreetbets/comments/mrbmfj/daily_discussion_thread_for_april_15_2021/gun1cip/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1618543543.0
    },
    {
        "author": "thats_your_name_dude",
        "body": "IBM.",
        "created_utc": 1619041534,
        "id": "gvdh9l9",
        "permalink": "/r/stocks/comments/mvokhi/worst_companies_in_the_various_markets/gvdh9l9/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619070334.0
    },
    {
        "author": "desquibnt",
        "body": "I like it solely because of the acquisition of Red Hat and the spin off of the legacy IT consulting business. \n\nCloud revenue was up massive last quarter and that's where they're taking the company. I think they have a competitive advantage over AWS or Azure with their hybrid cloud approach. Honestly, I doubt they ever get to be a real threat to Azure or AWS for market share but that cloud services market is huge. You don't need to directly compete with the giants to be successful.\n\nAt the end of this spinoff, it'll basically be Red Hat rebranded as IBM",
        "created_utc": 1619046640,
        "id": "gvdryog",
        "permalink": "/r/stocks/comments/mvpf24/thoughts_on_ibm/gvdryog/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619075440.0
    },
    {
        "author": "Applesauce9210",
        "body": "Boomer stocks I will never forsake you again. $F, $PG, $IBM, $KO, I’m coming home.",
        "created_utc": 1618507072,
        "id": "gumjpyn",
        "permalink": "/r/SPACs/comments/mraikr/announcements_x_daily_discussion_for_apr152021/gumjpyn/",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1618535872.0
    },
    {
        "author": "Fawkesharry",
        "body": "I work at IBM and I can tell you they're doing heavy research on quantum computing. Just recently they started offering internal quantum developing trainings for their employees. Mind you the field on its own is still years away of becoming a business model.",
        "created_utc": 1618517036,
        "id": "gun6p7d",
        "permalink": "/r/stocks/comments/mrkf5u/best_quantum_computing_stock/gun6p7d/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1618545836.0
    },
    {
        "author": "Investing8675309",
        "body": "I am one of the biggest IBM downers around but their latest earnings impressed me and I would buy them more as a bet on Krishna - IBM tends to get savior CEOs when they’re near death.\n\nThe bad is their stock price is about where it was 5 years ago and 10 years ago. I’d rather have a growing company. Their earnings have also been on a downward trend over the last few years so you can only get so much dividend out of that. \n\nIn tech IBM cloud is a joke. They will not be able to compete long term against the hyperscale CSPs. I think that’s why Krishna is spinning off their infra business. I do think they have a future as a custom solutions provider that uses cloud.\n\nQuantum is a long ways off, I’m pretty biased but I also don’t see IBM a winner in this category because - riddle me this, what was the last technology IBM grabbed by the horns and took a leading position in? It was mainframes under Lou Gerstner nearly 30 years ago. No way their more agile competitors are going to let quantum go to IBM. Just look at how they did with Watson.\n\nAnyways, I personally don’t touch IBM and that is probably my internal biases working against me because I’m in tech. However, I genuinely have been impressed by Krishna so far. If you buy them it is a bet on him to turn the ship. I am watching to see if there is an exodus of executives and if he starts cleaning house which they sorely need.",
        "created_utc": 1619053092,
        "id": "gve4x2x",
        "permalink": "/r/stocks/comments/mvpf24/thoughts_on_ibm/gve4x2x/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1619081892.0
    },
    {
        "author": "-Mr-Draco-",
        "body": "I’m going in the navy hopefully but on the side I was going to put money in Tesla as a long term investment some of the ones I’m guessing on is Microsoft and Sony because Im sure the demand will continue after but I forgot too that Disney is really good but expensive. My mom said IBM because they’ve been around forever",
        "created_utc": 1618626593,
        "id": "gusqt2j",
        "permalink": "/r/wallstreetbets/comments/mshwja/going_blind/gusqt2j/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1618655393.0
    },
    {
        "author": "financialsfyi",
        "body": "Top mentions on r/stocks today (Not investment advice)\n\n|Symbol|Total Mentions|\n|:-|:-|\n|COIN|45|\n|VTI|34|\n|GME|33|\n|TSM|32|\n|AAPL|22|\n|SPCE|19|\n|VOO|19|\n|SPY|18|\n|PLUG|18|\n|PLTR|17|\n|NIO|16|\n|MSFT|15|\n|AMD|13|\n|ARKF|12|\n|ICLN|12|\n|FCEL|11|\n|DKNG|10|\n|TSLA|10|\n|JNJ|9|\n|QQQ|9|\n|FB|8|\n|AMZN|8|\n|BB|8|\n|IBM|7|\n|WMT|7|\n|JPM|6|\n|ARKK|6|\n|SKLZ|6|\n|ARKG|6|\n|UWMC|6|",
        "created_utc": 1618527149,
        "id": "gunsslp",
        "permalink": "/r/stocks/comments/mrb95v/rstocks_daily_discussion_options_trading_thursday/gunsslp/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1618555949.0
    },
    {
        "author": "Bengbab",
        "body": "Buy IBM",
        "created_utc": 1617309722,
        "id": "gt2lv3u",
        "permalink": "/r/wallstreetbets/comments/mi3t1v/weekend_discussion_thread_for_the_weekend_of/gt2lv3u/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617338522.0
    },
    {
        "author": "dellarouche",
        "body": "IBM is coming back, or they are trying to with the acquisition of Red Hat.  It's a huge acquisition so they are probably just now getting ldap/ad integrated so everyone can be cc'ed on emails.  Red Hat is king of OSS and they have core linux distros in RHEL plus IBM's enterprise mainframe and various cloud offerings.  Red Hat is very strong in on-prem so this move was supposed to bridge the gap.  \n\nAs anyone who works in the business will tell you, IBM is definitely worth keeping an eye out for now.  Red Hat's board will not allow itself to get acquired by just anybody.  They passed on microsoft and amazon for takeover.",
        "created_utc": 1619044465,
        "id": "gvdnhc8",
        "permalink": "/r/stocks/comments/mvpf24/thoughts_on_ibm/gvdnhc8/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1619073265.0
    },
    {
        "author": "quarantrader",
        "body": "IBM shares",
        "created_utc": 1619282620,
        "id": "gvq4chd",
        "permalink": "/r/wallstreetbets/comments/mx3qzw/weekend_discussion_thread_for_the_weekend_of/gvq4chd/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1619311420.0
    },
    {
        "author": "badgebruce",
        "body": "As Mr. Krishna stated IBM is off to a solid start for 2021 and has confidence for the rest of this year. Good to see. Ex-dividend date is 07 May.",
        "created_utc": 1618879562,
        "id": "gv5dfzd",
        "permalink": "/r/stocks/comments/mudaxr/ibm_ibm_reports_eps_of_177_against_consensus/gv5dfzd/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1618908362.0
    },
    {
        "author": "mostlyeve",
        "body": "I guess billionaires, IBM, Microsoft, Visa, MasterCard, PayPal....... the list could go on, are all wrong and you sir are probably right.",
        "created_utc": 1619355569,
        "id": "gvtb72y",
        "permalink": "/r/CanadianInvestor/comments/my2rrg/is_there_any_way_to_put_a_long_term_put_on/gvtb72y/",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1619384369.0
    },
    {
        "author": "koolbro2012",
        "body": "Intel is run by old geezers like the ones at GE and IBM. They need to clean house.",
        "created_utc": 1619188777,
        "id": "gvkkda6",
        "permalink": "/r/wallstreetbets/comments/mwu5jy/amd_earnings_coming_for_at_long_term_winner/gvkkda6/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1619217577.0
    },
    {
        "author": "ceo_of_hooks",
        "body": "well even 5 years. just like there will be advanced in quantum computing, they'll be advances in cryptography.\n\nin short, we just dont know. \n\nit's possible that bitcoin goes down in flames because IBM creates a better quantum computer, but its also possible they never do and cracking sha256 stays impossible.",
        "created_utc": 1619810514,
        "id": "gwgkzfu",
        "permalink": "/r/StockMarket/comments/n1zdh8/bitcoin_is_facing_a_gotozero_moment_according_to/gwgkzfu/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1619839314.0
    },
    {
        "author": "mathsforlife",
        "body": "IBM puts. God I hope it tanks...",
        "created_utc": 1618785250,
        "id": "gv0nfhb",
        "permalink": "/r/wallstreetbets/comments/mtk7tt/what_are_your_moves_tomorrow_april_19_2021/gv0nfhb/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618814050.0
    },
    {
        "author": "DynastyNA",
        "body": "I think IBM Quantum Experience is amazing",
        "created_utc": 1619048697,
        "id": "gvdw44u",
        "permalink": "/r/stocks/comments/mvpf24/thoughts_on_ibm/gvdw44u/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619077497.0
    },
    {
        "author": "Laakhesis",
        "body": "That depends on its valuation because as of now, Palantir is 1/3 of IBM market cap and IBM has been in the game and profitable in decades.\nValuing Palantir at that price doesn’t make sense if we just look at fundamentals.\n\nThis stock might drop more if it is being judged by its fundamentals and profitability, not hype or news.",
        "created_utc": 1619176779,
        "id": "gvjyna0",
        "permalink": "/r/stocks/comments/mwq2dx/palantirs_stock_makes_a_bullish_break_whats_next/gvjyna0/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619205579.0
    },
    {
        "author": "chessiechoice",
        "body": "Power ball quick picks... IBM calls, HOG put sell, NFLX shraddle, LAM put credit spread, Snap calls. &lt;inverse to win&gt;",
        "created_utc": 1618633803,
        "id": "gut2n3h",
        "permalink": "/r/wallstreetbets/comments/msjo5o/most_anticipated_earnings_releases_for_the/gut2n3h/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618662603.0
    },
    {
        "author": "CharlieMonger",
        "body": "IBM and BP, both unfashionable, boomer stocks -  both posted strong earnings. Maybe something to do with them both using Palantir. BP even doing a large share buy back after very profitable quarter.",
        "created_utc": 1619592393,
        "id": "gw596pz",
        "permalink": "/r/wallstreetbets/comments/mzx686/what_are_your_moves_tomorrow_april_28_2021/gw596pz/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619621193.0
    },
    {
        "author": "badgebruce",
        "body": "Consider IBM Red Hat with the others.",
        "created_utc": 1619451086,
        "id": "gvxu1uw",
        "permalink": "/r/stocks/comments/mytrt7/rstocks_daily_discussion_monday_apr_26_2021/gvxu1uw/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619479886.0
    },
    {
        "author": "spinxter66",
        "body": "Apple, IBM, and Xerox for the win!",
        "created_utc": 1617724409,
        "id": "gtkyes3",
        "permalink": "/r/wallstreetbets/comments/ml9ho9/gme_megathread_for_april_06_2021/gtkyes3/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617753209.0
    },
    {
        "author": "ceo_of_hooks",
        "body": "IBM is boasting a 65 qubit quantum computer, while about 1500 qubits is the estimated requirement to hack Bitcoin private keys. \n\nToday's quantum computers have impractically-high error rates and can operate only in lab conditions at temperatures near absolute zero.\n\nI think bitcoin is pretty safe for the next few years.",
        "created_utc": 1619809722,
        "id": "gwgj9s9",
        "permalink": "/r/StockMarket/comments/n1zdh8/bitcoin_is_facing_a_gotozero_moment_according_to/gwgj9s9/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1619838522.0
    },
    {
        "author": "Malamonga1",
        "body": "easy to look at current winner's past. IBM was also at all time high in 2012 and never recovered.",
        "created_utc": 1619716812,
        "id": "gwbipa0",
        "permalink": "/r/stocks/comments/n17rke/hard_investing_times/gwbipa0/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619745612.0
    },
    {
        "author": "thejumpingsheep2",
        "body": "To add what many have said, MSFT is probably one of the better priced tech stocks. That said, the tech sector is in a bubble and if they fall, they will all fall. Keep that in mind.\n\nOn a fundamental level, MSFT has some headwind. The shift to cloud applications is actually not good for MSFT which thrives on enterprise computing and windows software. A cloud based setup is a lot like the old mainframe and dummy terminal approach of old days and in this case, the mainframe is worldwide access. This inherently means that you can do without Windows Servers in a lot of use cases. What used to be a staple (domain controller + active directory etc) is no longer required and as applications move to the internet.\n\nInternet servers and services (cloud) are easier and cheaper to manage. This is the main threat to MSFT. I know plenty of companies that simply use Google applications instead of rolling out Office. I know some companies who no longer bother providing a PC for everyone. That was unheard of not that long ago. Though I dont think thats a major threat due to office's legacy dominance, it is an example of how a cloud based app can replace MSFT software. There used to be a time when Outlook was a staple, now I am not even sure who uses it any more.\n\nYes MSFT itself is a cloud player, but Google and Amazon ate a ton of market share and other companies are trying to muscle in especially overseas where they have sentiment from their governments.\n\nAll in all, I like MSFT. I think they will be fine and I am sure they will keep buying stuff to stay relevant. But its not all roses and they made bad decisions in the past and are almost always a little behind the pack on innovations (though not as bad as IBM or Oracle). Beware of sector valuations.",
        "created_utc": 1619059908,
        "id": "gvei05e",
        "permalink": "/r/stocks/comments/mvu9dj/buy_msft_or_wait_until_after_earnings/gvei05e/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619088708.0
    },
    {
        "author": "starhockey36",
        "body": "I’m a financial analyst and we use Alteryx Server at work. Huge fan of  the software. We use it in conjunction with Tableau to create very flexible reports. \n\nIn our case, we pull data from IBM DB2 databases via Alteryx. We then combine the data from multiple DB2 databases and clean it up. Throw in some additional calculations and were able to spit it directly into Tableau for dynamic visual reporting.",
        "created_utc": 1618863335,
        "id": "gv4f3cp",
        "permalink": "/r/wallstreetbets/comments/mu7wog/quick_dd_alteryx_ayx_the_less_sexy_palantir_for/gv4f3cp/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618892135.0
    },
    {
        "author": "BoomerImpairedShtSux",
        "body": "IBM not as shitty as usual earnings you mean.",
        "created_utc": 1618882768,
        "id": "gv5jnbu",
        "permalink": "/r/wallstreetbets/comments/mu949r/what_are_your_moves_tomorrow_april_20_2021/gv5jnbu/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618911568.0
    },
    {
        "author": "browhodouknowhere",
        "body": "All in on IBM",
        "created_utc": 1619097128,
        "id": "gvfuw27",
        "permalink": "/r/wallstreetbets/comments/mw1ekp/daily_discussion_thread_for_april_22_2021/gvfuw27/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619125928.0
    },
    {
        "author": "WSBshepherd",
        "body": "IBM Blockchain is also ahead of the game in creating private blockchains for companies.",
        "created_utc": 1619063468,
        "id": "gveo5e3",
        "permalink": "/r/stocks/comments/mvpf24/thoughts_on_ibm/gveo5e3/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619092268.0
    },
    {
        "author": "Investing8675309",
        "body": "This company has raised earnings like clockwork over the years and has a client lock on databases and makes switching costs high.\n\nWork in tech and won’t touch this stock with a ten foot pole, the only tech large cap I stay further away from is IBM. Oracle was late to cloud (I think they may have barely just made it) and are infamous for their army of lawyers and salespeople to lock clients into contracts. \n\nI think long term the CSPs with low cost database options are going to make life difficult for Oracle and it’s strategy of onerous contracts with fat margins will not work out. It will take a while to play out but it will happen this decade.\n\nTake this with a grain of salt though, sometimes working in the industry can be a detrimental bias. I know the financials on this company are fantastic, if you’re only looking at that it seems like a sound investment. It is one of the top stocks on the Acquirers Multiple ETF which usually is an indicator of value.",
        "created_utc": 1618455386,
        "id": "gukc3f8",
        "permalink": "/r/ValueInvesting/comments/mr5rre/oracle/gukc3f8/",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1618484186.0
    },
    {
        "author": "daddyneedsmoohlah",
        "body": "How many fools are going to get sucked in and become bagholders on the next day that PLTR decides to hoodwink retards with a 5 plus percent run up? People never learn. The stonk is shit. All their demos, videos and press releases are nothing more than word salad and fancy verbiage to make people think their product is so unique and cutting edge lol. They got the old farts at IBM trying to hawk it on the streets now hehehe. Wake up people. 17 yrs as a company and ZERO profit. 🗑",
        "created_utc": 1618501054,
        "id": "gum5t4w",
        "permalink": "/r/wallstreetbets/comments/mrbmfj/daily_discussion_thread_for_april_15_2021/gum5t4w/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618529854.0
    },
    {
        "author": "urbfbrbr",
        "body": "I would invest into stocks with good dividends. Granted you’re not gonna be making a whole lot of cash but stocks like these are relatively safe and pay out relatively well dividends. I would start with stocks like ATNT, NLY, DIA IBM",
        "created_utc": 1618880321,
        "id": "gv5ex2v",
        "permalink": "/r/investing/comments/mueyh3/can_use_some_advice_for_sure/gv5ex2v/",
        "score": 3,
        "subreddit": "investing",
        "created": 1618909121.0
    },
    {
        "author": "WSBshepherd",
        "body": "Yes, I worked there too.  It's often times big companies that trust IBM.  There's a saying, \"No one's ever gotten fired for going with IBM.\"\n\nIBM spends to much time, money, and energy winding down legacy systems with just a few clients on it.  Some of these legacy products and services were once successful.  Others never got too high of the ground.\n\nI looked at IBM's price before earnings and thought it was a great buy then just because it was so cheap.  For years, I was wondering why anyone was buying IBM stock, so I'm certainly no IBM perma bull.  I don't IBM stock though.  My portfolio is completely growth.",
        "created_utc": 1619063250,
        "id": "gvensgm",
        "permalink": "/r/stocks/comments/mvpf24/thoughts_on_ibm/gvensgm/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619092050.0
    },
    {
        "author": "DeathMeetsAngel",
        "body": "im surprised IBM gets so much love. Software Engineering Salaries are so bad there that they will never attract the best talent so they dont build any good software.\n\nTheir salaries don't compete with tech/fintech salaries like Monzo, bloomberg, expedia, Yelp, spotify etc. I don't think they even compete with big4 consulting firms (pwc, kpmg...)",
        "created_utc": 1619043170,
        "id": "gvdkrp4",
        "permalink": "/r/stocks/comments/mvokhi/worst_companies_in_the_various_markets/gvdkrp4/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619071970.0
    },
    {
        "author": "Kashm11r",
        "body": "I think would have come down considerably. UiPath is grossly overvalued at over 80 times sales. UK based RPA software company Blue Prism  is trading at $1.7B compared to UiPath $37B. Blue Prism has $200M revenues compared to UiPath $600M granted they have half the revenue growth rate over the last year. If you want to invest in RPA software consider looking at this foreign listing as the CEO is considering a US listing. Also they have many great customers, some are the same as UiPath. They include Google, Microsoft, KPMG, EY, Daimler, Seimens, 3M, EBay, IBM, Accenture, Fidelity &amp; RBC.",
        "created_utc": 1619163818,
        "id": "gvjkcz6",
        "permalink": "/r/stocks/comments/mwpvrl/ui_path_path_questions_on_ipos/gvjkcz6/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619192618.0
    },
    {
        "author": "teslas_love_pigeon",
        "body": "IBM is a shitty consulting company.",
        "created_utc": 1619572117,
        "id": "gw4ckf4",
        "permalink": "/r/wallstreetbets/comments/mzx686/what_are_your_moves_tomorrow_april_28_2021/gw4ckf4/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619600917.0
    },
    {
        "author": "Letmefixthatforyouyo",
        "body": "Ubuntu just released AD intergration at setup in their latest release. It was already possible later via various tools, but I see this as even more alignment with Microsoft, seeing WSL is already Ubuntu. Microsoft and the most popular Linux distro are tying themselves together at the hip.\n\nIm betting we see Microsoft buying Canonical ala IBM and Redhat in the next 3 yrs. A canonical IPO has long been whispered, but I see a direct buy out by their biggest partner as more likely.",
        "created_utc": 1619577411,
        "id": "gw4mzlp",
        "permalink": "/r/investing/comments/mzxvki/microsoft_earnings_revenue_up_19_yoy/gw4mzlp/",
        "score": 3,
        "subreddit": "investing",
        "created": 1619606211.0
    },
    {
        "author": "donttazemebro4",
        "body": "\\~50% VOO/VTI\n\n\\~15% IT (AAPL, GOOG, MSFT, AMD, CRWD, IBM)\n\n\\~10% Healthcare (JNJ, BMY, VRTX, ABBV, CVS, MRNA, MRK)\n\n\\~8% Financials/Fintech (PYPL, BRK.B, MS, BAC)\n\n\\~7% Industrials (LMT, GE)\n\n\\~5% Consumer Staples (COST, WM, KO)\n\n\\~5% Comms/Cons Disc/etc (DIS, FB, HD, ATVI, NTDOY, AYRWF, GM, SUBZ etf)\n\nWhen I first started my portfolio, I had more individual holdings and was overall less diversified. My current goals are to continue trimming some of my lower conviction stock picks and make my broad market etf's a greater percentage of my portfolio. I'd appreciate any suggestions on broad market etf's that can complement VOO/VTI as well as any potential recommendations in more defensive sectors.\n\nEDIT: no ARK suggestions please. I like a lot of the companies on those ETF's just not now at their current prices.",
        "created_utc": 1619470933,
        "id": "gvz4nt1",
        "permalink": "/r/stocks/comments/lv5dlb/rate_my_portfolio_rstocks_quarterly_thread_march/gvz4nt1/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619499733.0
    },
    {
        "author": "Traditional_Purple82",
        "body": "Don't forget AAPL and IBM",
        "created_utc": 1617765105,
        "id": "gtncm4g",
        "permalink": "/r/wallstreetbets/comments/mlkbp6/what_are_your_moves_tomorrow_april_07_2021/gtncm4g/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617793905.0
    },
    {
        "author": "Sea_Prize_3464",
        "body": "Apple.  IPO'd about 9-months before my 18th birthday would be best.  A gain of about 142,000 percent.\n\nBut almost no one in my family would have known anything about investing in anything.  If there were any opportunity it probably would have been in something 'safe' or 'established' or 'well known'.  Like AT&amp;T or IBM.\n\nFrom my 18th birthday IBM is up about 950%.  9.5x.  That's not a bad thing, exactly.  But .... and this is the really important part for long-term investing .... the S&amp;P 500 is up about 3250% in the same period.\n\nBest thing to do, at the time, buy the S&amp;P 500 and let it ride.  For a LOT of people, that is still the best thing to do.  Invest in the market over the long run.  It's like hitting singles all day instead of swinging for the fences and striking out WAY too often.",
        "created_utc": 1617761327,
        "id": "gtn5rgd",
        "permalink": "/r/stocks/comments/mlh62s/if_you_could_put_your_money_somewhere_when_you/gtn5rgd/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1617790127.0
    },
    {
        "author": "slywhippersnapper",
        "body": "Would love to know your thoughts on IBM ... I recently bought",
        "created_utc": 1617856372,
        "id": "gtrvi4y",
        "permalink": "/r/wallstreetbets/comments/mmayfj/pltr_all_in_first_post_wish_me_luck/gtrvi4y/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617885172.0
    },
    {
        "author": "MrSweetPickles",
        "body": "Its an artificial intelligence company. They use AI to do whatever you want to do. With govt contracts that means anything from finding Bin Laden (which its claimed they did) to tracking illegal international activities, to planning extractions of high valued targets through multiple options/fall back plans, to figuring out how to route troops and where they are needed most, to figuring out which hospitals need what supplies during a pandemic like covid (which they also did, they are why we were able to get supplies where they were needed as fast as possible). They mainly did govt contracts but are now shifting and opening up to the private sector. They are helping BP find oil in the ocean, they are helping IBM and other companies become more profitable, finding what solutions work best and updating their intelligence constantly. The simplest way to understand it is this... lets say your company makes 100m a year, pltr can help you make 150m a year with minor adjustments, and you pay pltr 10m yearly fee for that service. You cannot increase to 150m a year easily on your own, so you win 40m just by hiring them, of course you want to use them. They streamline and make businesses more profitable. They are the computer.",
        "created_utc": 1618457628,
        "id": "gukfyxs",
        "permalink": "/r/StockMarket/comments/mr5se3/what_are_the_best_1030_year_long_term_stocks_to/gukfyxs/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1618486428.0
    },
    {
        "author": "ozud100",
        "body": "It's the first and only Quantum computing company ever listed atm.\n\nGoogle, IBM, Honeywell are also looking a QC also. Alternatively, Defiance Quantum ETFs are something much more 'safer'.\n\nDMYI will have the biggest ROI and first movers advantage. Biden bill promised further funding for R&amp;D in quantum computing - this fell on deaf ears behind all the EV noise.",
        "created_utc": 1617680684,
        "id": "gtj72pk",
        "permalink": "/r/wallstreetbets/comments/mktg0s/what_are_your_moves_tomorrow_april_06_2021/gtj72pk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617709484.0
    },
    {
        "author": "Investing8675309",
        "body": "Yeah I think the way Krishna is positioning the company is they’ll de-emphasize their own infrastructure and provide hybrid applications for cloud/on-prem mix. He is already spinning off IBM infra which is smart. It is the only strategy that makes sense, this wasn’t a hard thing to see and can’t believe Rommety didn’t do this years ago.",
        "created_utc": 1619053395,
        "id": "gve5ihg",
        "permalink": "/r/stocks/comments/mvpf24/thoughts_on_ibm/gve5ihg/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619082195.0
    },
    {
        "author": "BestGermanEver",
        "body": "Some of them are hiding even in plain sight right at the top of NASDAQ or S&amp;P 500. There were some serious gains in old behemoths like IBM, even.\n\nBut then again, any one pick can go south pretty quickly based on no visible indicators until you see it plummeted - on the charts, after the fact.\n\nIt happens to the best. NFLX, TSLA, cough cough. \n\nIt also just happened to classics like Tobacco stocks on a very obscure news bit, resulting in a fire sale drop of 8-10%.\n\nThese catalysts can be anything from silly things like big \"take-win\" orders kicking on a huge run-up, plummeting market prices to something you couldn't see, also see above note on Tobacco taking a huge hit.\n\nIf you put a single chip on a number, you take a gamble for a 35-bagger or losing your lot quickly.\n\nBest case is you're right in your pick. Or pure lucky. Or a little of both ideally.",
        "created_utc": 1619106423,
        "id": "gvgfh6s",
        "permalink": "/r/stocks/comments/mw76vh/unpopular_opinion_picking_stocks_is_better_right/gvgfh6s/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619135223.0
    },
    {
        "author": "pdieff",
        "body": "Netflix: Long \n\nIBM: Short \n\nIntel: Short \n\nWho has them the other way around and why?",
        "created_utc": 1618793836,
        "id": "gv13trr",
        "permalink": "/r/wallstreetbets/comments/mtk7tt/what_are_your_moves_tomorrow_april_19_2021/gv13trr/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618822636.0
    },
    {
        "author": "dcss_west",
        "body": "IBM out of left field lol nice",
        "created_utc": 1618863271,
        "id": "gv4ey02",
        "permalink": "/r/wallstreetbets/comments/mu949r/what_are_your_moves_tomorrow_april_20_2021/gv4ey02/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618892071.0
    },
    {
        "author": "Velshtein",
        "body": "IBM with the Hulk dick.",
        "created_utc": 1618863144,
        "id": "gv4enk5",
        "permalink": "/r/wallstreetbets/comments/mu949r/what_are_your_moves_tomorrow_april_20_2021/gv4enk5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618891944.0
    },
    {
        "author": "updownhold51",
        "body": "IBM beat expectations. That can’t hurt.",
        "created_utc": 1618870667,
        "id": "gv4vmgd",
        "permalink": "/r/RobinHoodPennyStocks/comments/mtopom/daily_discussion_thread/gv4vmgd/",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1618899467.0
    },
    {
        "author": "SPAC-ey-McSpacface",
        "body": "I have lot of IBM in my retirement account, so I would love this.",
        "created_utc": 1618874509,
        "id": "gv53hil",
        "permalink": "/r/SPACs/comments/mtsmja/announcements_x_daily_discussion_for_apr192021/gv53hil/",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1618903309.0
    },
    {
        "author": "rally4cancer",
        "body": "FireEye literally detected the attack from finding unauthorised users, and then created the killswitch to stop the attack.\n\n[https://www.darkreading.com/attacks-breaches/fireeye-identifies-killswitch-for-solarwinds-malware-as-victims-scramble-to-respond/d/d-id/1339746](https://www.darkreading.com/attacks-breaches/fireeye-identifies-killswitch-for-solarwinds-malware-as-victims-scramble-to-respond/d/d-id/1339746)\n\n[https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html](https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html)\n\n[https://www.zdnet.com/article/fireeye-releases-tool-for-auditing-networks-for-techniques-used-by-solarwinds-hackers/](https://www.zdnet.com/article/fireeye-releases-tool-for-auditing-networks-for-techniques-used-by-solarwinds-hackers/)\n\nYou need to start reading up on your subject material. The reason Blackberry Spark wasn't affected was because it's not widely used by the government. The same way IBM wasn't affected. The same way Crowdstrike wasn't affected.",
        "created_utc": 1619206193,
        "id": "gvloazm",
        "permalink": "/r/wallstreetbets/comments/mwz7f2/dod_and_nhtsa_mandate_to_use_blackberry_jarvis/gvloazm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619234993.0
    },
    {
        "author": "xfantasticmrfaux",
        "body": "&gt;You are an old man who thinks in terms of nations and peoples. There are no nations, there are no peoples, there are no Russians, there are no Arabs, there are no third worlds, there is no West! There is only one holistic system of systems, one vast and immane, interwoven, interacting, multi-variate, multi-national dominion of dollars. Petro-dollars, electro-dollars, multi-dollars, reichmarks, rins, rubles, pounds, and shekels. It is the international system of currency which determines the totality of life on this planet. That is the natural order of things today. That is the atomic and sub-atomic and galactic structure of things today! And you have meddled with the primal forces of nature! AND YOU WILL ATONE! Am I getting through to you, Mr. Beale? You get up on your little twenty-one inch screen and howl about America and democracy. There is no America. There is no democracy. There is only IBM and ITT and AT&amp;T and DuPont, Dow, Union Carbide, and Exxon. Those are the nations of the world today.\n\n-Network, 1976",
        "created_utc": 1619699780,
        "id": "gwaf39l",
        "permalink": "/r/investing/comments/n0ojht/apple_reports_another_blowout_quarter_with_sales/gwaf39l/",
        "score": 2,
        "subreddit": "investing",
        "created": 1619728580.0
    },
    {
        "author": "badgebruce",
        "body": "Red Hat CEO upbeat to maintain double digit growth...Cormier says that he anticipates the same things that IBM expects -- and that Red Hat is up to the task ahead of it. \"We see that growth continuing to happen as it's a huge market, and this is the way it's really playing out. We share the optimism,\" he explained.\n\n[https://finance.yahoo.com/news/red-hat-ceo-looks-maintain-201135719.html](https://finance.yahoo.com/news/red-hat-ceo-looks-maintain-201135719.html)",
        "created_utc": 1619623535,
        "id": "gw6jq9c",
        "permalink": "/r/stocks/comments/n0azop/rstocks_daily_discussion_wednesday_apr_28_2021/gw6jq9c/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619652335.0
    },
    {
        "author": "ElegantBiscuit",
        "body": "Apple *designs* their own chips, but TSMC manufactures them. AMD also designs their own chips and has them made by TSMC, Nvidia has their chips made by both TSMC and Samsung, and Intel and recently Samsung both design and manufacture their own chips. There are other players too, like IBM has GlobalFoundries make their chips. \n\nI’d recdomend [this](https://www.youtube.com/watch?v=CkNn98WE5_k) video by a YouTube channel called TechAltar if you want to learn more about the chip making process, because it’s definitely interesting on its own but also important if you want to get into investing in some of these big tech companies.",
        "created_utc": 1617836487,
        "id": "gtquakg",
        "permalink": "/r/stocks/comments/mlycbf/rstocks_daily_discussion_wednesday_apr_07_2021/gtquakg/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1617865287.0
    },
    {
        "author": "-Silky_Johnson",
        "body": "1. Aggregation of data, both Structured and Unstructured. &lt; no other company can gather unstructured data and have it integrate with structured data. \n\n2. AI insights. Once all data is gathered the platform will suggest areas of improvement where the user can ultimately decide to improve on. \n\n3. Granular access, no other software can control the flow of data to the level Palantir can. \n\nThese three functions are so advanced that companies adopting Palantir have already saved millions. \n\nBefore you rebuttal “but Google and IBM have AI” that doesn’t mean they have AI that can solve operational problems at the level Palantir can. Palantir tech is so ahead of their competitors IBM decided to work with them instead of fight them.",
        "created_utc": 1617742684,
        "id": "gtm4fuk",
        "permalink": "/r/wallstreetbets/comments/mlbmmm/palantir_issues_additional_details_about/gtm4fuk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617771484.0
    },
    {
        "author": "Gravity-Rides",
        "body": "I don't get it. This is going to come off as strident and I am not trying to be rude.\n\nThere are hundreds if not thousands of decent, stable, profitable and upright companies out there. AAPL, GOOG, FB, JNJ, JPM, C, V, IBM, the list goes on and on and on. And the beauty of options is the leverage gives you the ability to be involved in these companies without $100k in capital!\n\nAnd yet, so many people out here gambling on $5 Chinese shitco's that not only have illiquid options markets but are sketchy AF to start with. \n\nBruh, consider yourself lucky if this POS isn't delisted or pink-sheeted in 2023.",
        "created_utc": 1617736938,
        "id": "gtlr3d3",
        "permalink": "/r/options/comments/mlj6pq/selling_long_dated_puts_sos/gtlr3d3/",
        "score": 2,
        "subreddit": "options",
        "created": 1617765738.0
    },
    {
        "author": "Investing8675309",
        "body": "Haha, they’re on my hit list too, just not to the level IBM and Oracle are. The CSPs hate them just because they overcharge for their proprietary networking gear (back end, not talking like office equipment) and have patents up to wazoo on them. I won’t touch them either but am outside of my expertise when speaking about their consumer products. They’re similar to Oracle in that a lot of the industry hates using them but they’re just really hard to move away from. A lot of networking has gone open source in an effort to get away from Cisco though this has had mixed results. Again though, I only know one aspect of their business relatively well so can’t comment on everything but it is enough that I won’t buy this stock. They’re also on the Acquirers Multiple as like the number two or three holding so great value.",
        "created_utc": 1618463141,
        "id": "guko7b0",
        "permalink": "/r/ValueInvesting/comments/mr5rre/oracle/guko7b0/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1618491941.0
    },
    {
        "author": "claytondpark",
        "body": "IBM calls from this AM post printing nicely today, next boomer play =  crm 4/30 $240c",
        "created_utc": 1619029394,
        "id": "gvcp30r",
        "permalink": "/r/wallstreetbets/comments/mvcct1/daily_discussion_thread_for_april_21_2021/gvcp30r/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619058194.0
    },
    {
        "author": "postblitz",
        "body": "&gt; Go buy IBM\n\nWish I had; a week ago.",
        "created_utc": 1619039306,
        "id": "gvdcaib",
        "permalink": "/r/investing/comments/mve8vh/netflix_misses_q1_subscriber_targets_blaming/gvdcaib/",
        "score": 2,
        "subreddit": "investing",
        "created": 1619068106.0
    },
    {
        "author": "lightning_whirler",
        "body": "The biggest thing IBM has going for it is that Rometty is no longer CEO.",
        "created_utc": 1618856783,
        "id": "gv401az",
        "permalink": "/r/stocks/comments/mtwwxf/rstocks_daily_discussion_monday_apr_19_2021/gv401az/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1618885583.0
    },
    {
        "author": "sugarbageldonut",
        "body": "I’m actually bullish on BB. I like their IBM and Amazon deals",
        "created_utc": 1618885646,
        "id": "gv5p7c0",
        "permalink": "/r/wallstreetbets/comments/mu77fi/bb_bag_holders_club_post_your_position_in_the/gv5p7c0/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618914446.0
    },
    {
        "author": "Heggemony",
        "body": "Long term hold. I think the US will push for domestic production of chips and Intel is well geared for that. They did fall asleep at the steering wheel letting AMD and Apple get a good jump but they have a massive war chest, a new CEO and are probably R&amp;D'ing like crazy atm. With the vertical integration of design+fab and massive undervaluation in terms of tech companies (P/E of barely 11-12) it's an absolute bargain. The risk is that they become the next IBM but I find that highly unlikely.\n\nCurrently 2% of my portfolio but I've been adding in all these dips and my target is 8-10% of my portfolio for a 5-10 year hold. It's seldom we see these bargains in tech.",
        "created_utc": 1619187254,
        "id": "gvkgyra",
        "permalink": "/r/stocks/comments/mwrgv5/rstocks_daily_discussion_fundamentals_friday_apr/gvkgyra/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619216054.0
    },
    {
        "author": "TradingwithGreg",
        "body": "I'm with you on the IBM calls. Soon as they announce their earnings, probably an hour after, I'm getting out of the position hopefully with a 30-40% increase.",
        "created_utc": 1618677668,
        "id": "guvew6x",
        "permalink": "/r/wallstreetbets/comments/msjo5o/most_anticipated_earnings_releases_for_the/guvew6x/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618706468.0
    },
    {
        "author": "td0000001",
        "body": "I have made few comments about apple and how it is dead stock walking and you keep talking about the app store and  subscriptions. YOU NEED TO TALK ABOUT GROWTH. I am ok with treating apple like oracle or IBM and that is what it is worth. make your point if you don't agree.",
        "created_utc": 1617327554,
        "id": "gt3jkfy",
        "permalink": "/r/wallstreetbets/comments/mi3t1v/weekend_discussion_thread_for_the_weekend_of/gt3jkfy/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617356354.0
    },
    {
        "author": "drfloydch",
        "body": "In big companies for sure, small ones I don't know.\n\nNon technical people will don't know they are on Azure or AWS, their IT people will make web/mobile apps as frontend (that use Azure, AWS, IBM =&gt;  data analysis, IA functions etc).\n\nBut for sure they seem to offer a good UI entry point to data management/analysis etc",
        "created_utc": 1618423191,
        "id": "guihoyg",
        "permalink": "/r/investing/comments/mqu5r0/palantir_pltr_today_presentation_is_a_bit_weird/guihoyg/",
        "score": 2,
        "subreddit": "investing",
        "created": 1618451991.0
    },
    {
        "author": "SleezyTangoRomance",
        "body": "Yeah only established tech like FANGs IBM ORCL etc will be fine not shit like fsly or other high multiple nq stocks",
        "created_utc": 1617943707,
        "id": "gtwbbhm",
        "permalink": "/r/wallstreetbets/comments/mn6t0l/why_spy_will_go_under_400_soon_and_possibly_as/gtwbbhm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617972507.0
    },
    {
        "author": "psykikk_streams",
        "body": "exactly, where as SAP is far from ideal for those size of businesses. \nI could see PLTR having the same problem as IBM historically had / Has. great products from a technological standpoint, but boy do they suck at marketing and sales.",
        "created_utc": 1618476037,
        "id": "gul2kyd",
        "permalink": "/r/investing/comments/mqu5r0/palantir_pltr_today_presentation_is_a_bit_weird/gul2kyd/",
        "score": 2,
        "subreddit": "investing",
        "created": 1618504837.0
    },
    {
        "author": "Im_Old_In_Town",
        "body": "My uncle retired some years ago from IBM. Living the dream.",
        "created_utc": 1617896467,
        "id": "gttl2oc",
        "permalink": "/r/wallstreetbets/comments/mmog6c/daily_discussion_thread_for_april_08_2021/gttl2oc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617925267.0
    },
    {
        "author": "postblitz",
        "body": "I don't know about Citibank but I know a fair deal about IBM. It's not going anywhere soon. They've continuously shed unproductive segments of their business and focused on the money-makers while acquiring new tech and hiring new blood. They're among the biggest quantum tech and know-how players in the world. Of course they're not the entire market as they were 60 years ago but that's because new players boomed on its indifferent sectors, not because they haven't kept up their relevance or have blind sided their own targets.\n\nWhy do you think it made revenue growth this quarter? Which product segment?  IBM has long abandoned end-users while HP is still holding on.",
        "created_utc": 1619083006,
        "id": "gvfbuey",
        "permalink": "/r/investing/comments/mve8vh/netflix_misses_q1_subscriber_targets_blaming/gvfbuey/",
        "score": 2,
        "subreddit": "investing",
        "created": 1619111806.0
    }
]