[
    {
        "author": "urnewfamousceleb",
        "body": "30 Seconds From Triggering Market Nuclear Bomb\n\nI'm glad this place has quieted down enough for some actual DD written by a monkey with a keyboard and Adderall.\n\nDisclaimer: I am that monkey.  Let me explain to you what happened, play by play.  I will give you illiterates who hate reading a spoiler up front:\n\nWe were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market. Do I have your attention?  Here goes:\n\n1.\t⁠⁠Yesterday, new call option strike prices were added all the way up to $570.  Do I have to go over gamma squeezes again?  Really?  We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock.  This creates upwards pressure on the market.  We've been seeing these movements all week.\n2.\t⁠⁠Yesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off.  It didn't work.\n3.\t⁠⁠Last night, Robinhood sent out a message to users: you could no longer enter into new options.  You could exercise them if you had the collateral (money in the account) to do so.  Very interesting and the first sign of pants-shitting fear.\n4.\t⁠⁠Today, the market opened very strong.  It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n5.\t⁠⁠At approximately 9:58 am, the stock had reached $468 in a parabolic move.\n6.\t⁠⁠Two minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n7.\t⁠⁠The trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it.  What does that mean?  It means they ran out of shares and/or capital. They wouldn't let you buy new shares because we were burning through all the shares on the market.\n\nI saw an unsubstantiated post from a user who said a small sell limit order executed at $2600 for him.  Do you get the severity of the situation, if that's true? It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares.  It means virtually any ask was getting bid.\n\nHow do you get infinite upwards pressure?  A gamma squeeze triggering the mother of all short squeezes, just like we predicted.  The call writers need shares to hedge.  Retail is still buying more.  The short sellers need over 100% of the float back.  Add these together.  There were more shares needed than existed on the open market.  That's what a liquidity crisis is.\n\nListen to this to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home.  DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello!  He's not talking about the market for GME shares.  He's talking about the entire market!  The New York Stock Exchange.  The NASDAQ.  All that.\n\nRemember the movie Snowpiercer?  Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets?  Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\n\nIt kick starts a full blown rebellion.  They have no bullets.  It's the exact same in this market:  No capital.  No shares.  Infinite losses inbound.\n\nTL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares.  Do you get that?  HOLD.  Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede.  That's how we win.\n\nThey needed your shares so badly that they literally risked PRISON TIME to get them.  They tried robbing you, and I'm not even exaggerating.  They were within 30 seconds of all being wiped out today.\n\nCredit: u/PlayFree_Bird",
        "created_utc": 1611878639,
        "id": "gl60yc5",
        "permalink": "/r/wallstreetbets/comments/l7c6kb/congress_might_do_something_for_once/gl60yc5/",
        "score": 6472,
        "subreddit": "wallstreetbets",
        "created": 1611907439.0
    },
    {
        "author": "CatPringle",
        "body": "I'm glad this place has quieted down enough for some actual DD written by a monkey with a keyboard and Adderall. Disclaimer: I am that monkey. Let me explain to you what happened, play by play. I will give you illiterates who hate reading a spoiler up front: We were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market. Do I have your attention? Here goes:\n\nYesterday, new call option strike prices were added all the way up to $570. Do I have to go over gamma squeezes again? Really? We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock. This creates upwards pressure on the market. We've been seeing these movements all week.\n\nYesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off. It didn't work.\n\nLast night, Robinhood sent out a message to users: you could no longer enter into new options. You could exercise them if you had the collateral (money in the account) to do so. Very interesting and the first sign of pants-shitting fear.\n\nToday, the market opened very strong. It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n\nAt approximately 9:58 am, the stock had reached $468 in a parabolic move.\n\nTwo minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n\nThe trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it. What does that mean? It means they ran out of shares and/or capital. They wouldn't let you buy new shares because we were burning through all the shares on the market. I saw an unsubstantiated post from a user who said a small sell limit order executed at $2600 for him. Do you get the severity of the situation, if that's true? It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares. It means virtually any ask was getting bid.\n\nHow do you get infinite upwards pressure? A gamma squeeze triggering the mother of all short squeezes, just like we predicted. The call writers need shares to hedge. Retail is still buying more. The short sellers need over 100% of the float back. Add these together. There were more shares needed than existed on the open market. That's what a liquidity crisis is.\n\nListen to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home. DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello! He's not talking about the market for GME shares. He's talking about the entire market! The New York Stock Exchange. The NASDAQ. All that.\n\nRemember the movie Snowpiercer? Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets? Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\n\nIt kick starts a full blown rebellion. They have no bullets. It's the exact same in this market: No capital. No shares. Infinite losses inbound.\n\nTL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares. Do you get that? HOLD. Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede. That's how we win.\n\nThey needed your shares so badly that they literally risked PRISON TIME to get them. They tried robbing you, and I'm not even exaggerating. They were within 30 seconds of all being wiped out today.",
        "created_utc": 1611874986,
        "id": "gl5sfgr",
        "permalink": "/r/wallstreetbets/comments/l7b321/josh_shapiro_attorney_general_of_pennsylvania_is/gl5sfgr/",
        "score": 5967,
        "subreddit": "wallstreetbets",
        "created": 1611903786.0
    },
    {
        "author": "CatPringle",
        "body": "I'm glad this place has quieted down enough for some actual DD written by a monkey with a keyboard and Adderall. Disclaimer: I am that monkey. Let me explain to you what happened, play by play. I will give you illiterates who hate reading a spoiler up front: We were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market. Do I have your attention? Here goes:\n\nYesterday, new call option strike prices were added all the way up to $570. Do I have to go over gamma squeezes again? Really? We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock. This creates upwards pressure on the market. We've been seeing these movements all week.\n\nYesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off. It didn't work.\n\nLast night, Robinhood sent out a message to users: you could no longer enter into new options. You could exercise them if you had the collateral (money in the account) to do so. Very interesting and the first sign of pants-shitting fear.\n\nToday, the market opened very strong. It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n\nAt approximately 9:58 am, the stock had reached $468 in a parabolic move.\n\nTwo minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n\nThe trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it. What does that mean? It means they ran out of shares and/or capital. They wouldn't let you buy new shares because we were burning through all the shares on the market. I saw an unsubstantiated post from a user who said a small sell limit order executed at $2600 for him. Do you get the severity of the situation, if that's true? It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares. It means virtually any ask was getting bid.\n\nHow do you get infinite upwards pressure? A gamma squeeze triggering the mother of all short squeezes, just like we predicted. The call writers need shares to hedge. Retail is still buying more. The short sellers need over 100% of the float back. Add these together. There were more shares needed than existed on the open market. That's what a liquidity crisis is.\n\nListen to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home. DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello! He's not talking about the market for GME shares. He's talking about the entire market! The New York Stock Exchange. The NASDAQ. All that.\n\nRemember the movie Snowpiercer? Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets? Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\n\nIt kick starts a full blown rebellion. They have no bullets. It's the exact same in this market: No capital. No shares. Infinite losses inbound.\n\nTL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares. Do you get that? HOLD. Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede. That's how we win.\n\nThey needed your shares so badly that they literally risked PRISON TIME to get them. They tried robbing you, and I'm not even exaggerating. They were within 30 seconds of all being wiped out today.",
        "created_utc": 1611874782,
        "id": "gl5ry19",
        "permalink": "/r/wallstreetbets/comments/l7aj2e/mic_drop/gl5ry19/",
        "score": 2675,
        "subreddit": "wallstreetbets",
        "created": 1611903582.0
    },
    {
        "author": "Sleavitt10",
        "body": "I tried to make this it's own post but it's not working so I'm commenting it instead:\n\n \n\nI've spent the last six hour compiling all of this information for you guys so I hope you enjoy!\n\nReading [/u/johnnydaggers](https://www.reddit.com/u/johnnydaggers/) post (which is currently at the top of WSB) has sent me down a rabbit hole of learning about Failures to Deliver and The OTCC:\n\n[https://www.reddit.com/r/wallstreetbets/comments/l97ykd/the\\_real\\_reason\\_wall\\_street\\_is\\_terrified\\_of\\_the/](https://www.reddit.com/r/wallstreetbets/comments/l97ykd/the_real_reason_wall_street_is_terrified_of_the/)\n\nIn my searching I found the below YouTube channel which has a treasure trove of videos posted 10-11 years ago outlying all this shit we've been talking about this week:\n\n[https://www.youtube.com/c/JuddBagley/videos](https://www.youtube.com/c/JuddBagley/videos)\n\nNow I know most of you guys and gals have the attention span of a gnat but for those of you that are able to sit still and watch something for more than 30 seconds you're going to want to watch these videos! They provide deep insight with plenty of url references for you to check out the source material for yourself.\n\nTwo Part Video Series (18 min total) about the SEC's Investigation Of Naked Shorting Of Sedona. A case study on how naked short sellers have destroyed hundreds and hundreds of publicly traded companies. He then goes on to explain how this can go on to effect the broader market:\n\n[https://www.youtube.com/watch?v=hH5cMQLJRUo&amp;t=8s](https://www.youtube.com/watch?v=hH5cMQLJRUo&amp;t=8s)\n\nNine part (Approx 80 min total) series about the corruption of our capital markets due to naked short selling and \"failures to deliver\". He goes over a number of topics just as FTD's (Failures to deliver), how prevalent they are, how long they can last for and the risk they pose to the financial system. He also talks about the DTCC and it's role in clearing money and shares through the market and how it has a history of downplaying the amount of FTD's. Just watch the first (5 min) video and you'll be hooked:\n\n[https://www.youtube.com/watch?v=gpWzOjB8qtU](https://www.youtube.com/watch?v=gpWzOjB8qtU)\n\nIf you didn't watch the above series at least watch part 5 where he explains how the entire market could collapse as a result of a short squeeze on a heavily naked shorted stock:\n\n[https://www.youtube.com/watch?v=JKc0KQvvfWE](https://www.youtube.com/watch?v=JKc0KQvvfWE)\n\n&lt;1 min Video of SEC Chairman stumbling over his words as he answers the question \"do you know of the possibility of short selling taking down Bear Stearns\":\n\n[https://www.youtube.com/watch?v=acKWiE\\_rKXk](https://www.youtube.com/watch?v=acKWiE_rKXk)\n\nVideo explaining how someone bought WAYYY OTM weekly puts on Bear Stearns the day before Bear Stearns started tanking due to over ten million illegal naked short sells and how this started the Global Financial Crisis:\n\n[https://www.youtube.com/watch?v=xUKSU1qahgE](https://www.youtube.com/watch?v=xUKSU1qahgE)\n\nPart 2 of the above video where he goes over the SEC's lack of response to the naked short selling of Bear Stearns, Lehman Brothers, Fannie Mae and Freddie Mac:\n\n[https://www.youtube.com/watch?v=NcjssQSthNU](https://www.youtube.com/watch?v=NcjssQSthNU)\n\nPart 3 about how hundreds of millions of naked short sales of Lehman Brothers stock put the final nail in the coffin of the company causing the GFC. The SEC did nothing. Hedge fund managers like Jim Chanos and Steve Cohen have too much money and power to ever be prosecuted:\n\n[https://www.youtube.com/watch?v=Q48eSoTNByQ](https://www.youtube.com/watch?v=Q48eSoTNByQ)\n\n3 Min Video of a debate on Bloomberg where this Wall Street guy is arguing that short sellers should be able to sell short at will and should never have to actually borrow shares to be able to short:\n\n[https://www.youtube.com/watch?v=4oerYirYVFE](https://www.youtube.com/watch?v=4oerYirYVFE)\n\nThe Bear raid on Overstock.com and the journalists that enabled it (10 min):\n\n[https://www.youtube.com/watch?v=FHQeZ9czrKc&amp;t=4s](https://www.youtube.com/watch?v=FHQeZ9czrKc&amp;t=4s)\n\nCase study: In the final days of selling of Lehman Brothers stock there we over 150M failures to delivery naked shares sold short when the stock was selling for about $0.10. Imagine LEH ended up not going bankrupt. Imagine something happened and the price suddenly rebounded dramatically. These 150M naked shorts would be caught with their pants down and it would get bloody. The amount it would cost the financial system is the actual number of shares out there x the mean price those shareholders are willing to sell them for (knowing they have the buyers bent over a barrel). There have only ever been 71M shares of GME issued but institutions claim they own 102M shares of GME so how many shares are out there? Lets guess there are actually 200M shares out there and the average shareholder sells for $1000. That's $200B. If there is 333M shares and a $3000 share price that's $1T off of a measly $1B company that naked short sellers got greedy on. Who's going to foot this bill?\n\nTLDR; We're probably not even buying and selling actual shares of GME. When it looked like GME was \"on the ropes\" and there was a good narrative of why they should go bankrupt naked short sellers likely naked short sold an unknowable amount of fake \"IOU\" shares of GME because they thought it would for sure go bankrupt. This plan has worked for them hundreds and hundreds of times in the past making them hundreds of billions or even trillions of dollars. Some high profile examples include: Bear Stearns, Lehman Brothers, Fannie Mae and Freddie Mac. When these sharks smell blood in the water nothing is stopping them from naked short selling tens of millions of fake shares (over 100M in the last three days of Lehman Brothers) to innocent buyers who think they're getting a good deal which ultimately go to zero and equate to an infinite profit margin for the short sellers. What they didn't expect with GME was a bunch of retards doing what we've done over the past months and exposing their fraudulent naked short selling. We have no way to be certain how many shares are actually out there but [/u/johnnydaggers](https://www.reddit.com/u/johnnydaggers/) post shows there was 1.7M shares failed to deliver in December (before shit even hit the fan). The thing is this threatens to undermine the publics confidence in the entire system. How do we know that the shares that we think we are purchasing are actually legit? We could literally being paying good money for something that doesn't actually exist. What this means for GME is someone is going to have to step up and actually pay up for all of these phantom shares that aren't even supposed to exist. What price they will pay nobody knows.",
        "created_utc": 1612120125,
        "id": "glib7cs",
        "permalink": "/r/wallstreetbets/comments/l9jbc5/listen_to_me_we_cannot_trust_the_short_interest/glib7cs/",
        "score": 2255,
        "subreddit": "wallstreetbets",
        "created": 1612148925.0
    },
    {
        "author": "PlayFree_Bird",
        "body": "I put the following on the other sub, but I can share it here, too.\n\n- - - - - - \n\nI'm glad this place has quieted down enough for some actual DD written by a monkey with a keyboard and Adderall.  Disclaimer: I am that monkey.  Let me explain to you what happened, play by play.  I will give you illiterates who hate reading a spoiler up front: **We were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market.** Do I have your attention?  Here goes:\n\n1. Yesterday, new call option strike prices were added all the way up to $570.  Do I have to go over gamma squeezes again?  Really?  We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock.  This creates upwards pressure on the market.  We've been seeing these movements all week.\n\n2. Yesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off.  It didn't work.\n\n3. Last night, Robinhood sent out a message to users: you could no longer enter into new options.  You could exercise them if you had the collateral (money in the account) to do so.  Very interesting and the first sign of pants-shitting fear.\n\n4. Today, the market opened very strong.  It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n\n5. At approximately 9:58 am, the stock had reached $468 in a parabolic move.\n\n6. Two minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n\n7. The trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: **The market ran out of liquidity today, or was threatening to get close enough that they killed it.**  What does that mean?  It means they ran out of shares and/or capital.  They wouldn't let you buy new shares because we were burning through all the shares on the market.  I saw an unsubstantiated post from a user who said **a small sell limit order executed at $2600 for him.**  Do you get the severity of the situation, if that's true?  It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares.  It means virtually any ask was getting bid.\n\nHow do you get infinite upwards pressure?  A gamma squeeze triggering the mother of all short squeezes, just like we predicted.  The call writers need shares to hedge.  Retail is still buying more.  The short sellers need over 100% of the float back.  Add these together.  There were more shares needed than existed on the open market.  That's what a liquidity crisis is.\n\nListen to [this remarkable (if infuriating) interview](https://www.youtube.com/watch?v=7RH4XKP55fM) where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home.  **DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"?** Hello!  He's not talking about the market for GME shares.  He's talking about the entire market!  The New York Stock Exchange.  The NASDAQ.  All that.\n\nRemember the movie *Snowpiercer*?  Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets?  Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\n\nIt kick starts a full blown rebellion.  They have no bullets.  It's the exact same in this market:  No capital.  No shares.  Infinite losses inbound.\n\n**TL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares.  Do you get that?  HOLD.  Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede.  That's how we win.**  \n\nThey needed your shares so badly that they literally risked PRISON TIME to get them.  They tried robbing you, and I'm not even exaggerating.  They were within 30 seconds of all being wiped out today.",
        "created_utc": 1611876270,
        "id": "gl5velc",
        "permalink": "/r/stocks/comments/l7awnp/today_is_a_dark_day_for_traders/gl5velc/",
        "score": 1850,
        "subreddit": "stocks",
        "created": 1611905070.0
    },
    {
        "author": "Raksmey_",
        "body": "Credit u/PlayFree_Bird\n\nOkay, has this place quieted down enough for some actual DD written by a monkey with a keyboard and Adderall? Let me explain to you what happened, play by play. I will give you illiterates who hate reading a spoiler up front: We were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market. Do I have your attention? Here goes:\n\nYesterday, new call option strike prices were added all the way up to $570. Do I have to go over gamma squeezes again? Really? We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock. This creates upwards pressure on the market. We've been seeing these movements all week.\n\nYesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off. It didn't work.\n\nLast night, Robinhood sent out a message to users: you could no longer enter into new options. You could exercise them if you had the collateral (money in the account) to do so. Very interesting and the first sign of pants-shitting fear.\n\nToday, the market opened very strong. It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n\nAt approximately 9:58 am, the stock had reached $468 in a parabolic move.\n\nTwo minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n\nThe trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it. What does that mean? It means they ran out of shares and/or capital. They wouldn't let you buy new shares because we were burning through all the shares on the market. I saw an unsubstantiated post from a user who said a small sell limit order excited at $2600 for him. Do you get the severity of the situation, if true? It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares.\n\nHow do you get infinite upwards pressure? A gamma squeeze triggering the mother of all short squeezes, just like we predicted. The call writers need shares to hedge. Retail is still buying more. The short sellers need over 100% of the float back. Add these together. There were more shares needed than existed on the open market. That's what a liquidity crisis is.\n\nListen to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home: https://www.youtube.com/watch?v=7RH4XKP55fM DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello! He's not talking about the market for GME shares. He's talking about the entire market! The New York Stock Exchange. The NASDAQ. All that.\n\nRemember the movie Snowpiercer? Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets? Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\n\nIt kick starts a full blown rebellion. They have no bullets. It's the exact same in this market: No capital. No shares. Infinite losses inbound.\n\nTL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares. Do you get that? HOLD. Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede. That's how we win.\n\nThey needed your shares so badly that they literally risked PRISON TIME to get them. They tried robbing you, and I'm not even exaggerating. They were within 30 seconds of all being wiped out today.\n\nEdit1: 🚀🚀🚀\n\nEdit2: I wish I was Elon's adopted asian child\n\nEdit3: we like the stock\n\nFull Casino? They just showed their hand before the river. ALL IN GME\n\nhttp://isthesqueezesquoze.com/",
        "created_utc": 1611895629,
        "id": "gl72cfu",
        "permalink": "/r/wallstreetbets/comments/l7jf8c/just_liquidated_188k_worth_of_stonks_aka_fresh/gl72cfu/",
        "score": 1619,
        "subreddit": "wallstreetbets",
        "created": 1611924429.0
    },
    {
        "author": "Zamb3z1",
        "body": "Watch his OG video about his DD here: [https://www.youtube.com/watch?v=GZTr1-Gp74U&amp;ab\\_channel=RoaringKitty](https://www.youtube.com/watch?v=GZTr1-Gp74U&amp;ab_channel=RoaringKitty) he has a YT channel!",
        "created_utc": 1611943293,
        "id": "gl9lfeu",
        "permalink": "/r/wallstreetbets/comments/l7z8pf/in_honor_of_finally_seeing_the_almighty/gl9lfeu/",
        "score": 1562,
        "subreddit": "wallstreetbets",
        "created": 1611972093.0
    },
    {
        "author": "Sleavitt10",
        "body": "I tried to make this it's own post but it's not working so I'm commenting it instead:\n\n \n\nI've spent the last six hour compiling all of this information for you guys so I hope you enjoy!\n\nReading [/u/johnnydaggers](https://www.reddit.com/u/johnnydaggers/) post (which is currently at the top of WSB) has sent me down a rabbit hole of learning about Failures to Deliver and The OTCC:\n\n[https://www.reddit.com/r/wallstreetbets/comments/l97ykd/the\\_real\\_reason\\_wall\\_street\\_is\\_terrified\\_of\\_the/](https://www.reddit.com/r/wallstreetbets/comments/l97ykd/the_real_reason_wall_street_is_terrified_of_the/)\n\nIn my searching I found the below YouTube channel which has a treasure trove of videos posted 10-11 years ago outlying all this shit we've been talking about this week:\n\n[https://www.youtube.com/c/JuddBagley/videos](https://www.youtube.com/c/JuddBagley/videos)\n\nNow I know most of you guys and gals have the attention span of a gnat but for those of you that are able to sit still and watch something for more than 30 seconds you're going to want to watch these videos! They provide deep insight with plenty of url references for you to check out the source material for yourself.\n\nTwo Part Video Series (18 min total) about the SEC's Investigation Of Naked Shorting Of Sedona. A case study on how naked short sellers have destroyed hundreds and hundreds of publicly traded companies. He then goes on to explain how this can go on to effect the broader market:\n\n[https://www.youtube.com/watch?v=hH5cMQLJRUo&amp;t=8s](https://www.youtube.com/watch?v=hH5cMQLJRUo&amp;t=8s)\n\nNine part (Approx 80 min total) series about the corruption of our capital markets due to naked short selling and \"failures to deliver\". He goes over a number of topics just as FTD's (Failures to deliver), how prevalent they are, how long they can last for and the risk they pose to the financial system. He also talks about the DTCC and it's role in clearing money and shares through the market and how it has a history of downplaying the amount of FTD's. Just watch the first (5 min) video and you'll be hooked:\n\n[https://www.youtube.com/watch?v=gpWzOjB8qtU](https://www.youtube.com/watch?v=gpWzOjB8qtU)\n\nIf you didn't watch the above series at least watch part 5 where he explains how the entire market could collapse as a result of a short squeeze on a heavily naked shorted stock:\n\n[https://www.youtube.com/watch?v=JKc0KQvvfWE](https://www.youtube.com/watch?v=JKc0KQvvfWE)\n\n&lt;1 min Video of SEC Chairman stumbling over his words as he answers the question \"do you know of the possibility of short selling taking down Bear Stearns\":\n\n[https://www.youtube.com/watch?v=acKWiE\\_rKXk](https://www.youtube.com/watch?v=acKWiE_rKXk)\n\nVideo explaining how someone bought WAYYY OTM weekly puts on Bear Stearns the day before Bear Stearns started tanking due to over ten million illegal naked short sells and how this started the Global Financial Crisis:\n\n[https://www.youtube.com/watch?v=xUKSU1qahgE](https://www.youtube.com/watch?v=xUKSU1qahgE)\n\nPart 2 of the above video where he goes over the SEC's lack of response to the naked short selling of Bear Stearns, Lehman Brothers, Fannie Mae and Freddie Mac:\n\n[https://www.youtube.com/watch?v=NcjssQSthNU](https://www.youtube.com/watch?v=NcjssQSthNU)\n\nPart 3 about how hundreds of millions of naked short sales of Lehman Brothers stock put the final nail in the coffin of the company causing the GFC. The SEC did nothing. Hedge fund managers like Jim Chanos and Steve Cohen have too much money and power to ever be prosecuted:\n\n[https://www.youtube.com/watch?v=Q48eSoTNByQ](https://www.youtube.com/watch?v=Q48eSoTNByQ)\n\n3 Min Video of a debate on Bloomberg where this Wall Street guy is arguing that short sellers should be able to sell short at will and should never have to actually borrow shares to be able to short:\n\n[https://www.youtube.com/watch?v=4oerYirYVFE](https://www.youtube.com/watch?v=4oerYirYVFE)\n\nThe Bear raid on Overstock.com and the journalists that enabled it (10 min):\n\n[https://www.youtube.com/watch?v=FHQeZ9czrKc&amp;t=4s](https://www.youtube.com/watch?v=FHQeZ9czrKc&amp;t=4s)\n\nCase study: In the final days of selling of Lehman Brothers stock there we over 150M failures to delivery naked shares sold short when the stock was selling for about $0.10. Imagine LEH ended up not going bankrupt. Imagine something happened and the price suddenly rebounded dramatically. These 150M naked shorts would be caught with their pants down and it would get bloody. The amount it would cost the financial system is the actual number of shares out there x the mean price those shareholders are willing to sell them for (knowing they have the buyers bent over a barrel). There have only ever been 71M shares of GME issued but institutions claim they own 102M shares of GME so how many shares are out there? Lets guess there are actually 200M shares out there and the average shareholder sells for $1000. That's $200B. If there is 333M shares and a $3000 share price that's $1T off of a measly $1B company that naked short sellers got greedy on. Who's going to foot this bill?\n\nTLDR; We're probably not even buying and selling actual shares of GME. When it looked like GME was \"on the ropes\" and there was a good narrative of why they should go bankrupt naked short sellers likely naked short sold an unknowable amount of fake \"IOU\" shares of GME because they thought it would for sure go bankrupt. This plan has worked for them hundreds and hundreds of times in the past making them hundreds of billions or even trillions of dollars. Some high profile examples include: Bear Stearns, Lehman Brothers, Fannie Mae and Freddie Mac. When these sharks smell blood in the water nothing is stopping them from naked short selling tens of millions of fake shares (over 100M in the last three days of Lehman Brothers) to innocent buyers who think they're getting a good deal which ultimately go to zero and equate to an infinite profit margin for the short sellers. What they didn't expect with GME was a bunch of retards doing what we've done over the past months and exposing their fraudulent naked short selling. We have no way to be certain how many shares are actually out there but [/u/johnnydaggers](https://www.reddit.com/u/johnnydaggers/) post shows there was 1.7M shares failed to deliver in December (before shit even hit the fan). The thing is this threatens to undermine the publics confidence in the entire system. How do we know that the shares that we think we are purchasing are actually legit? We could literally being paying good money for something that doesn't actually exist. What this means for GME is someone is going to have to step up and actually pay up for all of these phantom shares that aren't even supposed to exist. What price they will pay nobody knows.",
        "created_utc": 1612120192,
        "id": "glibcmp",
        "permalink": "/r/wallstreetbets/comments/l9j2vk/the_big_long_explained/glibcmp/",
        "score": 1552,
        "subreddit": "wallstreetbets",
        "created": 1612148992.0
    },
    {
        "author": "Zak000000",
        "body": "[WE LIKE THE STOCK](https://www.youtube.com/watch?v=71JOIJKbse0&amp;ab_channel=placeboing)",
        "created_utc": 1612032481,
        "id": "gle7aly",
        "permalink": "/r/wallstreetbets/comments/l8rf4k/times_square_right_now/gle7aly/",
        "score": 1485,
        "subreddit": "wallstreetbets",
        "created": 1612061281.0
    },
    {
        "author": "sptsd",
        "body": "Could GME really get over $10,000?\n\nIf you take the total number of shares in the market and divide it by 2.7m (total users on WSB), you average out at 12 shares per person. Adjusted for the whole market, let’s say there are 4m GME shareholders, with an average of 8 shares each.\n\nWall Street hedge funds have supposedly spent a fortune on GME short interest already. Let’s imagine that when this is all over, they have spent another $250bn to cover their short positions. \n\n$250bn/4m = $62,500\n\n$62,500/8 = $7,812 per share.\n\nAll v over simplified but I think that indicates that we should be aiming far higher than the $1,000 a lot of people seem to have their eyes on. \n\nIf you have any sell limits, look deep into your soul. Ask yourself why. And then cancel them. If we all hold, we can ensure the hedges end up with a far larger tab than $250bn 🚀🚀🚀",
        "created_utc": 1611959780,
        "id": "glaukwe",
        "permalink": "/r/wallstreetbets/comments/l86eed/a_message_for_gme_short_sellers/glaukwe/",
        "score": 1472,
        "subreddit": "wallstreetbets",
        "created": 1611988580.0
    },
    {
        "author": "Sleavitt10",
        "body": " \n\nI've spent the last six hour compiling all of this information for you guys so I hope you enjoy!\n\nReading [/u/johnnydaggers](https://www.reddit.com/u/johnnydaggers/) post (which is currently at the top of WSB) has sent me down a rabbit hole of learning about Failures to Deliver and The OTCC:\n\n[https://www.reddit.com/r/wallstreetbets/comments/l97ykd/the\\_real\\_reason\\_wall\\_street\\_is\\_terrified\\_of\\_the/](https://www.reddit.com/r/wallstreetbets/comments/l97ykd/the_real_reason_wall_street_is_terrified_of_the/)\n\nIn my searching I found the below YouTube channel which has a treasure trove of videos posted 10-11 years ago outlying all this shit we've been talking about this week:\n\n[https://www.youtube.com/c/JuddBagley/videos](https://www.youtube.com/c/JuddBagley/videos)\n\nNow I know most of you guys and gals have the attention span of a gnat but for those of you that are able to sit still and watch something for more than 30 seconds you're going to want to watch these videos! They provide deep insight with plenty of url references for you to check out the source material for yourself.\n\nTwo Part Video Series (18 min total) about the SEC's Investigation Of Naked Shorting Of Sedona. A case study on how naked short sellers have destroyed hundreds and hundreds of publicly traded companies. He then goes on to explain how this can go on to effect the broader market:\n\n[https://www.youtube.com/watch?v=hH5cMQLJRUo&amp;t=8s](https://www.youtube.com/watch?v=hH5cMQLJRUo&amp;t=8s)\n\nNine part (Approx 80 min total) series about the corruption of our capital markets due to naked short selling and \"failures to deliver\". He goes over a number of topics just as FTD's (Failures to deliver), how prevalent they are, how long they can last for and the risk they pose to the financial system. He also talks about the DTCC and it's role in clearing money and shares through the market and how it has a history of downplaying the amount of FTD's. Just watch the first (5 min) video and you'll be hooked:\n\n[https://www.youtube.com/watch?v=gpWzOjB8qtU](https://www.youtube.com/watch?v=gpWzOjB8qtU)\n\nIf you didn't watch the above series at least watch part 5 where he explains how the entire market could collapse as a result of a short squeeze on a heavily naked shorted stock:\n\n[https://www.youtube.com/watch?v=JKc0KQvvfWE](https://www.youtube.com/watch?v=JKc0KQvvfWE)\n\n&lt;1 min Video of SEC Chairman stumbling over his words as he answers the question \"do you know of the possibility of short selling taking down Bear Stearns\":\n\n[https://www.youtube.com/watch?v=acKWiE\\_rKXk](https://www.youtube.com/watch?v=acKWiE_rKXk)\n\nVideo explaining how someone bought WAYYY OTM weekly puts on Bear Stearns the day before Bear Stearns started tanking due to over ten million illegal naked short sells and how this started the Global Financial Crisis:\n\n[https://www.youtube.com/watch?v=xUKSU1qahgE](https://www.youtube.com/watch?v=xUKSU1qahgE)\n\nPart 2 of the above video where he goes over the SEC's lack of response to the naked short selling of Bear Stearns, Lehman Brothers, Fannie Mae and Freddie Mac:\n\n[https://www.youtube.com/watch?v=NcjssQSthNU](https://www.youtube.com/watch?v=NcjssQSthNU)\n\nPart 3 about how hundreds of millions of naked short sales of Lehman Brothers stock put the final nail in the coffin of the company causing the GFC. The SEC did nothing. Hedge fund managers like Jim Chanos and Steve Cohen have too much money and power to ever be prosecuted:\n\n[https://www.youtube.com/watch?v=Q48eSoTNByQ](https://www.youtube.com/watch?v=Q48eSoTNByQ)\n\n3 Min Video of a debate on Bloomberg where this Wall Street guy is arguing that short sellers should be able to sell short at will and should never have to actually borrow shares to be able to short:\n\n[https://www.youtube.com/watch?v=4oerYirYVFE](https://www.youtube.com/watch?v=4oerYirYVFE)\n\nThe Bear raid on Overstock.com and the journalists that enabled it (10 min):\n\n[https://www.youtube.com/watch?v=FHQeZ9czrKc&amp;t=4s](https://www.youtube.com/watch?v=FHQeZ9czrKc&amp;t=4s)\n\nCase study: In the final days of selling of Lehman Brothers stock there we over 150M failures to delivery naked shares sold short when the stock was selling for about $0.10. Imagine LEH ended up not going bankrupt. Imagine something happened and the price suddenly rebounded dramatically. These 150M naked shorts would be caught with their pants down and it would get bloody. The amount it would cost the financial system is the actual number of shares out there x the mean price those shareholders are willing to sell them for (knowing they have the buyers bent over a barrel). There have only ever been 71M shares of GME issued but institutions claim they own 102M shares of GME so how many shares are out there? Lets guess there are actually 200M shares out there and the average shareholder sells for $1000. That's $200B. If there is 333M shares and a $3000 share price that's $1T off of a measly $1B company that naked short sellers got greedy on. Who's going to foot this bill?\n\nTLDR; We're probably not even buying and selling actual shares of GME. When it looked like GME was \"on the ropes\" and there was a good narrative of why they should go bankrupt naked short sellers likely naked short sold an unknowable amount of fake \"IOU\" shares of GME because they thought it would for sure go bankrupt. This plan has worked for them hundreds and hundreds of times in the past making them hundreds of billions or even trillions of dollars. Some high profile examples include: Bear Stearns, Lehman Brothers, Fannie Mae and Freddie Mac. When these sharks smell blood in the water nothing is stopping them from naked short selling tens of millions of fake shares (over 100M in the last three days of Lehman Brothers) to innocent buyers who think they're getting a good deal which ultimately go to zero and equate to an infinite profit margin for the short sellers. What they didn't expect with GME was a bunch of retards doing what we've done over the past months and exposing their fraudulent naked short selling. We have no way to be certain how many shares are actually out there but [/u/johnnydaggers](https://www.reddit.com/u/johnnydaggers/) post shows there was 1.7M shares failed to deliver in December (before shit even hit the fan). The thing is this threatens to undermine the publics confidence in the entire system. How do we know that the shares that we think we are purchasing are actually legit? We could literally being paying good money for something that doesn't actually exist. What this means for GME is someone is going to have to step up and actually pay up for all of these phantom shares that aren't even supposed to exist. What price they will pay nobody knows.",
        "created_utc": 1612117544,
        "id": "gli5ime",
        "permalink": "/r/wallstreetbets/comments/l9gv98/citadel_is_the_5th_largest_owner_of_slv_its/gli5ime/",
        "score": 1421,
        "subreddit": "wallstreetbets",
        "created": 1612146344.0
    },
    {
        "author": "master0jack",
        "body": "[Anatomy of the short attack. ](https://seekingalpha-com.cdn.ampproject.org/v/s/seekingalpha.com/amp/instablog/11442671-gerald-klein/3096735-anatomy-of-a-short-attack?amp_js_v=a6&amp;amp;amp_gsa=1&amp;amp;usqp=mq331AQHKAFQArABIA%3D%3D#aoh=16119453107704&amp;amp;referrer=https%3A%2F%2Fwww.google.com&amp;amp;amp_tf=From%20%251%24s&amp;amp;ampshare=https%3A%2F%2Fseekingalpha.com%2Finstablog%2F11442671-gerald-klein%2F3096735-anatomy-of-a-short-attack)\n\nThis is what the shorts are doing right now. \n\nNeed more proof? \n\nJim Cramer himself, \n[\"here's what short sellers do, it's illegal but when you have 6 days to get out and you're down you need to foment and wipe that guy out quickly\".](https://youtu.be/VMuEis3byY4)\n\n\nInvestopedia [\"Short and Distort\" - illegal short tactic ](https://www.investopedia.com/articles/analyst/030102.asp#:~:text=Short%20and%20distort%20(S%26D)\n\n**Dont feel like reading a novel? The short and dirty (TLDR AT THE FUCKING BOTTOM):**\n\n \nShort Attack:\n\n1. Sell **fake**, COUNTERFEIT stocks between hedge funds and increasingly lower ask prices to try to scare other investors into selling and/or to trigger limit sell price points. They've been doing this all week. Each major price drop has been because of this tactic.\n\n\n2. Get the media to spread fear, doubt, and uncertainty. Anyone watching CNBC this week has seen this in action.\n\n\n3. Spread disinformation through \"analysis\" to get people to sell their stocks because \"the fundamentals aren't there\". Again, this is all over the place right now.\n\n\n4. Open class action lawsuits against the company/shareholders claiming they're artificially inflating the stock price. Haven't seen it yet, but they've definitely threatened it.\n\n\n5. Get the government/SEC involved alleging the same as #4. Definitely happening.\n\n\n6. Pull margin shares and sell them. As seen being done by Robinhood over the last two days.\n\n\n7. Spread FUD on message boards. Hello 4 million new subs pushing AMC, BB, SLV, etc.\n\nBasically this past week has been 9/10 of the tactics in the short attack playbook to try to either push Gamestop into bankruptcy so they can profit on their short positions or slowly gain them back when people sell their stocks.\n\nStill TLDR: hedge funds lying in the media and selling fake stocks that don't exist to scare us. They don't know our apps don't even have a sell button, only a liftoff button for the 🚀🚀🚀\n\n🚀 🚀 🚀 🚀 👩‍🚀 👨‍🚀 🌙 🌔 🌖 🌛 🌜 🌕",
        "created_utc": 1612057873,
        "id": "glfmppi",
        "permalink": "/r/wallstreetbets/comments/l8zznp/udeepfuckingvalue_hitting_front_pages_out_here_in/glfmppi/",
        "score": 1395,
        "subreddit": "wallstreetbets",
        "created": 1612086673.0
    },
    {
        "author": "turbulent_farts",
        "body": "This needs to be more visible:\n\n[https://www.youtube.com/watch?v=QFfjX8dW-QQ&amp;feature=youtu.be](https://www.youtube.com/watch?v=QFfjX8dW-QQ&amp;feature=youtu.be) \\- Jim Cramer when he was a hedge fund manager in 2006 saying how they fuck with the markets. Starts at around 7:30.",
        "created_utc": 1612030233,
        "id": "gle2dkd",
        "permalink": "/r/wallstreetbets/comments/l8rlea/good_morning_to_everyone_except_robinhood/gle2dkd/",
        "score": 1354,
        "subreddit": "wallstreetbets",
        "created": 1612059033.0
    },
    {
        "author": "turbulent_farts",
        "body": "Hijacking a comment here mate,\n\nThis needs to be more visible:\n\n[https://www.youtube.com/watch?v=QFfjX8dW-QQ&amp;feature=youtu.be](https://www.youtube.com/watch?v=QFfjX8dW-QQ&amp;feature=youtu.be) \\- Jim Cramer when he was a hedge fund manager in 2006 saying how they fuck with the markets. Starts at around 7:30.",
        "created_utc": 1612030366,
        "id": "gle2nxx",
        "permalink": "/r/wallstreetbets/comments/l8rf4k/times_square_right_now/gle2nxx/",
        "score": 1292,
        "subreddit": "wallstreetbets",
        "created": 1612059166.0
    },
    {
        "author": "ScipioAtTheGate",
        "body": "[Buy on margin and when the margin call comes you'll be left holding a bag of pennies where your dollars were before.](https://www.youtube.com/watch?v=Mc3t3IVkq60) Interactive brokers is notorious for being ruthless with margin calls, which is a cost of doing business to get access to their absurdly low margin rates.",
        "created_utc": 1611866599,
        "id": "gl564x6",
        "permalink": "/r/wallstreetbets/comments/l75pa1/robinhood_is_selling_peoples_gamestop_shares/gl564x6/",
        "score": 1268,
        "subreddit": "wallstreetbets",
        "created": 1611895399.0
    },
    {
        "author": "Cyromaniap",
        "body": "[💎 🙌💎 🙌💎 🙌💎 🙌💎 🙌💎 🙌💎 🙌](https://www.youtube.com/watch?v=7eL1Bfv8Y9k)",
        "created_utc": 1611951460,
        "id": "gla8ogf",
        "permalink": "/r/wallstreetbets/comments/l82qwt/we_have_almost_won_our_first_major_battle/gla8ogf/",
        "score": 1128,
        "subreddit": "wallstreetbets",
        "created": 1611980260.0
    },
    {
        "author": "dutch1664",
        "body": "He said the same on CNBC  -&gt; [https://www.youtube.com/watch?v=7RH4XKP55fM](https://www.youtube.com/watch?v=7RH4XKP55fM)\n\n&amp;#x200B;\n\nThis should be the first piece of evidence in court.",
        "created_utc": 1611868657,
        "id": "gl5bz3a",
        "permalink": "/r/wallstreetbets/comments/l791gh/who_stopped_the_losses_for_the_millions_who_lost/gl5bz3a/",
        "score": 1075,
        "subreddit": "wallstreetbets",
        "created": 1611897457.0
    },
    {
        "author": "tomzephy",
        "body": "Credit [u/PlayFree_Bird](https://www.reddit.com/u/PlayFree_Bird)\n\nOkay, has this place quieted down enough for some actual DD written by a monkey with a keyboard and Adderall? Let me explain to you what happened, play by play. I will give you illiterates who hate reading a spoiler up front: We were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market. Do I have your attention? Here goes:\n\nYesterday, new call option strike prices were added all the way up to $570. Do I have to go over gamma squeezes again? Really? We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock. This creates upwards pressure on the market. We've been seeing these movements all week.\n\nYesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off. It didn't work.\n\nLast night, Robinhood sent out a message to users: you could no longer enter into new options. You could exercise them if you had the collateral (money in the account) to do so. Very interesting and the first sign of pants-shitting fear.\n\nToday, the market opened very strong. It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n\nAt approximately 9:58 am, the stock had reached $468 in a parabolic move.\n\nTwo minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n\nThe trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it. What does that mean? It means they ran out of shares and/or capital. They wouldn't let you buy new shares because we were burning through all the shares on the market. I saw an unsubstantiated post from a user who said a small sell limit order excited at $2600 for him. Do you get the severity of the situation, if true? It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares.\n\nHow do you get infinite upwards pressure? A gamma squeeze triggering the mother of all short squeezes, just like we predicted. The call writers need shares to hedge. Retail is still buying more. The short sellers need over 100% of the float back. Add these together. There were more shares needed than existed on the open market. That's what a liquidity crisis is.\n\nListen to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home: https://www.youtube.com/watch?v=7RH4XKP55fM DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello! He's not talking about the market for GME shares. He's talking about the entire market! The New York Stock Exchange. The NASDAQ. All that.\n\nRemember the movie Snowpiercer? Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets? Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\n\nIt kick starts a full blown rebellion. They have no bullets. It's the exact same in this market: No capital. No shares. Infinite losses inbound.\n\nTL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares. Do you get that? HOLD. Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede. That's how we win.\n\nThey needed your shares so badly that they literally risked PRISON TIME to get them. They tried robbing you, and I'm not even exaggerating. They were within 30 seconds of all being wiped out today.\n\nEdit1: 🚀🚀🚀\n\nEdit2: I wish I was Elon's adopted asian child\n\nEdit3: we like the stock\n\nFull Casino? They just showed their hand before the river. ALL IN GME\n\nhttp://isthesqueezesquoze.com/",
        "created_utc": 1611877730,
        "id": "gl5yt5z",
        "permalink": "/r/wallstreetbets/comments/l7cvj0/the_largest_robinhood_stock_trading_group_on/gl5yt5z/",
        "score": 1044,
        "subreddit": "wallstreetbets",
        "created": 1611906530.0
    },
    {
        "author": "traderjay_toronto",
        "body": "Marc is a very respected short seller that only go after real fraudulent companies. \n\n[https://www.youtube.com/watch?v=cGtR3JX5Aao](https://www.youtube.com/watch?v=cGtR3JX5Aao)\n\nHe send the real criminals to jail - [https://www.wsj.com/articles/mimedx-ex-senior-executives-indicted-on-fraud-charges-11574789916](https://www.wsj.com/articles/mimedx-ex-senior-executives-indicted-on-fraud-charges-11574789916)",
        "created_utc": 1611890071,
        "id": "gl6q9lj",
        "permalink": "/r/wallstreetbets/comments/l7h905/marc_cohodes_says_has_the_evidence_to_blow_up/gl6q9lj/",
        "score": 973,
        "subreddit": "wallstreetbets",
        "created": 1611918871.0
    },
    {
        "author": "gwh21",
        "body": "This is the wildest example of diamond hands I have ever seen\n\nPart of me is just yelling, \"SELL IT YOU IDIOT!! YOU GET TO WALK WITH 9M AFTER TAX!! YOU WON! RUN FOR THE HILLS!!'\n\nThe other part of me, [\"HOLD IT AND MILK THEM FOR ALL THOSE FUCKS ARE WORTH!\"](https://www.youtube.com/watch?v=7uW47jWLMiY)",
        "created_utc": 1611351583,
        "id": "gk8t76s",
        "permalink": "/r/wallstreetbets/comments/l2x7he/gme_yolo_update_jan_22_2021/gk8t76s/",
        "score": 934,
        "subreddit": "wallstreetbets",
        "created": 1611380383.0
    },
    {
        "author": "iron_condor_salesman",
        "body": "Your honor, according to the precedent set in the case of Tesla v. Gay Bears, bears are fuk.",
        "created_utc": 1611457672,
        "id": "gkhk71s",
        "permalink": "/r/wallstreetbets/comments/l3qsa6/lawsuits_will_be_filed_as_scare_tactics/gkhk71s/",
        "score": 908,
        "subreddit": "wallstreetbets",
        "created": 1611486472.0
    },
    {
        "author": "CrimsonSun99",
        "body": "##[WE LIKE THE STOCK](https://www.youtube.com/watch?v=fmJUOeO_Vdc) 🎵\n\n\n💎🤚\n\n \n##🚀\n####🚀 \n#####🚀",
        "created_utc": 1611970843,
        "id": "glbi2q4",
        "permalink": "/r/wallstreetbets/comments/l89r5g/gme_shareholders_today/glbi2q4/",
        "score": 811,
        "subreddit": "wallstreetbets",
        "created": 1611999643.0
    },
    {
        "author": "BroadIntroduction575",
        "body": "[He is 100% larping as Peter Gregory from Silicon Valley.](https://www.youtube.com/watch?v=kxh2X6NjuhY)",
        "created_utc": 1610982463,
        "id": "gjq48yx",
        "permalink": "/r/wallstreetbets/comments/kzu2rh/good_gourd/gjq48yx/",
        "score": 682,
        "subreddit": "wallstreetbets",
        "created": 1611011263.0
    },
    {
        "author": "TheMapleStaple",
        "body": "I hate her and TYT, but she ain't wrong. I've been watching a number of interviews this morning, and man...what a fucking joke. [Here's one with some retard calling for a 30 day halt in trading GME](https://www.youtube.com/watch?v=AA5cDvMn1Ks) because he says people don't know what they're doing. And? FUCKING AND!? What the fuck have retail investors been doing this entire fucking time? These fucking jackasses are praying to be bailed out and have the gall to pretend they're doing so to protect retail investors and not themselves. Got caught with their hand in the cookie jar and trying to blame it on the cookies. Got bent the fuck over, and now wanna change the rules.",
        "created_utc": 1611778063,
        "id": "gkzr8d6",
        "permalink": "/r/wallstreetbets/comments/l6b69k/preach/gkzr8d6/",
        "score": 669,
        "subreddit": "wallstreetbets",
        "created": 1611806863.0
    },
    {
        "author": "Sla5021",
        "body": "It's like Occupy Wallstreet v.2.\n\n&amp;#x200B;\n\nCan't gas me from here, bro.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n(Paranoia increases.....)",
        "created_utc": 1611768901,
        "id": "gkz3sg6",
        "permalink": "/r/wallstreetbets/comments/l68xm1/cnbc_gives_billionaires_a_pass_but_calls_for/gkz3sg6/",
        "score": 666,
        "subreddit": "wallstreetbets",
        "created": 1611797701.0
    },
    {
        "author": "hash-slingin-slashur",
        "body": "He should also have a clothing line that specializes in Deep Fucking V-necks.",
        "created_utc": 1611941417,
        "id": "gl9g3v7",
        "permalink": "/r/wallstreetbets/comments/l7weuu/wsb_pioneer_fearless_bag_holder_better_than/gl9g3v7/",
        "score": 626,
        "subreddit": "wallstreetbets",
        "created": 1611970217.0
    },
    {
        "author": "ZeusThunder369",
        "body": "It's not the brokers, it's the clearing firms FORCING the brokers to stop buying on these stocks\n\n[https://www.youtube.com/watch?v=4RS4JIEVyXM](https://www.youtube.com/watch?v=4RS4JIEVyXM)\n\nWe are right to be angry, but we are angry at the wrong people.",
        "created_utc": 1611876002,
        "id": "gl5us1e",
        "permalink": "/r/wallstreetbets/comments/l7bpf5/30_seconds_from_triggering_market_nuclear_bomb/gl5us1e/",
        "score": 600,
        "subreddit": "wallstreetbets",
        "created": 1611904802.0
    },
    {
        "author": "wheresbrent",
        "body": " \n\nCredit u/PlayFree_Bird\n\nOkay, has this place quieted down enough for some actual DD written by a monkey with a keyboard and Adderall? Let me explain to you what happened, play by play. I will give you illiterates who hate reading a spoiler up front: We were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market. Do I have your attention? Here goes:\n\nYesterday, new call option strike prices were added all the way up to $570. Do I have to go over gamma squeezes again? Really? We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock. This creates upwards pressure on the market. We've been seeing these movements all week.\n\nYesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off. It didn't work.\n\nLast night, Robinhood sent out a message to users: you could no longer enter into new options. You could exercise them if you had the collateral (money in the account) to do so. Very interesting and the first sign of pants-shitting fear.\n\nToday, the market opened very strong. It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n\nAt approximately 9:58 am, the stock had reached $468 in a parabolic move.\n\nTwo minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n\nThe trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it. What does that mean? It means they ran out of shares and/or capital. They wouldn't let you buy new shares because we were burning through all the shares on the market. I saw an unsubstantiated post from a user who said a small sell limit order excited at $2600 for him. Do you get the severity of the situation, if true? It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares.\n\nHow do you get infinite upwards pressure? A gamma squeeze triggering the mother of all short squeezes, just like we predicted. The call writers need shares to hedge. Retail is still buying more. The short sellers need over 100% of the float back. Add these together. There were more shares needed than existed on the open market. That's what a liquidity crisis is.\n\nListen to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home: [https://www.youtube.com/watch?v=7RH4XKP55fM DO](https://www.youtube.com/watch?v=7RH4XKP55fM%C2%A0DO) YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello! He's not talking about the market for GME shares. He's talking about the entire market! The New York Stock Exchange. The NASDAQ. All that.\n\nRemember the movie Snowpiercer? Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets? Go to the 1:00 minute mark of this link: [https://www.youtube.com/watch?v=EH1EtiOhr6o](https://www.youtube.com/watch?v=EH1EtiOhr6o)\n\nIt kick starts a full blown rebellion. They have no bullets. It's the exact same in this market: No capital. No shares. Infinite losses inbound.\n\nTL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares. Do you get that? HOLD. Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede. That's how we win.\n\nThey needed your shares so badly that they literally risked PRISON TIME to get them. They tried robbing you, and I'm not even exaggerating. They were within 30 seconds of all being wiped out today.\n\nEdit1: 🚀🚀🚀\n\nEdit2: I wish I was Elon's adopted asian child\n\nEdit3: we like the stock\n\nFull Casino? They just showed their hand before the river. ALL IN GME\n\n[http://isthesqueezesquoze.com/](http://isthesqueezesquoze.com/)",
        "created_utc": 1611881319,
        "id": "gl6706y",
        "permalink": "/r/wallstreetbets/comments/l7e9gf/my_theory_for_the_future_of_gme_and_amc/gl6706y/",
        "score": 590,
        "subreddit": "wallstreetbets",
        "created": 1611910119.0
    },
    {
        "author": "Raksmey_",
        "body": "Credit u/PlayFree_Bird\n\nOkay, has this place quieted down enough for some actual DD written by a monkey with a keyboard and Adderall? Let me explain to you what happened, play by play. I will give you illiterates who hate reading a spoiler up front: We were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market. Do I have your attention? Here goes:\n\nYesterday, new call option strike prices were added all the way up to $570. Do I have to go over gamma squeezes again? Really? We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock. This creates upwards pressure on the market. We've been seeing these movements all week.\n\nYesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off. It didn't work.\n\nLast night, Robinhood sent out a message to users: you could no longer enter into new options. You could exercise them if you had the collateral (money in the account) to do so. Very interesting and the first sign of pants-shitting fear.\n\nToday, the market opened very strong. It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n\nAt approximately 9:58 am, the stock had reached $468 in a parabolic move.\n\nTwo minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n\nThe trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it. What does that mean? It means they ran out of shares and/or capital. They wouldn't let you buy new shares because we were burning through all the shares on the market. I saw an unsubstantiated post from a user who said a small sell limit order excited at $2600 for him. Do you get the severity of the situation, if true? It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares.\n\nHow do you get infinite upwards pressure? A gamma squeeze triggering the mother of all short squeezes, just like we predicted. The call writers need shares to hedge. Retail is still buying more. The short sellers need over 100% of the float back. Add these together. There were more shares needed than existed on the open market. That's what a liquidity crisis is.\n\nListen to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home: https://www.youtube.com/watch?v=7RH4XKP55fM DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello! He's not talking about the market for GME shares. He's talking about the entire market! The New York Stock Exchange. The NASDAQ. All that.\n\nRemember the movie Snowpiercer? Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets? Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\n\nIt kick starts a full blown rebellion. They have no bullets. It's the exact same in this market: No capital. No shares. Infinite losses inbound.\n\nTL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares. Do you get that? HOLD. Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede. That's how we win.\n\nThey needed your shares so badly that they literally risked PRISON TIME to get them. They tried robbing you, and I'm not even exaggerating. They were within 30 seconds of all being wiped out today.\n\nEdit1: 🚀🚀🚀\n\nEdit2: I wish I was Elon's adopted asian child\n\nEdit3: we like the stock\n\nFull Casino? They just showed their hand before the river. ALL IN GME\n\nhttp://isthesqueezesquoze.com/",
        "created_utc": 1611895588,
        "id": "gl729d0",
        "permalink": "/r/wallstreetbets/comments/l7jgk3/they_underestimated_how_retarded_we_are/gl729d0/",
        "score": 548,
        "subreddit": "wallstreetbets",
        "created": 1611924388.0
    },
    {
        "author": "JustTheWriter",
        "body": "Here it is for anyone who hasn't: https://www.youtube.com/watch?v=ugkLNEhvj-Y&amp;feature=youtu.be",
        "created_utc": 1611865374,
        "id": "gl52qe6",
        "permalink": "/r/wallstreetbets/comments/l77a2d/tyler_winklevoss_announces_gemini_creating_new/gl52qe6/",
        "score": 533,
        "subreddit": "wallstreetbets",
        "created": 1611894174.0
    },
    {
        "author": "MildZMonkey",
        "body": "We should have an [Internet Referendum](https://www.youtube.com/watch?v=zp-Jw-5Kx8k) to decide their fate.  It's what CNBC would want.",
        "created_utc": 1612105683,
        "id": "glhgtui",
        "permalink": "/r/wallstreetbets/comments/l9dfxq/only_47_left_to_go/glhgtui/",
        "score": 523,
        "subreddit": "wallstreetbets",
        "created": 1612134483.0
    },
    {
        "author": "Raksmey_",
        "body": "Credit u/PlayFree_Bird\n\nOkay, has this place quieted down enough for some actual DD written by a monkey with a keyboard and Adderall? Let me explain to you what happened, play by play. I will give you illiterates who hate reading a spoiler up front: We were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market. Do I have your attention? Here goes:\n\nYesterday, new call option strike prices were added all the way up to $570. Do I have to go over gamma squeezes again? Really? We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock. This creates upwards pressure on the market. We've been seeing these movements all week.\n\nYesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off. It didn't work.\n\nLast night, Robinhood sent out a message to users: you could no longer enter into new options. You could exercise them if you had the collateral (money in the account) to do so. Very interesting and the first sign of pants-shitting fear.\n\nToday, the market opened very strong. It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n\nAt approximately 9:58 am, the stock had reached $468 in a parabolic move.\n\nTwo minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n\nThe trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it. What does that mean? It means they ran out of shares and/or capital. They wouldn't let you buy new shares because we were burning through all the shares on the market. I saw an unsubstantiated post from a user who said a small sell limit order excited at $2600 for him. Do you get the severity of the situation, if true? It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares.\n\nHow do you get infinite upwards pressure? A gamma squeeze triggering the mother of all short squeezes, just like we predicted. The call writers need shares to hedge. Retail is still buying more. The short sellers need over 100% of the float back. Add these together. There were more shares needed than existed on the open market. That's what a liquidity crisis is.\n\nListen to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home: https://www.youtube.com/watch?v=7RH4XKP55fM DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello! He's not talking about the market for GME shares. He's talking about the entire market! The New York Stock Exchange. The NASDAQ. All that.\n\nRemember the movie Snowpiercer? Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets? Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\n\nIt kick starts a full blown rebellion. They have no bullets. It's the exact same in this market: No capital. No shares. Infinite losses inbound.\n\nTL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares. Do you get that? HOLD. Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede. That's how we win.\n\nThey needed your shares so badly that they literally risked PRISON TIME to get them. They tried robbing you, and I'm not even exaggerating. They were within 30 seconds of all being wiped out today.\n\nEdit1: 🚀🚀🚀\n\nEdit2: I wish I was Elon's adopted asian child\n\nEdit3: we like the stock\n\nFull Casino? They just showed their hand before the river. ALL IN GME\n\nhttp://isthesqueezesquoze.com/",
        "created_utc": 1611895561,
        "id": "gl727ex",
        "permalink": "/r/wallstreetbets/comments/l7jhso/wall_street_is_scared/gl727ex/",
        "score": 516,
        "subreddit": "wallstreetbets",
        "created": 1611924361.0
    },
    {
        "author": "aellh",
        "body": "Thomas Peterffy, CM Interactive Brokers, just said on Bloomberg short squeezing is ILLEGAL, and they CLOSED OUT POSITIONS FOR THEIR CLIENTS, most of which were SHORT. This is just ADMITTING MARKET MANIPULATION? Don't allow BUYERS, but still CLOSE HEDGE FUNDS SHORTS?\n\n[https://www.youtube.com/watch?v=dp8PhLsUcFE](https://www.youtube.com/watch?v=dp8PhLsUcFE)\n\ninterview rougly 1h 45m ago",
        "created_utc": 1611872858,
        "id": "gl5nbe9",
        "permalink": "/r/wallstreetbets/comments/l79x17/it_runs_very_deep_my_friends/gl5nbe9/",
        "score": 512,
        "subreddit": "wallstreetbets",
        "created": 1611901658.0
    },
    {
        "author": "MikalChe",
        "body": " \n\nThat is FUCKING AWEEEESOME!!!!\n\nHave you guys seen this video from Jim Cramer???\n\nSomeones gonna get fiiiired....\n\n[https://www.youtube.com/watch?v=EaNuRsNA0OU&amp;feature=youtu.be](https://www.youtube.com/watch?v=EaNuRsNA0OU&amp;feature=youtu.be)",
        "created_utc": 1612044034,
        "id": "glevm94",
        "permalink": "/r/wallstreetbets/comments/l8wq3k/after_the_squeeze_has_been_squoze_stay_strong_you/glevm94/",
        "score": 511,
        "subreddit": "wallstreetbets",
        "created": 1612072834.0
    },
    {
        "author": "CheeseYogi",
        "body": "[Wow, they pulled the full interview on YouTube due to ‘NBC Copyright Violations’](https://m.youtube.com/watch?fbclid=IwAR0eiPjCDcxHoQga2kLryl8wWW6asuGLUy0G77yPq-x_-_6G2sh_A8TxIuQ&amp;v=2h7jfNpL4QA&amp;feature=youtu.be)🤔🤔",
        "created_utc": 1611810256,
        "id": "gl1vj9y",
        "permalink": "/r/wallstreetbets/comments/l6ocfn/im_so_fucking_proud_of_every_single_person_in_or/gl1vj9y/",
        "score": 469,
        "subreddit": "wallstreetbets",
        "created": 1611839056.0
    },
    {
        "author": "600300",
        "body": "30 Seconds From Triggering Market Nuclear Bomb\n\nI'm glad this place has quieted down enough for some actual DD written by a monkey with a keyboard and Adderall.\n\nDisclaimer: I am that monkey.  Let me explain to you what happened, play by play.  I will give you illiterates who hate reading a spoiler up front:\n\nWe were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market. Do I have your attention?  Here goes:\n\n1.\t⁠⁠Yesterday, new call option strike prices were added all the way up to $570.  Do I have to go over gamma squeezes again?  Really?  We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock.  This creates upwards pressure on the market.  We've been seeing these movements all week.\n2.\t⁠⁠Yesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off.  It didn't work.\n3.\t⁠⁠Last night, Robinhood sent out a message to users: you could no longer enter into new options.  You could exercise them if you had the collateral (money in the account) to do so.  Very interesting and the first sign of pants-shitting fear.\n4.\t⁠⁠Today, the market opened very strong.  It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n5.\t⁠⁠At approximately 9:58 am, the stock had reached $468 in a parabolic move.\n6.\t⁠⁠Two minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n7.\t⁠⁠The trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it.  What does that mean?  It means they ran out of shares and/or capital. They wouldn't let you buy new shares because we were burning through all the shares on the market.\n\nI saw an unsubstantiated post from a user who said a small sell limit order executed at $2600 for him.  Do you get the severity of the situation, if that's true? It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares.  It means virtually any ask was getting bid.\n\nHow do you get infinite upwards pressure?  A gamma squeeze triggering the mother of all short squeezes, just like we predicted.  The call writers need shares to hedge.  Retail is still buying more.  The short sellers need over 100% of the float back.  Add these together.  There were more shares needed than existed on the open market.  That's what a liquidity crisis is.\n\nListen to this to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home.  DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello!  He's not talking about the market for GME shares.  He's talking about the entire market!  The New York Stock Exchange.  The NASDAQ.  All that.\n\nRemember the movie Snowpiercer?  Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets?  Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\n\nIt kick starts a full blown rebellion.  They have no bullets.  It's the exact same in this market:  No capital.  No shares.  Infinite losses inbound.\n\nTL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares.  Do you get that?  HOLD.  Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede.  That's how we win.\n\nThey needed your shares so badly that they literally risked PRISON TIME to get them.  They tried robbing you, and I'm not even exaggerating.  They were within 30 seconds of all being wiped out today.\n\nCredit: u/PlayFree_Bird",
        "created_utc": 1611883279,
        "id": "gl6bbl2",
        "permalink": "/r/wallstreetbets/comments/l7ept4/daily_discussion_thread_part_6_for_january_28_2021/gl6bbl2/",
        "score": 462,
        "subreddit": "wallstreetbets",
        "created": 1611912079.0
    },
    {
        "author": "aaron8819",
        "body": "Credit u/PlayFree_Bird\n\nOkay, has this place quieted down enough for some actual DD written by a monkey with a keyboard and Adderall? Let me explain to you what happened, play by play. I will give you illiterates who hate reading a spoiler up front: We were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market. Do I have your attention? Here goes:\n\nYesterday, new call option strike prices were added all the way up to $570. Do I have to go over gamma squeezes again? Really? We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock. This creates upwards pressure on the market. We've been seeing these movements all week.\n\nYesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off. It didn't work.\n\nLast night, Robinhood sent out a message to users: you could no longer enter into new options. You could exercise them if you had the collateral (money in the account) to do so. Very interesting and the first sign of pants-shitting fear.\n\nToday, the market opened very strong. It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n\nAt approximately 9:58 am, the stock had reached $468 in a parabolic move.\n\nTwo minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n\nThe trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it. What does that mean? It means they ran out of shares and/or capital. They wouldn't let you buy new shares because we were burning through all the shares on the market. I saw an unsubstantiated post from a user who said a small sell limit order excited at $2600 for him. Do you get the severity of the situation, if true? It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares.\n\nHow do you get infinite upwards pressure? A gamma squeeze triggering the mother of all short squeezes, just like we predicted. The call writers need shares to hedge. Retail is still buying more. The short sellers need over 100% of the float back. Add these together. There were more shares needed than existed on the open market. That's what a liquidity crisis is.\n\nListen to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home: https://www.youtube.com/watch?v=7RH4XKP55fM DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello! He's not talking about the market for GME shares. He's talking about the entire market! The New York Stock Exchange. The NASDAQ. All that.\n\nRemember the movie Snowpiercer? Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets? Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\n\nIt kick starts a full blown rebellion. They have no bullets. It's the exact same in this market: No capital. No shares. Infinite losses inbound.\n\nTL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares. Do you get that? HOLD. Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede. That's how we win.\n\nThey needed your shares so badly that they literally risked PRISON TIME to get them. They tried robbing you, and I'm not even exaggerating. They were within 30 seconds of all being wiped out today.",
        "created_utc": 1611870713,
        "id": "gl5hpvd",
        "permalink": "/r/wallstreetbets/comments/l78za1/daily_discussion_thread_part_5_for_january_28_2021/gl5hpvd/",
        "score": 458,
        "subreddit": "wallstreetbets",
        "created": 1611899513.0
    },
    {
        "author": "ScipioAtTheGate",
        "body": "[Whats going on is literally like a comic book story, average ordinary traders turning into superheroes striking back against the evil fatcat brokers and hedge funds](https://www.youtube.com/watch?v=wXgOIbKxxcs)",
        "created_utc": 1611863108,
        "id": "gl4weiz",
        "permalink": "/r/wallstreetbets/comments/l74kzr/this_is_just_market_manipulation/gl4weiz/",
        "score": 455,
        "subreddit": "wallstreetbets",
        "created": 1611891908.0
    },
    {
        "author": "aellh",
        "body": "Can we PLEASE bring some attention to this:\n\nThomas Peterffy, CM Interactive Brokers, just said on Bloomberg short squeezing is ILLEGAL, and they CLOSED OUT POSITIONS FOR THEIR CLIENTS, most of which were SHORT. This is just ADMITTING MARKET MANIPULATION? Don't allow BUYERS, but still CLOSE HEDGE FUNDS SHORTS?\n\n[https://www.youtube.com/watch?v=dp8PhLsUcFE](https://www.youtube.com/watch?v=dp8PhLsUcFE)\n\ninterview rougly 2h 30m ago\n\nPlease people, reddit is not allowing me to make a post, can we get this out there thx",
        "created_utc": 1611876205,
        "id": "gl5v92x",
        "permalink": "/r/wallstreetbets/comments/l7b321/josh_shapiro_attorney_general_of_pennsylvania_is/gl5v92x/",
        "score": 444,
        "subreddit": "wallstreetbets",
        "created": 1611905005.0
    },
    {
        "author": "CrimsonSun99",
        "body": "##[WE LIKE THE STOCK](https://www.youtube.com/watch?v=fmJUOeO_Vdc) 🎵",
        "created_utc": 1611992655,
        "id": "glcj7fh",
        "permalink": "/r/wallstreetbets/comments/l8e3xz/you_guys_are_engaging_in_market_manipulation/glcj7fh/",
        "score": 417,
        "subreddit": "wallstreetbets",
        "created": 1612021455.0
    },
    {
        "author": "givemeyourpants",
        "body": "Jim Cramer in 2006 on how the hedge funds manipulate the markets:  \n\n[https://www.youtube.com/watch?v=CpMEFtPZJLc](https://www.youtube.com/watch?v=CpMEFtPZJLc)\n\n\"What's important when you're in that hedge fund mode, is to not do anything remotely truthful. Because the truth is so against your view, that it's important to create a new view, to create a fiction.\"\n\n\"Then you call the (Wall Street) Journal and get the bozo reporter in Research in Motion and you would feed that (rival) Palm's got a killer it's going to give away. These are all the things you must do on a day like today, and if you're not doing it, maybe you shouldn't be in the game.\"  \n\n“It might cost me $15 million or $20 million to knock RIM down but it would be fabulous because it would beleaguer all the moron longs who are also keying on Research in Motion.\"  \n\n[https://www.reuters.com/article/cramer-interview-idUKN2036292620070320](https://www.reuters.com/article/cramer-interview-idUKN2036292620070320)\n\n\"A lot of times when I was short at my hedge fund ... meaning I needed (a stock) down, I would create a level of activity beforehand that could drive the futures. It’s a fun game and it’s a lucrative game.\"  \n\n\"Who cares about the fundamentals? The great thing about the market is that it has nothing to do with the actual stocks.\"  \n\n\\- Jim Cramer, hedge fund manager 2006\n\n[Dealbook NY Times Article on Cramer's Interview](https://dealbook.nytimes.com/2007/03/20/cramer-market-manipulator/)\n\n[Investopedia Article: Short and Distort Bear Market Stock Manipulation](https://www.investopedia.com/articles/analyst/030102.asp#:~:text=Short%20and%20distort%20(S%26D))\n\n[Anatomy of a Short Attack](https://seekingalpha-com.cdn.ampproject.org/v/s/seekingalpha.com/amp/instablog/11442671-gerald-klein/3096735-anatomy-of-a-short-attack?amp_js_v=a6&amp;amp_gsa=1&amp;usqp=mq331AQHKAFQArABIA%3D%3D#aoh=16119453107704&amp;referrer=https%3A%2F%2Fwww.google.com&amp;amp_tf=From%20%251%24s&amp;ampshare=https%3A%2F%2Fseekingalpha.com%2Finstablog%2F11442671-gerald-klein%2F3096735-anatomy-of-a-short-attack)",
        "created_utc": 1612061697,
        "id": "glftxic",
        "permalink": "/r/wallstreetbets/comments/l8ynvf/50_billion_in_losses_to_hedge_funds_since_january/glftxic/",
        "score": 414,
        "subreddit": "wallstreetbets",
        "created": 1612090497.0
    },
    {
        "author": "cs_katalyst",
        "body": "That's why i bought GME at 350..  [beacuse](https://www.youtube.com/watch?v=SiUoBPO3gTU)",
        "created_utc": 1611790316,
        "id": "gl0m6jo",
        "permalink": "/r/wallstreetbets/comments/l6faq4/this_is_us_2030/gl0m6jo/",
        "score": 410,
        "subreddit": "wallstreetbets",
        "created": 1611819116.0
    },
    {
        "author": "ProbablyTrolling1",
        "body": "Oh no did somebody get outplayed in a system that they created\n\n[https://www.youtube.com/watch?v=SAXfiValVFs](https://www.youtube.com/watch?v=SAXfiValVFs)",
        "created_utc": 1611470943,
        "id": "gki6ay9",
        "permalink": "/r/wallstreetbets/comments/l3ucyv/goldman_sachs_alludes_to_gme_wsb/gki6ay9/",
        "score": 405,
        "subreddit": "wallstreetbets",
        "created": 1611499743.0
    },
    {
        "author": "aellh",
        "body": "Thomas Peterffy, CM Interactive Brokers, just said on Bloomberg short squeezing is ILLEGAL, and they CLOSED OUT POSITIONS FOR THEIR CLIENTS, most of which were SHORT. This is just ADMITTING MARKET MANIPULATION? Don't allow BUYERS, but still CLOSE HEDGE FUNDS SHORTS?\n\n[https://www.youtube.com/watch?v=dp8PhLsUcFE](https://www.youtube.com/watch?v=dp8PhLsUcFE)\n\ninterview rougly 1h 45m ago",
        "created_utc": 1611873441,
        "id": "gl5oqg0",
        "permalink": "/r/wallstreetbets/comments/l7aj2e/mic_drop/gl5oqg0/",
        "score": 393,
        "subreddit": "wallstreetbets",
        "created": 1611902241.0
    },
    {
        "author": "_-Al",
        "body": "Look at the charts, bud. Also, listen to someone more knowledgeable than us and don't lose yourself to fear: [https://www.youtube.com/watch?v=60H-NmTDKc4](https://www.youtube.com/watch?v=60H-NmTDKc4)  \nHedges will have to buy +30m shares tomorrow to cover for their options expiring.",
        "created_utc": 1611853792,
        "id": "gl48oe7",
        "permalink": "/r/wallstreetbets/comments/l70vmz/if_i_can_hold_at_10mm_then_you_can_hold_too/gl48oe7/",
        "score": 388,
        "subreddit": "wallstreetbets",
        "created": 1611882592.0
    },
    {
        "author": "aellh",
        "body": "Thomas Peterffy, CM Interactive Brokers, just said on Bloomberg short squeezing is ILLEGAL, and they CLOSED OUT POSITIONS FOR THEIR CLIENTS, most of which were SHORT. This is just ADMITTING MARKET MANIPULATION? Don't allow BUYERS, but still CLOSE HEDGE FUNDS SHORTS?\n\n[https://www.youtube.com/watch?v=dp8PhLsUcFE](https://www.youtube.com/watch?v=dp8PhLsUcFE)\n\ninterview rougly 1h 45m ago",
        "created_utc": 1611873588,
        "id": "gl5p3do",
        "permalink": "/r/wallstreetbets/comments/l7a9m0/jon_stewart_just_joined_twitter_and_he_likes_the/gl5p3do/",
        "score": 377,
        "subreddit": "wallstreetbets",
        "created": 1611902388.0
    },
    {
        "author": "RSG2033",
        "body": "Here’s the text in full from his comment that spawned this post: \n\nI'm glad this place has quieted down enough for some actual DD written by a monkey with a keyboard and Adderall.  Disclaimer: I am that monkey.  Let me explain to you what happened, play by play.  I will give you illiterates who hate reading a spoiler up front: We were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market. Do I have your attention?  Here goes:\n\n1.\t⁠Yesterday, new call option strike prices were added all the way up to $570.  Do I have to go over gamma squeezes again?  Really?  We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock.  This creates upwards pressure on the market.  We've been seeing these movements all week.\n2.\t⁠Yesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off.  It didn't work.\n3.\t⁠Last night, Robinhood sent out a message to users: you could no longer enter into new options.  You could exercise them if you had the collateral (money in the account) to do so.  Very interesting and the first sign of pants-shitting fear.\n4.\t⁠Today, the market opened very strong.  It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n5.\t⁠At approximately 9:58 am, the stock had reached $468 in a parabolic move.\n6.\t⁠Two minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n7.\t⁠The trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it.  What does that mean?  It means they ran out of shares and/or capital.  They wouldn't let you buy new shares because we were burning through all the shares on the market.  I saw an unsubstantiated post from a user who said a small sell limit order executed at $2600 for him.  Do you get the severity of the situation, if that's true?  It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares.  It means virtually any ask was getting bid.\n\nHow do you get infinite upwards pressure?  A gamma squeeze triggering the mother of all short squeezes, just like we predicted.  The call writers need shares to hedge.  Retail is still buying more.  The short sellers need over 100% of the float back.  Add these together.  There were more shares needed than existed on the open market.  That's what a liquidity crisis is.\n\nListen to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home.  DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello!  He's not talking about the market for GME shares.  He's talking about the entire market!  The New York Stock Exchange.  The NASDAQ.  All that.\n\nRemember the movie Snowpiercer?  Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets?  Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\n\nIt kick starts a full blown rebellion.  They have no bullets.  It's the exact same in this market:  No capital.  No shares.  Infinite losses inbound.\n\nTL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares.  Do you get that?  HOLD.  Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede.  That's how we win.\n\nThey needed your shares so badly that they literally risked PRISON TIME to get them.  They tried robbing you, and I'm not even exaggerating.  They were within 30 seconds of all being wiped out today.\n\n EDIT for all you people who like to see me fling my poo around: I made this its own post now.\n\nhttps://www.reddit.com/r/wallstreetbets/comments/l7bku5/some_thoughts_on_the_unprecedented_attack_that/",
        "created_utc": 1611877320,
        "id": "gl5xuo8",
        "permalink": "/r/wallstreetbets/comments/l7bku5/some_thoughts_on_the_unprecedented_attack_that/gl5xuo8/",
        "score": 377,
        "subreddit": "wallstreetbets",
        "created": 1611906120.0
    },
    {
        "author": "Sleavitt10",
        "body": "I tried to make this it's own post but it's not working so I'm commenting it instead:\n\n \n\nI've spent the last six hour compiling all of this information for you guys so I hope you enjoy!\n\nReading [/u/johnnydaggers](https://www.reddit.com/u/johnnydaggers/) post (which is currently at the top of WSB) has sent me down a rabbit hole of learning about Failures to Deliver and The OTCC:\n\n[https://www.reddit.com/r/wallstreetbets/comments/l97ykd/the\\_real\\_reason\\_wall\\_street\\_is\\_terrified\\_of\\_the/](https://www.reddit.com/r/wallstreetbets/comments/l97ykd/the_real_reason_wall_street_is_terrified_of_the/)\n\nIn my searching I found the below YouTube channel which has a treasure trove of videos posted 10-11 years ago outlying all this shit we've been talking about this week:\n\n[https://www.youtube.com/c/JuddBagley/videos](https://www.youtube.com/c/JuddBagley/videos)\n\nNow I know most of you guys and gals have the attention span of a gnat but for those of you that are able to sit still and watch something for more than 30 seconds you're going to want to watch these videos! They provide deep insight with plenty of url references for you to check out the source material for yourself.\n\nTwo Part Video Series (18 min total) about the SEC's Investigation Of Naked Shorting Of Sedona. A case study on how naked short sellers have destroyed hundreds and hundreds of publicly traded companies. He then goes on to explain how this can go on to effect the broader market:\n\n[https://www.youtube.com/watch?v=hH5cMQLJRUo&amp;t=8s](https://www.youtube.com/watch?v=hH5cMQLJRUo&amp;t=8s)\n\nNine part (Approx 80 min total) series about the corruption of our capital markets due to naked short selling and \"failures to deliver\". He goes over a number of topics just as FTD's (Failures to deliver), how prevalent they are, how long they can last for and the risk they pose to the financial system. He also talks about the DTCC and it's role in clearing money and shares through the market and how it has a history of downplaying the amount of FTD's. Just watch the first (5 min) video and you'll be hooked:\n\n[https://www.youtube.com/watch?v=gpWzOjB8qtU](https://www.youtube.com/watch?v=gpWzOjB8qtU)\n\nIf you didn't watch the above series at least watch part 5 where he explains how the entire market could collapse as a result of a short squeeze on a heavily naked shorted stock:\n\n[https://www.youtube.com/watch?v=JKc0KQvvfWE](https://www.youtube.com/watch?v=JKc0KQvvfWE)\n\n&lt;1 min Video of SEC Chairman stumbling over his words as he answers the question \"do you know of the possibility of short selling taking down Bear Stearns\":\n\n[https://www.youtube.com/watch?v=acKWiE\\_rKXk](https://www.youtube.com/watch?v=acKWiE_rKXk)\n\nVideo explaining how someone bought WAYYY OTM weekly puts on Bear Stearns the day before Bear Stearns started tanking due to over ten million illegal naked short sells and how this started the Global Financial Crisis:\n\n[https://www.youtube.com/watch?v=xUKSU1qahgE](https://www.youtube.com/watch?v=xUKSU1qahgE)\n\nPart 2 of the above video where he goes over the SEC's lack of response to the naked short selling of Bear Stearns, Lehman Brothers, Fannie Mae and Freddie Mac:\n\n[https://www.youtube.com/watch?v=NcjssQSthNU](https://www.youtube.com/watch?v=NcjssQSthNU)\n\nPart 3 about how hundreds of millions of naked short sales of Lehman Brothers stock put the final nail in the coffin of the company causing the GFC. The SEC did nothing. Hedge fund managers like Jim Chanos and Steve Cohen have too much money and power to ever be prosecuted:\n\n[https://www.youtube.com/watch?v=Q48eSoTNByQ](https://www.youtube.com/watch?v=Q48eSoTNByQ)\n\n3 Min Video of a debate on Bloomberg where this Wall Street guy is arguing that short sellers should be able to sell short at will and should never have to actually borrow shares to be able to short:\n\n[https://www.youtube.com/watch?v=4oerYirYVFE](https://www.youtube.com/watch?v=4oerYirYVFE)\n\nThe Bear raid on Overstock.com and the journalists that enabled it (10 min):\n\n[https://www.youtube.com/watch?v=FHQeZ9czrKc&amp;t=4s](https://www.youtube.com/watch?v=FHQeZ9czrKc&amp;t=4s)\n\nCase study: In the final days of selling of Lehman Brothers stock there we over 150M failures to delivery naked shares sold short when the stock was selling for about $0.10. Imagine LEH ended up not going bankrupt. Imagine something happened and the price suddenly rebounded dramatically. These 150M naked shorts would be caught with their pants down and it would get bloody. The amount it would cost the financial system is the actual number of shares out there x the mean price those shareholders are willing to sell them for (knowing they have the buyers bent over a barrel). There have only ever been 71M shares of GME issued but institutions claim they own 102M shares of GME so how many shares are out there? Lets guess there are actually 200M shares out there and the average shareholder sells for $1000. That's $200B. If there is 333M shares and a $3000 share price that's $1T off of a measly $1B company that naked short sellers got greedy on. Who's going to foot this bill?\n\nTLDR; We're probably not even buying and selling actual shares of GME. When it looked like GME was \"on the ropes\" and there was a good narrative of why they should go bankrupt naked short sellers likely naked short sold an unknowable amount of fake \"IOU\" shares of GME because they thought it would for sure go bankrupt. This plan has worked for them hundreds and hundreds of times in the past making them hundreds of billions or even trillions of dollars. Some high profile examples include: Bear Stearns, Lehman Brothers, Fannie Mae and Freddie Mac. When these sharks smell blood in the water nothing is stopping them from naked short selling tens of millions of fake shares (over 100M in the last three days of Lehman Brothers) to innocent buyers who think they're getting a good deal which ultimately go to zero and equate to an infinite profit margin for the short sellers. What they didn't expect with GME was a bunch of retards doing what we've done over the past months and exposing their fraudulent naked short selling. We have no way to be certain how many shares are actually out there but [/u/johnnydaggers](https://www.reddit.com/u/johnnydaggers/) post shows there was 1.7M shares failed to deliver in December (before shit even hit the fan). The thing is this threatens to undermine the publics confidence in the entire system. How do we know that the shares that we think we are purchasing are actually legit? We could literally being paying good money for something that doesn't actually exist. What this means for GME is someone is going to have to step up and actually pay up for all of these phantom shares that aren't even supposed to exist. What price they will pay nobody knows.",
        "created_utc": 1612120362,
        "id": "glibq02",
        "permalink": "/r/wallstreetbets/comments/l9iqau/hold_gme_to_the_moon_dont_panic_and_listen_to/glibq02/",
        "score": 374,
        "subreddit": "wallstreetbets",
        "created": 1612149162.0
    },
    {
        "author": "Air320",
        "body": "[GameStop &amp; WSB - The video I was trying to avoid making. GME - Parick Boyle](https://www.youtube.com/watch?v=Qi5hTqQFhuA)\n\nThis London Kings College Economics Professor and Hedge Fund Manager explains what is going on with GME and WSB. His explanation is exactly what I've seen on several DD posts here. \n\nBTW, HOLD THE LINE! \n\nThis is for education and not financial advice, this is a respected economist saying the same things Redditors are saying in DD posts. STONKS TO THE MOON!",
        "created_utc": 1611782540,
        "id": "gl02uxa",
        "permalink": "/r/wallstreetbets/comments/l6e7at/gme_there_are_still_over_152k_open_calls_that/gl02uxa/",
        "score": 368,
        "subreddit": "wallstreetbets",
        "created": 1611811340.0
    },
    {
        "author": "angelrock420",
        "body": "GME AMC BB = 👨‍🚀🚀 e v o l u t i o n 🌑🦍\n\n\n💎 🙏🚀🚀🚀",
        "created_utc": 1611982146,
        "id": "glc4bhy",
        "permalink": "/r/wallstreetbets/comments/l8e3xz/you_guys_are_engaging_in_market_manipulation/glc4bhy/",
        "score": 364,
        "subreddit": "wallstreetbets",
        "created": 1612010946.0
    },
    {
        "author": "johnnydaggers",
        "body": "Cramer is very well-versed about how these things work. \n\nhttps://www.youtube.com/watch?v=VMuEis3byY4&amp;feature=emb_title\n\n I don't know if he did any counterfeiting, but yeah...",
        "created_utc": 1612082249,
        "id": "glgoskk",
        "permalink": "/r/wallstreetbets/comments/l97ykd/the_real_reason_wall_street_is_terrified_of_the/glgoskk/",
        "score": 360,
        "subreddit": "wallstreetbets",
        "created": 1612111049.0
    },
    {
        "author": "Booomers_Son",
        "body": "Check this out . Explains it in detail what they do.\n\n[short attack](https://seekingalpha-com.cdn.ampproject.org/v/s/seekingalpha.com/amp/instablog/11442671-gerald-klein/3096735-anatomy-of-a-short-attack?amp_js_v=a6&amp;amp_gsa=1&amp;usqp=mq331AQHKAFQArABIA%3D%3D#aoh=16119453107704&amp;referrer=https%3A%2F%2Fwww.google.com&amp;amp_tf=From%20%251%24s&amp;ampshare=https%3A%2F%2Fseekingalpha.com%2Finstablog%2F11442671-gerald-klein%2F3096735-anatomy-of-a-short-attack)",
        "created_utc": 1612026060,
        "id": "gldt5wr",
        "permalink": "/r/wallstreetbets/comments/l8pegt/i_get_it_now_i_completely_understand_why_nobody/gldt5wr/",
        "score": 351,
        "subreddit": "wallstreetbets",
        "created": 1612054860.0
    },
    {
        "author": "eliten0ob",
        "body": "Some people are campaigning for this like Chamath. \n\nhttps://twitter.com/chamath/status/1354883147523997697 \n\nhttps://www.youtube.com/watch?v=T9g0TpzE3DE \n\nLook at Elon Musk tweets as well. He also hates shorty hedge funds.  \nThey just have too much money that they donate to high profile politicians and media members.",
        "created_utc": 1612104598,
        "id": "glhf26w",
        "permalink": "/r/wallstreetbets/comments/l9czx4/this_is_what_covering_their_ass_looks_like/glhf26w/",
        "score": 336,
        "subreddit": "wallstreetbets",
        "created": 1612133398.0
    },
    {
        "author": "tRowLow",
        "body": "Michael jordan bleeding out keep it up lol\n\nhttps://basketballforever-com.cdn.ampproject.org/v/s/basketballforever.com/2021/01/28/michael-jordan-caught-in-middle-of-gamestop-trading-war-2?amp_js_v=a6&amp;amp_gsa=1&amp;amp&amp;usqp=mq331AQFKAGwASA%3D#aoh=16119549932095&amp;csi=0&amp;referrer=https%3A%2F%2Fwww.google.com&amp;amp_tf=From%20%251%24s&amp;ampshare=https%3A%2F%2Fbasketballforever.com%2F2021%2F01%2F28%2Fmichael-jordan-caught-in-middle-of-gamestop-trading-war-2",
        "created_utc": 1611960093,
        "id": "glav9x5",
        "permalink": "/r/wallstreetbets/comments/l86h74/we_did_it_boys_gamma_squeeze_incoming/glav9x5/",
        "score": 321,
        "subreddit": "wallstreetbets",
        "created": 1611988893.0
    },
    {
        "author": "Clawkwork",
        "body": "If GME dumps at open we have to show the shorts the sharpest V shaped buy the fucking dip they have ever seen.",
        "created_utc": 1610712737,
        "id": "gjc47hu",
        "permalink": "/r/wallstreetbets/comments/kxsd2p/daily_discussion_thread_for_january_15_2021/gjc47hu/",
        "score": 319,
        "subreddit": "wallstreetbets",
        "created": 1610741537.0
    },
    {
        "author": "discodave333",
        "body": "Cramer and Citron are desperately trying to frame this as WSB v Citron/Melvin.\n\nThe more they do that, the more they can ignore the fact that serious investors are also in this, that the company is undervalued and that short squeeze or not, the share price will go up.",
        "created_utc": 1611234261,
        "id": "gk21wzd",
        "permalink": "/r/wallstreetbets/comments/l1xtan/gme_megathread_lemon_party_2_electric_boogaloo/gk21wzd/",
        "score": 315,
        "subreddit": "wallstreetbets",
        "created": 1611263061.0
    },
    {
        "author": "IAmHairyChicken",
        "body": "Please all you new people learn about u/controlthenarrative and the GUH heard aorund the world\n\n[https://www.youtube.com/watch?v=d80ahvRSV8E&amp;ab\\_channel=Bewitzz](https://www.youtube.com/watch?v=d80ahvRSV8E&amp;ab_channel=Bewitzz)",
        "created_utc": 1611956802,
        "id": "glanoot",
        "permalink": "/r/wallstreetbets/comments/l856qs/serious_wsb_lifetime_channel_moments/glanoot/",
        "score": 298,
        "subreddit": "wallstreetbets",
        "created": 1611985602.0
    },
    {
        "author": "jwsuperdupe",
        "body": " Don’t let their propaganda scare you!\n\nPlease young folks spread this! This is exactly what they are doing right now!! I’m trying, but I’m old and feeble (and drunk)\n\n[https://www.youtube.com/watch?v=VMuEis3byY4&amp;t=23s](https://www.youtube.com/watch?v=VMuEis3byY4&amp;t=23s)\n\ngo to 1:40 (whole video is interesting too). He explains what these dirty fucks are doing right now. If everyone bought 1 share of GME and held, the shorts would be in a position that they could NEVER cover.\n\nThe fucks that caused the crisis in 08 are at it again, but this time you can be the one to regulate.\n\n*This is not financial advice*",
        "created_utc": 1612081014,
        "id": "glgnfu1",
        "permalink": "/r/wallstreetbets/comments/l97ykd/the_real_reason_wall_street_is_terrified_of_the/glgnfu1/",
        "score": 298,
        "subreddit": "wallstreetbets",
        "created": 1612109814.0
    },
    {
        "author": "ZeusThunder369",
        "body": "I can't believe I'm saying this, but FOX NEWS of all places has had excellent coverage of this situation the entire time. I'm not even joking, here is a single video. There are many more. It isn't that they are on our side, it's that they are RIGHT (which makes them on our side)\n\n[**https://www.youtube.com/watch?v=JvhY\\_-v9Ar0**](https://www.youtube.com/watch?v=JvhY_-v9Ar0)",
        "created_utc": 1612106758,
        "id": "glhis3n",
        "permalink": "/r/wallstreetbets/comments/l9dukq/its_working_melvin_capital_lost_53_in_january/glhis3n/",
        "score": 291,
        "subreddit": "wallstreetbets",
        "created": 1612135558.0
    },
    {
        "author": "iSkream",
        "body": "He has a really good 4 minute video that gives his DD.\n\nhttps://www.youtube.com/watch?v=alntJzg0Um4",
        "created_utc": 1610660369,
        "id": "gj9wofc",
        "permalink": "/r/wallstreetbets/comments/kxeq23/gme_yolo_update_jan_14_2021/gj9wofc/",
        "score": 282,
        "subreddit": "wallstreetbets",
        "created": 1610689169.0
    },
    {
        "author": "MrSquirly",
        "body": "Retards v. Robinhood",
        "created_utc": 1611840934,
        "id": "gl333t2",
        "permalink": "/r/wallstreetbets/comments/l6w4uo/robinhood_will_not_let_new_options_or_shares_be/gl333t2/",
        "score": 273,
        "subreddit": "wallstreetbets",
        "created": 1611869734.0
    },
    {
        "author": "LeBronJems",
        "body": "Tomorrow is a HUGE day, I hope everyone prospers and stays motivated. Don’t lose sight of the big picture, this is the way! Make sure to bang this anthem to keep you locked in on the mooooon. To the moooooon we shall all go! This is the way! Little guys for the win 🚀💎🙌🏽\n\nhttps://m.youtube.com/watch?v=o92GCyNK6Lc",
        "created_utc": 1612126622,
        "id": "glip9ug",
        "permalink": "/r/wallstreetbets/comments/l9looo/tomorrow_is_a_big_day/glip9ug/",
        "score": 271,
        "subreddit": "wallstreetbets",
        "created": 1612155422.0
    },
    {
        "author": "prefixspan",
        "body": "Yep, it's called a [Variable Interest Entity (VIE)](https://www.investopedia.com/terms/v/variable-interest-entity.asp). When you invest in $BABA or $TCEHY or many other Chinese stocks listed in the US, you're actually technically investing in a company in the Cayman Islands that has a contractual right to the original company's profits, but not actual ownership.",
        "created_utc": 1610949976,
        "id": "gjp1d7r",
        "permalink": "/r/investing/comments/kzoe9r/every_stock_you_buy_in_china_is_a_empty_holding/gjp1d7r/",
        "score": 269,
        "subreddit": "investing",
        "created": 1610978776.0
    },
    {
        "author": "OfficerTruth",
        "body": " \n\nPTE and ALNA [https://youtu.be/SRq2b5nYTTE](https://youtu.be/SRq2b5nYTTE)  \nCBAT and TRVN [https://youtu.be/J7IH4zr2kHg](https://youtu.be/J7IH4zr2kHg)  \nOCGN and BBI [https://youtu.be/YbXnurtqO\\_s](https://youtu.be/YbXnurtqO_s)  \nZOM and TNXP [https://youtu.be/tdm\\_kavAMlU](https://youtu.be/tdm_kavAMlU)  \nNOVN and SOLO [https://youtu.be/Lz2bA1iS6aQ](https://youtu.be/Lz2bA1iS6aQ)  \nJMIA and ARMK [https://youtu.be/rp560fhQ\\_9U](https://youtu.be/rp560fhQ_9U)  \nLMFA and ALRN [https://youtu.be/Hdo13pxWbhc](https://youtu.be/Hdo13pxWbhc)  \nAPXT and THCB [https://youtu.be/Z\\_HP5cZ91PY](https://youtu.be/Z_HP5cZ91PY)  \nSRAC and NGA [https://youtu.be/8fSQopL2bsw](https://youtu.be/8fSQopL2bsw)  \nIPOC and GHIV [https://youtu.be/gLhREzJS\\_1I](https://youtu.be/gLhREzJS_1I)  \nTSLA and HD [https://youtu.be/9LQn84Swh4g](https://youtu.be/9LQn84Swh4g)  \nGEVO and IBIO [https://youtu.be/IhhcuAljaSQ](https://youtu.be/IhhcuAljaSQ)  \nSPI [https://youtu.be/DWzkdjpyM6g](https://youtu.be/DWzkdjpyM6g)  \nMRNA and V [https://youtu.be/MXeV6JFICm8](https://youtu.be/MXeV6JFICm8)  \nIDEX and PENN [https://youtu.be/SArUI9DPsR0](https://youtu.be/SArUI9DPsR0)  \nONTX and NAKD [https://youtu.be/MyAN44eRVFk](https://youtu.be/MyAN44eRVFk)  \nBYFC and GNOG [https://youtu.be/nPrHP26CX8w](https://youtu.be/nPrHP26CX8w)  \nEBON and VLDR [https://youtu.be/JAJq46JlejE](https://youtu.be/JAJq46JlejE)  \nJAGX and LI [https://youtu.be/FWMVBkdTOQw](https://youtu.be/FWMVBkdTOQw)  \nAMD and SBE [https://youtu.be/NzarY2YAiio](https://youtu.be/NzarY2YAiio)  \nBA and FDX [https://youtu.be/mSypHGbQAjE](https://youtu.be/mSypHGbQAjE)  \nMU and BIDU [https://youtu.be/58yYaM-daxU](https://youtu.be/58yYaM-daxU)  \nBABA and BLNK [https://youtu.be/cg2FnmL8Ij8](https://youtu.be/cg2FnmL8Ij8)  \nFUBO and CRSR [https://youtu.be/SzPV9F1qQH8](https://youtu.be/SzPV9F1qQH8)  \nPSTH and APPS [https://youtu.be/QFVZETJ5UhE](https://youtu.be/QFVZETJ5UhE)  \nTTCF and CRWD [https://youtu.be/R74uDB0JepI](https://youtu.be/R74uDB0JepI)  \nXPEV and DKNG [https://youtu.be/3avqNOcm2v8](https://youtu.be/3avqNOcm2v8)  \nNIO and OSTK [https://youtu.be/WXvKbEzLKnM](https://youtu.be/WXvKbEzLKnM)  \nROKU and SQ [https://youtu.be/WXvKbEzLKnM](https://youtu.be/WXvKbEzLKnM)  \nPLTR and BBBY [https://youtu.be/dgGUyqSjaTs](https://youtu.be/dgGUyqSjaTs)  \nNET [https://youtu.be/ZsKKZL1cOtE](https://youtu.be/ZsKKZL1cOtE)  \nBNGO and QS [https://youtu.be/WmjNkNFTQlA](https://youtu.be/WmjNkNFTQlA)  \nENPH and AIKI [https://youtu.be/C\\_27x-FzrZA](https://youtu.be/C_27x-FzrZA)  \nAZRX and OEG [https://youtu.be/oRMEoR4CuqA](https://youtu.be/oRMEoR4CuqA)\n\nPlease refer to the videos above if your ticker of choice is listed.  \nIt is already covered :)",
        "created_utc": 1610400036,
        "id": "gixfbrx",
        "permalink": "/r/StockMarket/comments/kvcaec/ill_provide_the_analysis_you_provide_the_tickers/gixfbrx/",
        "score": 258,
        "subreddit": "StockMarket",
        "created": 1610428836.0
    },
    {
        "author": "Drakantas",
        "body": "DFV is not human, DFV is the will of wall street bets. Praise be D. F. V.",
        "created_utc": 1611797080,
        "id": "gl14489",
        "permalink": "/r/wallstreetbets/comments/l6k3pi/none_of_these_individuals_are_part_of_wallstreet/gl14489/",
        "score": 257,
        "subreddit": "wallstreetbets",
        "created": 1611825880.0
    },
    {
        "author": "tubbyrat",
        "body": "you’re totally right. I wish there was a way to show people that were trying to take the largest hedge fund in the US for all its money . it’s david v goliath don’t give up boys",
        "created_utc": 1611772024,
        "id": "gkzd73z",
        "permalink": "/r/wallstreetbets/comments/l6ahk4/you_did_not_miss_out_on_gme/gkzd73z/",
        "score": 254,
        "subreddit": "wallstreetbets",
        "created": 1611800824.0
    },
    {
        "author": "qwertyrayz",
        "body": "Full non-monetized sound Version Here: [https://www.youtube.com/watch?v=lyDB4C8\\_HJk](https://www.youtube.com/watch?v=lyDB4C8_HJk)\n\n&amp;#x200B;\n\nYou fucks better hold. Doubled down today with 22 shares in at $99. We're fucking riding this train or dying on it, but no matter what we're taking Mevin with us 🚀🚀💎💎🙌💎💎🚀🚀",
        "created_utc": 1611899201,
        "id": "gl798xn",
        "permalink": "/r/wallstreetbets/comments/l7kod4/deepfuckingvalue_is_still_in_and_has_a_message/gl798xn/",
        "score": 245,
        "subreddit": "wallstreetbets",
        "created": 1611928001.0
    },
    {
        "author": "scambiosis",
        "body": "Favorite part is they're just \"teasing\" the groundbreaking and more thorough information that they have and will blow your fucking tits off with tomorrow in their TOP 5 COUNTDOWN LIVESTREAM: BULLS-R-FUQ. Shitron can bathe in my diarrhea.\n\n[Related](https://www.youtube.com/watch?v=vs6V8EILM0M)",
        "created_utc": 1611077353,
        "id": "gjum3y9",
        "permalink": "/r/wallstreetbets/comments/l0lg6r/shitron_attacking_begins/gjum3y9/",
        "score": 240,
        "subreddit": "wallstreetbets",
        "created": 1611106153.0
    },
    {
        "author": "Skrubasauras",
        "body": "I do quite a lot of voice over! Would love to be a voice for this momentous event! Here's a video from a channel I work for: [https://www.youtube.com/watch?v=Ena2NDkKFwI&amp;ab\\_channel=TheBookofChoyer](https://www.youtube.com/watch?v=Ena2NDkKFwI&amp;ab_channel=TheBookofChoyer)",
        "created_utc": 1611987221,
        "id": "glcc7yl",
        "permalink": "/r/wallstreetbets/comments/l8ej07/ask_not_what_wsb_can_do_for_you_ask_what_you_can/glcc7yl/",
        "score": 238,
        "subreddit": "wallstreetbets",
        "created": 1612016021.0
    },
    {
        "author": "tvysbits",
        "body": "The whole ass Globe v Melvin",
        "created_utc": 1611886688,
        "id": "gl6ivtd",
        "permalink": "/r/wallstreetbets/comments/l7d4l1/europe_bros_listen_up_today_is_the_day_its_a_zero/gl6ivtd/",
        "score": 232,
        "subreddit": "wallstreetbets",
        "created": 1611915488.0
    },
    {
        "author": "MCicero",
        "body": "Okay listen up y'all, we're in for an eventful day for sure tomorrow. Anyone that says they know exactly what will happen is blowing smoke up your ass. Here are a few things to keep in mind\n\nThe hedgefunds/deep pockets/whales **proved** to us today that they will stop at nothing -- *apparently including illegal manipulation* -- to try to shake out weak-ass 🧻👐and keep us from our tendies. **Expect them to get even nastier**. These soulless excuses for people get real nasty when cornered and when their balls are on the line.\n\nWhat this means is expect the unexpected by taking a moment to think through some possible scenarios. \n\nAt this point, I'd like to confirm what everyone here already knows -- I'm just as fucking retarded as everyone else and nothing qualifies me to give financial advice, and that's not what this post is. This is simply me thinking out loud in preparation for the next phase of this escalating war, so take it or leave it idgaf just do your own research when it comes to investments blah blah \n\nAlright now that that's out of the way, let's talk about the coming days. [Like I said the other day](https://www.reddit.com/r/wallstreetbets/comments/l6ea1b/what_are_your_moves_tomorrow_january_28_2021/gl004gk/), this is **NOT** guaranteed to happen tomorrow. Shorts **DO NOT EXPIRE** and they've **PROVEN** that they're willing, to be ridiculously charitable, to bend the rules. Keep this in mind, and for the love of god *DO NOT PANIC SELL TOMORROW* ~~if~~ when things get nasty. This could very well stretch into next week or beyond.\n\nProbably on our fun little trip down to the 100s today some of the shorts were able to cover in preparation for whats coming. But certainly not all of them, because **you autists fucking did it**. They made it to where all you *could* do is sell, **AND WE DIDN'T SELL**. I'm so fucking proud of all the 💎👐out there.\n\nThis has only strengthened my resolve to hold, and from reading the comments here all evening, a lot of you feel the same way. They've made this fucking personal, it's a matter of principle now, and I bought more shares at close just out spite. IDGAF if we go to zero ^(and ^don't ^think ^we ^are) -- but for *once* we hold at least *some* of the power here, and while it could be a week (or more) before all of this plays out, the underlying thesis still stands though -- so long as we don't sell, they suffer. \n\n#So let's talk exit strategy.\n\nWhile this has morphed into a righteous cause, I'm sure there are many of you still thinking of those sweet sweet tendies to be had. \"Maybe if I set a limit sell at just under $1000, I can still get mine before the big sell off\", shit like that. Of course we all want our tendies at the end of the day, but we're in such a unique position where we can pretty much name our price. But not exactly.\n\nThere's a certain price beyond which the economic fallout for the whole economy would simply be unacceptable to those in charge, and we'd see government/regulators step in and shut it all down and ruin the party. Of course no one can really say how high that limit is, but if you think the billionaires will let you hurt them to the point of systematic restructuring of the whole economy, know that they have favors to call in and power beyond what you could imagine. Don't believe me? [Look at all the repercussions they faced for their fuckery in 2008](https://www.youtube.com/watch?v=mcJmzEawWi0). \n\nSo we can't all set stop losses for $100k, because \n\n* a) they won't allow it and \n\n* 2) even if they did, enough people would (probably) take profits before it got that high.\n\nAt the same time, we can't (and shouldn't for legal reasons) just all get together and agree to set limit orders for $690 or $4200. \n\nSo as long as 💎👐stay strong, I think we could see $1k pretty easily. Probably some people will take profits then, but I think we can do better than this. I read yesterday somewhere that brokerages are not able to lend your shares to shorts if you have open limit orders on them, and I believe everything I read on the internet so unless someone shows otherwise, I think it makes sense to do so if possible at the limit you'd like (for me, &gt;$1k). \n\n# We like the stock, we want to see them suffer, and we want our tendies.\n\nFor me, it really is less about the tendies at this point though and more about seeing some of these elitist gatekeeping bastards get what's coming. I understand that not everyone feels the same, and that's okay. It's okay to take profits. However, if you feel the same as I do, this is how I'm planning on going into tomorrow, the next week, and possibly the further out than that: \n\nI plan on setting a limit order in the ballpark of $1k for ~10% of the shares that I hold. This will **cover the cost basis, I won't sell all of my shares, and it keeps most of the pressure on by only injecting a small amount of available shares for the shorts**. After that, I'm playing on house money and I can sleep like a baby with  💎👐 while we crank things up to 11. They'll short ladder us down? I'll long ladder the mfers up. Limit orders at regular intervals, but not offering them all of my shares at one price (idk, every $500?). **If they want liquidity to cover their shorts, they'll have to pay for it. IF THEY NEED MORE, THEY'LL HAVE TO PAY MORE.** \n\ntl;dr: Don't give them all your shares at one limit price. Spread that shit out for maximum tendies and maximum pain \n\n$GME 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "created_utc": 1611900149,
        "id": "gl7awjb",
        "permalink": "/r/wallstreetbets/comments/l7kfrj/daily_discussion_thread_part_7_for_january_28_2021/gl7awjb/",
        "score": 224,
        "subreddit": "wallstreetbets",
        "created": 1611928949.0
    },
    {
        "author": "ZeusThunder369",
        "body": "I can't believe I'm saying this, but FOX NEWS of all places has had excellent coverage of this situation the entire time. I'm not even joking, here is a single video. There are many more. It isn't that they are on our side, it's that they are RIGHT (which makes them on our side)\n\n[**https://www.youtube.com/watch?v=JvhY\\_-v9Ar0**](https://www.youtube.com/watch?v=JvhY_-v9Ar0)",
        "created_utc": 1612106737,
        "id": "glhiqnr",
        "permalink": "/r/wallstreetbets/comments/l9cu64/me_at_my_job_interview_after_i_just_watched_the/glhiqnr/",
        "score": 224,
        "subreddit": "wallstreetbets",
        "created": 1612135537.0
    },
    {
        "author": "maza66",
        "body": "Sea shanty\n\n[https://www.youtube.com/watch?v=b9oI\\_8YG6Vs&amp;ab\\_channel=Sw4y](https://www.youtube.com/watch?v=b9oI_8YG6Vs&amp;ab_channel=Sw4y)",
        "created_utc": 1612038024,
        "id": "glej5up",
        "permalink": "/r/wallstreetbets/comments/l8s98l/we_have_more_power_than_anyone_amc_gme_on_monday/glej5up/",
        "score": 222,
        "subreddit": "wallstreetbets",
        "created": 1612066824.0
    },
    {
        "author": "ExoticStress1",
        "body": "https://m.youtube.com/watch?v=mwIIQEVBUuo",
        "created_utc": 1611983728,
        "id": "glc6y6q",
        "permalink": "/r/wallstreetbets/comments/l8ej07/ask_not_what_wsb_can_do_for_you_ask_what_you_can/glc6y6q/",
        "score": 215,
        "subreddit": "wallstreetbets",
        "created": 1612012528.0
    },
    {
        "author": "soupofbidet",
        "body": "speaking of Crookmer look at this shit - [https://www.youtube.com/watch?v=EaNuRsNA0OU&amp;t=239s](https://www.youtube.com/watch?v=EaNuRsNA0OU&amp;t=239s)   \nHe literally used to short with his Hedge all the time.",
        "created_utc": 1612052803,
        "id": "glfczpk",
        "permalink": "/r/wallstreetbets/comments/l8xsfa/cool_but_why_would_they_bother_telling_us/glfczpk/",
        "score": 215,
        "subreddit": "wallstreetbets",
        "created": 1612081603.0
    },
    {
        "author": "Diekjung",
        "body": "I know it’s a joke but if not [here you go](https://www.youtube.com/watch?v=vYurKVxFXPI). And happy cake day to you.",
        "created_utc": 1611829898,
        "id": "gl2lti0",
        "permalink": "/r/wallstreetbets/comments/l6popa/hooray_for_charles_payne_the_shorts_have_had/gl2lti0/",
        "score": 213,
        "subreddit": "wallstreetbets",
        "created": 1611858698.0
    },
    {
        "author": "argatson",
        "body": "[Found it](https://www.youtube.com/watch?v=K-TYsAHbb18)",
        "created_utc": 1611887558,
        "id": "gl6ks10",
        "permalink": "/r/wallstreetbets/comments/l7g3y6/our_darkest_hour/gl6ks10/",
        "score": 212,
        "subreddit": "wallstreetbets",
        "created": 1611916358.0
    },
    {
        "author": "Duffnot",
        "body": "GUYS READ THIS BEFORE TOMORROW\n\n30 Seconds From Triggering Market Nuclear Bomb\n\nI'm glad this place has quieted down enough for some actual DD written by a monkey with a keyboard and Adderall.\n\nDisclaimer: I am that monkey.  Let me explain to you what happened, play by play.  I will give you illiterates who hate reading a spoiler up front:\n\nWe were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market. Do I have your attention?  Here goes:\n\n1.\t⁠⁠Yesterday, new call option strike prices were added all the way up to $570.  Do I have to go over gamma squeezes again?  Really?  We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock.  This creates upwards pressure on the market.  We've been seeing these movements all week.\n2.\t⁠⁠Yesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off.  It didn't work.\n3.\t⁠⁠Last night, Robinhood sent out a message to users: you could no longer enter into new options.  You could exercise them if you had the collateral (money in the account) to do so.  Very interesting and the first sign of pants-shitting fear.\n4.\t⁠⁠Today, the market opened very strong.  It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n5.\t⁠⁠At approximately 9:58 am, the stock had reached $468 in a parabolic move.\n6.\t⁠⁠Two minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n7.\t⁠⁠The trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it.  What does that mean?  It means they ran out of shares and/or capital. They wouldn't let you buy new shares because we were burning through all the shares on the market.\n\nI saw an unsubstantiated post from a user (u/zshub) who said a market sell order executed at $2600 for him.  Do you get the severity of the situation, if that's true? It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares.  It means virtually any ask was getting bid.\n\nHow do you get infinite upwards pressure?  A gamma squeeze triggering the mother of all short squeezes, just like we predicted.  The call writers need shares to hedge.  Retail is still buying more.  The short sellers need over 100% of the float back.  Add these together.  There were more shares needed than existed on the open market.  That's what a liquidity crisis is.\n\nListen to this to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home.  DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello!  He's not talking about the market for GME shares.  He's talking about the entire market!  The New York Stock Exchange.  The NASDAQ.  All that.\n\nRemember the movie Snowpiercer?  Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets?  Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\n\nIt kick starts a full blown rebellion.  They have no bullets.  It's the exact same in this market:  No capital.  No shares.  Infinite losses inbound.\n\nTL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares.  Do you get that?  HOLD.  Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede.  That's how we win.\n\nThey needed your shares so badly that they literally risked PRISON TIME to get them.  They tried robbing you, and I'm not even exaggerating.  They were within 30 seconds of all being wiped out today.\n\nCredit: u/PlayFree_Bird",
        "created_utc": 1611884235,
        "id": "gl6dh1p",
        "permalink": "/r/wallstreetbets/comments/l7ept4/daily_discussion_thread_part_6_for_january_28_2021/gl6dh1p/",
        "score": 212,
        "subreddit": "wallstreetbets",
        "created": 1611913035.0
    },
    {
        "author": "the-ghost-cow",
        "body": "[HOLD THE LINE!](https://www.youtube.com/watch?v=htgr3pvBr-I) We Bless The 💎🤚s down in Africa!",
        "created_utc": 1611886205,
        "id": "gl6htok",
        "permalink": "/r/wallstreetbets/comments/l7feld/its_power_to_the_traders_now/gl6htok/",
        "score": 210,
        "subreddit": "wallstreetbets",
        "created": 1611915005.0
    },
    {
        "author": "angelrock420",
        "body": "GME AMC BB = 👨‍🚀🚀 e v o l u t i o n 🌑🦍\n\n\n💎 🙏🚀🚀🚀",
        "created_utc": 1611944731,
        "id": "gl9pds6",
        "permalink": "/r/wallstreetbets/comments/l7zxtj/gamestop_short_sellers_are_still_not_surrendering/gl9pds6/",
        "score": 203,
        "subreddit": "wallstreetbets",
        "created": 1611973531.0
    },
    {
        "author": "BigAlTrading",
        "body": "He might still have a real problem if 300k people call in.\n\n[https://www.youtube.com/watch?v=tJp\\_3-VZZjI](https://www.youtube.com/watch?v=tJp_3-VZZjI)",
        "created_utc": 1611108566,
        "id": "gjwfazp",
        "permalink": "/r/wallstreetbets/comments/l0y80p/citrons_biggest_mistake_they_announced_that_they/gjwfazp/",
        "score": 198,
        "subreddit": "wallstreetbets",
        "created": 1611137366.0
    },
    {
        "author": "TheMapleStaple",
        "body": "This guy Rossmann has over a million Youtube subs and has been covering the story made a video that included this lol. [Here](https://www.youtube.com/watch?v=enLiJfijWBI), and it's just after the 6 minute mark he brings up a chart with your 5k ask lol. He's only bought less than 1% of his portfolio into GME because he wanted to tell his kids he was a part of it, but he's loving the fuck out of sticking it to Wall Street and says he'd rather that stock went to 0 as they can manipulate the market but he wont let them manipulate him. All his coverage has been solid of this event, and it's an entertaining watch if you have browsed them.",
        "created_utc": 1611874338,
        "id": "gl5qvya",
        "permalink": "/r/wallstreetbets/comments/l76t20/stop_reposting_the_obviously_fake_screenshot_from/gl5qvya/",
        "score": 197,
        "subreddit": "wallstreetbets",
        "created": 1611903138.0
    },
    {
        "author": "BANG-JP",
        "body": "Japanese commercials are an actual art form. I'd suggest you watch some of them. They even have evolving storylines with characters that span several commercial segments throughout seasons of commercials.\n\n[https://www.youtube.com/watch?v=sZsJyCyGBSI](https://www.youtube.com/watch?v=sZsJyCyGBSI)  \nLong Man series.\n\n&amp;#x200B;\n\n[https://www.youtube.com/watch?v=Lv2l1JKuxxY](https://www.youtube.com/watch?v=Lv2l1JKuxxY)  \nTommy Lee Jones, Boss Coffee series",
        "created_utc": 1611892494,
        "id": "gl6vpzh",
        "permalink": "/r/wallstreetbets/comments/l7g3y6/our_darkest_hour/gl6vpzh/",
        "score": 189,
        "subreddit": "wallstreetbets",
        "created": 1611921294.0
    },
    {
        "author": "HipHopHistoryGuy",
        "body": "Sounds like that Ghostface Killah song (\"All That I Got Is You\") where he talks about kicking the cockroaches out of his cereal bowl. I practically tear up everytime I hear that song ([https://www.youtube.com/watch?v=bhTBKzfvKUg](https://www.youtube.com/watch?v=bhTBKzfvKUg))",
        "created_utc": 1611783771,
        "id": "gl05zvt",
        "permalink": "/r/wallstreetbets/comments/l6dv5a/a_message_to_everyone_on_wall_street_from/gl05zvt/",
        "score": 188,
        "subreddit": "wallstreetbets",
        "created": 1611812571.0
    },
    {
        "author": "CrimsonSun99",
        "body": "##[GOTTA HAVE THAT STONK](https://www.youtube.com/watch?v=gBWH3OWfT2Y) 🎵\n\n\n💎🤚\n\n \n##🚀\n####🚀 \n#####🚀",
        "created_utc": 1611908323,
        "id": "gl7nbyd",
        "permalink": "/r/wallstreetbets/comments/l7mma6/attack_on_wall_street_pt_1_sub/gl7nbyd/",
        "score": 187,
        "subreddit": "wallstreetbets",
        "created": 1611937123.0
    },
    {
        "author": "chricook9",
        "body": "If you're interested in the full one: [https://www.youtube.com/watch?v=sF4\\_263cwCc](https://www.youtube.com/watch?v=sF4_263cwCc)",
        "created_utc": 1612103866,
        "id": "glhdwyd",
        "permalink": "/r/wallstreetbets/comments/l9dgkr/im_so_retarded_that_ive_edited_the_full_7min/glhdwyd/",
        "score": 186,
        "subreddit": "wallstreetbets",
        "created": 1612132666.0
    },
    {
        "author": "medellia44",
        "body": "https://m.youtube.com/watch?v=_AAgbLSHUEM",
        "created_utc": 1611972815,
        "id": "glbm2wh",
        "permalink": "/r/wallstreetbets/comments/l89alf/huge_shoutout_to_kevin_oleary_definition_of_the/glbm2wh/",
        "score": 181,
        "subreddit": "wallstreetbets",
        "created": 1612001615.0
    },
    {
        "author": "Nighthawk1449",
        "body": "Just bought GME &amp; AMC -- greatest redistribution of wealth. Reddit v. Wall Street coming to theatres 2025.",
        "created_utc": 1611766951,
        "id": "gkyxrgx",
        "permalink": "/r/wallstreetbets/comments/l6261q/daily_discussion_thread_for_january_27_2021/gkyxrgx/",
        "score": 179,
        "subreddit": "wallstreetbets",
        "created": 1611795751.0
    },
    {
        "author": "givemeyourpants",
        "body": "Since the links in the articles aren't working:  [Video of the Interview](https://www.youtube.com/watch?v=CpMEFtPZJLc)",
        "created_utc": 1612061551,
        "id": "glftnwx",
        "permalink": "/r/investing/comments/l92fz7/jim_cramer_gave_an_interview_in_2006_on_how_the/glftnwx/",
        "score": 171,
        "subreddit": "investing",
        "created": 1612090351.0
    },
    {
        "author": "CrimsonSun99",
        "body": "##[WE LIKE THE STOCK](https://www.youtube.com/watch?v=fmJUOeO_Vdc) 🎵\n\n\n💎🤚\n\n \n##🚀\n####🚀 \n#####🚀",
        "created_utc": 1611951855,
        "id": "gla9sv3",
        "permalink": "/r/wallstreetbets/comments/l81fgb/honor_to_diamond_hands/gla9sv3/",
        "score": 169,
        "subreddit": "wallstreetbets",
        "created": 1611980655.0
    },
    {
        "author": "VerySlump",
        "body": "I'm glad this place has quieted down enough for some actual DD written by a monkey with a keyboard and Adderall.  \n\nDisclaimer: I am that monkey.  Let me explain to you what happened, play by play.  I will give you illiterates who hate reading a spoiler up front: \n\n__We were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market.__ Do I have your attention?  Here goes:\n\n1.\t⁠Yesterday, new call option strike prices were added all the way up to $570.  Do I have to go over gamma squeezes again?  Really?  We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock.  This creates upwards pressure on the market.  We've been seeing these movements all week.\n2.\t⁠Yesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off.  It didn't work.\n3.\t⁠Last night, Robinhood sent out a message to users: you could no longer enter into new options.  You could exercise them if you had the collateral (money in the account) to do so.  Very interesting and the first sign of pants-shitting fear.\n4.\t⁠Today, the market opened very strong.  It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n5.\t⁠At approximately 9:58 am, the stock had reached $468 in a parabolic move.\n6.\t⁠Two minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n7.\t⁠The trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\n\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it.  What does that mean?  It means they ran out of shares and/or capital. They wouldn't let you buy new shares because we were burning through all the shares on the market.  \n\n__I saw an unsubstantiated post from a user who said a small sell limit order executed at $2600 for him.  Do you get the severity of the situation, if that's true?__ It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares.  It means virtually any ask was getting bid.\n\nHow do you get infinite upwards pressure?  A gamma squeeze triggering the mother of all short squeezes, just like we predicted.  The call writers need shares to hedge.  Retail is still buying more.  The short sellers need over 100% of the float back.  Add these together.  There were more shares needed than existed on the open market.  That's what a liquidity crisis is.\n\n[Listen to this ](https://youtu.be/7RH4XKP55fM)to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home.  DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello!  He's not talking about the market for GME shares.  He's talking about the entire market!  The New York Stock Exchange.  The NASDAQ.  All that.\n\nRemember the movie Snowpiercer?  Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets?  Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\n\nIt kick starts a full blown rebellion.  They have no bullets.  It's the exact same in this market:  No capital.  No shares.  Infinite losses inbound.\n\n__TL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares.  Do you get that?  HOLD.  Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede.  That's how we win.__\n\nThey needed your shares so badly that they literally risked PRISON TIME to get them.  They tried robbing you, and I'm not even exaggerating.  They were within 30 seconds of all being wiped out today.",
        "created_utc": 1611875787,
        "id": "gl5uag3",
        "permalink": "/r/wallstreetbets/comments/l74zgc/gme_megathread_iv_for_january_28th_2021/gl5uag3/",
        "score": 168,
        "subreddit": "wallstreetbets",
        "created": 1611904587.0
    },
    {
        "author": "jtmn",
        "body": "Different part - [https://www.youtube.com/watch?v=7RH4XKP55fM&amp;ab\\_channel=CNBCTelevision](https://www.youtube.com/watch?v=7RH4XKP55fM&amp;ab_channel=CNBCTelevision)",
        "created_utc": 1611867296,
        "id": "gl583jj",
        "permalink": "/r/wallstreetbets/comments/l77imc/interactive_brokers_chairman_on_cnbc_just_now/gl583jj/",
        "score": 166,
        "subreddit": "wallstreetbets",
        "created": 1611896096.0
    },
    {
        "author": "ScipioAtTheGate",
        "body": "[Welcome to 1984. Big Brother is the brokerages telling the ordinary folks what's right to buy.](https://www.youtube.com/watch?v=jDblb6mos24) What to think for yourself? No sir, the brokerages will do all the thinking for you.",
        "created_utc": 1611860419,
        "id": "gl4p5jb",
        "permalink": "/r/wallstreetbets/comments/l6zui9/papa_elon_back_at_it_again_with_the_one_liners/gl4p5jb/",
        "score": 164,
        "subreddit": "wallstreetbets",
        "created": 1611889219.0
    },
    {
        "author": "RckZilla123",
        "body": "Just so people know this guy also shorted NVIDIA\n\nHE SHORTED FUCKING NVIDIA\n\n[https://www.youtube.com/watch?v=lh0sDL937f4](https://www.youtube.com/watch?v=lh0sDL937f4)",
        "created_utc": 1611273027,
        "id": "gk4b2wn",
        "permalink": "/r/wallstreetbets/comments/l2aeno/citron_research_switches_to_bull_case_on_gme/gk4b2wn/",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1611301827.0
    },
    {
        "author": "csamsock",
        "body": "&gt;https://www.youtube.com/watch?v=QFfjX8dW-QQ&amp;feature=youtu.be\n\nWhat a  POS!!",
        "created_utc": 1612030573,
        "id": "gle347v",
        "permalink": "/r/wallstreetbets/comments/l8rlea/good_morning_to_everyone_except_robinhood/gle347v/",
        "score": 157,
        "subreddit": "wallstreetbets",
        "created": 1612059373.0
    },
    {
        "author": "PaulMorphyForPrez",
        "body": "Long term, this would allow merchants and banks to easily cut out Visa and Mastercard. It should lower transaction fees considerably.\n\nReal question is who will make money building or maintaining the system. I could see Stellar getting involved, they have experience working with banks and aren't being sued like Ripple. Maybe a Layer 2 Ethereum solution.\n\nEdit: Side issue: Ethereum shot up massively yesterday. Could that be because some people knew this news was coming out?",
        "created_utc": 1609806529,
        "id": "gi4kpdj",
        "permalink": "/r/investing/comments/kqljwk/us_treasury_occ_will_allow_us_banks_to_use_public/gi4kpdj/",
        "score": 156,
        "subreddit": "investing",
        "created": 1609835329.0
    },
    {
        "author": "karmalizing",
        "body": "##[NYSE MOOD RIGHT NOW](https://www.youtube.com/watch?v=18CGW9P5Y9M#t=31s)",
        "created_utc": 1611350659,
        "id": "gk8pw12",
        "permalink": "/r/wallstreetbets/comments/l2x7he/gme_yolo_update_jan_22_2021/gk8pw12/",
        "score": 156,
        "subreddit": "wallstreetbets",
        "created": 1611379459.0
    },
    {
        "author": "rossoneri_22",
        "body": "Just want to repost this for everyone. \n\nCredit u/PlayFree_Bird\nOkay, has this place quieted down enough for some actual DD written by a monkey with a keyboard and Adderall? Let me explain to you what happened, play by play. I will give you illiterates who hate reading a spoiler up front: We were within approximately 30 seconds of triggering a nuclear bomb that would have blown up the market. Do I have your attention? Here goes:\n 1. Yesterday, new call option strike prices were added all the way up to $570. Do I have to go over gamma squeezes again? Really? We've been over this: when deep out-of-the-money call options start being gobbled up and the price starts moving towards being in-the-money, the call writers have to hedge their risk of having their sold calls exercised, typically by buying stock. This creates upwards pressure on the market. We've been seeing these movements all week.\n 2. Yesterday after market, you probably saw that coordinated effort to drive the price down and spook retail investors into a mass sell-off. It didn't work.\n 3. Last night, Robinhood sent out a message to users: you could no longer enter into new options. You could exercise them if you had the collateral (money in the account) to do so. Very interesting and the first sign of pants-shitting fear.\n 4. Today, the market opened very strong. It opened so strong that we were looking at a self-perpetuating gamma squeeze all the way up way past $570.\n 5. At approximately 9:58 am, the stock had reached $468 in a parabolic move.\n 6. Two minutes earlier, at 9:56 am, Robinhood tweeted that they were not allowing users to buy GME stock, but they would allow selling.\n 7. The trend instantly halted and started a collapse downwards, before picking up a bit, especially after some retail was allowed back in.\nOkay, now that you are clear on the facts, understand this: The market ran out of liquidity today, or was threatening to get close enough that they killed it. What does that mean? It means they ran out of shares and/or capital. They wouldn't let you buy new shares because we were burning through all the shares on the market. I saw an unsubstantiated post from a user who said a small sell limit order excited at $2600 for him. Do you get the severity of the situation, if true? It means the buying was getting to the point where it was just about to put INFINITE pressure on the price of the shares.\nHow do you get infinite upwards pressure? A gamma squeeze triggering the mother of all short squeezes, just like we predicted. The call writers need shares to hedge. Retail is still buying more. The short sellers need over 100% of the float back. Add these together. There were more shares needed than existed on the open market. That's what a liquidity crisis is.\nListen to this remarkable (if infuriating) interview where the chairman of Interactive Brokers admits that they didn't have the capital to pay out the winners (us), so they took their ball and went home: https://www.youtube.com/watch?v=7RH4XKP55fM DO YOU GRASP HOW INSANE IT IS THAT HE SAID THEY NEEDED TO SHUT DOWN BUY ORDERS TO \"PROTECT THE MARKET\"? Hello! He's not talking about the market for GME shares. He's talking about the entire market! The New York Stock Exchange. The NASDAQ. All that.\nRemember the movie Snowpiercer? Do you remember that scene where the lower class people realize the soldiers who oppress them have no bullets? Go to the 1:00 minute mark of this link: https://www.youtube.com/watch?v=EH1EtiOhr6o\nIt kick starts a full blown rebellion. They have no bullets. It's the exact same in this market: No capital. No shares. Infinite losses inbound.\nTL;DR: For all you who will just skip to the bottom to ask, \"Do I get my tendies now?\" the answer is this: they NEED NEED NEED your shares. Do you get that? HOLD. Like the guy in the movie, scream, \"They're out of bullets!\" and create a stampede. That's how we win.\nThey needed your shares so badly that they literally risked PRISON TIME to get them. They tried robbing you, and I'm not even exaggerating. They were within 30 seconds of all being wiped out today.",
        "created_utc": 1611872816,
        "id": "gl5n7pu",
        "permalink": "/r/wallstreetbets/comments/l78za1/daily_discussion_thread_part_5_for_january_28_2021/gl5n7pu/",
        "score": 155,
        "subreddit": "wallstreetbets",
        "created": 1611901616.0
    },
    {
        "author": "AlphaChipWasTaken",
        "body": "[WSB on the trading floor...](https://www.youtube.com/watch?v=HBhvTyNsDX0)",
        "created_utc": 1611157837,
        "id": "gjyd5v3",
        "permalink": "/r/wallstreetbets/comments/l1bf49/gme_ready_to_load_up_on_more_shares/gjyd5v3/",
        "score": 153,
        "subreddit": "wallstreetbets",
        "created": 1611186637.0
    },
    {
        "author": "TSM-",
        "body": "https://www.youtube.com/watch?v=pH2GXmRDaSA\n\nHaha many comments are saying he was banned",
        "created_utc": 1612030735,
        "id": "gle3h0h",
        "permalink": "/r/wallstreetbets/comments/l8pr1a/never_forget_last_year_when_this_guy_soldout_the/gle3h0h/",
        "score": 152,
        "subreddit": "wallstreetbets",
        "created": 1612059535.0
    }
]