[
    {
        "author": "UBiLL666",
        "body": "HPQ",
        "created_utc": 1610243055,
        "id": "gipvexu",
        "score": 28,
        "subreddit": "CanadianInvestor",
        "created": 1610271855.0
    },
    {
        "author": "official_new_zealand",
        "body": "Or sell \"custom\" ready mades that are built to spec to  run different AAA titles at different frame settings and resolutions for different budgets, your 12 year old cousin wants to play fortnite? here is a $500 PC with integrated ryzen graphics, a single stick of ram, but a nice case with some led lights, he'll be happy, if you want to play cyberpunk with full raytracing but don't have the time to build your own, or can't be bothered waiting for packages from newegg, then spend $2k and get an RTX3080 equiped machine off the shelf.\nThere is a market for pre-built machines that don't completely suck, not everyone wants to build their own (but they're forced to) absolutely no gamer wants to buy a Hewlett Packard from a big box retailer, because you can't game on that crap.\n\nLook at what mightyape here in New Zealand are doing. This is absolutely an area of future growth that gamestop (/ ebgames) has ignored.\n\nhttps://www.mightyape.co.nz/computers/gaming-rigs-gear/gaming-pc/gaming-pcs?q=stock~instock\n\nStocking parts and selling retail isn't a direction I'd want the company to head in, those who build pc's piece by piece don't usually buy their parts from brick and mortar retailers, they research online, then purchase online. The shit on a retailers shelf sits in the same dusty box for years.",
        "created_utc": 1610336647,
        "id": "giu55b3",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1610365447.0
    },
    {
        "author": "NoAtmosphere2271",
        "body": "Converge Technology Solutions ($CTS.V) is not a penny stock but it might as well be. I have no clue what they do but their trading multiples make absolutely zero sense. Their market cap is less than this years revenue, and their last quarter was profitable. Share price of 6 something when it should be at least double. It’s uplisting to the TSE is set for February 17th and I would recommend hopping onboard this choo choo train before it hits double digits. Institutional ownership sits at a mere 3.8%. Insiders have bought ~950K shares in the past 12 months and own ~12.3%. They haven’t sold a single share and the biggest holder is the CEO at 8.13%. The company has made something like 17 acquisitions in North America since October 2017 and have plans to expand into Europe in the future. If you need any more convincing, go look at the list of their platinum sponsors for next weeks #ConvergeConnect21 conference.. You might recognize some of the companies: IBM, Redhat, Google Cloud, Microsoft, Dell, VMware, AWS, PureStorage, Cisco, and Snowflake. Lenovo and PaloAlto are two of the gold sponsors. Hewlett-Packard and Intel are two of the silver sponsors. This is a Constellation Software-like company in the making- MASSIVE. Their latest bought financing closed today fully subscribed for a mere 80+ million dollars. Guess what they plan to do with it that money- M&amp;A. Did I forget to mention that they are very likely to break a billion in revenue this year? Oh yeah and they’re still on the venture exchange! \n\nTLDR: CTS.V - strong buy before Q4 earnings (don’t know when they are), or at least before uplisting to TSE in mid Feb. Thank you.",
        "created_utc": 1610760719,
        "id": "gjepge1",
        "score": 17,
        "subreddit": "CanadianInvestor",
        "created": 1610789519.0
    },
    {
        "author": "xkulp8",
        "body": "Bought Compaq years ago. Then it became HP, then HP split into HPE and HPQ, then I got some DXC in the spinoff, then I got PRSP in the next spinoff.\n\nSo I have 5 shares of PRSP.\n\nAt least *something* might make money for me out of the old CPQ.",
        "created_utc": 1609875388,
        "id": "gi7npln",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609904188.0
    },
    {
        "author": "whenabouts",
        "body": "Anyone watching HPQ Silicon? The tech is so promising + they have another patent processing. However, cash runway is low + a lot of insider selling over the year. Let's chat about it!",
        "created_utc": 1610661493,
        "id": "gj9zb8b",
        "score": 11,
        "subreddit": "CanadianInvestor",
        "created": 1610690293.0
    },
    {
        "author": "TheMountainIII",
        "body": "Can't wait to see if these will 🚀 eventually\n\n* SCR\n* MMED\n* NUMI\n* LUCK\n* HPQ\n* FLT",
        "created_utc": 1611344527,
        "id": "gk88a0y",
        "score": 10,
        "subreddit": "CanadianInvestor",
        "created": 1611373327.0
    },
    {
        "author": "mayboss",
        "body": "HPQ, it’s your time to shine baby",
        "created_utc": 1611320710,
        "id": "gk66lzu",
        "score": 8,
        "subreddit": "CanadianInvestor",
        "created": 1611349510.0
    },
    {
        "author": "im_not_leo",
        "body": "Just waiting on someone here to see the massive rise and post a massive DD post and have it sky rocket before the weekend only to crash on Monday, I would say wait until tomorrow to sell and then buy up the dumpster fire on Monday would be a good strategy. \n\nThere are supposed to be more extraction results in Q2 so I wouldn’t be surprised if we see this above a dollar this year, some people would say three dollars by years end but I can’t see that happening unless A major battery producer announces they are using manganese instead of cobalt for their batteries permanently going forward. \n\n\nConsidering this is the largest deposit in North America, I’d see these guys are definitely a good long game play for sure.\n\nEdit :\n\nAlso if you want to check out competing technology that is being explored in the battery market, check out HPQ silicon, it is another potential game changer for the EV market and could potentially be another great investment.",
        "created_utc": 1610667417,
        "id": "gjab6sl",
        "score": 7,
        "subreddit": "pennystocks",
        "created": 1610696217.0
    },
    {
        "author": "dalkride",
        "body": "HPQ",
        "created_utc": 1610470597,
        "id": "gj0ku5b",
        "score": 6,
        "subreddit": "CanadianInvestor",
        "created": 1610499397.0
    },
    {
        "author": "b_treyy4",
        "body": "Seriously hoping to hear or see something with GRN - majority of my play portfolio ... also HPQ can show me some life ... make that car company announcement already",
        "created_utc": 1609891340,
        "id": "gi8t3mi",
        "score": 6,
        "subreddit": "CanadianInvestor",
        "created": 1609920140.0
    },
    {
        "author": "SucksAtStocks",
        "body": "HPQ if you're looking for high-risk, ten-bagger potential this year.",
        "created_utc": 1611173568,
        "id": "gjzd5dr",
        "score": 6,
        "subreddit": "CanadianInvestor",
        "created": 1611202368.0
    },
    {
        "author": "Jgam81",
        "body": "Good news for HPQ!\n\nhttps://www.globenewswire.com/news-release/2021/01/21/2162095/0/en/HPQ-Gen1-Nano-Silicon-Reactor-Exceeds-Expectations-Produces-Sub-100-Nm-Spherical-Nanopowders-Nanowires.html",
        "created_utc": 1611236080,
        "id": "gk24nvk",
        "score": 6,
        "subreddit": "CanadianInvestor",
        "created": 1611264880.0
    },
    {
        "author": "yesnomaybedotcom",
        "body": "Hoping to see a pop in HPQ. Weirdly MMED had some buying yesterday,  interested to see what happens",
        "created_utc": 1610715368,
        "id": "gjc7hj0",
        "score": 6,
        "subreddit": "CanadianInvestor",
        "created": 1610744168.0
    },
    {
        "author": "becavern23",
        "body": "HPQ is where it's at",
        "created_utc": 1611026077,
        "id": "gjsho1g",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1611054877.0
    },
    {
        "author": "Universal-Omnicide",
        "body": "Breaking News: Goldman'sSachs must invest list for 2021\n\nGE \n\nAT&amp;T\n\nBAYER\n\nIBM \n\nHewlett Packard",
        "created_utc": 1609789494,
        "id": "gi3lmu6",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1609818294.0
    },
    {
        "author": "OmegaKitty1",
        "body": "I have a fairly large position in both. PYR is safer of course, but HPQ if their products deliver will have an amazing year. They are well positioned.",
        "created_utc": 1611156968,
        "id": "gjybc11",
        "score": 5,
        "subreddit": "CanadianInvestor",
        "created": 1611185768.0
    },
    {
        "author": "davis__ftp__",
        "body": "I got my old man on. \nAitx-1,000,000 shares at .0012 \nHolding 350,000 shares \nBlsp-1,000,000 shares at .0007\nHolding 650,00 shares \nSold some to secure massive profits. What a crazy couple weeks it’s been. I didn’t have cash to buy, should have sold some opti and hpq to get in on both. I want to buy in tomorrow but I don’t want to ruin the run for you guys lol.",
        "created_utc": 1611115694,
        "id": "gjws3qu",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1611144494.0
    },
    {
        "author": "Ask_me_4_a_story",
        "body": "Well for one he is upset that Wall Street is less a bunch of rich white guys having lunch together in NYC and more spread out and its not easy to game the system anymore. If any of you are wondering how Jim Cramer got rich I read the book so you dont have to do it. His book is called Addicted to the Street and this fucker made all his money by doing what Martha Stewart got put in prison for. I'm not even exaggerating thats 100% what he did. Typical section from the book. \n\nJim Cramer: Hey what are you guys over there at Lehman Brothers saying about Hewlett Packard? \n\nLehman Brothers assholes: You know what, we are thinking about dropping our rating. Why, what you got?\n\nCramer: Nothing really, I might drop my rating too. Lets do it on Thursday, I'll put in the short today. You guys?\n\nLB: Yeah, we can short today and then release our move from buy to sell on Thursday. Sounds good. Talk to you then.\n\nAnd thats how that fucker made money. I shit you not. Read the book, its all insider trading and he is not even ashamed about it. Fuck that guy",
        "created_utc": 1610987393,
        "id": "gjqdgua",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1611016193.0
    },
    {
        "author": "oElementz",
        "body": "Grn, flt and hpq",
        "created_utc": 1610913371,
        "id": "gjn3x5p",
        "score": 5,
        "subreddit": "CanadianInvestor",
        "created": 1610942171.0
    },
    {
        "author": "Pocky27",
        "body": "Yeah same I have big hopes for HPQ",
        "created_utc": 1611253195,
        "id": "gk34dlf",
        "score": 5,
        "subreddit": "CanadianInvestor",
        "created": 1611281995.0
    },
    {
        "author": "epiccorey",
        "body": "Mtrx hpq,  brag, bitf",
        "created_utc": 1610201145,
        "id": "ginm7jl",
        "score": 5,
        "subreddit": "CanadianInvestor",
        "created": 1610229945.0
    },
    {
        "author": "Jgam81",
        "body": "HPQ got rode hard today",
        "created_utc": 1609884716,
        "id": "gi8cn0u",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1609913516.0
    },
    {
        "author": "Mack_Guyver",
        "body": "HPQ is another one",
        "created_utc": 1611234165,
        "id": "gk21rza",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1611262965.0
    },
    {
        "author": "Mack_Guyver",
        "body": "PYR, HPQ, RNW, MEDV, AQN",
        "created_utc": 1611247732,
        "id": "gk2rzy2",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1611276532.0
    },
    {
        "author": "dalkride",
        "body": "HPQ is promising. Their patent makes for an exciting time to buy into the company. There's been a dry-spell of news since the patent, but we're expecting news from them \"Early in the new year\" as per announcements last year. If this news ends up being that they have a stable product and/or a partnership with an EV manufacturer, their value will skyrocket. I'd say the entry point right now is low risk for a potentially huge earnings spike.\n\nI have 1k shares though, so maybe I'm biased.",
        "created_utc": 1610413012,
        "id": "giy5n8x",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1610441812.0
    },
    {
        "author": "VTX1800Riders",
        "body": "$URAGF HPQ Silicon. Papa Elon says Silicon is the way for his Li on batteries. It is rumored Tesla placed an order for HPQ Nanotechnology Silicon.\n\n[Investor Presentation ](https://hpqsilicon.com/wp-content/uploads/2020/12/HPQ-NEW-FULL-SIZE-VER_DEC9_2020_FINAL.pdf)",
        "created_utc": 1610272476,
        "id": "gir1h7y",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1610301276.0
    },
    {
        "author": "ChamferIt",
        "body": "My FLT, XBC, CTS, HPQ dropped in seemingly (?) similar patterns this week.\n\nIs this drop pattern connected to the frenzy?  Nube...",
        "created_utc": 1611890709,
        "id": "gl6rpsk",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1611919509.0
    },
    {
        "author": "hiddan67",
        "body": "Cuz they now making money by themselves with contracts and by having 10% stakes of hpq. All hpq technology for silicone into ev is owned by pyr. Also pyr is going debt free for q2 21 if it’s not already done",
        "created_utc": 1609634648,
        "id": "ghvrgo3",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1609663448.0
    },
    {
        "author": "OmegaKitty1",
        "body": "Scr, hpq, gdnp, grn, pyr, brag  are the ones I currently hold\n\nI’ve traded many others though",
        "created_utc": 1611256741,
        "id": "gk3cbcx",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1611285541.0
    },
    {
        "author": "Greasyfork",
        "body": "No hype, no rocket emoji's, no swing trading. This is my long hold pennystock. Goddamn I love HPQ-Silicon.",
        "created_utc": 1611235101,
        "id": "gk235fs",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1611263901.0
    },
    {
        "author": "mayboss",
        "body": "Are you guys still holding HPQ?",
        "created_utc": 1610385278,
        "id": "giwia6t",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1610414078.0
    },
    {
        "author": "ntcse",
        "body": "They keep releasing progress on how they are progressing their technology that solves the silicon materials problem that Musk talked about on Battery Day - solution that is cost effective and makes for a more durable and longer range battery.  They disclosed they were paid to send samples to a major automotive company and they have at least 2 others that are under NDA.  Basically it'a a binary stock - if they can figure out how to scale their solution and it works, the stock will 10x or 100x.  If they fail, then the stock goes to zero. They have been in R&amp;D for a while, it's an interesting speculative bet - I prefer PYR for safety since they are the technology company with the expertise that is doing the work for HPQ but also have many other patents and billion dollar industries they are going after so don't even need the battery technology to work out, one of their other opportunities can make them a multi bagger - plus they have revenue and profitability unlike HPQ Silicon. (Note Pyrogenesis has a major stake in the profits/ownership for HPQ)",
        "created_utc": 1609648598,
        "id": "ghwffrc",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1609677398.0
    },
    {
        "author": "qzwoo",
        "body": "Used to have a list with my old work. A few in the US and a few in Europe. I don't recall any promising one in Canada. There are 3D printers that focus on personal design and consumption and there are ones for massive industry productions. I think you are talking about the industrial side which some reports cited 17 trillion TAM. \n\nIn the earlier years, the 3D printers focused on the personal side. The business had a run up then popped (looking at DDD and SSYS long term charts) since they couldn't scale it up enough to be consistently profitable. To date, many companies are developing industrial 3D printers, including HP Inc. the business overall is not yet cashflow positive. So if you are looking for pure plays then you should expect volatility.\n\nIn short, DDD, SSYS and HPQ are the ones that I can remember. Good luck.",
        "created_utc": 1610763036,
        "id": "gjetogt",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1610791836.0
    },
    {
        "author": "GreenWorld11",
        "body": "I've been in HPQ since October, I am definitely holding this year, I believe they will kill it. PYR too",
        "created_utc": 1611249356,
        "id": "gk2vril",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1611278156.0
    },
    {
        "author": "Papamje",
        "body": "Hpq silicon ofc",
        "created_utc": 1610950576,
        "id": "gjp2717",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1610979376.0
    },
    {
        "author": "ParlayYouSay",
        "body": "There’s a few out there for sure. Couple I’m holding are the following with my quick take;\n\nPTE - PolarityTE \n\nThese guys have a skin regeneration product/process where they take a small sample of the patients skin (unlike large skin grafts) create a product from it, which is then applied to the wound/burn which regrows the skin tissue. Tests have been very positive and success rate is very high. Will be looking to hold this one for a longer term with potential to 5x or more over the next year (I think it has a reasonably low risk of significant drops).\n\nEXP/EXPFF - Experion Holdings\n\nWeed stock that hasn’t seen massive lifts yet. Market cap is very small, 1.5-2x sales, where most weed companies range between 5-10x sales. \n\nJust launched a new higher end craft brand ‘Citizen Stash’ online people have been giving it quite strong reviews. Head over to r/theOCS to check for yourself. Early stages and are very close to showing profit, but management is very solid, and their set up allows them to grow at a much quicker base than most growers, as they use licensed satellite growers almost on contract to grow their genetics. \n\nI could easily see this one 5-10x in the following year or two.\n\nHPQ/URAGF - HPQ Silicon Resources Inc.\n\nThis is one I’m interested in opening a position on, but just dig into this weekend. They have a small facility where they have been testing a new extraction procedure for high quality silicon used in EV batteries and Solar panels. \n\nFrom what I’ve read, most other techniques are very expensive and difficult, where their new process is a single step and appears to be at a much cheaper rate. They’re currently attempting to scale the process to a much larger production, and will be completing contracts for an unnamed EV company (I’ve seen this posted as possibly being Renault/Nissan/Mitsubishi). Either way seems like a solid long term option that is producing something lots of these new Green Energy companies will need. I don’t see this one flying off the shelf anytime very soon, but in the long run I’m going to be looking to hold some.",
        "created_utc": 1610919925,
        "id": "gjnhxd9",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1610948725.0
    },
    {
        "author": "im_not_leo",
        "body": "HPQ or URAGF \nThey have developed a nano silicon for EV batteries and have a partnership with a large auto manufacturer, sadly it is not known which one yet since it is behind an NDA",
        "created_utc": 1610298995,
        "id": "gis17cd",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1610327795.0
    },
    {
        "author": "VTX1800Riders",
        "body": "Yes and it is very expensive and is environmentally dirty to mine (Cobalt). Elon Musk announced on battery day that Silicon is the way. It will replace Cobalt. Silicon is one of the most plentiful minerals on earth and HPQ has figured out how to scale production to make it less expensive. In fact they claim they will be the cheapest.",
        "created_utc": 1610295153,
        "id": "girtrui",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1610323953.0
    },
    {
        "author": "Trick_shot_",
        "body": "&gt;*“With the Gen1 PUREVAPTM* *NSiR  operational and exceeding expectations from the start, HPQ NANO is  uniquely positioned to be at the forefront of low-cost manufacturing of  Nano Silicon for batteries and other applications, as we continue  working on scaling up the capabilities of our PUREVAPTM* *NSiR process.”* \n\nI'm in. Their test results are very promising",
        "created_utc": 1611235423,
        "id": "gk23n51",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1611264223.0
    },
    {
        "author": "SmutBrigade",
        "body": "my weekend DD led me to the same conclusion.  I can't believe the sp hasn't kept up, albeit it was way overbought in the summer.  I'm weighted about 85/15 in favour of HPQ.   Loading up on PYR come Monday.",
        "created_utc": 1609638304,
        "id": "ghvy2c0",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1609667104.0
    },
    {
        "author": "CrimsonCorpse",
        "body": "This could work even outside of spacs as well, i am interesseted.  Finance wise im doing well but the capital is low. Im not a finance guy or techsavy, i'm a dumb guy to be honest but i manage to find good opportunities. 1000%+  on HPQ , 1100% +TRIL  and a good few 100%+.",
        "created_utc": 1611007362,
        "id": "gjria7a",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1611036162.0
    },
    {
        "author": "becavern23",
        "body": "Profit = profit though gotta remember that. Was gunna flip it for more HPQ but conveniently that popped at the exact same time instead of after WILD processed",
        "created_utc": 1611257809,
        "id": "gk3eotm",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1611286609.0
    },
    {
        "author": "harpydiem",
        "body": "diversifying makes days like today easy. brag and gdnp down. hpq, doc, cfp up.",
        "created_utc": 1611241443,
        "id": "gk2efa6",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1611270243.0
    },
    {
        "author": "whenabouts",
        "body": "Probably just that. Might go up tomorrow as HPQ published a press release today.",
        "created_utc": 1611280164,
        "id": "gk4oc97",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1611308964.0
    },
    {
        "author": "hheyermans",
        "body": "LI has a big up side and possible double at current $1.70. BUS is speculative if the orders they are anticipating come through it could be at least 50%. UGE has increased 35% in just over a week. It has backlog of orders. Read some where it has enough orders to 2022. THRM has a covid saliva test that is Soo close to approval. At this price could be the biggest gain. HPQ is an EV battery play that may take a while and is a long term hold for me know. Hope this helps.",
        "created_utc": 1610315054,
        "id": "gisx4jq",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1610343854.0
    },
    {
        "author": "mayboss",
        "body": "Where do you foresee HPQ and XBC by the end of the year?",
        "created_utc": 1610468110,
        "id": "gj0fhv7",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1610496910.0
    },
    {
        "author": "conaldpeterson1960",
        "body": "Hpq silicon baby.",
        "created_utc": 1610146598,
        "id": "gilepok",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1610175398.0
    },
    {
        "author": "pianolover99",
        "body": "HPQ is bleeding... help... daddy...",
        "created_utc": 1610328482,
        "id": "gitoplb",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1610357282.0
    },
    {
        "author": "An_doge",
        "body": "Check out HPQ?",
        "created_utc": 1610030436,
        "id": "giffh29",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1610059236.0
    },
    {
        "author": "giant_g2",
        "body": "I mostly agree with your tech statement. I think there's also a risk for the tech platforms that rely on data for their income. The new admin might actually pass some privelacy protections that would make a dent.\n\nThe exceptions I see to my feeling on this are MSFT and HPE/HPQ. MSFT is pretty diverse and doesn't rely on personal data for the bulk of their income. HPE/HPQ seem to have been ignored compared to other hardware companies. I think the hype around chipmakers drew most of the money and some the intermediaries seem left behind.",
        "created_utc": 1610740750,
        "id": "gjdmiea",
        "score": 2,
        "subreddit": "stocks",
        "created": 1610769550.0
    },
    {
        "author": "Greasyfork",
        "body": "I am not. Even if Tesla is not the manufacturer who put in the order and is going their own way there will be a lot of parties interested from EV, medics and other appliance fields. Hydrogen production being one of them. \n\n[This is an interview with the CEO that touches the subject](https://youtu.be/KajFyR2jgVs)\n\nAgoracom IR has a lot of interviews with the HPQ CEO. I suggest looking into it!",
        "created_utc": 1609786009,
        "id": "gi3e7bb",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1609814809.0
    },
    {
        "author": "hiddan67",
        "body": "Pyr and HPQ are set for 2021📈",
        "created_utc": 1611236419,
        "id": "gk257oe",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1611265219.0
    },
    {
        "author": "Longjumping-Exit1642",
        "body": "Nice picks. UGE.V pure play solar winning 1/3 of solar projects in New York growing portfolio community solar Maine huge tax capex and prosu credits huge growth ahead. Huge backlog 120M vs market cap 50M. Cielo waste management CMC.ce government mandates renewable diesel blended into fuels proprietary tech proven turns waste all sorts including non recyclables into renewable fuel. 👍 neo lithium, nano one, hpq, battery metals &amp; battery metal tech.",
        "created_utc": 1609541813,
        "id": "ghrppl8",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1609570613.0
    },
    {
        "author": "thetagodfather",
        "body": "Awesome, my line of thinking very close to yours\n\nPRNT and DDD blew the f up this week. Have to hold my nose for the HPQ holding in it though bleh",
        "created_utc": 1610188489,
        "id": "gin7y6x",
        "score": 2,
        "subreddit": "stocks",
        "created": 1610217289.0
    },
    {
        "author": "Longjumping-Exit1642",
        "body": "Are you sure HOFV is a recovery stock? Previously to covid they were losing money.. so might not be a recovery pick at all. If the business model pre covid was cash burn no profits. Nou might be a bubble stock hype no earnings.. looks like what HPQ is doing except lesser tech and no orders or contracts or visibility on potential earnings.",
        "created_utc": 1610164763,
        "id": "gime8dn",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1610193563.0
    },
    {
        "author": "dalkride",
        "body": "Biden supposed to announce a multi-trillion dollar stimulus, and funding to EVs on Thursday. I'd say expect battery tech (HPQ, NOU, etc), EV stock (TSLA, MG), clean energy, and renewable/sustainable food to rise. Essentially green future sectors. Also crypto because the US is just printing money now.",
        "created_utc": 1610527761,
        "id": "gj3gevf",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1610556561.0
    },
    {
        "author": "LordOftheJewz",
        "body": "HPQ +1 got in at 0.45",
        "created_utc": 1610307876,
        "id": "gisi9r4",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1610336676.0
    },
    {
        "author": "marccc31",
        "body": "I was actually about to sell HPQ and cut my losses. I bought a few weeks ago at $1.12 and it has only been going down every day. Maybe I’ll hold for a bit longer",
        "created_utc": 1610297997,
        "id": "girz73j",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1610326797.0
    },
    {
        "author": "Mr_Pattagucci",
        "body": "ZAIR, MN.V, HPQ-Silicon, DML   \n\n\nWhy? Because.",
        "created_utc": 1611238646,
        "id": "gk291vc",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1611267446.0
    },
    {
        "author": "Pocky27",
        "body": "I was looking at hpq just yesterday! Anyone know why it pumped up today?",
        "created_utc": 1611242370,
        "id": "gk2gapk",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1611271170.0
    },
    {
        "author": "marccc31",
        "body": "Finally!\n\nhttps://ca.finance.yahoo.com/news/hpq-gen1-nano-silicon-reactor-130000045.html",
        "created_utc": 1611281030,
        "id": "gk4py7m",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1611309830.0
    },
    {
        "author": "pianolover99",
        "body": "What an amazing day. My PYR and HPQ back up, MN.V up crazy, and XBC up modestly. GREEN GREEN GREEN.",
        "created_utc": 1610654738,
        "id": "gj9imd9",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1610683538.0
    },
    {
        "author": "Particular_Agency809",
        "body": "Telling you guys do your DD and buy HPQ it’s worth it!!!!",
        "created_utc": 1611331619,
        "id": "gk70hut",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611360419.0
    },
    {
        "author": "b_treyy4",
        "body": "Anyone else adding to HPQ ?? I’m starting to wonder if I’m crossing my fingers for something won’t be breaking through for a long time ...",
        "created_utc": 1611962456,
        "id": "glb0lm3",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1611991256.0
    },
    {
        "author": "Realistic_Ad3435",
        "body": "Small cap canadian company in nano silicon tech for EV batteries HPQ currently at a nice dip of 0.88 🚀🚀🚀🚀🚀",
        "created_utc": 1611969217,
        "id": "glber65",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611998017.0
    },
    {
        "author": "rustduck",
        "body": "Lithium–silicon battery cost of high grade silicon will be coming down making this type of battery more prevalent. HPQ has finished 3 trial test of they reactor make high grade silicon. \nTarget was between100 nm and 200 nm. Test was better than expected below 100 nm Si base spherical nanopowders &amp; nanowires material could be used as anode material for Li-ion batteries, combined with graphite or not.\nThis will be a disrupter in the battery industry and will make electric cars more affordable.",
        "created_utc": 1611401207,
        "id": "gkck691",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611430007.0
    },
    {
        "author": "blacko69",
        "body": "Hey, love the tool and saw it when you posted on the other subs. \n\nJust noticed however that a few of the hot Canadian stocks we talk about lots up here are likely the wrong ticker as they are on different exchanges -eg. PHO vs. PHO.TO, HPQ vs. HPQ.V and CTS vs. CTS.V. Any way to map it to the proper tickers??",
        "created_utc": 1611293125,
        "id": "gk5azy0",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1611321925.0
    },
    {
        "author": "the_mad_paddler",
        "body": "Most excited about the potential for hpq, I am a firm believer it should be on folks watchlists. Or if you like the fundemtals a long term hold.",
        "created_utc": 1611248047,
        "id": "gk2sqrm",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1611276847.0
    },
    {
        "author": "StylinDinosaur",
        "body": "HPQ is my big play. PYR goes hand in hand with them.\nHAI, XBC, GDNP, and GRN are some others I expect to do well this year.\n\n\nReally look at HPQ though if you haven't. They have me more excited than any of my other holdings with their potential to completely own the nano silicon market.",
        "created_utc": 1611279701,
        "id": "gk4nh75",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611308501.0
    },
    {
        "author": "ParlayYouSay",
        "body": "For sure, there are tons with potential out there, but these are some i have or will be investing in. No major red flags from any that have stopped me so far. \n\nAs far as my positions to be transparent I bought into EXP at $.09 CAD, sold some on a quick run up to $.22 then rebought a larger position with some of my profit at $.16 CAD. Right now I think it’s back around .17-.18. The US ticker is EXPFF\n\nPTE I FOMO’d and bought in high, 1000 shares at $1.60 then we saw a fairly significant dump back down to $1.08 right now. This is one I have no issue holding, and am considering buying more to average down my cost a bit, but do really think it has major potential. I can’t remember where and have no idea of the truth behind it so take this with a very small grain of salt, but I do remember reading somewhere that they were also looking at/working on regeneration of both muscle and bone as well (which would be a game changer if correct). Anyone can feel free to confirm or deny this, or if they’re familiar with where I may have seen it please share the link. \n\nNo position in HPQ yet, but hoping to grab some on the TSX here in Canada since it’s open. Only thing holding me back is keeping the cash for a YOLO quick 🚀🚀🚀 play, LoL. So far I’ve had solid runs with CHEK (more than doubled - sold the majority of my position and kept a small amount long term). EXP where I just more than doubled, but have no increased my position. Then just this week with SENS which I have also sold 75% at double what I bought it at and kept 25% for long term.",
        "created_utc": 1610920837,
        "id": "gjnjzje",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1610949637.0
    },
    {
        "author": "SucksAtStocks",
        "body": "CTS, AT, BB &amp; BRAG have the highest ceilings based on current value and upcoming catalysts IMO.\n\nHPQ is my dark horse for a ten-bagger. GDNP has a high ceiling, but it's a longer-term play.",
        "created_utc": 1610921511,
        "id": "gjnlkbl",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1610950311.0
    },
    {
        "author": "gryphon999555",
        "body": "Not sure if I want to double down on HPQ or PYR.",
        "created_utc": 1610137353,
        "id": "gikuvvh",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1610166153.0
    },
    {
        "author": "Butterflys4Life",
        "body": "My Top Pick: **MEDV.NE** (Formerly Questcap: **QSC**)  \nWith all the Covid test sites they are building &amp; funding (Just got a 5mil contract from Kinross Gold for Covid tests/testing equipment) along with other funding they have received to do so from others, going over a dollar is very likely by years end imo. \n\n A few others I invested in that I hope double:  \n**HPQ**  \n**HOT.UN**  \n**HIVE**  \n**ETHC.NE**  \n**VET**",
        "created_utc": 1610258140,
        "id": "giqlfnk",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1610286940.0
    },
    {
        "author": "David_Rodgher",
        "body": "$HPQ - Silicon Resources Inc. operates as a quartz exploration company in Canada. It is involved in the exploration, mining, and production of silicon metals, solar grade silicon metals, and porous silicon wafers. Canadian penny stock if a huge opportunity to growth due EV's and renewable  wave!!!",
        "created_utc": 1610318021,
        "id": "git3f1j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1610346821.0
    },
    {
        "author": "HorseJizzMaster",
        "body": "‘member when Xerox tried to buy HPQ and then HPQ tried to buy Xerox but then a pandemic broke out?",
        "created_utc": 1610584878,
        "id": "gj6cs26",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1610613678.0
    },
    {
        "author": "VTX1800Riders",
        "body": "[HPQ Silicon Investor Presentation](https://hpqsilicon.com/wp-content/uploads/2020/12/HPQ-NEW-FULL-SIZE-VER_DEC9_2020_FINAL.pdf)",
        "created_utc": 1610214442,
        "id": "gioa1ak",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1610243242.0
    },
    {
        "author": "Learnallthethings11",
        "body": "Hpq nano silicon",
        "created_utc": 1610700825,
        "id": "gjbs3wq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1610729625.0
    },
    {
        "author": "BlackSlimx",
        "body": "I bought hpq at .50 n sold at 1.00 planning on getting back in...I also plan on getting one of hive or bitfarm...first found hive when it was .66",
        "created_utc": 1609531912,
        "id": "ghr75yt",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1609560712.0
    },
    {
        "author": "VTX1800Riders",
        "body": "Pyro is a 12% equity stake holder in HPQ Silicon. Pyro has requested to be listed in NASDAQ. They just filed the paperwork last month. I would say it’s going to help the stock tremendously, especially if it TESLA.",
        "created_utc": 1609608097,
        "id": "ghucc6w",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1609636897.0
    },
    {
        "author": "ntcse",
        "body": "HPQ has something going on in this space, partnered with the French military - pretty much a powder you can mix with anything that has a decent amount of water to get fuel in remote areas - sounds cost disruptive but early days.  Pyrogenesis has a large stake in them and I hold stock in that company.  EU has a 140 Billion Hydrogen plan so it can't be ignored completely.",
        "created_utc": 1609611375,
        "id": "ghuiu6e",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1609640175.0
    },
    {
        "author": "Greasyfork",
        "body": "Repost for the only two penny stocks I'm holding for a long time.\n\n&gt;[HPQ-Silicon](https://ca.finance.yahoo.com/quote/hpq.v?ltr=1)\n\n&gt;$HPQ.V ($URAGF, canadian penny stock) is going to be a big player in Battery Tech. On the verge of greatness with replacing graphite in lithium ion batteries, with carbon coated nano silicon (producing it cheap and scaleable.)\n\n&gt;[Filed a patent for usage of their material as anode material for lithium ion batteries](https://money.tmx.com/en/quote/HPQ/news/6185379281812822/HPQ_Files_Provisional_Patent_Application_for_Silicon_ByProduct_Created_by_PUREVAPTM_QRR_as_Anode_Material_for_LithiumIon_Batteries)\n\n&gt;[The Reactor went live, news was expected but still a small bump in SP](https://money.tmx.com/en/quote/HPQ/news/8704652097843750/HPQ_NANO_Reaches_Major_Milestones_With_Gen_1_Nano_Silicon_Reactor_Operational)\n\n&gt;[Major Automobile Manufacturer placed the first order for december](https://money.tmx.com/en/quote/HPQ/news/6543457447206373/HPQ_NANO_Receives_First_Order_for_Spherical_Nano_Silicon_Material_from_Major_Automobile_Manufacturer)\n\n&gt;[They can coat Nano Sillicon with graphite AS IT IS being produced, major breaktrough for cost reduction as it is one step.](https://money.tmx.com/en/quote/HPQ/news/6387961169007293/HPQ_Proprietary_Nano_Silicon_Manufacturing_Process_to_Incorporate_First_Ever_One_Step_Capability_of_Carbon_Coating_Nano_Silicon_Material_as_it_is_Produced)\n\n&gt;[They are on track to fullfill their order in december for the major automobile manufacturer.](https://money.tmx.com/en/quote/HPQ/news/5730891838806215/HPQ_NANO_on_Track_to_Start_of_Gen1_Reactor_in_December)\n\n&gt;[Pyrogenesis](https://ca.finance.yahoo.com/quote/PYR.TO?p=PYR.TO&amp;.tsrc=fin-srch)\n\n&gt;Pyrogenesis $PYR is a multifaceted company involved in a whole bunch of things. \n\n&gt;Had an insane Q3, amazing backlog and are going to be listed on Nasdaq in the near future. \n\n&gt;Stock has been on a slow decline because the CEO promised more torches and contracts before eoy then he has currently. Will get significant SP boost after more torchdeals are specified (already in the making). Currently in bed with the US navy and rumoured to be doing business with $VALE.\n\n&gt;Crazy undervalued and will break double digit eventually next year.\n\n&gt;[$PYR files listing application with NASDAQ](https://money.tmx.com/en/quote/PYR/news/7473704437731310/PyroGenesis_Files_Listing_Application_with_NASDAQ)\n\n&gt;[$PYR signs additional $1.1MM contract with US tunneling company.](https://money.tmx.com/en/quote/PYR/news/4555090973415024/PyroGenesis_Signs_Additional_11MM_Contract_with_US_Tunneling_Company)\n\n&gt;[$PYR Received Solar Impulse Efficient Solution Label (Label ensures that the solutions made by the company are green and profitable.](https://money.tmx.com/en/quote/PYR/news/7382987387276683/PyroGenesis_Receives_Solar_Impulse_Efficient_Solution_Label_Further_Solidifying_its_Position_as_an_Emerging_Leader_in_GHG_Emissions_Reduction)\n\n&gt;[$PYR to file application to uplist to NASDAQ after approval of board.](https://money.tmx.com/en/quote/PYR/news/7492230978925115/PyroGenesis_Board_Approves_Plan_to_File_Application_to_NASDAQ_for_Q1_2021_Listing)\n\n&gt;Older news:\n\n&gt;[Smashed their Q3 report.](https://money.tmx.com/en/quote/PYR/news/6627021067521607/PyroGenesis_Announces_Q3_2020_Results_Revenues_81MM_Net_Income_153MM_Gross_Margin_679_Current_Backlog_364MM_Basic_EPS_010) \n\n&gt;[Graduated to TSX (big boy canada exchange) on nov 18th.](https://money.tmx.com/en/quote/PYR/news/8728636381154682/PyroGenesis_Receives_Final_Approval_to_Graduate_to_the_Toronto_Stock_Exchange)\n\nPosition: 15.000 &amp; 1000 shares long.",
        "created_utc": 1609856243,
        "id": "gi6iuur",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1609885043.0
    },
    {
        "author": "mayboss",
        "body": "Just did exactly the same. Probably joining HPQ wagon now",
        "created_utc": 1609859752,
        "id": "gi6pbpk",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1609888552.0
    },
    {
        "author": "jimbob123135",
        "body": "Btw if you like HPQ then check out PyroGenesis.\n\nHPQ is basically their R&amp;D side project.",
        "created_utc": 1609699375,
        "id": "ghza8b2",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1609728175.0
    },
    {
        "author": "BlackSteezy",
        "body": "HPQ Silicon. They are working to produce high grade nano silicon for use in batteries. Seems very promising given recent news.",
        "created_utc": 1611950768,
        "id": "gla6oge",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1611979568.0
    },
    {
        "author": "gogglesvancouver",
        "body": "Eh that's been the entire ev sector.\nNickel\nCopper\nLithium\nSilicon\nGreen tech \n\nThat wasn't the cause of HPQ running. Imo",
        "created_utc": 1610837605,
        "id": "gjijs20",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1610866405.0
    },
    {
        "author": "Winter_Map_5289",
        "body": "HPQ",
        "created_utc": 1611760484,
        "id": "gkyf5mw",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1611789284.0
    },
    {
        "author": "redditor2113",
        "body": "What do you guys think of HPQ Silicon Resources? (URAGF on OTC)",
        "created_utc": 1611392641,
        "id": "gkbrw0g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611421441.0
    },
    {
        "author": "Particular_Agency809",
        "body": "HPQ UP 18% HELL YES",
        "created_utc": 1611242769,
        "id": "gk2h448",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611271569.0
    },
    {
        "author": "Pocky27",
        "body": "I just did the same. I've been considering HPQ. Wish I bought it yesterday rather than today but I see more upside coming its way",
        "created_utc": 1611243385,
        "id": "gk2ie6t",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1611272185.0
    },
    {
        "author": "Particular_Agency809",
        "body": "Do you DD and Buy HPQ",
        "created_utc": 1611243398,
        "id": "gk2if4h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611272198.0
    },
    {
        "author": "whenabouts",
        "body": "[https://www.globenewswire.com/news-release/2020/08/18/2080213/0/en/PyroGenesis-Signs-3M-Contract-with-HPQ-Subsidiary-Includes-IP-Sale-of-2-4MM.html](https://www.globenewswire.com/news-release/2020/08/18/2080213/0/en/PyroGenesis-Signs-3M-Contract-with-HPQ-Subsidiary-Includes-IP-Sale-of-2-4MM.html)\n\nA really good breakdown of Pyr's involvement with HPQ.",
        "created_utc": 1611001107,
        "id": "gjr5lov",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1611029907.0
    },
    {
        "author": "hiddan67",
        "body": "I usually dont. Like 0. But pyr and hpq is my only penny play because they have potential and pyr proved it many time in 2020 with upgrade to the tsx snd now nasdaq. They drive for shareholder value",
        "created_utc": 1609646018,
        "id": "ghwba1o",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1609674818.0
    },
    {
        "author": "Greasyfork",
        "body": "It's not split up. Two different companies, HPQ uses Pyrogenesis technology. \n\nPyrogenesis has a large of number shares in HPQ to prevent hostile take overs.",
        "created_utc": 1609706934,
        "id": "ghzqqei",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1609735734.0
    },
    {
        "author": "vacuum_potential",
        "body": "Are you at all concerned that Tesla has a better approach? I'm not a chemist and have a hard time following some of the technical differences between HPQ and what Tesla is doing.",
        "created_utc": 1609783188,
        "id": "gi383xf",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1609811988.0
    },
    {
        "author": "Greasyfork",
        "body": "Repost part infinity:\n\nRepost from my other comments and posts. I have a couple more pennystocks that I'm going to write about. For now these are my crown jewels that I will be holding for a couple of years.\n\n[HPQ-Silicon](https://ca.finance.yahoo.com/quote/hpq.v?ltr=1)\n\n$HPQ.V ($URAGF, canadian penny stock) is going to be a big player in Battery Tech. On the verge of greatness with replacing graphite in lithium ion batteries, with carbon coated nano silicon (producing it cheap and scaleable.)\n\n&gt;[Filed a patent for usage of their material in Lithium Battery anodes.](https://money.tmx.com/en/quote/HPQ/news/6185379281812822/HPQ_Files_Provisional_Patent_Application_for_Silicon_ByProduct_Created_by_PUREVAPTM_QRR_as_Anode_Material_for_LithiumIon_Batteries)\n\n&gt;[The Reactor went live, news was expected but still a small bump in SP](https://money.tmx.com/en/quote/HPQ/news/8704652097843750/HPQ_NANO_Reaches_Major_Milestones_With_Gen_1_Nano_Silicon_Reactor_Operational)\n\n&gt;[Major Automobile Manufacturer placed the first order for december](https://money.tmx.com/en/quote/HPQ/news/6543457447206373/HPQ_NANO_Receives_First_Order_for_Spherical_Nano_Silicon_Material_from_Major_Automobile_Manufacturer)\n\n&gt;[They can coat Nano Sillicon with graphite AS IT IS being produced, major breaktrough for cost reduction as it is one step.](https://money.tmx.com/en/quote/HPQ/news/6387961169007293/HPQ_Proprietary_Nano_Silicon_Manufacturing_Process_to_Incorporate_First_Ever_One_Step_Capability_of_Carbon_Coating_Nano_Silicon_Material_as_it_is_Produced)\n\n&gt;[They are on track to fullfill their order in december for the major automobile manufacturer.](https://money.tmx.com/en/quote/HPQ/news/5730891838806215/HPQ_NANO_on_Track_to_Start_of_Gen1_Reactor_in_December)\n\n[Pyrogenesis](https://ca.finance.yahoo.com/quote/PYR.TO?p=PYR.TO&amp;.tsrc=fin-srch)\n\nPyrogenesis $PYR is a multifaceted company involved in a whole bunch of things. \n\n&gt;Had an insane Q3, amazing backlog and are going to be listed on Nasdaq in the near future. \n\n&gt;Stock has been on a slow decline because the CEO promised more torches and contracts before eoy then he has currently. Will get significant SP boost after more torchdeals are specified (already in the making). Currently in bed with the US navy and rumoured to be doing business with $VALE.\n\n&gt;Crazy undervalued and will break double digit eventually next year.\n\n&gt;[$PYR Received Solar Impulse Efficient Solution Label (Label ensures that the solutions made by the company are green and profitable.](https://money.tmx.com/en/quote/PYR/news/7382987387276683/PyroGenesis_Receives_Solar_Impulse_Efficient_Solution_Label_Further_Solidifying_its_Position_as_an_Emerging_Leader_in_GHG_Emissions_Reduction)\n\n&gt;[$PYR to file application to uplist to NASDAQ after approval of board.](https://money.tmx.com/en/quote/PYR/news/7492230978925115/PyroGenesis_Board_Approves_Plan_to_File_Application_to_NASDAQ_for_Q1_2021_Listing)\n\n&gt;Older news:\n\n&gt;[Smashed their Q3 report.](https://money.tmx.com/en/quote/PYR/news/6627021067521607/PyroGenesis_Announces_Q3_2020_Results_Revenues_81MM_Net_Income_153MM_Gross_Margin_679_Current_Backlog_364MM_Basic_EPS_010) \n\n&gt;[Graduated to TSX (big boy canada exchange) on nov 18th.](https://money.tmx.com/en/quote/PYR/news/8728636381154682/PyroGenesis_Receives_Final_Approval_to_Graduate_to_the_Toronto_Stock_Exchange)",
        "created_utc": 1609514860,
        "id": "ghpzj3d",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1609543660.0
    },
    {
        "author": "a77asad",
        "body": "Are you talking about HPQ Silicon resources?",
        "created_utc": 1609640130,
        "id": "ghw1ad8",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1609668930.0
    },
    {
        "author": "im_not_leo",
        "body": "HPQ silicon please (UROGF)",
        "created_utc": 1610419341,
        "id": "giyi594",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1610448141.0
    },
    {
        "author": "Think-Fact",
        "body": "Thank you! This is the survivor bias I needed to put my life savings on one stock! All in HPQ",
        "created_utc": 1610212926,
        "id": "gio71ge",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1610241726.0
    },
    {
        "author": "hheyermans",
        "body": "I am doing something similar but I am investing in LI, BUS, HPQ, UGE, THRM.",
        "created_utc": 1610305385,
        "id": "gisd96u",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1610334185.0
    },
    {
        "author": "VTX1800Riders",
        "body": "TSLA to 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀due to major battery breakthrough with silicon technology by HPQ Silicon $URAGF. Cathie’s target price of $3000.00-$4000.00 will be within reach. Ready for take off?!🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀[HPQ Silicon Tesla Connection?](https://hpqsilicon.com/wp-content/uploads/2020/12/HPQ-NEW-FULL-SIZE-VER_DEC9_2020_FINAL.pdf)\n\nr/HPQNANO",
        "created_utc": 1610235207,
        "id": "gipgg4d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1610264007.0
    },
    {
        "author": "ianchandler3",
        "body": "Just don’t get too emotional about it. That’s when Mr. Market wins.",
        "created_utc": 1609542108,
        "id": "ghrq8se",
        "score": 117,
        "subreddit": "stocks",
        "created": 1609570908.0
    },
    {
        "author": "joeyarctic",
        "body": "I've been losing my whole life by just blowing money and not even accumulating it. I could lose that whole 1000 dollars and it'd still be worth it to me, knowing that I can save up money like that if I really wanted too.",
        "created_utc": 1609544585,
        "id": "ghruppn",
        "score": 52,
        "subreddit": "stocks",
        "created": 1609573385.0
    },
    {
        "author": "TypicalFacts",
        "body": "I came here for confirmation bias and this isn’t it",
        "created_utc": 1609624113,
        "id": "ghv7kvw",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1609652913.0
    },
    {
        "author": "blackicebaby",
        "body": "This is good news for $gme.  Call it is!",
        "created_utc": 1609559369,
        "id": "ghslabj",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1609588169.0
    },
    {
        "author": "Artavioyonk",
        "body": "Idk if I'm just drunk or you guys are extra funny tonight. \n\n🍻 pour one out for my brother who passed 12/26/20. R.I.P. Eli\n\nI need 2020 to manifest itself physically so I can personally give it this asswhoppin it deserves.",
        "created_utc": 1609557783,
        "id": "ghsiicz",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1609586583.0
    },
    {
        "author": "billygoatdaboss",
        "body": "I remember when I started lurking here and thought everyone was a stonk wizard and it took me bout 2 months to realize we all equally retarded",
        "created_utc": 1609637484,
        "id": "ghvwm5p",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1609666284.0
    },
    {
        "author": "Handle-me-timber",
        "body": "If it said calls it’d be a lambo.",
        "created_utc": 1609553320,
        "id": "ghsaayy",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1609582120.0
    },
    {
        "author": "OlyBomaye",
        "body": "Gave my 2 year old daughter a wallet for christmas.  Typical girl's wallet, with a zipper and a loop to hold on the wrist.\n\nA moment ago she walked up to me holding the wallet and says, \"you wanna see?\"  I say sure.  She slowly works the zipper on the wallet.  \"wanna see?  wanna see?  you see dada?\"\n\nNot sure what I was expecting her to have in there, but it was certainly not a dozen dried up slices of mandarin oranges.",
        "created_utc": 1609644070,
        "id": "ghw83j6",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1609672870.0
    },
    {
        "author": "Objective_Stage",
        "body": "Janet: \"Jerome, what are you doing with that?\"\n\nJPow: \"It go brrrr\"\n\nJanet: \"No no, let me have that.\"\n\nJerome: \"IT GO brrr agagagaa {bites shoulder, shits pants}\"\n\nJanet: \"See, let me show you, it in fact goes BRRRRRRRRRRRRRR\"",
        "created_utc": 1609532837,
        "id": "ghr8utg",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1609561637.0
    },
    {
        "author": "homelyferret",
        "body": "Was anyone else kinda disappointed when in \"The Big Short\", at the end, Burry walks up to the whiteboard and puts up \"462%\"?\n\nI was like...that's it?",
        "created_utc": 1609552762,
        "id": "ghs9atr",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1609581562.0
    },
    {
        "author": "not_AtWorkRightNow",
        "body": "In all seriousness, do they have a comprehensive plan for switching to online retail or are we just gonna meme it into reality?",
        "created_utc": 1609563852,
        "id": "ghssyji",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1609592652.0
    },
    {
        "author": "graham0025",
        "body": "I played it conservative, 1/15 29c",
        "created_utc": 1609543447,
        "id": "ghrsnoc",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1609572247.0
    },
    {
        "author": "SBtroutbum",
        "body": "Fuck yeah brother. I'm long on this. Don't even look at it every day. Ok I still look at it every day. Multiple times per day.",
        "created_utc": 1609637088,
        "id": "ghvvwly",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1609665888.0
    },
    {
        "author": "xtow3",
        "body": "when someone talks about how every dog they've had is \"bad\" it instantly tells me that they're an asshole",
        "created_utc": 1609540095,
        "id": "ghrmjmc",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1609568895.0
    },
    {
        "author": "jhonkas",
        "body": "the store closings were announced months ago?\n\n&amp;#x200B;\n\n The retailer, during an earnings call with investors today, revealed it  plans to close over 1,000 stores by the end of the fiscal year, which is  to say, by April 1, 2021. I",
        "created_utc": 1609555225,
        "id": "ghsdvfd",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1609584025.0
    },
    {
        "author": "mehliana",
        "body": "it holds one of each animal in anticipation of a big flood",
        "created_utc": 1609636929,
        "id": "ghvvmdk",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1609665729.0
    },
    {
        "author": "Monkiboithethird",
        "body": "I wISh ThE MoDs WouLD cHeCk thEsE PaaaMP &amp; DuHHmPs aNd ShEEEtCoiNZ. \n\nGive me a break. If you are coming to wsb for anything else, you’re doing it wrong. \n\nSincerely,\n\nTankergang",
        "created_utc": 1609614433,
        "id": "ghuoskj",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1609643233.0
    },
    {
        "author": "Footsteps_10",
        "body": "Narrator - “It was not the truth”",
        "created_utc": 1609553675,
        "id": "ghsayl1",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1609582475.0
    },
    {
        "author": "GreyRobe",
        "body": "I think it's definitely it. Whenever /r/wallstreetbets hates on something, you know it is destined to increase in value.",
        "created_utc": 1609632704,
        "id": "ghvnuxx",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1609661504.0
    },
    {
        "author": "GushingGranny1",
        "body": "Honestly if PLTR dropping would result in having these fucking normies paper-handing their positions and stop spamming bullshit rocket emojis everywhere I'll take it. Honestly, the way every retard on this sub was shilling their PLTR positions was getting really obnoxious.",
        "created_utc": 1609534216,
        "id": "ghrbggz",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1609563016.0
    },
    {
        "author": "eduardopazruiz",
        "body": "AT&amp;T commercial chick can get it",
        "created_utc": 1609553851,
        "id": "ghsbad8",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1609582651.0
    },
    {
        "author": "TexasExPat1",
        "body": "My neighbor sells options and recently bought a new Mercedes, driving by is so painful since I know I probably helped pay for it 🤡",
        "created_utc": 1609641781,
        "id": "ghw472r",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1609670581.0
    },
    {
        "author": "MetalVyse",
        "body": "I like this theory from u/redcedar53 -\n\nI think that 3% (buy on to 9.8% ownership) was just to test the waters to see how the market would react. It jumping to 25% upon news and holding it there for 2 weeks, that’s good enough data points. It also suggests there is a lot of cash waiting on the sidelines ready to jump in GME. My guess would be the next buy in could be double last week’s (7%) upping his totally ownership to 20%.\n\nThis is just such a perfect timing technically (cup and handle forming since Dec. 1), sales numbers coming up (I suspect it’ll come next week), and then the conference. \n\nThey also probably don’t want each news to overshadow each other - they would want to jump off each other to build the momentum. I suspect 13D filing early next week to jump start the momentum, sales numbers mid-late next week to sustain the momentum, and the the conference the week after that for a complete explosion.",
        "created_utc": 1609539647,
        "id": "ghrlpdm",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1609568447.0
    },
    {
        "author": "Existing-Screen-3105",
        "body": "Tesla deliveries underwhelming. Current P/E is nearly 1,400. Common sense indicates a sharp correction is inevitable.\n\nTherefore it will open at $750 on Monday and hit $850 by EOW.",
        "created_utc": 1609614129,
        "id": "ghuo75j",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1609642929.0
    },
    {
        "author": "TreeHugChamp",
        "body": "Bought my Samsung 70 smart tv for $450 back in March. Give it a few months and they’ll drop the price some more.",
        "created_utc": 1609544479,
        "id": "ghruilc",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1609573279.0
    },
    {
        "author": "ArmChairFaggot",
        "body": "Back in my day no one here bought any stocks at all. It was 100% options. You can tell our retardation is being diluted with all the noobs.",
        "created_utc": 1609628144,
        "id": "ghvfamf",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1609656944.0
    },
    {
        "author": "brbcripwalking",
        "body": "Monday gonna pump to bait $600 Robinhood gang.\n\nSPY opens $374 and goes up to $376 in the first hour.\n\nIncluding meme stocks like TSLA and PLTR.\n\nRobinhoods who bought calls at open will act like they’re the next Wolf of Wall Street and mock 🌈🐻s and make wife’s boyfriend jokes like it’s not overplayed.\n\nSPY immediately dumps to $370 on a $2000 stim shot down by senate tweet even though it was obvious.\n\nRobinhoods throw their calls for a loss and starts mass downvoting. It tanks all the way down to $369.07 and flickers into $368.97.\n\nWSBs loads up on puts at this point. Algos buy the dip and this is compounded by 🥭 tweeting “get $2000 stim done meow 😼”\n\nSPY closes $374, completely flat, and theta wins again.\n\nJust buy shares if you lost money last year.\n\nSource: I’m a market maker.",
        "created_utc": 1609640800,
        "id": "ghw2h4v",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1609669600.0
    },
    {
        "author": "bazookatroopa",
        "body": "I don’t want to go back to work Monday, I’m panicking already. I hate my job and working 80 hour weeks with high stress. It was nice to chill for a few days and dick around daytrading. I don’t have enough money to quit yet...",
        "created_utc": 1609546270,
        "id": "ghrxqda",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1609575070.0
    },
    {
        "author": "jumpingjacks86",
        "body": "DWD fucked my girlfriend and I liked it",
        "created_utc": 1609647490,
        "id": "ghwdntb",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1609676290.0
    },
    {
        "author": "LUV2FUKMARRIEDMILFS",
        "body": "The exact quote that got DWD banned:\n\n“ it was that MOD who I rejected 🙅‍♂️ his offer to suck my cock “ \n\n\nI smell a conspiracy!!!\n\nhttps://youtu.be/y8Kyi0WNg40",
        "created_utc": 1609647764,
        "id": "ghwe3s4",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1609676564.0
    },
    {
        "author": "cashflow_",
        "body": "Life is so hard. Even with me playing it on easy mode. Can’t imagine what less fortunate people go through",
        "created_utc": 1609555746,
        "id": "ghseueq",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1609584546.0
    },
    {
        "author": "cashflow_",
        "body": "I want a white lambo. Two neighbors have one and I see them every day and I fucking want one. Going to trash my m4 it’s garbage I hate it and it disgusts me",
        "created_utc": 1609539303,
        "id": "ghrl1tw",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1609568103.0
    },
    {
        "author": "silverlink22",
        "body": "Germany about to extend lockdown 3 more weeks. I literally can’t deal with this shit anymore. It’s so fucking boring here. I’m bearish as fuck, but I can not wait for this vaccine distribution to hurry the fuck up. Jesus Christ. Then the weather here is cloudy , shitty and rainy all the time making it even more miserable.",
        "created_utc": 1609691824,
        "id": "ghyt5al",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1609720624.0
    },
    {
        "author": "heuiseila",
        "body": "It actually feels kinda nice not watching my positions drill during power hour for once this week",
        "created_utc": 1609534182,
        "id": "ghrbe8c",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1609562982.0
    },
    {
        "author": "Treecrust",
        "body": "Mexican or Chinese for dinner? Don't come at me with some bullshit like *Indian* or *Thai*. I would love to go to one of those restaurants but we aren't that cultured around here. One Indian restaurant in the whole damn town and they charge like it too.",
        "created_utc": 1609536851,
        "id": "ghrgdna",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1609565651.0
    },
    {
        "author": "scarberia123",
        "body": "I lost some money from risky/impulsive bets, it’s one thing to read other people’s warnings, but I think people really take it to heart when they lose their own money. Hope you don’t lose, but if/when you do, just consider you paid for a valuable lesson:) good luck",
        "created_utc": 1609548631,
        "id": "ghs1xp4",
        "score": 16,
        "subreddit": "stocks",
        "created": 1609577431.0
    },
    {
        "author": "zxyzyxz",
        "body": "It came from someone misspelling HOLD and it caught on as a meme. Hold on for dear life is a backronym.",
        "created_utc": 1609552314,
        "id": "ghs8hly",
        "score": 16,
        "subreddit": "investing",
        "created": 1609581114.0
    },
    {
        "author": "bonejohnson8",
        "body": "I know everybody bitches about it being tough to get a job, it's fucking tougher to hire somebody capable. I need someone good at illustrator who can operate a fucking paper cutter and knows basic computer hotkeys and it's like pulling teeth. This one woman I hired BEGGED ME FOR CASH on her third day of work. She said her babies gotta eat and that she'll do anything. Bitch ew. I need you to print shipping labels I don't need no crusty ass blowjob. \n\nShe looked decent on paper (for Florida) and was getting better and then she asked me for a fucking cash advance before her first week was over. I'm done hiring women I think, it's always something else and they could try to metoo me if they want. I actually gave this bitch 50 bucks advance too because I'm a fucking custie.",
        "created_utc": 1609627386,
        "id": "ghvdv4a",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1609656186.0
    },
    {
        "author": "Sayter",
        "body": "it wouldn't be a weekend thread without an escort update.",
        "created_utc": 1609541135,
        "id": "ghrohbn",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1609569935.0
    },
    {
        "author": "hoodedcactus",
        "body": "Don’t set unrealistic expectations, it will cause you psychological stress when you don’t meet them. \n\nIf you wanna jack off less, jack off less. Stay busy and don’t fixate.",
        "created_utc": 1609542808,
        "id": "ghrrhyt",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1609571608.0
    },
    {
        "author": "coldiron03",
        "body": "I honestly think we need to start cleaving people who talk about buying shares, Unless it's over the 10k requirement and can be proven with a positions or ban. This is WSB not r/investing. The amount of people talking about share plays is to damn high, and with this 600 stimulus we are going to get another wave of new members who wanna know where to drop there stimulus on stock plays. This is wsBETS, bets on options or high amounts in stock, not your personal advisor group saying to buy PLTR or GME. If someone posts outside the daily and they are hit with a positions or ban, it should be enforced",
        "created_utc": 1609556476,
        "id": "ghsg717",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1609585276.0
    },
    {
        "author": "_maxxwell_",
        "body": "So your DD is it's been going down for 3 months so it should go up now? Where da fuk are the mods at?",
        "created_utc": 1609530586,
        "id": "ghr3vzd",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1609559386.0
    },
    {
        "author": "donefukupped",
        "body": "It can go down 100%, but the upside potential is limitless!",
        "created_utc": 1609533016,
        "id": "ghr96xf",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1609561816.0
    },
    {
        "author": "iwanttogolfallday",
        "body": "Isn’t it ironic, don’t ya think?",
        "created_utc": 1609548315,
        "id": "ghs1dvo",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1609577115.0
    },
    {
        "author": "CoffeeQID",
        "body": "Soooo I'm an RN in a hospital in NY on a covid unit (you're welcome, you're welcome, proud to to do my service)\n\nand I fractured my nose on halloween surfing, piece of my nose was hanging off. Had to get 20 stitches at my ER.\n\nSooo I remembered I had this shit called \"accident insurance\", an employee benefit i signed up for, which covers accidents outside of work. It's like $50 for the year. I had a surfing \"accident\" so I filed a claim. Ended up getting 2 and a half grand for it. Open laceration itself paid out 2 grand.\n\nThen  I get a check in the mail for 3 grand from my insurance company to pay my ER bill.\n\nBut I work at the hospital so I don't get billed for that shit. It's all free cause I'm an employee.\n\nSo breaking my nose was one of the best things to happen to me.",
        "created_utc": 1609623070,
        "id": "ghv5kl2",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1609651870.0
    },
    {
        "author": "Monkeycash",
        "body": "Just weighted myself. \n\nLet’s put it this way....my body weight gapped up over the holidays, has strong support and not much resistance.",
        "created_utc": 1609628489,
        "id": "ghvfy8c",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1609657289.0
    },
    {
        "author": "FartSpeller",
        "body": "Leave this sub and go to r/investing. \nVery unpopular opinion I’m sure, but certainly the best advice you’ll get here.  Being a self-proclaimed investor with little to moderate knowledge of markets, you absolutely certainly should not be trading options, which is the vast majority of what you’ll see on this sub.  Buy mostly ETF’s and maybe 20% of your portfolio to buy shares of companies you feel particularly attracted to.  Continue to do that while you read and learn shit.  If you have to ask questions on Reddit about whatever you’re considering putting your money on, you aren’t ready to do it.  If you’re putting money on a move, you need to be the person answering questions about it.   That sounded so fucking good I’m going to copy and paste it so you can read it again. \n\nIf you have to ask questions on Reddit about whatever you’re considering putting your money on, you aren’t ready to do it.  If you’re putting money on a move, you need to be the person answering questions about it.",
        "created_utc": 1609527135,
        "id": "ghqul4x",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1609555935.0
    },
    {
        "author": "BinaryIdiot",
        "body": "I've worked with them. They're closer to an Oracle, traditional tech company than a new, shiny, grow fast tech company IMO.\n\nTheir product let's the military, police departments, etc ingest lots of data then work out the relationships between disparate pieces of data to create basically a playground for any folks in analytics. For example you might pull a phone off someone in Iraq at a checkpoint, upload the data, find it has the phone number in the contact list for another phone that was used in a bombing.\n\nStuff like that. It's very useful and the government has tried to replace it _multiple times_ but their attempts are usually not as good and then their funding gets cut after paying hundreds of millions to government contractors. I would know, I was one of those contractors a long time ago lol.\n\nIt's a solid company. I think it'll moderately grow. I don't think it'll explode-y grow, though, because it has already heavily saturated its target market. But that's just like my opinion or something.",
        "created_utc": 1609634307,
        "id": "ghvquay",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1609663107.0
    },
    {
        "author": "Mashlomech",
        "body": "Well to be fair you bought at the height and now would be a silly time to sell unless you have to. It will go back up.",
        "created_utc": 1609548887,
        "id": "ghs2dwo",
        "score": 15,
        "subreddit": "CanadianInvestor",
        "created": 1609577687.0
    },
    {
        "author": "aqjingson",
        "body": "I can’t even fathom how parabolic things would get if Buffett got on CNBC and said “I got it wrong, everyone should have a little intern3t koin in their portfolio, it’s better than gold”",
        "created_utc": 1609614641,
        "id": "ghup79i",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1609643441.0
    },
    {
        "author": "MattSurprise",
        "body": "That will be worth $150 in today's terms but yeah - let's do it!",
        "created_utc": 1609623522,
        "id": "ghv6fwb",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1609652322.0
    },
    {
        "author": "DarcieVince",
        "body": "My mortgage renewal is coming up, I have about 500k equity in the house. It is a no brainer to refinance an extra 100k at &lt; 2% rates to put into meme stocks right?",
        "created_utc": 1609616059,
        "id": "ghurxw4",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1609644859.0
    },
    {
        "author": "the_heat_waver",
        "body": "Yeah you are from Oregon, we get it.",
        "created_utc": 1609641858,
        "id": "ghw4bwp",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1609670658.0
    },
    {
        "author": "EP40BestInDaLee",
        "body": "Girl stopped talking to me because I told her she had the shoulder density of a Samoan.  It was supposed to be a compliment.",
        "created_utc": 1609620979,
        "id": "ghv1kih",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1609649779.0
    },
    {
        "author": "dwdsquared2",
        "body": "Everyone can thank me for the break from GME and PLTR. \n\nJust need u/ricehuman32 to text me back and everything is back to how it is.",
        "created_utc": 1609648361,
        "id": "ghwf26e",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1609677161.0
    },
    {
        "author": "bfairrob",
        "body": "The CCP is literally doing evil shit and we’re sitting here drinkin coffee joking about it lol. Fuck",
        "created_utc": 1609692701,
        "id": "ghyv6ro",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1609721501.0
    },
    {
        "author": "whistlerite",
        "body": "In the last decade that was true but historically in the long-run has not been true. Basing all your decisions about the next decade on the previous decade can be a bad idea. Fundamentally it doesn’t make sense that residential real estate outperforms all other types of businesses including real estate businesses, in the long-run the annual return of the TSX has outperformed real estate anywhere in Canada.",
        "created_utc": 1609538691,
        "id": "ghrjvie",
        "score": 14,
        "subreddit": "CanadianInvestor",
        "created": 1609567491.0
    },
    {
        "author": "GamblingMan420",
        "body": "Yah and it’s a really big mind fuck if you do that on a company you didn’t do enough research in and it ends up, and buckle up for this one, going bankrupt and wiping you out entirely. OP is a fucking idiot. Don’t ever go all in to one company.",
        "created_utc": 1609558223,
        "id": "ghsjae9",
        "score": 14,
        "subreddit": "investing",
        "created": 1609587023.0
    },
    {
        "author": "BullishCallBuyer",
        "body": "This will be another very bullish year\n\nJust FEEL it.",
        "created_utc": 1609553830,
        "id": "ghsb8yb",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1609582630.0
    },
    {
        "author": "tientutoi",
        "body": "I am a bot whose job is to track the $600 wsb stimulus spending.  Here are the latest stats:\n\n103 autists appear to have received the $600 stimulus payment.\n\n39 autists have asked for input on how to gamble it.\n\n21 autists have asked if they should buy PLTR or GME weeklys.\n\n4 autists are mad that it's not enough to buy 1 share of TSLA.\n\n1 autist said that he spent some of it raw dogging a hooker.",
        "created_utc": 1609643086,
        "id": "ghw6fk1",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1609671886.0
    },
    {
        "author": "SDOW-Investments",
        "body": "Too many people I know are in 🅱️rypto. It needs a good bubble popping",
        "created_utc": 1609622748,
        "id": "ghv4y9u",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1609651548.0
    },
    {
        "author": "ItzDaReaper",
        "body": "Man finally someone saying something actually intelligent. The amount of times I’ve been downvoted for saying shit like this. “Stonks only go up, retard. Fuck you gay bear. You’re an idiot look how much money we’re making.” \n\nIt’s hilarious because I saw this exact same bullshit in the lead up to 2008. Market confidence is at an all time high. I almost look forward to the inevitable bear market, but when it happens we all lose. I have a degree in Finance. It’s frustrating being called an idiot by a bunch of Reddit strangers that just learned about options a couple months ago. There are so many people here trading with such little knowledge of what they are doing. It’s kind of an interesting trend to see happening.",
        "created_utc": 1609626155,
        "id": "ghvbiyz",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1609654955.0
    },
    {
        "author": "27onfire",
        "body": "Last weekend this thread was hilarious.  This week it is full of broke virgins.  WTF is going on?",
        "created_utc": 1609555050,
        "id": "ghsdjkd",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1609583850.0
    },
    {
        "author": "TheRahulParmar",
        "body": "I volunteered for the Covid-19 vaccine from Pfizer. The vaccine is the one that has been developed in Russia. I received my first dose yesterday evening and I wanted to let you all know that it is totally safe and I’m ok, with иo side effects whatsoeveя, and that I feelshκι я чувю себя немного стрно и я думю, что вытл осные уши. чувству себя немго страо. Comrades.",
        "created_utc": 1609556817,
        "id": "ghsgt6e",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609585617.0
    },
    {
        "author": "couscous_nouvel",
        "body": "Not gonna happen. I wish it would though. sadly, it won't happen.",
        "created_utc": 1609548096,
        "id": "ghs103s",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609576896.0
    },
    {
        "author": "OverpricedBagel",
        "body": "🎶 It's like rain on your wedding day\nIt's a free ride when you've already paid\nIt's the good advice that you just didn't take\nAnd who would've thought, it figures 🎶",
        "created_utc": 1609548498,
        "id": "ghs1phh",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609577298.0
    },
    {
        "author": "dum_townerino",
        "body": "Man - it is so cringey watching videos of these YouTube kids talking about being “burnt out” from playing video games and making videos.\n\nThen I have to wake up and do some menial excel work every single day for 12 hours a day making a fraction of what they do",
        "created_utc": 1609621178,
        "id": "ghv1y8h",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609649978.0
    },
    {
        "author": "AutistNRetard",
        "body": "Already lost most of it with my PLTR $40c",
        "created_utc": 1609559093,
        "id": "ghsks5d",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609587893.0
    },
    {
        "author": "Obazda",
        "body": "Im going crazy. Can’t wait for the market to open again I need it",
        "created_utc": 1609628921,
        "id": "ghvgrao",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609657721.0
    },
    {
        "author": "Juanestrada97",
        "body": "Just buy it",
        "created_utc": 1609631731,
        "id": "ghvm18c",
        "score": 13,
        "subreddit": "stocks",
        "created": 1609660531.0
    },
    {
        "author": "dameMillardLaniac",
        "body": "Was having some trouble squeezing out the last bit of shit in my asshole and then had a violent sneeze that pulled it out. \n\nI guess there is someone up there looking after me after all.",
        "created_utc": 1609544701,
        "id": "ghrux8o",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609573501.0
    },
    {
        "author": "The_Hype_Mobile",
        "body": "I love buying calls on a company that is getting executively delisted, fucking love it, great start to 2021.",
        "created_utc": 1609548082,
        "id": "ghs0z6c",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609576882.0
    },
    {
        "author": "RADIO02118",
        "body": "What people that want to short TSLA or buy puts don’t realize is that for it to go down, bears will have to outnumber the TSLA bulls who are buying calls/stock in between banging the bear wives. I just don’t see a reality where that happens.",
        "created_utc": 1609634705,
        "id": "ghvrkdq",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609663505.0
    },
    {
        "author": "Space_Lord_MF",
        "body": "This has nothing to do with politics. Is there a bigger bitch in the world than Ted Cruz? Trump insulted Cruz and his father so much and instead of standing up to it Cruz basically blows Trump on a daily basis.  Like holy fuck dude, this dude said your dad killed jfk and shit and called you a pansy and all you do is suck up to him.\n\n\nThought Texans claim they were tough but this is who they chose to represent their state?",
        "created_utc": 1609622906,
        "id": "ghv5990",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609651706.0
    },
    {
        "author": "t33po",
        "body": "Found another extremely intriguing, but privately held company with 100x IPO potential. If any SPAC touches it, go all in. [Voltserver](https://voltserver.com/) does [digital electricity](https://www.graboyessmartbuildings.com/2020/01/digital-electricity-results-in-lower-first-costs-for-electrical-infrastructure-and-optimized-building-performance-through-poe-and-iot-d/) which is basically power over ethernet. Safe to touch by hand and very flexible installation and remodelling. With the expected beating CRE and retail will take, flexibility is gonna become top priority. Also, constuction can be done by dummies instead of certified$$$ electicians. Copper isn't gettin any cheaper either so costs might not be too crazy over time.\n\nSetting a Google alert for any news on this one. Any IPO or acquisition is gonna do bonkers numbers.",
        "created_utc": 1609558215,
        "id": "ghsj9wm",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1609587015.0
    },
    {
        "author": "Woodsy215",
        "body": "Pump n dump. It will be back to .004 by next week",
        "created_utc": 1609567030,
        "id": "ghsxkq6",
        "score": 12,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1609595830.0
    },
    {
        "author": "Schneebley",
        "body": "&gt;To everyone who got into trading stocks this year, I have a little hard truth for you: You're not actually that good at it. You just caught a wild bull market. Take some money off the table.\n\n&gt;- Chris Sacca\n\nThat's fucking GOLDEN coming from a guy who got rich by taking the same risks during the Dot Com era.",
        "created_utc": 1609623600,
        "id": "ghv6ld6",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1609652400.0
    },
    {
        "author": "1A9D6",
        "body": "DoorDash is such a ripoff. I can either pickup a sandwich for $8 or order through doordash and pay $18 to have it delivered to me. Wtf??\n\nNeedless to say, my cold ass is waiting outside the restaurant rn for the food to be ready 🤡🤡🤡",
        "created_utc": 1609564567,
        "id": "ghsu1hj",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1609593367.0
    },
    {
        "author": "shaitanthegreat",
        "body": "As a piece of advice, if you don’t have one already, make sure you’re also putting some away in a IRA.  From what I can guess, this $800 is a substantial portion of your income which makes investing more inherently risky, since you’re putting a lot of your money into something that can lose value quite easily. If it’s part of your retirement, it’s still important to protect your nest egg but at least you know going in that any of the ups and downs of the market won’t matter as much since you can’t take any of it out u til you’re 65+.",
        "created_utc": 1609542124,
        "id": "ghrq9vb",
        "score": 12,
        "subreddit": "stocks",
        "created": 1609570924.0
    },
    {
        "author": "JC7577",
        "body": "When I used to work in finance, my friend and I used to jump around and look into random boomer accounts on down days for fun. Lot of them were in the millions and held lot of typical boomer stocks/bonds but there was this one particular account that caught our eye because he only had two holdings with one being AMZN. He held  1200~ or some shares with like a $1~ average per cost. When we checked his history man legit opened the account a month or two before the IPO and bought 100 shares and diamond handed(or forgot??). I don't work there anymore but I always wonder on random days if the guy ever checked his account or is even alive. Probably will give it to his son with a step up rule if I was him",
        "created_utc": 1609531249,
        "id": "ghr5lmm",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1609560049.0
    },
    {
        "author": "Ry_ha",
        "body": "Yeah dude.. everyone needs baskets.. it literally can’t go tits up.",
        "created_utc": 1609539997,
        "id": "ghrmd1j",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1609568797.0
    },
    {
        "author": "AugustBurnsRed02",
        "body": "The money you are contributing to a Roth IRA is already taxed so he isn’t paying tax on upon contribution again. I know what you mean but you are stating it incorrectly.",
        "created_utc": 1609545085,
        "id": "ghrvlyc",
        "score": 12,
        "subreddit": "stocks",
        "created": 1609573885.0
    },
    {
        "author": "Oregon_Oregano",
        "body": "This is the type of comment that msnbc uses to profile this sub, and I like it",
        "created_utc": 1609543502,
        "id": "ghrsr59",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1609572302.0
    },
    {
        "author": "hershculez",
        "body": "I personally disagree with all 3.  That is perfectly fine though.  It is called personal finance because there is no universally correct way to manage your finances.",
        "created_utc": 1609549675,
        "id": "ghs3rce",
        "score": 12,
        "subreddit": "investing",
        "created": 1609578475.0
    },
    {
        "author": "uwwstudent",
        "body": "Technically its wrong. But putting 500 in the middle plus every tax is the way to go. If youre losing it, Gives you a hail mary instead of slowly bleeding to death. \nIf youre winning it allows quicker hoyses and hotels so you can hurry up and stop playing monopoly.",
        "created_utc": 1609564967,
        "id": "ghsun1s",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1609593767.0
    },
    {
        "author": "lamphibian",
        "body": "GUH. I remember FOMOing into shitcoins in 2017 and losing it all. Guess it's time to take that plunge again.",
        "created_utc": 1609613510,
        "id": "ghumzwh",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1609642310.0
    },
    {
        "author": "joeyarctic",
        "body": "Lol, I literally make $17 an hour. Its all about how you budget . I rent a shitty room for 200 dollars I ride the bus. Have been wearing the same clothes for the last couple years. Idk, I honestly don't make much , the 800 is a really big chunk, I'd rather invest it into ETF's rather than spend it on pot or food or a car payment",
        "created_utc": 1609542333,
        "id": "ghrqnig",
        "score": 11,
        "subreddit": "stocks",
        "created": 1609571133.0
    },
    {
        "author": "slowpokesardine",
        "body": "My dt condo lost 15 percent of its value since I bought it in 2019.",
        "created_utc": 1609541014,
        "id": "ghro97l",
        "score": 11,
        "subreddit": "CanadianInvestor",
        "created": 1609569814.0
    },
    {
        "author": "Sovereign_Mind",
        "body": "All of reddit seems certain that palantir will be a $1T company so I have avoided it like the plague. I tend to be bearish where reddit is bullish lol.\n\nI fuck with cloudflare though. Real potential.",
        "created_utc": 1609550868,
        "id": "ghs5vh2",
        "score": 11,
        "subreddit": "investing",
        "created": 1609579668.0
    },
    {
        "author": "Prestigious_Count_62",
        "body": "Does anyone remember when going out to eat at Pizza Hut was a big deal?\n\nI remember when I was a kid, it was real popular, the pizza would come out sizzling in a cast iron pan and the crust would be amazing, parents would get a pitcher of beer for them and a pitcher of coke for us kids.",
        "created_utc": 1609523100,
        "id": "ghqjlo0",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1609551900.0
    },
    {
        "author": "Googoogagababy",
        "body": "Whole Family in ICLN now.  If it goes tits up my reputation is ruined",
        "created_utc": 1609630470,
        "id": "ghvjnvj",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1609659270.0
    },
    {
        "author": "Ykana1",
        "body": "If you think about it, WSB is probably the world's most visited \"financial website\". The age of the BOOMER is over.",
        "created_utc": 1609630290,
        "id": "ghvjbrv",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1609659090.0
    },
    {
        "author": "SnooWalruses7854",
        "body": "I need more GME Confirmation bias posts. There simply isnt enough of it",
        "created_utc": 1609618403,
        "id": "ghuwho5",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1609647203.0
    },
    {
        "author": "Prestigious_Count_62",
        "body": "Remember when people would turn the other cheek for the sake of the group?\n\nSometimes, you gotta just let someone know you fucked up and you’re lucky you got friends and if you do it again you’re getting a real dicking. \n\nFree DWD!",
        "created_utc": 1609647931,
        "id": "ghwedco",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1609676731.0
    },
    {
        "author": "anono87",
        "body": "I will eat my own poop if Cathie buys GME. If Cathie says she will only buy if I eat my own poop, I would do it. Just a teaspoon.",
        "created_utc": 1609622013,
        "id": "ghv3jsj",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1609650813.0
    },
    {
        "author": "Bdubl77",
        "body": "5th row also says cum....so do I cum on the Tesla, In it, damn you bible.",
        "created_utc": 1609645621,
        "id": "ghwamlq",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1609674421.0
    },
    {
        "author": "LUV2FUKMARRIEDMILFS",
        "body": "Leave for a vacation u stupid fuck \n\nIf the environment is making u sick \n\nChange it \n\nGo to Tieland. Or phillypeans or singapoor and get self a escort to lick your ass and do all the sexual things u want \n\nWay good food and smoke weed!!!\n\nu have 500k good use it now \n\nOr let the  stress slowly give u heart disease and regret it later",
        "created_utc": 1609625135,
        "id": "ghv9kdt",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1609653935.0
    },
    {
        "author": "Whoa-there-jimmy",
        "body": "Scored 500 on a scratchy yesterday how do I turn it into 20k by Friday?",
        "created_utc": 1609535512,
        "id": "ghrdv3o",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1609564312.0
    },
    {
        "author": "01123581321AhFuckIt",
        "body": "Do SPACs count? Also isn't it absurd that you're limited in this fashion but members of congress are not. Ridiculous.",
        "created_utc": 1609560449,
        "id": "ghsn6r2",
        "score": 11,
        "subreddit": "investing",
        "created": 1609589249.0
    },
    {
        "author": "bd_one",
        "body": "Get your 2019 tax return via direct deposit.\n\nOtherwise, wait for a paper check.\n\nIf neither arrive but you are technically eligible, get it with your 2020 tax return.",
        "created_utc": 1609531821,
        "id": "ghr704e",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1609560621.0
    }
]