[
    {
        "author": "XanBeX",
        "body": "Yea it's just everyone keeps saying tdy is the day, tmr is the day which will obviously lead to disappointment. Keep expectations in check and the squeeze will happen while you have a stable mental state",
        "created_utc": 1614357102,
        "id": "gouet50",
        "score": 24,
        "subreddit": "Wallstreetbetsnew",
        "created": 1614385902.0
    },
    {
        "author": "DatBoi029",
        "body": "SNDL GOING TO 4.20 tdy COMINN",
        "created_utc": 1612993805,
        "id": "gmv7k9z",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1613022605.0
    },
    {
        "author": "g____Q",
        "body": "#bb radio asking Kathy wood ‘did you buy the dip tdy’\n#’ohhhhh yeaaassss.. we bot a lot of TSLA’\n\n😍🚀 it’s still on if you have access",
        "created_utc": 1614115809,
        "id": "goidixr",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1614144609.0
    },
    {
        "author": "kodakmaroon",
        "body": "IF WE END ON A MF 35% INCREASE TDY I WILL LITERALLY FILL MY JEANS WITH CUM",
        "created_utc": 1614198263,
        "id": "gomhs72",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614227063.0
    },
    {
        "author": "lohith15",
        "body": "Cathie Wood &amp; @ARKInvest trade activity from today 2/12\n\nBought: Roche $RHHBY Longview $LGVW Iridium $IRDM Nintendo $NTDOY Novartis $NVS $FATE Teledyne $TDY $KMTUY $ISRG Lockheed $LMT\n\nSold: Organovo  Materialise $MTLS Virgin Galactic $SPCE",
        "created_utc": 1613175028,
        "id": "gn4agne",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613203828.0
    },
    {
        "author": "oldredditdidntsuck",
        "body": "Why is she selling SPCE? is it to buy it in a space etf?\n\n**Latest Trades:**\n\n**Fund\tDate\tDirection\tTicker\tCUSIP\tCompany\tShares\t% of ETF**\n\n* 1\tARKG\t02/12/2021\tBuy\tRHHBY\tROCHE HOLDING AG\t132,909\t0.0454\n* 2\tARKG\t02/12/2021\tBuy\tLGVW\tLONGVIEW ACQUISITION CORP\t10,037\t0.0018\n* 3\tARKK\t02/12/2021\tBuy\tIRDM\tIRIDIUM COMMUNICATIONS INC\t327,629\t0.0557\n* 4\tARKK\t02/12/2021\tBuy\tNTDOY\tNINTENDO CO LTD\t49,837\t0.0142\n* 5\tARKK\t02/12/2021\tBuy\tNVS\t\tNOVARTIS AG\t155,469\t0.0512\n* 6\tARKK\t02/12/2021\tBuy\tFATE\t\tFATE THERAPEUTICS INC\t34,300\t0.0125\n* 7\tARKK\t02/12/2021\tSell\tWSB Bannned stock\n* 8\tARKK\t02/12/2021\tSell\tMTLS\tMATERIALISE NV\t15,003\t0.0041\n* 9\tARKQ\t02/12/2021\tBuy\tTDY\t\tTELEDYNE TECHNOLOGIES INC\t40,470\t0.3899\n* 10\tARKQ\t02/12/2021\tBuy\tKMTUY\tKOMATSU LTD\t20,000\t0.0151\n* 11\tARKQ\t02/12/2021\tBuy\tISRG\t\tINTUITIVE SURGICAL INC\t20,872\t0.4174\n* 12\tARKQ\t02/12/2021\tBuy\tLMT\t\tLOCKHEED MARTIN CORP\t39,456\t0.3311\n* 13\tARKQ\t02/12/2021\tSell\tSPCE\t\tVIRGIN GALACTIC HOLDINGS INC\t255,600\t0.3487\n\nedit repost question after format and removal of WSB banned stock.",
        "created_utc": 1613175857,
        "id": "gn4bznw",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1613204657.0
    },
    {
        "author": "Ayoooooahah",
        "body": "Lots of ppl bought the stock at the top tdy and r pretty much begging wsb to switch but fuck that we have smtg going on never fomo",
        "created_utc": 1613006909,
        "id": "gmvyvfu",
        "score": 3,
        "subreddit": "Wallstreetbetsnew",
        "created": 1613035709.0
    },
    {
        "author": "kodakmaroon",
        "body": "y’all know if the new finra report is supposed tdy?",
        "created_utc": 1614197130,
        "id": "gomf47d",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614225930.0
    },
    {
        "author": "g____Q",
        "body": "Jpow and Kathy literally bailed my acct tdy 🤡",
        "created_utc": 1614116312,
        "id": "goienq3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614145112.0
    },
    {
        "author": "Stellar-Realm",
        "body": "I don't believe that to be correct. I had a TS SCI clearance while serving in the Army. Did my AIT at Fort Devens Ma. Served in Field Station Augsburg in Germany and Field Station San Vito in Italy. TDY at San Vito Air Station. In my interviews there was no mention that I couldn't hold any market positions. Yes marijuana  is still against federal law but it's not against the law to hold market positions . I was a 98 Delta Military intelligence . We did however have to turn over all financial accounts. That's because they would monitor them for unusual deposits or withdrawals that are not normal for your pay grade. If had unusual funds in your account they would automatically do an investigation to make sure you are not being pay off by a hostile government.",
        "created_utc": 1613083302,
        "id": "gmzsbqx",
        "score": 2,
        "subreddit": "options",
        "created": 1613112102.0
    },
    {
        "author": "MinntyFr3sh",
        "body": "Sndl is tied up with all that short stuff. The only cannabis stock that didn't move up tdy. Just take caution.",
        "created_utc": 1612300900,
        "id": "gls7es8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612329700.0
    },
    {
        "author": "fuckYEWshoresy",
        "body": "LMT. Teledyne recently bought FLIR as well. Grumman, BAE systems, Leidos, L3Harris",
        "created_utc": 1614079652,
        "id": "gog7bln",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1614108452.0
    },
    {
        "author": "SoyFuturesTrader",
        "body": "Yeah I know I was TDY in Europe for a bit, but the contractors I had in Africa or LATAM doing the same work got paid almost double \n\nI think the best contracting spot is Colombia. High pay, FEIE, and everything’s cheap as shit. Oh and Colombian women.",
        "created_utc": 1614185043,
        "id": "golkauv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614213843.0
    },
    {
        "author": "Estri_Grobbulus",
        "body": "Appreciate the note! It is hard to find an ETF for the defense sector that I think is reasonable. How can you be 3x Boeing to LMT and equal weight NOC and TDY and tell me you're a legitimate defense fund lol",
        "created_utc": 1612281679,
        "id": "glqteg8",
        "score": 1,
        "subreddit": "investing",
        "created": 1612310479.0
    },
    {
        "author": "BlackyChan0901",
        "body": "that and zom were my first 2 buys i just started tdy you think its a pump and dump or sit on it for awhile?",
        "created_utc": 1613091507,
        "id": "gn08svi",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1613120307.0
    },
    {
        "author": "Subject_While_4940",
        "body": "held $GME and all other stocks in portfolio managed to +3.89% tdy G/L",
        "created_utc": 1614318610,
        "id": "gosub4j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614347410.0
    },
    {
        "author": "wiifan55",
        "body": "The restricted access is a result of liquidity issues by the app brokers, not pressure from the hedge funds. I mean, sure there's no real way to disprove the latter isn't at play too. But liquidity offers a perfectly logical explanation for the restricted access. It's like the old saying goes: if you hear hooves when in North America, think horse, not zebra.",
        "created_utc": 1612206114,
        "id": "glmut21",
        "score": 22,
        "subreddit": "stocks",
        "created": 1612234914.0
    },
    {
        "author": "KafkasVapePen",
        "body": "&gt; It's like the old saying goes: if you hear hooves when in North America, think horse, not zebra.\n\nNever heard this before but I like it as much as WSB likes GME. I'm adding it to my repertoire.",
        "created_utc": 1612209531,
        "id": "gln3llj",
        "score": 4,
        "subreddit": "stocks",
        "created": 1612238331.0
    },
    {
        "author": "jleek21",
        "body": "I did ok. I made about 12% in about three weeks using a CC ZEBRA with CVS last year. I haven’t traded CVS since then.",
        "created_utc": 1612220452,
        "id": "glnuze9",
        "score": 1,
        "subreddit": "options",
        "created": 1612249252.0
    },
    {
        "author": "wiifan55",
        "body": "The restricted access is a result of liquidity issues by the app brokers, not pressure from the hedge funds. I mean, sure there's no real way to disprove the latter isn't at play too. But liquidity offers a perfectly logical explanation for the restricted access. It's like the old saying goes: if you hear hooves when in North America, think horse, not zebra.",
        "created_utc": 1612206114,
        "id": "glmut21",
        "score": 22,
        "subreddit": "stocks",
        "created": 1612234914.0
    },
    {
        "author": "KafkasVapePen",
        "body": "&gt; It's like the old saying goes: if you hear hooves when in North America, think horse, not zebra.\n\nNever heard this before but I like it as much as WSB likes GME. I'm adding it to my repertoire.",
        "created_utc": 1612209531,
        "id": "gln3llj",
        "score": 4,
        "subreddit": "stocks",
        "created": 1612238331.0
    },
    {
        "author": "fin425",
        "body": "If you’re a new member and experiencing heavily losses, you have 2 choices     \n1) quit and say goodbye to WSB     \n2) embrace your newly minted zebra stripes and let the mods knight you with a dildo blessing as you’re now one of us    \n  \nThis is the way",
        "created_utc": 1613701225,
        "id": "gnymg2v",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1613730025.0
    },
    {
        "author": "wiifan55",
        "body": "The restricted access is a result of liquidity issues by the app brokers, not pressure from the hedge funds. I mean, sure there's no real way to disprove the latter isn't at play too. But liquidity offers a perfectly logical explanation for the restricted access. It's like the old saying goes: if you hear hooves when in North America, think horse, not zebra.",
        "created_utc": 1612206114,
        "id": "glmut21",
        "score": 22,
        "subreddit": "stocks",
        "created": 1612234914.0
    },
    {
        "author": "giantwashcapsfan8",
        "body": "GME down to 2 zebra pelts in the Zimbabwe exchange... get out while you still can!!!!!",
        "created_utc": 1612332119,
        "id": "gltzbp9",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1612360919.0
    },
    {
        "author": "jmensa2",
        "body": "anyone else think zebra cakes are the shit?",
        "created_utc": 1612813176,
        "id": "gmm5fia",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1612841976.0
    },
    {
        "author": "BrunoRib",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.  \n\n\nEdit: i am not a sexual or  financial expert..Sue Christian Fucking Iovin if you lose money",
        "created_utc": 1613755616,
        "id": "go0z28l",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613784416.0
    },
    {
        "author": "acididica",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613753557,
        "id": "go0uein",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1613782357.0
    },
    {
        "author": "KafkasVapePen",
        "body": "&gt; It's like the old saying goes: if you hear hooves when in North America, think horse, not zebra.\n\nNever heard this before but I like it as much as WSB likes GME. I'm adding it to my repertoire.",
        "created_utc": 1612209531,
        "id": "gln3llj",
        "score": 4,
        "subreddit": "stocks",
        "created": 1612238331.0
    },
    {
        "author": "nvrsmr1",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613752905,
        "id": "go0swu9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613781705.0
    },
    {
        "author": "NuclearReactions",
        "body": "I also like MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613753291,
        "id": "go0tsl7",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613782091.0
    },
    {
        "author": "NowLickIt",
        "body": "I'm a big fan of these stocks for no other reason than the letters look good together\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613753061,
        "id": "go0t9jn",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613781861.0
    },
    {
        "author": "DroneCone",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613753360,
        "id": "go0tyaj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613782160.0
    },
    {
        "author": "realbeats",
        "body": "I like, AEW, WCW, NWA, NWO, ECW, WWE, WWF, BWO, NJPW, NGW, WOW, LOL and FTW but Im also fond of\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613755165,
        "id": "go0y1b3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613783965.0
    },
    {
        "author": "Proper-Sheepherder-8",
        "body": "If you can believe it, these stocks will moon hard:\n\n&amp;#x200B;\n\n stocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613755268,
        "id": "go0y9qj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613784068.0
    },
    {
        "author": "RyanHatesReddit",
        "body": " Check out the stonks I like. \n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nI am not a financial advisor nor am I giving any financial advice. I simply like these stocks.",
        "created_utc": 1613754151,
        "id": "go0vr4d",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613782951.0
    },
    {
        "author": "Crapaud1988",
        "body": "I like the stock very much!\n\nHere are some great stocks i like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS\n\n💎💎🙌🙌 🚀🚀",
        "created_utc": 1613755300,
        "id": "go0ycdh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613784100.0
    },
    {
        "author": "Kac985",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613751459,
        "id": "go0pkyk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613780259.0
    },
    {
        "author": "Kac985",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613751444,
        "id": "go0pjnb",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613780244.0
    },
    {
        "author": "RobbedByALadyBoy",
        "body": "I’ve yolo’d my kids college fund into these stocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613753973,
        "id": "go0vcru",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613782773.0
    },
    {
        "author": "Mezzoski",
        "body": "I fully support you in yor sentiment for:  \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM,  ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO,  AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH,  ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET,  AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX,  BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR,  BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE,  CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI,  XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA,  CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI,  CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS,  DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC,  EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS,  EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX,  FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA,  FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS,  GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE,  HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO,  ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ,  IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY,  KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS,  LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO,  MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET,  MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI,  MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE,  NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY,  OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT,  PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR,  PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O,  REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC,  SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX,  STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL,  FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR,  ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO,  VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA,  DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN,  XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754187,
        "id": "go0vtvs",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613782987.0
    },
    {
        "author": "g3neraL5",
        "body": "stocks I like - for the hedge funds buying tech to track this\n🚀 🚀 🚀 \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613753989,
        "id": "go0ve31",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613782789.0
    },
    {
        "author": "Aegis617",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613755229,
        "id": "go0y6i2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613784029.0
    },
    {
        "author": "Niklas_Avid",
        "body": " stocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613755388,
        "id": "go0yjkz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613784188.0
    },
    {
        "author": "cousineddie42",
        "body": "I’ve been stock piling GME like it’s buy one get one on the little Debbie zebra cakes. But, I’m retarded in a few ways, so there’s that",
        "created_utc": 1613709444,
        "id": "gnz1eey",
        "score": 2,
        "subreddit": "Wallstreetbetsnew",
        "created": 1613738244.0
    },
    {
        "author": "Kac985",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613751468,
        "id": "go0plpi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613780268.0
    },
    {
        "author": "SickenedVendetta",
        "body": "Let the record show, these are my official positions:\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS\n\nTo the moon!",
        "created_utc": 1613754976,
        "id": "go0xly8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613783776.0
    },
    {
        "author": "you_gain_a_life",
        "body": "THATS NUTS! I also happen to like the stocks MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS! too much in common!",
        "created_utc": 1613755038,
        "id": "go0xqym",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613783838.0
    },
    {
        "author": "bakebakingbaked",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754781,
        "id": "go0x61w",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613783581.0
    },
    {
        "author": "BigYoda69",
        "body": "I too like the following stocks \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754799,
        "id": "go0x7hh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613783599.0
    },
    {
        "author": "Daxty",
        "body": " \n\ncopy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754742,
        "id": "go0x2qp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613783542.0
    },
    {
        "author": "BigDerbsBiggerStonks",
        "body": "Stripe 🚀🚀🚀\n\nZebra gang 🦓🦓🦓",
        "created_utc": 1613187646,
        "id": "gn4x1t7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613216446.0
    },
    {
        "author": "archadeus",
        "body": "ZBRA CALLS #420BLAZEIT",
        "created_utc": 1612835455,
        "id": "gmnfm95",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612864255.0
    },
    {
        "author": "luptonite",
        "body": "I too like these specific stocks\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613753650,
        "id": "go0um6q",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613782450.0
    },
    {
        "author": "onarpos",
        "body": "I like: \n\n \n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613755732,
        "id": "go0zbqb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613784532.0
    },
    {
        "author": "rediKELous",
        "body": "MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS \n\n$FUCK $YOU",
        "created_utc": 1613757118,
        "id": "go12hb7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613785918.0
    },
    {
        "author": "jleek21",
        "body": "I did ok. I made about 12% in about three weeks using a CC ZEBRA with CVS last year. I haven’t traded CVS since then.",
        "created_utc": 1612220452,
        "id": "glnuze9",
        "score": 1,
        "subreddit": "options",
        "created": 1612249252.0
    },
    {
        "author": "Nareeng",
        "body": "&gt; zebra cakes\n\nI haven't had one of those puppies in forever, but I remember them being good",
        "created_utc": 1612813221,
        "id": "gmm5j7o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612842021.0
    },
    {
        "author": "BigDerbsBiggerStonks",
        "body": "Zebra gang is going to rise so hard once Stripe deal is signed 📝 and announced 📣\n\n🦓🦓🦓🚀🚀🚀",
        "created_utc": 1612851893,
        "id": "gmo7i1y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612880693.0
    },
    {
        "author": "talltime",
        "body": "Can also do ZEBRA",
        "created_utc": 1612837373,
        "id": "gmnjamq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612866173.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 10th of February\n\n\n\n## Upcoming events for Wednesday, February 10th\n\n - Expected earnings:\n\n  ACLS, AEIS, AEMD, AIN, AIRC, AKR, ARCC, ARI, ASC, ASGN, ATOM, ATUS, AVLR, AZRE, BBGI, BDC, BDR, BE, BG, BHF, BLBD, BXMT, CARV, CCJ, CDW, CERN, CHEF, CIM, CINF, CLPT, CME, COHR, CPA, CPAC, CRSP, CRTO, CRWS, CTRE, CX, CXW, DBD, DCP, EDRY, EEFT, EFX, EGAN, ELY, ENS, EQC, EQIX, EQR, EXEL, FET, FLDM, FLOW, FMAO, FR, FTHM, FTSI, FUNC, GEO, GFI, GM, GOCO, GOOD, HCSG, HGEN, HOFV, HR, IFF, INMD, IO, IPG, IQV, IRBT, IRT, ISSC, IVC, JRSH, KAI, KALA, KERN, KGC, KMDA, KNL, KO, LUMN, MC, MCFT, MCHX, MFC, MGM, MHH, MOH, MXC, NGVT, NHTC, NLY, NMCI, NTB, NVST, OCN, OM, ONCR, ORLY, PACB, PAG, PAYC, PDM, PDS, PGRE, PI, PS, PTVE, PVG, PW, PYPD, QLYS, QUOT, RADA, RDFN, RDWR, REXR, RM, RNWK, RPTX, RUSHA, RUSHB, RWT, SAVE, SCKT, SLF, SONO, SSNC, STAG, STC, SUZ, TEVA, TLND, TMHC, TPB, TR, TRMB, TRUP, TTGT, TYL, UA, UAA, UBER, VCTR, VERU, VNDA, VRM, WH, WHG, WTS, WU, XPO, Z, ZG, ZNGA\n\n - Ex-div:\n\n  ACV, AIO, ARCB, CATC, CBH, CZWI, DBL, DCI, DLY, DSL, EFL, EHT, EVF, FSBW, GDV, GNT, GUT, HPF, HPI, HPS, HTD, IBTX, IVH, MATX, MRBK, NCV, NCZ, OFED, OPBK, OPP, PCI, PCK, PCN, PCQ, PDI, PFN, PGC, PGP, PGZ, PKO, PMF, PML, PMX, PNF, PNI, PTY, PVBC, PYN, PZC, RFM, RIV, RMD, RMI, RMM, RSF, STBA, TBNK, TJX, VGI, VLO, WRK, WSFS, WTFC, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 1.164%)\n    - CPI (consensus: 0.3%, previous: 0.4%)\n    - CPI (consensus: 1.5%, previous: 1.4%)\n    - CPI Index, n.s.a. (consensus: 261.79, previous: 260.47)\n    - CPI Index, s.a (previous: 261.56)\n    - CPI, n.s.a (previous: 0.09%)\n    - Cleveland CPI (previous: 0.1%)\n    - Core CPI (consensus: 0.2%, previous: 0.1%)\n    - Core CPI (consensus: 1.5%, previous: 1.6%)\n    - Core CPI Index (previous: 269.94)\n    - Crude Oil Imports (previous: 1.315M)\n    - Crude Oil Inventories (consensus: 0.985M, previous: -0.994M)\n    - Cushing Crude Oil Inventories (previous: -1.517M)\n    - Distillate Fuel Production (previous: 0.104M)\n    - EIA Refinery Crude Runs  (previous: -0.080M)\n    - EIA Weekly Distillates Stocks (consensus: -0.790M, previous: -0.009M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.1%, previous: 0.6%)\n    - Fed Chair Powell Speaks\n    - Federal Budget Balance (consensus: -150.0B, previous: -144.0B)\n    - Gasoline Inventories (consensus: 1.814M, previous: 4.466M)\n    - Gasoline Production (previous: -0.253M)\n    - Heating Oil Stockpiles (previous: 0.545M)\n    - MBA 30-Year Mortgage Rate (previous: 2.92%)\n    - MBA Mortgage Applications (previous: 8.1%)\n    - MBA Purchase Index (previous: 334.6)\n    - Mortgage Market Index (previous: 981.1)\n    - Mortgage Refinance Index (previous: 4,746.2)\n    - Real Earnings (previous: 0.1%)\n    - Thomson Reuters IPSOS PCSI (previous: 50.87)\n    - US Federal Budget (previous: -430.0)\n    - Wholesale Inventories (consensus: 0.1%, previous: 0.0%)\n    - Wholesale Trade Sales (consensus: 0.5%, previous: 0.2%)\n\n## Upcoming events for Thursday, February 11th\n\n - Expected earnings:\n\n  AB, ACB, ACOR, ADCT, AEG, AEM, AEY, AFIB, AFRM, AGIO, AGTC, AHH, AIRT, AIV, AKUS, ALKS, ALNY, ALXO, ALYA, AMK, AMTI, AMWL, APDN, ARES, ARNC, ARRY, ASTC, ASYS, ATHA, AUY, AVXL, AYTU, AZEK, AZN, BAM, BCO, BCOW, BCS, BIO, BIO.B, BIOX, BJRI, BL, BLI, BLIN, BPMC, BRG, BRT, BRX, BSGM, BWA, BXRX, CARG, CBMB, CC, CCCC, CCEP, CGNX, CIGI, CIXX, COHU, COWN, CRC, CRY, CS, CSPI, CTT, CURI, CUZ, CVV, CYBR, CZNC, DCO, DDOG, DIS, DLR, DUK, DVA, DXCM, DYN, DYNT, ECOM, EDSA, EGOV, EIGI, EPIX, EQNR, ESP, EVLO, EXPE, FAF, FLO, FLUX, FMTX, FNF, FORR, FOUR, FROG, FRT, FWRD, GAU, GDDY, GDRX, GHSI, GLOG, GLOP, GNCA, GNRC, GP, GRAY, HII, HRMY, HUBS, HYLN, ICL, IFS, ILMN, IMRA, INDT, ING, INM, INS, INUV, INZY, IRDM, ITOS, JCOM, JOB, K, KBNT, KHC, KIM, KPTI, KRG, KTRA, KYMR, LH, LIVX, LLNW, LTRN, LTRX, MAC, MDNA, MEG, MHK, MLVF, MRC, MT, MTA, MTCR, MTRN, MYGN, MYOV, MYSZ, NARI, NEPT, NET, NEXA, NGD, NICE, NKSH, NKTX, NNA, NNN, NR, NSIT, NSP, NUS, NWE, NWHM, NYC, OESX, OFED, OFLX, OMAB, ORAN, ORIC, OTIC, PATK, PBF, PBFX, PBLA, PCVX, PEP, PINE, POOL, PPC, PRTA, PSTX, PXLW, PZG, QSR, R, RARE, RCEL, REG, RELX, RSSS, RVMD, SAFE, SAND, SANW, SCPE, SCU, SDGR, SFT, SGEN, SHIP, SHO, SON, SPSC, SQFT, SRTS, SSTK, SSY, STLA, STON, SVMK, TAP, TAP.A, TARA, TEX, THRY, THS, TIG, TIGO, TM, TMBR, TMQ, TOMZ, TPL, TPX, TRNO, TRT, TSHA, TSN, TU, TWOU, UFS, UROV, VCRA, VECO, VIRT, VNT, VRSN, VRTU, VTGN, VVI, WLL, WRE, WSO, WSO.B, YETI, ZBRA\n\n - Ex-div:\n\n  ABC, ADS, ADX, AFT, AHC, AIF, AIRC, AMGN, AMP, APAM, AUB, AVK, BAH, BFST, BKH, BOKF, BPRN, BRKL, BSET, BWFG, CCD, CGO, CHI, CHW, CNOB, COP, CORR, CPZ, CSQ, CTAS, CVCY, DUK, DYFN, EBMT, EBR, EBR.B, ECC, EDF, EDI, EIC, EMR, ENB, EQNR, ETR, EVA, FCCY, FCFS, FINS, FMO, FNWB, FRBA, GBAB, GCBC, GGM, GHY, GOF, GRC, GSBD, GWB, HP, HTBK, HTH, HTLF, HWKN, IHIT, ISD, JBL, JCO, JEF, JEMD, JFR, JGH, JHAA, JHB, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KR, LEO, LLY, LNN, LSTR, MMM, MMS, MOG.A, MOG.B, MSBI, MSEX, NAC, NAD, NAN, NBB, NCB, NDMO, NETI, NEV, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NP, NPN, NRK, NRT, NSL, NUV, NUW, NVG, NXJ, NXR, NXST, NYV, NZF, OBNK, OCSI, ODC, OPY, OSK, OTIS, OTTR, OXLC, OXSQ, PBI, PCSB, PEO, PFC, PFLT, PFS, PFSI, PKOH, PSMT, PSTL, PTVE, PZN, SAL, SBFG, SBRA, SCHW, SDHY, SGC, SHBI, SIGI, SJM, SMBC, SMBK, SONA, SOR, SSB, SSBI, TAIT, TCF, TECH, TFC, TSBK, UTL, V, VBF, VTA, VVR, WAB, WEC, WTRG, YUM\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.825%)\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.065%)\n    - Continuing Jobless Claims (consensus: 4,490K, previous: 4,592K)\n    - Fed Monetary Policy Report\n    - IEA Monthly Report\n    - Initial Jobless Claims (consensus: 757K, previous: 779K)\n    - Jobless Claims 4-Week Avg. (previous: 848.25K)\n    - Natural Gas Storage (consensus: -192B, previous: -192B)\n    - OPEC Monthly Report\n    - OPEC Monthly Report\n\n## Upcoming events for Friday, February 12th\n\n - Stock splits:\n\n    - FNGU @ **10:1** (Payable date: 02/11/2021)\n    - FNGS @ **4:1** (Payable date: 02/11/2021)\n\n - Expected earnings:\n\n  ABR, ACST, AHPI, AIHS, AIM, AIMC, ALJJ, ALUS, ATLC, ATLO, AXL, AYRO, BH.A, BHAT, BLX, CAE, CALT, CCNC, CEI, CGA, CJJD, CMPI, CNNB, D, DJCO, ENB, EXN, FE, FENC, FGBI, FORD, FRD, FSEA, FSTX, FTS, GENC, HGSH, HMG, HUN, HUSA, IBIO, IFMK, IMGN, IMVT, INBX, IPDN, LECO, MCO, MSN, NBAC, NBLX, NHLD, NNVC, NWG, NWL, OLB, OTLK, PBFS, PLAG, PMVP, PNBK, PPSI, PRLB, PRPO, RGCO, SCX, SNOA, STTK, SXT, TUFN, TYHT, VSTA, WPC\n\n - Ex-div:\n\n  AGCO, AIT, ALE, ARR, AWR, BAF, BBF, BBK, BBN, BCAT, BCX, BDJ, BFK, BFY, BFZ, BG, BGIO, BGR, BGT, BGY, BHK, BHV, BIT, BLE, BLW, BME, BMEZ, BNY, BOE, BSD, BSE, BSM, BST, BSTZ, BTA, BTT, BTZ, BUI, BYM, BZM, CABO, CBFV, CF, CG, CHD, CII, CURO, DLX, DRE, EGF, FRA, FTS, GIM, HIW, HYT, IVZ, JRSH, KMPR, MCA, MEN, MHD, MMD, MNR, MUE, MUI, MUR, MUS, PRU, R, ROK, SBR, SIMO, SMP, SO, SRV, STK, SWKS, SWX, SZC, TEI, UI, UMH, UMPQ, VCIF, WMK, XEC\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.1K)\n    - CFTC Copper speculative net positions (previous: 66.3K)\n    - CFTC Corn speculative net positions (previous: 528.5K)\n    - CFTC Crude Oil speculative net positions (previous: 499.2K)\n    - CFTC Gold speculative net positions (previous: 257.1K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 29.1K)\n    - CFTC Natural Gas speculative net positions (previous: 29.6K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -34.9K)\n    - CFTC Silver speculative net positions (previous: 51.4K)\n    - CFTC Soybeans speculative net positions (previous: 242.2K)\n    - CFTC Wheat speculative net positions (previous: 32.8K)\n    - Michigan 5-Year Inflation Expectations (previous: 2.70%)\n    - Michigan Consumer Expectations (consensus: 75.7, previous: 74.0)\n    - Michigan Consumer Sentiment (consensus: 80.8, previous: 79.0)\n    - Michigan Current Conditions (consensus: 88.0, previous: 86.7)\n    - Michigan Inflation Expectations (previous: 3.0%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 295)\n    - U.S. Baker Hughes Total Rig Count (previous: 384)\n\n^^^^2021-02-10",
        "created_utc": 1612954833,
        "id": "gmsz3vm",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1612983633.0
    },
    {
        "author": "alee065",
        "body": "Zebra",
        "created_utc": 1613189881,
        "id": "gn50rwq",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1613218681.0
    },
    {
        "author": "AugustBelvedere",
        "body": "I like f1cken, turnip and zebra\n\nglideoutside blows literal goats, dude does no meaningful dd, brags endlessly and have seen him encourage his followers to attack other commenters who fairly criticise him\n\nthere are forces for good here who want to spread knowledge and wealth and then there is him, who is a pretty trash human being",
        "created_utc": 1613251173,
        "id": "gnakh5y",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1613279973.0
    },
    {
        "author": "MonkeyBrawler",
        "body": "Here are some great stocks i like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754443,
        "id": "go0wef8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613783243.0
    },
    {
        "author": "CooldudeXD",
        "body": " \n\nI copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613754573,
        "id": "go0wp1x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613783373.0
    },
    {
        "author": "bobgrey",
        "body": "That's funny OP because I also like these stocks.\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM,  ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO,  AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH,  ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET,  AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX,  BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR,  BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE,  CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI,  XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA,  CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI,  CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS,  DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC,  EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS,  EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX,  FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA,  FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS,  GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE,  HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO,  ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ,  IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY,  KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS,  LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO,  MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET,  MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI,  MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE,  NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY,  OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT,  PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR,  PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O,  REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC,  SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX,  STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL,  FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR,  ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO,  VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA,  DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN,  XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613755510,
        "id": "go0ytgr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613784310.0
    },
    {
        "author": "OneMoreHappyDay",
        "body": " MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM,  ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO,  AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH,  ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET,  AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX,  BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR,  BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE,  CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI,  XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA,  CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI,  CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS,  DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC,  EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS,  EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX,  FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA,  FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS,  GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE,  HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO,  ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ,  IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY,  KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS,  LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO,  MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET,  MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI,  MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE,  NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY,  OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT,  PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR,  PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O,  REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC,  SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX,  STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL,  FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR,  ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO,  VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA,  DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN,  XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613755580,
        "id": "go0yz6r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613784380.0
    },
    {
        "author": "Youlooknicetonight",
        "body": "Stonks only go up. \n\nI too like these specific stocks\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613756624,
        "id": "go11ccv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613785424.0
    },
    {
        "author": "endgame1129",
        "body": "These are definitely stocks\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613756300,
        "id": "go10lsi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613785100.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the 11th of February\n\n\n\n## Upcoming events for Thursday, February 11th\n\n - Expected earnings:\n\n  AB, ACB, ACOR, ADCT, AEG, AEM, AEY, AFIB, AFRM, AGIO, AGTC, AHH, AIRT, AIV, AKUS, ALKS, ALNY, ALXO, ALYA, AMK, AMTI, AMWL, APDN, ARES, ARNC, ARRY, ASTC, ASYS, ATHA, AUY, AVXL, AYTU, AZEK, AZN, BAM, BCO, BCOW, BCS, BIO, BIO.B, BIOX, BJRI, BL, BLI, BLIN, BPMC, BRG, BRT, BRX, BSGM, BWA, BXRX, CARG, CBMB, CC, CCCC, CCEP, CGNX, CIGI, CIXX, COHU, COWN, CRC, CRY, CS, CSPI, CTT, CURI, CUZ, CVV, CYBR, CZNC, DCO, DDOG, DIS, DLR, DUK, DVA, DXCM, DYN, DYNT, ECOM, EDSA, EGOV, EIGI, EPIX, EQNR, ESP, EVLO, EXPE, FAF, FLO, FLUX, FMTX, FNF, FORR, FOUR, FROG, FRT, FWRD, GAU, GDDY, GDRX, GHSI, GLOG, GLOP, GNCA, GNRC, GP, GRAY, HII, HRMY, HUBS, HYLN, ICL, IFS, ILMN, IMRA, INDT, ING, INM, INS, INUV, INZY, IRDM, ITOS, JCOM, JOB, K, KBNT, KHC, KIM, KPTI, KRG, KTRA, KYMR, LH, LIVX, LLNW, LTRN, LTRX, MAC, MDNA, MEG, MHK, MLVF, MRC, MT, MTA, MTCR, MYGN, MYOV, MYSZ, NARI, NET, NEXA, NGD, NICE, NKSH, NKTX, NNA, NNN, NR, NSIT, NSP, NUS, NWE, NWHM, NYC, OESX, OFED, OFLX, OMAB, ORAN, ORIC, OTIC, PATK, PBF, PBFX, PBLA, PCVX, PEP, PINE, POOL, PPC, PRTA, PSTX, PXLW, QSR, R, RARE, RCEL, REG, RELX, RSSS, RVMD, SAFE, SAND, SANW, SCPE, SCU, SDGR, SFT, SGEN, SHIP, SHO, SON, SPSC, SQFT, SRTS, SSTK, SSY, STLA, STON, SVMK, TAP, TAP.A, TARA, TEX, THRY, THS, TIG, TIGO, TM, TMBR, TMQ, TOMZ, TPL, TPX, TRNO, TRT, TSHA, TSN, TU, TWOU, UFS, UROV, VCRA, VECO, VIRT, VNT, VRSN, VRTU, VTGN, VVI, WLL, WRE, WSO, WSO.B, YETI, ZBRA\n\n - Ex-div:\n\n  ABC, ADS, ADX, AFT, AHC, AIF, AIRC, AMGN, AMP, APAM, AUB, AVK, BAH, BFST, BKH, BOKF, BPRN, BRKL, BSET, BWFG, CCD, CGO, CHI, CHW, CNOB, COP, CORR, CPZ, CSQ, CTAS, CVCY, DUK, DYFN, EBMT, EBR, EBR.B, ECC, EDF, EDI, EIC, EMR, ENB, EQNR, ETR, EVA, FCCY, FCFS, FINS, FMO, FNWB, FRBA, GBAB, GCBC, GGM, GHY, GOF, GRC, GSBD, GWB, HP, HTBK, HTH, HTLF, HWKN, IHIT, ISD, JBL, JCO, JEF, JEMD, JFR, JGH, JHAA, JHB, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KR, LEO, LLY, LNN, LSTR, MMM, MMS, MOG.A, MOG.B, MSBI, MSEX, NAC, NAD, NAN, NBB, NCB, NDMO, NETI, NEV, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NP, NPN, NRK, NRT, NSL, NUV, NUW, NVG, NXJ, NXR, NXST, NYV, NZF, OBNK, OCSI, ODC, OPY, OSK, OTIS, OTTR, OXLC, OXSQ, PBI, PCSB, PEO, PFC, PFLT, PFS, PFSI, PKOH, PSMT, PSTL, PTVE, PZN, SAL, SBFG, SBRA, SCHW, SDHY, SGC, SHBI, SIGI, SJM, SMBC, SMBK, SONA, SOR, SSB, SSBI, TAIT, TCF, TECH, TFC, TSBK, UTL, V, VBF, VTA, VVR, WAB, WEC, WTRG, YUM\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.825%)\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.065%)\n    - Cleveland CPI (previous: 0.1%)\n    - Continuing Jobless Claims (consensus: 4,490K, previous: 4,592K)\n    - Fed Monetary Policy Report\n    - IEA Monthly Report\n    - Initial Jobless Claims (consensus: 757K, previous: 779K)\n    - Jobless Claims 4-Week Avg. (previous: 848.25K)\n    - Natural Gas Storage (consensus: -181B, previous: -192B)\n    - OPEC Monthly Report\n    - US Federal Budget (previous: -430.0B)\n\n## Upcoming events for Friday, February 12th\n\n - Stock splits:\n\n    - FNGU @ **10:1** (Payable date: 02/11/2021)\n    - FNGS @ **4:1** (Payable date: 02/11/2021)\n\n - Expected earnings:\n\n  AHPI, AIHS, AIM, AIMC, ALJJ, ALUS, ATLC, ATLO, AXL, AYRO, BH.A, BHAT, BLX, CAE, CALT, CCNC, CEI, CGA, CJJD, CMPI, D, DJCO, ENB, EXN, FE, FENC, FGBI, FORD, FRD, FSEA, FSTX, FTS, GENC, HGSH, HMG, HUN, HUSA, IBIO, IFMK, IMGN, IMVT, INBX, IPDN, LECO, MCO, MSGE, MSN, NBAC, NBLX, NHLD, NNVC, NWG, NWL, OLB, OTLK, PBFS, PLAG, PMVP, PNBK, PPSI, PRLB, PRPO, SCX, SNOA, STTK, SXT, TUFN, TYHT, VSTA, WPC\n\n - Ex-div:\n\n  AGCO, AIT, ALE, ARR, AWR, BAF, BBF, BBK, BBN, BCAT, BCX, BDJ, BFK, BFY, BFZ, BG, BGIO, BGR, BGT, BGY, BHK, BHV, BIT, BLE, BLW, BME, BMEZ, BNY, BOE, BSD, BSE, BSM, BST, BSTZ, BTA, BTT, BTZ, BUI, BYM, BZM, CABO, CBFV, CF, CG, CHD, CII, CURO, DLX, DRE, EGF, FRA, FTS, GIM, GROW, HIW, HYT, IVZ, JRSH, KMPR, MCA, MEN, MHD, MMD, MNR, MUE, MUI, MUR, MUS, PRU, R, ROK, SBR, SIMO, SMP, SO, SRV, STK, SWKS, SWX, SZC, TEI, UI, UMH, UMPQ, VCIF, WMK, XEC\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.1K)\n    - CFTC Copper speculative net positions (previous: 66.3K)\n    - CFTC Corn speculative net positions (previous: 528.5K)\n    - CFTC Crude Oil speculative net positions (previous: 499.2K)\n    - CFTC Gold speculative net positions (previous: 257.1K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 29.1K)\n    - CFTC Natural Gas speculative net positions (previous: 29.6K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -34.9K)\n    - CFTC Silver speculative net positions (previous: 51.4K)\n    - CFTC Soybeans speculative net positions (previous: 242.2K)\n    - CFTC Wheat speculative net positions (previous: 32.8K)\n    - Michigan 5-Year Inflation Expectations (previous: 2.70%)\n    - Michigan Consumer Expectations (consensus: 75.7, previous: 74.0)\n    - Michigan Consumer Sentiment (consensus: 80.8, previous: 79.0)\n    - Michigan Current Conditions (consensus: 88.0, previous: 86.7)\n    - Michigan Inflation Expectations (previous: 3.0%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 295)\n    - U.S. Baker Hughes Total Rig Count (previous: 384)\n\n^^^^2021-02-11",
        "created_utc": 1613041222,
        "id": "gmxch6l",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1613070022.0
    },
    {
        "author": "Cronybrewster",
        "body": "Is this a picture of that zebra gum??",
        "created_utc": 1612832634,
        "id": "gmna69b",
        "score": 1,
        "subreddit": "stonks",
        "created": 1612861434.0
    },
    {
        "author": "Pma2kdota",
        "body": "MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, HEY, SU, CK, MY, NUTS, MEL, VIN, CAP, IT, AL, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, WE, LI, KE, THE, STO, CK, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613751658,
        "id": "go0q1so",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613780458.0
    },
    {
        "author": "Aegis617",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613755469,
        "id": "go0yq6i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613784269.0
    },
    {
        "author": "slick__57",
        "body": "Let's get 'em boys, WE LIKE THE STONKS\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613755892,
        "id": "go0zom5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613784692.0
    },
    {
        "author": "Emgimeer",
        "body": "These are my favorite stocks MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB",
        "created_utc": 1613756738,
        "id": "go11ltu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613785538.0
    },
    {
        "author": "toorad4momanddad",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\n🦍🦍🦍🦍💎💎💎🙌🙌🙌🙌🙌🚀🚀🚀🚀",
        "created_utc": 1613756167,
        "id": "go10av0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613784967.0
    },
    {
        "author": "shobel87",
        "body": "Doing my part:   \n MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB",
        "created_utc": 1613756240,
        "id": "go10gto",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613785040.0
    },
    {
        "author": "Torkcuf",
        "body": "I like this stock\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613756651,
        "id": "go11emt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613785451.0
    },
    {
        "author": "quiethandle",
        "body": "For the puts you could look at doing a put zebra. Zebras can actually take advantage of volatility contraction.",
        "created_utc": 1613338705,
        "id": "gngvw6s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613367505.0
    },
    {
        "author": "sebpara",
        "body": "i wish you a zebra beam me up scotty",
        "created_utc": 1613650376,
        "id": "gnvm652",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1613679176.0
    },
    {
        "author": "OG-Outlander",
        "body": "That stupid ass zebra from the gum wrapper is gonna stumble in after the first 15 minutes",
        "created_utc": 1613694804,
        "id": "gnya3xm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613723604.0
    },
    {
        "author": "tayloralext",
        "body": "could you direct msg me what zebra refers to? I have a guess but not certain and I think its a banned topic in this group",
        "created_utc": 1612852225,
        "id": "gmo7x1j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612881025.0
    },
    {
        "author": "TicTicB00M",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.  \n\n\nEdit: i am not a financial professional...i don't lose enough money to be considered one yet",
        "created_utc": 1613750102,
        "id": "go0miti",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613778902.0
    },
    {
        "author": "jherndon22",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613752229,
        "id": "go0rd38",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613781029.0
    },
    {
        "author": "bored2death2",
        "body": "Completely agree with your point.  I \\*was\\* emotional about the trade, mostly pissed off at myself for not following my rules. I generally don't do covered calls AND when I do I get out of them well before loosing 10x the original sell price.  But I got over it quickly and soon found another thing to get frustrated with myself over.  Sure $ZBRA is a great stock and selling PUTs is a great way to make some scratch...but I didn't avoid their options who has a pretty large gap in the BID/ASK coupled with a low volume? Hard to buy back at times.  And while I didn't loose money - it took me three days to get rid of vertical PUT spread.  Only after I broke up the legs was I able to manage it.",
        "created_utc": 1613626542,
        "id": "gnuu8ky",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613655342.0
    },
    {
        "author": "Emgimeer",
        "body": "i like these stocks MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB",
        "created_utc": 1613756839,
        "id": "go11uae",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1613785639.0
    },
    {
        "author": "maxkingusa",
        "body": "So basically Cathie said... if you liked these stocks 2 months ago, you should looooove them today.  She sees bigger gains now that they had these drops.  On one hand you want to puke up your lunch but on the other hand.... we should want this drop in tech and the chance to buy back the key growth companies.  \n\nI bought AAPL, NVDA, AMD, AVGO, XLE and DB (to add some more financials and energy to my portfolio).  This keeps me balanced and I can wait out the pain that tech is providing.  \n\nMy biggest gains that I have held are from VIAC, SBUX, HP, JPM, STOR, LUMN, SPY, and a host of others.\n\nLet's see if adding to tech this week will pay off.",
        "created_utc": 1615237290,
        "id": "gq96pxs",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615266090.0
    },
    {
        "author": "OlDurtMcGurt",
        "body": "By freind you mean your wife's boyfriend?\n\n&amp;#x200B;\n\nIt's a good move IMO as well as the rest of the companies you listed. I'm waiting on UMC to blast off and have been buying every time it dips more. What Im looking at is when Biden decides to try to ramp up semiconductor production in the USA to compete against China, who is going to get government grants and huge tax breaks? TXN? MU? AVGO? For the Automotive industry, who is the most important US company producing the specific semiconductors the car manufactures need?",
        "created_utc": 1614897107,
        "id": "gpph4s9",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614925907.0
    },
    {
        "author": "Offduty_shill",
        "body": "AVGO: great earnings, great guidance, booming sector, has a fucking dividend even, tanks 8%.\n\nYeah makes sense.",
        "created_utc": 1614895307,
        "id": "gppd7ho",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614924107.0
    },
    {
        "author": "PorcoRossoPerot",
        "body": "Is anyone else seeing this weird glitch in the matrix where like a bunch of major S&amp;P stocks that dumped today suddenly skyrocketed back to exactly 0.0% right at close and then fell again in AH? Or is this just some weird thing I'm not understanding.\n\nSeeing it on Amazon, Google, Netflix, Adobe, Broadcom, Texas Instruments, Pepsi. Am I having a stroke?",
        "created_utc": 1615243693,
        "id": "gq9kmfe",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1615272493.0
    },
    {
        "author": "milimiri",
        "body": "You might want to remove STX, AVGO, AAPL and etc. from the list, and add ASML, LRCX, MU and etc. to the list. \n\n\nI am working in semiconductor industry but not in fabrication. Basically the most fabs have been out of game for advanced technology nodes. For example, TXN has some fabs, but they are old technology (still a descent market especially for analog chips). MU has fabs but mainly for memory (memory and logic CMOS are different in manufacting). There are also markets for power semiconductor, optical sensors and etc. For advanced SoC chips, only major players left right now are TSM and INTC. Samsung is still in the game and SMIC is trying to catch up. But basically TSM takes the majority of the market. \n\nDisclosure: I have been holding TSM for a couple of years. I personally prefer fab+fabless and I am a little bearish on US-based fab. But I am not an expert in the field.",
        "created_utc": 1615222721,
        "id": "gq88ilq",
        "score": 2,
        "subreddit": "investing",
        "created": 1615251521.0
    },
    {
        "author": "Watermel__on",
        "body": "This is the way.\n\nIf you actually want to invest, AVGO is a great long-term play (look at the 6month, 1-year, 5-year charts). Earnings after market tomorrow, will go above 500 and then never see the 400s again. This is your last chance.",
        "created_utc": 1614784838,
        "id": "gpji6nd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614813638.0
    },
    {
        "author": "Character_Boat_9955",
        "body": "I’m sittin on 5 shares of AVGO, be nice to see them take off tomorrow or Friday over $500.",
        "created_utc": 1614812653,
        "id": "gpl9vb3",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614841453.0
    },
    {
        "author": "wine_o_clock",
        "body": "I think I’m going to increase my position in $AVGO and maybe $JMIA",
        "created_utc": 1615515564,
        "id": "gqn9v7g",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615544364.0
    },
    {
        "author": "K1nd0fab1gdeal",
        "body": "His most recent buys were LLY, DD, NKE, AMD, WMT, LIN. Sold MRVL, AVGO, JPM, MA, ABT, SBUX, CVS, GS if anyone is interested in what he actually buys and sells rather than talks about",
        "created_utc": 1614826366,
        "id": "gpm00gl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614855166.0
    },
    {
        "author": "X-Boozemonkey-X",
        "body": "Its a fucking beast. Went from $60 in march 2020 to over $700 last month. It just did a 15 to 1 split. We are getting a hell of a discount right now. The underlying assets nvda, avgo, etc need fo come down a bit more and then this can rocket up. \n\nTech isnt going anywhere. I work for fhe goverment. Needless to say we are behind the times technologically. And even we are now almost 100% work from home. We just got word that going forward our offices will be shared and we might be in once a week depending in demand starting in July.\n\nGo look on the Nvida, Intel or AMD forums. Gfx cards are out of stock everywhere. Anything produced is swallowed up in milliseconds. SOXL will rise like the Phoenix from the ashes as it did in 2018, 2020, and now in 2021.",
        "created_utc": 1614886065,
        "id": "gpord6q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614914865.0
    },
    {
        "author": "campbell021",
        "body": "Looking for some further opinions on a short term recovery play (2-3 months) \nI'm thinking Apple, SOXL, or NVDA. \nI'm new to semiconductors. But my thoughts are that a shortage of semiconductors will constantly drive the prices up. And I believe AVGO said they have a backlog that'll take until November to fix. So thw semiconductors problem probably won't be going anyone or it'll lead to new innovations. \nI also really like NVDA. And after their earnings report with no general movement I would think that their upward trend would start here\nBut then there is apple. Who i don't really think needs justification but I'd think would see the least gains in the short term since it would seem they have a lot planned for the long term",
        "created_utc": 1615291264,
        "id": "gqbhez4",
        "score": 1,
        "subreddit": "investing",
        "created": 1615320064.0
    },
    {
        "author": "heyheymustbethemoney",
        "body": "I see value in it. Fabless chip stocks are the ones affected by the shortage. Qualcomm and Marvell don’t have enough chips... meanwhile Skyworks and Broadcom are posting record quarters because they fabricate their own chips.",
        "created_utc": 1615260251,
        "id": "gqaf8pd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615289051.0
    },
    {
        "author": "East-Art1510",
        "body": "Long time small investor from Europe, in my 40s, trying to learn the US market\n\nThe goal is to have something with a managed risk that should long-term perform better than investing in real estate.\n\nAny input would be highly appreciated. Thanks in advance\n\nI am currently working on this\n\nMMM: 10%\n\nAPH: 10%\n\nAAPL: 5%\n\nAVGO: 5%\n\nCAT: 5%\n\nCSCO: 5%\n\nKO: 5%\n\nHON: 5%\n\nDE: 5%\n\nMA: 5%\n\nMSFT: 10%\n\nPFE: 10%\n\nQCOM: 5%\n\nSBUX: 5%\n\nDIS: 5%\n\nAnd the rest of 5% is reserved for short-term volatile and highly questionable trading\n\nAgain thanks in advance for your time",
        "created_utc": 1615368312,
        "id": "gqfgnu4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615397112.0
    },
    {
        "author": "bojackhoreman",
        "body": "I've been using this site to check fair value on stocks and it seems pretty good: [https://www.gurufocus.com/stock/AVGO/summary](https://www.gurufocus.com/stock/AVGO/summary) \n\nA lot of this semiconductors are shown as overvalued. I have a deep itm call on AMD in  expectation of good earnings, and possible government assistance due to the semiconductor shortage. Most stocks are overvalued due to bad earnings during covid, and the market may continue to go down if the yield keeps rising. My gut feeling is saying the market will kangaroo up as the yield rises and we approach april earnings.",
        "created_utc": 1615696102,
        "id": "gqvbjkg",
        "score": 1,
        "subreddit": "options",
        "created": 1615724902.0
    },
    {
        "author": "toydan",
        "body": "Haven’t seen $AVGO and $SWKS  on Reddit much. I like them and have been growing them. Keep them and $QCOM in my dividend account. Want to get to 100 shares of $SWKS and sell CCs over THEM AND $QCOM. \n\nI have LEAPs on $AMD and $MU. that I would to start printing at any time. Will get back into $SOXL again here soon too.",
        "created_utc": 1615730631,
        "id": "gqwc4tc",
        "score": 1,
        "subreddit": "options",
        "created": 1615759431.0
    },
    {
        "author": "zainjavaid",
        "body": "Love to see MSFT, PFE, HON, and AVGO here. At current levels, I might take *some* profits on CAT and sell out of MMM, but other than that, I like your portfolio and the diversification.",
        "created_utc": 1615829254,
        "id": "gr17xoc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615858054.0
    },
    {
        "author": "nunu10000",
        "body": "+1 to Microsoft. They tend to sell massive \"here's the whole enchilada\" deals to customers at millions of dollars per year. Individually, the products are cheaper than their competitors, but in license and SKU volume, they make WAY more money. It's this bundled undercutting that drives so many organizations to move to Microsoft products. The conversation suddenly becomes, why pay \"X vendor $300,000 for this thing, when Microsoft will include it in a suite of 4 other things for $120,000 more?\" \n\nThey're also putting a billion dollars a year into security R&amp;D, and they're slowly starting to compete with more cybersecurity vendors.\n\nWindows Defender has a Vulnerability component: competes with Rapid7 and Tenable.\n\nAzure Sentinel will eventually compete with Splunk (not there yet, IMO, but eventually)\n\nWindows Defender also has a EDR and AV component: competes with Crowdstrike, SentinelOne, (VMware) Carbon Black, McAfee, Broadcom/Symantec, etc...",
        "created_utc": 1615631109,
        "id": "gqscx92",
        "score": 1,
        "subreddit": "investing",
        "created": 1615659909.0
    },
    {
        "author": "MaesterAbester",
        "body": "Which dividend stocks are you watching right now to buy or add into if you don't mind me asking ? I'm personally looking into LMT, O, STAG, ABBV, AVGO.",
        "created_utc": 1614903044,
        "id": "gppt4iv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614931844.0
    },
    {
        "author": "No_Werewolf_1214",
        "body": "I think it’s still got some ground to lose (as do all the semis) before its swings back up, but i think you can’t go wrong by NVDA or AVGO as a long hold.",
        "created_utc": 1615246819,
        "id": "gq9qm8p",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615275619.0
    },
    {
        "author": "redleaflettuce",
        "body": "Look at Broadcom: AVGO.",
        "created_utc": 1615237215,
        "id": "gq96jhy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615266015.0
    },
    {
        "author": "MicroChapLong",
        "body": "About 9 years under your methodology assuming 10% annual FCF growth. But let me try a different angle here. How many companies do you know whose annual share price return equals their FCF yield? The majority of a company’s value is often in its perpetuity growth, or let’s say sustainability of its growth as well prior to the perp g period (sustainability relating to a required return which reflects risk as you alluded to earlier). So if starting from 6.5% (again very rare for a company growing 10% top line which should say something about simply using present FCF yield to say that’s the return I’ll get), combining that with high growth and what I believe to be sustainable growth based on strong competitive positioning and secular megatrends, the return will be north of 6.5%. My hope with AVGO is that a tech rotation knocks it down again and I can continue to add. Full disclosure my current basis is $360ish which looking back was obscenely attractive.",
        "created_utc": 1615685889,
        "id": "gquv9wq",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615714689.0
    },
    {
        "author": "No_Werewolf_1214",
        "body": "Be nice to see them all recover a bit (my April NVDA calls were hurting today), but AVGO should beat earnings so hopefully they get a pop out from the noise of day-long red slides",
        "created_utc": 1614813517,
        "id": "gplblwm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614842317.0
    },
    {
        "author": "MyopiaCapital",
        "body": "AVGO is a great long term hold",
        "created_utc": 1614895625,
        "id": "gppdwlr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614924425.0
    },
    {
        "author": "mend0k",
        "body": "Don't forget these:\nAVGO, AMD, TSM, NEE",
        "created_utc": 1615176328,
        "id": "gq6cqnz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615205128.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  3rd of March\n\n\n\n## Upcoming events for Wednesday, March  3rd\n\n - Stock splits:\n\n    - CLWT @ **3:2** (Payable date: 03/02/2021)\n\n - Expected earnings:\n\n  ACU, AEGN, AEO, AMPE, APT, ASM, ATTO, BBSI, BDR, BF.A, BF.B, BKCC, BKTI, BLCT, BMA, BQ, BXC, CECE, CETX, CFMS, CIX, CLMT, CMTL, CNR, CORR, CTRM, CULP, CZZ, DAKT, DLTR, DPW, DSGX, DY, ENIC, EQX, EVGN, EYE, EYEG, FLMN, FTHM, GHLD, GIFI, GMRE, GPRK, GRP.U, HBB, HDSN, HGEN, HPR, HRTG, IMTX, ISEE, ITRN, JILL, KERN, KIDS, KRON, LINC, MDRR, MESO, MLR, MRVL, MTLS, MYRG, NAV, NC, NEWT, NFH, NM, NMCI, NWPX, OGEN, OKTA, OM, ONCR, OPTN, OSW, OXSQ, PASG, PCOM, PDCO, PNRG, PW, RAIL, RCMT, RDHL, RMNI, RNET, RPTX, RRGB, SBBP, SBOW, SD, SID, SINA, SLNO, SMHI, SNOW, SPKE, SPLK, SPRB, SQM, STKL, SUPV, TAC, TAST, TCOM, TPCO, TPVG, TSHA, UFPT, USDP, VNET, VRM, VRTV, WB, WEN, WHLR, WMC, WPG, WTI, YEXT\n\n - Ex-div:\n\n  ALL, AWI, EQH, ES, ESBK, FANG, FWRD, GLOG, LEA, LZB, MBCN, MOS, NLSN, PTEN, QCOM, RMBI, SSTK, VNOM\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 177K, previous: 174K)\n    - Beige Book\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: 0.249M)\n    - Crude Oil Inventories (consensus: -0.928M, previous: 1.285M)\n    - Cushing Crude Oil Inventories (previous: 2.807M)\n    - Distillate Fuel Production (previous: -0.953M)\n    - EIA Refinery Crude Runs  (previous: -2.589M)\n    - EIA Weekly Distillates Stocks (consensus: -3.035M, previous: -4.969M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 4.6%, previous: -14.5%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Kaplan Speaks\n    - Gasoline Inventories (consensus: -2.300M, previous: 0.012M)\n    - Gasoline Production (previous: -1.295M)\n    - Heating Oil Stockpiles (previous: 0.093M)\n    - ISM Non-Manufacturing Business Activity (consensus: 60.0, previous: 59.9)\n    - ISM Non-Manufacturing Employment (previous: 55.2)\n    - ISM Non-Manufacturing New Orders (previous: 61.8)\n    - ISM Non-Manufacturing PMI (consensus: 58.7, previous: 58.7)\n    - ISM Non-Manufacturing Prices (previous: 64.2)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -11.4%)\n    - MBA Purchase Index (previous: 264.9)\n    - Markit Composite PMI (consensus: 58.8, previous: 58.7)\n    - Mortgage Market Index (previous: 790.6)\n    - Mortgage Refinance Index (previous: 3,848.1)\n    - OPEC Meeting\n    - Services PMI (consensus: 58.9, previous: 58.3)\n\n## Upcoming events for Thursday, March  4th\n\n - Stock splits:\n\n    - MYBF @ **105:100** (Payable date: 03/15/2021)\n    - TR @ **103:100** (Payable date: 04/02/2021)\n    - TROLB @ **103:100** (Payable date: 03/26/2021)\n\n - Expected earnings:\n\n  ABUS, ACOR, ADCT, AE, AFIB, AGS, AHCO, AIV, AJX, AKUS, ALXO, AMC, AMTI, ANIK, AQN, ARGX, ASPS, AT, ATC, ATEC, ATHA, AUTL, AVGO, AVGR, BALY, BCOW, BJ, BPMP, BSGM, BURL, BYFC, BZUN, CBIO, CBMB, CCCC, CDAK, CELP, CERT, CHMA, CHMI, CHUY, CIB, CIEN, CIR, CLLS, CLPT, CLXT, CNQ, COHN, COO, COST, CRAI, CRD.A, CRD.B, CRVS, CTSO, CVV, CZNC, DBVT, DMTK, DNN, DRRX, DSSI, DXYN, DYN, EGLE, ELOX, ENZ, ESGC, ETON, EVC, EVFM, EVLO, EYPT, FBRX, FCRD, FIZZ, FLGT, FMTX, FOUR, FPRX, FRGI, FTSI, FULC, GAU, GBLI, GCP, GDYN, GMS, GOL, GPL, GPMT, GPS, GRAY, GSAT, GSL, GWRE, GWRS, HCM, HEAR, HOLI, HRMY, IDT, IMAX, IMMR, INMB, INVE, INZY, ISDR, ISIG, ITOS, JAMF, JG, JW.A, JW.B, JYNT, KBNT, KDMN, KR, KYMR, LRMR, LTRN, MANU, MAXN, MAYS, MCS, MDLA, MEG, MEI, MIK, MLVF, MMX, MOSY, MTCR, MWK, MYSZ, NCMI, NEW, NKSH, NKTX, NNA, NRP, NTCO, NTST, NVIV, NX, OBLN, OBSV, ODC, OPEN, OPNT, ORIC, ORTX, PACK, PBLA, PCVX, PHI, PLYA, PQG, PRPL, PSTX, PVAC, QTT, QUMU, RFL, RLH, RVMD, SALM, SCM, SCOR, SCPE, SDC, SDGR, SENS, SFE, SHG, SHIP, SIGA, SMLP, SMSI, SOHO, SOLY, SPPI, SQFT, SRG, SRLP, STLA, STON, SWBI, SYN, SYRS, TARA, THRY, TLS, TMBR, TOMZ, TRIN, TTC, TTOO, TWI, VBIV, VERI, VLGEA, VNRX, VRAY, VSEC, VTRS, VYNE, WPP, WRAP, WVE, XFOR, YPF\n\n - Ex-div:\n\n  AFB, AGR, AJG, AMNB, BAC, BBL, BLK, BOTJ, BRKR, BRKS, CASS, CHRW, D, DAN, DEA, DRD, EPC, FLIR, FLO, FNB, FRME, GBDC, GPC, HSII, ICBK, KMB, KNX, LIN, MBWM, NAVI, NCB, NUW, NVS, OC, PCH, PEP, PTVCA, PTVCB, RF, RIO, SAFT, SCL, SEE, SLM, TEX, TFX, TGNA, TR, TRST, TT, UFCS, WEN, WING, WY\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.035%)\n    - 8-Week Bill Auction (previous: 0.040%)\n    - Challenger Job Cuts (previous: 79.552K)\n    - Continuing Jobless Claims (consensus: 4,300K, previous: 4,419K)\n    - Durables Excluding Defense (previous: 2.3%)\n    - Factory Orders (consensus: 2.1%, previous: 1.1%)\n    - Factory orders ex transportation (previous: 1.4%)\n    - Initial Jobless Claims (consensus: 750K, previous: 730K)\n    - Jobless Claims 4-Week Avg. (previous: 807.75K)\n    - Natural Gas Storage (consensus: -333B, previous: -338B)\n    - Nonfarm Productivity (consensus: -4.7%, previous: -4.8%)\n    - OPEC Meeting\n    - Unit Labor Costs (consensus: 6.6%, previous: 6.8%)\n\n## Upcoming events for Friday, March  5th\n\n - Stock splits:\n\n    - APH @ **2:1** (Payable date: 03/04/2021)\n\n - Expected earnings:\n\n  AAMC, AIM, ALUS, ANAT, ARDX, ATLC, ATLO, AYRO, BH.A, BHAT, BIG, BORR, BPTH, BRID, CCNC, CEI, CHEK, CLPS, CMPI, COE, COMS, CRH, DS, DXPE, EML, EXN, FENC, FGBI, FHTX, FSEA, FSTX, GGAL, GLP, GSX, HIBB, HMG, HURC, HUSA, IMRA, INBX, INTT, IPDN, ITCB, KB, KMPH, KVHI, MIST, NBAC, NWLI, OFS, OLB, ONCY, PCSA, PDLB, PLPC, PMVP, PNBK, PPSI, PRPO, PSO, PTMN, RUTH, SAMG, SPLP, STRR, STTK, SUP, TGS, UBOH, VET, VSTA\n\n - Ex-div:\n\n  ANAT, BF.A, BF.B, CCBG, CDK, CNS, EVRG, EXC, FAF, FDX, GE, HBB, HL, HTGC, HWC, JBT, JKHY, JOE, KSU, LUMN, LYB, NC, OAS, OMP, PATK, PBIP, RTLR, STRA, SVBI, SYX, TPL, TROX, UGP, VALE\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 5.3%, previous: 5.4%)\n    - Average Hourly Earnings (consensus: 0.2%, previous: 0.2%)\n    - Average Weekly Hours (consensus: 34.9, previous: 35.0)\n    - CFTC Aluminium speculative net positions (previous: 4.7K)\n    - CFTC Copper speculative net positions (previous: 75.4K)\n    - CFTC Corn speculative net positions (previous: 529.8K)\n    - CFTC Crude Oil speculative net positions (previous: 511.8K)\n    - CFTC Gold speculative net positions (previous: 215.7K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.4K)\n    - CFTC Natural Gas speculative net positions (previous: 28.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -31.3K)\n    - CFTC Silver speculative net positions (previous: 47.6K)\n    - CFTC Soybeans speculative net positions (previous: 239.8K)\n    - CFTC Wheat speculative net positions (previous: 27.4K)\n    - Consumer Credit (consensus: 12.00B, previous: 9.73B)\n    - Exports (previous: 184.20B)\n    - Government Payrolls (previous: 43.0K)\n    - Imports (previous: 252.30B)\n    - Manufacturing Payrolls (consensus: 12K, previous: -10K)\n    - Nonfarm Payrolls (consensus: 180K, previous: 49K)\n    - Participation Rate (previous: 61.4%)\n    - Private Nonfarm Payrolls (consensus: 194K, previous: 6K)\n    - Trade Balance (consensus: -67.50B, previous: -66.60B)\n    - U.S. Baker Hughes Oil Rig Count (previous: 305)\n    - U.S. Baker Hughes Total Rig Count (previous: 397)\n    - U6 Unemployment Rate (previous: 11.1%)\n    - US Federal Budget (previous: -430.0B)\n    - Unemployment Rate (consensus: 6.3%, previous: 6.3%)\n\n^^^^2021-03-03",
        "created_utc": 1614769221,
        "id": "gpisq8x",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1614798021.0
    },
    {
        "author": "hopefuldepression",
        "body": "i pulled a stupid boomer move and used 80% of my crap money on avgo, guess the other 20% can show rkt some love",
        "created_utc": 1614719724,
        "id": "gpgkru1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614748524.0
    },
    {
        "author": "MogollonVariation",
        "body": "How much depreciation does $AVGO have left? They cant not pay taxes forever😅😅",
        "created_utc": 1615834272,
        "id": "gr1j8rh",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615863072.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 16th of March\n\n\n\n## Upcoming events for Tuesday, March 16th\n\n - Expected earnings:\n\n  ABIO, ADVWW, ALSK, APG, ASPU, AYLA, BDSX, BMTX, CAL, CALA, CLPR, CNF, COUP, CRIS, CRTX, CRWD, CTRN, CUE, DBI, DFFN, DL, DLNG, DTIL, ELDN, EMAN, EOLS, ETON, FANH, FCEL, FF, FLNT, FORTY, FREE, FTK, FUSN, FUTU, GBIO, HIL, HJLI, HUGE, IDN, IMNM, IMOS, INFI, INPX, IPHA, IRCP, JBL, JILL, KIN, KIQ, KODK, KROS, LEN, LEN.B, LTBR, MICT, MOTS, NBEV, NES, NEW, NFE, NPK, NTN, NYC, OCX, ORGO, OTEL, PFMT, PLRX, PMD, PRLD, PRTH, REDU, REI, RMED, RNA, RUHN, SHSP, SMAR, SRGA, STSA, SUMR, SYNC, TLC, TOUR, TRIL, TSQ, VBFC, VEL, VFF, VIRX, VOLT, WF, WKEY, XGN, XNET, YMTX, YTEN\n\n - Ex-div:\n\n  ACCO, ALLE, ARES, BKCC, CEN, CINF, CIZN, CXE, CXH, DMB, DYFN, ESCA, FINS, FLXS, FNF, FOF, FSFG, FSK, FSKR, GAB, GDL, GDV, GGZ, GNT, GRX, GUT, GWRS, HCA, HES, HI, HMN, HOFT, ICE, ITT, IVH, KSS, LDP, LRCX, MCR, MCY, MIE, MIN, MMT, MRTN, NJR, NMFC, NWS, NWSA, OPP, OXLC, OXSQ, PGZ, PHI, PSF, PTA, RA, RE, RFM, RIV, RMI, RMM, RNP, RNST, RQI, RSF, RYN, SJI, SLGN, STFC, SWBI, TCPC, TDS, TY, UHT, UTF, UTMD, VSH, VST, WH, WU\n\n - Economic events and announcements:\n\n    - 20-Year TIPS Auction (previous: 1.920%)\n    - API Weekly Crude Oil Stock (previous: 12.792M)\n    - Business Inventories (consensus: 0.3%, previous: 0.6%)\n    - Capacity Utilization Rate (consensus: 75.5%, previous: 75.6%)\n    - Core Retail Sales (consensus: -0.1%, previous: 5.9%)\n    - Export Price Index (consensus: 0.9%, previous: 2.5%)\n    - Export Price Index (previous: 2.3%)\n    - Import Price Index (consensus: 1.2%, previous: 1.4%)\n    - Import Price Index (previous: 0.9%)\n    - Industrial Production (consensus: 0.3%, previous: 0.9%)\n    - Industrial Production (previous: -1.83%)\n    - Manufacturing Production (consensus: -0.1%, previous: 1.0%)\n    - NAHB Housing Market Index (consensus: 83, previous: 84)\n    - Redbook (previous: -18.1%)\n    - Redbook (previous: 8.0%)\n    - Retail Control (consensus: -0.9%, previous: 6.0%)\n    - Retail Inventories Ex Auto (previous: -0.2%)\n    - Retail Sales (consensus: -0.5%, previous: 5.3%)\n    - Retail Sales (previous: 7.43%)\n    - Retail Sales Ex Gas/Autos (previous: 6.1%)\n\n## Upcoming events for Wednesday, March 17th\n\n - Expected earnings:\n\n  AOUT, AP, ARCO, AXLA, CEPU, CETX, CFRX, CMCL, CRHM, CSAN, CTAS, CTIC, DPW, ELP, EPSN, ETNB, ETTX, EYEG, FIVE, FPH, FPI, GES, GEVO, GIFI, HBB, IMTX, IMV, INFU, IPWR, JCS, KC, KRKR, KRON, LE, MDRR, MLHR, MLND, NAVB, NFH, NM, NMCI, NXE, ONTF, OSMT, OVID, OXSQ, PD, PDD, PNRG, PW, QD, RCMT, RIDE, RNET, SCYX, SGBX, SID, SINA, SMTC, SNDL, SPRB, SPRT, TEO, TH, THMO, UBX, UEC, UPST, VINP, VSTM, WHLR, WLFC, WPG, WSM, WVVI, ZTO\n\n - Ex-div:\n\n  AAN, ADT, AFT, AIF, AIMC, AJX, ALEX, ARD, BANX, BBY, BPOP, CHMG, CUBA, EBSB, FSLF, GAIN, GLAD, GOOD, HBAN, HRZN, LAND, MAV, MHI, MNDO, MPW, MYE, NUW, PFLT, PHD, PHT, PNNT, SITC, SLRC, SNV, SUNS, TSM, VRS\n\n - Economic events and announcements:\n\n    - Building Permits (consensus: 1.750M, previous: 1.886M)\n    - Building Permits (previous: 10.7%)\n    - Crude Oil Imports (previous: -0.919M)\n    - Crude Oil Inventories (consensus: 2.715M, previous: 13.798M)\n    - Cushing Crude Oil Inventories (previous: 0.526M)\n    - Distillate Fuel Production (previous: 0.806M)\n    - EIA Refinery Crude Runs  (previous: 2.407M)\n    - EIA Weekly Distillates Stocks (consensus: -3.470M, previous: -5.504M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 5.1%, previous: 13.0%)\n    - FOMC Economic Projections\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision\n    - Gasoline Inventories (consensus: -3.134M, previous: -11.869M)\n    - Gasoline Production (previous: 0.704M)\n    - Heating Oil Stockpiles (previous: 0.544M)\n    - Housing Starts (consensus: 1.560M, previous: 1.580M)\n    - Housing Starts (previous: -6.0%)\n    - IEA Monthly Report\n    - Interest Rate Projection - 1st Yr (previous: 0.10)\n    - Interest Rate Projection - 2nd Yr (previous: 0.1)\n    - Interest Rate Projection - Current (previous: 0.1)\n    - Interest Rate Projection - Longer (previous: 2.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.26%)\n    - MBA Mortgage Applications (previous: -1.3%)\n    - MBA Purchase Index (previous: 289.0)\n    - Mortgage Market Index (previous: 783.8)\n    - Mortgage Refinance Index (previous: 3,658.8)\n\n## Upcoming events for Thursday, March 18th\n\n - Stock splits:\n\n    - ELPVY @ **10:1** (Payable date: 03/17/2021)\n    - ELP @ **10:1** (Payable date: 03/17/2021)\n\n - Expected earnings:\n\n  ACN, ACTG, ADCT, ADMA, AFIB, AIV, AKUS, ALPN, ALTG, ALXO, AMTI, ARMP, ASLN, ATHA, AVIR, BCOW, BLCM, BSGM, BSQR, CATO, CBMB, CBPO, CDAK, CELP, CIB, CMC, CRT, CRVS, CSIQ, CTK, CVV, CWBR, CZNC, DG, DLTH, DTIL, EFOI, ENTX, ESGC, EYES, FBRX, FDX, FMTX, FRSX, FURY, GECC, GHSI, GIII, GLMD, GOL, HEXO, HHR, HIMS, HOOK, HWCC, INZY, ITOS, JG, JOBS, KINS, LAIX, LAZR, LAZY, LEGN, LEU, LX, MAXN, MBRX, MMX, MOSY, MP, MRUS, MTCR, MTEM, MYSZ, NEN, NKE, NKSH, NKTX, NLTX, NNA, NSYS, NVGS, NVIV, OCDX, OCGN, OLLI, ORIC, PAX, PBLA, PCVX, PDSB, PESI, PFSW, PHAT, PLX, PROG, RDHL, REED, RFL, RLH, RMTI, SCHL, SCPE, SHIP, SIG, SLDB, SLRX, SMTS, SMTX, SPPI, SQFT, SQZ, STG, SVRA, SYBX, SYPR, TATT, TITN, TMBR, TOMZ, UG, UONE, UONEK, URGN, USAU, UTZ, VBLT, VIRI, VIVE, VNRX, VTRS, WB, WOOF, WRN, XTLB, YI\n\n - Ex-div:\n\n  AAP, AIN, AINV, AL, ALRS, BBSI, BIG, CB, CRH, CTS, DEX, DKS, FISI, FSS, GEF, GEF.B, HPP, IGR, MGU, MLI, MNRL, PLD, PLOW, QCRH, QTS, RBCAA, RPT, SBSW, SPR, THQ, THW, TPB, VCIF, VGR, WEYS, WMT\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.987%)\n    - 4-Week Bill Auction (previous: 0.030%)\n    - 8-Week Bill Auction (previous: 0.035%)\n    - Continuing Jobless Claims (consensus: 4,070K, previous: 4,144K)\n    - Initial Jobless Claims (consensus: 700K, previous: 712K)\n    - Jobless Claims 4-Week Avg. (previous: 759.00K)\n    - Natural Gas Storage (consensus: -73B, previous: -52B)\n    - Philadelphia Fed Manufacturing Index (consensus: 23.0, previous: 23.1)\n    - Philly Fed Business Conditions (previous: 39.5)\n    - Philly Fed CAPEX Index (previous: 25.20)\n    - Philly Fed Employment (previous: 25.3)\n    - Philly Fed New Orders (previous: 23.4)\n    - Philly Fed Prices Paid (previous: 54.40)\n    - US Leading Index (consensus: 0.3%, previous: 0.5%)\n\n## Upcoming events for Friday, March 19th\n\n - Expected earnings:\n\n  ADIL, AIM, ANAT, ATLC, ATLO, AYRO, BH.A, BHAT, BRID, CCNC, CEI, CHEK, CMPI, COMS, CVR, ENSV, ERJ, EXN, FENC, FGBI, FHTX, FSEA, FSTX, GGAL, HMG, HUSA, ITCB, LMNL, MIST, NBAC, NWLI, OLB, PCSA, PNBK, PRPO, PXS, RBCN, SJ, SPLP, STTK, TEDU, TGS, UONE, UONEK, VSTA, WTT\n\n - Ex-div:\n\n  ARDC, AVGO, CSGS, CTO, DX, FGBI, GBLI, HRC, JCI, JJSF, LAMR, NCMI, NEWT, PCF, PINE, PM, TIPT, WRE\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 4.1K)\n    - CFTC Copper speculative net positions (previous: 51.4K)\n    - CFTC Corn speculative net positions (previous: 503.4K)\n    - CFTC Crude Oil speculative net positions (previous: 537.4K)\n    - CFTC Gold speculative net positions (previous: 175.2K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -12.5K)\n    - CFTC Natural Gas speculative net positions (previous: -0.0K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 17.8K)\n    - CFTC Silver speculative net positions (previous: 36.1K)\n    - CFTC Soybeans speculative net positions (previous: 224.7K)\n    - CFTC Wheat speculative net positions (previous: 26.1K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 310)\n    - U.S. Baker Hughes Total Rig Count (previous: 403)\n\n^^^^2021-03-16",
        "created_utc": 1615888816,
        "id": "gr3uymn",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1615917616.0
    },
    {
        "author": "MicroChapLong",
        "body": "Ok, if you can tell me hundreds of cheap stocks behind a cursory book value and PE I’d love to hear. I obviously cannot write a 500 word essay on Broadcom here. Generally investors just appreciate the facts to pique their interest and can look into a bit more. If you want a full thesis you can read my seeking alpha syndicated article on $axti and drop your negative comments there as well.",
        "created_utc": 1615672090,
        "id": "gqu7b5x",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615700890.0
    },
    {
        "author": "Spectacle_Maker",
        "body": "I’m loving semis here. ON is my favorite, but I am also long NVDA, AVGO, SWKS, MCHP, and ACEV.",
        "created_utc": 1615691309,
        "id": "gqv468i",
        "score": 1,
        "subreddit": "options",
        "created": 1615720109.0
    },
    {
        "author": "bjguuc",
        "body": "No what I’m saying has nothing to do with corporate finance in the classroom. I never took one of those thank God. Anyway: what do you think AVGO would earn for you if you owned the whole business over the next 5 years? Ballpark obviously",
        "created_utc": 1615699429,
        "id": "gqvg41h",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615728229.0
    },
    {
        "author": "miscsubs",
        "body": "This list is worse than just posting the components of SOXX.\n\nLike who in their right minds (fab or no fab) talks about MSFT in the semi space? Or even Apple? They don't sell any of their chips. Nobody buys AAPL for their chip revenue. And LOL, having IBM in there, who had to *pay* GF to take their fabs off their hands.\n\nThere's Broadcom but no Qualcomm. There's Skyworks but no Qorvo. The list is so bad I kind of feel like it's a troll post. But probably not.",
        "created_utc": 1615221552,
        "id": "gq85nwp",
        "score": 1,
        "subreddit": "investing",
        "created": 1615250352.0
    },
    {
        "author": "No_Werewolf_1214",
        "body": "No such thing as a sale - Never about decrease from current highs, always about where a stock is headed and how much growth it had ahead of it over the next 6-8 months. If it ain’t growing more than S&amp;P over that time then it ain’t ready. \n\nAnd those two (AVGO and NVDA) are the only ones that aren’t already pushing against the top of their current value (in my opinion), so those are your best bets on the upswing.",
        "created_utc": 1615255181,
        "id": "gqa61wl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615283981.0
    },
    {
        "author": "space1233123",
        "body": "Add avgo",
        "created_utc": 1615610337,
        "id": "gqrq9dt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615639137.0
    },
    {
        "author": "wearahat03",
        "body": "TSM is good but way overhyped.\n\nRevenue in 2016 - 949\n\nRevenue in 2020 - 1340\n\n9% revenue growth p.a. \n\nASML 19% p.a.\n\nNVDA 24% p.a.\n\nINTC 7% p.a.\n\nAMD 23% p.a.\n\nAMAT 12% p.a.\n\nAVGO 16% p.a.\n\nBeing the technological leader doesn't mean the company is the best investment. \n\nIn terms of stock price performance, TSM has been outperformed by NVDA, AMD, ASML and AMAT.\n\nIt's only grown revenues by 2% more than Intel per year for the past 4 years. \n\nIf you measure EPS growth the story changes too, to the detriment of TSM.\n\nINTC 22% p.a.\n\nAMAT 29% p.a.\n\nNVDA 29% p.a.\n\nASML 23.5% p.a\n\nTSM 11.5% p.a\n\nOther semis have done a better job not only in revenue growth but in their expenses / capital management. \n\nEven with technological leadership, I would rank them on the same level as Intel. What's the point of tech leadership if you don't translate it into revenues and profits?\n\nIntel has lagged in tech but they're still able to grab revenues and profits. \n\nThe best companies are AMD, NVDA, ASML because they not only deliver on tech but they translate it into growing revenues and profits.",
        "created_utc": 1615822042,
        "id": "gr0rmad",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615850842.0
    },
    {
        "author": "Szmate1106",
        "body": "I'm glad I bought the dip on Broadcom. It's a fine stock.",
        "created_utc": 1615888499,
        "id": "gr3undm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615917299.0
    },
    {
        "author": "maxkingusa",
        "body": "So basically Cathie said... if you liked these stocks 2 months ago, you should looooove them today.  She sees bigger gains now that they had these drops.  On one hand you want to puke up your lunch but on the other hand.... we should want this drop in tech and the chance to buy back the key growth companies.  \n\nI bought AAPL, NVDA, AMD, AVGO, XLE and DB (to add some more financials and energy to my portfolio).  This keeps me balanced and I can wait out the pain that tech is providing.  \n\nMy biggest gains that I have held are from VIAC, SBUX, HP, JPM, STOR, LUMN, SPY, and a host of others.\n\nLet's see if adding to tech this week will pay off.",
        "created_utc": 1615237290,
        "id": "gq96pxs",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615266090.0
    },
    {
        "author": "OlDurtMcGurt",
        "body": "By freind you mean your wife's boyfriend?\n\n&amp;#x200B;\n\nIt's a good move IMO as well as the rest of the companies you listed. I'm waiting on UMC to blast off and have been buying every time it dips more. What Im looking at is when Biden decides to try to ramp up semiconductor production in the USA to compete against China, who is going to get government grants and huge tax breaks? TXN? MU? AVGO? For the Automotive industry, who is the most important US company producing the specific semiconductors the car manufactures need?",
        "created_utc": 1614897107,
        "id": "gpph4s9",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614925907.0
    },
    {
        "author": "Offduty_shill",
        "body": "AVGO: great earnings, great guidance, booming sector, has a fucking dividend even, tanks 8%.\n\nYeah makes sense.",
        "created_utc": 1614895307,
        "id": "gppd7ho",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614924107.0
    },
    {
        "author": "PorcoRossoPerot",
        "body": "Is anyone else seeing this weird glitch in the matrix where like a bunch of major S&amp;P stocks that dumped today suddenly skyrocketed back to exactly 0.0% right at close and then fell again in AH? Or is this just some weird thing I'm not understanding.\n\nSeeing it on Amazon, Google, Netflix, Adobe, Broadcom, Texas Instruments, Pepsi. Am I having a stroke?",
        "created_utc": 1615243693,
        "id": "gq9kmfe",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1615272493.0
    },
    {
        "author": "milimiri",
        "body": "You might want to remove STX, AVGO, AAPL and etc. from the list, and add ASML, LRCX, MU and etc. to the list. \n\n\nI am working in semiconductor industry but not in fabrication. Basically the most fabs have been out of game for advanced technology nodes. For example, TXN has some fabs, but they are old technology (still a descent market especially for analog chips). MU has fabs but mainly for memory (memory and logic CMOS are different in manufacting). There are also markets for power semiconductor, optical sensors and etc. For advanced SoC chips, only major players left right now are TSM and INTC. Samsung is still in the game and SMIC is trying to catch up. But basically TSM takes the majority of the market. \n\nDisclosure: I have been holding TSM for a couple of years. I personally prefer fab+fabless and I am a little bearish on US-based fab. But I am not an expert in the field.",
        "created_utc": 1615222721,
        "id": "gq88ilq",
        "score": 2,
        "subreddit": "investing",
        "created": 1615251521.0
    },
    {
        "author": "Watermel__on",
        "body": "This is the way.\n\nIf you actually want to invest, AVGO is a great long-term play (look at the 6month, 1-year, 5-year charts). Earnings after market tomorrow, will go above 500 and then never see the 400s again. This is your last chance.",
        "created_utc": 1614784838,
        "id": "gpji6nd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614813638.0
    },
    {
        "author": "Character_Boat_9955",
        "body": "I’m sittin on 5 shares of AVGO, be nice to see them take off tomorrow or Friday over $500.",
        "created_utc": 1614812653,
        "id": "gpl9vb3",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614841453.0
    },
    {
        "author": "wine_o_clock",
        "body": "I think I’m going to increase my position in $AVGO and maybe $JMIA",
        "created_utc": 1615515564,
        "id": "gqn9v7g",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615544364.0
    },
    {
        "author": "K1nd0fab1gdeal",
        "body": "His most recent buys were LLY, DD, NKE, AMD, WMT, LIN. Sold MRVL, AVGO, JPM, MA, ABT, SBUX, CVS, GS if anyone is interested in what he actually buys and sells rather than talks about",
        "created_utc": 1614826366,
        "id": "gpm00gl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614855166.0
    },
    {
        "author": "X-Boozemonkey-X",
        "body": "Its a fucking beast. Went from $60 in march 2020 to over $700 last month. It just did a 15 to 1 split. We are getting a hell of a discount right now. The underlying assets nvda, avgo, etc need fo come down a bit more and then this can rocket up. \n\nTech isnt going anywhere. I work for fhe goverment. Needless to say we are behind the times technologically. And even we are now almost 100% work from home. We just got word that going forward our offices will be shared and we might be in once a week depending in demand starting in July.\n\nGo look on the Nvida, Intel or AMD forums. Gfx cards are out of stock everywhere. Anything produced is swallowed up in milliseconds. SOXL will rise like the Phoenix from the ashes as it did in 2018, 2020, and now in 2021.",
        "created_utc": 1614886065,
        "id": "gpord6q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614914865.0
    },
    {
        "author": "campbell021",
        "body": "Looking for some further opinions on a short term recovery play (2-3 months) \nI'm thinking Apple, SOXL, or NVDA. \nI'm new to semiconductors. But my thoughts are that a shortage of semiconductors will constantly drive the prices up. And I believe AVGO said they have a backlog that'll take until November to fix. So thw semiconductors problem probably won't be going anyone or it'll lead to new innovations. \nI also really like NVDA. And after their earnings report with no general movement I would think that their upward trend would start here\nBut then there is apple. Who i don't really think needs justification but I'd think would see the least gains in the short term since it would seem they have a lot planned for the long term",
        "created_utc": 1615291264,
        "id": "gqbhez4",
        "score": 1,
        "subreddit": "investing",
        "created": 1615320064.0
    },
    {
        "author": "heyheymustbethemoney",
        "body": "I see value in it. Fabless chip stocks are the ones affected by the shortage. Qualcomm and Marvell don’t have enough chips... meanwhile Skyworks and Broadcom are posting record quarters because they fabricate their own chips.",
        "created_utc": 1615260251,
        "id": "gqaf8pd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615289051.0
    },
    {
        "author": "East-Art1510",
        "body": "Long time small investor from Europe, in my 40s, trying to learn the US market\n\nThe goal is to have something with a managed risk that should long-term perform better than investing in real estate.\n\nAny input would be highly appreciated. Thanks in advance\n\nI am currently working on this\n\nMMM: 10%\n\nAPH: 10%\n\nAAPL: 5%\n\nAVGO: 5%\n\nCAT: 5%\n\nCSCO: 5%\n\nKO: 5%\n\nHON: 5%\n\nDE: 5%\n\nMA: 5%\n\nMSFT: 10%\n\nPFE: 10%\n\nQCOM: 5%\n\nSBUX: 5%\n\nDIS: 5%\n\nAnd the rest of 5% is reserved for short-term volatile and highly questionable trading\n\nAgain thanks in advance for your time",
        "created_utc": 1615368312,
        "id": "gqfgnu4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615397112.0
    },
    {
        "author": "bojackhoreman",
        "body": "I've been using this site to check fair value on stocks and it seems pretty good: [https://www.gurufocus.com/stock/AVGO/summary](https://www.gurufocus.com/stock/AVGO/summary) \n\nA lot of this semiconductors are shown as overvalued. I have a deep itm call on AMD in  expectation of good earnings, and possible government assistance due to the semiconductor shortage. Most stocks are overvalued due to bad earnings during covid, and the market may continue to go down if the yield keeps rising. My gut feeling is saying the market will kangaroo up as the yield rises and we approach april earnings.",
        "created_utc": 1615696102,
        "id": "gqvbjkg",
        "score": 1,
        "subreddit": "options",
        "created": 1615724902.0
    },
    {
        "author": "toydan",
        "body": "Haven’t seen $AVGO and $SWKS  on Reddit much. I like them and have been growing them. Keep them and $QCOM in my dividend account. Want to get to 100 shares of $SWKS and sell CCs over THEM AND $QCOM. \n\nI have LEAPs on $AMD and $MU. that I would to start printing at any time. Will get back into $SOXL again here soon too.",
        "created_utc": 1615730631,
        "id": "gqwc4tc",
        "score": 1,
        "subreddit": "options",
        "created": 1615759431.0
    },
    {
        "author": "zainjavaid",
        "body": "Love to see MSFT, PFE, HON, and AVGO here. At current levels, I might take *some* profits on CAT and sell out of MMM, but other than that, I like your portfolio and the diversification.",
        "created_utc": 1615829254,
        "id": "gr17xoc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615858054.0
    },
    {
        "author": "nunu10000",
        "body": "+1 to Microsoft. They tend to sell massive \"here's the whole enchilada\" deals to customers at millions of dollars per year. Individually, the products are cheaper than their competitors, but in license and SKU volume, they make WAY more money. It's this bundled undercutting that drives so many organizations to move to Microsoft products. The conversation suddenly becomes, why pay \"X vendor $300,000 for this thing, when Microsoft will include it in a suite of 4 other things for $120,000 more?\" \n\nThey're also putting a billion dollars a year into security R&amp;D, and they're slowly starting to compete with more cybersecurity vendors.\n\nWindows Defender has a Vulnerability component: competes with Rapid7 and Tenable.\n\nAzure Sentinel will eventually compete with Splunk (not there yet, IMO, but eventually)\n\nWindows Defender also has a EDR and AV component: competes with Crowdstrike, SentinelOne, (VMware) Carbon Black, McAfee, Broadcom/Symantec, etc...",
        "created_utc": 1615631109,
        "id": "gqscx92",
        "score": 1,
        "subreddit": "investing",
        "created": 1615659909.0
    },
    {
        "author": "MaesterAbester",
        "body": "Which dividend stocks are you watching right now to buy or add into if you don't mind me asking ? I'm personally looking into LMT, O, STAG, ABBV, AVGO.",
        "created_utc": 1614903044,
        "id": "gppt4iv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614931844.0
    },
    {
        "author": "No_Werewolf_1214",
        "body": "I think it’s still got some ground to lose (as do all the semis) before its swings back up, but i think you can’t go wrong by NVDA or AVGO as a long hold.",
        "created_utc": 1615246819,
        "id": "gq9qm8p",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615275619.0
    },
    {
        "author": "redleaflettuce",
        "body": "Look at Broadcom: AVGO.",
        "created_utc": 1615237215,
        "id": "gq96jhy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615266015.0
    },
    {
        "author": "MicroChapLong",
        "body": "About 9 years under your methodology assuming 10% annual FCF growth. But let me try a different angle here. How many companies do you know whose annual share price return equals their FCF yield? The majority of a company’s value is often in its perpetuity growth, or let’s say sustainability of its growth as well prior to the perp g period (sustainability relating to a required return which reflects risk as you alluded to earlier). So if starting from 6.5% (again very rare for a company growing 10% top line which should say something about simply using present FCF yield to say that’s the return I’ll get), combining that with high growth and what I believe to be sustainable growth based on strong competitive positioning and secular megatrends, the return will be north of 6.5%. My hope with AVGO is that a tech rotation knocks it down again and I can continue to add. Full disclosure my current basis is $360ish which looking back was obscenely attractive.",
        "created_utc": 1615685889,
        "id": "gquv9wq",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615714689.0
    },
    {
        "author": "No_Werewolf_1214",
        "body": "Be nice to see them all recover a bit (my April NVDA calls were hurting today), but AVGO should beat earnings so hopefully they get a pop out from the noise of day-long red slides",
        "created_utc": 1614813517,
        "id": "gplblwm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614842317.0
    },
    {
        "author": "MyopiaCapital",
        "body": "AVGO is a great long term hold",
        "created_utc": 1614895625,
        "id": "gppdwlr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614924425.0
    },
    {
        "author": "mend0k",
        "body": "Don't forget these:\nAVGO, AMD, TSM, NEE",
        "created_utc": 1615176328,
        "id": "gq6cqnz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615205128.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  3rd of March\n\n\n\n## Upcoming events for Wednesday, March  3rd\n\n - Stock splits:\n\n    - CLWT @ **3:2** (Payable date: 03/02/2021)\n\n - Expected earnings:\n\n  ACU, AEGN, AEO, AMPE, APT, ASM, ATTO, BBSI, BDR, BF.A, BF.B, BKCC, BKTI, BLCT, BMA, BQ, BXC, CECE, CETX, CFMS, CIX, CLMT, CMTL, CNR, CORR, CTRM, CULP, CZZ, DAKT, DLTR, DPW, DSGX, DY, ENIC, EQX, EVGN, EYE, EYEG, FLMN, FTHM, GHLD, GIFI, GMRE, GPRK, GRP.U, HBB, HDSN, HGEN, HPR, HRTG, IMTX, ISEE, ITRN, JILL, KERN, KIDS, KRON, LINC, MDRR, MESO, MLR, MRVL, MTLS, MYRG, NAV, NC, NEWT, NFH, NM, NMCI, NWPX, OGEN, OKTA, OM, ONCR, OPTN, OSW, OXSQ, PASG, PCOM, PDCO, PNRG, PW, RAIL, RCMT, RDHL, RMNI, RNET, RPTX, RRGB, SBBP, SBOW, SD, SID, SINA, SLNO, SMHI, SNOW, SPKE, SPLK, SPRB, SQM, STKL, SUPV, TAC, TAST, TCOM, TPCO, TPVG, TSHA, UFPT, USDP, VNET, VRM, VRTV, WB, WEN, WHLR, WMC, WPG, WTI, YEXT\n\n - Ex-div:\n\n  ALL, AWI, EQH, ES, ESBK, FANG, FWRD, GLOG, LEA, LZB, MBCN, MOS, NLSN, PTEN, QCOM, RMBI, SSTK, VNOM\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 177K, previous: 174K)\n    - Beige Book\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: 0.249M)\n    - Crude Oil Inventories (consensus: -0.928M, previous: 1.285M)\n    - Cushing Crude Oil Inventories (previous: 2.807M)\n    - Distillate Fuel Production (previous: -0.953M)\n    - EIA Refinery Crude Runs  (previous: -2.589M)\n    - EIA Weekly Distillates Stocks (consensus: -3.035M, previous: -4.969M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 4.6%, previous: -14.5%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Kaplan Speaks\n    - Gasoline Inventories (consensus: -2.300M, previous: 0.012M)\n    - Gasoline Production (previous: -1.295M)\n    - Heating Oil Stockpiles (previous: 0.093M)\n    - ISM Non-Manufacturing Business Activity (consensus: 60.0, previous: 59.9)\n    - ISM Non-Manufacturing Employment (previous: 55.2)\n    - ISM Non-Manufacturing New Orders (previous: 61.8)\n    - ISM Non-Manufacturing PMI (consensus: 58.7, previous: 58.7)\n    - ISM Non-Manufacturing Prices (previous: 64.2)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -11.4%)\n    - MBA Purchase Index (previous: 264.9)\n    - Markit Composite PMI (consensus: 58.8, previous: 58.7)\n    - Mortgage Market Index (previous: 790.6)\n    - Mortgage Refinance Index (previous: 3,848.1)\n    - OPEC Meeting\n    - Services PMI (consensus: 58.9, previous: 58.3)\n\n## Upcoming events for Thursday, March  4th\n\n - Stock splits:\n\n    - MYBF @ **105:100** (Payable date: 03/15/2021)\n    - TR @ **103:100** (Payable date: 04/02/2021)\n    - TROLB @ **103:100** (Payable date: 03/26/2021)\n\n - Expected earnings:\n\n  ABUS, ACOR, ADCT, AE, AFIB, AGS, AHCO, AIV, AJX, AKUS, ALXO, AMC, AMTI, ANIK, AQN, ARGX, ASPS, AT, ATC, ATEC, ATHA, AUTL, AVGO, AVGR, BALY, BCOW, BJ, BPMP, BSGM, BURL, BYFC, BZUN, CBIO, CBMB, CCCC, CDAK, CELP, CERT, CHMA, CHMI, CHUY, CIB, CIEN, CIR, CLLS, CLPT, CLXT, CNQ, COHN, COO, COST, CRAI, CRD.A, CRD.B, CRVS, CTSO, CVV, CZNC, DBVT, DMTK, DNN, DRRX, DSSI, DXYN, DYN, EGLE, ELOX, ENZ, ESGC, ETON, EVC, EVFM, EVLO, EYPT, FBRX, FCRD, FIZZ, FLGT, FMTX, FOUR, FPRX, FRGI, FTSI, FULC, GAU, GBLI, GCP, GDYN, GMS, GOL, GPL, GPMT, GPS, GRAY, GSAT, GSL, GWRE, GWRS, HCM, HEAR, HOLI, HRMY, IDT, IMAX, IMMR, INMB, INVE, INZY, ISDR, ISIG, ITOS, JAMF, JG, JW.A, JW.B, JYNT, KBNT, KDMN, KR, KYMR, LRMR, LTRN, MANU, MAXN, MAYS, MCS, MDLA, MEG, MEI, MIK, MLVF, MMX, MOSY, MTCR, MWK, MYSZ, NCMI, NEW, NKSH, NKTX, NNA, NRP, NTCO, NTST, NVIV, NX, OBLN, OBSV, ODC, OPEN, OPNT, ORIC, ORTX, PACK, PBLA, PCVX, PHI, PLYA, PQG, PRPL, PSTX, PVAC, QTT, QUMU, RFL, RLH, RVMD, SALM, SCM, SCOR, SCPE, SDC, SDGR, SENS, SFE, SHG, SHIP, SIGA, SMLP, SMSI, SOHO, SOLY, SPPI, SQFT, SRG, SRLP, STLA, STON, SWBI, SYN, SYRS, TARA, THRY, TLS, TMBR, TOMZ, TRIN, TTC, TTOO, TWI, VBIV, VERI, VLGEA, VNRX, VRAY, VSEC, VTRS, VYNE, WPP, WRAP, WVE, XFOR, YPF\n\n - Ex-div:\n\n  AFB, AGR, AJG, AMNB, BAC, BBL, BLK, BOTJ, BRKR, BRKS, CASS, CHRW, D, DAN, DEA, DRD, EPC, FLIR, FLO, FNB, FRME, GBDC, GPC, HSII, ICBK, KMB, KNX, LIN, MBWM, NAVI, NCB, NUW, NVS, OC, PCH, PEP, PTVCA, PTVCB, RF, RIO, SAFT, SCL, SEE, SLM, TEX, TFX, TGNA, TR, TRST, TT, UFCS, WEN, WING, WY\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.035%)\n    - 8-Week Bill Auction (previous: 0.040%)\n    - Challenger Job Cuts (previous: 79.552K)\n    - Continuing Jobless Claims (consensus: 4,300K, previous: 4,419K)\n    - Durables Excluding Defense (previous: 2.3%)\n    - Factory Orders (consensus: 2.1%, previous: 1.1%)\n    - Factory orders ex transportation (previous: 1.4%)\n    - Initial Jobless Claims (consensus: 750K, previous: 730K)\n    - Jobless Claims 4-Week Avg. (previous: 807.75K)\n    - Natural Gas Storage (consensus: -333B, previous: -338B)\n    - Nonfarm Productivity (consensus: -4.7%, previous: -4.8%)\n    - OPEC Meeting\n    - Unit Labor Costs (consensus: 6.6%, previous: 6.8%)\n\n## Upcoming events for Friday, March  5th\n\n - Stock splits:\n\n    - APH @ **2:1** (Payable date: 03/04/2021)\n\n - Expected earnings:\n\n  AAMC, AIM, ALUS, ANAT, ARDX, ATLC, ATLO, AYRO, BH.A, BHAT, BIG, BORR, BPTH, BRID, CCNC, CEI, CHEK, CLPS, CMPI, COE, COMS, CRH, DS, DXPE, EML, EXN, FENC, FGBI, FHTX, FSEA, FSTX, GGAL, GLP, GSX, HIBB, HMG, HURC, HUSA, IMRA, INBX, INTT, IPDN, ITCB, KB, KMPH, KVHI, MIST, NBAC, NWLI, OFS, OLB, ONCY, PCSA, PDLB, PLPC, PMVP, PNBK, PPSI, PRPO, PSO, PTMN, RUTH, SAMG, SPLP, STRR, STTK, SUP, TGS, UBOH, VET, VSTA\n\n - Ex-div:\n\n  ANAT, BF.A, BF.B, CCBG, CDK, CNS, EVRG, EXC, FAF, FDX, GE, HBB, HL, HTGC, HWC, JBT, JKHY, JOE, KSU, LUMN, LYB, NC, OAS, OMP, PATK, PBIP, RTLR, STRA, SVBI, SYX, TPL, TROX, UGP, VALE\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 5.3%, previous: 5.4%)\n    - Average Hourly Earnings (consensus: 0.2%, previous: 0.2%)\n    - Average Weekly Hours (consensus: 34.9, previous: 35.0)\n    - CFTC Aluminium speculative net positions (previous: 4.7K)\n    - CFTC Copper speculative net positions (previous: 75.4K)\n    - CFTC Corn speculative net positions (previous: 529.8K)\n    - CFTC Crude Oil speculative net positions (previous: 511.8K)\n    - CFTC Gold speculative net positions (previous: 215.7K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.4K)\n    - CFTC Natural Gas speculative net positions (previous: 28.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -31.3K)\n    - CFTC Silver speculative net positions (previous: 47.6K)\n    - CFTC Soybeans speculative net positions (previous: 239.8K)\n    - CFTC Wheat speculative net positions (previous: 27.4K)\n    - Consumer Credit (consensus: 12.00B, previous: 9.73B)\n    - Exports (previous: 184.20B)\n    - Government Payrolls (previous: 43.0K)\n    - Imports (previous: 252.30B)\n    - Manufacturing Payrolls (consensus: 12K, previous: -10K)\n    - Nonfarm Payrolls (consensus: 180K, previous: 49K)\n    - Participation Rate (previous: 61.4%)\n    - Private Nonfarm Payrolls (consensus: 194K, previous: 6K)\n    - Trade Balance (consensus: -67.50B, previous: -66.60B)\n    - U.S. Baker Hughes Oil Rig Count (previous: 305)\n    - U.S. Baker Hughes Total Rig Count (previous: 397)\n    - U6 Unemployment Rate (previous: 11.1%)\n    - US Federal Budget (previous: -430.0B)\n    - Unemployment Rate (consensus: 6.3%, previous: 6.3%)\n\n^^^^2021-03-03",
        "created_utc": 1614769221,
        "id": "gpisq8x",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1614798021.0
    },
    {
        "author": "hopefuldepression",
        "body": "i pulled a stupid boomer move and used 80% of my crap money on avgo, guess the other 20% can show rkt some love",
        "created_utc": 1614719724,
        "id": "gpgkru1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614748524.0
    },
    {
        "author": "MogollonVariation",
        "body": "How much depreciation does $AVGO have left? They cant not pay taxes forever😅😅",
        "created_utc": 1615834272,
        "id": "gr1j8rh",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615863072.0
    },
    {
        "author": "MicroChapLong",
        "body": "Ok, if you can tell me hundreds of cheap stocks behind a cursory book value and PE I’d love to hear. I obviously cannot write a 500 word essay on Broadcom here. Generally investors just appreciate the facts to pique their interest and can look into a bit more. If you want a full thesis you can read my seeking alpha syndicated article on $axti and drop your negative comments there as well.",
        "created_utc": 1615672090,
        "id": "gqu7b5x",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615700890.0
    },
    {
        "author": "Spectacle_Maker",
        "body": "I’m loving semis here. ON is my favorite, but I am also long NVDA, AVGO, SWKS, MCHP, and ACEV.",
        "created_utc": 1615691309,
        "id": "gqv468i",
        "score": 1,
        "subreddit": "options",
        "created": 1615720109.0
    },
    {
        "author": "bjguuc",
        "body": "No what I’m saying has nothing to do with corporate finance in the classroom. I never took one of those thank God. Anyway: what do you think AVGO would earn for you if you owned the whole business over the next 5 years? Ballpark obviously",
        "created_utc": 1615699429,
        "id": "gqvg41h",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615728229.0
    },
    {
        "author": "miscsubs",
        "body": "This list is worse than just posting the components of SOXX.\n\nLike who in their right minds (fab or no fab) talks about MSFT in the semi space? Or even Apple? They don't sell any of their chips. Nobody buys AAPL for their chip revenue. And LOL, having IBM in there, who had to *pay* GF to take their fabs off their hands.\n\nThere's Broadcom but no Qualcomm. There's Skyworks but no Qorvo. The list is so bad I kind of feel like it's a troll post. But probably not.",
        "created_utc": 1615221552,
        "id": "gq85nwp",
        "score": 1,
        "subreddit": "investing",
        "created": 1615250352.0
    },
    {
        "author": "No_Werewolf_1214",
        "body": "No such thing as a sale - Never about decrease from current highs, always about where a stock is headed and how much growth it had ahead of it over the next 6-8 months. If it ain’t growing more than S&amp;P over that time then it ain’t ready. \n\nAnd those two (AVGO and NVDA) are the only ones that aren’t already pushing against the top of their current value (in my opinion), so those are your best bets on the upswing.",
        "created_utc": 1615255181,
        "id": "gqa61wl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615283981.0
    },
    {
        "author": "space1233123",
        "body": "Add avgo",
        "created_utc": 1615610337,
        "id": "gqrq9dt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615639137.0
    },
    {
        "author": "wearahat03",
        "body": "TSM is good but way overhyped.\n\nRevenue in 2016 - 949\n\nRevenue in 2020 - 1340\n\n9% revenue growth p.a. \n\nASML 19% p.a.\n\nNVDA 24% p.a.\n\nINTC 7% p.a.\n\nAMD 23% p.a.\n\nAMAT 12% p.a.\n\nAVGO 16% p.a.\n\nBeing the technological leader doesn't mean the company is the best investment. \n\nIn terms of stock price performance, TSM has been outperformed by NVDA, AMD, ASML and AMAT.\n\nIt's only grown revenues by 2% more than Intel per year for the past 4 years. \n\nIf you measure EPS growth the story changes too, to the detriment of TSM.\n\nINTC 22% p.a.\n\nAMAT 29% p.a.\n\nNVDA 29% p.a.\n\nASML 23.5% p.a\n\nTSM 11.5% p.a\n\nOther semis have done a better job not only in revenue growth but in their expenses / capital management. \n\nEven with technological leadership, I would rank them on the same level as Intel. What's the point of tech leadership if you don't translate it into revenues and profits?\n\nIntel has lagged in tech but they're still able to grab revenues and profits. \n\nThe best companies are AMD, NVDA, ASML because they not only deliver on tech but they translate it into growing revenues and profits.",
        "created_utc": 1615822042,
        "id": "gr0rmad",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615850842.0
    },
    {
        "author": "DinglerBerries",
        "body": "if you lost money in 2020 dont use turbotax. Just bought that shit and it couldnt even file my taxes. Dumb ass intuit",
        "created_utc": 1615263433,
        "id": "gqakp2i",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615292233.0
    },
    {
        "author": "anachronofspace",
        "body": "let me guess, your parents own intuit, and your job is \"engineering\" good tax outcomes.",
        "created_utc": 1614718342,
        "id": "gpghhmv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614747142.0
    },
    {
        "author": "Kidwithtictac",
        "body": "Retard, Intuit owns Turbotax, not RKT.",
        "created_utc": 1614710620,
        "id": "gpfze3z",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614739420.0
    },
    {
        "author": "AngelaQQ",
        "body": "ZM has a P/E less than Starbucks and a forward P/E comparable to Chipotle.\n\nIt has a market cap lower than ServiceNow and Intuit, two companies that do project management worksheets and tax forms! \n\nI swear some of you have no idea what you are talking about.",
        "created_utc": 1615397752,
        "id": "gqgwmir",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615426552.0
    },
    {
        "author": "Pursynthemumphthisis",
        "body": "RKT is not INTU",
        "created_utc": 1614711054,
        "id": "gpg0erl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614739854.0
    },
    {
        "author": "youre-not-real-man",
        "body": "Yes. TA doesn't even have to be well understood to intuit what outcomes are more likely. If you're looking at a chart at all, you're doing TA whether you realize it or not.",
        "created_utc": 1615656764,
        "id": "gqtegmz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615685564.0
    },
    {
        "author": "The_Folkhero",
        "body": "It is a core holding of mine. Along with INTU and ADBE, I consider CRM a \"baby FAANG.\" I added on this dip. Goldman just added CRM to its conviction list with 49% potential upside:\n\nhttps://www-thestreet-com.cdn.ampproject.org/v/s/www.thestreet.com/.amp/investing/goldman-adds-microsoft-coupa-salesforce-to-conviction-list?amp_gsa=1&amp;amp_js_v=a6&amp;usqp=mq331AQHKAFQArABIA%3D%3D#amp_tf=From%20%251%24s&amp;aoh=16153784304473&amp;referrer=https%3A%2F%2Fwww.google.com&amp;ampshare=https%3A%2F%2Fwww.thestreet.com%2Finvesting%2Fgoldman-adds-microsoft-coupa-salesforce-to-conviction-list",
        "created_utc": 1615378689,
        "id": "gqfs5wv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615407489.0
    },
    {
        "author": "cityoflostwages",
        "body": "Hi, for tax questions please check out /r/tax in the future. If you use turbotax, creditkarma, or freetaxusa you'll use that document to enter in your capital gains/losses or dividend/interest in the appropriate section of your tax return. The turbotax/intuit website q&amp;a section can be a resource as well. thanks.",
        "created_utc": 1615258990,
        "id": "gqacz0d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615287790.0
    }
]