[
    {
        "author": "KingIshmael",
        "body": "Big institutions tend to go long when they hold sizable stakes. They almost have too. If an institution like BR or Berkshire were to randomly dump a stonk without a solid justification, the SEC could/ would fine them for market manipulation because of the ripples made in the share holder confidence and market indexes. Large firms have to generally have a packet of DD for every move they make.",
        "created_utc": 1618961144,
        "id": "gv9i5bx",
        "score": 8,
        "subreddit": "stocks",
        "created": 1618989944.0
    },
    {
        "author": "LostSoil12",
        "body": "OCGN bag holders letting go br br",
        "created_utc": 1619205286,
        "id": "gvlmamz",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1619234086.0
    },
    {
        "author": "theGreekcarpenter",
        "body": "Wtf do expect.  The street got there hands on they'll rape n pillage the village.  \n\nUp over 100% br bell yesterday now 50%.",
        "created_utc": 1619610272,
        "id": "gw5td7q",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1619639072.0
    },
    {
        "author": "_pizzashit",
        "body": "And tumors in our br.... nvm ape no brain have.",
        "created_utc": 1618439572,
        "id": "gujhvnf",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1618468372.0
    },
    {
        "author": "jerrvizu",
        "body": "money printer go br—-r————-rr x Error",
        "created_utc": 1618989367,
        "id": "gvas7j9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1619018167.0
    },
    {
        "author": "AmericanHerstoryX",
        "body": "no stock plays this week just spent a decent chunk of change on spring/summer wedding attire\n\nwas able to get an impressive number of pieces for just a few hundred bucks though at Gap, BR, and Old Navy so go long GPS",
        "created_utc": 1618796379,
        "id": "gv18fex",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1618825179.0
    },
    {
        "author": "Laearo",
        "body": "There wasn't really much of an existing base, it kind of flopped, they saw how many players PUBG had and made it a BR too and that's when it blew up",
        "created_utc": 1617288595,
        "id": "gt1bg68",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617317395.0
    },
    {
        "author": "astro_maguseven",
        "body": "BR’s often serve as effective testing grounds for a new game, and then the developers realize they can just release a BR and make plenty of money",
        "created_utc": 1617912903,
        "id": "gtunlj6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617941703.0
    },
    {
        "author": "BeerBatAIDS",
        "body": "I thoroughly enjoyed it. It's really akin to the old godzilla movies. \n\nA forgettable human story with some action and, in this case, humor. Monsters fighting a bunch for some reasons. \n\nBig monster fight at the end. \n\nAnd science mumbo jumbo. \n\nPeople trying to analyze this movie like it's fuckin citizen cane are the real retards. Like holy shit you must br fun at parties lmao",
        "created_utc": 1617638881,
        "id": "gtgt9or",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617667681.0
    },
    {
        "author": "LingPhilLat",
        "body": "BR🔊H \nFucc this. Gonna just do TCGs now 🤬\nLong on gme tho 💎🙌🚀",
        "created_utc": 1618944645,
        "id": "gv8g0kx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618973445.0
    },
    {
        "author": "Hugeloser",
        "body": "Yep 3 br at least if you plan to have a family.",
        "created_utc": 1618621260,
        "id": "gush5aj",
        "score": 2,
        "subreddit": "stocks",
        "created": 1618650060.0
    },
    {
        "author": "Flying_madman",
        "body": "NGL, I'm back except for when I need to do stuff BR can't do",
        "created_utc": 1617751534,
        "id": "gtmmlyr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617780334.0
    },
    {
        "author": "VastConsideration4",
        "body": "br r fk",
        "created_utc": 1618781547,
        "id": "gv0fx6f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618810347.0
    },
    {
        "author": "silentxobserver",
        "body": "You are correct. I know this isn't necessarily surprising, since BR and Vanguard have large amounts of capital and are massive players.\n\nIts just a little weird considering the timing of this community finding/highlighting the IEX and the \"issues\" that occurred the following day...\n\nPlus some of the mutual funds, like the iShares Russell 2000 being among them.\n\nI know this isn't the smoking gun, and its not meant to be. Just trying to help build the puzzle.",
        "created_utc": 1618416066,
        "id": "gui14sr",
        "score": 2,
        "subreddit": "Wallstreetbetsnew",
        "created": 1618444866.0
    },
    {
        "author": "___alexa___",
        "body": "ɴᴏᴡ ᴘʟᴀʏɪɴɢ: [Touch The Sky (From &amp;quot;Br](https://www.youtube.com/watch?v=-8Q_OpCE-4k) ─────────⚪───── ◄◄⠀[▶](https://www.youtube.com/watch?v=-8Q_OpCE-4k)⠀►►⠀ 1:41 / 2:32 ⠀ ───○ 🔊 ᴴᴰ ⚙️",
        "created_utc": 1618428794,
        "id": "guiu9sq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618457594.0
    },
    {
        "author": "d_rek",
        "body": "Built 5 years ago. Modest 1600sq 3 br 2bath ranch on 4 acres. All in cost to build was $250k excluding land purchased with cash (20k) Already have half of total cost in equity! Crazy!",
        "created_utc": 1618589353,
        "id": "guqlqae",
        "score": 2,
        "subreddit": "stocks",
        "created": 1618618153.0
    },
    {
        "author": "cyreneok",
        "body": "what you got going br",
        "created_utc": 1617325623,
        "id": "gt3g93y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617354423.0
    },
    {
        "author": "SantaMonsanto",
        "body": "I’ve reached out to both RH and TD. \n\nRH told me that once an official date and time has been announced they’ll be disseminating information to any eligible shareholders.\n\nTD essentially said the same. They work through a third party (Broadridge) and said once the meeting has been set they will reach out with info.",
        "created_utc": 1617921925,
        "id": "gtv7lb6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617950725.0
    },
    {
        "author": "Modswithnobods",
        "body": "Good counter DD. Those numbers could still be legit. Not required to update until EOM or May.\n\n&amp;#x200B;\n\nPS: Those companies could have legit funds t hat are classified to report under FMR and BR. Remember Big Short? Baum's fund reported under ML. ML probably had a similar reporting to FINRA where it had multiple reports under its name.",
        "created_utc": 1618406401,
        "id": "guhg0pp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618435201.0
    },
    {
        "author": "KanefireX",
        "body": "Not sure why the downvotes. I thought it was a \"fill in the blanks with the only right answer\" too. Here's my vote. I am xx holder and I have a sneaking suspicion that dfv, rc, and br might have orchestrated this. I could give two shits though b/c even if no squeeze, it will take the collapse of the market to drive that stock down now.",
        "created_utc": 1618974460,
        "id": "gva7poz",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1619003260.0
    },
    {
        "author": "Brunoxxxx10",
        "body": "\n\n\nhttps://m.kwai.me/activity/invite-share?page=invitation&amp;source=COPY_LINK&amp;userId=150000223307306&amp;countryInfo=br&amp;language=pt-BR&amp;sourcePlatform=ANDROID&amp;fishId=br-default&amp;share_id=ANDROID_3054ba7746fd48d0_1618764038238",
        "created_utc": 1618765697,
        "id": "guziywp",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1618794497.0
    },
    {
        "author": "Dolancorp",
        "body": "See how much this 5/7 TWTR 50p is gonna br worth lol",
        "created_utc": 1619735996,
        "id": "gwctge4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619764796.0
    },
    {
        "author": "Bottle_Only",
        "body": "Where are you people living? Houses are up 46% march 2020 to march 2021 here, food is up 20%. 1 Br apartments are $1680 utilities not included and parking is extra.\n\nI'm looking to flee Ontario. Overall cost of living is increasing at like 30% a year here. The barrier to entry for society (move out) without taking on irresponsible levels of debt is hitting over a quarter million and that's just for a downpayment and 6 month safety net on a 700sq foot condo.",
        "created_utc": 1617795401,
        "id": "gtodiyy",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1617824201.0
    },
    {
        "author": "Nihaohonkie",
        "body": "We can hope. It only goes brrrr 1/5 days and it’s more like a br than a brrrrrr",
        "created_utc": 1617783839,
        "id": "gto0j4k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617812639.0
    },
    {
        "author": "Jojonaro",
        "body": "I can’t concentrate when the market is on and as an European it starts at 15.30 and finishes at 22 lmao\n\nI’ll put a screen especially to follow tickers in the future. \n\nDoing a squat BR while screaming GREEN DILDOS BABY COME ON ONE MORE” sounds incredible",
        "created_utc": 1618402520,
        "id": "guh97dd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618431320.0
    },
    {
        "author": "EatMePlsDaddy",
        "body": "Why is everything a battle royale?\n\nJust saw a Pacman Royale.\n\nA few months ago I saw Resident Evil as a BR.\n\nWho did this",
        "created_utc": 1617912810,
        "id": "gtundqt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617941610.0
    },
    {
        "author": "VastConsideration4",
        "body": "Br r fk",
        "created_utc": 1617590553,
        "id": "gtevqk3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617619353.0
    },
    {
        "author": "HuntingBears1",
        "body": "Good post, thanks. Little quibble: is what you describe as literal pump and dumps, actual pump and dumps? A pump and dump is when you pump up a stock and then sell it when everyone’s bought in. You’re talking about BR buying some stocks and selling others. That’s not a pump and dump.",
        "created_utc": 1617374896,
        "id": "gt58vlh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617403696.0
    },
    {
        "author": "pWheff",
        "body": "Presumably that $$$ is from sales on the NZX so it isn't converted in that direction.  If BR goes outside NZX to spend it then you'll pay that forward conversion I suppose but I assume BR gets attractive rates...",
        "created_utc": 1618834003,
        "id": "gv2m50a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618862803.0
    },
    {
        "author": "FrankCarmody",
        "body": "totally br🤡",
        "created_utc": 1619620909,
        "id": "gw6dmpq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619649709.0
    },
    {
        "author": "gapuzl",
        "body": "Depends on the stock and why is it falling. If you believe it will go up then don't wait it goes lower. Just set yourself limits when do you add more. \n\nWhat I personally do is, I wait for 20-30% drop if this happens (example m....med) I sell all so I get back the lost tax I have already paid with some profit taking from other stocks (located in Austria). Then I immediately buy back + invest the returned tax + add some of my funds. \n\nIt works wonders. Managed to Rebuy m..med just before the latest bull run. Already up 100% with the add on part of the holdings. \n\nJust my tactic. \n\nBR,\nG",
        "created_utc": 1619442334,
        "id": "gvxbh96",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619471134.0
    },
    {
        "author": "Laxhobo2002",
        "body": "Still haven't received the typical email notification from Fidelity re: THCB -- any other Fidelity users experiencing the same thing? They're typically pretty good about this -- at least, that's been my experience with SPAC mergers thus far.\n\nI checked the ProxyVote/Broadridge portal too, and I'm still not seeing THCB as an option...",
        "created_utc": 1617735580,
        "id": "gtlo1hg",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1617764380.0
    },
    {
        "author": "racertim",
        "body": "I just did this a couple years ago. I had certificates shared and lost them. It’s about $10 to request a replacement certificate and in the same request I mailed in a request to convert them to digital so I could sell them. The forms are on the broadridge site. Then you can sell the certificates too.",
        "created_utc": 1618401488,
        "id": "guh7map",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618430288.0
    },
    {
        "author": "Hohoinkyouma",
        "body": "Its not that hard to impress kids, sure its a scam but so is life. I will say this though their top grossing games are pretty mindless but its what people like, just like how YouTube has garbage content like logan paul, dream and sssniperwolf on their front page roblox has these, you can essentially search for your niche game so it's essentially a platform of creativity such as YouTube. \n\n&gt;you can be around without making money\n\nNo you can't, when a game is unproffitable companys will , firstly stop updating their game, and then once the player base dwindles shut down their studios happens with MMOs all the time. Roblox has had massive engine improvements over the time and you can essentially play with console like graphics on some games. A good example of what failuted look like are the overwatch and BR games that never popped off.\n\nAnd for the last point, really only upper middle class parents would be involved or  give a shit about what their kids consume, as most just want a baby sitter, the average age for watching pornography is 12 so that says something about the supervision of parents on their kids usage of internet.",
        "created_utc": 1618470773,
        "id": "gukx9rb",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1618499573.0
    },
    {
        "author": "theimpolitegentleman",
        "body": "Wait we aren't all using BR/htown as our fundy analyis? Fuck",
        "created_utc": 1617477842,
        "id": "gt9vtw5",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1617506642.0
    },
    {
        "author": "Bitter-Rent-6878",
        "body": "That is DD on Dixie Brands/BR BRANDS",
        "created_utc": 1619630790,
        "id": "gw71c4l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619659590.0
    },
    {
        "author": "Throwawayullseey",
        "body": "Yes. Legitimate ones, at least. It seems like it would br a really bad thing for your shareholders if you put all your money on other businesses? Cascading failure over confidence loss seems super smart. /s",
        "created_utc": 1619452389,
        "id": "gvxx34q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619481189.0
    },
    {
        "author": "Artavioyonk",
        "body": "Br fearful when others are greed - Boomer Buffet",
        "created_utc": 1617919383,
        "id": "gtv296e",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1617948183.0
    },
    {
        "author": "greensymbiote",
        "body": "Because those are the primary fintechs in the same space. Some of which have slower growth, smaller margins or no profit at all while still commanding higher multiples. Unlike most fintechs Paysafe has a big exposure in live sporting events and brick and mortar retail which was completely shut down in 2020 due to Covid.  In a call with analysts they discussed their decision to keep revenue growth projections in line with the fintech market at large which is 11%.  They are deliberately leaving their M&amp;A plans out of their projections as well as their expected growth in US igaming.  \n\nThis is in keeping with Chairman of the Board Bill Foley's style which has been described as under promise and over deliver.  Many are betting on the growth of this company based on Foley's proven track record.  In just the last five years, Foley and his team grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B) and Black Knight 8.7X ($1.6B to $14B). He also grew Fidelity National Information Services 36.4X ($2.5Billion to over $91Billion). Foley recently said, “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.”",
        "created_utc": 1617589847,
        "id": "gteuj70",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617618647.0
    },
    {
        "author": "Bengbab",
        "body": "Buy IBM",
        "created_utc": 1617309722,
        "id": "gt2lv3u",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617338522.0
    },
    {
        "author": "stanky_puss",
        "body": "You joke, but $IBM and stocks like it are a fucking cash cow. Super low IV so day trading calls on the dips is super profitable",
        "created_utc": 1617294201,
        "id": "gt1nue9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617323001.0
    },
    {
        "author": "HogtownHoedown",
        "body": "Everyone wants Palantir to be the next google but they're actually going to be the next IBM",
        "created_utc": 1617294161,
        "id": "gt1nr44",
        "score": 1,
        "subreddit": "investing",
        "created": 1617322961.0
    },
    {
        "author": "xAsruo",
        "body": "Is Hong kingv ibm really margin called??",
        "created_utc": 1617271575,
        "id": "gt0jpqw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617300375.0
    },
    {
        "author": "BenRobNU",
        "body": "I'll add that I am bullish on PLTR for their ability to win government data science contracts consistently and their partnership with IBM. A lot of companies use IBM consultants to advise on purchasing decisions and they clearly have some secret sauce that wins over government contracts that I don't have insight to.  \n\n\nI should clarify that I'm not an IBM employee either.",
        "created_utc": 1617389843,
        "id": "gt62x7o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617418643.0
    },
    {
        "author": "redditspeechcensor",
        "body": "In 2020, I collected dividends from the following holdings that I have since liquidated this year: ARR, DOW, EPD, GEO, GIS, IBM, IRM, JPM, MMP, PM, SKT, STX, T, TNL, VZ, VER, XOM.\n\nIn 2020, I collected dividends from the following holdings that I continue to hold: EPR, MO, SMHB.\n\nSo why did I sell some of the best dividend stocks the market has to offer after literally buying them in March/April of 2020 at the bottom?  Great question.  Maybe the better question is why did I keep those 3?  \n\nThe answer is because I still see great share price growth value ahead of both EPR and MO though for different reasons and the SMHB yield (based on pre covid historicals) could yield as high as 72% based on my purchase price.  Though I only collected 10.14% in 2020 and 6.82% so far in 2021.  EPR has yet to reinstate its dividend and I fully expect that when they do, their share price will see a large upward move.  And MO?  Well... it is my opinion that Altria is uniquely positioned to be the largest player in the budding legalized marijuana industry in the USA.  So obviously I will hold that until such a time when that new industry can be realized and profited from and pocket a 9.54% yield (2020 actual) in the meantime.\n\nBut the reality is, I didn't buy some of the best dividend paying companies at the 2020 bottom because I wanted the dividend.  In fact... dividend investing is mostly a waste of time unless you plan on buying and forgetting... in which case... it still is since you'd be better off in an index fund.",
        "created_utc": 1617518063,
        "id": "gtbokqe",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617546863.0
    },
    {
        "author": "raouldukesaccomplice",
        "body": "&gt; IBM\n\nThere are probably so many naive young graduates who agree to work there because they associate the brand with being an innovative blue-chip company, or maybe they heard stories from older people about how great of a place to work it was (back when it actually was).\n\nIs there even any cachet left to having IBM on your resume?",
        "created_utc": 1617573011,
        "id": "gte0jwl",
        "score": 1,
        "subreddit": "investing",
        "created": 1617601811.0
    },
    {
        "author": "GoBucks4928",
        "body": "I know a lot of hiring managers who think having IBM is a bad sign for the resume. That being said personally I would never use work experience against someone no matter the name",
        "created_utc": 1617576709,
        "id": "gte7g0j",
        "score": 1,
        "subreddit": "investing",
        "created": 1617605509.0
    },
    {
        "author": "fat_cindy",
        "body": "Checking Glassdoor reviews isn’t silly at all, it’s smart. Reading Glassdoor reviews really helped steer me away from IBM and other companies.",
        "created_utc": 1617550418,
        "id": "gtcsxq4",
        "score": 1,
        "subreddit": "investing",
        "created": 1617579218.0
    },
    {
        "author": "jammingnslammin",
        "body": "Forgot to mention IBM. Bought it under 113$ and waiting for the possibility of the spinoff by year's end. Hefty dividend. 🤞👍🙏",
        "created_utc": 1617506313,
        "id": "gtb9dwb",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617535113.0
    },
    {
        "author": "Current_You3673",
        "body": "IMBBY 8.84%, IRM 6.63%, IBM 4.89%, ABBV 4.79%",
        "created_utc": 1617507929,
        "id": "gtbbv2u",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617536729.0
    },
    {
        "author": "HeckleHelix",
        "body": "$IBM is on my \"buy\" list for AI, I just need to ID my entry point &amp; commit some cash",
        "created_utc": 1617583795,
        "id": "gtejzqp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617612595.0
    },
    {
        "author": "DataOverGold",
        "body": "Agree with this! I use this tool to track employee reviews.  \n[https://dillibits.com/?t=IBM&amp;h=employee\\_rating](https://dillibits.com/?t=IBM&amp;h=employee_rating)",
        "created_utc": 1617568325,
        "id": "gtdro3m",
        "score": 1,
        "subreddit": "investing",
        "created": 1617597125.0
    },
    {
        "author": "thehouseofcrazies",
        "body": "This type of growth is a real possibility. The short seller theises was that they are a government service provider therefore limiting the amount of growth but that has been proven wrong. Recent news about BP, IBM, AWS partnerships validates a commercial use for their software. This company is definitely going places...",
        "created_utc": 1617574580,
        "id": "gte3icb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617603380.0
    },
    {
        "author": "No-Dirt5778",
        "body": "Absolutely.   Started already with Disney, figured can't go wrong there.  May end up going with AAPL instead of IBM for the same reason.  Appreciate the reply!",
        "created_utc": 1617379458,
        "id": "gt5hyga",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617408258.0
    },
    {
        "author": "No-Development-130",
        "body": "This one is a patience stock, tis not gonna shoot up till it gets a large private vendor. while i like the Idea of getting involved with Governments i'm increasing thinking that Governments are going to be unable to fully move on from IBM and ORACLE systems in the short or medium term, and while PLTR can work with those systems I just don't see the full platform integration happing, which is what you need for those 22.00 to become 220.00 a share.   \n\n\nI own PLTR and i'm down roughly 15%",
        "created_utc": 1617326132,
        "id": "gt3h44z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617354932.0
    },
    {
        "author": "djpitagora",
        "body": "First public quantum computing company? Wtf? Have you researched this at all? Haven't seen such thin DD in a while.\n\n Right now I believe IBM is the leader in quantum, but there are quite a few others with their own designs. In any case the tech is very primitive for now and has no real use yet. Until we can talk of a few hundred or even thousands of qbits, this is a pipe dream.",
        "created_utc": 1617389772,
        "id": "gt62s67",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1617418572.0
    },
    {
        "author": "xAsruo",
        "body": "Is this about the Hong Kong ibm thing?",
        "created_utc": 1617271659,
        "id": "gt0jtkp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617300459.0
    },
    {
        "author": "MrBigWang420",
        "body": "He might be crazy but he phrased it pretty good in one his last interviews. Essentially it’s extremely hard to describe their software to people who are not software engineers. They have partnered with some the biggest/best software company’s of all time. These company’s know how hard it is to build what Palantir has built, they know how good of a product Palantir has. If fucking IBM and AWS and all these other MAJOR software company’s see how valuable Palantirs tech is, that’s good enough for me who doesn’t know what the fuck a stack or whatever integrated software they’ve come up with lol.",
        "created_utc": 1617383309,
        "id": "gt5psxs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617412109.0
    },
    {
        "author": "checkdateusercreated",
        "body": "INTC is the only one that offers a dividend. It's an aristocrat.\n\nThat literally binds their majority shareholder interest to the dividend income, with the share price having a minor role in everyday share movement.\n\nEDIT: Just look at IBM. I was looking at buying it for $100 in last year's crash. It rebounded, like a lot of things, but it didn't grow uncontrollably like so many stocks did last year. Instead, it just hung out at $125 all year. Dividend aristocracy.",
        "created_utc": 1617291745,
        "id": "gt1id9l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617320545.0
    },
    {
        "author": "C4Diesel",
        "body": "I thought that until IBM, which has their own AI they've been putting $10s of millions / year into pushing, said they're going to start integrating Palantir solutions for their data cloud customers.\n\nWhy would they do that unless the product itself did things Watson couldn't?\n\nThe tech is there, but getting people to essentially change ERPs is a slog. PLTR will eat \"dumb\" ERPs like SAP for breakfast.",
        "created_utc": 1617362410,
        "id": "gt4pmsd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617391210.0
    },
    {
        "author": "king_of_nothing0",
        "body": "Wait that seems really biased I mean do you not hear yourself? I owned a lot of Intel stock but AWS is moving to Arm Graviton chips and Apple left Intel for AMD’s M1 arm chips. \n\nThey’re hemorrhaging say center marketshare to AMD and this is before those Arm chips are even out. Same with Nvidia whose acquiring Arm and is going heavy on data centers as well.\n\nIntel is extremely important to the American government and military but at best that makes them IBM. If Intel doesn’t start manufacturing low energy chips to compete with Arm they could be in serious trouble years down the line don’t you think?",
        "created_utc": 1617398610,
        "id": "gt6k6wq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617427410.0
    },
    {
        "author": "hindumafia",
        "body": "Coinbase is not really a new tech company, its a old tech.\n\nIt should be valued similar to oracle or IBM.\n\nDex is going to destroy coinbase and all other centralized exchanges in about an decade.\n\nBetting on coinbase is betting against dex/new tech.",
        "created_utc": 1617420773,
        "id": "gt7msc1",
        "score": 1,
        "subreddit": "investing",
        "created": 1617449573.0
    },
    {
        "author": "SeekingHentai",
        "body": "PLTR is just IBM for gen z 🤡",
        "created_utc": 1617559952,
        "id": "gtdbl7d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617588752.0
    },
    {
        "author": "musicafishionado",
        "body": "If Nvidia does acquire ARM (highly unlikely) China would be blocked from making chips and they're not gonna react kindly. Take that as you will.\n\nThere is nothing stopping Intel and AMD from producing ARM chips except for themselves. They already have the licenses and will begin developing when ARM is past its infancy in the data center world. Let deeper pockets be the pioneers, let all the software transitions happen (x86 software is not compatible with ARM), then poach their engineers. Intel and AMD are sitting back and letting AWS and Apple try their hand at ARM on purpose.\n\nIBM thrived on providing services that were being phased out. x86 isn't going to be phased out this decade and Intel will begin ARM chip production for clients in 3 years. IBM is dying, Intel is 3 years away from the start of unrivaled growth and has potential to eventually surpass TSMC as the industry leader in chip production thanks to the gov/mil backing within 20 years.\n\nIf you're looking for big gains in the next 2-6 years Intel is probably not the stock for you. It's at a 13 P/E ratio because people perceive it like IBM which is fine with me, I'll keep adding.\n\nNo clue what TSMC will plan to do after 3nm to prevent stagnation. For now they are the leader but physics doesn't let you go smaller than 3nm, possibly 2nm. At 3 times less earnings per dollar than Intel and lacking vertical integration... I'll happily put my dollars to work in Intel.",
        "created_utc": 1617409546,
        "id": "gt742zz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617438346.0
    },
    {
        "author": "Adb6488",
        "body": "Breaker breaker, come in Earth, this is GME rocket ship 27. The hedgies fucked over the carbonator on engine 4, I'm going to try to refuckulate it and land on Juniper. Hopefully they got some space weed. Over.",
        "created_utc": 1618496213,
        "id": "gulux06",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1618525013.0
    },
    {
        "author": "Aelsar",
        "body": "All in 4/16 JNPR 26C\n\nLarge IHS on the daily and weekly chart. Expecting the breakout to bring us to 27-28 a share\n\nTo tendyland we go.",
        "created_utc": 1617313337,
        "id": "gt2tgo5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617342137.0
    },
    {
        "author": "Ironleg01",
        "body": "There are still reasonably valued equities. Mostly your usual value names, some older tech companies and there are few currently hated companies. \nValue ones are some defence names like GD or RTX, I think they are still cheap, there are others too. Then old tech companies (but not necessarily bad ones) are HPE, JNPR, CSCO and few others. Finally hated names (I love buying hated but good companies for cheap) are INTC, GM and few others. There are some special situations too (like VRSK still hasn't fully recovered) and internationally there are interesting equities as well priced cheap. Popular names are expensive but they are popular so... But if you look outside of what people talk about on Reddit you can find some value.",
        "created_utc": 1617914082,
        "id": "gtuqc5x",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617942882.0
    },
    {
        "author": "Formal_Ground",
        "body": "JNPR gonna moon so fucking hard Monday",
        "created_utc": 1617384324,
        "id": "gt5ruqv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617413124.0
    },
    {
        "author": "dr3amboy3657",
        "body": "Cramer said it once on taxes.  Don’t worry about not paying the taxes so much, the market might take care of that for you.  What that means is that say your stock is @100 and you sell now and pay 35% in taxes or hold it and the stock goes down to 70 anyway.  \n\nNow, the example is too simple but that’s the concept.  I like what the other OP said to reset your cost basis every now and then so it becomes more manageable.  It has become a huge problem for me too.   I too have massive long LGTC &gt;500k on a stock that I’m not sure I want to hold for the next 5 years just so I can sell ~100k a year to reduce taxes.\n\nYou say TODAY you want to hold MSFT for a long time but at some point, you will have to pay the taxes.  MSFT might not be around when you retire in 20-30 years.  Just because MSFT has been doing well for the last 5 years doesn’t mean it will do well the next 25.   What if you had massive capital gains in Yahoo, Enron, Xom, Cisco, juniper, ibm, or GME(lol)?   Some are long gone and some have became dead money for years.",
        "created_utc": 1618403669,
        "id": "guhb3i8",
        "score": 1,
        "subreddit": "options",
        "created": 1618432469.0
    },
    {
        "author": "metnavman",
        "body": "So you're selling 4/16 26c CCs on JNPR eh?",
        "created_utc": 1617633895,
        "id": "gtgieee",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617662695.0
    },
    {
        "author": "Dematsa",
        "body": "AMAT, LRCX, AMD, KLAC, TSM",
        "created_utc": 1617574171,
        "id": "gte2qpz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617602971.0
    },
    {
        "author": "ThisPomelo4",
        "body": "Your analysis is probably true for delta, but the problem with playing those names using vol is that the IV is higher. Options trading is most useful when you get the gamma cheap while also calling the direction right.\n\nI'm buying INTC 23Apr 70c because resistance at 65 has kept IV muted. My bet is that INTC will break through that resistance on 6Apr or 23Apr. I hate talking in terms of resistance in general, but looking at the long-term chart as well as price action in the morning after the Intel Unleashed event, it certainly seems like you'd need a big catalyst to justify a breakout beyond 65. I'd probably play those profits -- if any -- into AMD puts through to May, because I think hedge fund selling will take place when Lisa Su inevitably acknowledges the incorrectness of her prediction that supply \"tightness\" would clear up by 2H21.\n\nI also believe that the Archegos liquidation is another sign that correlated hedge fund losses will spell disaster for the market. We saw this already with GME and the other short-squeeze names. Chipmakers like to lay out their capex as close to production ramp-up as possible, which means that LRCX/AMAT/ASML/KLIC/KLAC/CAJ/etc won't book profits immediately even if billions of dollars are allocated to the roadmap. So I'm waiting for a big selloff this summer to get into those names as a long-term position. May try to play that selloff using hedgie favorites and names that have a lot of room to fall. ARKK, TSLA, TSM, NVDA come to mind. TSM seems counterintuitive but you get the added potential catalyst of Chinese brinkmanship as well as a deepening of the water supply woes.\n\nI mention CAJ because it gives a good read on DUV demand. Their equipment segment had a lot of profit growth last quarter. But it's not as good a play as the others because only a fifth of its revenue comes from that segment.",
        "created_utc": 1617331929,
        "id": "gt3qzmp",
        "score": 1,
        "subreddit": "options",
        "created": 1617360729.0
    },
    {
        "author": "JhoLow_1MDB",
        "body": "Suppliers are better picks.  LCRX, AMAT, KLAC.\n\nAMAT is a monster.",
        "created_utc": 1617582922,
        "id": "gteig5c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617611722.0
    }
]