[
    {
        "author": "NlNJANEER",
        "body": "I’ll tell you what, I live in LA and I’m pretty sure I caught the omicron variant from a layover in Tel Aviv last week. I’m just waiting to get tested until my paycheck clears and I’m done loading up on puts",
        "created_utc": 1638378440,
        "id": "hmteo5z",
        "permalink": "/r/wallstreetbets/comments/r6ey5j/hopefully_this_is_the_sentiment_now/hmteo5z/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638407240.0
    },
    {
        "author": "shiftypop22",
        "body": "Would anyone be able to tel me if this is a bad? \nSvok boxed switching from nasdaq to nyse. \n\nhttps://www.stonkmoon.com/news/SVOK/4af66bc31f7fa369c47518d329e7a2e6",
        "created_utc": 1638456741,
        "id": "hmxqtkc",
        "permalink": "/r/SPACs/comments/r72eb2/announcements_x_daily_discussion_for_thursday/hmxqtkc/",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638485541.0
    },
    {
        "author": "ThatsAHugeLoadOfBS",
        "body": "Bro please don’t tel my mom I’m into ornamental gourd porn.",
        "created_utc": 1638759009,
        "id": "hnetcnp",
        "permalink": "/r/wallstreetbets/comments/r9p9ti/what_are_your_moves_tomorrow_december_06_2021/hnetcnp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638787809.0
    },
    {
        "author": "Post_Gaming",
        "body": "Someone tel me if it’s yes or no thanjs",
        "created_utc": 1638375006,
        "id": "hmt60xc",
        "permalink": "/r/wallstreetbets/comments/r6e0b3/are_we_in_a_bubble_comparing_the_current_stock/hmt60xc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638403806.0
    },
    {
        "author": "brownfox74",
        "body": "Dont know about DoorDash as im from Europe,\nLet me tel you about Wolt (which was acquired by doordash for 8.1B)\n\nWolt came to my city (one of the greatest most versatile food scene’s in the world - biased) and swiped the deliveries market share to something in the 80%\n\n80% of the deiveries, in a tech rich, eat-out environment bought through them\n\nUI/UX is mostly stunning and addicting, customer service is spot on(getting money back without asking sometimes)\n\nThis is LITERALLY the best deliveries app IN THE WORLD and this is why it got bought for this amount of money, to copy it into doordash’s one, and taking on this US and other market share\n\nI have no position, i dont like this market (even wolt wasnt profitable, and they are taking 4-7$ per order from the customer &amp; 23.5% from the restaurant ex. VAT on each order)\n\nBut just wanted to give the absolute greatest plus on this one from a super WOLT biased perspective who knows nothing about DoorTrash",
        "created_utc": 1638892470,
        "id": "hnlt079",
        "permalink": "/r/wallstreetbets/comments/rac8ih/doordash_is_trash_nothing_but_puts_dash/hnlt079/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638921270.0
    },
    {
        "author": "1nd3x",
        "body": "I did some digging on this, so while I still dont have my account open and I have not contacted their support, so as you said they may not offer it, but it may be that you can trade on international exchanges.\n\n[https://ibkr.info/article/2374](https://ibkr.info/article/2374)\n\nFrom IBKR, my take: \"if its a qualified investment, we'll let you do it\"\n\n[https://www.canada.ca/en/revenue-agency/services/tax/technical-information/income-tax/income-tax-folios-index/series-3-property-investments-savings-plans/series-3-property-investments-savings-plan-folio-10-registered-plans-individuals/income-tax-folio-s3-f10-c1-qualified-investments-rrsps-resps-rrifs-rdsps-tfsas.html#toc3](https://www.canada.ca/en/revenue-agency/services/tax/technical-information/income-tax/income-tax-folios-index/series-3-property-investments-savings-plans/series-3-property-investments-savings-plan-folio-10-registered-plans-individuals/income-tax-folio-s3-f10-c1-qualified-investments-rrsps-resps-rrifs-rdsps-tfsas.html#toc3)\n\nFrom \"Canada\": You can invest within your TFSA into anything that is a qualified investment in a qualified market\n\nwhats a qualified market?\n\n[https://www.canada.ca/en/department-finance/services/designated-stock-exchanges.html](https://www.canada.ca/en/department-finance/services/designated-stock-exchanges.html)\n\n&gt;Designated Stock Exchanges\r  \nCanada: Aequitas NEO Exchange\r  \nCanada: Canadian National Stock Exchange (operating as the Canadian Securities Exchange)\r  \nCanada: Montreal Exchange\r  \nCanada: TSX Venture Exchange (Tiers 1 and 2)\r  \nCanada: Toronto Stock Exchange\r  \nAustralia: Australian Securities Exchange\r  \nAustria: Vienna Stock Exchange\r  \nBelgium: Euronext Brussels\r  \nBermuda: Bermuda Stock Exchange\r  \nBrazil: BM&amp;F Bovespa Stock Exchange\r  \nCzech Republic: Prague Stock Exchange (Prime Market)\r  \nDenmark: Nasdaq Copenhagen\r  \nFinland: Nasdaq Helsinki\r  \nFrance: Euronext Paris\r  \nGermany: Frankfurt Stock Exchange\r  \nGermany: Boerse Stuttgart AG (Stuttgart Stock Exchange)\r  \nHong Kong: The Hong Kong Stock Exchange\r  \nIreland: Irish Stock Exchange\r  \nIsrael: Tel Aviv Stock Exchange\r  \nItaly: Borsa Italiana S.p.A (Milan Stock Exchange)\r  \nJamaica: Jamaica Stock Exchange (Senior Market)\r  \nJapan: Tokyo Stock Exchange\r  \nLuxembourg: Luxembourg Stock Exchange\r  \nMexico: Mexico City Stock Exchange\r  \nNetherlands: Euronext Amsterdam\r  \nNew Zealand: New Zealand Stock Exchange\r  \nNorway: Oslo Stock Exchange\r  \nPoland: The main and parallel markets of the Warsaw Stock Exchange\r  \nRepublic of Korea: Korea Exchange (KOSPI and KOSDAQ)\r  \nSingapore: Singapore Stock Exchange\r  \nSouth Africa: Johannesburg Stock Exchange\r  \nSpain: Bolsa de Madrid (Madrid Stock Exchange)\r  \nSweden: Nasdaq Stockholm\r  \nSwitzerland: SWX Swiss Exchange\r  \nUnited Kingdom: London Stock Exchange\r  \nUnited States: BATS Exchange\r  \nUnited States: Nasdaq BX\r  \nUnited States: Chicago Board of Options\r  \nUnited States: Chicago Board of Trade\r  \nUnited States: Chicago Stock Exchange\r  \nUnited States: Investors Exchange LLC\r  \nUnited States: National Association of Securities Dealers Automated Quotation System (Nasdaq)\r  \nUnited States: National Stock Exchange\r  \nUnited States: New York Stock Exchange\r  \nUnited States: NYSE Arca\r  \nUnited States: NYSE MKT\r  \nUnited States: Nasdaq PHLX",
        "created_utc": 1638903443,
        "id": "hnmi320",
        "permalink": "/r/CanadianInvestor/comments/r9ssek/best_broker_to_reach_international_markets_in_a/hnmi320/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1638932243.0
    },
    {
        "author": "Tenordrummer",
        "body": "Man this made me do a double take on my post, it was definitely assholeish unnecessarily. I had just waded through posts about how the bill shouldn’t pass and this was the first post I saw that actually mentioned a USA chipmaker lol. \n\nAnd hard agree on all suppliers will have heavy benefits, but I’m not sure if THE MOST benefit will be to suppliers, just depending on how money is allocated. I know ASML, TEL, AMAT, etc are building our capacity to handle increased demand for tools, but I don’t think they’re there yet and that extra (potentially unsubsidized) capital spending makes me more hesitant. That’s just a short take though without doing much digging so I could be off on that one.",
        "created_utc": 1638561093,
        "id": "hn3vb2m",
        "permalink": "/r/stocks/comments/r7yl4f/biden_official_we_are_imploring_congress_to_pass/hn3vb2m/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638589893.0
    },
    {
        "author": "SexyDegen",
        "body": "How to tel me you hate trump without telling me you hate trump. \n\nYou should probably gets your facts right rather than being radical on anything other than the fact that you hate trump. Seek professional help \n\nDon’t forget about Benghazi, she was never liked by anyone with a brain. That’s why she lost.",
        "created_utc": 1638828691,
        "id": "hnikebo",
        "permalink": "/r/wallstreetbets/comments/raavtg/trumps_new_social_media_company_spac_is_under/hnikebo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638857491.0
    },
    {
        "author": "ObservationalHumor",
        "body": "AMAT, ASML, LAM and TEL are the ones I usually see crop up.",
        "created_utc": 1638637460,
        "id": "hn7ould",
        "permalink": "/r/investing/comments/r8r1vq/why_is_valuation_for_semiconductors_so_poor/hn7ould/",
        "score": 1,
        "subreddit": "investing",
        "created": 1638666260.0
    },
    {
        "author": "PM_Me_Your_Positions",
        "body": "Don’t tel me that because I was already so tempted to yolo on calls expiring this week tbh",
        "created_utc": 1638415808,
        "id": "hmvyg7s",
        "permalink": "/r/wallstreetbets/comments/r2yioy/yolo_15k_mrna_like_a_true_retard_at_the_height/hmvyg7s/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638444608.0
    },
    {
        "author": "MannieOKelly",
        "body": "(Disclosure: I have a small position in IONQ and a smaller one in SNII--&gt;Rigetti) \n\nComments: \n\n1. OP is correct in saying that there's not much point in investing in the biggies (Alphabet, etc) as QUANTUM plays. (But SPY, QQQ, and the FAANGs or whatever are pretty good bets on large-cap tech in general.) \n2. RE: IONQ:  their investor pre-SPAC-merger presentations project significant revenue starting in 2023 and cash-flow-positive in 2025/6. Negligible actual revenue now, so things like PE are pretty meaningless.  Now that it's out of the SPAC  merry-go-round process, it's a highly speculative long-term bet on the company being one of the survivors that develop a useful QC architecture, and executing well enough to take advantage of it. \n3. However, IONQ has some impressive backing. Alphabet owns a bit over 10% of it (per E\\*Trade data). Its first operational computers are running in all three major clouds on a SaaS basis (selling presumably to those trying to develop quantum algorithms and languages.) They also have have partnerships with Goldman (experimenting with financial applications), Accenture and others. And lots of IP licensed from UMd, with whom they are also building a National Quantum Lab at Maryland (Q-Lab.) So I'd say that are on the short-list of quantum-computer-specialist companies, but again, highly speculative. \n4. Rigetti is another QC-specialist startup, now expected to go public via the SPAC route in the next few months. The SPAC sponsor is SuperNova Partners Acquisition Co. II Ltd -- SNII. Interesting about Rigetti is that one of their investors is IN-Q-Tel, the US Intelligence Community's \"venture-capital\" entity. No sure that means much--just interesting. \n5. RE: timeline for useful quantum computing capability.  I am NOT a physicist, so I am interested to see other comments suggesting that QC won't be real for a long time.  However, I did read and article this week on the potential challenges posed by QC threats to increasingly electronic and especially self-driving vehicles: basically, current encryption will be  broken by QC so computer-dependent automobiles will be vulnerable to hacking. The article noted that NIST, which has been working on quantum-safe encryption algorithms for some years now, advises that all sectors should plan to have their encryption and authentication infrastructures converted to quantum-safe algorithms not later than 2030.  (Which, BTW won't happen.)  So that's eight years and three weeks from now.   \n\nI would LOVE to have a good source to keep up with the \"short list\" of companies in the lead for developing practical QCs.  If there were an ETF doing that I'd buy it, but not if it is diluted with big companies like Alphabet, IBM, Honeywell, etc. Meanwhile, I'm trying to track any small QC-specialist companies that have public shares and seem to have a plausible approach to scalability, error correction and practical hardware requirements. Does anyone have a good source of such info, like a journal or quantum industry mag that is not so technical I can't read it? \n\nGood luck to all!",
        "created_utc": 1638934459,
        "id": "hnodhtw",
        "permalink": "/r/StockMarket/comments/qut84x/quantum_computing_is_it_better_to_invest_in_a/hnodhtw/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638963259.0
    },
    {
        "author": "sweetguyBry",
        "body": "Tel that to op this is a post about covid",
        "created_utc": 1638395447,
        "id": "hmun4hz",
        "permalink": "/r/wallstreetbets/comments/r6lxuh/are_pissing_their_pants_right_now_first_case_of/hmun4hz/",
        "score": -4,
        "subreddit": "wallstreetbets",
        "created": 1638424247.0
    }
]