[
    {
        "author": "dwdsquared2",
        "body": "**Events in the US Today (ET):**\n\n* 09:00am - House Price Index \\[2/3 Volatility\\]\n* 10:00am - CB Consumer Confidence (May) \\[3/3 Volatility\\]\n   * New Home Sales (Apr) \\[3/3 Volatility\\]\n   * FOMC Member Quarles Speaks \\[2/3 Volatility\\]\n   * The Senate meets for session\n* 12:00pm - The House meets for session.  Lawmakers resume legislative work in the Capitol next month.\n* 12:30pm - General White House Press Briefing\n* 01:00pm - 2-Y Note Auction \\[1/3 Volatility\\]\n* 01:30pm - COVID-19 White House Press Briefing\n* 04:30pm - API Weekly Crude Oil Stock \\[2/3 Volatility\\]\n* Fed officials Brainard, Bostic and Bullard said they wouldn’t be surprised to see bottlenecks and supply shortages push prices up in coming months as the pandemic recedes, but that much of those gains should be temporary.\n* CEOs of the largest U.S. banks, including JPMorgan and Goldman Sachs, will testify before lawmakers in the Senate Banking and House Financial Services committees Wednesday.\n* The U.S. said Americans should avoid traveling to Japan, with much of the country under a state of emergency over a Covid-19 outbreak that has sown doubts about Tokyo’s plans to host the Olympics in less than two months.\n* Biden visited FEMA Monday and said he is doubling the amount of money the government will spend helping communities prepare for extreme weather events while launching a new effort at NASA to collect more sophisticated climate data.\n* The White House on Monday indicated that it is “eager” to continue bipartisan talks on a potential infrastructure package despite there being less than a week until the White House’s soft deadline for an agreement and chances of a deal having diminished in recent days. \n\n**Events in the World Today (ET):**\n\n* 02:00am - Germany GDP (QoQ-Q1) \\[3/3 Volatility\\]\n* 04:00am - Germany Ifo Business Climate Index (May) \\[3/3 Volatility\\]\n   * Germany Business Expectations (May) \\[2/3 Volatility\\]\n   * Germany Current Assessment (May) \\[2/3 Volatility\\]\n* 06:00am - Euro Zone EU Leaders Summit \\[3/3 Volatility\\]\n* 08:30am - Canada Manufacturing Sales (MoM) \\[2/3 Volatility\\]\n* 10:00am - Brazil CAGED Net Payroll Jobs \\[2/3 Volatility\\]\n* 12:00pm - UK MPC Member Tenreyro Speaks \\[2/3 Volatility\\]\n* 06:45pm - New Zealand Trade Balance (MoM&amp;YoY-Apr) \\[2/3 Volatility\\]\n* 09:30pm - Australia Construction Work Done (QoQ-Q1) \\[2/3 Volatility\\]\n* 10:00pm - New Zealand RBNZ Interest Rate Decision \\[3/3 Volatility\\]\n* 11:00pm - New Zealand RBNZ Press Conference \\[3/3 Volatility\\]\n* Iran reached an agreement with the United Nations’s International Atomic Energy Agency (IAEA) on Monday to extend the use of surveillance cameras at Tehran's atomic sites for one additional month. The announcement comes just a day after a high-ranking Iranian politician indicated the use of cameras would not continue. \n\n**Earnings Before Open:**\n\n* AutoZone, CitiTrends, Cracker Barrel, ViaSat, Dycom\n\n**Earnings After Close:**\n\n* Urban Outfitters, Zscaler, Intuit, Toll Brothers, Nordstrom, ReneSola, Agilent Technologies, Red Robin\n\n[Earnings This Week](https://i.imgur.com/Q5m35tO.png)",
        "created_utc": 1621942915,
        "id": "gzdpq0l",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1621971715.0
    },
    {
        "author": "Suspicious_Ad_CAGR",
        "body": "Your basically saying that \"This time is different. the old paradigm doesn't matter anymore. Our society has shifted to much. These businesses transcend normal valuations techniques\".\n\nLots of people will disagree with this approach.\n\nMath is math. High P/E ratios are speculation about future growth potential. Tax software could be a very competitive industry and I can't think of any moats to retain an enduring advantage except the switching costs related to transferring the last years tax information.\n\nHopefully your right. Maybe not though. I don't know. I've looked into Intuit recently because I used Turbotax. I like the product but Intuit is valued very highly, the revenue is volatile between quarters, I can't see a sustainable competitive advantage. What if Apple releases tax software? My research stopped there.\n\nI'm going to sit this one out.",
        "created_utc": 1619891805,
        "id": "gwked4b",
        "score": 10,
        "subreddit": "investing",
        "created": 1619920605.0
    },
    {
        "author": "schitaco",
        "body": "$SQ to the moon\n\nSomeone discovered a reference to \"Square Checking\" and \"Square Savings\" in their recent app update, meaning they're finally launching bank accounts for businesses. \n\nThis means there's basically no point in having a banking relationship for most small merchants, and Square is aggressively coming after midmarket merchants too (restaurants, larger retailers). They'll have access to cheap capital to lend, and have insight into customers' cash flow to make more accurate and timely credit offers than the bank, and get paid directly from receipts. Anyone not named Chase, BofA, Wells, Amex, PayPal, or Intuit is fuk.\n\nThanks for reading my journal.",
        "created_utc": 1621914388,
        "id": "gzcqcr6",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1621943188.0
    },
    {
        "author": "The_Folkhero",
        "body": "Intuit is a great one - a \"baby FAANG.\" One of my biggest holdings.",
        "created_utc": 1622413141,
        "id": "h00qlgp",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1622441941.0
    },
    {
        "author": "WhiteHoney88",
        "body": "Intuit should be big time. For those that don’t know — they own quick books, TurboTax, and mint. \n\nDisclaimer — I do not play earnings.",
        "created_utc": 1621868364,
        "id": "gza21hg",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1621897164.0
    },
    {
        "author": "RedWarFour",
        "body": "Intuit (Turbo Tax) lobbies to keep tax filing complicated.\n\nhttps://www.propublica.org/article/inside-turbotax-20-year-fight-to-stop-americans-from-filing-their-taxes-for-free",
        "created_utc": 1620576499,
        "id": "gxichvh",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620605299.0
    },
    {
        "author": "PorkchopSquats",
        "body": "Nobody paid their taxes “on time” this year, Intuit gonna shit the bed on the quarter.",
        "created_utc": 1621680754,
        "id": "gz1labu",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1621709554.0
    },
    {
        "author": "Dmoan",
        "body": "Cnbc ask some hard questions like why RKT is not moving into fintech is it because Dan doesn't want to competion with his intuit.",
        "created_utc": 1620301553,
        "id": "gx510vu",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620330353.0
    },
    {
        "author": "angelus97",
        "body": "Companies can have any year end they want. AAPLs fiscal year ends Sep 30. PTON is June 30. INTU is July 31. FB is Dec 31. And on and on.\n\nSo one company’s Q1 could be another company’s Q3 as an example.",
        "created_utc": 1621309236,
        "id": "gyj23f3",
        "score": 3,
        "subreddit": "investing",
        "created": 1621338036.0
    },
    {
        "author": "thewimsey",
        "body": "INTU, though, doesn't have a moat; it has several well established competitors (including Tax Act, owned by H&amp;R Block), and most recently has had to deal with Credit Karma, which is free.",
        "created_utc": 1619899634,
        "id": "gwkw0f1",
        "score": 2,
        "subreddit": "investing",
        "created": 1619928434.0
    },
    {
        "author": "CryptoCloudXero",
        "body": "Yeaaa I had bought in a bit later around 60 a share. The only shitty part about it was it was only on the OTC market. So in Canada I couldn't buy it from my tax free savings account.\n\nWhen I look at clov and compare the two clov seems to be growing revenues much faster and at higher scale. Xero is the clov and Intuit is fucking Humana.\n\nDisrupter vs disrupted\n\nOil is gross man, straight up boomer shit. All good you live and you learn!",
        "created_utc": 1619981208,
        "id": "gwp33zk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620010008.0
    },
    {
        "author": "meta-cognizant",
        "body": "No, lol. Look at any ticker that's hardly active in after hours. Say INTU or BIO. There is no data during minutes it isn't traded.",
        "created_utc": 1620302500,
        "id": "gx52hya",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620331300.0
    },
    {
        "author": "surfinbird",
        "body": "Huh, didn’t know they owned those in intuit products. The More You Know 💫",
        "created_utc": 1621386129,
        "id": "gyn2qaf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1621414929.0
    },
    {
        "author": "IntroductionOne3720",
        "body": "&gt;Turbo Tax thinned out the CPA herd, not the general accounting herd.\n\nSo, firstly, this is inaccurate because this is a failure to understand what tax accountants do. \n\nTax accountants do not just do tax returns, they also provide tax planning, estate planning, some level of finance management and various other activities. Secondly, [accounting has it's own internal issues](https://www.accountingweb.com/practice/growth/why-cpa-candidate-numbers-have-decreased-part-1) which greatly reduced the number of CPA applications but the number of CPAs or their job growth projection hasn't shifted negatively at all vs. the economy which would be evident if they were being replaced by-and-large.\n\nSecondly, TurboTax, if it provided tax planning services (nevermind that they company Intuit actually hires tax professionals and CPAs to represent their clients) that would actually thin all of accounting specifically in auditing because if properly placed you'd need fewer auditors which actually did happen due to better software and statistical testing methods. There's a lot wrong with this but the largest fundamental element here is that *most people who would require a CPA due to genuinely complex taxes use one*; it turns out that TurboTax isn't thinning anything at all but instead that the general populace simply doesn't have complex returns. [In the U.S. well over a third of taxable income simply went back to those who paid it; the number of people who pay taxes is not particularly high](https://www.statista.com/statistics/242138/percentages-of-us-households-that-pay-no-income-tax-by-income-level/) and if you look over the years ... Yatta yatta.\n\nI don't think anyone actually cares about accountants in general since the whole concept of understanding the complexity of what they genuinely do, especially when talking about tax accountants because not all of them are even CPAs, you can have various types including Registered Agents and CMA designations or CGAs all of whom play a part with, or even can do, taxes if properly designated. This is Reddit but it is hard to just note how deep the rabbit hole goes and realize that most people haven't a fucking clue.\n\nTheir entire perspective is the surface of the pond and they think they see the bottom.",
        "created_utc": 1619894104,
        "id": "gwkjrm7",
        "score": 2,
        "subreddit": "options",
        "created": 1619922904.0
    },
    {
        "author": "flobbley",
        "body": "They had run up a LOT since last year and engineering companies this old dont typically grow fast enough to keep up with that kind of growth, I expected their earning to meet or only slightly exceed, at which point i expected overzealous buyers to sell. But they ended up crushing earnings which sent it higher today.\n\nIt should be noted that i only pick stocks with a tiny amount of \"fun money\" so i dont spend a ton of time digging up every bit of information about a stock, usually just check revenue, ratios, and headlines, then intuit the rest. And since I do it for fun I tend to turn over pretty frequently since actually buying and selling is the fun part to me.\n\nIn this instance I only owned one share of the company",
        "created_utc": 1620658219,
        "id": "gxm3or3",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620687019.0
    },
    {
        "author": "Dmoan",
        "body": "RKT is garbage because they haven’t used their presence to expand and compete in other segments. They cannot move into fintech because of Intuit and have to compete in overcrowded refinance market which will only decline in the coming months. I am a bag holder disappointed they haven’t done anything with all that cash other than throw it at shareholders.",
        "created_utc": 1620262904,
        "id": "gx3ikhs",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620291704.0
    },
    {
        "author": "ImTryinDammit",
        "body": "Intuit is on sale.",
        "created_utc": 1620200443,
        "id": "gx03mb1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620229243.0
    },
    {
        "author": "sendmetothelionsden",
        "body": "Is Intuit free money during tax season?",
        "created_utc": 1621841574,
        "id": "gz90eas",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621870374.0
    },
    {
        "author": "Diamond_Losses",
        "body": "Do I yolo into INTU calls or puts please someone help",
        "created_utc": 1621972236,
        "id": "gzfhi80",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622001036.0
    },
    {
        "author": "400Jordan",
        "body": "Intuit must have a blowout to report with all the new people in the market that didn’t want to do their own taxes",
        "created_utc": 1621698556,
        "id": "gz2d6oj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621727356.0
    },
    {
        "author": "murdacai999",
        "body": "Or possibly they may go up due to higher costs of doing your taxes, when you bought and sold stocks. Perhaps all these new investors will have paid more to do their taxes? I believe most of the people that use Intuit, file earlier btw. Just my opinion.",
        "created_utc": 1621774652,
        "id": "gz5nbdw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621803452.0
    },
    {
        "author": "BuyBakedSellHigh",
        "body": "I don't think they do, I believe they just partner with Intuit",
        "created_utc": 1621398087,
        "id": "gynpxcz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621426887.0
    },
    {
        "author": "DongKelly32",
        "body": "For sure grabbing Intuit soon. Everyone paying for TurboTax premium instead of the free version this year",
        "created_utc": 1621277650,
        "id": "gyh81tq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621306450.0
    },
    {
        "author": "The_Folkhero",
        "body": "Facebook \n\nAdobe \n\nSalesforce \n\nIntuit",
        "created_utc": 1621105720,
        "id": "gy8tbtw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1621134520.0
    },
    {
        "author": "denhous",
        "body": "INTU",
        "created_utc": 1622456206,
        "id": "h02gx42",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622485006.0
    },
    {
        "author": "BluePuts",
        "body": "I always wondered about that, granted I don’t own a business or have crazy income but filing joint on turbo tax has always only taken me at most 15 minutes to do my taxes\n\nEdit: sponsored by turbo tax btw long intuit since 2010",
        "created_utc": 1620505255,
        "id": "gxf8sx0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620534055.0
    },
    {
        "author": "The_Folkhero",
        "body": "Don't get me wrong, I own Apple too, in equal weighting in my portfolio. But you hit upon it, % return wise there are better plays. Because isn't it % returns that we are chasing in stocks?! And I am willing, and have, been putting down a larger % on the smaller cap players.. That's why I am not overweight  Apple and am overweight smaller cap companies such as the \"baby FAANGs of Adobe, Salesforce, Intuit, and especially, out of FAANG, Facebook (which is not even at a trillion market cap). The Apple trees don't grow to the sky and stock physics apply. And great companies don't always get bigger - just look at the dead money that Microsoft was for a decade. Cisco is another company that was one of the largest stocks back in the day and today it is a relic of what it once was.",
        "created_utc": 1620828176,
        "id": "gxurjey",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620856976.0
    },
    {
        "author": "Dmoan",
        "body": "Problem with RKT is they cannot innovate and move into other segments without risk of competition with Intuit",
        "created_utc": 1620338400,
        "id": "gx7ce1k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620367200.0
    },
    {
        "author": "GeneralRenegade1",
        "body": "Maybe u arrogant uneducated in level. That i been in the biz, directly, and made more money than u screwballs can ever imagine and not by shorting. Hold like a bandit! \nSimple stupid and efficent!\nWork hard!\nDevelope bussinesses! \nCorporations and Technology Standards!\nLED TECHNOLOGIES!\nOPTIC TECHNOLOGIES\nOS &amp; PROGRAMING &amp; CODING\nSECURITY DEVICES (RING DOORBELL SECURITY, AND SECURITY BY BRINKS) \nINSURANCE COMPANIES LIKE ALLSTATE, AND GIECO, AND LIBERTY INSURANCE. \nINTUIT TURBOTAX\nEPIC GAMES &amp; MY UNREAL ENGINE!\nFOX ENGINE. \nGAMES LIKE WASTELANDER 1988/89, FALLOUT, DOOM (IM THE VOICE ACTOR FOR ORGINAL VOICE GRUNT FOR DOOMGUY)!!! SOME YELLS! AND OTHER SOUND DEVELOPMENTS! DIGITECH!\nHAND HELD DEVICES! \nLASERS! \nLIDAR!\n\nRADIOSCOPES!\nEKG DEVICES\nVENTOLATORS\nMONTIORS\nMEDICAL DEVICES!\n\nSCIENCE! ITS ALIVE!\nMATH! \nELECTRICAL ENGINES AND CHIPS AND SENSORS!\nMICRO SENSORS! \nRADARS!\nAIRCRAFTS! \nSPACE AEROSPACE CRAFTS! \nSATILITES!\nWEATHER SATILITES\nNEWS NETWORKS\nMUSIC &amp; MUSIC VIDEOS\n(VEVO)\nYOUTUBE\nGOOGLE &amp; ALPHEBET\nAMAZON AMAZONPRIME AWS\nCELLPHONES &amp; CELL TOWERS! \nSMART TECHNOLOGIES\n1G-5G &amp; 5GE LTE SYSTEMS!\nOIL &amp; GASOLINE &amp; OTHER OIL RELATED FUELS! &amp; NATGAS &amp; PROPANE &amp; HYDROGEN &amp; NUCLEAR &amp; SOLAR &amp; WIND &amp; HYDROELECTRIC GENERATORS!\nTOOLS &amp; EQUIPMENT &amp; HEAVY EQUIPMENT\n\nMINING GOLD, SILVER, PLATINUM, PALADINIUM, (OTHER PRECIOUS METALS). \nINDUSTRY METALS &amp; MINERAL MINING! \nWELDING TECHNOLOGIES\nPLASMA TECHNOLOGIES\n\nNYSE &amp; ROBINHOOD. OTHER TRADING FIRMS. \nINVEST QQQ!\n\nSCIENCE, MATH, MUSIC, ENTERTAINMENT,  READING &amp; WRITTING, DESIGN &amp; CONCEPTS &amp; ART &amp; PAINTING! MUCH MORE!\nMICRO-BIOLOGY &amp; BIOLOGY\nGEOLOGY\nECONOMICS\nCHEMISTRY\nENGINEERING\nMECHANICS\nNUCLEAR SCIENCE\nMETAL SHOP WORKS\n\nWELCOME TO MY WORLD!",
        "created_utc": 1620941248,
        "id": "gy0zyic",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620970048.0
    },
    {
        "author": "jamesjay2",
        "body": "Intuit may be fucked with the later filing date. I assume most of their business comes from procrastinators doing their taxes at the last minute like me.",
        "created_utc": 1621688549,
        "id": "gz1v3hv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621717349.0
    },
    {
        "author": "Hutz_Lionel",
        "body": "I would consider adding Ferrari $RACE and $INTU to that list!",
        "created_utc": 1621639286,
        "id": "gyzzta9",
        "score": 1,
        "subreddit": "investing",
        "created": 1621668086.0
    },
    {
        "author": "The_Folkhero",
        "body": "Facebook is the best value in FAAG/MSFT. Lowest market cap = more runway left for appreciation. Best valuation with lowest P/E and P/Cash Flow. Has the most untapped revenue verticals (video, AR/VR, payments, Angie's List type of service referrals, hardware (Portal/Oculus), dating, WhatsApp and Instagram.\n\nAdobe - a \"baby FAANG\" that has more room to run, market cap-wise, than FAANG. \n\nSalesforce - same reason as Adobe above, baby FAANG. \n\nIntuit - under the radar, category killer with tax and accounting software \n\nPinterest - scarce social media property that is adding e-commerce functionality with Shopify. \n\nWISH - WISH's global eCommerce marketplace has an affordable/entertaining mobile shopping experience. Its focus on value conscious consumers, unique array of unbranded product selection from global merchants, and data science driven approach is very sophisticated. In terms of upside, there is potential in local delivery/fulfillment, branded inventory efforts &amp; a subscription revenue stream. The Company is projecting positive EBIT in 2022. A modest 4x P/S multiple at that time should result in a doubling of the stock price from current levels.\n\nCronos (CRON) - big tobacco's Altria (MO), the largest tobacco company in USA, backs this company with 45% ownership and will likely plug and play its products like a light switch upon federal legalization into its huge point of service network of over 250,000 locations (i.e. convenience stores, etc) is the cannabis company that will likely be the ultimate winner. They are avoiding expensive growing methods by using a creative approach announcing that they will be introducing synthetic cannabinoids for the Canadian market for a 10 cents a gram:\n\nhttps://www.bnnbloomberg.ca/cronos-to-sell-lab-grown-pot-products-in-canada-this-year-ceo-1.1556188\n\nAside from Cronos, I think the ancillary cannabis companies are the way to play weed stocks because they don't contain cannabis and hence allow listing on the most liquid exchanges such as Nasdaq and institutional money can pour into these cannabis related names now/today as opposed to being shut out of other companies that contain cannabis because institutional money usually has mandates to not allow investing in something that is Federally illegal:\n\nHydrofarm (HYFM) - IPOed in Dec and a leading hydroponics manufacturer and distributor\n\nGrowGeneration (GRWG) - leading hydroponics retailer\n\nWeedmaps (SSPK) - unique, direct to consumer (DTC), cannabis play on the intersection of tech and cannabis. A type of Uber, Amazon, Yelp and Shopify all rolled into one for cannabis products. A SPAC that will turn into WeedMaps during sometime in the 1st half of this year. This one is special. \n\nTim Seymour's cannabis ETF (CNBS) owns a big position in WeedMaps and smaller positions in GrowGeneration and Hydrofarm:\n\nhttps://www.amplifyetfs.com/cnbs-holdings.html\n\nTwitter (TWTR) - is a unique social media equity that has achieved critical mass. It may have kinks in it in its current state, and yes, I think Dorsey being so egotistical to think he can be a co-CEO of both Square and Twitter is disgusting (as is his beard), but there is a user base there. It might shock people that the political user base only comprises a low teens % component of their total user base with the rest being news, sports and entertainment. Twitter has made some acquisitions recently of Squad and Breaker that really puts them into interesting territory of peer to peer browsing, audio and podcasting - things people should not overlook. \n\nCoinbase (COIN) - is one of the top 5 most profitable exchanges in the world. Coinbase might make more money than Nasdaq. Coinbase is gonna be huge because this is the first time we are going to be able to directly play crypto in the equity market. Why I like COIN is that it is a play on Bitcoin AND all the other coins out there...whereas bitcoin is just a play on bitcoin, so you are getting all the other coins for free. COIN is heavily (96%) tied to the price of bitcoin, which is very hard to predict. Another advantage of COIN being the first crypto exchange coming onto the market first is that they potentially can use their stock as currency to buy any other competitors. And you don't have to believe in the crypto party line and the dangers of fiat currency and how you need an alternative, because central banks all over the world are printing money like crazy - even if you think this is nonsense, we know that there is a market for this kind of nonsense because gold bugs have been saying the same thing for decades. In other words, crypto has a natural constituency. Like gold, people buy it as a kind of inflation insurance and gold's strength is its scarcity - its supply only increases about 1% per year and it is getting harder and harder to find more - that sounds a lot like Bitcoin to me and I think it is totally legitimate to believe that crypto, in general, can rival gold as a storehold of value.",
        "created_utc": 1620513553,
        "id": "gxfp10j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620542353.0
    },
    {
        "author": "Dmoan",
        "body": "Rkt is a pos company they cannot innovate and move into fintech because Dan Gilbert won’t allow it as it competes with his other company Intuit.\n\nYes I am bagholding RKT shares but made back most of my $$ sellling 21$ calls",
        "created_utc": 1620249115,
        "id": "gx2p2jk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620277915.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 24th of May\n\n\n\n## Upcoming events for Monday, May 24th\n\n - Stock splits:\n\n    - CTUY @ **105:100** (Payable date: 06/08/2021)\n    - IAU @ **1:2**\n\n - Expected earnings:\n\n  AESE, AGBA, ALAC, ALUS, API, ARCE, ATXI, BPT, BSGM, CRMT, CRT, CYCN, ENIC, ENLV, ENOB, GSMG, GTH, LMPX, MICT, MVO, NAT, NDSN, NEW, NEXT, ONVO, PBT, PHGE, PME, PSTI, PVL, RIDE, RVPH, SJT, TH, THCA, THCB, TPHS, VOC, YQ, ZY\n\n - Ex-div:\n\n  BKR, CDW, CRAI, E, EFX, FLMN, FMS, HCAP, HNNA, JNJ, JRSH, LOB, NDSN, PRU, RHI, SPOK, SWCH, TS, WLK, XPER, YUMC\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.015%)\n    - 6-Month Bill Auction (previous: 0.030%)\n    - Chicago Fed National Activity (previous: 1.71)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Brainard Speaks\n    - Investing.com Gold Index (actual: 55.1%, previous: 59.9%)\n    - Investing.com S&amp;P 500 Index (actual: 45.6%, previous: 42.1%)\n\n## Upcoming events for Tuesday, May 25th\n\n - Stock splits:\n\n    - GLDFF @ **1:23**\n    - NSRCF @ **1:10**\n    - UXI @ **4:1** (Payable date: 05/24/2021)\n    - DIG @ **2:1** (Payable date: 05/24/2021)\n    - QLD @ **2:1** (Payable date: 05/24/2021)\n    - UWM @ **2:1** (Payable date: 05/24/2021)\n    - USD @ **4:1** (Payable date: 05/24/2021)\n    - SAA @ **5:1** (Payable date: 05/24/2021)\n    - UDOW @ **2:1** (Payable date: 05/24/2021)\n    - SMN @ **1:2**\n    - SZK @ **1:2**\n    - RXD @ **1:2**\n    - SIJ @ **1:2**\n    - MZZ @ **1:2**\n    - BZQ @ **1:2**\n    - SRS @ **1:2**\n    - SSG @ **1:4**\n    - SDD @ **1:4**\n    - UMDD @ **5:1** (Payable date: 05/24/2021)\n    - SDOW @ **1:4**\n    - SMDD @ **1:4**\n\n - Expected earnings:\n\n  A, ANVS, ASND, AVAH, AZO, BNR, BTX, CARV, CBRL, CNF, CSWC, CTRN, CYD, DV, DY, ESLT, FINV, GASS, HEI, HEI.A, HTHT, HTOO, IMBI, INTU, ITRN, JAN, JWN, KRKR, KTCC, LOOP, MMYT, QD, RAMP, RRGB, SCPE, SKY, SOL, STEP, STG, TEDU, TIGR, TIMB, TMCI, TOL, TRIB, URBN, VNET, VSAT, ZS\n\n - Ex-div:\n\n  AMCR, ARMK, BPOP, FBP, ITUB, JACK, L, NMRK, RE, RM, SPGI, TER, TRU, VOYA\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.015%)\n    - 6-Month Bill Auction (previous: 0.030%)\n    - Chicago Fed National Activity (previous: 1.71)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Brainard Speaks\n    - Investing.com Gold Index (actual: 55.1%, previous: 59.9%)\n    - Investing.com S&amp;P 500 Index (actual: 45.6%, previous: 42.1%)\n\n## Upcoming events for Wednesday, May 26th\n\n - Stock splits:\n\n    - UVXY @ **1:10**\n    - VIXY @ **1:4**\n    - SCO @ **1:4**\n    - ZSL @ **1:4**\n\n - Expected earnings:\n\n  AEO, AGL, ANF, APPS, BBAR, BBW, BLRX, BMO, BQ, CANG, CHNG, CLGN, CMCO, CMRE, CPRI, CRVL, CVCO, DBI, DKS, DXC, ELF, ESEA, EVGN, GOTU, GRIN, HLG, HMG, HOTH, ICLK, LAIX, LI, MESO, MOD, NESR, NFH, NTNX, NVDA, NVIV, NXGN, OKTA, OOMA, PATI, PDD, PLAB, PSTG, PTNR, QADA, QADB, QMCO, REX, SFET, SINT, SJ, SNOW, TBLT, UCL, UHAL, UVV, VISL, VTOL, VTRU, WDAY, WSM, ZUO\n\n - Ex-div:\n\n  ACCO, AMAT, AVA, B, CHE, CTB, DAC, FWRD, IP, JBT, KNSL, MTRN, PSEC, SMG, XYL\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.849%)\n    - Crude Oil Imports (previous: -0.587M)\n    - Crude Oil Inventories (previous: 1.321M)\n    - Cushing Crude Oil Inventories (previous: -0.142M)\n    - Distillate Fuel Production (previous: -0.102M)\n    - EIA Refinery Crude Runs  (previous: 0.096M)\n    - EIA Weekly Distillates Stocks (previous: -2.324M)\n    - EIA Weekly Refinery Utilization Rates (previous: 0.2%)\n    - Gasoline Inventories (previous: -1.963M)\n    - Gasoline Production (previous: 0.165M)\n    - Heating Oil Stockpiles (previous: -0.164M)\n    - MBA 30-Year Mortgage Rate (previous: 3.15%)\n    - MBA Mortgage Applications (previous: 1.2%)\n    - MBA Purchase Index (previous: 265.3)\n    - Mortgage Market Index (previous: 724.2)\n    - Mortgage Refinance Index (previous: 3,413.3)\n\n## Upcoming events for Thursday, May 27th\n\n - Expected earnings:\n\n  ADIL, ADSK, AFYA, AMWD, ATHM, BBY, BOSC, BOX, BURL, CCEP, CDZI, CELC, CETX, CIH, CKX, CM, COST, CRM, DELL, DG, DLTR, DOMO, DYAI, EBR, EBR.B, FANH, GCO, GNPX, GPS, GRNQ, HHR, HLNE, HMLP, HPQ, HWCC, ISUN, JOBS, KRT, LAZY, LBPS, LGF.A, LGF.B, MACK, MAGS, MDRR, MDT, MIXT, MOMO, MOV, MYSZ, NUZE, NVGS, OFED, OLLI, PBFS, PBR.A, PLAN, PLUG, PRPO, PRVA, QFIN, RBCN, RDHL, RY, RYB, SAFM, SBR, SEEL, SHSP, SKM, SUNW, SUPV, TD, TDAC, THR, TITN, ULTA, VEEV, VIOT, VMW, YEXT, YTRA, YY\n\n - Ex-div:\n\n  ABTX, ADC, ADI, AGNC, ALTM, ALV, AVAL, AY, BEPC, BIPC, BMI, BOH, BRMK, CATY, CBT, CFR, CPF, CR, CRT, CSX, CTT, DD, DNP, DOV, DOW, EAF, EFC, EL, EVR, FBHS, FT, FTV, FXNC, GLW, HII, HQH, HUBB, J, JKHY, KHC, KINS, MAIN, MARPS, MAS, MKSI, MLAB, MLHR, NBHC, NNI, NUS, NWL, ORC, PBT, PDM, PFIS, PIPR, POWI, PRT, PTVE, RLI, RS, SBLK, SCL, SCM, SGC, SJT, STAG, STE, STRA, TNC, TSLX, TV, UBOH, UNP, VMC, VVV, WEYS, WHD, YUM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.000%)\n    - 7-Year Note Auction (previous: 1.306%)\n    - 8-Week Bill Auction (previous: 0.005%)\n    - Continuing Jobless Claims (consensus: 3,640K, previous: 3,751K)\n    - Core Durable Goods Orders (consensus: 0.7%, previous: 2.3%)\n    - Core PCE Prices (consensus: 2.30%, previous: 2.30%)\n    - Corporate Profits (previous: 27.0%)\n    - Durable Goods Orders (consensus: 0.7%, previous: 1.0%)\n    - Durables Excluding Defense (previous: 1.8%)\n    - GDP (consensus: 6.5%, previous: 6.4%)\n    - GDP Price Index (consensus: 4.1%, previous: 4.1%)\n    - GDP Sales (previous: 9.2%)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 1.0%)\n    - Initial Jobless Claims (consensus: 425K, previous: 444K)\n    - Jobless Claims 4-Week Avg. (previous: 504.75K)\n    - KC Fed Composite Index (previous: 31)\n    - KC Fed Manufacturing Index (previous: 40)\n    - Natural Gas Storage (previous: 71B)\n    - PCE Prices (previous: 3.5%)\n    - Pending Home Sales (consensus: 1.1%, previous: 1.9%)\n    - Pending Home Sales Index (previous: 111.3)\n    - Real Consumer Spending (previous: 10.7%)\n\n^^^^2021-05-24",
        "created_utc": 1621850413,
        "id": "gz99lv0",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1621879213.0
    },
    {
        "author": "pepesilviafromphilly",
        "body": "INTU puts?",
        "created_utc": 1622014307,
        "id": "gzhlvtt",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1622043107.0
    },
    {
        "author": "BigTurboAbarth",
        "body": "I like how you think RKT is only home mortgage. You’re comparing income between JUST Rocket mortgage and JUST UWMC Holdings. RKT owns intuit quickbooks, which is a highly regarded and heavily used business organization system. They also own intuit turbotax, which you’ve probably used to do your own taxes because UWMC sure as fuck didn’t offer that while turbotax has and will continue to be the nations easiest and most popular tax return website.\n\nEver heard of Rocket home? Rocket auto? Home insurance. Auto insurance. This company has so many avenues for profit, and you want to sit here and blindly call out RKT for being subpar in comparison to UWMC, when you have absolutely no idea how their product/service lineup encapsulates the market in those areas. I’m going to get so many dislikes because nobody here cares about what’s actually good, what’s actually been working, what’s actually been turning profits, etc. Just follow what Joe Shmoe said on WSB, that’ll work out great for you! \n\n395 shares @ $16.58 cost basis RKT. Because I know what is actually smart to invest in, and I picked the perfect time. Glad you bought in at the top of this company’s P&amp;D. Have fun bag holding when it never goes back up.",
        "created_utc": 1621363565,
        "id": "gylo8qk",
        "score": -2,
        "subreddit": "wallstreetbets",
        "created": 1621392365.0
    },
    {
        "author": "Dolancorp",
        "body": "Hey guys I sent two checks to the IRS to repay my stimmy.  They cashed both the $1400 and $600 checks within 5 days.  I never even received the $600, intuit is buying FDs with it as we speak.  \n\nThis is why I am long $GME.",
        "created_utc": 1620343788,
        "id": "gx7nt2p",
        "score": -4,
        "subreddit": "wallstreetbets",
        "created": 1620372588.0
    },
    {
        "author": "kkInkr",
        "body": "SMH, ADI, AMAT, ASML, ATEYY, AVGO, HIMX, INTT,  KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI,  PXLW, QCOM, QRVO, SIMO, SWKS, TER,\n\nbesides the usual AMD, INTC, NVDA, and TSM. Those 4 imo are outdated.  SMH is the ETF.\n\nCircuitry, CDNS, SNPS, ANSS, they are being ignored, but have dominant roles, imo.",
        "created_utc": 1619900068,
        "id": "gwkwyeo",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619928868.0
    },
    {
        "author": "kyle91892",
        "body": "Here is net asset value and underlying holdings.\n\nSite: [https://ark-funds.com/arkk](https://ark-funds.com/arkk)\n\nSummary Prospectus - Principal Risks Section - [https://etfs.ark-funds.com/hubfs/1\\_Download\\_Files\\_ETF\\_Website/Prospectuses/ARKK\\_Summary\\_Prospectus.pdf](https://etfs.ark-funds.com/hubfs/1_Download_Files_ETF_Website/Prospectuses/ARKK_Summary_Prospectus.pdf)\n\nHoldings:\n\nCompany Ticker CUSIP Shares Market Value($) Weight(%)\n\n1 TESLA INC TSLA 88160R101 3,459,467 2,342,059,159.00 9.95\n\n2 TELADOC HEALTH INC TDOC 87918A105 8,334,125 1,423,968,597.50 6.05\n\n3 ROKU INC ROKU 77543R102 3,420,473 1,220,082,719.10 5.19\n\n4 SQUARE INC - A SQ 852234103 4,615,084 1,143,433,211.84 4.86\n\n5 SHOPIFY INC - CLASS A SHOP 82509L107 703,222 867,121,951.54 3.69\n\n6 ZILLOW GROUP INC - C Z 98954M200 6,370,651 843,729,018.44 3.59\n\n7 SPOTIFY TECHNOLOGY SA SPOT L8681T102 3,067,150 804,053,372.50 3.42\n\n8 ZOOM VIDEO COMMUNICATIONS-A ZM 98980L101 2,474,413 794,534,014.30 3.38\n\n9 BAIDU INC - SPON ADR BIDU 056752108 3,452,947 733,026,118.63 3.12\n\n10 EXACT SCIENCES CORP EXAS 30063P105 5,346,316 711,166,954.32 3.02\n\n11 TWILIO INC - A TWLO 90138F102 1,764,060 662,298,686.40 2.81\n\n12 CRISPR THERAPEUTICS AG CRSP H17182108 4,991,200 658,239,456.00 2.80\n\n13 UNITY SOFTWARE INC U 91332U101 6,165,551 636,469,829.73 2.71\n\n14 COINBASE GLOBAL INC -CLASS A COIN 19260Q107 1,851,777 545,848,306.29 2.32\n\n15 DOCUSIGN INC DOCU 256163106 2,379,851 534,490,736.09 2.27\n\n16 INVITAE CORP NVTA 46185L103 14,352,796 502,347,860.00 2.14\n\n17 10X GENOMICS INC-CLASS A TXG 88025U109 2,312,229 456,434,004.60 1.94\n\n18 INTELLIA THERAPEUTICS INC NTLA 45826J105 5,308,716 425,121,977.28 1.81\n\n19 SEA LTD-ADR SE 81141R100 1,426,044 366,250,880.52 1.56\n\n20 IOVANCE BIOTHERAPEUTICS INC IOVA 462260100 11,409,802 357,583,194.68 1.52\n\n21 TWIST BIOSCIENCE CORP TWST 90184D100 2,594,471 354,352,849.18 1.51\n\n22 PALANTIR TECHNOLOGIES INC-A PLTR 69608A108 15,014,744 350,894,567.28 1.49\n\n23 NINTENDO CO LTD-UNSPONS ADR NTDOY 654445303 4,815,970 342,463,626.70 1.46\n\n24 KE HOLDINGS INC-ADR BEKE 482497104 6,308,021 332,054,225.44 1.41\n\n25 PURE STORAGE INC - CLASS A PSTG 74624M102 15,978,258 327,873,854.16 1.39\n\n26 IRIDIUM COMMUNICATIONS INC IRDM 46269C102 8,139,789 311,265,531.36 1.32\n\n27 BEAM THERAPEUTICS INC BEAM 07373V105 3,903,026 304,826,330.60 1.30\n\n28 PROTO LABS INC PRLB 743713109 2,556,555 287,868,093.00 1.22\n\n29 FATE THERAPEUTICS INC FATE 31189P102 3,147,221 270,251,867.27 1.15\n\n30 PAGERDUTY INC PD 69553P100 6,209,725 267,142,369.50 1.14\n\n31 2U INC TWOU 90214J101 6,622,988 269,290,692.08 1.14\n\n32 TENCENT HOLDINGS LTD-UNS ADR TCEHY 88032Q109 3,251,447 263,692,351.70 1.12\n\n33 INTERCONTINENTAL EXCHANGE IN ICE 45866F104 2,038,673 239,911,038.64 1.02\n\n34 TWITTER INC TWTR 90184L102 3,672,637 239,051,942.33 1.02\n\n35 DRAFTKINGS INC - CL A DKNG 26142R104 3,922,283 225,374,381.18 0.96\n\n36 SYNOPSYS INC SNPS 871607107 880,867 222,427,726.17 0.95\n\n37 NOVARTIS AG-SPONSORED ADR NVS 66987V109 2,570,263 221,119,725.89 0.94\n\n38 TERADYNE INC TER 880770102 1,633,739 213,709,398.59 0.91\n\n39 LENDINGTREE INC TREE UW 52603B107 947,951 206,947,182.81 0.88\n\n40 EDITAS MEDICINE INC EDIT 28106W103 5,472,206 204,496,338.22 0.87\n\n41 PACIFIC BIOSCIENCES OF CALIF PACB 69404D108 5,966,741 199,766,488.68 0.85\n\n42 VERACYTE INC VCYT 92337F107 3,980,523 195,045,627.00 0.83\n\n43 NANOSTRING TECHNOLOGIES INC NSTG 63009R109 1,931,542 154,561,990.84 0.66\n\n44 MATERIALISE NV-ADR MTLS 57667T100 4,742,189 146,438,796.32 0.62\n\n45 SERES THERAPEUTICS INC MCRB 81750R102 6,608,680 139,971,842.40 0.59\n\n46 TUSIMPLE HOLDINGS INC - A TSP 90089L108 3,334,334 132,373,059.80 0.56\n\n47 STRATASYS LTD SSYS M85548101 5,323,624 121,910,989.60 0.52\n\n48 BERKELEY LIGHTS INC BLI 084310101 2,426,102 122,227,018.76 0.52\n\n49 TRIMBLE INC TRMB 896239100 1,440,750 120,533,145.00 0.51\n\n50 UIPATH INC - CLASS A PATH 90364P105 1,495,273 112,579,104.17 0.48\n\n51 REGENERON PHARMACEUTICALS REGN 75886F107 218,766 106,101,510.00 0.45\n\n52 HUYA INC-ADR HUYA 44852D108 5,656,170 102,885,732.30 0.44\n\n53 CERUS CORP CERS 157085101 15,673,427 93,727,093.46 0.40\n\n54 SKILLZ INC SKLZ 83067L109 5,196,642 93,175,791.06 0.40\n\n55 COMPUGEN LTD CGEN M25722105 8,245,978 71,987,387.94 0.31\n\n56 PACCAR INC PCAR 693718108 664,473 61,065,068.70 0.26\n\n57 DREYFUS GOVT CASH MAN INS X9USDDGCM 44,419,453 44,419,452.87 0.19\n\n58 SYROS PHARMACEUTICALS INC SYRS 87184Q107 4,157,189 25,940,859.36 0.11",
        "created_utc": 1619912073,
        "id": "gwlnmww",
        "score": -5,
        "subreddit": "investing",
        "created": 1619940873.0
    }
]