[
    {
        "author": "tightnips",
        "body": "Agreed. They only grew to this size because they were free pre-covid\n\nCisco, Microsoft, Google, or others will take that share",
        "created_utc": 1632508713,
        "id": "he4fksk",
        "permalink": "/r/stocks/comments/pupmem/what_is_a_stock_that_you_believe_will_crash_and/he4fksk/",
        "score": 327,
        "subreddit": "stocks",
        "created": 1632537513.0
    },
    {
        "author": "tsimtsimtsim",
        "body": "Many said the exact same about GE, ExxonMobil, IBM, Cisco, AT&amp;T, HP, Intel, etc. etc. etc.\n\nApple didn't start getting big until the iPhone came out in 2007, 14 yrs ago. Is it that hard to believe anything can happen in the next 20 years?\n\nGuess what the biggest company was 20 yrs ago in 2001... GE at 405 billion market cap. Microsoft was second at 290 billion. Apple was nowhere near top 10 at 8 billion.",
        "created_utc": 1630546630,
        "id": "hb9gk5c",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9gk5c/",
        "score": 325,
        "subreddit": "stocks",
        "created": 1630575430.0
    },
    {
        "author": "Anadrol",
        "body": "It's fucking bullshit lies because I have been applying for 6 months to do contract IT consulting and have had only 2 interviews from serious companies and zero luck...\n\nHave over 10 yrs+ experience and even still getting certs as we speak from CISCO renewal to AWS \n\nThe accountants run companies and they are all waiting for 4th quarter to budget in after losses projections. \n\nProfit or people have to choose",
        "created_utc": 1631117709,
        "id": "hc2og3f",
        "permalink": "/r/wallstreetbets/comments/pkdetk/job_openings_soar_to_109_million_as_companies/hc2og3f/",
        "score": 89,
        "subreddit": "wallstreetbets",
        "created": 1631146509.0
    },
    {
        "author": "freakishgnar",
        "body": "Exactly. Zoom's whole existence is predicted on GoTo/Webex/Teams being garbage—because Eric Yuan was an engineering exec at Webex and was tired of getting beat up by customers about it. When he pitched the idea that became Zoom to Cisco (who acquired Webex), they passed. So he left and founded Zoom.   \n\n\nMy concerns are similar, but I see Zoom as an acquisition target and not a burnout. Once a juggernaut makes improvements to their product or gets sick of pouring money into it, I think they'll sell.",
        "created_utc": 1632517829,
        "id": "he51h87",
        "permalink": "/r/stocks/comments/pupmem/what_is_a_stock_that_you_believe_will_crash_and/he51h87/",
        "score": 64,
        "subreddit": "stocks",
        "created": 1632546629.0
    },
    {
        "author": "Elster-",
        "body": "I don’t think Apple will be at the top forever. No company stays at the top forever. \n\nAnother company comes along and will beat it. \n\nThere have been oil companies that people said ‘well we will always need oil, so they’ll always be up there’\n\nThere have been product companies like P&amp;G who own 90% of what you buy who you’d think would never be out of the top\n\nThere have been tech companies like Cisco &amp; IBM and people thought tech was here to stay, it was but someone better will always come along.\n\nWho knows what the next big market cap will come from.",
        "created_utc": 1630557436,
        "id": "hba1bog",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hba1bog/",
        "score": 61,
        "subreddit": "stocks",
        "created": 1630586236.0
    },
    {
        "author": "donm527",
        "body": "The “blue chips” of past... IBM, GE, CISCO, AOL, BlackBerry... they were blue chips because in their time they changed the world and set the path of progress in their areas. They didn’t fail... they just didn’t predict the next generation of tech or products and couldn’t keep up. IBM... they did pretty good if you see they started with typewriters and made the transition to computers. But Apple taking PCs to the consumer and using a GUI and mouse to make the average person be able to use one changed the world. Taking smartphones from a business only to the consumer with $20 data plan reachable to the average consumer... changed the world. While competitors laughed saying no one will spend that kind of money on it (Ballmer monkey boy) and others said no keyboard it won’t go far (Balckberry). Very tough to be able to lead for that long. Who knew a online bookstore would lead the world in cloud services??",
        "created_utc": 1630895251,
        "id": "hbrfv1j",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrfv1j/",
        "score": 55,
        "subreddit": "stocks",
        "created": 1630924051.0
    },
    {
        "author": "No_Blackberry_1870",
        "body": "For example look at the all time charts for Cisco and intel. In the 2000s everyone over paid for the growth potential those companies had and despite those companies doing the best they ever had in terms of revenues today. Their stock prices have still not reached their 2000s peaks.",
        "created_utc": 1630908191,
        "id": "hbs26pl",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbs26pl/",
        "score": 55,
        "subreddit": "stocks",
        "created": 1630936991.0
    },
    {
        "author": "Xerlic",
        "body": "MSFT was far and away the best performer with cost basis of $34.32 for +767% gain. CSCO was second with cost basis of $20.09.",
        "created_utc": 1631213334,
        "id": "hc7pho6",
        "permalink": "/r/stocks/comments/pkvonq/what_is_your_biggest_holding_for_the_long_term/hc7pho6/",
        "score": 44,
        "subreddit": "stocks",
        "created": 1631242134.0
    },
    {
        "author": "bboy1977",
        "body": "That’s a Cisco video conferencing display. They work really well when you need to video conference and see a large area like a boardroom.\n\nOr in this case your wife’s train tunnel.",
        "created_utc": 1632945604,
        "id": "heribsc",
        "permalink": "/r/wallstreetbets/comments/py15s2/jpow_wants_to_know_your_wifes_location/heribsc/",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1632974404.0
    },
    {
        "author": "natterdog1234",
        "body": "The company won’t crash and burn but Tesla. The company will go on to do great things im sure but the stock after we’re out of this lil euphoria period will never see 800b-1t mc again. Kinda like Cisco or something",
        "created_utc": 1632513562,
        "id": "he4r93d",
        "permalink": "/r/stocks/comments/pupmem/what_is_a_stock_that_you_believe_will_crash_and/he4r93d/",
        "score": 32,
        "subreddit": "stocks",
        "created": 1632542362.0
    },
    {
        "author": "Runningflame570",
        "body": "Enron, Sears, IBM, Cisco, GE, Xerox, and GM all come to mind.",
        "created_utc": 1630899168,
        "id": "hbrngtw",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrngtw/",
        "score": 30,
        "subreddit": "stocks",
        "created": 1630927968.0
    },
    {
        "author": "Summebride",
        "body": "FWIW, I consult for some pretty big household name companies, and they were using zoom long before pandemic (long before trump even killed off our early warning and response systems even)\n\nThey used it because it just... worked.  These companies have huge embedded Microsoft and Cisco and Google enterprises.  But for super easy, bug free video calls, they used zoom.  It was no headaches.\n\nI'd argue that aspect still exists.  These days there's always people saying \"i can't used X, or Y doesn't work on my device\". But everybody seems copacetic with zoom.",
        "created_utc": 1632521904,
        "id": "he5awpu",
        "permalink": "/r/stocks/comments/pupmem/what_is_a_stock_that_you_believe_will_crash_and/he5awpu/",
        "score": 27,
        "subreddit": "stocks",
        "created": 1632550704.0
    },
    {
        "author": "DrShitpostMDJDPhDMBA",
        "body": "I agree. It's a matter of time before any of the other major competitors come up with a solution that simply works as effectively as Zoom, unless Zoom diversifies its offerings somewhat.\n\nOn a related note, I'm surprised Microsoft's Teams is as successful as it is - anyone working at an institution with multiple email addresses or in a somewhat locked environment (e.g. healthcare, some universities) might accidentally have multiple profiles or be unable to use the service on non-work computers. It's been frustrating in my experience, but I guess it just doesn't work particularly well for my niche. Frequently people just end up doing Zoom meetings anyway (esp. if working with people outside of the immediate work network, like students) because there's so much less hassle, less often Cisco instead of Teams.",
        "created_utc": 1632510904,
        "id": "he4ksbk",
        "permalink": "/r/stocks/comments/pupmem/what_is_a_stock_that_you_believe_will_crash_and/he4ksbk/",
        "score": 25,
        "subreddit": "stocks",
        "created": 1632539704.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "Not this again.\n\nFAAMG aren't expensive compared to Microsoft, Cisco , and adobe of 2000.\n\n\nStuff like nvda and Tesla are bubble companies.\n\nCisco was a 550 billion company with 15 billion in revenue .\n\nNvda is about the same.\n\nMarket won't fall if FAAMG doesn't fall. It's a significant portion of the s&amp;p and nasdaq",
        "created_utc": 1631016423,
        "id": "hbx77h1",
        "permalink": "/r/stocks/comments/pjfe45/dotcom_bubble/hbx77h1/",
        "score": 22,
        "subreddit": "stocks",
        "created": 1631045223.0
    },
    {
        "author": "BroteinPR",
        "body": "Cisco is def. still relevant. Most WiFi systems at every airport and commercial office building is Cisco lol",
        "created_utc": 1630899276,
        "id": "hbrnodl",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrnodl/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1630928076.0
    },
    {
        "author": "articulat3d",
        "body": "Instructions unclear all in on cisco",
        "created_utc": 1632966730,
        "id": "hest7pf",
        "permalink": "/r/wallstreetbets/comments/py15s2/jpow_wants_to_know_your_wifes_location/hest7pf/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1632995530.0
    },
    {
        "author": "JRshoe1997",
        "body": "You know whats funny, if you teleport back into 2000 and told people that Cisco was going to triple their revenue than what they are doing now 20 years later but their stock was going to be lower than what it is now 20 years later people would call you crazy and stupid and that you don’t understand the growth in the internet. Kinda of funny.",
        "created_utc": 1630968344,
        "id": "hbv3g64",
        "permalink": "/r/stocks/comments/pj1axe/why_is_a_company_being_unprofitable_or_valuation/hbv3g64/",
        "score": 15,
        "subreddit": "stocks",
        "created": 1630997144.0
    },
    {
        "author": "datingadviceThrow789",
        "body": "MSFT AAPL CSCO GOOGL FB INTC\n\nWSB is fun, but why not allocate a portion of your portfolio to FCF generating Titans",
        "created_utc": 1631891054,
        "id": "hd7qyvw",
        "permalink": "/r/wallstreetbets/comments/pq1url/about_time_to_cash_out_and_start_over/hd7qyvw/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1631919854.0
    },
    {
        "author": "shadowpawn",
        "body": "Invest in what you know, understand.\n\nI was in Tech during '90s and put cash into Microsoft, Cisco watched it tick along each quarter.",
        "created_utc": 1631617771,
        "id": "hct17l9",
        "permalink": "/r/ValueInvesting/comments/pnxxby/old_guys_who_beat_the_market_how_did_you_do_it/hct17l9/",
        "score": 14,
        "subreddit": "ValueInvesting",
        "created": 1631646571.0
    },
    {
        "author": "bloppingzef",
        "body": "I wouldn’t say Cisco failed I’ve been seeing a lot more of their ads recently. It seems like they’re on the right track.",
        "created_utc": 1630899003,
        "id": "hbrn5qc",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrn5qc/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1630927803.0
    },
    {
        "author": "FinndBors",
        "body": "Teleport yourself back to 2000.\n\nThe internet was clearly going to keep getting bigger and more important in everyone's lives all over the globe. Cisco was the most important player in creating the hardware (and software) that allows the internet to run. Earnings have grown gangbusters throughout the last 5 years.\n\nLooking at that example, can you tell me that valuation isn't that important if growth (past and projected) is so high?",
        "created_utc": 1630951490,
        "id": "hbu24pd",
        "permalink": "/r/stocks/comments/pj1axe/why_is_a_company_being_unprofitable_or_valuation/hbu24pd/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1630980290.0
    },
    {
        "author": "mentaltease",
        "body": "This is one of the 10ish Spacs I bought.  Happy it might be a great decision. \nMind you,  only 10 shares,  but I'm just learning to do this. I'm not sure i'l ever buy spacs again. I'm buying more apple and Cisco for sure though cause my dividends have already gotten me more of a share since I reinvest dividends.",
        "created_utc": 1630794967,
        "id": "hbmdyqs",
        "permalink": "/r/wallstreetbets/comments/phwes2/some_rocketlabrklb_information_for_the_big_brain/hbmdyqs/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630823767.0
    },
    {
        "author": "doducduy96",
        "body": "Some of the richest people I know with a net worth ranging from $1M to $20M+ all have their core position in a broad market ETF. It’s easy to say from hindsight. You could have bought into Enron, Yahoo, Cisco, Intel, etc all blue chips and were giants at the time.",
        "created_utc": 1631484708,
        "id": "hcma45h",
        "permalink": "/r/wallstreetbets/comments/pmy6kh/my_dad_told_me_to_invest_in_index_funds_because/hcma45h/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1631513508.0
    },
    {
        "author": "RaguSpidersauce",
        "body": "I'm about 60% in index funds.  \n\nThe other 40% is spread about 20 other stocks/ETF/CEF.   (warning, not all value.  ;) ) ARKK, BIGZ, BRKB, CHPT, CVX, CSCO, DIS, EXPE, HD, IAC, INTC, JNJ, LYV, MTCH, NOC, PFE, PNW, O, VTRS, VMEO, WMT.",
        "created_utc": 1631300249,
        "id": "hccgphj",
        "permalink": "/r/ValueInvesting/comments/plmz0i/how_many_stocks_do_you_own_i_have_so_many_good/hccgphj/",
        "score": 7,
        "subreddit": "ValueInvesting",
        "created": 1631329049.0
    },
    {
        "author": "JRshoe1997",
        "body": "Yeah Cisco is still definitely around and growing revenue too. The main thing that in 2000 the biggest thing was the internet. Cisco was one if the first big networking companies and people thought that they were going to be the biggest company in the world and their stock became extremely overvalued to the point they eventually crashed and came down despite their growth.",
        "created_utc": 1630900399,
        "id": "hbrpsca",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrpsca/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630929199.0
    },
    {
        "author": "kriptonicx",
        "body": "Depends what you're holding, depends on interest rates, depends on how reliable your broker is.\n\nIf you're leveraging individual stocks or even a portfolio of a few riskier stocks the result would probably be different. Imagine leveraging tech during the dotcom bubble. Even a tiny amount of leverage on a fairly typical 1999 tech portfolio of say pets.com, Cisco and Microsoft, probably wouldn't have ended so well.\n\nAnother thing you need to factor in is interest rates and expected returns. Margin debt is practically free with today's interest rates, but in the past you would have been paying 5%+ on whatever you borrowed. This may have still been low enough for you to make a small profit, but the 7-8% average market return you're back testing against could be higher than what we should expect going forward given how high valuations are and other proposed long-term risks such as the end of the current economic cycle.\n\nFinally you need to keep in mind your broker doesn't have to lend you anything, and almost all brokers reserve the right to reduce or remove your line of credit as they please. You need to account for the fact that in highly volatile markets your broker is likely to significantly increase margin requirements and they could even remove your ability to borrow against certain assets entirely.\n\nMy guess is you're running a simulation with a dataset highly biased to some of the strongest market returns and lowest interest rates in history. If you assume these things will continue going forward, sure, it's a no brainer. But if the market is flat for a decade and interest rates rise just a few percent you're not going to look so smart. That said, generally a good way to increase returns is to increase risk. So you probably should expect slightly higher than average returns with this strategy, the question is whether it's worth it after you adjust for the risk and volatility of such a strategy.",
        "created_utc": 1632241562,
        "id": "hdqgk0f",
        "permalink": "/r/investing/comments/psl3gz/is_there_a_certain_amount_of_leverage_that_is/hdqgk0f/",
        "score": 6,
        "subreddit": "investing",
        "created": 1632270362.0
    },
    {
        "author": "General_Asleep",
        "body": "Inflation affect stock price too and cisco stock price is still 25% lower than it was when it had a 12b a year revenue.",
        "created_utc": 1630944881,
        "id": "hbtmv1u",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbtmv1u/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630973681.0
    },
    {
        "author": "darthnugget",
        "body": "Is this a trick question? You just said Amazon! They are like the Titanic… they are unsinkable. ;) eerrr wait hrm… \n\nAlthough they do give me the vibe Cisco gave me back in 2000s when everyone thought they were going to be the center of the Internet. I have a feeling over time Amazon will fade as people get sick of the cheap stuff and the fraudulent items being sold there… oh wait that was eBay! Just a matter of time for Amazon too.",
        "created_utc": 1630821396,
        "id": "hbnoywo",
        "permalink": "/r/stocks/comments/pi7cc4/what_is_the_most_diversified_stock_out_there_that/hbnoywo/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630850196.0
    },
    {
        "author": "rozodots",
        "body": "Eh yea, perhaps I'm a bit harsh but man I got burned out on having to explain it to my userbase lol  \n\nDoes the product work?  Yes, Zoom does the job.\n\nBut it has no ecosystem like MS has with Teams and Office.  Cisco is in everything and, if your tech dept can afford it, then they offer some truly amazing solutions.  \n\nZoom, to me, is inferior not solely of personal experience but because it's going to be increasingly harder to convince IT managers to use a Chinese based video conf solution as cybersecurity becomes a greater concern and all the while there's plenty of more trustworthy US based solutions. \n\nThis is why I also agree it'll be an acquisition target.  It's too familiar a name and concept to just drop off.  I mean, Radio Shack and Compaq computers are still a thing.  I see Zoom living on as an existence similar to theirs.",
        "created_utc": 1632520097,
        "id": "he56rah",
        "permalink": "/r/stocks/comments/pupmem/what_is_a_stock_that_you_believe_will_crash_and/he56rah/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1632548897.0
    },
    {
        "author": "905marianne",
        "body": "I think curaleaf, trulieve and cisco will do well in time. I imagine a safe bet would be who ever gets the contract to manufacture the child proof lids or scotts miracle grow. I like to gamble a bit so medmen dispensary is intriguing. Edibles will be huge I think.",
        "created_utc": 1630703000,
        "id": "hbhrr6j",
        "permalink": "/r/stocks/comments/phcz4r/looking_to_get_into_weedvapetobacco_companies/hbhrr6j/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630731800.0
    },
    {
        "author": "TheLaser40",
        "body": "The other half is still waiting for the fundamentals to catch up with their CSCO shares from 2000.",
        "created_utc": 1631151211,
        "id": "hc4qw0a",
        "permalink": "/r/wallstreetbets/comments/pki7fp/gme_gamestop_reports_financial_results_for_q2_2021/hc4qw0a/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631180011.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "You're wrong.\n\nThe reason the stock doesn't move like Apple is because its revenue is pretty flat. They are  in the process of switching to a subscription model\n\n&amp;#x200B;\n\nThey are a very conservative company. Borderline too much.\n\n&amp;#x200B;\n\nThey have a 45.71% Payout Ratio from their FCF.  Which is 15B dollars. \n\n[https://www.macrotrends.net/stocks/charts/CSCO/cisco/free-cash-flow](https://www.macrotrends.net/stocks/charts/CSCO/cisco/free-cash-flow)\n\n&amp;#x200B;\n\nThey have 4 years worth of dividends in cash on hand.",
        "created_utc": 1632149656,
        "id": "hdlibrx",
        "permalink": "/r/stocks/comments/prvus8/csco_hasnt_declared_a_dividend_yet_what_happens/hdlibrx/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1632178456.0
    },
    {
        "author": "bungholio99",
        "body": "Cisco was on a alltime high last weeks and now just slightly down???",
        "created_utc": 1632517268,
        "id": "he505ab",
        "permalink": "/r/stocks/comments/pupmem/what_is_a_stock_that_you_believe_will_crash_and/he505ab/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1632546068.0
    },
    {
        "author": "sorryAboutThatChief",
        "body": "Back at the turn of the century, I was holding a boatload of AAPL, MSFT, CSCO, INTC, and Nortel. \n\nWhat could go wrong? Everything I owned went down about 50%. Lost about 150K. \n\nI only hold broad-based ETFs now - VT, VTI for example. \n\nGoogle will definitely survive a zombie apocalypse, but chances are you would loose some of your invested capital as the zombies patrolled the streets. If you are are just getting into the market, start slow - get to know the process with an ETF like VTI or VOO.",
        "created_utc": 1632784744,
        "id": "hej2bhg",
        "permalink": "/r/stocks/comments/pwdi9g/rstocks_daily_discussion_monday_sep_27_2021/hej2bhg/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1632813544.0
    },
    {
        "author": "_xAmn0oX_",
        "body": "there are no firm rules. also, 'rolling' need not be approached as a single action. all it means is you close out one trade and initiate another. look out for trends in IV - if you're rolling out, you generally don't want to do so in an elevated IV environment.\n\nif you feel a lower strike works better for the leaps you are buying: go for it. perhaps it does make sense to size down the position a bit during the roll for diversification's sake. ideally you'd want to manage risk in a way that minimizes the likelihood of the totality of your CSCO trades to turn into a loss. you might also want to have look at PMCC (selling calls against your position / diagonals using leaps)",
        "created_utc": 1630509622,
        "id": "hb73ilr",
        "permalink": "/r/options/comments/pfv0gr/ideal_time_to_roll_out_leaps_in_the_green/hb73ilr/",
        "score": 3,
        "subreddit": "options",
        "created": 1630538422.0
    },
    {
        "author": "PVDnerd",
        "body": "Cisco is in a lot of different markets but focusing on there IT Infrastructure/Networking/Wireless equipment they are a leader. I work with Infrastructure day-to-day and majority of the time everyone is using Cisco hardware. Its pricey, compared to others but its pretty reliable in my experience. \n\nWas on a call with some Cisco sales guys and they were saying 85% of the \"internet\" flows through Cisco equipment, which i dont think is that far fetched to say. \n\nPersonally not bad company but they do lack innovation and rely on the name to sell products. I guess it works though so we'll see",
        "created_utc": 1630878185,
        "id": "hbqh4h2",
        "permalink": "/r/ValueInvesting/comments/pif8jm/my_top_tech_stocks_to_watch_that_pays_dividends/hbqh4h2/",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1630906985.0
    },
    {
        "author": "wrex619",
        "body": "this feels good. just came in. there will be buying tomorrow premarket.\n\nhttps://www.marketscreener.com/quote/stock/CISCO-SYSTEMS-INC-4862/news/Cisco-JPMorgan-Adjusts-Price-Target-for-Cisco-Systems-to-67-From-62-Maintains-Overweight-Rating-36415016/",
        "created_utc": 1631568962,
        "id": "hcqqofs",
        "permalink": "/r/wallstreetbets/comments/pnn4wa/what_are_your_moves_tomorrow_september_14_2021/hcqqofs/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631597762.0
    },
    {
        "author": "julyobserver",
        "body": "CSCO is giving it a go.",
        "created_utc": 1632968115,
        "id": "hesw56u",
        "permalink": "/r/wallstreetbets/comments/py3dkk/what_are_your_moves_tomorrow_september_30_2021/hesw56u/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1632996915.0
    },
    {
        "author": "pml1990",
        "body": "My condolences. As investors, investing in a good company is never enough, we also need to be ever vigilant about management's and founders' attitude toward protecting shareholders, and so far, the level of disrespect that PLTR is showing to shareholders by their stock compensation scheme is palpable. PLTR will likely be a profitable company, just like CISCO was, but whether shareholders will be on the gravy train or will be taken for a ride is just as important as assessing the company's future. So far, it is not a good look. \n\nThere is also no avenue for shareholders to fight this abuse because the ability for PLTR shareholders to wage activist battle is non-existent due to Peter Thiel's and co. concentrated holdings of the company (49%).",
        "created_utc": 1630902690,
        "id": "hbrtr2z",
        "permalink": "/r/stocks/comments/pipu1w/pltr_paying_themselves_first/hbrtr2z/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630931490.0
    },
    {
        "author": "qu83rt",
        "body": "Cisco sucks as a stock.  There's some worthwhile space spacs coming up that I can't list here..",
        "created_utc": 1630801899,
        "id": "hbmriok",
        "permalink": "/r/wallstreetbets/comments/phwes2/some_rocketlabrklb_information_for_the_big_brain/hbmriok/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630830699.0
    },
    {
        "author": "SteveSharpe",
        "body": "Cisco isn’t really shifting towards software. They are selling the same hardware but now with a subscription. And a lot of clients aren’t happy about it. \n\nPlus I’d say of all the manufacturers I work with, Cisco has the biggest problems with supply chain. Some gear is 6+ months out.",
        "created_utc": 1631797301,
        "id": "hd2nuoh",
        "permalink": "/r/stocks/comments/pp789l/cisco_projects_growth_of_5_to_7_over_next_four/hd2nuoh/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1631826101.0
    },
    {
        "author": "brolix",
        "body": "Started out with $1k in CSCO calls. Rode that from 3.5 to 5.0, then rolled all that money in these calls. All woosh from there.",
        "created_utc": 1630610174,
        "id": "hbcpsiv",
        "permalink": "/r/wallstreetbets/comments/pgo7du/after_months_of_losing_i_finally_have_a_win_worth/hbcpsiv/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630638974.0
    },
    {
        "author": "Spammalanche",
        "body": "Yeah if look around the IT department of literally any medium to large business, CISCO equipment will be everywhere.",
        "created_utc": 1630934032,
        "id": "hbszj5k",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbszj5k/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630962832.0
    },
    {
        "author": "mamadidntraiseabitch",
        "body": "What the fuck are those large algo block orders on CSCO?",
        "created_utc": 1631818816,
        "id": "hd43tzj",
        "permalink": "/r/wallstreetbets/comments/ppab5b/daily_discussion_thread_for_september_16_2021/hd43tzj/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631847616.0
    },
    {
        "author": "dark_bravery",
        "body": "i know your timeframe is only tomorrow, but where do you think $IRNT can be in 3 years? i am guessing it's at least a $10B company, if not $20B, that's a price around $90-$180 in 3 years or so. the sharks like Cisco and others will be looking to buy them. every name in cyber sec over the last few years has already gone to the moon. $IRNT may be just starting.\n\nlook at the exec staff, look at what they are marking. but yea, i know, you're trying to get to valhallah this week not 3 years from now. i'm in for $10k right now, probably ratcheting that up to $25k-$100k.",
        "created_utc": 1632008045,
        "id": "hde8tdz",
        "permalink": "/r/wallstreetbets/comments/pqs7co/what_is_your_single_highest_conviction_idea_right/hde8tdz/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632036845.0
    },
    {
        "author": "robopal5k",
        "body": "Csco is overlooked by many, but I think it's very solid long play.",
        "created_utc": 1631791786,
        "id": "hd2e2zc",
        "permalink": "/r/stocks/comments/pp789l/cisco_projects_growth_of_5_to_7_over_next_four/hd2e2zc/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631820586.0
    },
    {
        "author": "rw1337",
        "body": "Zoom / Roku / Snowflake will be viewed like Cisco was back in the 90s. Insanely overvalued but it'll only take a major crash to correct the price.",
        "created_utc": 1631909289,
        "id": "hd8y9a1",
        "permalink": "/r/stocks/comments/ppxkq8/genuine_question_about_meme_valuations_vs_real/hd8y9a1/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631938089.0
    },
    {
        "author": "The-big-vitamin-D",
        "body": "Good advertisement for cisco",
        "created_utc": 1633013542,
        "id": "heuun35",
        "permalink": "/r/wallstreetbets/comments/pygmgc/daily_discussion_thread_for_september_30_2021/heuun35/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633042342.0
    },
    {
        "author": "veilwalker",
        "body": "Check out CSCO or maybe even INTC\n\nNVDA has been on a tear but seems really rich but sometimes it is better to go with the market than against it.",
        "created_utc": 1631035412,
        "id": "hbyd6m3",
        "permalink": "/r/stocks/comments/pjr5v7/qualcomm_or_nvidia/hbyd6m3/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631064212.0
    },
    {
        "author": "wrex619",
        "body": "went with CSCO\n\nwas going to go with SDC but seems so overbought i don't want a heart attack\n\nmade too much money off CCJ to give it back",
        "created_utc": 1631563510,
        "id": "hcqdcx1",
        "permalink": "/r/wallstreetbets/comments/pnn4wa/what_are_your_moves_tomorrow_september_14_2021/hcqdcx1/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631592310.0
    },
    {
        "author": "No-Stuff-4060",
        "body": "CSCO just went from green dildo to shitting it's pants in 2 seconds",
        "created_utc": 1631731649,
        "id": "hczeewy",
        "permalink": "/r/wallstreetbets/comments/pon39n/daily_discussion_thread_for_september_15_2021/hczeewy/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631760449.0
    },
    {
        "author": "mamadidntraiseabitch",
        "body": "CSCO POPPING",
        "created_utc": 1631731164,
        "id": "hczd826",
        "permalink": "/r/wallstreetbets/comments/pon39n/daily_discussion_thread_for_september_15_2021/hczd826/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631759964.0
    },
    {
        "author": "switchitup_lets",
        "body": "Most of my money is in VOO, though I do keep my day interesting by setting a small percentage to more speculative stocks. Note I can go on perfectly fine if I were to lose everything in the speculative part, so I would highly advise you to do your own research first and know how much you can allocate to these speculative positions. I would highly advise you to not put a significant portion.\n\nAs of now, my speculative positions have been in PLTR, SOFI, and recently closed on CSCO. Deciding what to do with CSCO profits, but probably add most of it back to VOO. Maybe treat myself to just 1 share of GME, who knows lol",
        "created_utc": 1631853598,
        "id": "hd66ech",
        "permalink": "/r/stocks/comments/pomr5b/rstocks_daily_discussion_wednesday_sep_15_2021/hd66ech/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631882398.0
    },
    {
        "author": "RennieDelano",
        "body": "MSFT 20.4%\n\nAAPL 17.4%\nSQ 12.8%\nAMD 10.4%\nABBV 7.7%\nNIO 7.7%\nO 7.5%\nTTCF 4.3%\nPFE 3.8%\nCSCO 3.8%\nAFL 3.4%\nVTRS 0.7%\n\nI invest $1,000 a month. It’s a pretty boring portfolio.",
        "created_utc": 1630598999,
        "id": "hbbxo0d",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hbbxo0d/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630627799.0
    },
    {
        "author": "ReganMacNeil1973",
        "body": "Right before the dot com bust i was looking to short something so I make a list of the top 50 tech stocks at that time along with their P/E ratios.\n\nOne jumped right out at me (Cisco Systems, the P/E was over 100) and I said to myself, \"No way is this company worth over 100 times its earnings.\"\n\nI shorted about 250k worth of Cisco and made a fortune.",
        "created_utc": 1631579885,
        "id": "hcredlo",
        "permalink": "/r/investing/comments/pnquqe/what_was_your_best_investment_decision/hcredlo/",
        "score": 2,
        "subreddit": "investing",
        "created": 1631608685.0
    },
    {
        "author": "IllmanneredFlanders",
        "body": "So PUT Cisco Nabisco and Crisco ya digyo",
        "created_utc": 1631743104,
        "id": "hd06l1a",
        "permalink": "/r/stocks/comments/pof4he/microsoft_announces_share_buyback_and_increase_of/hd06l1a/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631771904.0
    },
    {
        "author": "tightnips",
        "body": "Cisco got greedy and left R&amp;D off the docket. They started charging a lot for software and customers hate the support costs.\n\nThe wireless space is being tapped by Aruba and core from the likes of Arista. Phones are strong and security is good, but people haven’t been loving the “jack of all trades” recently.\n\nCisco is great, they’re the standard, but I personally don’t see anything yielding high growth.",
        "created_utc": 1631792625,
        "id": "hd2ff0u",
        "permalink": "/r/stocks/comments/pp789l/cisco_projects_growth_of_5_to_7_over_next_four/hd2ff0u/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631821425.0
    },
    {
        "author": "thetagodfather",
        "body": "No, most of the posts in here don’t understand blue chips\n\nEven big techs that still RAKE in cash are being mentioned- \n\nIBM, CSCO\n\nIBM’s 2020 revenue was almost $80 billion \n\nCSCO 2020 revenue $50 billion \n\nJust cause they aren’t in growth mode doesn’t mean they are down and out\n\nA better example would have been Sears",
        "created_utc": 1630911725,
        "id": "hbs702y",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbs702y/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630940525.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "Cisco had 15 billion in revenue and a 550 b market cap\n\nAmazon has 500 b in revenue and a 1.7t Market cap.\n\nThey are completely different",
        "created_utc": 1630857794,
        "id": "hbp7ihp",
        "permalink": "/r/stocks/comments/pi7cc4/what_is_the_most_diversified_stock_out_there_that/hbp7ihp/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630886594.0
    },
    {
        "author": "G1G1G1G1G1G1G",
        "body": "Fucking cisco...JDS and nortel are the two I’m painfully familiar with being a former JDS employee and Ottawa resident. The attitude was not similar to what I’m bring up - its identical. \n\nAt least cisco stayed alive to maybe one day become something.",
        "created_utc": 1630899268,
        "id": "hbrnnud",
        "permalink": "/r/stocks/comments/pipu1w/pltr_paying_themselves_first/hbrnnud/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630928068.0
    },
    {
        "author": "paranoidpirateclown",
        "body": "CSCO like all tech stocks, sell before earnings, buy before investor days.  This is the way. Investor day 9/15.",
        "created_utc": 1631544760,
        "id": "hcp3mbr",
        "permalink": "/r/wallstreetbets/comments/pncese/daily_discussion_thread_for_september_13_2021/hcp3mbr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631573560.0
    },
    {
        "author": "Bobross315",
        "body": "I just found out my brokerage includes an insider trading report (Vickers Insider Prophet Report). Out of curiosity, I looked at CSCO and just see a column of SOLDS since March, with no BUYS since March. Is it fair to consider this concerning or not so much?",
        "created_utc": 1631394379,
        "id": "hchbpml",
        "permalink": "/r/investing/comments/pm40p7/daily_advice_thread_all_basic_help_or_advice/hchbpml/",
        "score": 1,
        "subreddit": "investing",
        "created": 1631423179.0
    },
    {
        "author": "wrex619",
        "body": "$CSCO\n \n--JPMorgan Adjusts Price Target for Cisco Systems to $67 From $62, Maintains Overweight Rating",
        "created_utc": 1631568846,
        "id": "hcqqevj",
        "permalink": "/r/wallstreetbets/comments/pnn4wa/what_are_your_moves_tomorrow_september_14_2021/hcqqevj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631597646.0
    },
    {
        "author": "anonyymi",
        "body": "Is there anything more boomer than CSCO? Besides IBM...",
        "created_utc": 1631646424,
        "id": "hcutggq",
        "permalink": "/r/wallstreetbets/comments/pnzrg1/daily_discussion_thread_for_september_14_2021/hcutggq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631675224.0
    },
    {
        "author": "paranoidpirateclown",
        "body": "CSCO investor day going well.  rocket fueling for take off",
        "created_utc": 1631724306,
        "id": "hcywj7j",
        "permalink": "/r/wallstreetbets/comments/pon39n/daily_discussion_thread_for_september_15_2021/hcywj7j/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631753106.0
    },
    {
        "author": "Fit-Mycologist-6951",
        "body": "What is a good tech position I can get at places like Salesforce, Shopify, SAP, IBM, Cisco, Lenovo, Wework, EA, Taketwointeractive, pinterest, and other big tech companies.\n\nI am leaning towards nothing too coding-heavy like a pure software engineer. \n\nSome jobs I am thinking of are AWS solutions architect, cloud cybersecurity, database admin (how technical do I need to be for this one?), business analyst and become a senior, product manager, devops (might be coding heavy?), system admin, cloud analyst (how is pay?), cloud specialist, cloud consultant\n\nWhat do you think I should go for in terms of pay for reward/effort. \n\nMy skills: some python, SQL, visualization tools like tableau, azure fundamentals certified. Done a few things on wireshark, other cybersecurity tools i forgot. \n\nJobs have been an excel database analyst and nothing too heavy with coding yet so I’ve never done a code-heavy job.",
        "created_utc": 1632691149,
        "id": "hee9nwu",
        "permalink": "/r/wallstreetbets/comments/pw1mqg/what_are_your_moves_tomorrow_september_27_2021/hee9nwu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632719949.0
    },
    {
        "author": "NastyMonkeyKing",
        "body": "Wrong? It certainly is not. Thats the thought process that leads you to invest in Cisco and intel in 2000. Idk what to say when you're just dismissing facts to make a claim. Id wait for a rebuttal but You cant show historic evidence that backs up your claim so..",
        "created_utc": 1632714967,
        "id": "hefmtxn",
        "permalink": "/r/stocks/comments/pvg5rg/costco_nike_and_fedex_are_warning_theres_more/hefmtxn/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632743767.0
    },
    {
        "author": "CheapPersonality249",
        "body": "I like the stock I'm sitting on 2321shares. Not into options though looks like to many people loose everything 🙃 😕. But with my cost basis at 10.91 I'm doing very well with the stock. CSCO is another nice profit in my portfolio and I'm holding both for long term to enjoy the dividends and the growth in the stock values. Hopefully both will increase dividends much more as both have huge profits to share with me 😆 🤣 😂",
        "created_utc": 1630675043,
        "id": "hbfypbg",
        "permalink": "/r/StockMarket/comments/pgwr6o/bac_options_play/hbfypbg/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630703843.0
    },
    {
        "author": "therealist11",
        "body": "Cannot recommend stocks as I am not a financial advisor. Just doing my own research. But here is everything that I own. \n\nETF - SCHD\n\nStocks - XOM, PFE, PFG, ED, APAM, ABBV, VZ, KO, CSCO, CVS, NUE, ADM, WM, GILD, JPM, QCOM, GPC, AAPL, MSFT, TGT, PG, MMM, EMR, TROW, IBM, JNJ, AVGO.",
        "created_utc": 1630710710,
        "id": "hbi81wp",
        "permalink": "/r/StockMarket/comments/pgss70/anything_i_should_add_or_sell_new_to_this/hbi81wp/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630739510.0
    },
    {
        "author": "es_cl",
        "body": "&gt; There have been tech companies like Cisco &amp; IBM and people thought tech was here to stay, it was but someone better will always come along.\n\nI think we’re all waiting for that *next brand of technology* and I’m not sure if anybody knows what that is. The Internet of Things had a bit of buzz but then I think people realize that a smartwatch isn’t as a necessity as a smartphone. Nothing has surpassed the smartphone yet and AAPL is still king of the smartphone, at least in the US.",
        "created_utc": 1630588913,
        "id": "hbb9tbh",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hbb9tbh/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630617713.0
    },
    {
        "author": "webbisode_andronicus",
        "body": "Can you buy bonds or just equity? \nFor a 3 month game I would buy: \n\n$100,000 in an investment grade bond or *cash*. This is for buying a dip even though the time frame is so short. If there is a correction you can buy more of your stocks or at least dollar cost average and buy once a month! \n\n$100,000 JP Morgan $JPM\n\n$120,000 Cisco Systems $CSCO\n\n$140,000 Thermo Fisher $TMO\n\n$40,000 Yeti Holdings $YETI\n\nThis gives you coverage in biotech, finance, small-cap, and technology and maybe one dividend payment period between now and December. \n\nI’ll place my own practice trades on Tuesday and follow along OP! When does the game end? December 15? !remindme",
        "created_utc": 1630793106,
        "id": "hbma4u4",
        "permalink": "/r/stocks/comments/phzp60/playing_a_stock_game_in_school_need_advice_on/hbma4u4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630821906.0
    },
    {
        "author": "Opeth4Lyfe",
        "body": "Because it’s trading rich right now. No matter how wonderful a company is it can still be over valued. Look at Intel, Cisco, GE, Amazon in the tech bubble. Tons of potential growth, lots of enthusiasm about their futures, no one thought they would go down. They corrected by as much as 90% in some cases…but on average lost 70% of their value. Amazon went from 113 to 6 but the company was in tremendous shape and growing incredibly fast. Would have taken over a decade to recover…and most of those companies are still not back at their previous ATH.",
        "created_utc": 1630878171,
        "id": "hbqh3eo",
        "permalink": "/r/stocks/comments/phyt50/aapl_or_cash/hbqh3eo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630906971.0
    },
    {
        "author": "Investing8675309",
        "body": "Cisco is just astronomically overpriced and they make it so all their gear only works with other Cisco gear, really hard to switch away from. It’s a smart business move. The speed they move is glacial. \nOracle I guess is more cloud in general. Long term inflexible contracts with little innovation. Just talk to an Oracle customer. That company’s ratio of sales/lawyers to engineers is unique, nothing like it in tech. \nFunny because I see both these companies pop up all the time on this forum as a good value stock and at least the interaction I have with them from a customer standpoint there is no way I would ever touch these things.",
        "created_utc": 1630973172,
        "id": "hbvd5eu",
        "permalink": "/r/ValueInvesting/comments/pif8jm/my_top_tech_stocks_to_watch_that_pays_dividends/hbvd5eu/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1631001972.0
    },
    {
        "author": "vansterdam_city",
        "body": "There are a lot of dividend related posts today but this might be the dumbest.\n\nA good dividend stock is something that you see a basically infinite time horizon for (let’s say 30 years). Coca Cola 30 years ago is a classic example, its a product that doesn’t change much and was likely be enjoyed by people for decades to come. \n\nTechnology is by nature prone to innovative disruption. This is horrible for the prospects of a dividend paying company. I couldn’t think of a worse two words to pair together on an investment choice. \n\nTechnology is for GROWTH as you disrupt the market. Buying into the mature end of the cycle is right when you are prone to being disrupted yourself by a new player. \n\nSome of your picks like Intel and Cisco could easily be disrupted and become dinosaurs. For a measly 2%-ish dividend? You have to be kidding me to think this is a sane investment thesis.",
        "created_utc": 1630944654,
        "id": "hbtmcnj",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbtmcnj/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630973454.0
    },
    {
        "author": "kiwifruta",
        "body": "Why the hate for Oracle and Cisco in the cloud infrastructure space?",
        "created_utc": 1630949831,
        "id": "hbtyc33",
        "permalink": "/r/ValueInvesting/comments/pif8jm/my_top_tech_stocks_to_watch_that_pays_dividends/hbtyc33/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1630978631.0
    },
    {
        "author": "EchoooEchooEcho",
        "body": "I read in a book that exon or some other boomer oil company returns beat Intel or cisco returns from 80s or 90s to 2012. \n\nNvidia now is like Intel back then, leading edge tech but valued way to high.",
        "created_utc": 1630955094,
        "id": "hbuadcb",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbuadcb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630983894.0
    },
    {
        "author": "LackAccomplishe",
        "body": "90s could be the top in 99. It took over a decade even for Microsoft, Qualcomm, Intel to match gains (not accounting to dividends). So some of popular stocks mentioned in this thread if the crash happened and parachutes weren't given for it, bunch of people in this subreddit would be bagholders for centuries to come lol. Another really hot stock was Cisco. Traders were correct about the company, but very much wrong about the price.\n\nI find amusing people replying to me that people who were caught in dot com crash should be happy. Applies to every US crash ever then.",
        "created_utc": 1631552445,
        "id": "hcpm834",
        "permalink": "/r/stocks/comments/pnafo5/lets_plan_for_a_crash_so_if_it_happens_we_make/hcpm834/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631581245.0
    },
    {
        "author": "paranoidpirateclown",
        "body": "Apple event showed CSCO Webex support for Ipad.   CSCO investor day tomorrow.  Should be good.",
        "created_utc": 1631646052,
        "id": "hcusiot",
        "permalink": "/r/wallstreetbets/comments/pnzrg1/daily_discussion_thread_for_september_14_2021/hcusiot/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631674852.0
    },
    {
        "author": "paranoidpirateclown",
        "body": "CSCO investor day next week.  Get in before the event.  Oct 15 60 calls cheap",
        "created_utc": 1631303601,
        "id": "hccojgf",
        "permalink": "/r/wallstreetbets/comments/pli02m/daily_discussion_thread_for_september_10_2021/hccojgf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631332401.0
    },
    {
        "author": "paranoidpirateclown",
        "body": "The CSCO of Bajor.  Investor day on Wed. Big zoom type products for schools.",
        "created_utc": 1631542445,
        "id": "hcoy7xd",
        "permalink": "/r/wallstreetbets/comments/pncese/daily_discussion_thread_for_september_13_2021/hcoy7xd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631571245.0
    },
    {
        "author": "mamadidntraiseabitch",
        "body": "What are the GRAY AH bars on RH?\n\nCSCO has a 3.26m one… wtf is that?",
        "created_utc": 1631822998,
        "id": "hd4e3pd",
        "permalink": "/r/wallstreetbets/comments/ppab5b/daily_discussion_thread_for_september_16_2021/hd4e3pd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631851798.0
    },
    {
        "author": "Arcticflux",
        "body": "I hear you. I was looking at GoldmanSachs calls DEEP ITM and far out. They were down to 375 from a recent high of 420, also earnings coming up, I think this call would blow it out of the water with pretty sizable gains.\n\nOnly issue of course is the enormous cost associated with that call. Seems like great upside.\n\nThere are a bunch of these I wanted to do this with. Cisco, Apple, Spy, GS.",
        "created_utc": 1632348882,
        "id": "hdw57sp",
        "permalink": "/r/wallstreetbets/comments/ptfnuf/what_are_your_moves_tomorrow_september_23_2021/hdw57sp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632377682.0
    },
    {
        "author": "reiberica",
        "body": "CSCO. Lots of option volume on this one too.",
        "created_utc": 1632270557,
        "id": "hdsbs0i",
        "permalink": "/r/stocks/comments/psq8ye/stocks_on_a_discount/hdsbs0i/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632299357.0
    },
    {
        "author": "AMediocreWhiteGuy",
        "body": "GM, Ford, Cummins, Caterpillar, General Electric, Union Pacific, Walmart, Coca Cola, McDonalds, Nokia, IBM, Apple, Intel, Microsoft, Hewlett-Packard, Amazon, Google, Cisco Systems, Boeing, Lockheed Martin, Texas Instruments, General Dynamocs, Northrop Grumman, Exxon Mobil, General Atomics, AMD, Oracle, VMWare",
        "created_utc": 1632677242,
        "id": "hedb560",
        "permalink": "/r/stocks/comments/pvvzsl/whats_your_top_5_stocks_to_buy_and_hold_for_the/hedb560/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632706042.0
    },
    {
        "author": "dew_you_even_lift",
        "body": "They are the best and cheapest video conferencing for corporate. Before you would have to pay 30k-100k to outfit a office with Cisco webex. Zoom was able to do it for a tenth of the price.\n\nZoom exploded because of COVID, but their main market is corporate companies.\n\nI’ve used lots of video conferencing software and worked at some competitors. Zoom’s the best hands down.",
        "created_utc": 1632553697,
        "id": "he6zrt0",
        "permalink": "/r/stocks/comments/pupmem/what_is_a_stock_that_you_believe_will_crash_and/he6zrt0/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632582497.0
    },
    {
        "author": "frozen_mercury",
        "body": "Cisco ceased to innovate. Plus, that was dot com bubble",
        "created_utc": 1632545007,
        "id": "he6mzg6",
        "permalink": "/r/stocks/comments/pupmem/what_is_a_stock_that_you_believe_will_crash_and/he6mzg6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632573807.0
    },
    {
        "author": "jessejerkoff",
        "body": "Tis is like saying isn't nestle really dependent on selling thing?\n\nO365 (b2b software), win (b2b/c) and azure cloud (iaas, paas, SaaS) covers an insanely wife field from networking over os and development tools or ai or whatever you want to bi and productivity,\n\nI mean... That is like rolling SAP, Oracle, Cisco and palantir and something like omv or ionos into one company. And that's just their \"main\" sources of revenue.",
        "created_utc": 1630488061,
        "id": "hb60rbc",
        "permalink": "/r/stocks/comments/pfaza9/why_does_microsoft_have_a_higher_pe_ratio_that/hb60rbc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630516861.0
    },
    {
        "author": "Ouiju",
        "body": "If you want the boomer Okta, that's CSCO. Ironically they're both pretty decent.",
        "created_utc": 1630562770,
        "id": "hba9c8o",
        "permalink": "/r/investing/comments/pg26gz/okta_announces_strong_second_quarter_results/hba9c8o/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630591570.0
    },
    {
        "author": "RunningJay",
        "body": "I’ve seen many technologies go to Cisco to die. Storage platforms, compute platforms, various softwares.\nThis problem is when the product is integrated with the Cisco portfolio. There are exceptions when the product is left to stand alone, e.g. AppD; although they have lost their throne IMO through lack of innovation.",
        "created_utc": 1630548017,
        "id": "hb9jgve",
        "permalink": "/r/stocks/comments/pffpr4/crowdstrike_earnings/hb9jgve/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630576817.0
    },
    {
        "author": "General_Asleep",
        "body": "Cisco revenu in 1999 was like 12b a year and it is 50b now.",
        "created_utc": 1630933456,
        "id": "hbsyh96",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbsyh96/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630962256.0
    },
    {
        "author": "merlinsbeers",
        "body": "CSCO and INTC were about 20% of the [S&amp;P heat map](https://finviz.com/map.ashx?t=sec). Just inconceivably huge relative to everything else.",
        "created_utc": 1630940385,
        "id": "hbtcj38",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbtcj38/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630969185.0
    },
    {
        "author": "Murderous_Waffle",
        "body": "No it's because of the fucking licensing model. But working on Cisco IOS is the superior experience from a router/switch standpoint compared to ubiquiti. \n\n-currently ripping out Cisco at work for ubiquiti. It makes me sad but it is the most cost effective.",
        "created_utc": 1630928536,
        "id": "hbsqoi7",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbsqoi7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630957336.0
    },
    {
        "author": "BigBrianBrand",
        "body": "Disclaimer: I didn’t read the article. \n\nI want to point out how too many people on this sub look strictly at the PE ratio while ignoring earnings growth simultaneously. \n\nSomeone on here tried telling me how Cisco in 2000 is somehow comparable to Google in 2021 because of the PE ratio lol. Company Earnings growing into the stock price isn’t an unusual phenomenon.",
        "created_utc": 1630951335,
        "id": "hbu1rvy",
        "permalink": "/r/ValueInvesting/comments/piurbu/value_investing_is_not_buying_cheap_stocks/hbu1rvy/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1630980135.0
    },
    {
        "author": "skilliard7",
        "body": "The internet was the future in 1999, didn't stop people from losing over 80% on blue chip, profitable, growing companies companies like Cisco.\n\nIt doesn't matter how good a company is if the valuation is too high.",
        "created_utc": 1631206697,
        "id": "hc79djm",
        "permalink": "/r/stocks/comments/pkvonq/what_is_your_biggest_holding_for_the_long_term/hc79djm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631235497.0
    },
    {
        "author": "Qw3yDK8pH5m1",
        "body": "I looked into CSCO since I use their equipment a lot but their share price is expensive for the small dividend. May have to look into those sectors though.\n\nThanks!",
        "created_utc": 1631129787,
        "id": "hc3hudl",
        "permalink": "/r/StockMarket/comments/pingkg/in_10_years_75000_a_year_in_dividends/hc3hudl/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1631158587.0
    },
    {
        "author": "Panther4682",
        "body": "I run 3 month ‘LEAPS’ and write calls. Usually do very well out of them. Just remember there are people that purchased Cisco in 2000 for $80 still waiting to get their money back.",
        "created_utc": 1631174592,
        "id": "hc5py24",
        "permalink": "/r/options/comments/pknglu/leaps_vs_everything_else/hc5py24/",
        "score": 1,
        "subreddit": "options",
        "created": 1631203392.0
    },
    {
        "author": "Cantgetfooledagain1",
        "body": "I am not in meme stocks - like I said if big tech doesn’t drop 25% I’m good. But yeah Cisco is big GUH man",
        "created_utc": 1631317010,
        "id": "hcdhzu1",
        "permalink": "/r/wallstreetbets/comments/plsh4c/weekend_discussion_thread_for_the_weekend_of/hcdhzu1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631345810.0
    },
    {
        "author": "wrex619",
        "body": "CSCO is having an event the 15th and it's been down 5 days in a row. way over sold",
        "created_utc": 1631568538,
        "id": "hcqpp8c",
        "permalink": "/r/wallstreetbets/comments/pnn4wa/what_are_your_moves_tomorrow_september_14_2021/hcqpp8c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631597338.0
    },
    {
        "author": "Kidcuddz",
        "body": "CSCO within the next week. Mark my retarded words",
        "created_utc": 1631557933,
        "id": "hcpzkf8",
        "permalink": "/r/wallstreetbets/comments/pncese/daily_discussion_thread_for_september_13_2021/hcpzkf8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631586733.0
    },
    {
        "author": "mamadidntraiseabitch",
        "body": "FKING CSCO ANALYSTS CUCKS UPGRADE BUT THE STOCK DIES 🤡",
        "created_utc": 1631817043,
        "id": "hd3zgnn",
        "permalink": "/r/wallstreetbets/comments/ppab5b/daily_discussion_thread_for_september_16_2021/hd3zgnn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631845843.0
    },
    {
        "author": "BYTHEPPL4THEPPL",
        "body": "$RUN $ENPH $SPWR $TAN $FSLR, those are some pretty popular ones",
        "created_utc": 1631212968,
        "id": "hc7olvr",
        "permalink": "/r/wallstreetbets/comments/pl1vvi/pick_any_solar_stock_you_want_theres_a_decent/hc7olvr/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1631241768.0
    },
    {
        "author": "Itonlygetshigher420",
        "body": "Will buy some solar stocks. Enph and spwr looking good  alongside maxeon solar. \n\n\nHowever, markets not liking this evergrande issue. Could be like earlier in the year with multiple banks impacted.\n\n\nWill wait and see but would like a pull back.",
        "created_utc": 1631094479,
        "id": "hc1guay",
        "permalink": "/r/stocks/comments/pk75bk/rstocks_daily_discussion_wednesday_sep_08_2021/hc1guay/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1631123279.0
    },
    {
        "author": "ZarrCon",
        "body": "I think most renewable companies fall under Technology - Semiconductor Equipment (ENPH, SEDG) or Industrials - Electrical Components &amp; Equipment (PLUG, RUN). Then you'll have some classified under Utilities like BEP, NEE, XCEL. Tangentially related would be Materials for things like lithium producers I'd imagine.\n\nThe classification probably has something to do with all of the microelectronics that are manufactured for various components along with no fuel source. Those components are built in factories instead of pulled out of the ground like oil and gas. The energy sector has already been defined to be related to extraction and refinement of those fuels. Also, the previously mentioned companies all vary quite a bit in terms of what they produce, making it unreasonable to have them grouped under the same sector.\n\nI don't follow the industry, I just looked at some of the top holdings from a renewable energy ETF but that's my guess.",
        "created_utc": 1630978227,
        "id": "hbvndwz",
        "permalink": "/r/ValueInvesting/comments/pja8rs/so_im_learning_about_the_different_sectors_and/hbvndwz/",
        "score": 5,
        "subreddit": "ValueInvesting",
        "created": 1631007027.0
    },
    {
        "author": "optima5512",
        "body": "Is it good time to buy ENS, ENPH yet? \nShould I wait for it to go down further?",
        "created_utc": 1631813903,
        "id": "hd3rpwm",
        "permalink": "/r/stocks/comments/pp9ybw/rstocks_daily_discussion_options_trading_thursday/hd3rpwm/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1631842703.0
    },
    {
        "author": "wellidliketotellyou",
        "body": "ENPH has been falling for two straight weeks now. What gives?",
        "created_utc": 1631714768,
        "id": "hcy9piz",
        "permalink": "/r/stocks/comments/pomr5b/rstocks_daily_discussion_wednesday_sep_15_2021/hcy9piz/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1631743568.0
    },
    {
        "author": "VerySlump",
        "body": "Solar is the move, 3.5 trillion deal will be on the presidents desk in October. \n\nCSIQ, FSLR, ENPH, ICLN",
        "created_utc": 1631277691,
        "id": "hcazu3e",
        "permalink": "/r/wallstreetbets/comments/pli02m/daily_discussion_thread_for_september_10_2021/hcazu3e/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631306491.0
    },
    {
        "author": "GinOnIce",
        "body": "ENPH baby",
        "created_utc": 1631248527,
        "id": "hc9wc9m",
        "permalink": "/r/wallstreetbets/comments/pl5dpa/what_are_your_moves_tomorrow_september_10_2021/hc9wc9m/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631277327.0
    },
    {
        "author": "GinOnIce",
        "body": "ENPH being a bitch lately",
        "created_utc": 1631031447,
        "id": "hby3ih6",
        "permalink": "/r/wallstreetbets/comments/pjk0x4/daily_discussion_thread_for_september_07_2021/hby3ih6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631060247.0
    },
    {
        "author": "Bilbo-Baggins77",
        "body": "ENPH produces a better product.",
        "created_utc": 1631232219,
        "id": "hc8xq3a",
        "permalink": "/r/wallstreetbets/comments/pl1vvi/pick_any_solar_stock_you_want_theres_a_decent/hc8xq3a/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631261019.0
    },
    {
        "author": "Itonlygetshigher420",
        "body": "Solar stocks.\n\nEnph, spwr, maxn",
        "created_utc": 1630993724,
        "id": "hbweun8",
        "permalink": "/r/stocks/comments/pjetlr/what_solid_stocks_with_good_growthfinancials_are/hbweun8/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631022524.0
    },
    {
        "author": "claytonjaym",
        "body": "I sold a bit at 75$ but I bought at ~5$, hoping ENPH continues on its tear toward the stars.",
        "created_utc": 1631293882,
        "id": "hcc1qop",
        "permalink": "/r/stocks/comments/pkvonq/what_is_your_biggest_holding_for_the_long_term/hcc1qop/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631322682.0
    },
    {
        "author": "MyPoopWontComeOut",
        "body": "ENPH is in oversold territory.",
        "created_utc": 1631543587,
        "id": "hcp0us1",
        "permalink": "/r/wallstreetbets/comments/pncese/daily_discussion_thread_for_september_13_2021/hcp0us1/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631572387.0
    },
    {
        "author": "404me420",
        "body": "ENPH",
        "created_utc": 1631244911,
        "id": "hc9pk8h",
        "permalink": "/r/stocks/comments/pkvonq/what_is_your_biggest_holding_for_the_long_term/hc9pk8h/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631273711.0
    },
    {
        "author": "yahtzeemaker",
        "body": "I hate to break it to you but you are wrong again. I’ve been doing this for a while and Im not trying to time a correction. We are overextended. Everyone who is paying attention knows we are overextended. But I’ve got long positions in EVRI, ENPh, FUBO, RUN, ZS, NVDA, PLUG, CRON, RNG, VVNT, SDC and more. I also have downside protection because I know when history speaks, I listen.",
        "created_utc": 1631560409,
        "id": "hcq5ny7",
        "permalink": "/r/wallstreetbets/comments/pncese/daily_discussion_thread_for_september_13_2021/hcq5ny7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631589209.0
    },
    {
        "author": "Thetrader2896",
        "body": "Ah smart u know if I traded my leaps on enph I think I would be up couple hundred percent. But I got stuck in the long term bullshit idea. Swinging and day trading is better. How old r u. I am 25, been in the markets for while but didn't really trade till last may. I traded more last year. Before that it was roth ira",
        "created_utc": 1630723752,
        "id": "hbixe4a",
        "permalink": "/r/options/comments/phhqo3/options_on_3x_etfs/hbixe4a/",
        "score": 1,
        "subreddit": "options",
        "created": 1630752552.0
    },
    {
        "author": "LoneTempleGuard",
        "body": "ENPH NCLH MSFT DRI",
        "created_utc": 1630874785,
        "id": "hbq9que",
        "permalink": "/r/stocks/comments/picygx/what_do_you_feel_have_been_your_5_most_profitable/hbq9que/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630903585.0
    },
    {
        "author": "Itonlygetshigher420",
        "body": "Fully agree on emphase.\n\nI wish they do a stock split around the 200 mark. Come back around 50s and that should bring in new buyers.\n\nNvda I agree. It seems like a tough 2 banger from here.",
        "created_utc": 1630829313,
        "id": "hbnyo80",
        "permalink": "/r/stocks/comments/pi5qfe/stocks_that_will_generate_multiple_baggers_in_the/hbnyo80/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630858113.0
    },
    {
        "author": "Crosspatterns",
        "body": "Time to buy ENPH. Enphase Energy’s products are in more than half of all solar installations and they have a growth rate of over 20% per year.",
        "created_utc": 1631115203,
        "id": "hc2ihie",
        "permalink": "/r/StockMarket/comments/pg9mpj/biden_administration_aims_to_cut_costs_for_solar/hc2ihie/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1631144003.0
    },
    {
        "author": "Lt_Danimal",
        "body": "You and I both. Scored on ENPH in the low $40s and thought this could be another big potential earner. I've been dollar cost averaging down but it hasn't been fun.",
        "created_utc": 1630700638,
        "id": "hbhmgwr",
        "permalink": "/r/stocks/comments/oeyrx2/curious_about_a_great_possible_opportunity_iea/hbhmgwr/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630729438.0
    },
    {
        "author": "Juffin",
        "body": "SEDG and ENPH",
        "created_utc": 1631777697,
        "id": "hd1xmm9",
        "permalink": "/r/investing/comments/pp0jnw/what_are_some_of_your_favorite_duopolies/hd1xmm9/",
        "score": 1,
        "subreddit": "investing",
        "created": 1631806497.0
    },
    {
        "author": "trishul14",
        "body": "I have CRM in the list, I would say V and ENPH are also at support levels.",
        "created_utc": 1631518110,
        "id": "hcnz5ai",
        "permalink": "/r/options/comments/pn32lc/i_scanned_over_150_charts_this_weekend_here_are/hcnz5ai/",
        "score": 0,
        "subreddit": "options",
        "created": 1631546910.0
    },
    {
        "author": "captain_americano",
        "body": "Cramer sits at his desk, red faced and angry. WSB has mocked him once more. The glow of the screen is painful as insults dart into his retina. He begins obsessively pressing F5, each comment casting him further into the pits of rage and despair.  \n\n\"Enough. I shall downvote them all.\" He sorts by new.",
        "created_utc": 1631284290,
        "id": "hcbe1hg",
        "permalink": "/r/wallstreetbets/comments/pli02m/daily_discussion_thread_for_september_10_2021/hcbe1hg/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631313090.0
    },
    {
        "author": "AmericanHerstoryX",
        "body": "[mondo](https://i.pinimg.com/originals/29/f5/c8/29f5c866d146b601895a7bdb3c5c4c83.jpg) or [kool-aid burst](https://groceryeshop.us/image/cache/data/new_image_2020/ABSB0004LVY4G-600x600.jpg)",
        "created_utc": 1630790093,
        "id": "hbm3q2p",
        "permalink": "/r/wallstreetbets/comments/phcns0/weekend_discussion_thread_for_the_weekend_of/hbm3q2p/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630818893.0
    },
    {
        "author": "Smirk_Mcjerk",
        "body": "Word. Well I’m not an alarmist, and I agree that this plague in term of a F Tornado (F1 to F5) scale, this plague is a F1 in terms of death rate. But the next one though….",
        "created_utc": 1631399353,
        "id": "hchnoo1",
        "permalink": "/r/wallstreetbets/comments/pmeyfk/airlines_say_rise_in_covid19_cases_is_hurting/hchnoo1/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1631428153.0
    }
]