[
    {
        "author": "bluelevelmeatmarket",
        "body": "Meh you cant make very much money selling books online. Such a dumb concept that will never take off. Glad you got out before you lost it all.",
        "created_utc": 1631384563,
        "id": "hcgoj18",
        "score": 13759,
        "subreddit": "wallstreetbets",
        "created": 1631413363.0
    },
    {
        "author": "sjonnyboy",
        "body": "This sounds so retarded that it could work. Im in",
        "created_utc": 1632655691,
        "id": "hec20xa",
        "score": 7765,
        "subreddit": "wallstreetbets",
        "created": 1632684491.0
    },
    {
        "author": "DoggieDadd",
        "body": "isn’t this what happened to that poor lad that offed himself because he thought he had a huge loss but it really wasn’t?",
        "created_utc": 1632744114,
        "id": "hegn1cg",
        "score": 6534,
        "subreddit": "wallstreetbets",
        "created": 1632772914.0
    },
    {
        "author": "youngbudding",
        "body": "You did it. You singlehandedly built google into the global empire it is today. Gold star.",
        "created_utc": 1632662647,
        "id": "hecdob6",
        "score": 4751,
        "subreddit": "wallstreetbets",
        "created": 1632691447.0
    },
    {
        "author": "Portugalpaul",
        "body": "it expired today, when the hell did you plan on taking profit???",
        "created_utc": 1631308150,
        "id": "hccz50g",
        "score": 4112,
        "subreddit": "wallstreetbets",
        "created": 1631336950.0
    },
    {
        "author": "-xfactor",
        "body": "There’s a lot to be said. Put simply…\n\n(1) I believed a few years back that EVs would be a game changer\n\n(2) I started to research the industry, the supply chain and macro trends to determine that the best investment opportunity for me was investing in a mineral supplier.  Since I knew I was wanting to take a big risk, I thought it was wise to invest in a miner since there would be a higher likelihood of success rather than betting on one major EV player. I thought this approach would be similar to those who made a fortunate selling mining picks during the gold rush rather than taking the chance to mine themselves. \n\n(3) I then began to look at different countries and realized quickly that Australia is a leader when it comes to minerals so it seemed like a no brainer to me.\n\n(4) I then looked at the different opportunities in Australia and started filtering down by key factors such as management, current grades, director’s confidence, etc. to ultimately decide on LTR",
        "created_utc": 1631568003,
        "id": "hcqof8a",
        "score": 3525,
        "subreddit": "wallstreetbets",
        "created": 1631596803.0
    },
    {
        "author": "evDev84",
        "body": "Shit tons of fake accounts to pump stuff with, and it just so happened to coincide with a time that essentially the subreddit kicked a major hedge fund square in its balls.  Gee I wonder",
        "created_utc": 1631973868,
        "id": "hdbzn5n",
        "score": 3112,
        "subreddit": "wallstreetbets",
        "created": 1632002668.0
    },
    {
        "author": "MrEcksDeah",
        "body": "Only thing WSB taught me is that if you make a dumb decision and convince millions of others to make the same dumb decisions it becomes a good decision.",
        "created_utc": 1631150654,
        "id": "hc4pqs6",
        "score": 2982,
        "subreddit": "wallstreetbets",
        "created": 1631179454.0
    },
    {
        "author": "NoConsideration8361",
        "body": "I’m a retard for sure and know very little about options, but if I’m reading it right you decided to get rid of calls that don’t expire until the end of January next year?\n\nWere you really that worried about the last 1600?\n\nThis was a bad bet to begin with but at that point you are balls deep, why not just pray it spikes so you can sell for at least less of a loss than you already took?",
        "created_utc": 1633008141,
        "id": "heuiia1",
        "score": 2939,
        "subreddit": "wallstreetbets",
        "created": 1633036941.0
    },
    {
        "author": "jsntx",
        "body": "^ This 😂😂😂\n\nMy graduate level finance professor was a hedge fund manager with a few billion under mgmt. It was a tough class. I would've definitely benefited from having spent time at wsb before taking the class.\n\nHe told us the story that he once analyzed a stock in class and found out that it was severely overvalued. The next day no one attended class. They were shorting the stock. This was at a time when placing trades was hard.",
        "created_utc": 1631148724,
        "id": "hc4loyr",
        "score": 2827,
        "subreddit": "wallstreetbets",
        "created": 1631177524.0
    },
    {
        "author": "Electrical_Moose_116",
        "body": "By the time it corrects, ill have so much profit that the dip will be fine",
        "created_utc": 1631537970,
        "id": "hcoowct",
        "score": 2605,
        "subreddit": "wallstreetbets",
        "created": 1631566770.0
    },
    {
        "author": "Loki-Don",
        "body": "Yeah, people have been saying this since Jobs died a decade ago. Here is what’s different. \n\nLast year 54% of all Apples revenue was the iPhone. 10 years ago, it was 82%. \n\nLast year Apple cleared 50 billion in revenue for services (i cloud services, Apple Music, Warranties etc). 10 years ago that revenue was 7 billion a year. \n\nLast year Apple cleared 25 billion in wearable, home gear and accessories (Apple TV, WiFi routers, Apple Watch, AirPods etc). 10 years ago that was 3 billion a year. \n\nBasically, Apple has found 65 billion a year in new revenue sources since Jobs died, and make more money (in real terms) on iPhones than they did 10 years ago. \n\nThey will be fine.",
        "created_utc": 1632443600,
        "id": "he168r3",
        "score": 2529,
        "subreddit": "stocks",
        "created": 1632472400.0
    },
    {
        "author": "inf3ct3dn0n4m3",
        "body": "Man it seems really easy to make money when you have a lot of money. I see up .72% and I'm like \"tf am I gonna do with that\". .72% for you is 7k.... lol",
        "created_utc": 1631066460,
        "id": "hc0c75s",
        "score": 2146,
        "subreddit": "wallstreetbets",
        "created": 1631095260.0
    },
    {
        "author": "pixieservesHim",
        "body": "If I had an award, you would get it",
        "created_utc": 1632417977,
        "id": "hdzka7u",
        "score": 1956,
        "subreddit": "wallstreetbets",
        "created": 1632446777.0
    },
    {
        "author": "Narradisall",
        "body": "“I can lose it all if I want to”.",
        "created_utc": 1631620601,
        "id": "hct5gun",
        "score": 1925,
        "subreddit": "wallstreetbets",
        "created": 1631649401.0
    },
    {
        "author": "Working-Form1858",
        "body": "Nobody’s ignoring it..But what else can you do? Stick your money in the bank and watch inflation eat way at it? By Bonds and watch inflation eat that money away? Speculative investments like physical gold, silver or crypto? \n\nBesides NOBODY knows when it’s gonna crash it could come 2 weeks, 2 months, 2 quarters or 2 yearly s from now. Make a plan, stick with it and buy quality companies.",
        "created_utc": 1631031664,
        "id": "hby41ev",
        "score": 1854,
        "subreddit": "investing",
        "created": 1631060464.0
    },
    {
        "author": "ZealousidealSecret4",
        "body": "This was obvious when it happened",
        "created_utc": 1632622396,
        "id": "heao5c2",
        "score": 1764,
        "subreddit": "wallstreetbets",
        "created": 1632651196.0
    },
    {
        "author": "International_Band72",
        "body": "Nice bro ur killing it but  next time don’t forget to post the options that ur buying so we can inverse",
        "created_utc": 1631743247,
        "id": "hd06wwk",
        "score": 1713,
        "subreddit": "wallstreetbets",
        "created": 1631772047.0
    },
    {
        "author": "RAMBOH1988",
        "body": "Real men don't pull out.\n\nWe put it all in and hold",
        "created_utc": 1631999007,
        "id": "hddnak0",
        "score": 1593,
        "subreddit": "wallstreetbets",
        "created": 1632027807.0
    },
    {
        "author": "Plechazunga_",
        "body": "I completely forgot it was someone right in front of him, I always thought it was something on the Jumbotron.",
        "created_utc": 1632829500,
        "id": "hel1dwb",
        "score": 1589,
        "subreddit": "wallstreetbets",
        "created": 1632858300.0
    },
    {
        "author": "engineertee",
        "body": "I would try to delete your trading app and not look at it.",
        "created_utc": 1632943610,
        "id": "herddh8",
        "score": 1581,
        "subreddit": "stocks",
        "created": 1632972410.0
    },
    {
        "author": "TenragZeal",
        "body": "You forgot the part where it trades sideways for weeks.",
        "created_utc": 1633005651,
        "id": "heudmwc",
        "score": 1546,
        "subreddit": "wallstreetbets",
        "created": 1633034451.0
    },
    {
        "author": "dollhairmillionaire",
        "body": "*calls mom*. Hey I effed up real bad. Can I borrow a charger for a while, I swear I'll give it back.",
        "created_utc": 1632837942,
        "id": "helhl96",
        "score": 1524,
        "subreddit": "wallstreetbets",
        "created": 1632866742.0
    },
    {
        "author": "throwaway_0x90",
        "body": "It is absolutely true that when you make that first million, it becomes much easier from there - as long as you don't do anything wreckless. But we're all in this sub, so.... we're looking at a dude with nearly a million in GME reporting earnings in under 24hrs.",
        "created_utc": 1631073683,
        "id": "hc0q41o",
        "score": 1483,
        "subreddit": "wallstreetbets",
        "created": 1631102483.0
    },
    {
        "author": "North3rnLigh7s",
        "body": "Probably an insurance settlement and he’s too dumb to move it somewhere else",
        "created_utc": 1631624598,
        "id": "hctcnqa",
        "score": 1446,
        "subreddit": "wallstreetbets",
        "created": 1631653398.0
    },
    {
        "author": "juaggo_",
        "body": "Judging from this and the latest quarterly reports, they are truly trying to aim towards *long-term* growth. With no long-term debt, they could really reinvent themselves and now with actually good leadership, they can do it.",
        "created_utc": 1631132397,
        "id": "hc3o9ve",
        "score": 1428,
        "subreddit": "stocks",
        "created": 1631161197.0
    },
    {
        "author": "Dogtief",
        "body": "That's great. They should just sell the packaging so we can throw it straight into the ocean",
        "created_utc": 1632438817,
        "id": "he0w6ks",
        "score": 1406,
        "subreddit": "wallstreetbets",
        "created": 1632467617.0
    },
    {
        "author": "rxneutrino",
        "body": "Whos going to break it to the CLOV crowd?",
        "created_utc": 1631226464,
        "id": "hc8l483",
        "score": 1364,
        "subreddit": "wallstreetbets",
        "created": 1631255264.0
    },
    {
        "author": "augusttrip2019",
        "body": "Reposting here: you’re missing the point of his bet.\n\nPeople don't see the full idea behind Michael Burry's TSLA short. Every single article is about how he tweeted at papa Musk and how he thinks that the company is the worst thing since he dropped his glass eye into his cat's litter box.\n\nHe doesn't think that Tesla will implode. He doesn't think it's a failing company. He just sees the reality, which is that all of their profits/revenues are way in the future.\n\nLet's just say you win a time-delayed lottery and get $1,000,000 in 15 years. Not bad! Now let's say you won the same lottery in Venezuela in 2005. It's not even worth cashing the ticket.\n\nIt's the same deal with companies. Growth companies, however promising, have most of their expected profits in the future. Those profits have to be discounted by the **interest rate** to be turned into todays dollars. In other words, it doesn't matter how much money Tesla is going to make in the future if interest rates surge today. Well... it does matter... it's just worth a lot less.\n\nSo how does this relate to the Burry bet? You just have to scroll down a few lines on his 13F filing.\n\nBurry has almost as many GOOG/FB calls as he does TSLA puts. Around \\~$330MM of them. Why does this matter? These are big tech companies that are actually printing out metric shit-tons of profit today.\n\nInterest rates stay the same but big tech goes up? Break even. Big tech goes down? Break even. Interest rates rise? Burry makes more money in a year than all of your wives boyfriends combined.\n\nTL;DR:\n\nThe Burry TSLA short isn't a bet against Tesla, it's a bet on interest rates rising (AKA inflation).",
        "created_utc": 1631213589,
        "id": "hc7q45n",
        "score": 1305,
        "subreddit": "wallstreetbets",
        "created": 1631242389.0
    },
    {
        "author": "ecafyelims",
        "body": "\"Here's $92k, my entire life savings.  But wait, that's not the impressive part. I'm now buying calls on the latest meme stock on WSB. Okay ... hold on, this will only take a minute ... done. See that red line going straight down? Yep, I lost it all.\"",
        "created_utc": 1631622680,
        "id": "hct90oz",
        "score": 1305,
        "subreddit": "wallstreetbets",
        "created": 1631651480.0
    },
    {
        "author": "Gyshall669",
        "body": "Reddit sucks shit as a company. If they went public as a company 10 years ago, would have bought in on hype but they’re too big now and they are garbage at monetization. \n\nI work in digital advertising and no client ever wants to use Reddit cause it, again, sucks shit.",
        "created_utc": 1630644213,
        "id": "hber28s",
        "score": 1278,
        "subreddit": "wallstreetbets",
        "created": 1630673013.0
    },
    {
        "author": "Daegoba",
        "body": "I wouldn’t hold more than 6 months of monthly expenses in cash. The rest, I would spread over the safest, most fucking boring ass ETFs I could, some well-established stocks, a few index funds, and me? I’d “gamble” with maybe 5% on good potential up-and-coming companies in industries that show a strong promise of growth and expansion.\n\nYou have to have an emergency fund. There’s simply no telling what can happen day to day, and risking your livelihood just isn’t an option nowadays. I just got hit by a car 6 weeks ago and am unable to work. Luckily, I had an emergency fund to cover my bills or I would be colossally FUCKED.  $15-20k in cash is not going to make you rich invested over decades. Why risk it? It’s worth more if it’s kept close to insulate you in case of unforeseen circumstances. It simply doesn’t make sense not to. \n\nFidelity, Vanguard, &amp; TD all offer their own (as well as assess to) any and all small return/low risk ishares type shit to park good money in. They’re a great option to have as far as “safe” plays that will mostly keep pace with the markets and still not over leverage you as far as risk. \n\nThe well-established individual stocks will always be a good play so long as you don’t get caught up in every little detail of day-to-day pricing. Anything in the top 20 of the S&amp;P will keep you right on pace with the greater economy, and give you some security and reassurance that you’re getting the most out of your money. \n\nThe “gambling” is what will keep you interested, educated, and give you potentially the most bang for your buck. I’m not talking about YOLO’s into some Foreign penny stock. I’m talking about common-sense plays that’s anyone who doesn’t have their head in the sand. Electric cars. 3D printing. Green Energy. Shit like that. These are budding industries that are obviously going to grow and expand over the next decade. Which companies will rise to the top? Who the fuck knows, but it’s sure as the weather that there’s a garage out there with the next Jobs, Bezos, or Musk out there right now. Why not try to catch it, and learn a little in the process?",
        "created_utc": 1632062434,
        "id": "hdgu8r6",
        "score": 1265,
        "subreddit": "stocks",
        "created": 1632091234.0
    },
    {
        "author": "CluelessStick",
        "body": "If he received a check it means he signed up for the class action and surrendered his rights to sue individually, no? He should have opt-out before not after the settlement",
        "created_utc": 1632610331,
        "id": "he9z5gu",
        "score": 1243,
        "subreddit": "wallstreetbets",
        "created": 1632639131.0
    },
    {
        "author": "canigetawoop_woop",
        "body": "The best posts weren't the \"I made $3 million\" or \"I lost $4 million\", cause those people never needed that money. The best posts were the \"I had 15,000 in my savings, bumped it to 40k over 2 months, and lost it all yesterday please help my family is starving\" God I'm hard thinking about it",
        "created_utc": 1631975555,
        "id": "hdc34x4",
        "score": 1226,
        "subreddit": "wallstreetbets",
        "created": 1632004355.0
    },
    {
        "author": "Grieferbastard",
        "body": "We don't lose faith here.\n\nJust money.\n\nFuck you, you're doing it wrong.",
        "created_utc": 1630512444,
        "id": "hb7afou",
        "score": 1190,
        "subreddit": "wallstreetbets",
        "created": 1630541244.0
    },
    {
        "author": "JohnnyH_12",
        "body": "This thing is going to moon within the next few trading days.  Or it won't.  This is financial advice, I stayed at a Holiday Inn once.",
        "created_utc": 1630545843,
        "id": "hb9ev4x",
        "score": 1181,
        "subreddit": "wallstreetbets",
        "created": 1630574643.0
    },
    {
        "author": "JGalefail",
        "body": "People like this is what makes this community so great. I too will be a billionaire but I have found a 3x leverage and will be doing it in 13 months.",
        "created_utc": 1631215622,
        "id": "hc7v13g",
        "score": 1179,
        "subreddit": "wallstreetbets",
        "created": 1631244422.0
    },
    {
        "author": "Northeastlocal",
        "body": "You dont only owe it to us, you probably owe the bank too",
        "created_utc": 1631573510,
        "id": "hcr0s25",
        "score": 1122,
        "subreddit": "wallstreetbets",
        "created": 1631602310.0
    },
    {
        "author": "Potatoe42069",
        "body": "Wish I didn't paper hand my single share of Google at $1525. But it freed up cash to buy naked calls that lost 100%",
        "created_utc": 1632668954,
        "id": "hecrfvu",
        "score": 1091,
        "subreddit": "wallstreetbets",
        "created": 1632697754.0
    },
    {
        "author": "jtmn",
        "body": "Cocaine, Guns, and GME. \n\nGot it.",
        "created_utc": 1631547972,
        "id": "hcpbdg2",
        "score": 1067,
        "subreddit": "wallstreetbets",
        "created": 1631576772.0
    },
    {
        "author": "That_Other_Person",
        "body": "Y'all remember the Spy 220p or is it just me",
        "created_utc": 1631338114,
        "id": "hcejze8",
        "score": 1060,
        "subreddit": "wallstreetbets",
        "created": 1631366914.0
    },
    {
        "author": "goblintrading",
        "body": "Guys if the U.S defaults, we would have way bigger problems than a simple market crash. It would be unprecedented and likely affect us for generations. It's never going to happen.",
        "created_utc": 1632959588,
        "id": "hese071",
        "score": 1058,
        "subreddit": "wallstreetbets",
        "created": 1632988388.0
    },
    {
        "author": "Surprise-Chimichanga",
        "body": "“What is Theta, and how can I fuck it before it fucks me?” - OP",
        "created_utc": 1630622676,
        "id": "hbdj3qv",
        "score": 1021,
        "subreddit": "wallstreetbets",
        "created": 1630651476.0
    },
    {
        "author": "dancwalinski",
        "body": "Lol, it's actually mine though, tried posting it here when I first got the plate but automod kept taking it down",
        "created_utc": 1631466344,
        "id": "hckzvaj",
        "score": 1012,
        "subreddit": "wallstreetbets",
        "created": 1631495144.0
    },
    {
        "author": "kidtitan",
        "body": "You've made a lot of people, including myself, some good money. There's a special place in heaven for people like you. Appreciate it sir.",
        "created_utc": 1631745362,
        "id": "hd0blgd",
        "score": 996,
        "subreddit": "wallstreetbets",
        "created": 1631774162.0
    },
    {
        "author": "MarginCarl",
        "body": "Cosmopolitan has an article with 50 tips on how to give a good hand job.  You might want to read it while you still can afford an internet connection.",
        "created_utc": 1632868508,
        "id": "henhsbr",
        "score": 983,
        "subreddit": "wallstreetbets",
        "created": 1632897308.0
    },
    {
        "author": "rikki-tikki-deadly",
        "body": "It sounds like you learned a very valuable lesson, which makes me wonder what on earth you're doing here in this hive of scum and villainy.",
        "created_utc": 1631547494,
        "id": "hcpa7f4",
        "score": 979,
        "subreddit": "wallstreetbets",
        "created": 1631576294.0
    },
    {
        "author": "karasuuchiha",
        "body": "I give it a few weeks -source trust me bro",
        "created_utc": 1633009988,
        "id": "heumgv8",
        "score": 970,
        "subreddit": "wallstreetbets",
        "created": 1633038788.0
    },
    {
        "author": "PCB4lyfe",
        "body": "Idk why but I find it scary that zillow/opendoor etc are buying that many homes above asking, seems like it could be creating a bubble. Also seems like it's pricing first time buyers out. I have 2 young kids and we've been looking for a year to upgrade our house and theres almost nothing on the market, the one house we found that we loved we offered 380 for a 350 listed house and didnt get it.",
        "created_utc": 1632834482,
        "id": "hela6yp",
        "score": 967,
        "subreddit": "stocks",
        "created": 1632863282.0
    },
    {
        "author": "FuzzyFox1",
        "body": "That’s nothing. I bought an Apple share a couple of months ago, sold it on Wednesday and bought 4 beers with the profits 💪🍺",
        "created_utc": 1631367551,
        "id": "hcfmi4d",
        "score": 950,
        "subreddit": "pennystocks",
        "created": 1631396351.0
    },
    {
        "author": "Mcdaddybigballs602",
        "body": "Honestly.  Believe it or not, a property management company in China is not what the world’s economy is dependent upon.",
        "created_utc": 1632144238,
        "id": "hdl6b68",
        "score": 947,
        "subreddit": "wallstreetbets",
        "created": 1632173038.0
    },
    {
        "author": "AdmiralPoopbutt",
        "body": "Yes. I watched it when it aired. I never considered that Vince's reactions would become more famous than what he was watching.",
        "created_utc": 1632830821,
        "id": "hel3ipi",
        "score": 940,
        "subreddit": "wallstreetbets",
        "created": 1632859621.0
    },
    {
        "author": "stereoeraser",
        "body": "What needs to happen is you need to sell all your shares so it can immediately rally 900%",
        "created_utc": 1632522808,
        "id": "he5cyuy",
        "score": 923,
        "subreddit": "stocks",
        "created": 1632551608.0
    },
    {
        "author": "abk111",
        "body": "TLDR: “Even though everything is always priced in, this time bad things are not priced in. There’s too much money in QQQ and SPY so consider moving it to high quality finance industry stocks instead”. - a high quality finance company\n\nEdit: even if true, and I’m sure all of us believe there will be a 10-15% correction in the short to mid term, what’s the advice from Morgan Stanley here? To sell your long term holdings and try to time the market?",
        "created_utc": 1631111671,
        "id": "hc2a3zf",
        "score": 918,
        "subreddit": "stocks",
        "created": 1631140471.0
    },
    {
        "author": "Monster213213",
        "body": "Jesus Christ. You’re a millionaire, cash out and stick it into a diverse portfolio, get a chill career/hobby you like and enjoy life. Sometimes I question this sub. God speed retard.",
        "created_utc": 1631568346,
        "id": "hcqp8qt",
        "score": 902,
        "subreddit": "wallstreetbets",
        "created": 1631597146.0
    },
    {
        "author": "MrGoodGlow",
        "body": "Super simple as i can make it without bringing in positions or anything like that. Strictly how you can appear to owe a lot of money while still being profitable.\n\n\nA friend says they will sell you an unopened item for $20, in the store it cost $25. You line up a buyer who will buy it for $23.\n\nHowever your friend can't meet you until after work while the buyer can only meet at lunch.  \n\nSo you go to the store and pay $25 for it and keep the receipt in the morning, meet the buyer at lunch and sell it to them for $23 for a total loss of $2.\n\nThen you meet up with your friend after work and pay a $20 for their item leaving you with $22 less total dollars than you started with that day.\n\nFinally you go back to the store and return  the item and get credited back $25.\n\nLeaving you with $3 in profit, but for a time period you were at -$22",
        "created_utc": 1632764387,
        "id": "hehua64",
        "score": 879,
        "subreddit": "wallstreetbets",
        "created": 1632793187.0
    },
    {
        "author": "avelak",
        "body": "Look at it this way, maybe you would've been so terrible that you would've somehow destroyed their business before it ever went anywhere",
        "created_utc": 1631391774,
        "id": "hch5gx6",
        "score": 874,
        "subreddit": "wallstreetbets",
        "created": 1631420574.0
    },
    {
        "author": "leonden",
        "body": "Gratz and fuck you!\n\nRemember if it’s good enough to screenshot it is good enough to sell.",
        "created_utc": 1633039117,
        "id": "hewj46n",
        "score": 872,
        "subreddit": "wallstreetbets",
        "created": 1633067917.0
    },
    {
        "author": "Bluecoregamming",
        "body": "Yes exactly. I thought spreads were a way to gamble on options without having to worry about IV crush, and that's still true, but pin risk is new and if you don't know about it, it can eat you alive",
        "created_utc": 1632743656,
        "id": "hegmapv",
        "score": 872,
        "subreddit": "wallstreetbets",
        "created": 1632772456.0
    },
    {
        "author": "jerryruddin28",
        "body": "A Suzuki IS a lambo in Pakistan. The Pakistani ape already made it.",
        "created_utc": 1631731404,
        "id": "hczdt0x",
        "score": 862,
        "subreddit": "wallstreetbets",
        "created": 1631760204.0
    },
    {
        "author": "fuck_zebster",
        "body": "I've seen nothing but negativity about this company and would never use it . Looks like a good stock to throw 230k into .",
        "created_utc": 1632512196,
        "id": "he4nxx9",
        "score": 862,
        "subreddit": "wallstreetbets",
        "created": 1632540996.0
    },
    {
        "author": "DroidChargers",
        "body": "And parking it somewhere that might not let you empty your position when the time comes too. This goes beyond smooth brained lol",
        "created_utc": 1631112845,
        "id": "hc2cvid",
        "score": 849,
        "subreddit": "wallstreetbets",
        "created": 1631141645.0
    },
    {
        "author": "ChristepherCrown",
        "body": "One trader just took on a huge bet that US stocks will rally into the end of this year.\r  \n\r  \nThe flurry of trades with the SPDR S&amp;P 500 ETF Trust (SPY) – which took place between 10.34am and 10.41am New York time on Wednesday – involved call spreads maturing in each of the next three months. The total cost was about $US50 million ($69 million).\r  \n\r  \nShould all the contracts be in the money by their respective expiration dates, they would be worth $US136 million – for a profit of roughly 70 per cent, according to an estimate from Chris Murphy, co-head of derivatives strategy at Susquehanna.\r  \n\r  \n“These trades all share very similar footprint,” said Murphy. “It could be someone who is underweight equities and says, ‘if this thing explodes to the upside by the end of the year, then I’m going to be in trouble. So why don’t I put on a couple of these call spreads just to cover myself?’ That’s one situation. Or it could be someone who’s bullish getting more bullish.”\r  \n\r  \nThe transactions occurred right before the US Federal Reserve’s policy decision. The S&amp;P 500 climbed more than 1 per cent on Wednesday, snapping a four-day decline, as concerns about China Evergrande Group’s debt woes eased. Down 2.6 per cent this month, the index is heading for its worst month in almost a year.\r  \n\r  \nIt “seems like someone putting money to work to play for a rally into year-end following the recent selloff”, said Danny Kirsch, head of options at Cornerstone Macro. “Interesting they’re also doing it in front of the Fed meeting, perhaps think the outcome will be market positive.”",
        "created_utc": 1632363088,
        "id": "hdwze22",
        "score": 845,
        "subreddit": "wallstreetbets",
        "created": 1632391888.0
    },
    {
        "author": "Codesandstuff",
        "body": "What you are describing is a Straddle.\n\n[https://www.investopedia.com/terms/s/straddle.asp](https://www.investopedia.com/terms/s/straddle.asp)\n\nIt is generally used for when expecting a volatility change.",
        "created_utc": 1631374956,
        "id": "hcg29wh",
        "score": 840,
        "subreddit": "investing",
        "created": 1631403756.0
    },
    {
        "author": "QuietDrives87",
        "body": "The cost to ship a 20' container from Asia to the US is now over 10 thousand dollars, double that for a 40'. Pre pandemic it was less than 2 thousand for a 20'.",
        "created_utc": 1630749981,
        "id": "hbjwz5k",
        "score": 834,
        "subreddit": "investing",
        "created": 1630778781.0
    },
    {
        "author": "officialgel",
        "body": "I thought you were going to say WSB should collectively sign up as artists, release an album, and we all play it in loop 24/7. Disappointed.",
        "created_utc": 1632664904,
        "id": "hecigc6",
        "score": 815,
        "subreddit": "wallstreetbets",
        "created": 1632693704.0
    },
    {
        "author": "finger_milk",
        "body": "Get the lines to be green and do it multiple times",
        "created_utc": 1631110262,
        "id": "hc26tya",
        "score": 813,
        "subreddit": "wallstreetbets",
        "created": 1631139062.0
    },
    {
        "author": "jonathan34562",
        "body": "Please upvote this so I can answer the most common questions I am getting in one place.\n\n\n1) How did I get to this point in my life?\n\nI have a master degree in computer science and spent 8 years working as a programmer at lots of different companies.  Then I launched my own consulting company - quickly figured out that services work doesn't scale well - pivoted the business to a product startup and used the consulting to finance it.  All told, it took 20 years to get a really big exit - like net of over $200M.  \nThere is no shortcut that I know of - education, skills, experience,  lots of hard work for years and then luck.\nNow I get to do whatever I like, I am typing this from a private jet on the wifi coming back from vacation... I know, wtf. I pinch myself too.\n\n\n2) How can I invest like you?\n\nWell. I have a lot of money so I can make risky bets.  I don't do options though, only stocks. I put $50k into GME on a whim at $65 and sold when it hit $350.  That was a laugh.  \n\nBut seriously, I invest in stocks that I feel like I know. I use HUBS - they are in a great space and really appealing to SMB. I see them as the most viable competitor to Salesforce - go look at Salesforce's market cap. Classic Clayton Christensen - you will be eaten from below.\n\nI am not really much of an investor - just see things that make sense. I bought Amazon at $350 - should have put in more...\n\nI typically invest in tech stocks because I feel like I understand the business.\n\nMy stock account is just my plaything. My real investing is much more structured and done with my wealth advisor at a large brokerage.",
        "created_utc": 1630774469,
        "id": "hbl52oz",
        "score": 794,
        "subreddit": "wallstreetbets",
        "created": 1630803269.0
    },
    {
        "author": "quiethandle",
        "body": "I think the critical thing to know is that China is in the midst of a massive real estate bubble. I mean way, way bigger than the US real estate bubble was back in 2007 and 2008.\n\nPeople don't invest in stocks over there. Instead they invest in real estate. It can take multiple generations for people to even save up enough for a down payment. The cost of real estate is astronomical, and it's only been going up and up for many many years. Hence why people invest in it.\n\nBut the problem is that there are huge numbers of residences that have been purchased as investment properties, and they are vacant. Huge swaths of unfinished apartment buildings have been demolished because the construction wasn't finished.\n\nI wouldn't consider this similar to Lehman Brothers going under. I would consider this more analogous to Amazon going under. A gigantic part of the US economy and the US stock market - imagine if that got wiped out. There would be a lot of collateral damage.",
        "created_utc": 1632113386,
        "id": "hdk0t3p",
        "score": 776,
        "subreddit": "stocks",
        "created": 1632142186.0
    },
    {
        "author": "Powerful_Stick_1449",
        "body": "This needs to be posted at least once a week.. but we really needed it after that first GME surge. When suddenly every retard became an expert on Gamma squeezes and literally very stock was a short squeeze.",
        "created_utc": 1631227511,
        "id": "hc8nfj9",
        "score": 759,
        "subreddit": "wallstreetbets",
        "created": 1631256311.0
    },
    {
        "author": "brutalpancake",
        "body": "It was so near that one time, you guys remember? Stocks didn’t go up for like a whole month. They went DOWN. Shit was crazy.",
        "created_utc": 1631334037,
        "id": "hcedzvh",
        "score": 755,
        "subreddit": "wallstreetbets",
        "created": 1631362837.0
    },
    {
        "author": "Instantkarmagonagetu",
        "body": "Everyone is always trying to predict the next market crash so they can say they called it. The problem is that almost nobody sees a tsunami coming a month away. Every market crash is unique and unpredictable. Eventually a few of them will be right and then spend the next 10 years capitalizing on how smart they were when they were really just lucky. Plus, bad news sells better than good news and gets people’s attention.",
        "created_utc": 1631445737,
        "id": "hcju9km",
        "score": 752,
        "subreddit": "stocks",
        "created": 1631474537.0
    },
    {
        "author": "Confident-Victory-21",
        "body": "I love a good 70%+ portfolio loss.\n\nCall your homeowners insurance and see if they can cover it, if it happened at home.",
        "created_utc": 1631573050,
        "id": "hcqzsdc",
        "score": 727,
        "subreddit": "wallstreetbets",
        "created": 1631601850.0
    },
    {
        "author": "Kylorin94",
        "body": "Proposal: New retard slang word \"evergranding\" which means defaulting but not admitting it.",
        "created_utc": 1632397194,
        "id": "hdyauyb",
        "score": 717,
        "subreddit": "wallstreetbets",
        "created": 1632425994.0
    },
    {
        "author": "v00bly",
        "body": "CONGRATS…\n\nNow diamond hands it, so we can see some lost porn.",
        "created_utc": 1633037888,
        "id": "hewge0q",
        "score": 686,
        "subreddit": "wallstreetbets",
        "created": 1633066688.0
    },
    {
        "author": "Xerlic",
        "body": "My mom started a trading account for me when I was in college. She filled it with a bunch of random stuff and shares of MSFT. I still have the MSFT shares and it's about 30% of my portfolio. This was about 15 years ago.",
        "created_utc": 1631190730,
        "id": "hc6a22n",
        "score": 680,
        "subreddit": "stocks",
        "created": 1631219530.0
    },
    {
        "author": "RedMageMood",
        "body": "Twist, they all get off cause our boomer representatives kept calling it \"game stock\" instead of \"gamestop stock\"",
        "created_utc": 1632623879,
        "id": "hear86t",
        "score": 680,
        "subreddit": "wallstreetbets",
        "created": 1632652679.0
    },
    {
        "author": "slickshoes_",
        "body": "I'd argue a benefit to keeping a stock price high is that more people are less likely trade options on the shares, thus making it less likely that options volume can affect a stocks price.",
        "created_utc": 1632560138,
        "id": "he780uf",
        "score": 672,
        "subreddit": "stocks",
        "created": 1632588938.0
    },
    {
        "author": "thatgermanperson",
        "body": "There is hope for humanity yet!\n\n&gt;It has come to my attention that the “girl forcing other girl to drink milk” meme is not a screenshot of an adult video, as with most similar memes, rather it is from an art project by the instagram user @soska_117. This has come as a shock and a surprise to many, and the fallout has had a negative effect on many communities. With your signature, we can right this wrong, and help to make this vision a reality.",
        "created_utc": 1632947432,
        "id": "hermuk4",
        "score": 669,
        "subreddit": "wallstreetbets",
        "created": 1632976232.0
    },
    {
        "author": "freakishgnar",
        "body": "Fed Presidents, members of Congress and members of the executive branch should be required to put their assets in a blind trust when they take office. People making decisions on monetary and civil policy should not be using that intel as strategy for a portfolio. You're there as a servant to the people, not for personal enrichment. This should not be and should never have been legal.\n\nCall me stodgy, but it goes against all the ethics of public service and leadership.",
        "created_utc": 1631839191,
        "id": "hd5dsax",
        "score": 668,
        "subreddit": "stocks",
        "created": 1631867991.0
    },
    {
        "author": "ryuthepotato",
        "body": "They sit at their computers for a virtually 0 latency trading (best deals for day trading).  Some of them make money off of micro trades (think buy for 3.99, sell for 4.01) and the 0 latency makes it possible to do it multiple times",
        "created_utc": 1632229078,
        "id": "hdpnylm",
        "score": 659,
        "subreddit": "wallstreetbets",
        "created": 1632257878.0
    },
    {
        "author": "This_Royal7800",
        "body": "I don't have the images but I made a similar mistake with Netflix back in 2011.  Had around 20k invested in them then sold it all to help buy a house.\n\n&amp;#x200B;\n\nI know myself though, I would have sold off way before the ATH.  Never would have imagined them reaching that valuation.",
        "created_utc": 1631386745,
        "id": "hcgtmsv",
        "score": 656,
        "subreddit": "wallstreetbets",
        "created": 1631415545.0
    },
    {
        "author": "aRahman86",
        "body": "The saddest part is that it will wipe out wealth from the working class.",
        "created_utc": 1631537247,
        "id": "hconjmz",
        "score": 648,
        "subreddit": "wallstreetbets",
        "created": 1631566047.0
    },
    {
        "author": "paperpeddler",
        "body": "It comes full circle.",
        "created_utc": 1630544588,
        "id": "hb9c367",
        "score": 634,
        "subreddit": "wallstreetbets",
        "created": 1630573388.0
    },
    {
        "author": "joshstc",
        "body": "If you sell it will go up if you hold it will go down. Choose wisely which mistake you wish to make",
        "created_utc": 1630907207,
        "id": "hbs0rlm",
        "score": 628,
        "subreddit": "wallstreetbets",
        "created": 1630936007.0
    },
    {
        "author": "sincopothedread",
        "body": "Has no idea how margins works, makes $100k with margins, complains about it. \n\nWelcome to WSB.",
        "created_utc": 1631035745,
        "id": "hbydzpj",
        "score": 613,
        "subreddit": "wallstreetbets",
        "created": 1631064545.0
    },
    {
        "author": "ShizzlesXV",
        "body": "So it took you 3 months to lose that amount. With options you could have beat that record and lost it all in 3 days.",
        "created_utc": 1631739935,
        "id": "hczz4as",
        "score": 613,
        "subreddit": "wallstreetbets",
        "created": 1631768735.0
    },
    {
        "author": "Moonman1900",
        "body": "In celebration of the Chinese holiday. The market decided to make it look like their flag.",
        "created_utc": 1632170173,
        "id": "hdmwc06",
        "score": 609,
        "subreddit": "StockMarket",
        "created": 1632198973.0
    },
    {
        "author": "sandman1347",
        "body": "People were also posting this at the 350 range. It matches your little graph perfectly there as well.",
        "created_utc": 1631704590,
        "id": "hcxqtfx",
        "score": 608,
        "subreddit": "StockMarket",
        "created": 1631733390.0
    },
    {
        "author": "canadianformalwear",
        "body": "I remember being a lurker on here years ago under a different account, and it seemed like mods would straight up ban people for a lot of the b.s. and obvious shilling that goes on now. If accounts didn’t seem legit or have valid history and people were posting fake or pump and dump DD, they’d be banned. \n\nBut in the end some of those mods turned out to be shills themselves, and that irony isn’t lost on most of us. \n\nInvesting has become relatively easy, and app driven especially in a rediculous bull market. \n\nIf there’s a fiscal downturn, or stagnant markets (which have happened for years at a time) it’s going to literally wipe out the current vast majority of this sub, and things will get quieter around here for sure.",
        "created_utc": 1631972684,
        "id": "hdbx9q1",
        "score": 605,
        "subreddit": "wallstreetbets",
        "created": 1632001484.0
    },
    {
        "author": "ainfinitepossibility",
        "body": "I'll defend this. I've NEVER heard anti clockwise in my life. I've lived half in the states and half in Canada. It's always been counterclockwise. Auro correct even knew that one. It doesn't know anticlockwose. see! I'm leaving it as proof.",
        "created_utc": 1632148577,
        "id": "hdlft0c",
        "score": 599,
        "subreddit": "wallstreetbets",
        "created": 1632177377.0
    },
    {
        "author": "Narradisall",
        "body": "Next week it hits 152%!",
        "created_utc": 1631112854,
        "id": "hc2cwbb",
        "score": 599,
        "subreddit": "StockMarket",
        "created": 1631141654.0
    },
    {
        "author": "wegoingtothemoon",
        "body": "Make sure to buy e bike with credit card so you get it 75 percent cheaper later",
        "created_utc": 1632419355,
        "id": "hdznnse",
        "score": 596,
        "subreddit": "wallstreetbets",
        "created": 1632448155.0
    },
    {
        "author": "bbrackett",
        "body": "I'm going to hop on to this top comment, I am an Advisor and we have a lot of clients who are in similar Notes. The name is Auto Callable Yield Note, the way we write these is that you set a time period normally 2-5 years they are linked to normally 2-3 indexed or individual stocks. They come with a fixed rate that is based on how the VIX is doing, the higher the VIX the higher the yield. Then you have a downside barrier that is normally 30-40%, if any of the indexed go below that barrier on coupon payment date you miss coupon. If it makes it to the very end of the term and it's below that barrier you have principal loss.\n\nTo summarize there are 3 major risks:\n1. The bank goes bankrupt and you are a creditor and hope you make the list of payees.\n2. It goes below the barrier in the middle of term and you miss 1 month) quarters worth of coupon payment.\n3. You go full term and it's below the barrier st the end of the term and you participate in principal loss. \n\nI currently hold a note that looks like this:\n\nIndex's: SPY INDU and DAL\nTerm: 4 years\nCoupon barrier 20%\nPrincipal barrier 30%\nRate: 13.65% yearly",
        "created_utc": 1631417605,
        "id": "hciqo1t",
        "score": 595,
        "subreddit": "investing",
        "created": 1631446405.0
    },
    {
        "author": "StrikePrice",
        "body": "I have to hand it to that woman. She just stands there and looks at him like he’s not completely nuts.",
        "created_utc": 1631372403,
        "id": "hcfwg9i",
        "score": 588,
        "subreddit": "wallstreetbets",
        "created": 1631401203.0
    },
    {
        "author": "Jmilli-24",
        "body": "It hasn’t crashed yet because I haven’t gone all in yet. Don’t worry boys, I’m keeping the market afloat for now.",
        "created_utc": 1633012860,
        "id": "heut0ch",
        "score": 586,
        "subreddit": "wallstreetbets",
        "created": 1633041660.0
    },
    {
        "author": "mat1k_hodl",
        "body": "Whatever market it is... I'll still manage to lose money and bring further shame to my family ![img](emote|t5_2th52|4260)",
        "created_utc": 1632272699,
        "id": "hdsg9so",
        "score": 583,
        "subreddit": "wallstreetbets",
        "created": 1632301499.0
    },
    {
        "author": "pointme2_profits",
        "body": "I bought it. Yang calls and SPY puts. They both rocketed in value. And tanked the next day. Took a loss on SPY and broke even with Yang.",
        "created_utc": 1632400555,
        "id": "hdygfwa",
        "score": 578,
        "subreddit": "wallstreetbets",
        "created": 1632429355.0
    },
    {
        "author": "AdAlternative3648",
        "body": "Stop it.  Get some help.  \n - Michael B Jordan",
        "created_utc": 1632406646,
        "id": "hdyt5jw",
        "score": 573,
        "subreddit": "wallstreetbets",
        "created": 1632435446.0
    },
    {
        "author": "Pee-s4",
        "body": "Call fidelity and tell them your little brother had the controller, so they have to undo it",
        "created_utc": 1631929417,
        "id": "hda53nk",
        "score": 571,
        "subreddit": "wallstreetbets",
        "created": 1631958217.0
    }
]