[
    {
        "author": "masterfox72",
        "body": "SPY QQQ MSFT",
        "created_utc": 1638572873,
        "id": "hn4lxie",
        "score": 3,
        "subreddit": "stocks",
        "created": 1638601673.0
    },
    {
        "author": "potato_life77",
        "body": "i will repeatedly punch my balls if we gap down on monday. This week was a big downward spiral but i have conviction that it will rebound hard like it always has $FB $MSFT",
        "created_utc": 1638573481,
        "id": "hn4n9mp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638602281.0
    },
    {
        "author": "sh4x0r",
        "body": "nice! i sold BABA and bought MSFT. i miss being a BABA shareholder but am excited to be free of political risk.",
        "created_utc": 1638572171,
        "id": "hn4kdh9",
        "score": 2,
        "subreddit": "stocks",
        "created": 1638600971.0
    },
    {
        "author": "MeldMeldMeld",
        "body": "Hm do you do other safer bets like MSFT or APPL?",
        "created_utc": 1638574409,
        "id": "hn4paov",
        "score": 2,
        "subreddit": "stocks",
        "created": 1638603209.0
    },
    {
        "author": "baconography",
        "body": "MSFT and GOOGL leaps on sale today. Not going out of business. Stacks of cash, massive profit margin.",
        "created_utc": 1638574140,
        "id": "hn4oph0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638602940.0
    },
    {
        "author": "Powerful_Stick_1449",
        "body": "Apple is pretty much considered a safe-haven asset (Personally I would add MSFT as well). They are growth and have insane FCF with a decent dividend and constant share buybacks. \n\nThey work in every environment. I somewhat agree with a comment on CNBC yesterday about Apple being a sort of bond with growth potential.",
        "created_utc": 1638361593,
        "id": "hmse2ox",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638390393.0
    },
    {
        "author": "ApeKurt",
        "body": "My MSFT calls looking 🤑🤑🤑",
        "created_utc": 1638361242,
        "id": "hmsdjml",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390042.0
    },
    {
        "author": "Brief-Garbage",
        "body": "MSFT, GOOGL",
        "created_utc": 1638353787,
        "id": "hms3tjc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638382587.0
    },
    {
        "author": "A_KY_gardener",
        "body": "Panic boughtT MSFT 340c",
        "created_utc": 1638356867,
        "id": "hms7jl6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638385667.0
    },
    {
        "author": "JhoLow_1MDB",
        "body": "lol.  MSFT CEO dumps half his shares worth $285M to avoid a gigantic capital gains tax increase imposed by Washington State.",
        "created_utc": 1638370019,
        "id": "hmsu5if",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638398819.0
    },
    {
        "author": "993andme",
        "body": "I see your point in general, and I agree with it in concept…but man pets.com and I have enough of a history that I feel i can say that they and are nothing alike.\n\nI worked at Microsoft in the product group back in the 90s, and talked to someone at pets.com seemingly weekly about their various needs and plans and demands. I’ll save you the boredom, but it was one horrible company with a marketing department so impressive that they had us all seeing a silly puppet at night while we slept.\n\nPets.com got everything right except the part where you put together a properly run management and logistics team to keep costs from killing you while you’re out spending every last penny on marketing. Pets burned their candle at both ends: losing money on just about every single thing they sold without the benefit of free advertising and hype from social media creators. Rivian was much smarter about this bit. They aren’r streaming millions of dollars a week sponsoring the rose bowl or some shit.\n\nInstead, Rivian has been controlling costs; auto manufacturing is it’s just an unbelievably high up front capital business. Thing is though: they’ve got 4-5 years of cash on hand. Pets had 4-5 minutes, tops. Rivian partnered with one tech firm and one auto manufacturer to keep the number of roosters in the henhouse to a minimum. Pets.com took in money from anyone and everyone willing, and with them, their agenda, vision, and demands. \n\nIs Rivian worth anything near what the stock is selling for? Absolutely not. They just aren’t the complete windbag that pets was.\n\nAssuming that they aren’t cooking the books in a massive fraud conspiracy, I see Rivian getting a high and tight 90% amazon style correction before either recovering to reasonable levels or being gobbled up by one of the larger automakers willing to fulfill amazon’s van order, or to simply buy out the IP they’ve certainly built up.",
        "created_utc": 1638371751,
        "id": "hmsy5ku",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638400551.0
    },
    {
        "author": "Jumpdeckchair",
        "body": "Why did I switch from MU to MSFT.",
        "created_utc": 1638370589,
        "id": "hmsvh33",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638399389.0
    },
    {
        "author": "VoteNixon2024",
        "body": "Mother fucking how is AAPL still doing this. How retarded am I for picking MSFT instead",
        "created_utc": 1638373504,
        "id": "hmt2biv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638402304.0
    },
    {
        "author": "Will_House",
        "body": "It's the same dividend once you own one full stock of MSFT via CDRs",
        "created_utc": 1638372453,
        "id": "hmszt21",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1638401253.0
    },
    {
        "author": "NodeDotSwift",
        "body": "You know that making ARM processors would make them commodity manufacturers with no moat, right?\n\nTheir excess margins gone from being the only suppliers of x86 processors. If x86 continues to lag ARM in lower per watt, it’s value as a proprietary architecture fades over time.\n\nApple is running x86 instructions on ARM as fast as native Intel laptop processors. MSFT could do same.\n\nAnd on servers few care about architecture, they care about cost of performance which Graviton is way ahead in.",
        "created_utc": 1638367628,
        "id": "hmsp17p",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638396428.0
    },
    {
        "author": "LordFaquaad",
        "body": "Msft",
        "created_utc": 1638368659,
        "id": "hmsr6x9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638397459.0
    },
    {
        "author": "big_tronson",
        "body": "Swung trade Tesla a few times on Nov for 13% gains.  Sitting at 30% TD, 30% ENB, 30% BMO, 10% into different stocks (MSFT, FB, Visa) in my trade account going into Dec.  a lot of gains on my big 3 positions 3 have been wiped as of late so hoping for a big rebound.",
        "created_utc": 1638364003,
        "id": "hmsi3wr",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1638392803.0
    },
    {
        "author": "trpkchkn",
        "body": "Yup. I got out of Qqq awhile back because I don’t believe in many of the companies in the index. \nReinvested into AAPL, MSFT and TSM. \n\nTSM has been a let down but still hopeful it will be a long term play. If it doesn’t, I’ll just sell and buy more of the other two.",
        "created_utc": 1638366694,
        "id": "hmsn58k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638395494.0
    },
    {
        "author": "Moon_Bass_",
        "body": "I did a quick look at their ratios and i would say yes to long term, maybe 5-10 years?\n\nFrom a non financial perpsecitve and look into Nintendo as a company, their philosophy is straight forward, they make games that can be enjoyed by adults and children and are generally pretty straight forward when compared to more \"mature games\".\n\nPlay a Mario game from 10 years ago and it will play the same as one today with minute differences.\n\nThey have the \"casual\" game market on lock as well. Though steam does appear to be entering that market with their handheld console.\n\nRight now, imo, the game industry is ready for a new player...Sony, Nintendo, and Microsoft have been big dogs for a while now; SEGA was in but after the Dreamcast tapped out (which sucks because they *could* do well these days)\n\nIf another company were to start and enter into the casual gaming arena in a way that isn't as....crappy as mobile gaming but good enough to be taken seriously, especially from the USA side, then that could cause some problems i think.",
        "created_utc": 1638377002,
        "id": "hmtb0t6",
        "score": 1,
        "subreddit": "investing",
        "created": 1638405802.0
    },
    {
        "author": "BMV_S1000RR",
        "body": "Nasdaq 100 but you can also invest individually in, for example, Microsoft, Apple, Nvidia, etc., for more exposure to those companies.",
        "created_utc": 1638377577,
        "id": "hmtchy0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638406377.0
    },
    {
        "author": "Zealousideal_Bet_874",
        "body": "I can’t even eat my food, I’m so stuck on MSFT 1min chart",
        "created_utc": 1638377394,
        "id": "hmtc0yb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638406194.0
    },
    {
        "author": "Tsad311",
        "body": "MSFT and aapl",
        "created_utc": 1638377098,
        "id": "hmtb9ko",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638405898.0
    },
    {
        "author": "Justastonkie",
        "body": "MSFT 🚀🚀🚀",
        "created_utc": 1638380743,
        "id": "hmtkjz1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638409543.0
    },
    {
        "author": "chemistrying420",
        "body": "I’m keeping 80% of my net worth in Microsoft and beetcoin and my consultation with a financial advisor cannot change that",
        "created_utc": 1638379313,
        "id": "hmtgvth",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638408113.0
    },
    {
        "author": "onthegrind7",
        "body": "Seems the only way to make consistent returns is from google, Microsoft, apple, Amazon, Facebook, etc. \n\nIt’s kind of a shame that the market has put these tech stocks on such a high pedestal",
        "created_utc": 1638379553,
        "id": "hmthhwj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638408353.0
    },
    {
        "author": "ratptrl01",
        "body": "I would only buy individual stocks either when you believe they are bulletproof (msft, aapl) or when they are very cheap/undervalued while still being profitable and of good historical stock (intel, visa, paypal) otherwise you benefit most from ETFs like SPY. There you get diversification. It is redundant to buy and hold msft and aapl with spy but I do it because they are the biggest drivers of the sp500 anyway, so they just boost my gains that much more.",
        "created_utc": 1638386285,
        "id": "hmtyx93",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638415085.0
    },
    {
        "author": "spliff_kingsbury007",
        "body": "just like betting i feel like the public is mostly always wrong. Everyone is calling for a crash so that probably means a nice fat bull run. Some of the big dogs like Elon, Bezos, Nadella (Microsoft CEO), etc have sold but who knows, could be for different reason. (SpaceX is reportedly going bankrupt, could be selling for that, taxes, locking in profit).",
        "created_utc": 1638386448,
        "id": "hmtzcq6",
        "score": 1,
        "subreddit": "investing",
        "created": 1638415248.0
    },
    {
        "author": "Ireallydontknowbuddy",
        "body": "I was just trying to enjoy my lunch as well. My butt hurts. Lost like 4 percent in a single day of not doing anything. I hold Amazon, Microsoft, nvda, bad companies like that.",
        "created_utc": 1638396304,
        "id": "hmupcnm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638425104.0
    },
    {
        "author": "ihatethepc",
        "body": "Inaccurate he said wait till Friday by Wednesday it started going up. Then they went up as the big victors every spy up bounce. Last night he said but Microsoft guess what joined today? 330-338 if you sold before the s&amp;p you would've made out \n\nYou sorta have to read in-between the lines of what he's saying. The stock market changes on a dime and no one ever can predict the future. Looking at chart's yesterday it was a clear buy signal but suddenly congress and JPow spoke again",
        "created_utc": 1638397076,
        "id": "hmurbi3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638425876.0
    },
    {
        "author": "WiseAce1",
        "body": "MSFT and AAPL",
        "created_utc": 1638389855,
        "id": "hmu875a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638418655.0
    },
    {
        "author": "JRshoe1997",
        "body": "Well thats assuming you averaged down. Take Amazon for example. Amazon dropped from over $90.00 a share down to around $6.00 a share. If your telling me you would have hung on while you were down over 90% and kept buying down while all these other tech bubble stocks were going bankrupt you are lying to yourself. Its the same with Microsoft. At the height they were almost $120.00 a share and dropped below $20.00 a share. Its easy to say you would have hung on with 20/20 hindsight but I guarantee anybody around that time would have sold.",
        "created_utc": 1638386839,
        "id": "hmu0dll",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638415639.0
    },
    {
        "author": "eternalrefuge86",
        "body": "Once APPL and MSFT start drilling it’s gonna be really really bad",
        "created_utc": 1638389407,
        "id": "hmu71cb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638418207.0
    },
    {
        "author": "biba8163",
        "body": "&gt; panic selling MSFT and AAPL\n\nNGMI",
        "created_utc": 1638392871,
        "id": "hmugc2a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638421671.0
    },
    {
        "author": "llost1llcp",
        "body": "The scary part is MSFT and AAPL are still near ATH",
        "created_utc": 1638391743,
        "id": "hmuda62",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638420543.0
    },
    {
        "author": "nicknaseef17",
        "body": "VLXVX - 30.7%\nFBGRX - 25.5%\nVTSAX - 16.6%\nAAPL - 10.9%\nMSFT - 8.9%\nCOST - 3.6%\nABNB - 2.0%\nPYPL - 1.8%",
        "created_utc": 1638391085,
        "id": "hmubi1s",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638419885.0
    },
    {
        "author": "ifelondonttrustyou",
        "body": "AMD,RIVIN (101 is my target entry), AAPL, TSLA, NVDA, MSFT",
        "created_utc": 1638391474,
        "id": "hmucjv7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638420274.0
    },
    {
        "author": "tomis8",
        "body": "I used Snowflakes, and it is not worth $100B.  There is nothing special about it that Microsoft cannot offer.",
        "created_utc": 1638393218,
        "id": "hmuh8wg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638422018.0
    },
    {
        "author": "ZealousLittleBear1",
        "body": "I think earnings is tomorrow. Very overvalued. \n\nMicrosoft groups etc is much better. However, I do like the unicorns that shoot across the screen when you check off a lot of things. \n\nI'm not bullish on this company at all, but with the market...you never know.",
        "created_utc": 1638398356,
        "id": "hmuui62",
        "score": 1,
        "subreddit": "options",
        "created": 1638427156.0
    },
    {
        "author": "Natural_Wrangler9037",
        "body": "It's like msft it took 16 years to get above 25. They all go up eventually. I used to daytrade apple btwn 4N 9 dollars 30 yrs ago if I had bought and held would not be answering your tweet.",
        "created_utc": 1638401086,
        "id": "hmv0t3l",
        "score": 1,
        "subreddit": "investing",
        "created": 1638429886.0
    },
    {
        "author": "ybnesman",
        "body": "AAPL and MSFT shares for me",
        "created_utc": 1638401891,
        "id": "hmv2isp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638430691.0
    },
    {
        "author": "Brendan1620",
        "body": "I’m thankful for Microsoft and Apple because without them I’d be down 2k+ on some semi dipping",
        "created_utc": 1638380857,
        "id": "hmtkujr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638409657.0
    },
    {
        "author": "Diamondhandz1",
        "body": "BUY MSFT 340 CALL DEC 17th",
        "created_utc": 1638381953,
        "id": "hmtnosr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638410753.0
    },
    {
        "author": "88crypto",
        "body": "I sold my CRM puts way too early. And held my MSFT fds for too long. I'll never change",
        "created_utc": 1638381920,
        "id": "hmtnlu8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638410720.0
    },
    {
        "author": "Roxaos",
        "body": "MSFT with the atrocitus dick",
        "created_utc": 1638382107,
        "id": "hmto35h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638410907.0
    },
    {
        "author": "cooldude1991",
        "body": "JPow and Biden won't let the market free fall. Just don't yolo in bonkhead stocks like PLTR LUCID CLOV and you will be fine. Buy SPY GOOG FB MSFT.",
        "created_utc": 1638405899,
        "id": "hmvbo8u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638434699.0
    },
    {
        "author": "flying_cofin",
        "body": "Two: Apple and Microsoft",
        "created_utc": 1638405793,
        "id": "hmvbfor",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638434593.0
    },
    {
        "author": "Michael12390",
        "body": "Let’s say Apple traded at a $10T market cap and they had net income of $600 Billion (current net income is less than $100 Billion). How much could Apple grow their net income if it became $600 Billion? 7% growth would mean they would make $42 Billion more the next year. I think that would be extremely unrealistic. Realistic net income growth for a company of that size would be maybe 2-3%. Which also means that a PE of 16 would be completely unjustified. So if we gave Apple a PE of 10 and $600 Billion in net income, that gives a market cap of $6T. And that’s if you assume the absurdly high net income of $600 Billion which is higher than Amazon, Google, Microsoft, and Apple currently combined. There will be a point when Apple is large enough that they will greatly underperform the market just because it won’t be possible for them to grow their earnings at double digits forever.",
        "created_utc": 1638407883,
        "id": "hmvg7zt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638436683.0
    },
    {
        "author": "BasicBroseph",
        "body": "NVDA, CRM, COST, MSFT",
        "created_utc": 1638408700,
        "id": "hmvi3w1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638437500.0
    },
    {
        "author": "elevenrising",
        "body": "MSFT and AAPL-one share each.",
        "created_utc": 1638409143,
        "id": "hmvj4m7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638437943.0
    },
    {
        "author": "mrpressydent",
        "body": "BTW i made this portfolio that i got from a youtuber i modeled it from. \n\n&amp;#x200B;\n\n1**5% on the bank/cash/money market account**\r  \n\r  \n**15% on 10 - 15 % yearly growth etf’s examples ( snp500, SPLG, SCHK)**\r  \n\r  \n**30% on blue chip og safe stocks &amp;\\*Stock investment portfolio:**\r  \n**15% on the bank/cash/money market account**\r  \n\r  \n**15% on 10 - 15% yearly growth etf, snp 500** \r  \n \r  \n**30% on blue chip og safe stocks, apple, goog, fb, microsoft, etc. above 50 billion mark cap**\r  \n**40% on growth stocks with high risk and potential,\\* tsla, amazon, meta \\* example**\n\n&amp;#x200B;\n\n\r  \nIs there stuff i need to change in portfolio, any tips, any criticism, anything i need to know to better change this for my age.",
        "created_utc": 1638423484,
        "id": "hmwdbcm",
        "score": 1,
        "subreddit": "investing",
        "created": 1638452284.0
    },
    {
        "author": "Whoopiskin",
        "body": "Bloomberg commentator was talking today and said if Apple falls and Microsoft falls then that's when you can consider the start of a bear market. Welp 🐻🤡🐻🤡🏳️‍🌈 here we go boys.",
        "created_utc": 1638418782,
        "id": "hmw4mw5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638447582.0
    },
    {
        "author": "Centraldread",
        "body": "DOCU puts, AMD weekly calls, MSFT weekly calls. How screwed am I at open tomorrow?",
        "created_utc": 1638427869,
        "id": "hmwk6dr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638456669.0
    },
    {
        "author": "ivanislav",
        "body": "MSFT is 10% of SPY by weight.",
        "created_utc": 1638450433,
        "id": "hmxdtko",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638479233.0
    },
    {
        "author": "nsjmas",
        "body": "MSFT gonna go red pre market. SPY fuckd",
        "created_utc": 1638451434,
        "id": "hmxfna8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638480234.0
    },
    {
        "author": "RumHam1",
        "body": "Don't get me wrong, I agree that there are a lot of indicators of overvalue.  As a buy and hold investor that believes pretty strongly in indexing - I'm pretty comfortable with the SP F PE being where it is.  \n\nI also agree some companies are priced too far into the future.  Most of those are taking a pretty significant hit at the moment.   My personal thesis is that companies with strong balance sheets will outperform in general.  Inflation FUD is hitting growth stocks right now, with an extra punishment for not having a great balance sheet.  Companies with strong balance sheets have mostly held their ground so far.  \n\nAs a buy and hold person who is big into indexing, I'm comfortable with the SP F PE of around 21.  Short term growth projections justify it IMO.  My individual picks are pretty focused around strong balance sheets and good earnings.  Only about 10% of my total is in companies with more than a 18 forward p/e (and half of that is Microsoft).",
        "created_utc": 1638450228,
        "id": "hmxdg6d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638479028.0
    },
    {
        "author": "LettheBargo",
        "body": "Microsoft went in the red, prepare for a massive selloff at open, heard it here first",
        "created_utc": 1638453304,
        "id": "hmxjbv2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638482104.0
    },
    {
        "author": "diox8tony",
        "body": "Manipulated? It's already at 38pe ratio.... that's Pretty reasonably for a good company. You think it's deserves to have higher ratio than Microsoft(36.5)?",
        "created_utc": 1638488886,
        "id": "hn00ftr",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1638517686.0
    },
    {
        "author": "gliamastrr",
        "body": "Take half and put it into QQQ, take the other quarter and put it into MSFT, AAPL, BOEING and NVDA. Take the last quarter and put it into strong higher risk good stocks: CLOV, FREYR Battery, TSLA",
        "created_utc": 1638490663,
        "id": "hn04ee9",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638519463.0
    },
    {
        "author": "Sorry-Business-1152",
        "body": "If MSFT could just go to 338 tomorrow that would be great",
        "created_utc": 1638483553,
        "id": "hmznpwd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638512353.0
    },
    {
        "author": "Sorry-Business-1152",
        "body": "MSFT teams will make ZM obsolete",
        "created_utc": 1638482642,
        "id": "hmzlen5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638511442.0
    },
    {
        "author": "basicallyculchie",
        "body": "I'd say go with industries you're familiar with, like if you're into gaming maybe AMD, Microsoft etc. Stuff you'll hear news about and have a vague idea of now the industry is doing. Or if you're into pharmaceutical companies or finance. Diversity is always good but when you know an industry it won't be a shock if a drop or jump in price occurs (in theory anyway 😉)",
        "created_utc": 1638482635,
        "id": "hmzle16",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638511435.0
    },
    {
        "author": "knawlejj",
        "body": "From a technology standpoint, the only main advantage of DOCU at this point is its integration partnerships. Both Adobe and Box have significantly caught up in this space. My organization now has Box Sign included as part of our core licensing with no extra cost. \n\nBest case scenario, DOCU is acquired by MSFT as they don't have a pointed solution.",
        "created_utc": 1638481780,
        "id": "hmzj6tw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638510580.0
    },
    {
        "author": "kioba",
        "body": "because you touch yourself at night. plus it's just another fancy microsoft teams like zm and crm. I bought a call too thinking it was undervalued but what you gonna do.",
        "created_utc": 1638480132,
        "id": "hmzetm0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638508932.0
    },
    {
        "author": "LanceX2",
        "body": "dude.....I bought 3 msft at 330. shits at 328 AH.\n\nEry time",
        "created_utc": 1638493866,
        "id": "hn0bfq1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638522666.0
    },
    {
        "author": "babydragon89",
        "body": "You have to look further why the stock didn't do well 5 years before. Back when Steve Ballmer was the CEO, he made lots of wrong decisions. One of them was Windows phone that killed of Nokia brand. He also pushed for stack ranking that made lots of talent left the company. When Satya took the control, he shifted the focus entirely on Cloud, Office, and Open Source (Github acquire). He also decided to scrap the old Microsoft Edge browser engine, and move to build the new browser on top of Chromium. This is why MSFT became the beast and keep growing steadily for the last few years.",
        "created_utc": 1638640264,
        "id": "hn7vloj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638669064.0
    },
    {
        "author": "paq12x",
        "body": "Why do they do it?  Because:\n\nIt's a smart thing to do for every year.  This year is particularly special because of tax reasons.\n\nFor example, if you live in Seattle and have a bunch of shares in Microsoft, Apple, Costco, Amazon for more than a year.  If you sell those shares after this year (for a sizeable profit or you already a high earner) and if the build-back-better bill is passed as-is, your tax bill would be 7% (state, 0 for this year, has nothing to do with the bill) + 39.6% (used to be 20% for higher earners) + 3.8% (Obama care tax - same as last year - for high earners).  That's more than 50%.   If you sell them this year, it would be 23.8%.\n\nFor tax harvesting,  believing in the company alone it not enough.  You have to believe that the company would turn around in 31 days to hold the stock.  \n\nFor example.  If you bought BABA at $160 and now it's $130 and you believe that BABA will be $1000 in 2024 but not back to $160 by Jan 31, it makes sense to sell now, reduce the tax liability then buy it back after the 31 days wait period at a price somewhere between 130 and 160 (I simplified the math significantly, the exact break even price is the function of your tax rate).\n\nFor first year trader, they'll see the tax bill if there is a net profit plus the under payment penalty (if their income+profit is above $125k.  If it's below that, no penalty).  Cutting losses is a great way to avoid that penalty either by staying below the 125k cut off of just reduce the penalty in general.\n\nFor me specifically,  I have a rental property to sell (not sure yet) so I will bring some of the unrealized loss into next year (only the one that has some chance of recovering) to offset my LTC gains after tax harvesting a bunch this year.\n\nBuilding wealth is strategy that involves tax avoidance as much as maximizing profit/income.   After all,  mega back door Roth, cash value life insurance, HSA, 429, regular Roth etc. are all about future/current tax avoidance.",
        "created_utc": 1638639408,
        "id": "hn7tizs",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638668208.0
    },
    {
        "author": "InitializedVariable",
        "body": "You clearly didn’t do any research on a company you own, and are determined to hold.\n\nMicrosoft going parabolic over the last few years is attributable to a couple of key factors. You claim to “love Microsoft,” but apparently have no clue about these aspects.\n\n I literally rage-bought them this week because a coworker said something dismissive about their technology. And that was after having done so the morning prior. \n\nIn fact, I’m going to buy again on Monday, because this has right pissed me off. Might even go pre-market if I think back on this.\n\nConsidering you “love” them, I’d figure you could afford *1 hour every 3 months* to get an update on the company’s performance from leadership themselves. My heart skips a beat when I read the headline about them setting the date. Sometimes listening to conference calls is a beneficial chore, but MSFT reports are like my favorite band coming to town.",
        "created_utc": 1638637245,
        "id": "hn7obwb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638666045.0
    },
    {
        "author": "pintord",
        "body": "For Apple, no one wants and iPhone13, maybe 14 will do better, lol. Amazon will die under the avalanche of unionisation. META can't sell people's info anymore, they'll just burn all their cash to resolve privacy and disinformation lawsuits. Microsoft and Alphabet should survive since they control the email infrastructure and serve the corporate world.",
        "created_utc": 1638635933,
        "id": "hn7l6hv",
        "score": 1,
        "subreddit": "investing",
        "created": 1638664733.0
    },
    {
        "author": "AdNo7192",
        "body": "Msft risk? Really man! They are even safer then technical etf.",
        "created_utc": 1638635555,
        "id": "hn7kadd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638664355.0
    },
    {
        "author": "coolcomfort123",
        "body": "msft, googl and aapl are the safest investments on earth.",
        "created_utc": 1638643071,
        "id": "hn82mvq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638671871.0
    },
    {
        "author": "absurd_logic589",
        "body": "Don't let any let make you feel bad about selling. If you might need the money do it. If not just hold and wait. If your holdings are severely overvalued there is a good chance they won't ever get back to there all time high. Every always say but look at Microsoft and Amazon there are a exceptions the majority didn't come out that way.",
        "created_utc": 1638641218,
        "id": "hn7y02h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638670018.0
    },
    {
        "author": "silent_johnn",
        "body": "I'm fine in admitting that I'm too stupid to explain it (which I'm not, just lazy at the moment). However, I'm not too stupid to recognize that *these* people find incredible value in it and understand quite well decentralization:\n\n$100B+ locked in Ethereum DeFi, $51B+ in value lent\n\nEthereum is a global, decentralized software as a service (SaaS) platform that collects revenues in transaction fees. These transaction fees are now substantial: $60M in current 7-day-average fees on the Ethereum protocol ($20B annually)\n\nEthereum settling over $30B in value every day\n\nMacy's Releases 10 Thanksgiving Day Parade Themed NFTs\n \nAdidas minted a POAP\n\nTIME Magazine to Hold ETH on Balance Sheet as Part of Galaxy Digital Metaverse Deal\n\nCrypto.com buys naming rights to Lakers’ Staples Center in a $700 million deal\n\nSoftbank leads $93M investment in Sandbox ($SAND)\n\nBanksy’s ‘Love is in the Air’ sold for 1696 ETH\n\nConsitutionDAO raises $30M in attempt to bid on The Constitution (outbid)\n\nDCG raises --valuations stands at $10B after $700M secondary investment round\n\nNYDIG acquires Bottlepay for $300M\n\nSfermion raises $100M for emergence of the metaverse investing\n\nUbisoft announces plans to develop P2E NFT and blockchain games in their earning call\n\nSpruceID raises $7.5M to bring decentralized ID solutions to DeFi, DAOs, and NFTs\n\nMSFT planning future metaverse apps for xbox gaming, piracy control via NFTs\n\nNike intends to create and sell NFT branded sneakers and apparel\n\nAustralia’s CBA (Bank of Australia) offers crypto trading\n\nEnjin $100M metaverse-focused fund for projects in its ecosystem\n\nFC Barcelona issuing NFT photos and videos\n\nBTS Agency Hybe joint venture to release NFT cards\n\nEA Sports CEO calls “NFT and blockchain games the future of our industry”\n\nMythical Games raises $150M from A16z lead round\n\nMicro ETH futures from CME on Dec 6\n\nFTX partners with Kentucky basketball on debit cards and NFT sales for players\n\nVISA settling B2B transactions with USDC on Ethereum\n\nMC piloting settlement on Ethereum\n\nEIB (European Investment Bank) issues its first ever digital bond on Ethereum\n\nReddit launching community tokens on Arbitrum L2\n\nNBA, MLB, NFL, and NHL Partner Fanatics Launches NFT Company\n\nDisney Golden Moments, launches NFT on VeVe\n\nGamestop building NFT platform on Ethereum\n\nFB Metaverse rebranding\n\nWarner Bros launching Matrix NFTs\n\nESL to sell NFTs of CSGO Pro Tour’s “most memorable moments”\n\nPhotoshop releasing “export to NFT format”\n\nDiscord redesigning profiles with NFT/blockchain integration\n\nTwitter teasing NFT/blockchain integration\n\nSt Louis Fed report on Ethereum\n\nBank of America reports that Ethereum/DeFi will be more disruptive than Bitcoin to traditional markets\n\nCiti releases report on Bitcoin/Ethereum and the future of money\n\nMiami Residents To Receive Bitcoin Dividends From City’s Crypto Project\n\nDTCC Announces New Platform for Private Securities, will Interface with Ethereum\n\nBank of Israel looks to Ethereum for its CBDC development\n\nNFTs for 46-year-old Glenfiddich single malt whisky to ensure buyers get the real deal\n\nFedEx highlights global customs clearance as strong blockchain use case\n\nUnited Nations Sends Aid to 10,000 Syrian Refugees Using Ethereum Blockchain\n\nInsurance provider John Hancock has begun work on proofs-of-concept using blockchain in partnership with ConsenSys Enterprise and BlockApps.\n\nJ.P. Morgan is using Ethereum to launch a 'digital U.S. dollar'\n\nPWC and Onfido joins with uPort for digital ID strategy\n\nRussia’s Sberbank Uses Smart Contract to Settle Three-Way Repo Deal\n\nUber Subsidiary Grants Ethereum Startup Access To Entire American Fleet\n\nAmazon Is Looking to Put Advertising Data on a Blockchain\n\nSantander, BBVA in Spanish blockchain smart payments trial\n\nTencent Shareholder Partakes in $15 Million Round in Blockchain Game Developer\n\nAlibaba Filmmaking Arm to Distribute New Movie Rights via Tokens: Report\n\nMetLife Plans To Disrupt $2.7 Trillion Life Insurance Industry Using Ethereum Blockchain\n\nFord Uses Blockchain Tech to Track 'Green Miles' Driven By Vehicles\n\nBanca IMI Researcher Explores Ethereum Derivatives\n\nBank of Montreal launches blockchain-based pilot for fixed-income transactions\n\nSupply chain fintech startup Tradeshift Says It's Slashed Cross-Border Transaction Costs Using Ethereum\n\nNestle Tests Public Blockchains For Dairy Supply Chain\n\nMcDonald’s, Nestlé and Virgin Media join advertising blockchain pilot\n\nWalgreens, Walmart join MediLedger FDA blockchain pharma pilot\n\nRBC (Royal Bank of Canada) Files Patent To Make Credit Scores ‘Transparent’ Via Blockchain\n\nAnheuser-Busch InBev Is Using Ethereum to Track Ad Data\n\nAXA Is Using Ethereum's Blockchain for a New Flight Insurance Product\n\nDaimler's €100 Million Ethereum Bond Is Bigger Than Mercedes-Benz\n\nInsurance Giant Allianz Is Working on a Token-Based Blockchain Ecosystem\n\nFnality International joins Enterprise Ethereum Alliance\n\nSamsung Developing Ethereum-Based Blockchain, May Issue Own Token\n\nChinese Insurance Giant Ping An Partners With Decentralized AI Startup SingularityNET\n\nMedia conglomerate Thomson Reuters: Bringing Smart Contracts to the Mainstream With Ethereum &amp; Chainlink\n\nErnst &amp; Young contributes a zero-knowledge proof layer 2 protocol into the public domain to help address increasing transaction costs on Ethereum blockchain",
        "created_utc": 1638653026,
        "id": "hn8q182",
        "score": 1,
        "subreddit": "investing",
        "created": 1638681826.0
    },
    {
        "author": "AllBagNoDouche",
        "body": "Have you paid attention to all they have going on ??? MSFT is one of the safest companies you can invest in 100+ b a year &amp; 2T mkt cap… that’s enough alone",
        "created_utc": 1638644200,
        "id": "hn85cw3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638673000.0
    },
    {
        "author": "Banabak",
        "body": "Some things you won’t find in financial statements:\n\nBrand value ( apple, Tesla )\n\nNetwork effect ( Facebook , msft )\n\nIP value ( Google , amazon etc ) \n\nSomething like 90% of sp500 value are intangibles, this is why Buffed and value guys have been having a hard time for years \n\nYou can’t find this things on balance sheets like railroads and this is why investing is hard in individual companies",
        "created_utc": 1638644264,
        "id": "hn85i93",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638673064.0
    },
    {
        "author": "Secure-Sandwich-6981",
        "body": "So your saying nvidia is 2000 Microsoft?",
        "created_utc": 1638633314,
        "id": "hn7f80m",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638662114.0
    },
    {
        "author": "Opeth4Lyfe",
        "body": "I’m patiently waiting to buy it as well. It’s a fantastic company but it’s just so richly priced. Even a conservative 10% growth (for a tech stock) puts it at a 6.4t market cap in 10 years. 2.5x in a decade doesn’t scream buy me now….and that’s assuming Microsoft can grow at 10% into such a massive unheard of market cap.",
        "created_utc": 1638649858,
        "id": "hn8iqk7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638678658.0
    },
    {
        "author": "Mike_Ropenis",
        "body": "&gt;about to reinvent Web 3.0 and crypto gaming.\n\nBut until they do this (if they can, which is unlikely because that is a massive pivot for a phyiscal retailer to make) they are still a mall based retailer with:\n\n* shrinking revenue over the last 5 years\n* consistent losses over the last 3 fiscal years\n* no ownership of any gaming IP\n\nAnd as of 2020 the industry officially passed the critical 50% threshold for games being purchased digitally. EA, one of the biggest gaming companies in the world that owns most of the major sports IPs, hit 52% in 2020 and the trend is expected to continue. GameStop has no way to get any money on any digital purchase that isn't made through their own website.\n\nThey are competing against the digital marketplaces owned by MSFT, AMZN, Sony, GOOG, and AAPL, and then in person sales they are also competing against COST, BBY,  TGT and WMT.\n\nChewy never turned a profit until Cohen left.\n\nSources:\n\nhttps://finance.yahoo.com/quote/GME/\n\nhttps://screenrant.com/digital-game-sales-consoles-outnumber-physical-first-time/\n\nhttps://www.ign.com/articles/why-digital-sales-could-totally-dominate-physical-formats-in-just-a-few-years\n\nhttps://www.polygon.com/2020/8/11/21363951/video-game-sales-digital-online-xbox-one-ps4-publisher-figures-ea-activision-2k-games",
        "created_utc": 1638652046,
        "id": "hn8nso9",
        "score": 1,
        "subreddit": "options",
        "created": 1638680846.0
    },
    {
        "author": "SpliTTMark",
        "body": "The market only crashed 35% from the first COVID hit.\n\nIf msft fell to 160. It would still be higher than it's March 2020 days.",
        "created_utc": 1638649368,
        "id": "hn8hmjm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638678168.0
    },
    {
        "author": "BMG_Burn",
        "body": "I’d take Google over MSFT though, just personal preference.",
        "created_utc": 1638649309,
        "id": "hn8hhki",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638678109.0
    },
    {
        "author": "exemptionlife",
        "body": "Amazing how Tesla, Nvidia and Microsoft keep this market propped",
        "created_utc": 1638646050,
        "id": "hn89u4s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638674850.0
    },
    {
        "author": "JGWol",
        "body": "I think the world will scream at you from every direction in regards to how you should handle your money. Go short, go long, invest in real estate, buy gold, buy crypto, buy NFTs. Short crypto, go cash. Whatever.\n\nTruth is no one knows what will happen. Just because tech is over valued doesn’t mean we have to have a -30% limit down. We could just see less alpha until things catch up. The only major pull back we have seen has been on meme stocks or Covid stocks that were way over valued. Like way way\n\nIt’s why even if you aren’t investing (who in WSB is) you should at least be making your gambles with underlyings that are somewhat sensible. Buying calls on a company like Microsoft with a PE of ~30 might be more reasonable.\n\nAlso btw in relation to MSFT they had a PE of 68 (double what it is today) in March 2018. 3 years later their PE is half that and trading at 3x the price. So anyone who says a company is “overvalued” needs to stop thinking in terms of just the present.",
        "created_utc": 1638646011,
        "id": "hn89qq0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638674811.0
    },
    {
        "author": "DeveloperJ",
        "body": "I just dropped some apple along with Microsoft yesterday! When the market open and drops, I’ll get some google too!",
        "created_utc": 1638646019,
        "id": "hn89rex",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638674819.0
    },
    {
        "author": "NicomoCosca55",
        "body": "Apple\nMicrosoft\nAmazon",
        "created_utc": 1638475097,
        "id": "hmz1lhh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638503897.0
    },
    {
        "author": "Miguel_Neves_",
        "body": "Started around 1.5 months ago. Feeling good so far despite recent bumps\n\nAmazon 6% (+5.91%)\n\nApple 6% (+14.69%)\n\nAMD 6% (+36.45%)\n\nVUSA 6% (+5.65%)\n\nNvidia 6% (+43.78%)\n\nSpotify 6% (-3.63%)\n\nMicrosoft 5% (+11.57%)\n\nAlphabet Class A 5% (+5.63%)\n\nTesla 4% (+24.78%)\n\nNIO 4% (-1.7%)\n\nNetflix 4% (-0.32%)\n\nPayPal 4% (-18.59%)\n\nSquare 4% (-18.2%)\n\nWalt Disney 3% (-10.64%)\n\nBerkshire 3% (+2.67%)\n\nTarget 3% (+5.87%)\n\nAirbnb 3% (+1.66%)\n\nVisa 2% (-8.56%)\n\nMcDonald's 2% (+5.08%)\n\nCat 2% (+2.3%)\n\nSolarEdge 2% (+9.9%)\n\nFirst Solar 2% (+2.28%)\n\nCerence 2% (-20.27%)\n\nQuantumScape 2% (+2.22%)\n\nFortinet 2% (+3.87%)\n\nXPeng 2% (+15.57%)\n\nPalantir 2% (-14.59%)\n\nArray 2% (-2.7%)",
        "created_utc": 1638475521,
        "id": "hmz2mrb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638504321.0
    },
    {
        "author": "Nolan4sheriff",
        "body": "I mean the individual companies msft red appl red tsla red amzn red",
        "created_utc": 1638476331,
        "id": "hmz4ptb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638505131.0
    },
    {
        "author": "Any-Seaworthiness330",
        "body": "Why is msft down ?",
        "created_utc": 1638484938,
        "id": "hmzr551",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638513738.0
    },
    {
        "author": "harrison_wintergreen",
        "body": "VOO and QQQ are practically the same thing. look at the top 10 holdings for each ETF, and you're buying a lot of the same stocks twice. Apple, Microsoft, Nvidia, Tesla, etc. completely dominated by American large tech-leaning companies.\n\nQQQ is also more concentrated, only 100 stocks basically in a single industry, so potentially more risk than 500+ stocks in different industries. it's had such a red-hot run the last few years, I anticipate it'll cool off eventually. \n\nI'd recommend VOO + VXUS (60/40 or so)\n\nor VTI + VXUS (60/40)\n\nor VOO + VB (small cap) + VXUS (50/25/25)\n\n&gt;so does it really matter how the market is right now?\n\npotentially. the S&amp;P 500 under-performed 1-year T-Bills from about 1968-1982, and from 2000-2012. QQQ reached a peak in 2000, crashed, and needed 13+ years to recover. the Nikkei, main Japanese index, peaked in the late 1980s and needed 30 years to recover. in all cases, there was a big bubble that crashed. so buying at the peak can be a problem. I'm not saying there's reason to panic, but the US market, as measured by the Shiller P/E ratio, is at its second-highest point in history. historically, that's a bit of a red flag. https://www.multpl.com/shiller-pe\n\nyou could offset this risk by adding a total market fund (like VTI) or a healthy chunk in small-cap stocks (small cap dominated in the 1970s and after 2000). or add a small position, maybe 10%, in something completely different by holdings and strategy -- maybe DVYE (emerging market high dividend stocks), IGRO (developed markets international that have increased dividends historically). or perhaps a value-investing option that screens out overvalued stocks (VOOV, IVLU, etc)",
        "created_utc": 1638487012,
        "id": "hmzw2xq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638515812.0
    },
    {
        "author": "peachezandsteam",
        "body": "The same reason people listed to the top songs on radio/streaming platforms… it’s what e regime is doing.  The songs are usually good.\n\nAAPL has a virtual monopoly in personal electronic device space.  However, AAPL is starting to piss me off with a horrible camera on iPhone 12 Pro as well as absolutely fucking hideously-difficult things like saving files/PDFs to the phone and some other stuff.\n\nMSFT has a virtual monopoly in PC operating systems, business email, and other software.\n\nGOOG has a virtual monopoly in search engine, personal email, and consumer video creation (YouTube has virtually no competition).  I would point out that Google search engine, however, is starting to show signs of being bad at performing certain searches.\n\nThe barriers to competition for all those companies is astronomically high and basically insurmountable.\n\nEach has been and is presently so deeply ingrained in our lives, jobs, and society.  They all (more or less) make money by existing.\n\nI don’t know anything about NVDA.",
        "created_utc": 1638627865,
        "id": "hn73z4x",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638656665.0
    },
    {
        "author": "NnortheExperience",
        "body": "I need to reevaluate my positions at some point soon. Everytime I get just above even, something happens that pulls me back down. \"It's just a correction\" is starting to annoy me cause it corrects me right back down to 0. Probably just gonna rotate more things into msft and spyg.",
        "created_utc": 1638410839,
        "id": "hmvn1sh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638439639.0
    },
    {
        "author": "Joloven",
        "body": "I'm long on Apple, AMD, Nvidia and Microsoft right now. I think I will sell my QQQ and pay off a few bills. I am not confident of the stability of that index.\n\nTBH I am debating about pulling half out of my other markets in case there is a bigger dip and then buying that dip. Unsure.",
        "created_utc": 1638411251,
        "id": "hmvo021",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638440051.0
    },
    {
        "author": "bidens_aviators",
        "body": "NVDA COST MSFT OR AAPL",
        "created_utc": 1638429746,
        "id": "hmwmrcf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638458546.0
    },
    {
        "author": "brshoemak",
        "body": "I held all those for a while at some point.  ICLN because of Biden's election, and CRSR, ARKG because they were bandwagon stocks.\n\nGot burned by them, cut my losses, and rotated into other positions, and have been doing fine with some of the more boring but (usually) upward trending choices - VTI, MSFT, AAPL.  There's more than that in my portfolio, but that's what I did with the funds I clawed back from the stocks you're holding.",
        "created_utc": 1638466638,
        "id": "hmyfnll",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638495438.0
    },
    {
        "author": "Cwc123",
        "body": "idk msft was at 35 ivr this morning, its high but with the way charts look now there are more chances puts get bid up imo",
        "created_utc": 1638463622,
        "id": "hmy7q7y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638492422.0
    },
    {
        "author": "NTXL",
        "body": "Just turned 20. My strategy is to invest aggresively in  the stock market and mildly- aggresively in cryptocurrency for the next 5-10 years. As of now i work part time and  100% of my income goes to these investment. \n\nOveral portfolio\n35% - stocks(mostly U.S) in TFSA\n65% - cryptocurrency\n\nStocks :\n\nGOOGL - 50%\nMSFT - 15%\nAAPL - 15%\nABBV - 10%\nINTC - 10%\n\ncryptocurrency: \n\nUSDC - 45%(earning 10.2% APY) on celsius\nETH -30% (earning 6.5% APY on celsius)\nQNT - 10% \nLINK - 5%\nAAVE- 5%",
        "created_utc": 1638463695,
        "id": "hmy7wy1",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1638492495.0
    },
    {
        "author": "GloryhunterFC",
        "body": "WHY THE FUCK ARE YOU RED MICROSOFT?",
        "created_utc": 1638463701,
        "id": "hmy7xi5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638492501.0
    },
    {
        "author": "VisualMod",
        "body": "&gt;FANG+ Constituents:\n\\&gt;$AAPL 163.41 -0.83%\n$AMZN 3470.58 +0.79%\n$BABA 123.97 +1.22%\n$BIDU 150.04 +0.88%\n$FB 311.38 +0.24%\n$GOOG 2880.16 +1.68%\n$NFLX 619.12 +0.21%\n$NVDA 324.21 +3.14%\n$TSLA 1097.02 +0.22%\n$TWTR 42.87 +0.11%\n\\&gt;$MSFT 331.69 +0.48%\n\n^IGSquawk ^[@IGSquawk](http://twitter.com/IGSquawk) ^at ^2021-12-02 ^12:28:46 ^EST-0500",
        "created_utc": 1638466139,
        "id": "hmyecwx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638494939.0
    },
    {
        "author": "DarthTrader357",
        "body": "Oof, well MSFT has great long term potential and hell it might just one-time frame right back up. This 2 week \"stall\" could just be a consolidation.\n\nBut - even if it pulls back some, just buy more. You're probably not going to lose with MSFT in the monthly/yearly long run.\n\nJust because I see targets that are below its current price doesn't mean I'm bearish on the stock, just means it has to test a price level probably before going up more later.",
        "created_utc": 1638466816,
        "id": "hmyg45r",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638495616.0
    },
    {
        "author": "arie222",
        "body": "Yeah Zoom won’t even be a company in 5 years. At the enterprise level everyone will move to Teams since it will be packaged with the rest of the Microsoft suite.",
        "created_utc": 1638462528,
        "id": "hmy4xdc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638491328.0
    },
    {
        "author": "seattlenerdboy",
        "body": "Then they would be at the mercy of Apple, Microsoft and Sony. See Epic v Apple.",
        "created_utc": 1638463279,
        "id": "hmy6uep",
        "score": 1,
        "subreddit": "investing",
        "created": 1638492079.0
    },
    {
        "author": "TruChains",
        "body": "Downvote shame me for buying calls on PYPL.  I deserve this",
        "created_utc": 1638381300,
        "id": "hmtm06l",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638410100.0
    },
    {
        "author": "Redditsome22",
        "body": "[Pie graph](https://ibb.co/wwc9QhN?fbclid=IwAR1z1gj0gQ7T8nUUHXUVERiWjmndFdjXWnYv6Y-Y_BAsgDVGgiYFoKHRegU)\n\n&amp;#x200B;\n\nI have done a lot of repositioning into positions currently on what I considered a discount all of those flew high, too fast and burnt to the ground and beyond. went deep into BABA - currently 178avg and PYPL 211 avg - currently sadly sitting at an unrealized xx% loss. Also loaded on what was a speculative position last year with higher conviction now - bought quite a few CRSP at what I believe to be the bottom at the 78 range - currently avg at 102+-.{Not even mentioning my stupid PLTR,BB position - gambles going wrong atm, believing in the hype and the reason I bought hasnt changed still hence why i havent sold}\r  \n\r  \nAlthough I have sizeable losses here these positions have elevated my positions amazingly.\r  \n\r  \nHolding a sizeable position with xxx% returns on AMD and NIO and very bullish on SE - recently added to my position at 280\r  \n\r  \nbought into the AMC hype with a 14 avg and sold of 80% at around the 60 mark\r  \n\r  \n\r  \n\r  \nSquare shouldve been scalped and rebought 205-280 range and back is ridiculous but oh well\r  \n\r  \nsold JD into strenght to buy into my weaker positions - had a big position before. still bullish but seeing more upside elsewhere atm.\r  \n\r  \nI dont have any us mega caps- I know winners stay winners usually but I am looking for hopefully bigger returns albeith I run risk of big losses, clearly, as well - such as sizeble position in a clinical trial biotech AGTC - currently at a big loss aswell but that was expected. Lets see what happens here. stock at all time lows.\r  \n\r  \n\r  \n\r  \nfor example although im sitting at a 10avg with my SKLZ position the downside is limited here imo, and potential huge hence why I have been adding to my position lately a lot bellow 10\r  \n\r  \n\r  \n\r  \nI do recommend people look into CPNG and let me know their thoughts. I am torn between adding to this position or keeping it small.",
        "created_utc": 1638358232,
        "id": "hms9b17",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638387032.0
    },
    {
        "author": "avl0",
        "body": "Shouldn't ma v and pypl be pretty good with inflation?",
        "created_utc": 1638363450,
        "id": "hmsh510",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392250.0
    },
    {
        "author": "hurricane_floss",
        "body": "Find a stock you like, I like PayPal right now.. and then just slide money into my massive bag.",
        "created_utc": 1638351589,
        "id": "hms1asd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638380389.0
    },
    {
        "author": "ryanriehle",
        "body": "PYPL calls printing 🤑",
        "created_utc": 1638369436,
        "id": "hmssve8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638398236.0
    },
    {
        "author": "ratptrl01",
        "body": "Bought visa and paypal today, huge discount",
        "created_utc": 1638370568,
        "id": "hmsvfec",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638399368.0
    },
    {
        "author": "muchcoinmuchfun",
        "body": "Not even a shameless Cramer pump and SPY gap up could propel PayPal to GST and stay up over 190",
        "created_utc": 1638372079,
        "id": "hmsyxea",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638400879.0
    },
    {
        "author": "myrmonden",
        "body": "lol I dont get Pinterest movement at all\n\nit was up 1.5+% and higher up on pre market just like most of the stocks\n\n opens - 1.5% first minute another day low. \n\nIts already so oversold from the previous not being bought by paypal and before that rumor it was at 55, now its like 37 crazy",
        "created_utc": 1638369361,
        "id": "hmssph8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638398161.0
    },
    {
        "author": "Managery",
        "body": "PayPal pls",
        "created_utc": 1638371185,
        "id": "hmswu1m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638399985.0
    },
    {
        "author": "Wizardry8",
        "body": "Agreed.  What boomers don't realize is the new technology none of us know about yet that these tech companies will be investing in during the next decade.  Tech is going to be blowing up for thousands of years.\n\n&amp;#x200B;\n\nFun thing to do - look up stocks on this subreddit from years ago and read how everyone was saying X was overvalued.  Lots of folks in this subreddit were saying all kinds of stocks were overvalued a few years ago and yet they exploded in value.\n\n&amp;#x200B;\n\nWhat stock isn't overvalued?  PLTR? DIS? PYPL? V?  I feel like people on this sub think the strategy is to buy stocks that tanked like PYPL and that they are somehow outsmarting others who are \"part of the masses.\"  \n\n&amp;#x200B;\n\nApple is overvalued even though they keep innovating?  My ARM based mac mini is amazing for music production.  What has DIS done for me lately that changed my life for the better?",
        "created_utc": 1638373637,
        "id": "hmt2n3d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638402437.0
    },
    {
        "author": "ObeyClan",
        "body": "PayPal 200c 12/10",
        "created_utc": 1638368647,
        "id": "hmsr5z4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638397447.0
    },
    {
        "author": "InMuskWeTruskk",
        "body": "i think im yoloing pypl puts at open holy shit this is free",
        "created_utc": 1638367903,
        "id": "hmsplg9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638396703.0
    },
    {
        "author": "Fistijack61",
        "body": "PYPL 🤑🚀",
        "created_utc": 1638368139,
        "id": "hmsq32s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638396939.0
    },
    {
        "author": "feelscoloradoman",
        "body": "PYPL bb lets gooo",
        "created_utc": 1638367973,
        "id": "hmspqrv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638396773.0
    },
    {
        "author": "VisualMod",
        "body": "&gt;\\*PayPal Powers Pay Later Offerings for Wix Merchants This Holiday Season\n$WIX\n\n^\\*Walter ^Bloomberg ^[@DeItaone](http://twitter.com/DeItaone) ^at ^2021-12-01 ^11:37:14 ^EST-0500",
        "created_utc": 1638376650,
        "id": "hmta4wp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638405450.0
    },
    {
        "author": "5du5",
        "body": "There is a clear point on the chart where you will notice I bought pypl calls. For this I am sorry",
        "created_utc": 1638376656,
        "id": "hmta5jj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638405456.0
    },
    {
        "author": "muchcoinmuchfun",
        "body": "PYPL continues to consolidate around 187 floor.  But is it consolidating for elevator down or elevator up?",
        "created_utc": 1638375786,
        "id": "hmt7y3i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638404586.0
    },
    {
        "author": "ImAnonymous135",
        "body": "No, i hold DIS PYPL FB SPCE PLUG",
        "created_utc": 1638379094,
        "id": "hmtgbl5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638407894.0
    },
    {
        "author": "Perryswoman",
        "body": "Dam f u paypal",
        "created_utc": 1638379697,
        "id": "hmthuxx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638408497.0
    },
    {
        "author": "tomis8",
        "body": "PYPL needs more offerings?  It looks ready to take a whole new leg lower.",
        "created_utc": 1638380679,
        "id": "hmtke3k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638409479.0
    },
    {
        "author": "Brief-Garbage",
        "body": "Fintechs are coming out with cheaper fees every day now, it's not a duopoly for Visa and Mastercard (+ PayPal/AMEX). \n\nThey need to reduce their fees or they'll lose business - neither is good for earnings growth, and their  moat is reducing.",
        "created_utc": 1638379277,
        "id": "hmtgsha",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638408077.0
    },
    {
        "author": "perfectdark89",
        "body": "Imagine buying paypal calls 45 mins ago! Who would do that!",
        "created_utc": 1638383681,
        "id": "hmts6nv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638412481.0
    },
    {
        "author": "ratptrl01",
        "body": "I would only buy individual stocks either when you believe they are bulletproof (msft, aapl) or when they are very cheap/undervalued while still being profitable and of good historical stock (intel, visa, paypal) otherwise you benefit most from ETFs like SPY. There you get diversification. It is redundant to buy and hold msft and aapl with spy but I do it because they are the biggest drivers of the sp500 anyway, so they just boost my gains that much more.",
        "created_utc": 1638386285,
        "id": "hmtyx93",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638415085.0
    },
    {
        "author": "jrex035",
        "body": "Lmao got burned on all of those this year. Got out of CRSR and BABA when the going was bad but not that bad yet. V I sold for a minor loss and I'm still holding PYPL after buying on the dip (currently down 13% anyway)",
        "created_utc": 1638385415,
        "id": "hmtwokw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638414215.0
    },
    {
        "author": "old-wizz",
        "body": "Also SE, Paypal have a long history of red days",
        "created_utc": 1638386345,
        "id": "hmtz2w4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638415145.0
    },
    {
        "author": "dannyghobo",
        "body": "Why would you sell for a loss?  DCA if you can…  There has been a lot of insider buying going on over at PayPal.  Plus they should pick up during this holiday quarter, not to mention the Amazon partnership… Don’t be so quick to panic and over react.  It’s all part of the process.",
        "created_utc": 1638380236,
        "id": "hmtj8i8",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1638409036.0
    },
    {
        "author": "ChiefGriffey",
        "body": "I own and believe in SE, SQ, PYPL, SOFI, CRWD, PLTR of this group.",
        "created_utc": 1638380550,
        "id": "hmtk225",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638409350.0
    },
    {
        "author": "SavorySkills_",
        "body": "FB and PYPL damn thought I was safe",
        "created_utc": 1638396185,
        "id": "hmup1nt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638424985.0
    },
    {
        "author": "FruitBunker",
        "body": "whats the general take on PYPL? Big selloffs but currently in a support zone. Are people thinking its still a buy and will recover?",
        "created_utc": 1638394713,
        "id": "hmul6pq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638423513.0
    },
    {
        "author": "incognino123",
        "body": "energnoc is the grandaddy of dr companies - think tesla or paypal if they never made any money.  enel is a big italian energy co and enel x is their bullshit attempt to be innovative.  DR is a pretty small space and since it has never really been economical it's mostly a space of \"true believers\" or energy weirdos.  Think rainman but for obscure tariff codes.  \n\n\nAnd yeah Dana went to Dartmouth but generally folks are from the northeast.  They have started to pick up folks out west and elsewhere because of becoming remote and trying to expand their business.  But it's not that uncommon to see clusters of folks from a given background in startup environments. \n\n\nVoltus is not really a startup though.  Enernoc was bought and some folks didn't like the new culture and went their own way, it's more like a spin out of an existing business.  It's not disruptive **at all** and therefore deserves a not-disruptive multiple",
        "created_utc": 1638394739,
        "id": "hmul9c7",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638423539.0
    },
    {
        "author": "Ohmstheory",
        "body": "im tempted, but that P/E ratio of 215+ is stupid high compared to PYPL",
        "created_utc": 1638389151,
        "id": "hmu6df0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638417951.0
    },
    {
        "author": "TeamOggy",
        "body": "I got into PINS after the first drop and held through the PayPal rumour and didn't sell. I'm still holding 60 @ $53.56 and down around 30%. It's painful to see. There may be a point where I need to average down, but need to see if it stops bleeding sometime soon.",
        "created_utc": 1638390508,
        "id": "hmu9y8w",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1638419308.0
    },
    {
        "author": "segaman1",
        "body": "Delta airlines, PayPal, Visa and mastercard are in deep red right now for me, getting worse..",
        "created_utc": 1638389871,
        "id": "hmu88ov",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638418671.0
    },
    {
        "author": "new-chris",
        "body": "I am buying some PYPL - Xmas ain’t cancelled and I am sure they are up to something",
        "created_utc": 1638387934,
        "id": "hmu3798",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638416734.0
    },
    {
        "author": "ltsPricedln",
        "body": "$PYPL weeklies",
        "created_utc": 1638387444,
        "id": "hmu1y2d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638416244.0
    },
    {
        "author": "Substantial_Diver_34",
        "body": "Baldwin “didn’t pull the trigger on the gun” like I didn’t pull the trigger on those PayPal calls.",
        "created_utc": 1638393866,
        "id": "hmuiyo1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638422666.0
    },
    {
        "author": "Em4ever520",
        "body": "I would btfd except I’ve been doing that on stuff like pypl DKNG roku fb for a while now",
        "created_utc": 1638392407,
        "id": "hmuf3gu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638421207.0
    },
    {
        "author": "yojimbull",
        "body": "A week ago I was like…eh I’ll sell. Still got my PayPal tho. To the grave",
        "created_utc": 1638393736,
        "id": "hmuim58",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638422536.0
    },
    {
        "author": "nicknaseef17",
        "body": "VLXVX - 30.7%\nFBGRX - 25.5%\nVTSAX - 16.6%\nAAPL - 10.9%\nMSFT - 8.9%\nCOST - 3.6%\nABNB - 2.0%\nPYPL - 1.8%",
        "created_utc": 1638391085,
        "id": "hmubi1s",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638419885.0
    },
    {
        "author": "Vaenator",
        "body": "$SQ $PYPL $MELI $TDOC $CRM $APPS $PLTR $CVNA",
        "created_utc": 1638390963,
        "id": "hmub64c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638419763.0
    },
    {
        "author": "Noticeably",
        "body": "Hey, this looks like my account after I played Paypal earnings",
        "created_utc": 1638398138,
        "id": "hmutyyo",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1638426938.0
    },
    {
        "author": "Taste-Original",
        "body": "Paypal is only down 15% in the last year. It’s up over 364% in the last 5 years and over 400% since they went public.",
        "created_utc": 1638400541,
        "id": "hmuzmk9",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638429341.0
    },
    {
        "author": "Fantastic_Wallaby_61",
        "body": "PayPal JetBlue Norwegian Twitter fb",
        "created_utc": 1638397970,
        "id": "hmutk0r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638426770.0
    },
    {
        "author": "Equivalent_Mongoose",
        "body": "That helps PYPL. Thanks man",
        "created_utc": 1638397846,
        "id": "hmut92u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638426646.0
    },
    {
        "author": "FullTard2000",
        "body": "Averaging down on PYPL so I can panic sell later and have a lower average which will make me feel less stupid",
        "created_utc": 1638398171,
        "id": "hmuu1tk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638426971.0
    },
    {
        "author": "TruChains",
        "body": "Bought into PayPal. What the fuck am I doing. Aapl covering my losses",
        "created_utc": 1638380997,
        "id": "hmtl7hu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638409797.0
    },
    {
        "author": "Weak_Animator",
        "body": "Damn Paypal and Draftkings drops really pushing me pretty much back to even on my trades for the last like 7-8 months.",
        "created_utc": 1638381965,
        "id": "hmtnpxo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638410765.0
    },
    {
        "author": "TruChains",
        "body": "!banbet PYPL 1% 1hr",
        "created_utc": 1638381367,
        "id": "hmtm6h0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638410167.0
    },
    {
        "author": "ltsPricedln",
        "body": "has $PYPL even had a green finish in the past 2 weeks??  shit is literally down every day",
        "created_utc": 1638404297,
        "id": "hmv80ya",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638433097.0
    },
    {
        "author": "Grits_N_Gravy_23",
        "body": "It’s not even leveraged.  I’m only in stocks and not using any margin, and I’m down 20% in a month on non-meme names like PYPL, ROKU, DKNG, V, UBER, and many others.\n\nMy portfolio is a long list of stocks at 52 week lows.  😩",
        "created_utc": 1638411799,
        "id": "hmvpa1c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638440599.0
    },
    {
        "author": "luthervandrosss",
        "body": "What’s the reason PayPal is down?",
        "created_utc": 1638420168,
        "id": "hmw7bkf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638448968.0
    },
    {
        "author": "Emergency-Eye-2165",
        "body": "You in PYPL too?!",
        "created_utc": 1638415046,
        "id": "hmvws4v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638443846.0
    },
    {
        "author": "spiderman_44",
        "body": "Long-term V investor here, slowly building PYPL however V and MA still have the competitive moat for now",
        "created_utc": 1638420002,
        "id": "hmw705o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638448802.0
    },
    {
        "author": "zfunk9",
        "body": "Why is paypal still around? I thought people stopped using them when ebay stopped forcing people to. I was ecstatic once I was able to stop using it.",
        "created_utc": 1638423803,
        "id": "hmwdutq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638452603.0
    },
    {
        "author": "goetschling",
        "body": "I feel like PayPal is doing this now",
        "created_utc": 1638442862,
        "id": "hmx2lya",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638471662.0
    },
    {
        "author": "OhanaUchiha",
        "body": "Thinking on selling my CCL stock with a $3k loss. I still have $10k available to take out and debating on selling it for PayPal. Thoughts? CCL looks like it’s going to sink for sure this time.",
        "created_utc": 1638447505,
        "id": "hmx8y31",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638476305.0
    },
    {
        "author": "kk7766",
        "body": "WSB last week: OMG IMAGINE NOT BUYING PAYPAL AT $200 LOL IDIOTS",
        "created_utc": 1638424933,
        "id": "hmwfq23",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638453733.0
    },
    {
        "author": "spreadsTrader",
        "body": "Going to taper my account today\n\nThrowing out RKT, some RKLB (only one for gain), pypl, sdgr, dkng",
        "created_utc": 1638449727,
        "id": "hmxcki0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638478527.0
    },
    {
        "author": "dad_in_tx",
        "body": "Be careful with $PYPL. I think it will bounce off 175 or break through. If it breaks 175, I think the next stop is 125. Just my opinion.",
        "created_utc": 1638450129,
        "id": "hmxd9z7",
        "score": 1,
        "subreddit": "options",
        "created": 1638478929.0
    },
    {
        "author": "dontggme",
        "body": "PayPal definitely has a moat... Pick a random retail company and fill out a cart and see how your able to pay... PayPal is everywhere and built in to the internet at this point",
        "created_utc": 1638450997,
        "id": "hmxeub6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638479797.0
    },
    {
        "author": "punkcitykid",
        "body": "And 10 times out of 10 I'm using a credit card, not PayPal.",
        "created_utc": 1638452230,
        "id": "hmxh66f",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638481030.0
    },
    {
        "author": "InMuskWeTruskk",
        "body": "!banbet pypl 160 4w",
        "created_utc": 1638452436,
        "id": "hmxhksz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638481236.0
    },
    {
        "author": "shashinqua",
        "body": "If SQ is a buy right now then PayPal PYPL is a damn fire sale.",
        "created_utc": 1638410796,
        "id": "hmvmy8z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638439596.0
    },
    {
        "author": "maz-o",
        "body": "https://www.investopedia.com/terms/p/price-earningsratio.asp\n\nSQ P/E: 195\n\nPYPL P/E: 43\n\nV P/E: 33\n\nMA P/E: 37",
        "created_utc": 1638433078,
        "id": "hmwr100",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638461878.0
    },
    {
        "author": "rhythmdev",
        "body": "Paypal is garbage. Stay with V.",
        "created_utc": 1638431804,
        "id": "hmwpfvx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638460604.0
    },
    {
        "author": "lightrooster77",
        "body": "Leaps on SOFI? PYPL? SQ?",
        "created_utc": 1638462050,
        "id": "hmy3p9k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638490850.0
    },
    {
        "author": "vics80",
        "body": "I wish PYPL would have +10% days soon. A boy can pray, no",
        "created_utc": 1638462634,
        "id": "hmy571h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638491434.0
    },
    {
        "author": "ajfaria",
        "body": "Fubo ffs have 1 Green Day\nSame with PayPal",
        "created_utc": 1638460280,
        "id": "hmxz9ry",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638489080.0
    },
    {
        "author": "Qertyp",
        "body": "VISA and PYPL recovering?",
        "created_utc": 1638455879,
        "id": "hmxouou",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638484679.0
    },
    {
        "author": "Most_Common_3879",
        "body": "PYPL ![img](emote|t5_2th52|4257)",
        "created_utc": 1638455918,
        "id": "hmxoxx1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638484718.0
    },
    {
        "author": "bigred91224",
        "body": "PYPL is actually green today. The uptrend has finally started, right? \n \n  \nRight...",
        "created_utc": 1638458421,
        "id": "hmxuqxv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638487221.0
    },
    {
        "author": "solovino__",
        "body": "Sell $NIO ASAP. Not a fan of $SNAP, but never dig into them enough to recommend selling. $MSFT and $META are good long term holds in my opinion. Gonna take a while to double your investment (assuming you bought today) but strong financially and bright future. \n\n$NIO is insanely overvalued. There’s no argument here. All EV and renewable stocks, wouldn’t suggest hopping in. P/Es are inflated so high it’s a guarantee we’ll see lower prices (a lot lower!) soon. History has shown.\n\nI like undervalued gems. \n\n$SMCI, $ASO, $VIRT, $ERIC, and $MTZ are my small cap stocks for long term hold. Each have their reasons as to why I’m holding but more importantly, their financials are strong. P/S approximately 1 (tough to find this ratio in today’s market. Gotta dig.) P/E ratios are low relative to competitors. Some have little long term debt. Good ROEs. Increasing revenue. Just safe to hold and DCA down during times like this for me. \n\nLarge cap stocks I’m holding long are $TMUS, $VZ, $AAPL, $V, $MA, and waiting for $PYPL to hit $130 to hop in. But guess what? If it doesn’t hit, I’m not jumping in. Simple as that. Plenty of stocks out there, no reason why you should jump in a stock that hasn’t convinced you yet.\n\nOr if you don’t wanna bother and have a strong stomach to handle red days, buy $TQQQ. \n\nLast thing. Rule of thumb: if it’s being newly mentioned highly on Wall Street bets, and media outlets, most likely it’s too late.",
        "created_utc": 1638459716,
        "id": "hmxxvb5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638488516.0
    },
    {
        "author": "SnipahShot",
        "body": "I held MA for a really short amount of time and I own a MA card, but honestly, not sure about the long term future of these companies.\n\nI have my bank's app which allows me to transfer money to others based on phone number and directly from my bank account. Last time I was at the dentist, I paid using that. Same as last time I purchased something from a website I am not familiar with, don't have to risk putting in my credit card number. \n\nI don't know what both V and MA doing in terms of innovation but NFC in credit cards is not safe either, they can be charged even while you are walking in the street. Pretty sure they can also be copied.\n\nI don't really use my PayPal account but I think it would be a superior payment technology in the future than both credit card giants.",
        "created_utc": 1638457555,
        "id": "hmxspt5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638486355.0
    },
    {
        "author": "Last_Base_7580",
        "body": "look at pypl macd, might buy monthly calls",
        "created_utc": 1638372696,
        "id": "hmt0dv1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638401496.0
    },
    {
        "author": "Gigglebooster",
        "body": "Apparently not because PYPL continues to nose dive",
        "created_utc": 1638397382,
        "id": "hmus388",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638426182.0
    },
    {
        "author": "juandeag5981",
        "body": "I jumped off Corsair to get into PayPal and got double ass pounded. I deserve this.",
        "created_utc": 1638398910,
        "id": "hmuvuy3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638427710.0
    },
    {
        "author": "OhanaUchiha",
        "body": "Deciding selling my 613 shares of Carnival cruise lines (CCL) with a loss of $2.8k and purchasing PayPal with the share from Carnival. I can see CCL going bankrupts very soon with this new variant.",
        "created_utc": 1638401240,
        "id": "hmv14vg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638430040.0
    },
    {
        "author": "nokiatoth3moon",
        "body": "So PYPL below $180… those $215 bags are just getting heavier and heavier",
        "created_utc": 1638400187,
        "id": "hmuyut3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638428987.0
    },
    {
        "author": "Tacocats_wrath",
        "body": "Draft king does not do it for me. They have a lot of cash on hand. I don't see much thats good about them other then that. Maybe in the future,but not today. \n\nTheir last earning reported revenue of 212.82 M. Not bad, however they had a net income of -545M😳 and a net profit margin of -256%. \n\nIf you want to buy a nasty dip I would be more inclined to buy PayPal, autodesk, unity software, mercadolibre, visa, teladoc.",
        "created_utc": 1638401768,
        "id": "hmv29bs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638430568.0
    },
    {
        "author": "456393",
        "body": "So glad I dumped my PYPL bags at 184. Good riddance you pos",
        "created_utc": 1638392238,
        "id": "hmuemzs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638421038.0
    },
    {
        "author": "Doktor_Dysphoria",
        "body": "Bought PYPL like a fucking idiot. Down almost 5% from my entry.",
        "created_utc": 1638393099,
        "id": "hmugxlg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638421899.0
    },
    {
        "author": "hardcore_softie",
        "body": "Reminder that Cramer told his \"investment club\" to keep buying PYPL at $210, then at $190 told his followers to \"scale in\" because that's what pro investors do",
        "created_utc": 1638405862,
        "id": "hmvblc1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638434662.0
    },
    {
        "author": "PlasticKneeCaps",
        "body": "DKNG, PYPL seem like no-brainers to go up a lot eventually, just impossible to time when that will happen",
        "created_utc": 1638407167,
        "id": "hmvekjx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638435967.0
    },
    {
        "author": "Zealousideal_Rent_17",
        "body": "My name is cocaine Cramer buy dis pypl ma what a moron 🤡 short these stock and u will get paid 🦍",
        "created_utc": 1638406285,
        "id": "hmvcjya",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638435085.0
    },
    {
        "author": "GREAT1008",
        "body": "I guess you were right that PYPL will be at 180, I give you props for that.",
        "created_utc": 1638395360,
        "id": "hmumw3e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638424160.0
    },
    {
        "author": "muchcoinmuchfun",
        "body": "Newton’s law:  a shit stock in downward motion tends to stay in motion.  Looking at you PYPL and BABA",
        "created_utc": 1638393583,
        "id": "hmui7g4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638422383.0
    },
    {
        "author": "edgedrazor",
        "body": "Gonna buy Jan 2023 ROKU and PYPL calls tomorrow",
        "created_utc": 1638410542,
        "id": "hmvmd0q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638439342.0
    },
    {
        "author": "kk7766",
        "body": "WOAH look at max chart at things like BABA or TDOC or even fuckin PYPL this crash looks 2x - 3x bigger than March 2020 corona crash holy shit lmao",
        "created_utc": 1638413308,
        "id": "hmvsrrg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638442108.0
    },
    {
        "author": "OlderActiveGuy",
        "body": "Maybe PYPL. But I’m not touching anything right now. \n\nI bought COST because when times are great, people go to Costco and buy big screens. When times are tough, people go to Costco and buy food and essentials. People always go to Costco to buy gas. \n\nLook at their stock history. It’s not volatile and essentially goes up. So I’m sticking with it for the long term. Costco isn’t going anywhere and will be here for the long term. I’m a believer and a customer, and the news is just noise.",
        "created_utc": 1638413711,
        "id": "hmvtq7n",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638442511.0
    },
    {
        "author": "muchcoinmuchfun",
        "body": "I didn’t sell DIS puts bc I’m waiting to see what the new travel restrictions and mandates will be.  Omnicron in CA might shut down travel to Disney land.  I didn’t sell PYPL puts bc it finally broke the 185 support and I think the next leg down is to 175",
        "created_utc": 1638414638,
        "id": "hmvvvew",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638443438.0
    },
    {
        "author": "werewere223",
        "body": "Tbh I don't think so, I think it's got a better moat then Paypal by a long shot, yet Paypal is consistently shilled on here. I prefer it to Paypal and tbh I'm gonna keep buying",
        "created_utc": 1638427016,
        "id": "hmwixjq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638455816.0
    },
    {
        "author": "VisualMod",
        "body": "**Ban Bet Created:** **/u/InMuskWeTruskk** bet **PYPL** goes from **179.7** to **160.0** before **2021-12-30 08:40:43.991038-05:00**",
        "created_utc": 1638452449,
        "id": "hmxhlp0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638481249.0
    },
    {
        "author": "InForShortRidesUp",
        "body": "I am all-in on $AGC $GRAB (Ticker changes today).  They are ringing the Nasdaq opening bell today.  Go to [http://grab.com](http://grab.com) to see all of the things they do in SouthEast Asia.  Their one app does ride share, is a cash app like PayPal, grocery delivery, restaurant delivery, insurance and investments.",
        "created_utc": 1638452450,
        "id": "hmxhlro",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638481250.0
    },
    {
        "author": "dontggme",
        "body": "I don't because PayPal delivers your data set with address and name as well as payment options in several forms including cards, cash accounts, and credit ... I am holding visa heavily but don't count pypl out",
        "created_utc": 1638452492,
        "id": "hmxhoqc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638481292.0
    },
    {
        "author": "TruChains",
        "body": "Not matter what happens, sell PYPL",
        "created_utc": 1638451734,
        "id": "hmxg7is",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638480534.0
    },
    {
        "author": "Ap3X_GunT3R",
        "body": "I’ve been buying into ABNB. They showed good numbers in during the “original” phase of Covid and I expect that to continue. Other than that PayPal looks like a bargain",
        "created_utc": 1638455479,
        "id": "hmxnylp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638484279.0
    },
    {
        "author": "Buff_me_plz",
        "body": "Well. That's what I thought with PayPal, those leaps are -70% by now. Hoping they rebound decently. Expiry date mid September 2022",
        "created_utc": 1638432022,
        "id": "hmwppqh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638460822.0
    },
    {
        "author": "Sea_Willingness_5429",
        "body": "Trust me! As much I love paypal but due to huge competition I can see paypal at 130 very soon",
        "created_utc": 1638434686,
        "id": "hmwsyk7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638463486.0
    },
    {
        "author": "bonzowildhands",
        "body": "Paypal",
        "created_utc": 1638449765,
        "id": "hmxcmuy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638478565.0
    }
]