[
    {
        "author": "hockey8390",
        "body": "Since this somehow became controversial... Having done this test at the Stepan center years before you, want to chime in that this was well received by students. Not only does it give extra time, but it helped people remember to relax. Fairly certain the prof (yes I know that references a different Mendoza professor than here), also did some research to determine the mental break with the disturbance actually helped students as they could refocus around the time minds would tire. He also did this in his lectures by creating random interruptions like tossing out candy bars at the 40 minute mark because humans aren’t meant to sit still for that long without doing something else.",
        "created_utc": 1622938066,
        "id": "h0qqjwm",
        "score": 5248,
        "subreddit": "wallstreetbets",
        "created": 1622966866.0
    },
    {
        "author": "Euphoric_Car_6688",
        "body": "If you had, one short, or one opportunity, to squeeze everything you ever wanted, one margin, would you capture it? Or just let it dip. *mom's spaghetti*\n\n-Amenem",
        "created_utc": 1623801439,
        "id": "h1wrsgm",
        "score": 4567,
        "subreddit": "wallstreetbets",
        "created": 1623830239.0
    },
    {
        "author": "Razorray21",
        "body": "Op needs to take it up a notch. Like at least make it espresso",
        "created_utc": 1624548824,
        "id": "h2w8fqw",
        "score": 3850,
        "subreddit": "wallstreetbets",
        "created": 1624577624.0
    },
    {
        "author": "Trippp2001",
        "body": "Say it with me haven’t lost shit until they cover.\n\nTHEY HAVE NOT LOST A PENNY UNTIL THEY BUY BACK THE SHARES.",
        "created_utc": 1622751287,
        "id": "h0hctnl",
        "score": 2846,
        "subreddit": "wallstreetbets",
        "created": 1622780087.0
    },
    {
        "author": "Accomplished-Cream-1",
        "body": "This is an op. Account also says it threw half a mil at BP in January right before it tanked 20%. Y’all really got to stop believing this shit. The sub is compromised. We all know\nThat. Start checking these accounts and calling out there bullshit",
        "created_utc": 1623768561,
        "id": "h1uqk9a",
        "score": 2635,
        "subreddit": "wallstreetbets",
        "created": 1623797361.0
    },
    {
        "author": "WalkerTejasRanger",
        "body": "Them slow but sure gains were killing it but that free fall was so much more exhilarating.",
        "created_utc": 1623513058,
        "id": "h1ixygn",
        "score": 2575,
        "subreddit": "wallstreetbets",
        "created": 1623541858.0
    },
    {
        "author": "UnderstandingEvery44",
        "body": "He was also 3 years early on the 2008 crash. We are absolutely in a bubble. No one knows when it will pop. But it will. Until then I guess we’ll just keep hitting ATH every day",
        "created_utc": 1625060206,
        "id": "h3k4ke2",
        "score": 2397,
        "subreddit": "wallstreetbets",
        "created": 1625089006.0
    },
    {
        "author": "UpGoodDownBad",
        "body": "I can’t handle it, the retartedness is too strong!",
        "created_utc": 1623441674,
        "id": "h1fwtf9",
        "score": 2372,
        "subreddit": "wallstreetbets",
        "created": 1623470474.0
    },
    {
        "author": "Longjumping_College",
        "body": "That absolutely won't hold up in court, sell expensive device then brick it until you pay a subscription? \n\nGood luck",
        "created_utc": 1624392003,
        "id": "h2otcah",
        "score": 2288,
        "subreddit": "stocks",
        "created": 1624420803.0
    },
    {
        "author": "WSBWarrior",
        "body": "He decided to flex it on purpose too",
        "created_utc": 1622811367,
        "id": "h0k8rez",
        "score": 2284,
        "subreddit": "wallstreetbets",
        "created": 1622840167.0
    },
    {
        "author": "MattSwinney1979",
        "body": "I ask my wife what to do. Because she always tells me that my ideas are wrong... and she's right. So I ask her, If I agree then I do nothing. If I think she is wrong, I do it. So far I've lost a little money on the market and a lot in the divorce.",
        "created_utc": 1624463774,
        "id": "h2s3egk",
        "score": 2172,
        "subreddit": "wallstreetbets",
        "created": 1624492574.0
    },
    {
        "author": "pheonixz95",
        "body": "Can’t blame them, the company ends up paying for it when people write hot checks or deposit fake money into their accounts to buy stocks. This came from a person i know that works for td",
        "created_utc": 1622983733,
        "id": "h0sfu4z",
        "score": 2076,
        "subreddit": "wallstreetbets",
        "created": 1623012533.0
    },
    {
        "author": "T4coT4ctical",
        "body": "Hey OP!\n\nFolks here are right that it's fine to do. They're wrong that it won't necessarily raise alarms if this is the first time you've ever transferred a large amount of money into the account.\n\nHowever, if anyone bothers to look at the alarm, they'll see it's from your brokerage account and not give a fuck. Millions of people got involved in stocks for the first time in the last year, plus...it's your own account. \n\nIf you are wiring the money in, and then wiring it to random people in Afghanistan or Thailand, they may look closer.\n\nSource: I'm an Anti-Money Laundering Investigator at a large bank.",
        "created_utc": 1622597040,
        "id": "h09frpt",
        "score": 1932,
        "subreddit": "stocks",
        "created": 1622625840.0
    },
    {
        "author": "libtardskyshehexd",
        "body": "you won tax write off for the rest of your life! keep it up!",
        "created_utc": 1623551535,
        "id": "h1kwo11",
        "score": 1749,
        "subreddit": "wallstreetbets",
        "created": 1623580335.0
    },
    {
        "author": "NightLovell77",
        "body": "AMC is gonna blow through $70 tomorrow. No technical analysis or fundamental news. I can just feel it in my balls… and it’s not testicular cancer. AMC 🚀 🌙",
        "created_utc": 1623732123,
        "id": "h1tcv5c",
        "score": 1613,
        "subreddit": "wallstreetbets",
        "created": 1623760923.0
    },
    {
        "author": "Wiett",
        "body": "Hey everybody, some context:\n\nI didn't realize that I didn't meet the comment karma requirement when I first posted this, so the title comes off as being incredibly arrogant and selfish. To clarify: **the professor paid us to do this.** My roommate (the banana) and I were former students of his, who also had this happen during the exam. The University only gives two hours to take a midterm exam, which the prof felt was too short and didn't let his students adequately take it. He came up with a manufactured disturbance years ago and has been doing it annually ever since.\n\nBy creating a small disturbance that doesn't even last a minute just a few minutes after the exam begins, he can excuse giving extra time, and the administration allows it. The students surveyed afterwards have a majority approval of that since time is a goddamn **premium** on these tests and that extra hour is a godsend.",
        "created_utc": 1622936508,
        "id": "h0qnqaa",
        "score": 1598,
        "subreddit": "wallstreetbets",
        "created": 1622965308.0
    },
    {
        "author": "red-bot",
        "body": "&gt;“I’m not predicting that we’ll necessarily have a bust. But I do think it’s worth paying close attention to what’s happening in the housing market,” he said.\n\nThis is honestly ridiculous. Fuck it, I hope we have a bust. I *NEED* a bust. Last fall home prices were about $10-20k out of my range. Now, not even a year later, they are $120k out of my range. Rent prices keep going up. The only thing not going up that quickly? **My salary.**",
        "created_utc": 1624894633,
        "id": "h3bwux7",
        "score": 1596,
        "subreddit": "investing",
        "created": 1624923433.0
    },
    {
        "author": "slex1",
        "body": "We’ll really be in trouble if it starts moving left",
        "created_utc": 1625001403,
        "id": "h3hicf1",
        "score": 1553,
        "subreddit": "stocks",
        "created": 1625030203.0
    },
    {
        "author": "dragonstalking",
        "body": "If stocks are fake how is it they can fuck me so hard",
        "created_utc": 1624098886,
        "id": "h2b7r4k",
        "score": 1531,
        "subreddit": "wallstreetbets",
        "created": 1624127686.0
    },
    {
        "author": "hugo_posh",
        "body": "LOL \"is 20x leverage infinite?\" lost it there.",
        "created_utc": 1624026869,
        "id": "h27po3q",
        "score": 1507,
        "subreddit": "wallstreetbets",
        "created": 1624055669.0
    },
    {
        "author": "chodepoker",
        "body": "This is one of those canandian cannabis stocks isn’t it?",
        "created_utc": 1623806054,
        "id": "h1x0n7z",
        "score": 1483,
        "subreddit": "stocks",
        "created": 1623834854.0
    },
    {
        "author": "Accomplished_Force88",
        "body": "All stars are aligning. Public offering done; T+21; 002 active; Russell 1000. This is it, gentlemen.",
        "created_utc": 1624364396,
        "id": "h2n6uqf",
        "score": 1412,
        "subreddit": "wallstreetbets",
        "created": 1624393196.0
    },
    {
        "author": "RetardSensei",
        "body": "Atleast you have another 10k to lose. Do it like me and make it 0$",
        "created_utc": 1623789591,
        "id": "h1w39vy",
        "score": 1341,
        "subreddit": "wallstreetbets",
        "created": 1623818391.0
    },
    {
        "author": "MawdsRgay",
        "body": "Every time I feel confident about a stock it fucking tanks. \n\nSo this time I’ll remain bearish as fuck while still going long\n\nFuck you, logic of the world",
        "created_utc": 1622759723,
        "id": "h0hwa5f",
        "score": 1313,
        "subreddit": "wallstreetbets",
        "created": 1622788523.0
    },
    {
        "author": "N008toR3ddit",
        "body": "Welcome back!  Hopefully you spent the 90 days working real hard to earn money just so you can lose it all again",
        "created_utc": 1622823138,
        "id": "h0kyszb",
        "score": 1262,
        "subreddit": "wallstreetbets",
        "created": 1622851938.0
    },
    {
        "author": "QuietJoker",
        "body": "Oh I get it you’re like the retarded Hulk!",
        "created_utc": 1622754805,
        "id": "h0hkyb7",
        "score": 1233,
        "subreddit": "wallstreetbets",
        "created": 1622783605.0
    },
    {
        "author": "joeyo1423",
        "body": "I've been here for a long time and I hate what the gme fiasco did to this place. I don't find it nearly as fun anymore. And there was genuinely good DD and interesting info shared. Now every post is about the squeeze and some meme stock. It's all a few people hyping a stock, getting rich, selling while posting to HOLD THE LINE while everyone else goes broke holding the bag. \n\nI've seen people here with over a 1000% gain not selling. \n\nThis place went from fun retarded to retarded retarded",
        "created_utc": 1623256677,
        "id": "h166kqw",
        "score": 1204,
        "subreddit": "wallstreetbets",
        "created": 1623285477.0
    },
    {
        "author": "NFLfan72",
        "body": "My life story.. bought it at 9.. sold it at 12 and ran through the house screaming I was a genius.  fuck my life.",
        "created_utc": 1622656937,
        "id": "h0cae2v",
        "score": 1190,
        "subreddit": "wallstreetbets",
        "created": 1622685737.0
    },
    {
        "author": "trentgillespie",
        "body": "I’ve bought gme every week for the past few months. I don’t plan to stop until it launches",
        "created_utc": 1624759560,
        "id": "h3646u4",
        "score": 1172,
        "subreddit": "wallstreetbets",
        "created": 1624788360.0
    },
    {
        "author": "rubbleone",
        "body": "Peter Lynch \"worked at Fidelity\" is putting it lightly hahaha",
        "created_utc": 1623108835,
        "id": "h0yxteb",
        "score": 1166,
        "subreddit": "stocks",
        "created": 1623137635.0
    },
    {
        "author": "No_Island3080",
        "body": "Agreed, 90% of the time it feels like people saying \"squeeze\" don't even have data to back it up, and probably don't know what it means",
        "created_utc": 1623269682,
        "id": "h172ua6",
        "score": 1145,
        "subreddit": "wallstreetbets",
        "created": 1623298482.0
    },
    {
        "author": "Da3013",
        "body": "I was going to give you an award of a wine glass or something to give you your first drink. They didn’t have a wine glass but they do have blow so I was going to get you that. But it’s $100 and I’m not dumb enough to leave an extra $100 in my bank account because it doesn’t make money just sitting there. So you’ll have to settle for an emoji 🍷🍻",
        "created_utc": 1623426340,
        "id": "h1exqn6",
        "score": 1118,
        "subreddit": "wallstreetbets",
        "created": 1623455140.0
    },
    {
        "author": "amandarawrr",
        "body": "Next week will be huge! Can’t wait! It was already edited out of the full video on YouTube. Even more sus. It’s already trending boom boom!",
        "created_utc": 1622865019,
        "id": "h0ne41n",
        "score": 1117,
        "subreddit": "wallstreetbets",
        "created": 1622893819.0
    },
    {
        "author": "Occasional_Profit",
        "body": "My guy whips out his dick as he starts talking about 'tools' at his disposal. This is a king, a master of negotiation and persuasive speaking. He knows how to plant something in your mind and make you want it.\n\nOr I'm horny, one of the two.",
        "created_utc": 1622813028,
        "id": "h0kc76o",
        "score": 1088,
        "subreddit": "wallstreetbets",
        "created": 1622841828.0
    },
    {
        "author": "LegitosaurusRex",
        "body": "It’s really just a self-fulfilling prophecy at this point.\n\n1.\tPost big yolo on WSB\n2.\tBots and sheep pump it up\n3.\t???\n4.\tProfit",
        "created_utc": 1623183721,
        "id": "h12k9hb",
        "score": 1085,
        "subreddit": "wallstreetbets",
        "created": 1623212521.0
    },
    {
        "author": "Jadavan",
        "body": "You think a little red scares me? \n\nI was born in the red.\n\nRaised by the red.\n\nI didn’t see gains until I was a man by then it was nothing to me but blinding.",
        "created_utc": 1622737810,
        "id": "h0ggkye",
        "score": 1085,
        "subreddit": "wallstreetbets",
        "created": 1622766610.0
    },
    {
        "author": "dustinharm",
        "body": "Yes, when I deposit more money into it. A lot of people don't realize this trick.",
        "created_utc": 1624942395,
        "id": "h3eo5at",
        "score": 1074,
        "subreddit": "wallstreetbets",
        "created": 1624971195.0
    },
    {
        "author": "scawtsauce",
        "body": "Let's just say it was well over a thousand dollars.",
        "created_utc": 1623366844,
        "id": "h1c943q",
        "score": 1070,
        "subreddit": "wallstreetbets",
        "created": 1623395644.0
    },
    {
        "author": "RyHenZen",
        "body": "It won’t say “Great Order” until your balance is zero. The app developers don’t understand that humor heals but sarcasm just hurts.",
        "created_utc": 1623836473,
        "id": "h1y8heu",
        "score": 1067,
        "subreddit": "wallstreetbets",
        "created": 1623865273.0
    },
    {
        "author": "foolon_thehill",
        "body": "High Liquidity is good for the market. Really, unnecessarily, high liquidity is really good for high frequency trading hedge funds algorithims ability to leach money out of the economy. That's why Robinhood  was just a brilliant, some what sadistic idea. Put a nice UI on the app, emphasize options trading for the opportunity to entice the get rich quick trap. Create a new generation of day/ momentum traders that mostly loose but some make it big creating hype to bring in new suckers. Then name it after a fairytale about stealing from the rich and giving to the poor when it really the opposite... on top of citadel pays for the order flow from Robinhood so they have almost all of the data of how Robinhood traders react to price movements... this is not even the tip of the iceberg as well. It is fucked...",
        "created_utc": 1622986602,
        "id": "h0skm8o",
        "score": 1053,
        "subreddit": "stocks",
        "created": 1623015402.0
    },
    {
        "author": "PreppyGuyByDay",
        "body": "There are rules in place that state if a firm short sells a security they are required to document what they have done to locate that security. Regardless of whether the seller’s short position may be closed out by purchasing the security the same day, firms will need to document that they have borrowed or arranged to borrow the stock, or they have reasonable grounds to believe they can borrow the stock and deliver on delivery date.\n\nNaked shorting is the illegal practice of short selling shares that have not been affirmatively determined to exist - there has been no locate.\n\nHave firms been doing this? Yes, wall street isn't a bunch of choir boys that play by the rules. Any way to make money and they are doing it, not often or widely but you can be sure they are.",
        "created_utc": 1622912454,
        "id": "h0pcq2v",
        "score": 1026,
        "subreddit": "stocks",
        "created": 1622941254.0
    },
    {
        "author": "chumbawamba56",
        "body": "That's actually what stirred my friend to look into it. You'd think short supply would mean the difference in price going to pay for labor to get more wood. But seeing how profit margin for mills are up massively clearly debunks that. The profit is going to these mills.",
        "created_utc": 1622758001,
        "id": "h0hsp5r",
        "score": 1020,
        "subreddit": "stocks",
        "created": 1622786801.0
    },
    {
        "author": "working_joe",
        "body": "OK it's really pretty easy. Imagine you want to buy a house that is worth $100,000. You put down a down-payment of 5%, or $5000.\n\nNow let's say a month later you've done the appraisal and all the paperwork is ready and it's time to buy. But during that month something indirectly happened that affected the value of the house. \n\nMaybe Disney announced they were building a new park nearby and the value of the house doubled.\nMaybe the city announced they were building a sewage plant nearby and the value of the house plummeted.\n\nEither way, you've already got an option to buy the house at the $100,000 agreed on a month ago regardless of what the price is today. Notice I said option. You don't actually have to.\n\nIn the 1st example where the value went up, you can buy the house for $100,000 even though it's worth $200,000, instantly pocketing $100,000 profit in equity. Maybe Beyonce buys the house across the street and the house you wanted goes up to $5 million *in value*. The *cost* remains the same to you. You still get to buy it for $100,000. In theory the price of the house could skyrocket to any amount and you'd still only have to pay $100,000 since you secured that price when you put down the down payment. The possibilities for profit are endless, the sky is the limit. \n\nIn the 2nd example where the price went down and they're building a sewage plant nearby, you decide you don't want the house anymore. You're not required to buy it, but you forfeit your down payment and lose $5000. No matter how much the value of the house has dropped, you can't possibly lose more than your $5000 down payment. \n\nSo while the possible profits are infinite, the possible losses are capped at your initial down payment. \n\nLet's use that extreme example; Beyonce moves in next door and the house is worth $5 million now. You decide you just want the cash, you don't even care about the house. You want to pocket the money and you can go buy a different house. You sell the option to buy the house at $100,000 to someone else for say $4.6 Million. Not quite the full $5 million because they still have to buy the house, there's a lot of paperwork, etc. You never even owned the house, all you ever owned was the option to buy the house, but you sold that option to someone else and made a huge profit because you were smart (or lucky) and secured that option when the price was low.\n\nThis is almost exactly what call options are, with the most significant difference being that your 'down payment' is not applied to the cost of the stock if you choose to buy it. Instead it's paid like a fee for the privilege of buying the option. Otherwise it's pretty much the same. You buy an option today to lock in the price (called a strike price) to buy the stock next week, next month, or whenever you choose. If you locked in a price lower than the stock is actually worth you can either buy the stock at that lower price, or sell your option and let someone else buy the stock at that strike price. If the stock goes down below the strike price, you don't have the buy the stock, you just lose your deposit. So the profit potential is limitless, but your potential loss is capped at your deposit fee.\n\nSo let's look at a call option example using simple numbers.\n\nToday's AMC price is $50. You think it will go up to $100 by next Friday. With a traditional long sale you just buy the stock at today's price and hope it goes up. If it's $100 next Friday you've made $50. If it's $200 you've made $150. If it's $10 you've lost $40. This is how you currently buy stock. The problem is your potential earnings is limited to how many shares you can afford to actually buy, and your potential loss is... well you could lose everything if the business goes bankrupt.\n\nThis is the beauty of call options. Options are pretty cheap, and you don't have to actually buy the shares. I can buy an option to buy 100 shares for a deposit fee of anywhere between maybe $1 to $15. Even though I don't have enough money to buy 100 shares, I do have enough money to pay for an option, knowing I have no intention of actually buying the stock. Instead, if the price of the stock moves up above what I guessed it would and what I have the option of paying (the strike price), I can sell the option to someone else who can afford to buy the stock. They're happy to buy it because they're getting the stock at less than market price, and I'm happy to make money selling the option. If my prediction was wrong, I'm not on the hook for buying the shares, I just forfeit my deposit.... times 100. Wait what? Times 100?! Yes but wait it's not as bad as it sounds. 1 option allows you to buy up to 100 shares, however you pay the deposit on each share if you buy the stock, and you forfeit the deposit on each share if you don't. It's not that bad though if you consider you could be buying stock at way below market value. \n\nSo let's look at the example above again. If AMC is $50 today, and I think it will be $100 next Friday. I don't have enough money to buy many shares but I do have enough money to buy an option to buy the stock for $50 per share (the strike price) any time until the end of the day next Friday, that option only costs me a $10 deposit fee. That's all I need to put down today. Now if I'm right, and the price hits $100 next Friday, I could buy up to 100 shares for $50 each plus that $10 deposit on each share for a total of $60 per share. That $10 deposit seems steep times 100 but remember the stock is worth $100 so if I do exercise my option to buy all 100 shares I've made a $40 profit on each one.\n\n$50 strike price +$10 deposit fee X 100 = $6000 cost to buy 100 shares\nValue $100 per share X 100 = $10,000\nProfit $4,000\n\nWell why not just buy the 100 shares today for $50 each? You could, let's consider that.\n\n$50 X 100 = $5000\nValue $100 per share X 100 = $10,000\nProfit $5,000\n\nAt first glance it seems like it simply makes more sense to just buy the stock and not bother with the call options at all. In this particular case with these particular numbers that would have been the smarter choice. But what if the value didn't go to $100? Let's look at some other scenarios.\n\nFirst let's simply say you don't have $500 today to buy the 100 shares but you are expecting to have money next Friday. Well you could buy the shares next Friday but by then they're up to $100 each remember? You can only afford 50 shares instead of $100 and you have $0 profit. In this case where you don't have money right now, buying a call option today to lock in the price for next Friday would have been your better choice since you'd have 100 shares and $4000 profit instead of 50 shares and $0 profit.\n\nWhat if you don't have $5000 to buy in today and you won't have $5000 by next Friday? Well remember you don't actually have to buy the stock. You can sell the option to someone else and let them buy it. You can buy an option today for just $10 and sell it before the end of the day next Friday for a profit as long as the share price hasn't dropped below the strike price + deposit fee. If it goes to $100 you'll be able to sell for somewhere around $2000. You don't get the full $10,000 of course because the guy you sell the option to still has to actually buy the stock himself. But still you can make a ton by selling your option as long as it's still at a profit (in the money). Worst case scenario it drops below the strike price you locked in and you are required to forfeit the deposit times 100 for a total loss of $1000. But that's the maximum you could lose, even if the stock drops to zero you're not required to buy it, you can't lose more than your deposit times 100 shares. While it seems like a big risk, your risk is capped, and the potential profits are ridiculous for very little investment. \n\nSome other factors to consider are determining the strike price and the expiration, as these both affect your deposit fee.\n\nIf the stock is at $50 today and you choose a strike price of $50, the deposit is kind of high ($10 per share) because there's a very good chance you will make a profit.\nIf the stock is at $50 today and you choose a strike price of $100, the deposit is lower (maybe $6 per share) because it's less likely that the price will go that high and your risk of losing your deposit is higher.\nIf the stock is at $50 today and you choose a strike price of $150, the deposit is much lower (maybe $3 per share) because it's very likely the price will not hit $150 per share and you will lose your deposit. \n\nThe maximum strike price you can choose is capped at roughly 300% of the current share price.\n\nYou can actually choose a strike price *lower* than than today's price, however the deposit is extremely expensive because it's very likely that the price won't drop below the strike price. For example you can actually buy an option to buy AMC shares for 50¢ each! But it costs almost a $60 deposit fee PER SHARE, lol.\n\nIf the call option expires and you haven't sold it, your broker will automatically exercise it for you if you have enough buying power in your account. Otherwise it will automatically sell it for you. If the price has dropped below the strike price, the cost of the deposit times 100 will be deducted from your account.",
        "created_utc": 1623743476,
        "id": "h1tqusk",
        "score": 1000,
        "subreddit": "wallstreetbets",
        "created": 1623772276.0
    },
    {
        "author": "nams0",
        "body": "Transcript from chairman Ryan Cohen from today's shareholder meeting:\n\n\"We ushered in a whole new era of GameStop. On a personal note, I want you to know I’m humbled to be elected to your board and serve as your Chairman. We have a lot of work in front of us, and it will take time. We’re trying to do something that nobody in the retail space has ever done but we believe we’re putting the right pieces in place and we have clear goals: delighting customers and driving shareholder value for the longterm. The management team and refreshed board will remain totally focused on these goals at all times. We know some people want us to lay out a whole detailed plan today, but that’s not gonna happen. You won’t find us talking a big game, making a bunch of lofty promises, or telegraphing our strategy to the competition. That’s the philosophy we adopted at Chewy. Here are a few things we’ve done so far: refresh the board, added technology and retail experience to the leadership team, paid off all our long term debt and strengthened the balance sheet, and begun laying the foundation for long term growth. Moving forward, we want you to judge GameStop based on our actions, not our words. Thank you everyone, and as my dad would say, “buckle up.\"\"",
        "created_utc": 1623276027,
        "id": "h17i5e7",
        "score": 989,
        "subreddit": "stocks",
        "created": 1623304827.0
    },
    {
        "author": "BluntsNLegos",
        "body": "Its not impossible,  I was really scared of doing them but watch a ton of youtube vids and take notes.  Take it seriously like you have a test coming.  Started doing that last week and starting to really \"get\" it.\n\nBut believe in yourself, take it seriously  and take notes and you will get there.  \n\nNever forget the letters that spell trader also spell.......\n\nRetard",
        "created_utc": 1623728273,
        "id": "h1t6x6a",
        "score": 971,
        "subreddit": "wallstreetbets",
        "created": 1623757073.0
    },
    {
        "author": "thelastsubject123",
        "body": "this has been posted pretty much every week, if not every day\n\nno one will know when a drop will happen. there will definitely be a drop in the future, could be next week, next year, next decade. but when it does happen, it just means buy the dip",
        "created_utc": 1623696460,
        "id": "h1rdzb5",
        "score": 951,
        "subreddit": "stocks",
        "created": 1623725260.0
    },
    {
        "author": "Uniquemowers",
        "body": "Yeah... what he said. Not going to try and repeat it",
        "created_utc": 1622663542,
        "id": "h0cq62j",
        "score": 940,
        "subreddit": "wallstreetbets",
        "created": 1622692342.0
    },
    {
        "author": "hom6872",
        "body": "Watching the market every day is exhausting.  I’m sort of a hypocrite for saying this, but you will drive yourself insane looking at it every single day.",
        "created_utc": 1622759658,
        "id": "h0hw58r",
        "score": 936,
        "subreddit": "stocks",
        "created": 1622788458.0
    },
    {
        "author": "mis-Hap",
        "body": "Elder here.  You are right that this is a casino.  Not so sure you're right that we're dedicated to FD's though.  Stock traders and LEAP buyers have always been welcome since I've been here.\n\nThe point is more so that you're making a BET, not an investment.  It doesn't matter if it's a daily, weekly, monthly, LEAP, or swing trade on a stock.  As long as it's a bet and not an investment, you're good.\n\nSometimes even investors are forgiven as long as they have the right attitude for the sub and don't try to convince us to put our money in a mutual fund.",
        "created_utc": 1623349520,
        "id": "h1b6cj1",
        "score": 936,
        "subreddit": "wallstreetbets",
        "created": 1623378320.0
    },
    {
        "author": "ChiefCokkahoe",
        "body": "I don’t think it will be",
        "created_utc": 1622867290,
        "id": "h0nhq3q",
        "score": 928,
        "subreddit": "wallstreetbets",
        "created": 1622896090.0
    },
    {
        "author": "cranialrectumongus",
        "body": "Way to stick the landing!  I give it a 10.",
        "created_utc": 1623514576,
        "id": "h1j0w3s",
        "score": 879,
        "subreddit": "wallstreetbets",
        "created": 1623543376.0
    },
    {
        "author": "thisisshe14",
        "body": "Did you get DMs about them doing a movie?  I got asked if they could use my posts and for me to click a link but I thought it was a scam haha",
        "created_utc": 1622812544,
        "id": "h0kb8sj",
        "score": 863,
        "subreddit": "wallstreetbets",
        "created": 1622841344.0
    },
    {
        "author": "ColdFusion94",
        "body": "Lucky bastard! I rarely make it to the second floor before falling down a laundry chute or something.",
        "created_utc": 1623516579,
        "id": "h1j4ubm",
        "score": 809,
        "subreddit": "wallstreetbets",
        "created": 1623545379.0
    },
    {
        "author": "Famous_Way",
        "body": "“He’s the chairman of the SEC, alright Dave we’ll leave it there”.\n\nThat made me 😳😳😳",
        "created_utc": 1624611494,
        "id": "h2z5rgf",
        "score": 805,
        "subreddit": "wallstreetbets",
        "created": 1624640294.0
    },
    {
        "author": "30withneeds",
        "body": "I'm slapping 12k on it on open. So load up and let's rip!",
        "created_utc": 1623213105,
        "id": "h146w9l",
        "score": 796,
        "subreddit": "wallstreetbets",
        "created": 1623241905.0
    },
    {
        "author": "OneMoreTime5",
        "body": "I’m new to this sub. It has the funniest culture. I’m staying, for sure. \n\n\nI’m also down like 20% across all my meme stocks so far, this is fantastic.",
        "created_utc": 1624031832,
        "id": "h280q0n",
        "score": 787,
        "subreddit": "wallstreetbets",
        "created": 1624060632.0
    },
    {
        "author": "SuperBro9000",
        "body": "Just had a random thought - what if all the recent crazy meme stonks rocketing is the hedgies trying to distract from GME?\n\nEither way, end of today I’m closing every position and putting it all on GME",
        "created_utc": 1623233792,
        "id": "h14wlzu",
        "score": 776,
        "subreddit": "wallstreetbets",
        "created": 1623262592.0
    },
    {
        "author": "Privat3Ice",
        "body": "Once you execute the sale, the gain is taxable. \nEven if you reinvest the money.\nEven if you never spend it.\nEven if you later lose it (you can write off realized losses against realized gains, tho)\n\n(I have 11 years tax preparation experience).",
        "created_utc": 1623777509,
        "id": "h1vb4t5",
        "score": 776,
        "subreddit": "wallstreetbets",
        "created": 1623806309.0
    },
    {
        "author": "zutrasimlo",
        "body": "If it’s just a crash, it will come back. If it’s the end of everything, money is worthless.  It’s a win-win",
        "created_utc": 1625032753,
        "id": "h3j51pa",
        "score": 775,
        "subreddit": "stocks",
        "created": 1625061553.0
    },
    {
        "author": "Monkeywithoutbrain",
        "body": "Haha glad someone caught it!",
        "created_utc": 1624666413,
        "id": "h3202nk",
        "score": 767,
        "subreddit": "wallstreetbets",
        "created": 1624695213.0
    },
    {
        "author": "wsb_mods_R_gay",
        "body": "Now if you would have put the $22k into shares and the $1600 into options, it would have been the smarter play. But then we wouldn’t have this glorious loss porn.",
        "created_utc": 1624030917,
        "id": "h27yo19",
        "score": 764,
        "subreddit": "wallstreetbets",
        "created": 1624059717.0
    },
    {
        "author": "IdealEnthusiasm",
        "body": "I’m gonna need AMC to get it together and rebound",
        "created_utc": 1622728514,
        "id": "h0fu90g",
        "score": 760,
        "subreddit": "wallstreetbets",
        "created": 1622757314.0
    },
    {
        "author": "UnderstandingEvery44",
        "body": "You had 30k to throw on amc and you waited til it hit $60?",
        "created_utc": 1622731429,
        "id": "h0g14dq",
        "score": 755,
        "subreddit": "wallstreetbets",
        "created": 1622760229.0
    },
    {
        "author": "americandude91",
        "body": "Soooo you’re saying invest in crashed tech stocks with AMC tendies???  Got it! 👍",
        "created_utc": 1622685673,
        "id": "h0e1hh5",
        "score": 750,
        "subreddit": "stocks",
        "created": 1622714473.0
    },
    {
        "author": "nucknfutz83",
        "body": "Sell your couch for one more yolo and it will be less to move.",
        "created_utc": 1623465459,
        "id": "h1h5hds",
        "score": 750,
        "subreddit": "wallstreetbets",
        "created": 1623494259.0
    },
    {
        "author": "SSS0222",
        "body": "Mostly to concentrate liquidity.\n\nMost options aren't sufficiently liquid (ITM and OTM ones) even during normal open market hours with wide big ask spreads.\n\nEven stocks when they trade in premarket or afterhours have bad liquidity.\n\nA stock has just a single ticker, but for every stock there are maybe hundreds of options prices across strikes and all expiries.\n\nFor market markers it isn't worth the trouble in non market hours for options. They generally have to hedge their option positions they are selling you by immediately buying/selling stocks but the afterhour stocks market isn't liquid enough to do it efficiently. \n\nThus providing MM activity of those hundreds of quotes for each share which themselves are illiquid isn't lucrative, hence nobody demands afterhours for options.\n\nIt is better to have option buyers/ seller concentrate their trade activities in limited market hours window than spreading it over entire day. \n\nIndex futures which are way more liquid for example are allowed to trade 23 hours each day. So it is all about liquidity.",
        "created_utc": 1622737059,
        "id": "h0ges7l",
        "score": 747,
        "subreddit": "stocks",
        "created": 1622765859.0
    },
    {
        "author": "Xen0Coke",
        "body": "Gme is still heavily shorted.  Post makes it sound like short sellers have stopped shorting but that’s not the case.  Just a reminder.  Amc and gme to the moon",
        "created_utc": 1622911405,
        "id": "h0pal95",
        "score": 739,
        "subreddit": "wallstreetbets",
        "created": 1622940205.0
    },
    {
        "author": "IamGhazi",
        "body": "$BB lets do it guys lets hit 50 at least!",
        "created_utc": 1622727280,
        "id": "h0fre7i",
        "score": 726,
        "subreddit": "wallstreetbets",
        "created": 1622756080.0
    },
    {
        "author": "r-T00Littl3Time",
        "body": "Agreed, for about a year I've been thinking, why don't all companies have perks for their shareholders.  It would be a wise move.",
        "created_utc": 1622637128,
        "id": "h0b1eeu",
        "score": 723,
        "subreddit": "stocks",
        "created": 1622665928.0
    },
    {
        "author": "chodepoker",
        "body": "Wait… so he gave away 400k worth of weed and can’t collect on it? \n\nThis dude’s not exactly Pablo Escobar. Lol. \n\nIs there any explanation?",
        "created_utc": 1623806905,
        "id": "h1x2a08",
        "score": 722,
        "subreddit": "stocks",
        "created": 1623835705.0
    },
    {
        "author": "You-Only-YOLO_Once",
        "body": "Why aren’t the GME posts making it to the top of WSB!?",
        "created_utc": 1623209428,
        "id": "h140luh",
        "score": 713,
        "subreddit": "wallstreetbets",
        "created": 1623238228.0
    },
    {
        "author": "MindlessElectrons",
        "body": "Futurama was a show that dressed up smart jokes in dumb ways so if you didn’t get it it was still funny and if it did get it then it was an extra reward for you.\n\nBig Bang Theory is just… dumb.",
        "created_utc": 1622798212,
        "id": "h0jppdp",
        "score": 702,
        "subreddit": "wallstreetbets",
        "created": 1622827012.0
    },
    {
        "author": "Horror-Lemon3200",
        "body": "What the fuck is that color? Why is it not red?",
        "created_utc": 1622636917,
        "id": "h0b11u0",
        "score": 702,
        "subreddit": "wallstreetbets",
        "created": 1622665717.0
    },
    {
        "author": "GushingGranny1",
        "body": "Yeah took me a while to write it. I just added a paragraph here and there whenever I had free time. \nAnd I identify as an Apache Helicopter",
        "created_utc": 1624805334,
        "id": "h37ssds",
        "score": 698,
        "subreddit": "wallstreetbets",
        "created": 1624834134.0
    },
    {
        "author": "stasik5",
        "body": "That was such a perfect moment to end this interview. It was a beautiful cherry on top. How does Pörtnøy have any credibility left??",
        "created_utc": 1624605349,
        "id": "h2yz7nu",
        "score": 696,
        "subreddit": "wallstreetbets",
        "created": 1624634149.0
    },
    {
        "author": "HeinzKetchup5775",
        "body": "An index fund that tracks SPY.\nOne of my earliest ETF investment was VTI at 30k. I've never added to it since. It's worth 75k now.\n\nSPY doubles in value every 6.5 to 7 years.\n\nIf you're not a stock picker, buying an index fund goes up slow and steady. No tremendous gains or losses. \n\nI'm a gambler now, i like to pick stocks. But 40% of my portfolio are index funds.\n\nSPY annualized has returned 15% in like the last 15 years.",
        "created_utc": 1624313689,
        "id": "h2l5g0n",
        "score": 692,
        "subreddit": "stocks",
        "created": 1624342489.0
    },
    {
        "author": "JoeySlowgano",
        "body": "This is what keeps me coming back. Just when I’m down $800 this week and feeling shitty about it, some beautiful loss porn pops up on my feed to uplift me. One day I hope I can brighten someone’s spirits with some even more heinous losses. Thank you sir.",
        "created_utc": 1624051992,
        "id": "h2997zu",
        "score": 689,
        "subreddit": "wallstreetbets",
        "created": 1624080792.0
    },
    {
        "author": "jakjacks",
        "body": "you dont invest in meme stocks, you ride it. \n\nYou get on when the trip starts and make sure you get off before the ride is over.\nAgain, dont ride when the trip is almost over.",
        "created_utc": 1624274187,
        "id": "h2ixeeu",
        "score": 689,
        "subreddit": "wallstreetbets",
        "created": 1624302987.0
    },
    {
        "author": "JaB675",
        "body": "Buy at the top, got it.",
        "created_utc": 1624275222,
        "id": "h2iyol7",
        "score": 688,
        "subreddit": "wallstreetbets",
        "created": 1624304022.0
    },
    {
        "author": "o0OmikeO0o",
        "body": "It's hard when he doesn't give me a lot of money and my wife keeps making me put it in Bed Bath and Beyond.",
        "created_utc": 1623648460,
        "id": "h1p97sw",
        "score": 686,
        "subreddit": "wallstreetbets",
        "created": 1623677260.0
    },
    {
        "author": "Anonymoose2021",
        "body": "Having been through multiple up and down cycles, I have found it best to just stick with my plan.  Maintain my portfolio allocations that I have chosen.\n\nThe times I tried to time the market to invest a windfall, I sat on the cash for too long and came out behind if I had just dumped it in.\n\nIf you have a regular contribution, just keep doing it.",
        "created_utc": 1624988713,
        "id": "h3gp7gc",
        "score": 679,
        "subreddit": "investing",
        "created": 1625017513.0
    },
    {
        "author": "-_1_2_3_-",
        "body": "When the language switched from \"retard\" to \"ape\" we knew it was over.",
        "created_utc": 1623260556,
        "id": "h16gazi",
        "score": 669,
        "subreddit": "wallstreetbets",
        "created": 1623289356.0
    },
    {
        "author": "ImmySnommis",
        "body": "The key here is believe.\n\nI've been through every crash since 87. Just hold, assuming you have the time. Have a plan and stick to it. You don't KNOW if or when a crash will happen.\n\nNow, to answer your hypothetical. If I absolutely KNEW a crash was imminent, I'd be jacked to the breast area with puts, then retire in style. If I only SUSPECTED a crash was imminent, I'd be in federally insured stuff like CDs or maybe even annuities.\n\nBut for real, I just hold.",
        "created_utc": 1623847501,
        "id": "h1yn5rp",
        "score": 666,
        "subreddit": "stocks",
        "created": 1623876301.0
    },
    {
        "author": "Adderalin",
        "body": "Exactly this 10000%. Let's say a long/short hedge fund has an excellent track record of 5% per year **real** returns after inflation adjusted. Let's say rain, sun, or snow, bull market or bear market, their investing strategy is so close to a guarantee of 5% per year.\n\nClearly they are not beating VTI which on average produces 7% real returns per year. However, the fund is going to have way less drawdown risk and way less volatility. \n\nIf you're seeking financial independence (/r/financialindependence/) then you may have a goal of retiring early. People often cite the 4% safe withdrawal rule, but if your portfolio is 100% VTI then it's more like 3%. Under the 4% rule you could have a dollar after a 30 year retirement and it still be considered a success. \n\nLet's say my retirement goals is $100k of inflation adjusted dollars each year. If I do it by myself in VTI with the 3% SWR rule it's going to take $3.3 million to safely withdraw it.\n\nWith the hedge fund I could very well withdraw that 5% every year thanks due to their returns regardless of market conditions and lower volatility/drawdown. In order to have the same income I only need $2 million in the hedge fund.\n\nI'd be able to be retired 1.65x faster by moving my money to the hedgefund when I want to retire!\n\nIt boils down each hedge fund and the people who buy it have different investment goals! So no wonder when you group the entire universe of hedge funds (PE, VC, activist funds, Ren Tech, etc), they do so poorly to one sort of portfolio I shown may not work for someone!",
        "created_utc": 1623705641,
        "id": "h1ry1aw",
        "score": 658,
        "subreddit": "investing",
        "created": 1623734441.0
    },
    {
        "author": "wsbgodly123",
        "body": "It’s just handies behind the Wendy’s dumpster. The more you squeeze, the more it shoots up.",
        "created_utc": 1623093121,
        "id": "h0xysep",
        "score": 657,
        "subreddit": "wallstreetbets",
        "created": 1623121921.0
    },
    {
        "author": "thewimsey",
        "body": "The answer is in the first sentence of the linked article:\n\n&gt;JPMorgan Chase has been “effectively stockpiling” cash *rather than using it to buy Treasuries or other investments*\n\n\nThis is money that they would usually put into bonds or treasuries. If interest rates rise in two months (or whenever), bonds and treasuries bought today will be worth less than bonds and treasuries bought after the interest rate increase.",
        "created_utc": 1623780224,
        "id": "h1vhnv2",
        "score": 648,
        "subreddit": "investing",
        "created": 1623809024.0
    },
    {
        "author": "CriticuhL",
        "body": "I dont even have to read this to know my smooth brain will still fuck it up",
        "created_utc": 1623766952,
        "id": "h1un1nw",
        "score": 648,
        "subreddit": "wallstreetbets",
        "created": 1623795752.0
    },
    {
        "author": "wiglywam",
        "body": "&gt;\"Rule No. 1: Never lose money. Rule No. 2: Never forget rule No. 1.\" - Warren Buffett\n\nOr in other words not lose money. Really rich people are more concerned with preserving wealth than growing it.",
        "created_utc": 1623689729,
        "id": "h1qyykr",
        "score": 647,
        "subreddit": "investing",
        "created": 1623718529.0
    },
    {
        "author": "d_realist",
        "body": "Cuz he bought it at $27.09",
        "created_utc": 1623509113,
        "id": "h1iqe1i",
        "score": 640,
        "subreddit": "wallstreetbets",
        "created": 1623537913.0
    },
    {
        "author": "MainlineX",
        "body": "All you have to do is look at FTDs (fails to deliver) It is a huge problem and it's basically a huge leach on the entire financial system world wide. To to tune of 500mil to 1 bil shares daily causing damages world wide in the trillions. \n\nNaked short selling would be better said as: Sythetic  share dilution. Because that's what it does. Selling these sytheric shares dilutes stock prices causing a sythetic imbalance of supply.",
        "created_utc": 1622946583,
        "id": "h0r5h1i",
        "score": 639,
        "subreddit": "stocks",
        "created": 1622975383.0
    },
    {
        "author": "BeardlessPete",
        "body": "It must be amazing waking up every day and learning you're the President of the United States.",
        "created_utc": 1624153412,
        "id": "h2dujky",
        "score": 635,
        "subreddit": "wallstreetbets",
        "created": 1624182212.0
    },
    {
        "author": "1UpUrBum",
        "body": "&gt; A key to remember, the stock doesn't know you own it.\n\nBULL SHIT!!! \n\nIt knows exactly when I buy it, because it always goes down immediately after. And it knows when I sell, time to go up now.\n\nThanks for posting. It's nice to have a higher quality topic on here for a change.",
        "created_utc": 1623114111,
        "id": "h0z8l29",
        "score": 631,
        "subreddit": "stocks",
        "created": 1623142911.0
    },
    {
        "author": "JabroniVille69",
        "body": "It’s a great write up about the basics of options. Nicely done. It takes a lot of time and effort to write that up, so you Shills should have some respect that the guy was willing to try and help. \n\nOP- you a Susquehanna guy?  Maybe Wolverine?",
        "created_utc": 1624801428,
        "id": "h37lrdp",
        "score": 623,
        "subreddit": "wallstreetbets",
        "created": 1624830228.0
    },
    {
        "author": "FerMFcillas",
        "body": "I just turn on my infinite money glitch with my GameShark just hope it doesn’t crash Wall Street tho",
        "created_utc": 1622990769,
        "id": "h0ssiwk",
        "score": 612,
        "subreddit": "wallstreetbets",
        "created": 1623019569.0
    },
    {
        "author": "hiroue",
        "body": "Been in this since January, and the gains have been incredible. WSB short term gainz always got rolled into GME for long term holding, and it fucking works. Still holding shares and calls until I see some hedge fund loss porn reported in the news headlines.",
        "created_utc": 1625094764,
        "id": "h3ma9ok",
        "score": 609,
        "subreddit": "wallstreetbets",
        "created": 1625123564.0
    },
    {
        "author": "Prestigious_Case_123",
        "body": "Yes, stick it to them twice, once when they sell shares of good companies, and again when they cover the short.\n No lubricant in either case. !!!!!! It will hurt so bad.",
        "created_utc": 1622693230,
        "id": "h0eflr1",
        "score": 607,
        "subreddit": "stocks",
        "created": 1622722030.0
    },
    {
        "author": "Xalenn",
        "body": "The only opiods that Johnson &amp; Johnson sell right now are the Tylenol with codeine brand name tablets and Duragesic brand name patches .... I think.  Stopping those doesn't seem like it would have much of an impact.",
        "created_utc": 1624720696,
        "id": "h343hpx",
        "score": 604,
        "subreddit": "investing",
        "created": 1624749496.0
    },
    {
        "author": "Tenshik",
        "body": "It's fucking wild. Literally when he posted this the next minute it breaks resistance just ramps up for the rest of the day.",
        "created_utc": 1623185701,
        "id": "h12oru4",
        "score": 602,
        "subreddit": "wallstreetbets",
        "created": 1623214501.0
    },
    {
        "author": "Repsarebest",
        "body": "Bought another 100 @ 16.\n\nStaying up in New Zealand and buying more if it dips.\n\nI like the stock.\n\nBB to the moon",
        "created_utc": 1622817492,
        "id": "h0klqd7",
        "score": 601,
        "subreddit": "wallstreetbets",
        "created": 1622846292.0
    },
    {
        "author": "_Insulin_Junkie",
        "body": "I joined the cl0v subreddit for less than a day and i swear to god is was everyone asking each other for karma. So they could post in wsb. And those fuckers got shit done. Scary tbh. It was a fucking karma pharmacy... a karmacy",
        "created_utc": 1623256942,
        "id": "h16795f",
        "score": 598,
        "subreddit": "wallstreetbets",
        "created": 1623285742.0
    },
    {
        "author": "DramaticDramatist",
        "body": "Can we stop at Juniper to get some of that SNDL space weed?",
        "created_utc": 1622743181,
        "id": "h0gtlcv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622771981.0
    },
    {
        "author": "Spiritual_Speech600",
        "body": "Breaker breaker come in earth - this is rocket ship 27. Aliens fucked over the carbonator on engine number 4, I’m gonna try to refuckulate it and land on Juniper, uh hopefully you got some space weed - over.",
        "created_utc": 1622626421,
        "id": "h0an8av",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622655221.0
    },
    {
        "author": "No_Future_1703",
        "body": "Breaker breaker, come in Earth, this is Rocket BNGO, aliens f***ed over the carbonator on engine four, I'm gonna try to ref***ulate it on Juniper. Uhh, and hopefully they've got some, space weed there, over. How... how was that buddy? I don't f***in' know.",
        "created_utc": 1623088600,
        "id": "h0xo4jk",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1623117400.0
    }
]