[
    {
        "author": "dwdsquared2",
        "body": "**Events in the US Today (ET):**\n\n* DAY - Wear a mask &amp; socially distance &lt;3\n* 08:30am - Goods Trade Balance (Mar) \\[2/3 Volatility\\]\n   * Retail Inventories Ex Auto (Mar) \\[2/3 Volatility\\]\n* 10:00am - The Senate meets for session\n* 10:30am - Crude Oil Inventories \\[3/3 Volatility\\]\n* 02:00pm - FOMC Statement &amp; Interest Rate Decision \\[3/3 Volatility\\]\n* 02:30pm - FOMC Press Conference with Chair Jerome Powell \\[3/3 Volatility\\]\n* 06:00pm - The House meets for session\n* 09:00pm - POTUS makes his first address as president to a joint session of Congress Wednesday.\n* Class A shares of Alphabet rallied in early New York trading after reporting a first-quarter revenue beat. Analysts at Barclays Plc raised their price target for the stock by 20%. Morgan Stanley increased theirs by 10%. Microsoft Corp., whose results beat expectations but failed to impress analysts, dropped 2.6%.\n* A release Thursday may show the U.S. gross domestic product increased an annualized 6.8% in the first quarter. All these recovery signals are stoking speculation over when the Fed will start slowing its stimulus.\n* President Joe Biden will unveil on Wednesday a sweeping $1.8 trillion plan to expand educational opportunities and child care for families, funded in part by the largest tax increases on wealthy Americans in decades -- the centerpiece of his first address to a joint session of Congress.\n\n**Events in the World Today (ET):**\n\n* 02:00am - Germany GfK Consumer Climate (May) \\[3/3 Volatility\\]\n* 08:30am - Canada Core Retail Sales (MoM-Feb) \\[3/3 Volatility\\]\n* 10:00am - Euro Zone ECB Pres. Lagarde Speaks \\[3/3 Volatility\\]\n   * Brazil CAGED Net Payroll Jobs \\[2/3 Volatility\\]\n* 06:45pm - New Zealand Trade Balance (MoM&amp;YoY-Mar) \\[2/3 Volatility\\]\n* 09:00pm - New Zealand ANZ Business Confidence (Apr) \\[2/3 Volatility\\]\n\n**Earnings Before Open:**\n\n* Boeing, Shopify, Spotify, Teva, Wing Stop, Humana, Yum!, SiriusXM, ADP, CME Group\n\n**Earnings After Close:**\n\n* Apple, Facebook, Qualcomm, Ford, Teladoc, Logitech, ServiceNow, eBay, MGM\n\n[Earnings This Week](https://i.imgur.com/dD0vkLd.png)\n\n[Earnings For April](https://i.imgur.com/IAo7GlZ.jpg)",
        "created_utc": 1619613896,
        "id": "gw5z9bz",
        "permalink": "/r/wallstreetbets/comments/n0bepa/daily_discussion_thread_for_april_28_2021/gw5z9bz/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1619642696.0
    },
    {
        "author": "barjay8",
        "body": "How crazy does it sound to buy May 21st $200 ADP call options....\n\nEarnings Call was today. EPS $1.89 beats $1.82 estimate. Sales $4.1B beats $4.08B estimate. Even with good earnings, it dropped 4.73% (-$9.27). \n\nADP keeps hitting new ATH. The most recent ATH was $197.28 on 4/23....\n\n\nThe May 21st $200 call options are currently $.30 - $0.20... if I buy 200 ($6000) options the gains would be insane ranging from $20k+ \n\nI know it’s a boomer stock, but am I a retard for thinking about this? Or is this a gold mine?",
        "created_utc": 1619652427,
        "id": "gw8f18d",
        "permalink": "/r/wallstreetbets/comments/n0ne5w/what_are_your_moves_tomorrow_april_29_2021/gw8f18d/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1619681227.0
    },
    {
        "author": "dkstang67",
        "body": "  I think the to ones I'll watch, plus ones that come up each day but these are the ones I'll pay the most attention to;\n\nWaste Management, Mc D's, Humana (posted on this one earlier), One Main, ADP, 3M, and Albertson. The only one I'm holding right now is Humana, and I'm a little nervous about as I have 2750 shares, and I think it could take a big hit, due to Covid being paid by the Government. But that's just my two cents. Good luck.",
        "created_utc": 1619315846,
        "id": "gvrwobq",
        "permalink": "/r/StockMarket/comments/mxhr2p/most_anticipated_earnings_releases_for_the_week/gvrwobq/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1619344646.0
    },
    {
        "author": "barjay8",
        "body": "Oops... ADP",
        "created_utc": 1619638804,
        "id": "gw7kehb",
        "permalink": "/r/wallstreetbets/comments/n0bepa/daily_discussion_thread_for_april_28_2021/gw7kehb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619667604.0
    },
    {
        "author": "WePrezidentNow",
        "body": "Uh, yeah, that’s how sampling works. It would be highly inefficient to track every employee and would barely yield more reliable results. Btw, the BLS report is based on unemployment insurance claims, they don’t just ask nicely and say “okey dokey” to whatever a business says. \n\nContinuing unemployment claims have been falling pretty consistently. New claims, while a good indicator of the volatility of the job market, are not representative of overall unemployment numbers.\n\nADP tracks only 1/5 of private payroll. It is simply just another indicator, and you should never take one number as the gospel. The two surveys can differ, it’s natural when taking a sample using different datasets. The BLS uses a 90% confidence interval which is +/- 430,000 jobs. Continuing unemployment claims, BLS reports, ADP, labor participation rate, etc. should all be used in aggregate to determine the direction of employment in the country. Evidently though, your lack of understanding of statistics has led you to the predictable conclusion of “the media is conspiring!!!!1”. Bravo.",
        "created_utc": 1617396932,
        "id": "gt6gzoq",
        "permalink": "/r/investing/comments/mijlje/us_job_growth_accelerates_in_march_unemployment/gt6gzoq/",
        "score": 2,
        "subreddit": "investing",
        "created": 1617425732.0
    },
    {
        "author": "SteveAM1",
        "body": "&gt; ADP tracks only 1/5 of private payroll.\n\nNot only that, but the ADP figure released monthly is actually their forecast of the BLS monthly report. It's not the number of new jobs of their customers. It's their prediction of what the BLS will report two days after their report.",
        "created_utc": 1617833197,
        "id": "gtqnnm2",
        "permalink": "/r/investing/comments/mijlje/us_job_growth_accelerates_in_march_unemployment/gtqnnm2/",
        "score": 2,
        "subreddit": "investing",
        "created": 1617861997.0
    },
    {
        "author": "autotldr",
        "body": "This is the best tl;dr I could make, [original](https://finance.yahoo.com/news/march-jobs-report-labor-market-pandemic-unemployment-payrolls-181729856.html) reduced by 88%. (I'm a bot)\n*****\n&gt; Retail trade jobs rose by 22,500 for a third straight monthly gain, and professional and business service jobs also posted a third consecutive monthly increase, with payrolls climbing by 66,000.\n\n&gt; The private goods-producing sector also added back jobs on net in March after shedding payrolls in February as inclement weather impacted hiring.\n\n&gt; Earlier this week, ADP&amp;#039;s March private payrolls report showed the most jobs added back since September, and the Institute for Supply Management&amp;#039;s manufacturing index pointed to rising employment trends in the goods-producing sector.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/mil0vd/march_jobs_report_payrolls_rise_by_916000/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~568161 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **February**^#1 **job**^#2 **payroll**^#3 **March**^#4 **expected**^#5",
        "created_utc": 1617372236,
        "id": "gt53xyb",
        "permalink": "/r/wallstreetbets/comments/mijsbo/march_jobs_report_payrolls_rise_by_916000/gt53xyb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617401036.0
    },
    {
        "author": "Abdalhadi_Fitouri",
        "body": "I mean... I don't fail to do that. And I hate to be harsh, but the ADP numbers are not what any good statistician would use. ADP is absolutely not randomly selected by companies. If we relied on ADP, we'd exclude entire sectors of the economy that don't process payroll in that manner. Places that don't track time, most importantly. \n\nA sample size of 144,000 is enormous. That is a gigantic sample size, and again I'm sorry to be harsh, but anyone with remote exposure to statistics would know this. Hell, even a sample size of 1,000 (if it is actually random) is good enough to predict most events that occur in the universe. So 144,0000 is crazy huge. \n\nFrankly, the bls method is much, *much* more statistically sound than using ADP. ADP is good at showing a specific type of employment, yes, because it is widely used. But is absolutely not random, and therefore is a horrible way to make predictions or inferences about the population at large. \n\nNow, are there issues with the bls method? Obviously. Of course there are. And, given that it is a government agency, do we think we can kind of predict its bias given the political climate of the time? I would say so. I would say that a lot of the time they're going to err on the optimistic side. I agree with that. \n\nBut we know that. And we can mentally adjust. No human is unbiased, and no data is unbiased either. I think it's a shame people believe that data is unbiased, it never is and it cannot be.",
        "created_utc": 1617402686,
        "id": "gt6ruzn",
        "permalink": "/r/investing/comments/mijlje/us_job_growth_accelerates_in_march_unemployment/gt6ruzn/",
        "score": 1,
        "subreddit": "investing",
        "created": 1617431486.0
    },
    {
        "author": "ADoIDo",
        "body": "I know, never claimed it was ADP customers...",
        "created_utc": 1617833879,
        "id": "gtqp2ff",
        "permalink": "/r/investing/comments/mijlje/us_job_growth_accelerates_in_march_unemployment/gtqp2ff/",
        "score": 1,
        "subreddit": "investing",
        "created": 1617862679.0
    },
    {
        "author": "RichSteps",
        "body": "This post mentions: **$VISL, $PNG**\n\nOn /r/pennystocks, /u/trevandezz has previously mentioned:\n\n|||||||||||||||\n|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-\n**ticker**|**PNG**|**VISL**|BHAT|SQQQ|TMBR|NFP|GNUS|GME|FGROF|AMTX|ADP|ACCYY|ACCO\n**mentions**|**6**|**4**|3|2|1|1|1|1|1|1|1|1|1\n\n/u/trevandezz's account was created **1 year ago**. It has **17460** comment karma and **30224** link karma.\n\n-----\n\n^You ^may ^see ^tickers ^you ^didn't ^mention ^-- ^I'm ^casting ^a ^wide ^net ^because ^y'all ^don't ^always ^$TAG ^your ^ticker ^symbols.\n\n^This ^was ^an ^automated ^response. ^If ^you ^have ^feedback, ^please ^reply ^to ^this ^comment ^or [^(send me a message)](https://www.reddit.com/message/compose?to=RichSteps&amp;subject=bot%20feedback)^.",
        "created_utc": 1617721171,
        "id": "gtkr4kb",
        "permalink": "/r/pennystocks/comments/mldkc8/live_technical_analysis_tonight_630pm_cst_visl/gtkr4kb/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1617749971.0
    },
    {
        "author": "gerlach",
        "body": "You can download a sample issue from Nate's Notes' website (as well as from the IAS website), and that might give you a better idea of the differences. It looks like Nate's Notes is making multiple buy/sell decisions each month, whereas I would expect that our IAS subscribers are making a handful of buy/sell decisions a year (once they've established their portfolio). IAS is steadfastly devoted to a 5-year horizon, which is a risk management technique that prevents kneejerk decisions and lets company management drive EPS and sales growth over the course of several years.\n\nCabot is another long-standing newsletter publisher, and they offer several different publications. Their Turnaround Letter uses a value investing approach, which can be successful but also can be very difficult to implement since you are buying stocks that the rest of the market hates. John Buckingham's The Prudent Speculator newsletter is one of the best value newsletters, but returns are prone to swings in underlying sentiment about value vs. growth.\n\nThe Buyback Letter has several portfolios that you can follow (if you're looking for income, tech stocks, healthcare/biotech stocks, or the broader market). They also offer a Dogs of the Dow type portfolio -- the Dow 30 stocks that are the most beaten-down (and thus have the highest yields) and are also buying back shares. Personally, I look at stocks that are buying back shares in significant amounts as being a bit troublesome -- it can mean that the stock is in crisis management mode and the board wants to boost the stock, or that the company has too much cash that it doesn't have anything more worthwhile to do with it (such as reinvesting in its business), for instance. As companies have slowed their dividend increases in the last several decades in favor of using cash for share buybacks, I wonder about the overall effectiveness of this approach in the current market and business environment.\n\nJim Stack's Investech newsletter uses stocks (mostly large-caps), funds, and ETFs in an active strategy. Each month there might be a handful of recommended actions to take, and it's not uncommon for the newsletter to push the portfolio into significant cash levels. (We have a longstanding subscriber to the IAS newsletter who is also a fan of Stack; she manages the portfolio in their household, and at a MoneyShow a few years ago, she made a point of introducing her husband to Stack and instructing her husband that if she should die before him, he should just give all their investing assets to Stack's management service.)\n\nThe [HulbertRatings.com](https://HulbertRatings.com) website has returns for 1-year to 30-years for all newsletters that they cover, so that's the best place for an apples-to-apples comparison of results.\n\nWhat's interesting is that the top-performing newsletters don't represent a single investment style or approach in just about any period. You'll find newsletters that follow growth, value, fundamental, technical, market timing, or income strategies, and that use commodities, ETFs, mutual funds, stocks, and options.\n\nMany newsletters do require constant portfolio action, where each month there might be several changes that they advise subscribers to make; others are more of the \"set it and forget it\" approach. \\[Aside: When we say that IAS focuses on the long-term, we mean it -- in November 2020, we recommended buying ADP for the fourth time. The previous recommendations were in May 1997, February 1990, and June 1975. ADP was $2.91 (split-adjusted) in June 1975 and closed yesterday at $195. It's been at least a hold in the newsletter for a very long time.\\] But selecting a newsletter that works with your expectations for monthly transactions and strategy can do better for you in the real world than the hypothetical returns in a performance table.",
        "created_utc": 1619645358,
        "id": "gw7zy64",
        "permalink": "/r/stocks/comments/n0f8zo/newsletter_bob_brinkers_marketimer_vs_investory/gw7zy64/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619674158.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 27th of April\n\n\n\n## Upcoming events for Tuesday, April 27th\n\n - Stock splits:\n\n    - NSPR @ **1:15**\n\n - Expected earnings:\n\n  AAN, AAT, ABB, ABG, ACCO, ACGL, ACH, ADM, AHC, AJRD, AMD, AMGN, AMX, APAM, ARAY, ARVN, ATEN, ATNI, ATRC, AUDC, AWI, AWRE, BP, BSBR, BUSE, BXP, BYD, CAC, CALX, CASH, CB, CEQP, CHE, CHRW, CNC, COF, CROX, CRSP, CSGP, CYBE, CZWI, DTE, EBMT, ECL, EGP, EHC, EIX, ENPH, ENTG, EQR, ESBK, ESS, FBNC, FCBP, FCF, FCPT, FELE, FEYE, FFIC, FFIV, FFNW, FFWM, FIBK, FISV, FRST, FSV, FTI, GE, GLW, GOOD, GOOG, GOOGL, GPK, GRFS, HA, HAFC, HAS, HBCP, HEES, HFBL, HIW, HNP, HOPE, HRZN, HSBC, HUBB, HVT, HVT.A, IBA, IBCP, IEX, ILMN, IVZ, JBLU, JNPR, KNSA, KTCC, LBC, LBRT, LDL, LECO, LLY, MANH, MATX, MDLZ, MMC, MMM, MRC, MSCI, MSFT, MVBF, MXIM, NAVI, NCR, NOV, NVS, NXRT, ODT, OKE, OLN, OMAB, OPRA, OXSQ, PCAR, PFG, PHM, PII, PINS, PJT, PPBI, PPD, PROV, PSB, QCRH, QTS, RCKY, RNDB, RNST, ROIC, ROP, RRD, RTX, RXN, SAN, SBUX, SCL, SF, SFST, SHW, SPFI, SQNS, SSTK, ST, SYF, SYK, SYX, TENB, TER, TFII, TKC, TPB, TRMK, TRMT, TRU, TSBK, TX, TXN, UBS, UDR, UMBF, UPS, USNA, V, VALE, VBTX, VIST, WDR, WM, WNEB, WSBC, WSBF, YUMC\n\n - Ex-div:\n\n  AM, ATR, BK, CALM, ENTG, IFS, QADA, QADB, VSEC\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 1.300%)\n    - API Weekly Crude Oil Stock (previous: 0.436M)\n    - CB Consumer Confidence (consensus: 113.0, previous: 109.7)\n    - Dallas Fed Services Revenues (previous: 21.6)\n    - House Price Index (previous: 1.0%)\n    - House Price Index (previous: 12.0%)\n    - House Price Index (previous: 316.7)\n    - Redbook (previous: -17.2%)\n    - Redbook (previous: 13.5%)\n    - Richmond Manufacturing Index (previous: 17)\n    - Richmond Manufacturing Shipments (previous: 22)\n    - Richmond Services Index (previous: 16)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 11.7%, previous: 11.1%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.1%, previous: 1.2%)\n    - Texas Services Sector Outlook (previous: 28.9)\n\n## Upcoming events for Wednesday, April 28th\n\n - Expected earnings:\n\n  AAPL, ADP, AER, AFL, AGI, AKO.A, AKO.B, AKR, ALGN, ALIM, ALKS, ALRS, ALSN, ALTA, AM, AMED, APH, APLS, AR, ARCC, ASGN, ASH, ATOM, ATUS, AUY, AVB, AVT, AVTR, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BHE, BHLB, BLKB, BPOP, BRKL, BSMX, BSX, BXMT, CAKE, CAMT, CBTX, CCS, CDE, CHEF, CHX, CINF, CIT, CLR, CME, CMO, CNMD, CNO, CONE, CPF, CPSS, CREE, CSTM, CUBI, CYH, DAN, DISCA, DISCB, DISCK, DMRC, DRE, DRVN, DX, EAT, EBAY, ECHO, EQIX, ESI, ESRT, ETR, EVA, EVR, EXR, EXTR, F, FARO, FB, FCNCA, FISI, FIX, FORM, GD, GIB, GRMN, GRUB, GSK, GTY, HBNC, HELE, HES, HESM, HNI, HOLX, HT, HUM, IART, ICAD, ICLR, INOV, INVH, IPG, IR, IRT, ISBC, JAKK, JBSS, KALU, KNL, KRA, KRC, LC, LFUS, LIVN, LOGI, LXU, MAA, MAS, MC, MCO, MCRI, MDXG, MEOH, MGM, MGRC, MHH, MHO, MKL, MLCO, MLP, MN, MOH, MORN, MPX, MSA, MSC, MSVB, MTDR, MTH, MUSA, MXL, MYRG, NBR, NGVT, NLY, NOA, NOVA, NOW, NSC, NTB, NYCB, OBNK, OC, OI, OII, OIS, OPK, ORLY, ORN, OSK, OVV, PAG, PB, PDM, PEGA, PGRE, PI, PPC, PSA, PTC, QCOM, R, RBBN, RE, RES, RJF, RNR, ROK, ROL, RWT, SAIA, SC, SGC, SHOO, SHOP, SIGI, SIRI, SIX, SJW, SLAB, SLGN, SMED, SNY, SONY, SP, SPOK, SPOT, SRDX, SREV, SRI, SSB, SWK, SXC, TDOC, TDY, TECK, TEVA, TKR, TNL, TR, TROX, TTEK, TTMI, TWOU, TYL, UCTT, UFI, UMC, URI, UVE, UVSP, VET, VKTX, VNE, VRT, VRTS, VSEC, VVV, WCN, WELL, WERN, WH, WHG, WING, WNC, WRE, WWW, YNDX, YUM\n\n - Ex-div:\n\n  BPMP, BSRR, CFG, FRC, ITUB, KEN, KNOP, MAIN\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.416M)\n    - Crude Oil Inventories (consensus: 0.375M, previous: 0.594M)\n    - Cushing Crude Oil Inventories (previous: -1.318M)\n    - Distillate Fuel Production (previous: -0.088M)\n    - EIA Refinery Crude Runs  (previous: -0.286M)\n    - EIA Weekly Distillates Stocks (consensus: -0.163M, previous: -1.074M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 1.0%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision\n    - Gasoline Inventories (consensus: 0.425M, previous: 0.086M)\n    - Gasoline Production (previous: -0.229M)\n    - Goods Trade Balance (previous: -87.07B)\n    - Heating Oil Stockpiles (previous: 0.563M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 8.6%)\n    - MBA Purchase Index (previous: 295.5)\n    - Mortgage Market Index (previous: 724.8)\n    - Mortgage Refinance Index (previous: 3,219.9)\n    - Retail Inventories Ex Auto (previous: 1.2%)\n    - Wholesale Inventories (previous: 0.6%)\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARES, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLMN, BMRN, BMY, BPMC, BSIG, BSVN, BTU, BVN, BWB, BY, BZH, CARR, CASA, CAT, CBRE, CBZ, CCOI, CCXI, CFFN, CFR, CFX, CG, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COR, COWN, CPT, CQP, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CURO, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DRQ, DVA, DVD, DXCM, EBC, EBS, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, ERIE, ERII, ERJ, ETH, EVBN, EVLO, EVTC, EXLS, EXPO, FBC, FBHS, FCN, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FSP, FTAI, FTNT, FTV, FWRD, GEO, GFF, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GPI, GRA, GSHD, GWB, HAYN, HGV, HP, HSY, HTGC, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INDT, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBAI, LBPS, LEVL, LFVN, LH, LIND, LKQ, LLNW, LMAT, LPLA, LTC, LTRX, LYG, MA, MATW, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MO, MPW, MRK, MRLN, MSTR, MTLS, MTRN, MTSI, MVIS, NATI, NDLS, NEM, NIO, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, OCFC, OFC, OMCL, ONEW, ONTO, OPI, OPOF, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCG, PCSB, PEB, PFPT, PH, PMBC, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RCL, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SAND, SCX, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SNDR, SNP, SO, SPGI, SPSC, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TPX, TREE, TROW, TRS, TRTN, TRUP, TW, TWTR, TXRH, TXT, ULBI, ULH, USAK, USM, VC, VCRA, VICI, VIRC, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PLBC, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SLG, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 49B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 4.7%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n^^^^2021-04-27",
        "created_utc": 1619517616,
        "id": "gw17s1h",
        "permalink": "/r/RobinHood/comments/mzl03y/daily_discussion_thread_april_27th_2021/gw17s1h/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619546416.0
    },
    {
        "author": "im_also_a_member",
        "body": "Symbol\tTotal Gain/Loss Dollar\tTotal Gain/Loss Percent\tPercent Of Account\n\nARKK\t$443.70 \t11.78%\t6.02%\n\nADP\t($9.54)\t-1.25%\t1.08%\n\nCCS\t$26.25 \t5.95%\t0.67%\n\nCS\t$36.63 \t3.49%\t1.55%\n\nDX\t$23.07 \t4.17%\t0.82%\n\nFNILX\t$614.48 \t6.14%\t15.18%\n\nFSKAX\t$582.27 \t5.82%\t15.13%\n\nFXAIX\t$17.95 \t5.41%\t0.50%\n\nFNCL\t$58.00 \t2.04%\t4.13%\n\nFBGRX\t$625.23 \t6.25%\t15.19%\n\nFDGFX\t$111.65 \t5.58%\t3.02%\n\nF\t$19.88 \t3.17%\t0.92%\n\nKBWD\t$9.00 \t0.45%\t2.86%\n\nICLN\t($49.50)\t-2.26%\t3.06%\n\nKMI\t$17.25 \t2.10%\t1.19%\n\nPLTR\t$2.88 \t4.30%\t0.10%\n\nSLM\t$87.00 \t3.21%\t3.99%\n\nSCHD\t($21.60)\t-0.22%\t14.28%\n\nVTI\t$503.20 \t7.51%\t10.30%\n\nJust put more into F today.",
        "created_utc": 1617762772,
        "id": "gtn8g2b",
        "permalink": "/r/stocks/comments/lv5dlb/rate_my_portfolio_rstocks_quarterly_thread_march/gtn8g2b/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617791572.0
    },
    {
        "author": "diogenesl",
        "body": "ADP (Automatic Data Processing) and Paychex, these two look like amazing companies when I check their numbers, I'm wondering if I should put both on my wallet but I would love to know if they fight for the same customers or can be considered complimentary companies\n\nThis HR market is quite different in my country so I'm not sure how to compare this two and can't even understand 100% of what they offer",
        "created_utc": 1618927450,
        "id": "gv7ax3o",
        "permalink": "/r/investing/comments/mum7tu/daily_advice_thread_all_basic_help_or_advice/gv7ax3o/",
        "score": 1,
        "subreddit": "investing",
        "created": 1618956250.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 28th of April\n\n\n\n## Upcoming events for Wednesday, April 28th\n\n - Expected earnings:\n\n  AAPL, ADP, AER, AFL, AGI, AKO.A, AKO.B, AKR, ALGN, ALIM, ALKS, ALRS, ALSN, ALTA, AM, AMED, APH, APLS, AR, ARCC, ASGN, ASH, ATOM, ATUS, AUY, AVB, AVT, AVTR, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BHE, BHLB, BLKB, BPOP, BRKL, BSMX, BSX, BXMT, CAKE, CAMT, CBTX, CCS, CDE, CHEF, CHX, CINF, CIT, CLR, CME, CMO, CNMD, CNO, CONE, CPF, CPSS, CREE, CSTM, CUBI, CYH, DAN, DISCA, DISCB, DISCK, DMRC, DRE, DRVN, DX, EAT, EBAY, ECHO, EQIX, ESI, ESRT, ETR, EVA, EVR, EXR, EXTR, F, FARO, FB, FCNCA, FISI, FIX, FORM, GD, GIB, GRMN, GRUB, GSK, GTY, HBNC, HELE, HES, HESM, HNI, HOLX, HT, HUM, IART, ICAD, ICLR, INOV, INVH, IPG, IR, IRT, ISBC, JAKK, JBSS, JOE, KALU, KNL, KRA, KRC, LC, LFUS, LIVN, LOGI, LXU, MAA, MAS, MC, MCO, MCRI, MDXG, MEOH, MGM, MGRC, MHH, MHO, MKL, MLCO, MLP, MN, MOH, MORN, MPX, MSA, MSC, MTDR, MTH, MUSA, MXL, MYRG, NBR, NGVT, NLY, NOA, NOVA, NOW, NSC, NTB, OBNK, OC, OI, OII, OIS, OPK, ORLY, ORN, OSK, OVV, PAG, PB, PDM, PEGA, PGRE, PI, PPC, PSA, PTC, QCOM, R, RBBN, RE, RES, RJF, RNR, ROK, ROL, RWT, SAIA, SC, SGC, SHOO, SHOP, SIGI, SIRI, SIX, SJW, SLAB, SLGN, SMED, SNY, SONY, SP, SPOK, SPOT, SRDX, SREV, SRI, SSB, SWK, SXC, TDOC, TDY, TECK, TEVA, TKR, TNL, TR, TROX, TTEK, TTMI, TWOU, TYL, UCTT, UFI, UMC, URI, UVE, UVSP, VET, VKTX, VNE, VRT, VRTS, VSEC, VVV, WCN, WELL, WERN, WH, WHG, WING, WNC, WRE, WWW, YNDX, YUM\n\n - Ex-div:\n\n  BPMP, BSRR, CFG, FRC, ITUB, KEN, KNOP, MAIN\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.416M)\n    - Crude Oil Inventories (consensus: 0.659M, previous: 0.594M)\n    - Cushing Crude Oil Inventories (previous: -1.318M)\n    - Distillate Fuel Production (previous: -0.088M)\n    - EIA Refinery Crude Runs  (previous: -0.286M)\n    - EIA Weekly Distillates Stocks (consensus: -0.648M, previous: -1.074M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 1.0%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - Gasoline Inventories (consensus: 0.508M, previous: 0.086M)\n    - Gasoline Production (previous: -0.229M)\n    - Goods Trade Balance (previous: -87.07B)\n    - Heating Oil Stockpiles (previous: 0.563M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 8.6%)\n    - MBA Purchase Index (previous: 295.5)\n    - Mortgage Market Index (previous: 724.8)\n    - Mortgage Refinance Index (previous: 3,219.9)\n    - Retail Inventories Ex Auto (previous: 1.2%)\n    - U.S. President Biden Speaks\n    - Wholesale Inventories (previous: 0.6%)\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARD, ARES, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLMN, BMRN, BMY, BPMC, BSIG, BSVN, BTU, BVN, BWB, BY, BZH, CACC, CARR, CASA, CAT, CBRE, CBZ, CCBG, CCOI, CCXI, CFFN, CFR, CFX, CG, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COR, COWN, CPLP, CPT, CQP, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CURO, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DRQ, DVA, DVD, DXCM, EBC, EBS, ECOL, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, ERIE, ERII, ERJ, ETH, EVBN, EVLO, EVTC, EXLS, EXPO, FBHS, FBIZ, FBRX, FCN, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FSP, FTAI, FTNT, FTV, FWRD, GEO, GFF, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GOL, GPI, GRA, GSHD, GWB, HAYN, HGV, HP, HSY, HTGC, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INDT, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBAI, LBPS, LEVL, LFVN, LH, LIND, LKQ, LLNW, LMAT, LPLA, LTC, LTRX, LYG, MA, MATW, MBIN, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MNOV, MO, MPW, MRK, MRLN, MSTR, MTLS, MTRN, MTSI, MVIS, NATI, NDLS, NEM, NIO, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, OCFC, OFC, OMCL, ONEW, ONTO, OPI, OPOF, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCG, PCSB, PEB, PH, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RCL, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SAND, SCX, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SNDR, SNP, SO, SPGI, SPSC, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TPX, TREE, TROW, TRS, TRTN, TRUP, TUSK, TW, TWTR, TXRH, TXT, ULBI, ULH, USAK, USM, VC, VCRA, VICI, VIRC, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PLBC, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SLG, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 49B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 5.0%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n## Upcoming events for Friday, April 30th\n\n - Expected earnings:\n\n  ABBV, AON, AROC, AROW, ASIX, AVNT, AZN, B, BCPC, BRID, BSAC, CBOE, CCLP, CHTR, CL, CLX, CRI, CVEO, CVX, CWBC, DCOM, E, EEX, ESXB, FSBW, GT, GWW, HRC, HUN, IMO, IRMD, ITCB, ITW, JCI, JELD, LAZ, LFC, LHX, LSBK, LYB, MGP, MOG.A, MOG.B, NWHM, NWL, OFIX, OIIM, PBI, PFS, PIPR, PNM, POR, PSX, PSXP, QSR, SBFG, SHLX, SLCA, SPCB, WETF, WPC, WY, XOM\n\n - Ex-div:\n\n  AON, ASRV, BX, C, CARR, CASY, CBAN, CLB, CMCO, CNBKA, CZNC, DGICA, DGICB, DMLP, ELP, EVTC, EWBC, FAT, HAS, HEP, HESM, HFBL, KOF, KRP, LCUT, LYTS, MCI, NRG, NSEC, O, OHI, ORRF, PBCT, PEBO, PNW, SBNY, SBS, SGU, SPFI, SXT, SYF, TKC, TXN, WABC\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.4K)\n    - CFTC Copper speculative net positions (previous: 42.9K)\n    - CFTC Corn speculative net positions (previous: 522.7K)\n    - CFTC Crude Oil speculative net positions (previous: 500.0K)\n    - CFTC Gold speculative net positions (previous: 181.5K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.1K)\n    - CFTC Natural Gas speculative net positions (previous: -50.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -52.2K)\n    - CFTC Silver speculative net positions (previous: 41.7K)\n    - CFTC Soybeans speculative net positions (previous: 243.2K)\n    - CFTC Wheat speculative net positions (previous: 21.0K)\n    - Chicago PMI (consensus: 65.3, previous: 66.3)\n    - Core PCE Price Index (consensus: 0.3%, previous: 0.1%)\n    - Core PCE Price Index (consensus: 1.8%, previous: 1.4%)\n    - Dallas Fed PCE (previous: 1.80%)\n    - Employment Benefits (previous: 0.60%)\n    - Employment Cost Index (consensus: 0.7%, previous: 0.7%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.70%)\n    - Michigan Consumer Expectations (previous: 79.7)\n    - Michigan Consumer Sentiment (consensus: 87.4, previous: 86.5)\n    - Michigan Current Conditions (previous: 97.2)\n    - Michigan Inflation Expectations (previous: 3.7%)\n    - PCE Price index (previous: 1.6)\n    - PCE price index (previous: 0.2%)\n    - Personal Income (consensus: 20.3%, previous: -7.1%)\n    - Personal Spending (consensus: 4.1%, previous: -1.0%)\n    - Real Personal Consumption (previous: -1.2%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 344)\n    - U.S. Baker Hughes Total Rig Count (previous: 439)\n\n^^^^2021-04-28",
        "created_utc": 1619604015,
        "id": "gw5lmui",
        "permalink": "/r/RobinHood/comments/n0bei1/daily_discussion_thread_april_28th_2021/gw5lmui/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619632815.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 26th of April\n\n\n\n## Upcoming events for Monday, April 26th\n\n - Expected earnings:\n\n  ACI, AGNC, AIN, AMG, AMKR, AMP, ARE, ARLP, AXTA, BCLI, BOH, BRO, CATY, CBU, CCB, CDNS, CHKP, CNI, CVLG, DGICA, DGICB, DHIL, DORM, EBTC, EFSC, FBK, FBP, FCAP, FIX, FLXS, FNCB, FRAF, FRBA, HBT, HLX, HMST, HONE, HSII, HSTM, HTLF, IBTX, ILPT, JBT, JJSF, KOF, KREF, LII, LKFN, LXFR, LXRX, MASI, MEDP, MEDS, MKSI, MPB, MRBK, MSB, NBTB, NRIM, NTP, NWBI, NXPI, OMF, OTIS, OVBC, PCH, PEBK, PHG, PKG, PKX, PRK, PW, RBB, RMBI, RRC, SANM, SBAC, SCCO, SEB, SFBC, SSBI, SSD, SSNC, SUI, SVBI, TBI, TCF, TNET, TOWN, TSLA, TV, UHS, UHT, WIRE, WRI\n\n - Ex-div:\n\n  AZZ, CVLY, QIWI, SPNS\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.152%)\n    - 3-Month Bill Auction (previous: 0.025%)\n    - 5-Year Note Auction (previous: 0.850%)\n    - 6-Month Bill Auction (previous: 0.040%)\n    - Core Durable Goods Orders (consensus: 1.6%, previous: -0.9%)\n    - Dallas Fed Mfg Business Index (previous: 28.9)\n    - Durable Goods Orders (consensus: 2.5%, previous: -1.2%)\n    - Durables Excluding Defense (previous: -0.8%)\n    - Goods Orders Non Defense Ex Air (consensus: 1.5%, previous: -0.9%)\n    - Investing.com Gold Index (actual: 52.0%, previous: 48.9%)\n    - Investing.com S&amp;P 500 Index (actual: 33.1%, previous: 39.6%)\n\n## Upcoming events for Tuesday, April 27th\n\n - Stock splits:\n\n    - NSPR @ **1:15**\n\n - Expected earnings:\n\n  AAN, AAT, ABB, ABG, ACCO, ACGL, ACH, ADM, AHC, AJRD, AKO.A, AKO.B, AMD, AMGN, AMX, APAM, ARAY, ARVN, ATEN, ATNI, ATRC, AUDC, AWI, AWRE, BFST, BP, BSBR, BUSE, BXP, BYD, CAC, CALX, CASH, CB, CEQP, CHE, CHRW, CNC, COF, CROX, CRSP, CSGP, CYBE, CZWI, DTE, EBMT, ECL, EGP, EHC, EIX, ENPH, ENTG, EQR, ESBK, ESS, FBNC, FCF, FCPT, FELE, FEYE, FFIC, FFIV, FFNW, FFWM, FIBK, FISV, FRST, FSV, FTI, GE, GFF, GLW, GOOD, GOOG, GOOGL, GPK, HA, HAFC, HAS, HBCP, HEES, HFBL, HIW, HOPE, HRZN, HSBC, HUBB, HVT, HVT.A, IBA, IBCP, IEX, ILMN, IRBT, IVZ, JBLU, JNPR, KNSA, KTCC, LBC, LBRT, LDL, LECO, LLY, MANH, MATX, MDLZ, MKL, MMC, MMM, MRC, MSCI, MSFT, MSTR, MVBF, MXIM, NAVI, NCR, NOV, NVS, NXRT, ODT, OKE, OLN, OMAB, OPRA, OXSQ, PCAR, PFG, PHM, PII, PINS, PJT, PPBI, PPD, PROV, PSB, PTSI, QCRH, QTS, RCKY, RNDB, RNST, ROIC, ROP, RRD, RTX, RXN, SAN, SBUX, SCL, SFST, SHW, SMIT, SPFI, SQNS, SSTK, ST, SYF, SYK, SYX, TENB, TER, TFII, TKC, TPB, TRMK, TRMT, TRU, TSBK, TX, TXN, UBS, UDR, UMBF, UPS, USNA, V, VALE, VBTX, VET, VIST, WDR, WM, WNEB, WSBC, WSBF, WW, YUMC\n\n - Ex-div:\n\n  AM, ATR, BK, CALM, ENTG, IFS, QADA, QADB, VSEC\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 1.300%)\n    - API Weekly Crude Oil Stock (previous: 0.436M)\n    - CB Consumer Confidence (consensus: 113.0, previous: 109.7)\n    - Dallas Fed Services Revenues (previous: 21.6)\n    - House Price Index (previous: 1.0%)\n    - House Price Index (previous: 12.0%)\n    - House Price Index (previous: 316.7)\n    - Redbook (previous: -17.2%)\n    - Redbook (previous: 13.5%)\n    - Richmond Manufacturing Index (previous: 17)\n    - Richmond Manufacturing Shipments (previous: 22)\n    - Richmond Services Index (previous: 16)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 11.7%, previous: 11.1%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.1%, previous: 1.2%)\n    - Texas Services Sector Outlook (previous: 28.9)\n\n## Upcoming events for Wednesday, April 28th\n\n - Expected earnings:\n\n  AAPL, ADP, AER, AFL, AGI, AKR, ALGN, ALRS, ALSN, ALTA, AM, AMED, APH, AR, ARCC, ASGN, ATOM, ATUS, AUY, AVB, AVT, AVTR, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BHLB, BLKB, BPOP, BRKL, BSMX, BSX, BXMT, CAKE, CAMT, CBTX, CCS, CDE, CHEF, CHX, CINF, CIT, CLR, CME, CMO, CNMD, CNO, CONE, CPF, CSTM, CUBI, CYH, DAN, DISCA, DISCB, DISCK, DMRC, DRE, DX, EBAY, ECHO, EQIX, ESI, ESRT, ETR, EVA, EVR, EXR, EXTR, F, FARO, FB, FCNCA, FISI, FNF, FORM, GD, GIB, GRMN, GRUB, GSK, GTY, HBNC, HELE, HES, HESM, HNI, HOLX, HT, HUM, IART, ICAD, ICLR, INOV, INVH, IPG, IRT, ISBC, JAKK, KALU, KNL, KRA, KRC, LC, LFUS, LIVN, LOGI, LXU, MAA, MAS, MC, MCO, MCRI, MEOH, MGM, MGRC, MHH, MHO, MLP, MN, MOH, MORN, MPX, MSVB, MTDR, MTH, MUSA, MXL, NBR, NGVT, NLY, NOA, NOVA, NOW, NSC, NTB, NYCB, OBNK, OC, OI, OII, OIS, ORLY, ORN, OSK, OVLY, OVV, PAG, PB, PDM, PEGA, PGRE, PI, PPC, PSA, PTC, QCOM, R, RBBN, RE, RES, RJF, RNR, ROK, ROL, RWT, SAIA, SC, SGC, SHOO, SHOP, SIGI, SIRI, SIX, SJW, SLAB, SLGN, SMED, SNY, SONY, SP, SPOT, SRDX, SREV, SRI, SSB, SWK, SXC, TDOC, TDY, TECK, TEVA, TKR, TNL, TR, TROX, TTEK, TTMI, TWOU, TYL, UCTT, UFI, UMC, URI, UVE, UVSP, VNE, VRT, VRTS, VSEC, VVV, WCN, WELL, WERN, WH, WING, WNC, WRE, WWW, YNDX, YUM\n\n - Ex-div:\n\n  BPMP, BSRR, CFG, FRC, ITUB, KEN, KNOP, MAIN\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.416M)\n    - Crude Oil Inventories (previous: 0.594M)\n    - Cushing Crude Oil Inventories (previous: -1.318M)\n    - Distillate Fuel Production (previous: -0.088M)\n    - EIA Refinery Crude Runs  (previous: -0.286M)\n    - EIA Weekly Distillates Stocks (consensus: -0.956M, previous: -1.074M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.7%, previous: 1.0%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision\n    - Gasoline Inventories (consensus: 0.464M, previous: 0.086M)\n    - Gasoline Production (previous: -0.229M)\n    - Goods Trade Balance (previous: -87.07B)\n    - Heating Oil Stockpiles (previous: 0.563M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 8.6%)\n    - MBA Purchase Index (previous: 295.5)\n    - Mortgage Market Index (previous: 724.8)\n    - Mortgage Refinance Index (previous: 3,219.9)\n    - Retail Inventories Ex Auto (previous: 1.2%)\n    - Wholesale Inventories (previous: 0.6%)\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALGT, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARES, ARW, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLDR, BLMN, BMRN, BMY, BSIG, BSVN, BVN, BWB, BY, BZH, CARR, CASA, CAT, CBNK, CBRE, CBZ, CCOI, CDNA, CENX, CFR, CFX, CG, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COP, COR, COWN, CPT, CQP, CRAI, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CURO, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DVD, DXCM, EBC, EBS, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, ERIE, ERII, ERJ, ETH, EVBN, EVTC, EXLS, EXPO, FBC, FBHS, FCN, FDUS, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FSP, FTAI, FTNT, FTV, FWRD, GEO, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GPI, GRA, GSHD, GT, GWB, HAYN, HGV, HIG, HP, HSY, HTGC, HUBG, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INSM, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBAI, LBPS, LEVL, LFVN, LH, LKQ, LLNW, LMAT, LOCO, LPLA, LTC, LTRX, LYG, MA, MATW, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MO, MRK, MRLN, MTLS, MTRN, MTSI, MTZ, NATI, NDLS, NEM, NIO, NLSN, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, OCFC, OFC, OMCL, ONEW, ONTO, OPI, OPOF, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCB, PCG, PCSB, PEB, PFPT, PH, PMBC, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SCX, SF, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SMMF, SNDR, SNP, SO, SPGI, SPSC, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TPL, TPR, TPX, TREE, TROW, TRS, TRTN, TRUP, TW, TWTR, TXRH, TXT, UBSI, ULBI, ULH, USAK, USM, UTL, VC, VCRA, VICI, VIRC, VKTX, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 49B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 4.7%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n^^^^2021-04-26",
        "created_utc": 1619431217,
        "id": "gvww79d",
        "permalink": "/r/RobinHood/comments/myu6ia/daily_discussion_thread_april_26th_2021/gvww79d/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619460017.0
    },
    {
        "author": "ADoIDo",
        "body": "EVERYONE fails to visit the BLS website in order to realize this NUMBER is based on a SURVEY of less than 1m businesses.\n\nAt the same time, unemployment claims numbers barely dropping and a real life ADP march jobs added of 517k are almost completely ignored in the news/media.\n\nAll the media feeds us is bs.",
        "created_utc": 1617388927,
        "id": "gt613qc",
        "permalink": "/r/investing/comments/mijlje/us_job_growth_accelerates_in_march_unemployment/gt613qc/",
        "score": 1,
        "subreddit": "investing",
        "created": 1617417727.0
    },
    {
        "author": "SteveAM1",
        "body": "&gt;At the same time, unemployment claims numbers barely dropping and a real life ADP march jobs added of 517k are almost completely ignored in the news/media.\n\nThe ADP figure is a forecast the monthly BLS jobs report. It's not the number of new jobs of ADP customers.",
        "created_utc": 1617833121,
        "id": "gtqnht2",
        "permalink": "/r/investing/comments/mijlje/us_job_growth_accelerates_in_march_unemployment/gtqnht2/",
        "score": 1,
        "subreddit": "investing",
        "created": 1617861921.0
    },
    {
        "author": "barjay8",
        "body": "ADP not Apple",
        "created_utc": 1619638858,
        "id": "gw7kj2s",
        "permalink": "/r/wallstreetbets/comments/n0bepa/daily_discussion_thread_for_april_28_2021/gw7kj2s/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619667658.0
    },
    {
        "author": "bigdogc",
        "body": "ADP is a payroll company no?",
        "created_utc": 1618375625,
        "id": "gugdvda",
        "permalink": "/r/investing/comments/mqbkui/a_very_bullish_dd_on_apd_a_stock_with_good/gugdvda/",
        "score": 1,
        "subreddit": "investing",
        "created": 1618404425.0
    },
    {
        "author": "ADoIDo",
        "body": "ADP is a far more credible source, they track non-gov jobs which is where a LOT of funding has gone towards... gov jobs.",
        "created_utc": 1617426395,
        "id": "gt7urkr",
        "permalink": "/r/investing/comments/mijlje/us_job_growth_accelerates_in_march_unemployment/gt7urkr/",
        "score": 1,
        "subreddit": "investing",
        "created": 1617455195.0
    },
    {
        "author": "Audacimmus",
        "body": "My favourite undervalued and overlooked stocks are currently:\n\nNLS (Nautilus, fitness equipment company behind Bowflex, has a forward P/E of 8), SONY (new ticker name today! Changed from $SNE to $SONY), DELL, AMKR and HPQ.",
        "created_utc": 1617298344,
        "id": "gt1x440",
        "permalink": "/r/stocks/comments/mhyeqa/rstocks_discuss_overlooked_stocks_thursday_apr_01/gt1x440/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617327144.0
    },
    {
        "author": "Sunkil",
        "body": "They have other means of making money. For example, their interest in HPQ has paid off very well for the company.\n\nRevenue is strictly business sales but earnings will also factor in things like joint ventures and other sources of income.\n\nEarnings is also arguably the most important factor for growth.",
        "created_utc": 1617286914,
        "id": "gt17x5o",
        "permalink": "/r/CanadianInvestor/comments/mhu60k/pyrogenesis_announces_2020_results_revenues_178mm/gt17x5o/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1617315714.0
    },
    {
        "author": "-Snappy",
        "body": "Earnings are largely due to the appreciation of investment in HPQ. Don't forget that the valuation is still 1.4B for 75M of assets, revenues of 16M, but forecasted growth is very interesting, if it can be achieved and sustained for a few years.",
        "created_utc": 1617281482,
        "id": "gt0xw8p",
        "permalink": "/r/CanadianInvestor/comments/mhu60k/pyrogenesis_announces_2020_results_revenues_178mm/gt0xw8p/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1617310282.0
    },
    {
        "author": "waiting4vaccine",
        "body": "HPQ up 8 percent yesterday. Big news coming today?",
        "created_utc": 1617283700,
        "id": "gt11pyh",
        "permalink": "/r/CanadianInvestor/comments/mhs010/daily_discussion_thread_for_april_01_2021/gt11pyh/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1617312500.0
    },
    {
        "author": "TeknoUnionArmy",
        "body": "I bought a bunch more at 10. PYR and HPQ take up a huge amount of my portfolio, close to 13% but I'm okay with that. I got in HPQ at .53 and DCA'd up to 1.03.  I bought high but am fine with it.",
        "created_utc": 1617287250,
        "id": "gt18m1w",
        "permalink": "/r/CanadianInvestor/comments/mhu60k/pyrogenesis_announces_2020_results_revenues_178mm/gt18m1w/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1617316050.0
    },
    {
        "author": "JazzyJ85",
        "body": "What they all said and I would look into some younger companies too so you can actually make some money and not wait 20 years (read about PYR, HPQ, GRN, BES too many to list but they are cheap and will grow with their new tech)... or some energy companies that are still low but expected to pop ($SU, $ARX, $VET) and also have dividends (except VET). These are all available on wealthsimple as well and are Canadian. Anyways, good luck and do your DD!",
        "created_utc": 1617404729,
        "id": "gt6vkxk",
        "permalink": "/r/CanadianInvestor/comments/mijbio/what_do_you_think_of_my_canadian_portfolio/gt6vkxk/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1617433529.0
    },
    {
        "author": "Abu-alassad",
        "body": "Hewlett-Packard",
        "created_utc": 1617288084,
        "id": "gt1acws",
        "permalink": "/r/wallstreetbets/comments/mhu8tg/gme_megathread_for_april_01_2021/gt1acws/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1617316884.0
    },
    {
        "author": "infinitexh",
        "body": "Guess who didnt sell their TSLA and MU calls at open",
        "created_utc": 1617298330,
        "id": "gt1x2uw",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt1x2uw/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1617327130.0
    },
    {
        "author": "Nerobomb",
        "body": "the funny thing about GME is that it's made all my other trades kinda null\n\nI made money today on $MU and currently yolo'd everything into 0dte TSLA 700c\n\nEven if I lose everything on that stupid bet, who cares? I'm several hundred shares in on GME and sell covered calls while waiting for the MOASS so its like all of my money is house money.\n\ndaddy musk might take me to mars but GME goes to pluto",
        "created_utc": 1617288667,
        "id": "gt1blth",
        "permalink": "/r/wallstreetbets/comments/mhu8tg/gme_megathread_for_april_01_2021/gt1blth/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1617317467.0
    },
    {
        "author": "mindlessx55",
        "body": "I think I made the right moves today, sold my TSLA fd’s i got yesterday for 120% profit, and sold mu condor for 50% profit. And stayed out of this market",
        "created_utc": 1617289807,
        "id": "gt1e398",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt1e398/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617318607.0
    },
    {
        "author": "negativeonex",
        "body": "Anyone gonan drop soem cash on MU right now and take it out EOD??? lol",
        "created_utc": 1617286988,
        "id": "gt182ny",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt182ny/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617315788.0
    },
    {
        "author": "Skilledthunder",
        "body": "RIP to all the people that bought puts on MU because they dont understand the \"Chip Shortage\"",
        "created_utc": 1617281023,
        "id": "gt0x5nu",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt0x5nu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617309823.0
    },
    {
        "author": "ChocolateSalty882",
        "body": "Jacked to the tits in MU and MVIS. Might hedge a little with some WD",
        "created_utc": 1617289300,
        "id": "gt1cz79",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt1cz79/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617318100.0
    },
    {
        "author": "caucasian_asian03",
        "body": "What yall think of MU?",
        "created_utc": 1617286084,
        "id": "gt168xy",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt168xy/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617314884.0
    },
    {
        "author": "manlybeer",
        "body": "mu 90c fd",
        "created_utc": 1617261970,
        "id": "gt08ct0",
        "permalink": "/r/wallstreetbets/comments/mhecu3/what_are_your_moves_tomorrow_april_01_2021/gt08ct0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617290770.0
    },
    {
        "author": "Hexys_broken_dreams",
        "body": "VIACA. MU, SKILZ, EH, MVIS",
        "created_utc": 1617275670,
        "id": "gt0pdjd",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt0pdjd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617304470.0
    },
    {
        "author": "acg7",
        "body": "Lol I picked up 15 of them myself... some at .35 and some at .36. I sold 10 of them yesterday at close for a 6 bagger and held 5. Invested $1000 in MU FD with a 389 strike. Pissed I sold the 10 NIO calls, but atleast I put the proceeds somewhere that will do me almost as well.",
        "created_utc": 1617277422,
        "id": "gt0rypq",
        "permalink": "/r/wallstreetbets/comments/mhecu3/what_are_your_moves_tomorrow_april_01_2021/gt0rypq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617306222.0
    },
    {
        "author": "richtofin115",
        "body": "Yes. The source is Nikki Minaj’s butt implants. \n\nDidn’t mu have earnings after hours? It jumped right at close. Maybe they gave v positive forward guidance that brought that spark back into semi industry",
        "created_utc": 1617283358,
        "id": "gt113ky",
        "permalink": "/r/wallstreetbets/comments/mhs01t/unpinned_daily_discussion_thread_for_april_01_2021/gt113ky/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617312158.0
    },
    {
        "author": "nahog99",
        "body": "MU 🥰",
        "created_utc": 1617282114,
        "id": "gt0yy3x",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt0yy3x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617310914.0
    },
    {
        "author": "RobinhoodFag",
        "body": "Nice glad I held my MU 90C",
        "created_utc": 1617282270,
        "id": "gt0z7dx",
        "permalink": "/r/investing/comments/mhr92m/daily_general_discussion_and_spitballin_thread/gt0z7dx/",
        "score": 1,
        "subreddit": "investing",
        "created": 1617311070.0
    },
    {
        "author": "AccountantOk111",
        "body": "Go micron :) lmao I looked at target volume a hour ago was 800 now its like 4 thousand such little volume everywhere I look today obviously it will pick up later but that's why i don't always trust pre market",
        "created_utc": 1617282556,
        "id": "gt0zp2w",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt0zp2w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617311356.0
    },
    {
        "author": "PocketWank",
        "body": "MICRON BOYS.\n\n&amp;#x200B;\n\nBought in yesterday before the close, expecting big earnings due to chip demand.\n\n&amp;#x200B;\n\nThey absolutely smashed it, should get 6% rise today. Quite nice on my 5x trade!",
        "created_utc": 1617265417,
        "id": "gt0bu37",
        "permalink": "/r/wallstreetbets/comments/mhecu3/what_are_your_moves_tomorrow_april_01_2021/gt0bu37/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617294217.0
    },
    {
        "author": "CanIHasAQuestion",
        "body": "Come on MU please make me not poor anymore",
        "created_utc": 1617266090,
        "id": "gt0cmju",
        "permalink": "/r/wallstreetbets/comments/mhecu3/what_are_your_moves_tomorrow_april_01_2021/gt0cmju/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617294890.0
    },
    {
        "author": "The_Contrarian01",
        "body": "Good morning contrarians!\n\nWelcome to April and the second quarter. Stock futures are up this morning, with tech leading the pack. Nasdaq is up 0.9%. Russell 2000 about 0.4% higher. S&amp;P 500 0.3% to the good. Dow futures are flat.\n\nThis follows a nice gain for tech and smallcaps yesterday when Nasdaq and Russell both gained more than 1%. Interestingly, the Dow dropped a bit and the S&amp;P’s gains were muted as well. Rotation to value off again?\n\nCouple of things may have prompted this: you had positive earnings results from Micron, and reports of semiconductor M&amp;A (also involving Micron). There have been concerns about semiconductor supply chains and Biden’s speech called for investing $50 billion in the US chip industry. All of that is good for tech. When semiconductors rise, the rest of the tech industry usually follows.\n\nNot much on the calendar today. Initial jobless claims at 0830. Expectations are for 680,000 claims, which would be equal to last week.\n\nThat’s all I got. Don’t fall for any April Fool’s jokes. You’ve been warned (Voltswagen, er Volkswagen did a good job of preparing you for that as well).",
        "created_utc": 1617274075,
        "id": "gt0n1q5",
        "permalink": "/r/investing/comments/mhr92m/daily_general_discussion_and_spitballin_thread/gt0n1q5/",
        "score": 1,
        "subreddit": "investing",
        "created": 1617302875.0
    },
    {
        "author": "toydan",
        "body": "$MU ripping running and printing!\n\nThe future of fin tech 25% 🤯 \n\nMarket go brrrrr. Grab a seat.",
        "created_utc": 1617280782,
        "id": "gt0wrwq",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt0wrwq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617309582.0
    },
    {
        "author": "Lizzbett",
        "body": "MU &amp; GRGW suddenly flexin’ and I’m totally here for it! still holdin’ my GME. This is all too beautiful. 🎉",
        "created_utc": 1617303627,
        "id": "gt28oyr",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt28oyr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617332427.0
    },
    {
        "author": "AccountantOk111",
        "body": "Your welcome other semis micron helped raised you all up today💪I'm actually more bullish on semis for the long term than any other sector just look at how important it is in today's world and new government spending on it soon",
        "created_utc": 1617282740,
        "id": "gt100k2",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt100k2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617311540.0
    },
    {
        "author": "Darkseid-earth-prime",
        "body": "QCOM, MU, QS will keep going up without having to even try. Their business is in such demand, and will continue to be essential to industrial progress going forward.",
        "created_utc": 1617303227,
        "id": "gt27tug",
        "permalink": "/r/wallstreetbets/comments/mh2ryh/daily_discussion_thread_for_march_31_2021/gt27tug/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617332027.0
    },
    {
        "author": "mushlafa123",
        "body": "My hot streak was this week. There's a 99% chance I go back to losing money next week.\n\nHaving said that... I think there's a lot of chip plays that present some cool opportunities. With the most undervalued one being micron.\n\nMost folks don't understand the magnitude of the guide and what it means for the next 12-24 months.\n\nThey initially guided for like 0.62 cents, then reported around 0.99 for a massive beat and then guided for 1.50 next q. They always guide extremely conservatively. \n\nChip shortage with no end in sight and cloud and hyperscalers do all of their being in second half. \n\nIn short. I think mu is free money but very volatile. Forward pe is like 10. Add on dips. Watch dram exchange for dram pricing and trade accordingly",
        "created_utc": 1617303846,
        "id": "gt295sn",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt295sn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617332646.0
    },
    {
        "author": "beesemode",
        "body": "Yes, TSMC, Intel, Micron, etc all buy Equipment from Amat, LRCX, KLA, etc. You literally cannot make a chip without equipment from Amat and LRCX. Anytime a fab is built, equipment is bought from those companies. Hope that helps",
        "created_utc": 1617295444,
        "id": "gt1qm4o",
        "permalink": "/r/stocks/comments/m1orcz/does_tsmc_rely_on_lrcx_amat_klac_etc/gt1qm4o/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617324244.0
    },
    {
        "author": "devnah721",
        "body": "MU going higher after initial chop; had heavy call side option holders expiring today that needed to be bought out first.",
        "created_utc": 1617284911,
        "id": "gt13yku",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt13yku/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617313711.0
    },
    {
        "author": "devnah721",
        "body": "MU higher after initial chop I think; call holders which must sell today need to be bought out first.",
        "created_utc": 1617284450,
        "id": "gt13399",
        "permalink": "/r/wallstreetbets/comments/mhecu3/what_are_your_moves_tomorrow_april_01_2021/gt13399/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617313250.0
    },
    {
        "author": "richtofin115",
        "body": "#REEEEEEEE \n\nMU or SOXL",
        "created_utc": 1617286139,
        "id": "gt16csb",
        "permalink": "/r/wallstreetbets/comments/mhs01t/unpinned_daily_discussion_thread_for_april_01_2021/gt16csb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617314939.0
    },
    {
        "author": "mushlafa123",
        "body": "Yeah that sucks my dude. It's kinda hard to blindly listen to a random dude on reddit with ur real money. \n\nThere was some fat tendies to be made on this trade though. I got a little over 500%. Too bad I'm too pussy to put more than a few hundred in any one option. My logic was wrong though. Micron didn't announce any new capex. \n\nBut the infrastructure bill has 50bn for semi conductors and tsmc came out and said their spending 100bn on semi manufacturing.\n\nEverything is green though so we all make money last few days I hope.\n\nGood luck and happy Easter brother.",
        "created_utc": 1617299626,
        "id": "gt20505",
        "permalink": "/r/wallstreetbets/comments/mgcgcy/daily_discussion_thread_for_march_30_2021/gt20505/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617328426.0
    },
    {
        "author": "mushlafa123",
        "body": "Where the fuck are the micron upgrades?",
        "created_utc": 1617270156,
        "id": "gt0hv22",
        "permalink": "/r/wallstreetbets/comments/mhecu3/what_are_your_moves_tomorrow_april_01_2021/gt0hv22/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617298956.0
    },
    {
        "author": "The_Contrarian01",
        "body": "Welcome to April and the second quarter. Stock futures are up this morning, with tech leading the pack. Nasdaq is up 0.9%. Russell 2000 about 0.4% higher. S&amp;P 500 0.3% to the good. Dow futures are flat. That’s as of 0630.\n\nThis follows a nice gain for tech and smallcaps yesterday when Nasdaq and Russell both gained more than 1%. Interestingly, the Dow dropped a bit and the S&amp;P’s gains were muted as well. Rotation to value off again?\n\nCouple of things may have prompted this: you had positive earnings results from Micron, and reports of semiconductor M&amp;A (also involving Micron). There have been concerns about semiconductor supply chains and Biden’s speech called for investing $50 billion in the US chip industry. All of that is good for tech. When semiconductors rise, the rest of the tech industry usually follows.\n\nNot much on the calendar today. Initial jobless claims at 0830. Expectations are for 680,000 claims, which would be equal to last week.\n\nThat’s all I got. Don’t fall for any April Fool’s jokes. You’ve been warned (Voltswagen, er Volkswagen did a good job of preparing you for that as well).",
        "created_utc": 1617274121,
        "id": "gt0n40j",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt0n40j/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617302921.0
    },
    {
        "author": "seank11",
        "body": "Bag holded a bunch of Jan 2023 $130s through that retarded sell off and bought more in the mid 80s.\n\nThat guidance last night was straight 🔥🔥🔥🔥.\n\nKnowing that MU always guides light means we are looking at at least 1.70 next Q, with buybacks coming back as they are now FCF positive.",
        "created_utc": 1617281067,
        "id": "gt0x87b",
        "permalink": "/r/wallstreetbets/comments/lxqj5k/mu_pull_back_for_quick/gt0x87b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617309867.0
    },
    {
        "author": "wanttodoCS",
        "body": "in the past 3 months, AMD and MU have switched prices    😔",
        "created_utc": 1617284218,
        "id": "gt12nxe",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt12nxe/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617313018.0
    },
    {
        "author": "pacosteles",
        "body": "No $MU earnings thread. Normies ruined wsb with all of this cocaine-pretend bullshit.",
        "created_utc": 1617260672,
        "id": "gt06ztm",
        "permalink": "/r/wallstreetbets/comments/mhecu3/what_are_your_moves_tomorrow_april_01_2021/gt06ztm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617289472.0
    },
    {
        "author": "danby457",
        "body": "Micron saves tech pog",
        "created_utc": 1617285549,
        "id": "gt156xm",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt156xm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617314349.0
    }
]