[
    {
        "author": "ShopBitter",
        "body": "Yeah that sounds like the kind of tornado I want to see. Clear enough sky where it contrasts well against the horizon. I am not really into the total black out F5 ones.",
        "created_utc": 1629978576,
        "id": "haevr4i",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630007376.0
    },
    {
        "author": "SubbansSlapShot",
        "body": "I wish we had a live chat instead of having to f5 all the time",
        "created_utc": 1628602016,
        "id": "h8eopi1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628630816.0
    },
    {
        "author": "cartoad71",
        "body": "I must have been mistaken.  The webpage on the monitor still showed Tesla rocking straight up.  I hit F5 and my PC slowly refreshed the page.  No, it wasn’t stuck.  I looked back at my phone, and sure enough my brokerage app was quoting a lower price for TSLA then their website on my PC was. \n     Something was not right. I was just about to write it off as some kind of latency, perhaps something on their end; the webserver wasn’t getting the data fast enough, but as a veteran IT professional, my mind also started reaching for the things that might have changed in my configuration since everything seemed to be fine last week.\n  By this time, I was already up over a thousand dollars, and wondering how long my luck would last.  Sure enough, TSLA looked like it was peaking- hit a plateau and I decided to get out – taking a cool grand before breakfast was my favorite way to start the day.  But then I looked back at my phone and the app still wasn’t showing the correct price. It was silly, but I looked back at the PC’s monitor like ‘Wtf is wrong with you?’ and realized that TSLA had resumed its upward swing.\n  Then it dawned on me that I had been travelling back East for business and had manually reset the clock on my laptop.  I looked at my phone and sure enough –it was running two minutes behind my computer. I must have been jetlagged when I had set it back to local time and just carelessly set it to whatever the clock on the bedside alarm clock displayed. \nI smiled to myself thinking how cool it would be if I actually had a pc that could tell me what the stocks would be doing two minutes hence, and I felt so foolish when I set about verifying that this wasn’t actually what I was seeing.  Try as I might, I was unable to disprove this crazy theory.  I could take screenshots of a given security and then two minutes later, compare it with the same chart on my phone and it would match perfectly.  I realized that I was wasting valuable gambling time, and that I should really put this phenomenon to the test. I spent the next twenty five minutes studying the charts on my laptop screen, then using that advanced knowledge to game the market.  After nearly half an hour I was already up 73 thousand (being still kind of small time), but running up against Regulation T limitations and I had to be done for the day.\nMy heart was pounding and I realized that I had something possibly magical, and most likely totally illegal.  I jumped up and pulled the curtains shut, just in case nosy neighbors or JPow’s jack –booted SEC thugs were lurking in the bushes outside my home.  I felt a little sick to my stomach, joy tempered with abject fear- not unlike the feeling after having been on a roller coaster.  Shaking, I walked to the kitchen, figuring I would make a nice cup of tea and lend an air of normalcy to the situation.  I stood in the kitchen listening to the electric kettle mustering up the courage to boil me some water, contemplating my great fortune- and what I was going to do with all this money I was going to be raking in.  First, I would pay off my mother’s mortgage and home equity loan, then pay off my sister –in –law’s student loans, and set up college funds for all the kids.  I should pay off my own mortgage- or was there even a point?  I was going to be rich beyond my wildest dreams.  I chuckled to myself as I poured the water, never having been in the position to even consider being sloppy with money.\n  There was a spring in my step and I had to restrain myself from skipping back to my office down the hall.  \n  When I rounded the corner my heart jumped into my throat as I see the laptop is about to restart itself after having installed Windows Updates.  ‘NOOOO!!’ I screamed as I threw myself on my knees in front of it, but alas, the screen went dark, and a moment later flickered back to life, and the clock read 10:14.\n I grabbed my phone in a panic, and saw to my dismay that yes, the two machines agreed that it was indeed 10:14 AM.\n  A numb feeling came over me, and I felt a little defeated, but then I realized I had almost seventy –five thousand dollars in my trading account that I hadn’t had yesterday.\nI guessed things might be okay after all.",
        "created_utc": 1629385474,
        "id": "h9jgz8w",
        "score": -7,
        "subreddit": "wallstreetbets",
        "created": 1629414274.0
    }
]