[
    {
        "author": "Captain_Yolo_",
        "body": "Just want to say a special shoutout to my high school and college calculus professors. Fuck you guys and your ti-84 standard from fucking 2004 I use calculus in my career now often and am encouraged to use wolfram alpha and mathematica all the time. I'm not even asked to show my work. That time learning was completely wasted using such ancient tech ^and ^copious ^drinking \n\n\nAlso calls on Texas Instruments they're already **+20%** YTD because of their fucking shitty old monopoly, yep ti-84 still the standard.",
        "created_utc": 1617853860,
        "id": "gtrrjpu",
        "permalink": "/r/wallstreetbets/comments/mmakl8/what_are_your_moves_tomorrow_april_08_2021/gtrrjpu/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617882660.0
    },
    {
        "author": "ZookeepergameOk8887",
        "body": "So, I have been thinking about TXN, Texas instruments. They are one of the few companies with  foundries in the us, and while it has almost doubled, it does not have the multiples that some others have. If China keeps pushing Taiwan, there will be an increased need for domestic chip producers. (They're already is.) What are your thoughts?",
        "created_utc": 1617916912,
        "id": "gtuwrii",
        "permalink": "/r/wallstreetbets/comments/mn04vf/what_are_your_moves_tomorrow_april_09_2021/gtuwrii/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617945712.0
    },
    {
        "author": "X-Boozemonkey-X",
        "body": "Im a SOXL bull. Here's my take. NVDA at some point will take a breather. AMD has room to run but is not a big part of SOXL. TSM has room to run. LRCX, AVGO, INTC, TXN, ADI, SOXX, and MU are near all time highs.\n\nThere is no doubt in my mind that the demand for chips is through the roof amd will remain high. Every industry thats booming needs them. The shortage is a positive thing for us. Demand is high. We dont want a glut. We want to operate at a slight shortage. That said, we will need perfect numbers to start the next leg up or a breather to let things cool off. Ive been hoarding shares on the dips and am selling covered calls and cash secured puts and then putting the money towards more shares.",
        "created_utc": 1618499142,
        "id": "gum1eqs",
        "permalink": "/r/wallstreetbets/comments/mrbmfj/daily_discussion_thread_for_april_15_2021/gum1eqs/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618527942.0
    },
    {
        "author": "DBCooper_OG",
        "body": "well just a theory... I thought that TXN looked overvalued to me even 2 years ago, so I stayed away. I suck at this game.",
        "created_utc": 1618612508,
        "id": "gus0rfb",
        "permalink": "/r/StockMarket/comments/msdyoa/what_is_going_on_with_texas_instruments_txn/gus0rfb/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1618641308.0
    },
    {
        "author": "MentalValueFund",
        "body": "&gt;you DO NOT want to be short or buying puts right now unless something gives you confirmation of it\n\nThat's fairly terrible advice. Puts and shorts are not just gambling. They have a very respectable place in any fundamental investor's portfolio. \n\nThink the broad semiconductor market will outperform TXN? Cool, short $100 of TXN and long $100 of SOXX (or vice versa if you think TXN outperforms SOXX).\n\nGot a portfolio of equities you're needing minor vol insurance against? Great, grab OOTM puts for cheap vega hedges.\n\nFundamental investment strategies aren't just limited to this stock is good so I buy and hold.",
        "created_utc": 1617665772,
        "id": "gtiet50",
        "permalink": "/r/stocks/comments/mkwndx/how_to_profit_from_a_market_crash/gtiet50/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1617694572.0
    },
    {
        "author": "OlyBomaye",
        "body": "You have any favorites?  Or do you celebrate the entire catalog?\n\nI almost bought puts on TXN today cause it's looking TOO good.  But then I decided, that ain't me.",
        "created_utc": 1617852799,
        "id": "gtrprw5",
        "permalink": "/r/wallstreetbets/comments/mmakl8/what_are_your_moves_tomorrow_april_08_2021/gtrprw5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617881599.0
    },
    {
        "author": "BroAbernathy",
        "body": "I'm not nearly experienced or qualified enough to tell people what to buy but just use the most basic of basic strategies. Look at shit in your house, think about what's going on in your life, what you need and use FREQUENTLY then open a position in the market. For me: I'm a functioning alcoholic so I bought DEO, I watch stuff on Disney plus every day so I have disney, I buy food at Costco, hardware at HD, use cashapp so Square, got a honeywell thermostat so HON. Just right there I have exposure in entertainment, consumer goods, home building, fintech/crypto, industrials simply from looking at stuff in my house. Do that yourself and you'll be absolutely fine. \n\nOn the other hand take a look at reddit hype stocks. You care about space exploration I'm sure but who do you know is actively participating? (SPCE) Would you be caught dead paying 60 bucks a month for streaming garbage? (FUBO) You or any friends going to buy a Chinese electric car you haven't heard of pre investing knowledge? (NIO) Literally why would you ever care about TSM when Intel and Texas instruments have their name on everything? Half the damn population doesn't believe global warming exists even in the current administration why would you throw your money at ICLN?\n\nAll that shit is completely speculative and maybe you make money on it eventually but you literally have no clue you ever will and the casual -10% is fucking frightening. You WILL make money in investing in things people want to buy or use. Dont want to deal with it? Dump 10K in VTI/SPY/IWM/QQQ and don't look at it for decades.",
        "created_utc": 1618524863,
        "id": "guno73i",
        "permalink": "/r/stocks/comments/mrftxt/safe_stock_or_etf_plays/guno73i/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1618553663.0
    },
    {
        "author": "trill_collins__",
        "body": "Yeah dude, this is merger-risk arb. The reason it exists because it's a non-binding LOI and creates no obligation to accept the take private offer. Current price = take out price * (% liklihood that the txn will execute), e.g. there is still risk you're bearing (offer get's rejected and price drops back down to $5/share).\n\nWarrant's expire worthless since exercise &gt; offer price, but there might be a CoC caveat hidden somewhere in their indenture (or S1 possibly, since technically these are equity derivatives and not fixed income).",
        "created_utc": 1617907454,
        "id": "gtuazye",
        "permalink": "/r/investing/comments/mmsb08/avct_avctw_arbitrage_opportunity_here/gtuazye/",
        "score": 1,
        "subreddit": "investing",
        "created": 1617936254.0
    },
    {
        "author": "BleedingDick6669",
        "body": "TXN",
        "created_utc": 1617898834,
        "id": "gttqno6",
        "permalink": "/r/wallstreetbets/comments/mmog6c/daily_discussion_thread_for_april_08_2021/gttqno6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617927634.0
    },
    {
        "author": "Nerd514",
        "body": "For a longer slower growth, im looking that and TXN. Smart or no?",
        "created_utc": 1618378111,
        "id": "gugh6xc",
        "permalink": "/r/wallstreetbets/comments/mqaa3x/what_are_your_moves_tomorrow_april_14_2021/gugh6xc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618406911.0
    },
    {
        "author": "Momopig1",
        "body": "Any advice  much appreciated\n\nTDS 7.3%\n\nNVAX 27.11%\n\nR2US 23.17%\n\nCNDX 33.75%\n\nTXN 4.28%\n\nINVE 4.38%\n\nFuture buys:PRVB, KOF?\n\nMight try to lower percentage in NVAX",
        "created_utc": 1617911958,
        "id": "gtulf67",
        "permalink": "/r/stocks/comments/lv5dlb/rate_my_portfolio_rstocks_quarterly_thread_march/gtulf67/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617940758.0
    },
    {
        "author": "30vanquish",
        "body": "SCHD Awesome dividend etf that has a lot of diverse safer stuff\n\nCoke Pepsi UPS Blackrock Texas Instruments Exxon Pfizer MMM IBM Verizon",
        "created_utc": 1617947297,
        "id": "gtwg46t",
        "permalink": "/r/stocks/comments/mn5gie/i_love_etfs_but_all_of_my_etf_choices_are_heavily/gtwg46t/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617976097.0
    },
    {
        "author": "koi88",
        "body": "&gt;Oh, and Apple's new chip is blowing both Intel and AMD out of the water.\n\nThis is an important point. **Apple's new CPU is ARM based.** That's a whole new family of chips that computer makers can produce basically **without Intel or AMD**. \n\nWhile other companies seem to be nowhere as advanced in the development of their own ARM processors (until Apple introduced the M1, most thought the ARM architecture is only suitably for mobile devices), they **will** come eventually. \n\nTherefore we may see a **whole new world of CPU manufacturers.** Soon Samsung, Huawei, Amazon, Fujitsu, TSMC, Texas Instruments, or others may introduce their own desktop CPU designs. \n\nThis **could be the end of the X86 dominance** in the market – and that, of course, spells trouble for the established X86 CPU makers.",
        "created_utc": 1617524248,
        "id": "gtbuw0n",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtbuw0n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617553048.0
    },
    {
        "author": "GearheadGaming",
        "body": "But that isn't really an EV thing.  You can have a touchscreen display in any car.\n\nAlso, this company is mainly about tablets, smartphones, that sort of stuff, right?  And the small chunk of revenue they get from touchscreens for cars is mainly as a supplier to Chinese companies, right?  So doesn't all that go tits up if we go trade war two, electric boogaloo?\n\nHIMX is not an EV play.  Not even close.  You want to do automotive chips, you want ON, IFNNY, NXPI, those sort of guys.  TXN would be my play in that space, though personally I'm waiting for their earnings report on the 20th before I make a move.",
        "created_utc": 1617559011,
        "id": "gtd9rd2",
        "permalink": "/r/wallstreetbets/comments/mjwtjr/buyyyyy_himx_to_the_mar/gtd9rd2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617587811.0
    },
    {
        "author": "Brockly75_",
        "body": "Hi all, just started actually investing a while ago and just wanted a little feedback:\n\nTXN - 20%\n\nDIS - 19%\n\nMSFT - 24%\n\nCOST - 7.5%\n\nSPOT - 6.5%\n\nIRM - 8%\n\nSBUX - 10%\n\nAAPL - 5%",
        "created_utc": 1617562318,
        "id": "gtdg5n0",
        "permalink": "/r/stocks/comments/lv5dlb/rate_my_portfolio_rstocks_quarterly_thread_march/gtdg5n0/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617591118.0
    },
    {
        "author": "Brockly75_",
        "body": "TXN, MSFT and DIS for the long term for sure",
        "created_utc": 1617556782,
        "id": "gtd5dfi",
        "permalink": "/r/stocks/comments/mjrul6/long_term_stocks/gtd5dfi/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617585582.0
    },
    {
        "author": "t33po",
        "body": "Those two could not be more different unless I missed a major development with TXN. Long term, TXN all the way. QS is a startup going for the holy grail of EV/storage. In fifteen years, TXN will probably be still around and have grown steadily over the years. QS will either be defunct or been acquired by AAPL et al for a trillion or be organically worth trillions. Solid state batteries, if they work at scale, could be that big of a game changer.",
        "created_utc": 1618379086,
        "id": "gugiee0",
        "permalink": "/r/wallstreetbets/comments/mqaa3x/what_are_your_moves_tomorrow_april_14_2021/gugiee0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618407886.0
    },
    {
        "author": "ryebit",
        "body": "I'm sorry, but that's just not just a little off, it's completely wrong. \n\nConflating the phrases \"full\" and \"archive\" together like they mean the same thing is dishonest.\n\nLet me link to the official documentation: https://ethereum.org/en/developers/docs/nodes-and-clients/\n\nA \"full node\" contains the entire blockchain history.  It's all that's required to run a node.  That's what ethernodes.org is showing. \n\nAn \"archive\" node is one where the entire chain history has been indexed for quick access to cumulative info (e.g. \"what was the last txn made by account Y between blocks Y and Z?\").  \n\nAny \"full\" node can be turned into an \"archive\" node, it doesn't require any extra information, just storage space for the expanded data.  It's the equivalent of turning on indexes in an sql database.\n\n---\n\nPretending no one can calculate Ethereum's supply is incredibly silly.  This has been lobbed across twitter for so long, with people then pretending it's impossible, despite any evidence to the contrary.  One guy got so fed up he made this script -- https://github.com/lastmjs/eth-total-supply -- which provides exact instructions to calculate it *yourself* if you don't want to trust charting sites like etherscan.",
        "created_utc": 1618510857,
        "id": "gumsgz5",
        "permalink": "/r/investing/comments/mr2m8u/coinbase_deep_dive_diligence_part_1_of_2/gumsgz5/",
        "score": 1,
        "subreddit": "investing",
        "created": 1618539657.0
    },
    {
        "author": "jamdivi",
        "body": "Have TXN, AMD, NXPI. Thank you for telling me about this lol",
        "created_utc": 1617285376,
        "id": "gt14uyd",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt14uyd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617314176.0
    },
    {
        "author": "GearheadGaming",
        "body": "Serious answer though, I'm not big on fabless semi companies, and at current valuations Himax is a little pricey, even for a semi.\n\n[Full disclosure, I sold my TSM at $124, and all I've got left in it at the moment is some call spreads](https://imgur.com/a/1NTT3Ag)\n\nI much prefer pure play foundry's, integrated companies, or front-end equipment makers.  That means TSM, INTC, MU, TSEM, Samsung, and TXN as your semi stocks, ASML, AMAT, KLAC, LRCX as your front end capital guys.  I also like AMKR and ICHR, even though they aren't technically on the front end side of things, and maybe 3-6 months from now I'll perk up on companies like KLIC.\n\nI'm not big on HIMAX's short term prospects, because I think the semi shortage will hurt them as much as help them, and I'm not big on their long-term prospects because I think it's only a matter of time before a bigger fabless company acquires one of Himax's direct competitors.",
        "created_utc": 1617548106,
        "id": "gtcokeu",
        "permalink": "/r/wallstreetbets/comments/mjwtjr/buyyyyy_himx_to_the_mar/gtcokeu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617576906.0
    },
    {
        "author": "SomeSortOfBrit",
        "body": "They dont make most of their money via cars it's mostly in plane engines iirc cars are a much smaller part of their business kind of like texas instruments and calculators",
        "created_utc": 1617991521,
        "id": "gtygnz4",
        "permalink": "/r/pennystocks/comments/mnmwaj/rycey_time_to_buy_rolls_royce/gtygnz4/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1618020321.0
    },
    {
        "author": "DatGDoe",
        "body": "dumping some more money in $CE $TXN and $STLD today only been in these 3 for a month and had great returns",
        "created_utc": 1617706358,
        "id": "gtk0ml3",
        "permalink": "/r/stocks/comments/ml7rbq/rstocks_daily_discussion_technicals_tuesday_apr/gtk0ml3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617735158.0
    },
    {
        "author": "richtofin115",
        "body": "Soxl or smh or soxx for etf. Tsm mu qcom Amat intc Texas Instruments.",
        "created_utc": 1618435781,
        "id": "guja3i4",
        "permalink": "/r/wallstreetbets/comments/mqyoy9/what_are_your_moves_tomorrow_april_15_2021/guja3i4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618464581.0
    },
    {
        "author": "toydan",
        "body": "MU AMD QCOM SWKS TXN and back into SOXL. \n\nSelling CCs over some of them.",
        "created_utc": 1617588455,
        "id": "gtes5fm",
        "permalink": "/r/stocks/comments/mk8qcl/semiconductor_related_stocks/gtes5fm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617617255.0
    },
    {
        "author": "Kashm11r",
        "body": " AMD MU NVDA TSM AMAT INTC AAPL AVGO QCOM MRVL TXN NXPI QRVO SWKS CRUS",
        "created_utc": 1617593046,
        "id": "gtezt1p",
        "permalink": "/r/stocks/comments/mk8qcl/semiconductor_related_stocks/gtezt1p/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617621846.0
    },
    {
        "author": "StalCair",
        "body": "I am not disputing the usefulness of semis. Only their recent movements. Last month most if not all semi stocks rebounded after earnings (over 100% for most since the march 2020 crash).\n\nNvidia 20% in 1 month.\n\nAMD 12% top 6% rn in one month.\n\nON 20% on the decline in one month.\n\nAVGO 20% in one month.\n\nTXN 20% in a month.\n\nMU 12% in a month.\n\nIntel 15% on the decline in one month.\n\nLRCX  30% on the decline in a month.\n\nTSMC is probably the stock that will tank the least due to its seat on the table of semis and the fact it wasn't overbought 5 weeks ago.",
        "created_utc": 1618487231,
        "id": "guleqxl",
        "permalink": "/r/wallstreetbets/comments/mr03qi/80k_amd_yolo_day_1_babydick_gains/guleqxl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618516031.0
    },
    {
        "author": "shiverstar",
        "body": "MU, NVDA, Texas Instruments",
        "created_utc": 1618518624,
        "id": "gunaeco",
        "permalink": "/r/wallstreetbets/comments/mrms60/what_are_your_moves_tomorrow_april_16_2021/gunaeco/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618547424.0
    },
    {
        "author": "X-Boozemonkey-X",
        "body": "Nvdia, avgo, lrcx, amd, txn, adi. Were all down about 20% in February/ March. FB, MSFT, and GOOGl arnt the only tech stocks in the nasdaq imfao",
        "created_utc": 1617924304,
        "id": "gtvccoj",
        "permalink": "/r/wallstreetbets/comments/mn04vf/what_are_your_moves_tomorrow_april_09_2021/gtvccoj/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1617953104.0
    }
]