[
    {
        "author": "Meymo",
        "body": "As a person who focuses exclusively on buying baskets of individual stocks, I say this to you: You need to focus on quality portfolio construction. In the end, quality always matters. As a part of my framework, I allocate roughly 5% of my portfolio to purchase speculative stocks which don't yet meet my criteria for a core position in my portfolio. Speculative plays include things like IPOs, SPACs, etc. They can also include items like Gamestop, AMC or Blackberry. \n\nHaving a dedicated allocation of your portfolio to take on these items offers multiple benefits:\n\n1. If the play finds support at zero, its a maximum of 5% across my account.\n\n2. Since this 5% total is between any of my new or speculative stocks, it limits exposure overall (e.g. a blend of GME, AMC, BB, + CCIV, IPOE) limits your risk as opposed to dedicating all 5% to one play.\n\nIf a speculative item does well and I start to gather more data to support my position on it (e.g. understand what the company is actually doing/their roadmap, their customers/contracts, and sector risks; hard data/math: volatility, geometric mean, Sharpe/Sortino ratios) I consider adding it to my core portfolio (purchasing more and elevating it out of \"speculative\" status). \n\nOnce added to my core portfolio, it becomes something that I purchase on a regular cadence (e.g. every pay period I purchase my core portfolio). \n\nRisk management takes incredible discipline, but having a strategy and sticking to it (until something materially changes with your strategy to warrant changes) will give you the best results in the long-term, especially if you're buying individual securities. \n\nGood luck",
        "created_utc": 1612293826,
        "id": "glrpf79",
        "permalink": "/r/investing/comments/lb0zio/risk_mitigation_how_can_i_soften_the_blow/glrpf79/",
        "score": 13,
        "subreddit": "investing",
        "created": 1612322626.0
    },
    {
        "author": "Meymo",
        "body": "The best time to invest was last Friday. The next best time is today. Equities, generally, move up most of the time. The best way to ensure that you’re preparing for future growth is to buy and keep buying in a regular cadence (eg every pay period).",
        "created_utc": 1612818573,
        "id": "gmmhdoj",
        "permalink": "/r/investing/comments/lfkprx/objective_speculation_getting_past_the_missed/gmmhdoj/",
        "score": 2,
        "subreddit": "investing",
        "created": 1612847373.0
    },
    {
        "author": "Astrosalad",
        "body": "I don't know whether this price is good or anything, but I personally would be wary of any long-term investments in SPCE. Sure, they've got hype and good press, but their business is not set up to be competitive in the space tourism sector. Air launch is expensive and a fair bit of hassle, meaning their tickets will be very high price. It may seem at the moment that they're close to launching paying passengers, but let's look at their competitors 3-5 years down the line. You have SpaceX with both Crew Dragon (just announced their first all-civilian flight) and Starship (coming soon™️, but will have huge implications for space tourism), as well as Blue Origin, which is less ambitious but about in the same product slot as SPCE. Both of these companies have huge financial backing and are on track to have significantly lower costs, higher launch cadence, and better product. SPCE may have a small niche somewhere in that market, but I don't think long-term it is a good play.\nSource: am space nerd. \n\nDisclaimer: not financial advice, no position in SPCE",
        "created_utc": 1612239825,
        "id": "glozdyi",
        "permalink": "/r/wallstreetbets/comments/lamw17/long_time_lurker_wanted_to_post_my_bet_put_all_my/glozdyi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612268625.0
    },
    {
        "author": "FuzzyDunlop911",
        "body": "Right?  And he has a specific cadence also, hard not to read it in that as well.",
        "created_utc": 1612280328,
        "id": "glqphp2",
        "permalink": "/r/wallstreetbets/comments/lawubt/hey_everyone_its_mark_cuban_jumping_on_to_do_an/glqphp2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612309128.0
    },
    {
        "author": "themellowsign",
        "body": "this comment and these replies look really sus to anyone else?\n\nsomething about the cadence.",
        "created_utc": 1612962714,
        "id": "gmt98gq",
        "permalink": "/r/pennystocks/comments/lgltvk/the_lounge_thoughts_noob_stuff_low_effort_brokers/gmt98gq/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1612991514.0
    },
    {
        "author": "AlbertSmithson",
        "body": "alot of the hard times seems to be over for Hexo, they did a great job of getting their debt down and move into profit.\n\nif they can get the US going then looking more towards a potential  $2B MCAP looking at general market projection and cadence.",
        "created_utc": 1612808041,
        "id": "gmltveq",
        "permalink": "/r/weedstocks/comments/lf9z4n/hexo_corp_appoints_general_manager_of_us/gmltveq/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1612836841.0
    }
]