[
    {
        "author": "StockTipsTips",
        "body": "Possibly Very Bullish Sectors for the Next 3-12 Months Amid Troubled Times. The examples below are certainly not buy recommendations. Just examples.\n\nBelow is a list of what I consider possible bullish sectors/industries in the next 3-12 months. We all know of the supply chain issues, the semiconductor shortages, worker shortages, &amp; inflation issues. As a result I'm considering these sectors/industries as possible bullish options in the next 3-12 Months. Please understand that I know that I did not get all stocks in each category. So if you're favored stock isn't listed, don't get angry, post it in the comments below. And if you feel I missed a sector, please let me know. \n\nAnyway enjoy the dips now because these are likely to get beefed up as the supply chain &amp; worker shortages unwind\n\n.\n\n**1)** **Inelastic &amp; Fairly inelastic Industries:** (*Meaning people usually pay for the good or service no matter what the price \"insensitive to changes in price or income\"*) \n\n* Pharmaceuticals (With highly used patented meds for diseases &amp; illnesses)\n* Oil/Gas/Natural Gas (No matter how scarce it gets, people will buy it)\n* Energy (Be careful, many producers of electricity are heavily regulated)\n\n**2) Agriculture/Farm Equipment/Fertilizers/Farm Chemicals:** People got to eat ... and have you seen the price of softs futures? This will incentivize farmers to produce more which in turn will require more farm equipment, farm construction, pesticides, herbicides, insecticides, seeds, chemicals etc. It does not help that food is rotting on the docks right now &amp; people are panic buying.\n\n* **Examples:** YTEN, TITN, NTR, SANW, DE, DOLE, ANDE, CLXT, ADM, CLXT, AGRO, AGCO, ADM, LMNR, TWI, ADM, BG, CALM, GRWG, HYFM, FMC, MEOH, \n\n**3) Semiconductors, Passive Semiconductors, &amp; Electronic Components:** Semiconductors are suffering due to worker shortages &amp; supply chain issues. However demand is seriously backed up. As soon as the supply chain situation gets straightened out expect semiconductors to explode.\n\n* **Examples:** NVDA, INTC, ARCB, AMKR, MU AMD, TXN, VSH, STM, ASYS, WOLF, TSM, QCOM, ON, ASML, NXP, AMAT, AVGO, LRCX, SWKS, MRVL, KLAC, MCHP, QRVO, SSNLF, DIOD\n\n**4) Shipping/Bulk Transportation/Freight/Transportation Services:** Shipping / Bulk Transportation / Freight / Transportation Services / are more in demand now than ever before in US history. In fact these services are in so much demand that they're clogging up the ports. And while ships sitting off the coast are likely loosing money as the supply chain issues worsen, you can bet they'll explode with business for pint up demand as the situation unwinds. \n\n* **Examples:** ZIM, JBHT, NSC, TNK, TGP, CNI, CMRE, REVG, DAC, SB, HTZZ, GRIN, ODFL, ASC, EDRY, XPO, SBLK, FWRD, BEST, CPLP, MATX, SAIA, INSW, GASS, PATI, PSHG, NETI, PXS, ULH, USDP, TFII, KNOP, KNX, CHRW, GLOP, EDRY, CVLG, PAC, HUBG, EDRY, MRTN, GLNG, NMM, HMLP, BEST, CPLP, DESP, HTLD, PWFL, GOGL, EGLE, SHIP, ZTO, LSTR, WERN, USAK, ESEA, GNK, CICOY, OROVY, PCFBY, CSX, DSX, MMLP,  PANL, KEX, NAT, UNP, WJRYY\n\n**5)** **Chemicals:** Agriculture chemicals, industrial chemicals, construction chemicals, drilling chemicals, textile chemicals, take your pick. The worlds manufacturers do not run without chemicals of some sort. And once supply chain issues are put behind us &amp; workers start to fill these empty job seats, you can bet that increased production will ramp up the demand for industrial chemicals. \n\n* **EXAMPLES:** HUN, OLN, DOW, LYB, EMN, GLTC, KRO, UNVR, CBT, MEOH, APD, OEC, VHI, ODC, TREC, TROX, IOSP, DD, KOP, ALB, LAC, PPG\n\n**6) Staffing Firms:** There's a massive worker shortage &amp; those positions will need to be filled. You can bet staffing firms are in high demand.\n\n* **EXAMPLES:** DLHC, CCRN, KFY, CBRE, HQI, RHI, WDAY, NSP, HSII, RGP, TBI, KFRC, \n\n**7) Inferior goods:** Ever notice how demand for some products go up when prices rise? These are generally inferior goods. Ramen Noodles &amp; Mac&amp;Cheese are a few examples. Dollar Stores are filled with inferior goods. \n\n* DG, DLTR, WMT, ROST, KHC",
        "created_utc": 1635443044,
        "id": "hieog2c",
        "permalink": "/r/investing/comments/qhoh2e/thematic_and_ideas_based_investing/hieog2c/",
        "score": 5,
        "subreddit": "investing",
        "created": 1635471844.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot. You submitted a picture of a banned ticker, NXP.                            This check will fire if you included unnecessary pictures that have bad phrases or a bad crop with news about cryptocoins, for example. Repost with the useless pictures omitted if you did that.                            Yell at /u/zjz if it's above 1.5 billion-ish market cap and not related to crypto/pennies/OTC/SPACs.",
        "created_utc": 1633587096,
        "id": "hfp73j7",
        "permalink": "/r/wallstreetbets/comments/q32sfn/on_the_thrill3t_shiii_3v3r_3_will_turn_into_one/hfp73j7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633615896.0
    },
    {
        "author": "redd-it-help",
        "body": "Even though there is going to be lot of things needing chips, not all semi stocks have done well. $NVDA, $AMD have done well but not others like $SKWS, $NXPI. There are better semi and related stocks that I have in my watch lists: $AEHR, $AMBA, $CDNS, $SNPS, $ASML. \n\nLooks like $AMD ER is great.",
        "created_utc": 1635279676,
        "id": "hi5r1sb",
        "permalink": "/r/stocks/comments/qfqo6y/what_are_your_highest_conviction_stock_picks_for/hi5r1sb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635308476.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Friday, the 29th of October\n\n\n\n## Upcoming events for Friday, October 29th\n\n - Expected earnings:\n\n  ABBV, ABR, AENZ, AON, AREC, ASIX, ASX, ATNM, ATRO, B, BAH, BBVA, BCH, BCPC, BELFA, BELFB, BLX, BSAC, CBOE, CCJ, CERN, CHD, CHT, CHTR, CL, COWN, CRI, CVX, DCOM, ECVT, ENIC, ENLV, ESXB, FNCB, FSFG, FTS, GIGM, GRC, GWW, HEXO, HUN, IMGN, IMO, IRMD, IROQ, ITCB, JCS, LAZ, LEVL, LHX, LYB, MGI, MSEX, NECB, NICK, NOVN, NPK, NTP, NVO, NWG, NWL, OIIM, OXLC, PBR, PBR.A, PFS, PHVS, PIPR, PLPC, PNM, POR, PSX, PSXP, RCL, RUTH, SHLX, SIFY, SJR, SLCA, SNP, TTE, TWIN, TZOO, UBOH, URG, UUUU, WETF, WPC, WY, XOM, ZNH\n\n - Ex-div:\n\n  ALLY, AON, ATLO, AVAL, BCBP, BK, BMO, BMTC, BX, C, CAG, CASY, CE, CZNC, DGICA, DGICB, DMLP, ENLC, EVTC, EWBC, HAS, HEP, HFBL, HIFS, KMI, KOF, KRP, LCUT, LNT, NRG, NVEC, OKE, ORRF, PAYX, PBCT, PLBC, PNM, PPBI, RBB, RVI, SAN, SGU, SPFI, STL, SXT, SYF, TKC, TXN, VALU, VOC, WES\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.6K)\n    - CFTC Copper speculative net positions (previous: 40.6K)\n    - CFTC Corn speculative net positions (previous: 277.0K)\n    - CFTC Crude Oil speculative net positions (previous: 429.6K)\n    - CFTC Gold speculative net positions (previous: 193.3K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.1K)\n    - CFTC Natural Gas speculative net positions (previous: -131.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 67.6K)\n    - CFTC Silver speculative net positions (previous: 30.4K)\n    - CFTC Soybeans speculative net positions (previous: 43.5K)\n    - CFTC Wheat speculative net positions (previous: -8.6K)\n    - Chicago PMI (consensus: 63.5, previous: 64.7)\n    - Core PCE Price Index (consensus: 0.2%, previous: 0.3%)\n    - Core PCE Price Index (consensus: 3.7%, previous: 3.6%)\n    - Dallas Fed PCE (previous: 2.80%)\n    - Dallas Fed Services Revenues (previous: 14.0)\n    - Employment Benefits (previous: 0.40%)\n    - Employment Cost Index (consensus: 0.9%, previous: 0.7%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.80%)\n    - Michigan Consumer Expectations (consensus: 67.2, previous: 68.1)\n    - Michigan Consumer Sentiment (consensus: 71.4, previous: 71.4)\n    - Michigan Current Conditions (consensus: 77.9, previous: 80.1)\n    - Michigan Inflation Expectations (consensus: 4.8%, previous: 4.6%)\n    - PCE Price index (previous: 4.3)\n    - PCE price index (previous: 0.4%)\n    - Personal Income (consensus: -0.2%, previous: 0.2%)\n    - Personal Spending (consensus: 0.5%, previous: 0.8%)\n    - Real Personal Consumption (previous: 0.4%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.6%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 3.9%)\n    - Texas Services Sector Outlook (previous: 11.5)\n    - U.S. Baker Hughes Oil Rig Count (previous: 445)\n    - U.S. Baker Hughes Total Rig Count (previous: 543)\n\n## Upcoming events for Monday, November  1st\n\n - Expected earnings:\n\n  ABIO, ADC, ADTN, ADUS, AKTS, ALX, AMC, AMG, AMRC, ANAT, ANET, APEN, APLS, AWR, BEN, BNL, BRKR, BRX, BWXT, CACC, CAR, CCLP, CEA, CHGG, CLDB, CLX, CNA, CORR, CPLP, CRNT, CRUS, CSR, CSWC, CURO, CVI, CWBC, DSPG, DSS, DZSI, EC, EEX, EGRX, ENBL, EPRT, EVER, FANG, FEDU, FGBI, FN, FSBW, GAIA, GAME, GSS, GTE, GXO, HLIT, HNRG, HOLX, IPI, ISEE, IVAC, IVT, IX, JELD, KFRC, KLDO, KMT, KOF, L, LDI, LEG, LPG, LTRN, LXU, MCK, MFIN, MGP, MNOV, MOS, MRBK, MVBF, NBIX, NERV, NNN, NRIM, NSP, NSSC, NTR, NXPI, O, OGS, OIS, ON, ONVO, OTTR, PCG, PDLB, PLOW, PSA, RGS, RHP, RIG, RMBS, RRX, RYAAY, SBAC, SBT, SCCO, SKT, SMLR, SNDX, SOI, SPG, SUNW, SXC, TA, TGB, TKR, TRVG, TRVN, TTI, UAN, UNVR, VBIV, VNO, VNOM, VRNS, WBK, WLFC, WMB, WMK, WTRG, XENT, ZI\n\n - Ex-div:\n\n  AES, BANR, BKR, ETRN, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, HIHO, IGD, ITUB, LMRK, O, OMF, SHLX, SPH, SRCE, VER, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.055%)\n    - 6-Month Bill Auction (previous: 0.060%)\n    - Construction Spending (consensus: 0.4%, previous: 0.3%)\n    - ISM Manufacturing Employment (previous: 50.2)\n    - ISM Manufacturing New Orders Index (previous: 66.7)\n    - ISM Manufacturing PMI (consensus: 60.4, previous: 61.1)\n    - ISM Manufacturing Prices (consensus: 78.5, previous: 81.2)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 59.2, previous: 60.7)\n    - Total Vehicle Sales (previous: 9.66M)\n\n^^^^2021-10-29",
        "created_utc": 1635501611,
        "id": "hihss0l",
        "permalink": "/r/RobinHood/comments/qi9cam/daily_discussion_thread_october_29th_2021/hihss0l/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1635530411.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets.                                You submitted one or more banned tickers: FAB NXP.\n\n                                Message /u/zjz if they're above 1.5 billion-ish market cap and not related to crypto/pennies/OTC.",
        "created_utc": 1635437042,
        "id": "hie8zri",
        "permalink": "/r/wallstreetbets/comments/qhq8th/gfs_the_sisyphean_amd_child/hie8zri/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635465842.0
    },
    {
        "author": "vouwrfract",
        "body": "Nobody has that infrastructure, mate. Everyone, big and small, cutting edge or otherwise, is operating at capacity. But TSMC is not really critical for auto makers. The biggest ones are Infineon, NXP, Renesas, and ST Microelectronics for them.",
        "created_utc": 1633834477,
        "id": "hg255xe",
        "permalink": "/r/stocks/comments/q4tr4w/chinas_xi_vows_reunification_with_taiwan/hg255xe/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633863277.0
    }
]