[
    {
        "author": "NeResearcher878",
        "body": "I'm loading up.  IRNT is the next Crowdstrike $260  per share and Fortinet $290 per share in cybersecurity!!!",
        "created_utc": 1631888367,
        "id": "hd7kn03",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1631917167.0
    },
    {
        "author": "NeResearcher878",
        "body": "IRNT just went public.   It has been unnoticed until you guys started the gamma squeeze.   But it's actually undervalued.   It's reaching Crowdstrike and Fortinet prices faster than it's cybersecurity predecessors.",
        "created_utc": 1631891024,
        "id": "hd7qw9p",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1631919824.0
    },
    {
        "author": "The_Folkhero",
        "body": "I believe you gotta go with a basket of stocks approach in cybersecurity because there is no clear-cut winner apparent. I bought equal amounts of Crowdstrike, Palo Alto and Fortinet. Spread your risk.",
        "created_utc": 1632794024,
        "id": "hejm6oi",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1632822824.0
    },
    {
        "author": "NeResearcher878",
        "body": "After doing my research on IRNT as a company, I just bought the dip.  \n\nIt just went public and nobody noticed until you guys started the gamma squeeze which became a catalyst for it to reach Crowdstrike and Fortinet prices faster than anticipated. \n\n\nGamma squeeze or not IRNT as a company is actually undervalued.  Next week, gamma would be over and it's gonna fly!!!",
        "created_utc": 1631892421,
        "id": "hd7u9iy",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1631921221.0
    },
    {
        "author": "Mustache_of_Zeus",
        "body": "First tip, out of those options only trade American stocks. I would recommend FTNT and BLK",
        "created_utc": 1630790628,
        "id": "hbm4w1b",
        "score": 12,
        "subreddit": "stocks",
        "created": 1630819428.0
    },
    {
        "author": "TurboUltiman",
        "body": "Crwd, ftnt, zim, dac, Clf, stld, nue",
        "created_utc": 1630885442,
        "id": "hbqw02t",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1630914242.0
    },
    {
        "author": "abrownguyy",
        "body": "Sure! I’m not an expert, nor do i think I am right above all else with how I do things. I’m not a technical analyst, and I’ve only been investing for about 4 years (I am 26). Everyone’s a genius in a bull market anyway so I’m sure a monkey could’ve performed similarly anyway - but you asked so I’ll share. \n\n1) only invest in companies you use and enjoy\n2) only invest in companies who have forward thinking leaders with proven track records\n3) only invest in companies who are building products/services for the future and don’t base your investment on historical performance \n4) don’t buy meme stocks and no one on the internet has the answers I learned this the hard way and am bag holding stocks below. \n\nI did not lose money on any meme stock. I made a lot off the video game store - this is probably part of the reason I got over confident and started breaking my own principles. \n\nI lost money on picks made by people on the internet ($FUBO, $CRLBF, $APPN, $FLGT) \n\nA good example of this would be SQ. I bought SQ back in 2017 when I first started investing. I’ve used their product at the barber, at the coffee shop up the road, at a farmer market. I thought to myself. “Wow, a mobile phone credit card reader for any small business, I only use card so this just made my life a whole lot easier - who made this?!?” \n\nJack Dorsey obviously created twitter, and scaled one of the most popular social networks to billions of people and billions of dollars. I believed in him, and he’s a very…. “passionate” individual about the future. \n\nWith the rise in SMB’s (I work for a tech company that serves SMB’s and realized how easy it is to start a biz now a days, I realized that this little mobile credit card processing company was only just getting started, and I bought a couple dozen shares of $SQ (wish I had more money back then). It’s my 2’d best performer behind $PENN (who fits this mold as well). \n\nAgain, I know this is flawed, not-proven, and there are much better ways to go about investing. The 2020 bull run helped make me a ton of money and I’m very lucky in that sense that i invested in companies like $APPL, $SQ, $MSFT, $TSLA using these principles. Confirmation bias? 100%. But I’m gonna stick to it and hope it keeps working and gets me out of the hole I dug by taking the internet’s advice. \n\nA few stocks I’m currently interested in:\n$CRM, $MSP, $S, $FTNT",
        "created_utc": 1631453897,
        "id": "hck7nbp",
        "score": 9,
        "subreddit": "stocks",
        "created": 1631482697.0
    },
    {
        "author": "NeResearcher878",
        "body": "It's actually a legit awesome cybersecurity company.   IRNT  is currently undervalued and will go up to Crowdstrike and Fortinet prices regardless.",
        "created_utc": 1631900299,
        "id": "hd8d4xd",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1631929099.0
    },
    {
        "author": "rollodxb",
        "body": "because PANW and FTNT have better products",
        "created_utc": 1630636368,
        "id": "hbec5l3",
        "score": 7,
        "subreddit": "investing",
        "created": 1630665168.0
    },
    {
        "author": "mitttttch",
        "body": "Anyone have any insight on the relatively new Cybersecurity company IronNet? The CEO, Keith Alexander, has an extensive resume working in the NSA, DOD and Army Intelligence.\n\nAnyone think they have a chance to compete with say, Fortinet, Sophos, Symantec, Kaspersky, Crowdstrike, Zscaler, and other majors??\n\n\"Founded in 2014 by GEN (Ret.) Keith Alexander, IronNet Cybersecurity is a global cybersecurity leader that is transforming how organizations secure their networks by delivering the first-ever Collective Defense platform operating at scale. Employing a high number of former NSA cybersecurity operators with offensive and defensive cyber experience, IronNet integrates deep tradecraft knowledge into its industry-leading products to solve the most challenging cyber problems facing the world today.\"",
        "created_utc": 1631568921,
        "id": "hcqql4d",
        "score": 5,
        "subreddit": "stocks",
        "created": 1631597721.0
    },
    {
        "author": "marioistic",
        "body": "On top of all those you mentioned I like S, NLOK, CYBR, SAIL\n\nRPD is doing well and still pretty cheap to get in \n\nFTNT and NET are probably one of the most robust cybertech companies but they’ve had a huge run up recently",
        "created_utc": 1630623638,
        "id": "hbdl6ml",
        "score": 4,
        "subreddit": "investing",
        "created": 1630652438.0
    },
    {
        "author": "NeResearcher878",
        "body": "After doing my research on IRNT as a company,  I just got in.  It's going to reach Crowdstrike and Fortinet prices sooner than anticipated. $260",
        "created_utc": 1631890976,
        "id": "hd7qs4y",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631919776.0
    },
    {
        "author": "NeResearcher878",
        "body": "I bought in today! IRNT!!!🚀  Going up to bump off Crowdstrike and Fortinet!",
        "created_utc": 1631900368,
        "id": "hd8dauf",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631929168.0
    },
    {
        "author": "Due-Tip-4022",
        "body": "This is getting ridiculous. Why is it that all 3 times I bought FTNT this year, it tanks the next day or two? Seriously look at its graph and you can litterally pinpoint where I bought by looking for the peak before the biggest dips it has had. This has to be a simulation. It can't be possible that I can accurately predict every dip it has.",
        "created_utc": 1630512849,
        "id": "hb7bf9v",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630541649.0
    },
    {
        "author": "AICoderGamer",
        "body": "FTNT for sure. It is has skyrocketed in the past year and I feel it has plenty left in the tank. Dominating its field, lower costs than competition, and more advanced product lines like SDWAN.",
        "created_utc": 1630859433,
        "id": "hbpb8ew",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630888233.0
    },
    {
        "author": "NeResearcher878",
        "body": "After researching IRNT.  I just bought in.  Gamma squeeze or not, it is undervalued.   It just went public and no one was noticing until you guys did the Gamma squeeze.  Now, investors are noticing and it's going to reach Crowdstrike and Fortinet prices sooner than anticipated.  $260 per share.\n\nTheir financial report is solid with rising subscribers.",
        "created_utc": 1631891767,
        "id": "hd7soht",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631920567.0
    },
    {
        "author": "NeResearcher878",
        "body": "I'm in it for the long haul.   It's reaching Crowdstrike and Fortinet prices faster than previously expected.",
        "created_utc": 1631892489,
        "id": "hd7ufix",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631921289.0
    },
    {
        "author": "OilBerta",
        "body": "do a little research into technical analysis and buy momentum plays. You are not lookin to get a good price on a security you just want to ride the stocks that are trending higher. If the chart isnt up and to the right, then look else where. \n\nOptions only make sense if the premium isnt too outrageous. IV, Delta, ITM, all that must be understood before buying calls or puts.\n\nSome tickers that look good off hand are: INTU, PYPL, ABNB, GOOG, ETSY, SHOP, STM, NOW, CRM, SNOW, FTNT, ASO, YETI, COST, NTR, MS, SE, RBLX",
        "created_utc": 1632519815,
        "id": "he5642u",
        "score": 2,
        "subreddit": "stocks",
        "created": 1632548615.0
    },
    {
        "author": "kinderhooksurprise",
        "body": "crwd, ftnt, net, ddog, okta, and maybe irnt",
        "created_utc": 1632800669,
        "id": "hejzn83",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632829469.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "Damm these CLNE 9C 10/15 paying out since i picked the up on the friday dip, almost made me forgot i lost 50% of my portfolio on FTNT calls",
        "created_utc": 1631552080,
        "id": "hcplbny",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631580880.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "Hope so im bagholding MY FTNT 330C 10/15 70% down",
        "created_utc": 1631679219,
        "id": "hcwu8y1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631708019.0
    },
    {
        "author": "RightSideOfTheBase",
        "body": "FTNT is an unstoppable force as a stock and the company is fantastic as well. I'm still kicking myself for selling it.\n\nRapid7 owns the Metasploit tool. My understanding is that tool is a must have for everyone in that industry.\n\nCheckout the holdings in the HACK and BUG ETF's. You might find something more to your liking there.",
        "created_utc": 1630657990,
        "id": "hbf9mch",
        "score": 2,
        "subreddit": "investing",
        "created": 1630686790.0
    },
    {
        "author": "CoolIndependence2642",
        "body": "As a beginner, I suggest the FAANG stocks, Tesla, and other solid, long term winners. Look for stocks with “escalator” growth rather than “elevator” growth. Escalators tend to rise slower, but also fall slower. Elevators rise fast, but tend to fall fast as well. Over the last year I’ve done well with FTNT, YETI, CROX, HCA, NTLA, and Domino’s Pizza and Chipotle of all things.",
        "created_utc": 1631295279,
        "id": "hcc52ms",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631324079.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "Well my 80% of my portfolio is in FTNT calls and their down nearly 50% on the day, i have some CLNE calls so unless CLNE hit $9 today im bagholding options until expiriy",
        "created_utc": 1631541108,
        "id": "hcov9q4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631569908.0
    },
    {
        "author": "down_syndrome_sain",
        "body": "RUN $50C 10/15\n\nAMD $112C 10/1\n\nMRNA $395P 10/1\n\nFTNT $280P 10/15",
        "created_utc": 1632786797,
        "id": "hej6kbn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632815597.0
    },
    {
        "author": "msnf",
        "body": "FTNT, EPAM, RGEN and AVTR have all been up and to the right going on 6 months now and all dropped 3-5% today, despite each being from a different sector. I'm not sure yet if it's a buying opportunity or the end of the gravy train but I got my eyes on em.\n\nTechnically ASML fits this same pattern, but that's a long-term hold for me.",
        "created_utc": 1632789218,
        "id": "hejboj8",
        "score": 2,
        "subreddit": "stocks",
        "created": 1632818018.0
    },
    {
        "author": "Mayday-Flowers",
        "body": "Probably a better plan, yeah. Those 3x ETFs have burned me a few times though via churn, since Powell's face turned into a springboard for the indexes to bounce from.\n\nI look for high flyers now and spread a few long-dated puts between them. Currently eyeing $FTNT, it has a chart that looks like it's going to cliff-dive without a wingsuit, plus low IV, though it is in a favorable sector. Here's hoping we both do well\\~",
        "created_utc": 1630524276,
        "id": "hb83fkc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630553076.0
    },
    {
        "author": "UsefulHelicopter3063",
        "body": "Fortinet is the Toyota of their industry. Granted their product might be pretty buggy at times but the price they are selling the products and services more than make up for the initial buggyness.",
        "created_utc": 1630845296,
        "id": "hbohyfo",
        "score": 1,
        "subreddit": "investing",
        "created": 1630874096.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Don't forget CRWD NVDA and FTNT.",
        "created_utc": 1630892879,
        "id": "hbrb3sg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630921679.0
    },
    {
        "author": "Kay312010",
        "body": "MSFT\n\nFTNT\n\nTGT\n\nAPPL\n\nFB",
        "created_utc": 1631227450,
        "id": "hc8narj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631256250.0
    },
    {
        "author": "No_Sanity",
        "body": "I'm somehow up slightly today thanks to FTNT, MRVL, and AMD",
        "created_utc": 1633023056,
        "id": "hevhnfv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633051856.0
    },
    {
        "author": "rollodxb",
        "body": "no wonder FTNT is where it is now",
        "created_utc": 1630636331,
        "id": "hbec2vb",
        "score": 1,
        "subreddit": "investing",
        "created": 1630665131.0
    },
    {
        "author": "Kay312010",
        "body": " CROX\n\nMSFT\n\nFB\n\nAAPL\n\nFTNT\n\nFL \n\nTGT\n\nAMC\n\nSNAP\n\nYETI\n\nETSY",
        "created_utc": 1630896712,
        "id": "hbriqmj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630925512.0
    },
    {
        "author": "trickintown",
        "body": "But companies like PANW, S, FTNT are really overvalued\n\nUndervalued companies like CHKP have not come with proper products.. \n\nShitty of two position",
        "created_utc": 1631529927,
        "id": "hcoc777",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631558727.0
    },
    {
        "author": "Mammoth_Ad6110",
        "body": "Me, deep in with FTNT and BABA:  Wait, you guys are bubbling?",
        "created_utc": 1631548977,
        "id": "hcpdt54",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631577777.0
    },
    {
        "author": "NeResearcher878",
        "body": "I just bought in today.  Now that IRNT is getting noticed by big investors, it going to Crowdstrike and Fortinet prices faster than anticipated.",
        "created_utc": 1631893745,
        "id": "hd7xgqt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631922545.0
    },
    {
        "author": "NeResearcher878",
        "body": "I'm in it for the long haul.   IRNT is a solid undervalued stock on it's own.   It will reach Crowdstrike and Fortinet prices sooner than predicted.",
        "created_utc": 1631893629,
        "id": "hd7x6i2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631922429.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "I have no money for long dated options,i bagholding FTNT 330C 10/15 until break even or expiry and hope for best",
        "created_utc": 1632208709,
        "id": "hdoxz71",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632237509.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "Im holding my FTNT 10/15 330C out of spite too",
        "created_utc": 1632421389,
        "id": "hdzskgu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632450189.0
    },
    {
        "author": "Kay312010",
        "body": "FB\n\nMSFT\n\nFTNT\n\nTGT\n\nCOST",
        "created_utc": 1632708341,
        "id": "hefaerz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632737141.0
    },
    {
        "author": "TurboUltiman",
        "body": "140 to 280 in a year and your concerned about a 10% drop from the last er lol. Buying leaps on these quality tickers would get you rich more safely than taking crazy chances on memes. I’m 100% gme ape but ftnt leaps have made me almost as much in the last year than gme did during the Jan pump.",
        "created_utc": 1630906243,
        "id": "hbrzcit",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630935043.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "Leverage to the tits in 330C 10/15/21 FTNT calls and bought HUT shares",
        "created_utc": 1631162797,
        "id": "hc5bros",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631191597.0
    },
    {
        "author": "mistermc90",
        "body": "Can someone in the industry elaborate what is the problem concerning the checkpoint products in comparison to Fortinet and Palo Alto Networks?\n\nThanks in advance. (the more in depth the more thankful I am)",
        "created_utc": 1630687289,
        "id": "hbgrjfr",
        "score": 1,
        "subreddit": "investing",
        "created": 1630716089.0
    },
    {
        "author": "The_Goondocks",
        "body": "Also, Checkpoint is based out of Israel and literally every tiny decision has to go through the main office there. They don't like spending money on marketing programs, like at all. It was always like pulling teeth to get them to commit to anything. Reps were super nice though. Fortinet was committed to expanding and had it together with marketing when I worked with them before the pandemic began.",
        "created_utc": 1630677476,
        "id": "hbg40yq",
        "score": 1,
        "subreddit": "investing",
        "created": 1630706276.0
    },
    {
        "author": "JTTRad",
        "body": "Fortinet is my top holding and will continue to be.",
        "created_utc": 1630744724,
        "id": "hbjr777",
        "score": 1,
        "subreddit": "options",
        "created": 1630773524.0
    },
    {
        "author": "Individual_Error_428",
        "body": "Secret ticker suggestions:\n\n$ASO-safe and solid gains\n\n$FTNT-Fortnite’s brother in cybersecurity\n\n$DAC-tanker gang’s brother",
        "created_utc": 1632415968,
        "id": "hdzfdf4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632444768.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "Same 10 stocks??? down 70% on FTNT😎😎😎Also i maybe EU but im not a limped dick boomer😎😎",
        "created_utc": 1632497442,
        "id": "he3olv8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632526242.0
    },
    {
        "author": "PersianMG",
        "body": "Don't be scared to cut it if you just bought for meme status imo. I don't think it will do well short or long term. There are many better cyber sec stocks you could own instead imo like CRWD, FTNT, NET etc.",
        "created_utc": 1632664580,
        "id": "hechrbl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632693380.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "Im down 70% on FTNT 330C",
        "created_utc": 1632588267,
        "id": "he8m5bz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632617067.0
    },
    {
        "author": "UniqueAd7615",
        "body": "Just buy FTNT they’ve been crushing with no signs of slowing down.",
        "created_utc": 1630534074,
        "id": "hb8qdg9",
        "score": 0,
        "subreddit": "stocks",
        "created": 1630562874.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "My entire trader portfolio is in FTNT  330C 10/15/21 so if were not green tomorrow im screwed",
        "created_utc": 1631131209,
        "id": "hc3ld6c",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1631160009.0
    },
    {
        "author": "NeResearcher878",
        "body": "I'm loading up.  IRNT is the next Crowdstrike $260  per share and Fortinet $290 per share in cybersecurity!!!",
        "created_utc": 1631888458,
        "id": "hd7kuo4",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1631917258.0
    },
    {
        "author": "NeResearcher878",
        "body": "I'm loading up on IRNT.  IRNT is the next Crowdstrike $260  per share and Fortinet $290 per share in cybersecurity!!!\n\nWSB has been a catalyst on IRNT reaching $260 quickly.",
        "created_utc": 1631889115,
        "id": "hd7mdk9",
        "score": -6,
        "subreddit": "wallstreetbets",
        "created": 1631917915.0
    },
    {
        "author": "fwast",
        "body": "Probably a situation similar to IBM where other companies come up and apple didn't get with the times.",
        "created_utc": 1630544739,
        "id": "hb9cfav",
        "score": 687,
        "subreddit": "stocks",
        "created": 1630573539.0
    },
    {
        "author": "case31",
        "body": "He was trying to protect Microsoft’s interests because the Windows phone was still in development.  Apple’s decision to subsidize the phone with a cellular plan was very similar to Microsoft’s decision to license Windows to PC manufacturers. IBM laughed when Bill Gates presented that plan, but he knew he was right.",
        "created_utc": 1631192499,
        "id": "hc6d9zv",
        "score": 309,
        "subreddit": "StockMarket",
        "created": 1631221299.0
    },
    {
        "author": "ZhangtheGreat",
        "body": "Remember when IBM dominated computing? Pepperidge Farm remembers.",
        "created_utc": 1630894056,
        "id": "hbrdho4",
        "score": 104,
        "subreddit": "stocks",
        "created": 1630922856.0
    },
    {
        "author": "Elster-",
        "body": "I don’t think Apple will be at the top forever. No company stays at the top forever. \n\nAnother company comes along and will beat it. \n\nThere have been oil companies that people said ‘well we will always need oil, so they’ll always be up there’\n\nThere have been product companies like P&amp;G who own 90% of what you buy who you’d think would never be out of the top\n\nThere have been tech companies like Cisco &amp; IBM and people thought tech was here to stay, it was but someone better will always come along.\n\nWho knows what the next big market cap will come from.",
        "created_utc": 1630557436,
        "id": "hba1bog",
        "score": 61,
        "subreddit": "stocks",
        "created": 1630586236.0
    },
    {
        "author": "donm527",
        "body": "The “blue chips” of past... IBM, GE, CISCO, AOL, BlackBerry... they were blue chips because in their time they changed the world and set the path of progress in their areas. They didn’t fail... they just didn’t predict the next generation of tech or products and couldn’t keep up. IBM... they did pretty good if you see they started with typewriters and made the transition to computers. But Apple taking PCs to the consumer and using a GUI and mouse to make the average person be able to use one changed the world. Taking smartphones from a business only to the consumer with $20 data plan reachable to the average consumer... changed the world. While competitors laughed saying no one will spend that kind of money on it (Ballmer monkey boy) and others said no keyboard it won’t go far (Balckberry). Very tough to be able to lead for that long. Who knew a online bookstore would lead the world in cloud services??",
        "created_utc": 1630895251,
        "id": "hbrfv1j",
        "score": 55,
        "subreddit": "stocks",
        "created": 1630924051.0
    },
    {
        "author": "Wholesome_Stuff",
        "body": "NET seems like a difficult stock to rate. In the past few years cyber attacks have become more prevalent, and will continue to be. Microsoft, Google, Oracle, IBM, Apple and i'm sure plenty of others have partnered with them. Besides their PEG ratio is -11.28, out of the ones you listed this is the lowest by more than double. I.e. they are the best deal for future earnings.",
        "created_utc": 1630620710,
        "id": "hbdesmj",
        "score": 34,
        "subreddit": "investing",
        "created": 1630649510.0
    },
    {
        "author": "hendrix_srv",
        "body": "Every Balmer acquisition was written off as worthless.  Had they chosen someone other than Nadella to replace Balmer, MSFT might be with IBM.\n\nI have a database that tracks revenues of many companies back to 2000, and I can select any group of companies and plot the revenue chart.  My \"tech majors\" groups is an astounding chart, with AAPL coming from the bottom and charting a steep course to the top in 05-10, and IBM and ORCL climbing early on then arcing back into the basement.",
        "created_utc": 1630902660,
        "id": "hbrtpbt",
        "score": 31,
        "subreddit": "stocks",
        "created": 1630931460.0
    },
    {
        "author": "grizzlypatchadams",
        "body": "I’m pulling this from memory so could be wrong but I thought Gates only pitched IBM the licensing of Windows as a point for bargaining, he thought that was a concession he was planning to give but was pleasantly surprised they didn’t want to negotiate it.",
        "created_utc": 1631198665,
        "id": "hc6q9jt",
        "score": 26,
        "subreddit": "StockMarket",
        "created": 1631227465.0
    },
    {
        "author": "pissantz34",
        "body": "I'm not an Apple user, but I have owned their stock for years and it has made me a lot of money. IBM was huge but I've never seen a company have such devotion to the brand as Apple in my life. It could definitely be replaced just like any other company, but I think Apple has a great chance at still being #1 in 20 years.",
        "created_utc": 1630564041,
        "id": "hbab1fw",
        "score": 19,
        "subreddit": "stocks",
        "created": 1630592841.0
    },
    {
        "author": "Roger_Cockfoster",
        "body": "Remember when Pepperidge Farm dominated cookies? IBM remembers.",
        "created_utc": 1630909729,
        "id": "hbs4d3a",
        "score": 14,
        "subreddit": "stocks",
        "created": 1630938529.0
    },
    {
        "author": "joeroganthumbhead",
        "body": "How hyped up was IBM in comparison to apple? Were they ever #1 to the extent of apple?",
        "created_utc": 1630560684,
        "id": "hba6ep3",
        "score": 13,
        "subreddit": "stocks",
        "created": 1630589484.0
    },
    {
        "author": "dancinadventures",
        "body": "Moats need to be innovated as well. \n\nFor instance there was a time where one thought IBM and Nokia had impenetrable moats. \n\nJerusalem Steel used to be one of largest companies in USA. \n\nCoke’s moat was not that they were pharmaceutical cough syrup with cocaine. They evolved over time, faster than competitors. \n\nMoat is a misnomer. \n\nEven government isn’t a moat when revolutions have occurred left and right.",
        "created_utc": 1631471600,
        "id": "hcldiyp",
        "score": 11,
        "subreddit": "ValueInvesting",
        "created": 1631500400.0
    },
    {
        "author": "OG_L0c",
        "body": "IBM share price has barely moved since 1999. Are they still selling punch cards?",
        "created_utc": 1631578767,
        "id": "hcrby7g",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1631607567.0
    },
    {
        "author": "ShadowLiberal",
        "body": "IBM was so huge that 8 out of 10 programmers used to go work for IBM.\n\nIBM was so huge that they used to purposely overbid on jobs so that that their competition could win enough of them to keep IBM just under 80% of the market share. Because if they got any bigger they knew that the US government would probably try to break them up under anti-monopoly laws.\n\nSo yeah, a lot of people loved IBM, you practically had to use them at one point.",
        "created_utc": 1630594332,
        "id": "hbbmbrd",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630623132.0
    },
    {
        "author": "sublette313",
        "body": "I've never sold a single share and I could've gotten out at 40 moron. I've DCA'd on LEAPS expiring 2023 all fucking year. Anyone who buys and sells this company at this 22-26 range and thinks they're Gordon gecko are fucking morons.\n\nScalability has been proven time and time again much much more bullish than bearish. Amazon and IBM partnerships as well as others, they can deploy Foundry completely remotely without having any on-site engineers for products like Foundry for builders and many other versions. Their margins would look significantly better if they hadn't just gone on an absolute hiring tear by the way. They've dramatically increased hiring sales employees this year as they ramp up distribution which guess what? They're using the SBC to ensure this massive hiring they're doing is focused on the long term and is way better for shareholders than simply paying them in cash. Maybe if you had any idea what the company is actually doing you'd see right away that these bear cases are missing the entire point of how they're growing the company. Maybe if you'd actually listened to any of the last 3 earnings calls you'd realize everything you're saying makes no sense. \n\nBut you're intellectually dishonest and just want attention so you don't care about any of that 🤡🤡🤡\n\nThey're absurdly financially healthy and you truly don't understand business Financials if you think they're not. You're saying you don't like the multiple that the share trades at and acting like that relates to the financial prospects of the company itself. \n\nSbc is massively overhyped toward the bearish constantly taken out of context or misused to present a misleading case. It's not out of comparison with other growth or tech companies. So you either just hate growth companies or you aren't really valid for shitting on palantir.",
        "created_utc": 1630937764,
        "id": "hbt6utc",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1630966564.0
    },
    {
        "author": "Rymasq",
        "body": "people who said Tesla is an \"AI\" company probably don't work in tech. To put it bluntly, they are stupid. They don't even know what AI really is and that it is now everywhere, every company is technically an \"AI\" company. \n\nNow if Tesla has a substantially large amount of data on self driving, larger than any competitors, that is an asset that Tesla can absolutely sell. Until everyone else has that data, then the asset is worthless. \n\nOne thing that history has proven though is that getting somewhere first doesn't necessarily mean making the most amount of money. A great example of this is MySpace who was then usurped by Facebook a few years later. Those Wright brothers sure did make a ton of money by discovering flight..right? E.F Codd invented the relational database at IBM but Oracle sure does make a TON more money off it today.",
        "created_utc": 1631112441,
        "id": "hc2bx13",
        "score": 7,
        "subreddit": "stocks",
        "created": 1631141241.0
    },
    {
        "author": "preiser",
        "body": "ive been watching this the last 6 months or so as well. valuation is tasty and takeover target makes sense based on so many companies wanting to get into healthcare.   \n\n\nalso worth noting, the dogs of the dow strategy (investing in the 10 DOW components with lowest PE multiples) would include WBA. \n\nVZ also fits the dogs of dow mold but it has a good amount of debt. they also just bumped the divy up to 4.5%. other dogs of the dow based on PE for last year and their accompanying divy %\n\n\\-VZ (4.5% yield, 10.5% off 52 wk high)  \n\\-GS (1.22% yield, 2.25% off 52 wk high)\n\n\\-INTC (2.6%, yield, 21.87% off 52 wk high)\n\n\\-IBM (4.67% yield, 8.68% off 52 wk high)",
        "created_utc": 1631019283,
        "id": "hbxc5aq",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1631048083.0
    },
    {
        "author": "Ledovi",
        "body": "IBM, AT&amp;T",
        "created_utc": 1630905347,
        "id": "hbrxztz",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630934147.0
    },
    {
        "author": "fwk727",
        "body": "I avoid energy and cigarettes. That leaves IBM, which I've owned for years for the dividend and VZ which I like for the dividend.  In chemicals I prefer Dow to Lyondell. But I'm retired and dead money with a reliable income stream suits me. If you're younger, suggest you lean more to growth.",
        "created_utc": 1631124777,
        "id": "hc35oyf",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1631153577.0
    },
    {
        "author": "abrasiveteapot",
        "body": "There's a long list of companies who failed because of the desire to protect a legacy business despite obvious signs it was getting replaced. Xerox is a great one, but there's also Kodak and IBM (protected mainframes far too long before pivoting at 5secs to midnight), Nokia, Blackberry etc. \n\nAnd of course there's the situation right now with most legacy car manufacturers, Toyota in particular. \n\nThe problem with disruption is it happens fast, just ask Nokia. Or look at the number of cars on the road in 1906 vs 1912 (pretty sure that's the right dates, but if not there was a like 5 year period where cars went from a handful to tens of thousands to \"everywhere\" same as smartphones)",
        "created_utc": 1630570095,
        "id": "hbaieec",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630598895.0
    },
    {
        "author": "Guilty-Marzipan",
        "body": "Omg apple is literally ibm. Have they no self awareness? This whole thing seems like corporate stock footage",
        "created_utc": 1631641692,
        "id": "hcuhk78",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631670492.0
    },
    {
        "author": "Economy-Cup5465",
        "body": "It is extremely nuanced. \n\n\\&gt;The thesis is that Tesla is far ahead in its self-driving capabilities that other car makers just can't catch up. And because they already have cars on the road now, they are collecting more data which is making their lead wider.\n\nIt is my view that the FSD tech would be more of an open space. Most of these companies will start using third party companies, akin to how PC manufacturers used Windows from Microsoft instead of creating their own OS. Initially some will try their hand at the market with their own bespoke solution(like the wild west days of 80's when we had commodores and sinclair spectrums). However after some time their will be a standardization(IBM PC). \n\nAt best I can see Tesla becoming like the Macintoshes:  \nTesla: Proprietary full self driving system:: Macintoshes : Proprietary OSes\n\n\\&gt;If any company is way ahead in self-driving, it's actually Waymo, not Tesla. They just launched a self-driving taxi service in San Francisco, a dense city with weird roads and many pedestrians.  \nTesla is boasting about FSD(which is between a very good cruise and a poor self driver). The key difference between waymo and tesla is that tesla is heavily reliant on an AI based system, whereas waymo(which does use AI) is heavily dependent on Geolocation and real time data.\n\n\\]&gt;The thesis is that Tesla is far ahead in its self-driving capabilities that other car makers just can't catch up. And because they already have cars on the road now, they are collecting more data which is making their lead wider.\n\nRun away from any person who says that leads are insurmountable. Just look at Intel. Went from being a market leader to being overtaken by near bankrupt competitors(See: AMD)",
        "created_utc": 1631112666,
        "id": "hc2cgdo",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631141466.0
    },
    {
        "author": "kok823",
        "body": "Yes, but you need at least a plausible theory as to why Apple would be on a MAJOR downtrend. It’s silly to say because we had examples of GE, IBM, etc. therefore the same thing would happen to Apple.",
        "created_utc": 1630553247,
        "id": "hb9tt5p",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630582047.0
    },
    {
        "author": "Traditional-Leader54",
        "body": "If you don’t need the royalty payments now I would suggest looking into a retirement account and just let your money grow over the next 40 years. In the US these are tax deferred until age 55 or 62 depending on the plan. \n\nIf you want the payments now I’d look into dividend stocks. They are stocks that pay you money (I think quarterly) based on how many shares you have and how much money the company made that quarter. Think CocaCola, Microsoft, IBM, Apple, etc. Companies that earn consistently and aren’t going anywhere. This is less risky than investing in a startup company for a true royalty that only lasts if the company does. \n\nEither way talk to a stock broker for more info.",
        "created_utc": 1630507542,
        "id": "hb6yj1d",
        "score": 2,
        "subreddit": "investing",
        "created": 1630536342.0
    },
    {
        "author": "rock00888",
        "body": "I don't think technology is particularly high risk or anything. It's not crazy speculative or anything. But what happens if a chip that consumes basically zero power comes out of a start up tomorrow? Or what happens if US anti trust enforcement kicks up? Particularly in tech things can change quickly. Not generally for the sector, but for individual companies. Xerox, IBM, et c. all saw huge swings. Any single sector carries it's own risk. \n\nI don't think tech is going anywhere. I don't see a way tech changes radically anytime soon, but it's the radical changes we don't see coming that do the most damage.",
        "created_utc": 1630538009,
        "id": "hb8ydrg",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630566809.0
    },
    {
        "author": "merlinsbeers",
        "body": "IBM made probably the biggest mistake in business history by giving Microsoft and Intel the ability to make computers on the PC architecture without IBM involvement.\n\nThey could have owned that whole ecosystem and leveraged their incredible brand recognition to attract the talent that made it happen.\n\nBut, if they had, IBM management would have overcontrolled it so we'd probably all be using Macs and talking about PC only in conversations with words like Amiga, Imsai, and Heathkit.",
        "created_utc": 1630940177,
        "id": "hbtc2gd",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630968977.0
    },
    {
        "author": "get-the-lobster",
        "body": "So qantum Computing will stay with ibm?",
        "created_utc": 1630942298,
        "id": "hbtgwg7",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630971098.0
    },
    {
        "author": "sparkplug49",
        "body": "True. If the promise is realized (which again is still a hurdle), it won't be just those, any high strength, conductive or thermal manufacturing could benefit. So the investment gains would be in those that can produce it for those processes. Computers had impacts on a lot of industries but investing in IBM, Microsoft etc. would have been more effective. (I'm not suggesting graphene will have that sized impact)",
        "created_utc": 1631074892,
        "id": "hc0s86k",
        "score": 2,
        "subreddit": "investing",
        "created": 1631103692.0
    },
    {
        "author": "Thereg99",
        "body": "okay open a new account at the same brokerage.  Put or transfer money into the new account.  Buy and sell fresh.  Put the stocks you have in the old account that are in green and you want to monitor on the watch list so you can follow them OR if they are big stocks like Apple/IBM types then sell them on the old account.  Rebuy them on the new account and take at most a very very small lost in the transfer though personally I'd do the watch list thing until the time comes you make the decision to sell the green stocks.  Then only go into the old account maybe once a month just for a peek and move on.",
        "created_utc": 1631651483,
        "id": "hcv69bw",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1631680283.0
    },
    {
        "author": "H3RB28",
        "body": "BlackBerry. IBM, Pets.com. there were a ton.",
        "created_utc": 1630951335,
        "id": "hbu1rwd",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630980135.0
    },
    {
        "author": "Far-Ad-6825",
        "body": "After watching that...I think I'm gonna buy some IBM.",
        "created_utc": 1630815217,
        "id": "hbng0g1",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1630844017.0
    },
    {
        "author": "RK5610",
        "body": "IBM is relatively good dividend paying stock and is not pricey!",
        "created_utc": 1630714326,
        "id": "hbif6sf",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630743126.0
    },
    {
        "author": "MrHeavyRunner",
        "body": "And so far they delivered. Look at the graph. Also saying \"AI/Machine learning is a niche technology\" - lol you must be kidding. There are so many uses, some of them are waiting to be discovered. IBM is old dinosaur, not much thread from this side. Intel also not involved here. AMD is starting, but it will take time. Also NVDA has all the know-how over many years, others do not. Money cannot buy everything...",
        "created_utc": 1631206542,
        "id": "hc79037",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631235342.0
    },
    {
        "author": "Kekbar",
        "body": "I sell leaps on apple, microsoft, dicks, exxon, ibm since I've accumulated several hundred of all those I'm happy with a 35% gain for the following year on the first 3 and the last 2 are dividend stocks that don't really move. Usually its more profitable but more work to sell 1-4 week out of money covered calls over and over but a leap lets you immediately raise several thousand. If any part of your strategy involves holding stock rather than options get it to multiples of 100 and you can leverage it much more effectively",
        "created_utc": 1631583124,
        "id": "hcrli5f",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631611924.0
    },
    {
        "author": "Snafupka",
        "body": "I have a Fidelity account, which I manage on my own that my bank is not even aware of. I've had some hits (NVDA, MSFT, COST, GME, IBM that have outgained the Index fund I'm also in) and also some misses (DIS, GE, CNK, WKHS).\n\nI still plan to keep my bank for Checking Account and such. It just seemed fishy that they reached out to me about this all of a sudden when I have had the funds for at least 6 months now",
        "created_utc": 1631810077,
        "id": "hd3i4qs",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631838877.0
    },
    {
        "author": "Green_Lantern_4vr",
        "body": "In terms of the other fintech you mention ya they aren’t great. I am Canadian so cannot use them to test out really. If SOFI is not that smooth that sucks because i would have thought they would have been solid.\n\n\nI had x-tech terminology. Insurance-tech (insur tech) and what not. Food tech. Agri tech. \n\n\nYou’re just a company that is not building a foundry or lumber mill lol. Chill out. \n\n\nLike the insurance tech companies. No not really anything special. Just selling insurance online and using an algo to give you some better data points. \n\n\nIf anything all of this fintech etc garbage to me is indicative of the big data companies being supreme that can come in and analyze data like PLTR. Who else can do this sort of thing and it’s their main core? \n\n\nDon’t say IBM. They blow hard.",
        "created_utc": 1630516953,
        "id": "hb7ljlq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630545753.0
    },
    {
        "author": "thetagodfather",
        "body": "No, most of the posts in here don’t understand blue chips\n\nEven big techs that still RAKE in cash are being mentioned- \n\nIBM, CSCO\n\nIBM’s 2020 revenue was almost $80 billion \n\nCSCO 2020 revenue $50 billion \n\nJust cause they aren’t in growth mode doesn’t mean they are down and out\n\nA better example would have been Sears",
        "created_utc": 1630911725,
        "id": "hbs702y",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630940525.0
    },
    {
        "author": "SnipahShot",
        "body": "Your comments seem like you are a 5 year old.\n\n\"Do you really think the super smart people they hire are morons that will sit around and let AAPL go under?\"\n\nHundreds of companies had \"super smart\" people.  \nAre you familiar with Nokia? BlockBuster? BlackBerry? IBM?  \nHeck, even Intel has been trading downwards for almost 6 months.\n\nIt doesn't matter how many \"super smart people\" a company has, if a company fails to innovate and expand their business they will start going down.  \nThis is not the case for Apple, but it is not because of \"super smart people\", it is because they still seem to innovate and expand.\n\nAlso, do you even know what exactly Apple are planning on doing in the healthcare and EV? Who their competition is in each of these fields?",
        "created_utc": 1630869503,
        "id": "hbpxuzt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630898303.0
    },
    {
        "author": "No-Performance-1943",
        "body": "Buy IBM, TSM or XOM. 100 shares  of any will get you a third to almost half way there.  And there sought of cheap for the dividend as I'm sure others will have better plays.",
        "created_utc": 1630929558,
        "id": "hbss4ix",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630958358.0
    },
    {
        "author": "sublette313",
        "body": "I cannot disagree more. Their executives literally have explicitly stated that they can deploy Foundry fully remotely and don't require remote engineers to distribute their product to medium or small size clients in the last month they have outright stated this. Things like releasing announcements of Palantir foundry for builders or \"startups\" is excellent proof of this.\n\nTheir partnerships with Amazon and IBM are literally just ways of Foundry on apollo AI framework being sold by those companies packaged together with other products to sell to other companies. That's 100% scaleable and it's why their commercial clients are increasing quarter to quarter domestically and internationally. \n\nThey have distribution channels doing their work for them and are objectively not a consultancy company in Foundry. They have shown ample evidence that Foundry works out if the box just fine for enough medium and small size clients to be scalable and I think soon we will see proof of this even for large clients. \n\nThere's zero evidence that will have to slow down and as their TAM hears their brand and learns about their product. There's zero evidence that they are facing problems with scalability. However there has been consistent evidence all year that they have entirely solved it or they have continually gone far in the right direction. They increased expenses because of hiring and releasing Foundry for free during palantir unlock at the beginning of the year but their margins would've already improved if they weren't so focused on growth.",
        "created_utc": 1630952273,
        "id": "hbu3xc0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630981073.0
    },
    {
        "author": "Espinita_Boricua",
        "body": "IBM; KMB &amp; MMM - love dividend stocks...",
        "created_utc": 1631154397,
        "id": "hc4xdvi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631183197.0
    },
    {
        "author": "shortyafter",
        "body": "That's true.  Hindsight does wonders, though.  The whole thesis for holding IBM would be as a conservative investment.",
        "created_utc": 1631200223,
        "id": "hc6tuj5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631229023.0
    },
    {
        "author": "TheNewUsed",
        "body": "I think these are both dwindling companies, but [IBM has some growth opportunities](https://viz.wiijii.co/chart/?id=-Mjf-98BbUYCa6m3v_Yy) with their acquisition of RedHat, integrations with Palantir and Watson AI. For these reasons, I like IBM better.",
        "created_utc": 1631735394,
        "id": "hcznr5n",
        "score": 1,
        "subreddit": "investing_discussion",
        "created": 1631764194.0
    },
    {
        "author": "Cloud88888",
        "body": "Dividend is a false sense of security.  I was dividend investor. I was brain washed. I know how it feels to be dividend investor. 1% to 3% yield blinded our eyes and limit our return to 15% to 20,% per year where growth stocks offer 30%+ or more per year.\nThe market values revenue growth rate most.\nAs they grow bigger, they become more valuable!\nLook at IBM, low valuation despite its making tons of profit because the revenue is trending downward.",
        "created_utc": 1631803674,
        "id": "hd328zv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631832474.0
    },
    {
        "author": "RedditSucksDickNow",
        "body": "Did you know IBM made tabulating equipment to help Nazis exterminate Jews?",
        "created_utc": 1631547825,
        "id": "hcpb0jm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631576625.0
    },
    {
        "author": "anonyymi",
        "body": "Is there anything more boomer than CSCO? Besides IBM...",
        "created_utc": 1631646424,
        "id": "hcutggq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631675224.0
    },
    {
        "author": "therealist11",
        "body": "Cannot recommend stocks as I am not a financial advisor. Just doing my own research. But here is everything that I own. \n\nETF - SCHD\n\nStocks - XOM, PFE, PFG, ED, APAM, ABBV, VZ, KO, CSCO, CVS, NUE, ADM, WM, GILD, JPM, QCOM, GPC, AAPL, MSFT, TGT, PG, MMM, EMR, TROW, IBM, JNJ, AVGO.",
        "created_utc": 1630710710,
        "id": "hbi81wp",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630739510.0
    },
    {
        "author": "StarSwitch",
        "body": "Lmao IBM management couldn't effectively run a car wash at this point",
        "created_utc": 1630517330,
        "id": "hb7mh7o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630546130.0
    },
    {
        "author": "es_cl",
        "body": "&gt; There have been tech companies like Cisco &amp; IBM and people thought tech was here to stay, it was but someone better will always come along.\n\nI think we’re all waiting for that *next brand of technology* and I’m not sure if anybody knows what that is. The Internet of Things had a bit of buzz but then I think people realize that a smartwatch isn’t as a necessity as a smartphone. Nothing has surpassed the smartphone yet and AAPL is still king of the smartphone, at least in the US.",
        "created_utc": 1630588913,
        "id": "hbb9tbh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630617713.0
    },
    {
        "author": "Lyrolepis",
        "body": "The problem is that ten years ago, when your backtest starts, Tesla for example *was* a relatively new company, and it was not at all obvious - except perhaps to some domain experts, possibly, but I'm doubtful - that it would have been so successful. \n\n&gt; If you don’t feel that the market leaders are going to provide good returns moving forward (which is pretty ridiculous to think)\n\nIf it was so obvious that TSLA and the others were going to keep growing (let alone as quickly as they have), their current price would already reflect this (just as the fact that TSLA had a relatively low price ten years ago reflected the fact that it was a relatively risky investment then). \n\nRemember, there was a time IBM was a \"market leader\" too, and a wildly successful one too (not the only possible example, only the first one that came to my mind). \n\nNote, I am not saying that the companies you selected are not going to be successful in the future - for all I know, they could well be. \n\nI'm not even saying that you should not do that: as you wrote, it's just one euro per day, even in a worst case scenario that's not something that is likely to ruin you (if it *is*, you have bigger worries than investing). But I'm saying that I would not expect your backtest to give reliable estimates on the return of your investment.",
        "created_utc": 1631167906,
        "id": "hc5inec",
        "score": 1,
        "subreddit": "investing",
        "created": 1631196706.0
    },
    {
        "author": "Jamber_Jamber",
        "body": "Ok, I'm gonna ask it - why did IBM grow so much in May to June, and now die and flounder? All 6 month calls actually turned out worthless",
        "created_utc": 1631038135,
        "id": "hbyjs25",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631066935.0
    },
    {
        "author": "MadeTheAccountForWSB",
        "body": "Yeah I had to read over it a few times aswell :P  \n\n\nWhats the definition for a commercial grade system though? From what I can tell, only \"commercial\" providers are calling their systems that. (Even though this is somewhat misleading). I think what IonQ is trying to stress with that is that they are having the commercial/university crossover on site. If you know of a lab that has an IBM or HON QC on site, I would be wrong though.",
        "created_utc": 1631111113,
        "id": "hc28t8x",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1631139913.0
    },
    {
        "author": "donquixote2u",
        "body": "haha ok how about IBM, NCR, YAHOO, .....",
        "created_utc": 1631165200,
        "id": "hc5f65p",
        "score": 1,
        "subreddit": "investing",
        "created": 1631194000.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "Nope, I'm reading it in Firefox on a linux desktop.\n\nHaving lots of users doesn't matter. Just like, chrome having lots of users doesn't tell you which is more popular in a certain industry. More people using phones for internet than full computers also doesn't help tell you what people use at work.\n\nCloud services are only profitable in the business to business uses. Businesses using google cloud are more likely to be doing so because they have small needs, they're not spending money on network services. Businesses who have core business \"in the cloud\" are using AWS, Microsoft, or IBM. Google can't really tap into that business, because their history of cancelling services means that nobody builds their core business on top of google services. It would be a completely insane thing to do.\n\nAutonomous driving is snake oil, because they're using trained AI. That's a dead end for this use case, because what happens when the Dept. of Transportation tells you, \"In XYZ situation, you need to do A B and C and never L M or N.\" You can't! You don't even know how your software really works with a trained AI. It takes a long time to make small changes. It will never be more than a type of cruise control, until companies bite the bullet and put the programming hours into expert systems. (Source: day job includes writing robotics firmware)",
        "created_utc": 1631519407,
        "id": "hco0kir",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1631548207.0
    },
    {
        "author": "proteansybarite",
        "body": "Over 1 billion shares outstanding. If it went to $100 a share it’d be on par with IBM, Boeing, and other large cap companies. Has it really got the juice to stand next to the big boiz?",
        "created_utc": 1631634610,
        "id": "hctztt3",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1631663410.0
    },
    {
        "author": "lib3rty47",
        "body": "What are your thoughts on BB partnering with Microsoft (office 365)?\nCurrent partnerships are Amazon, Baidu, IBM and now Microsoft.",
        "created_utc": 1631216049,
        "id": "hc7w25i",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1631244849.0
    },
    {
        "author": "TreefingerX",
        "body": "or IBM",
        "created_utc": 1631356603,
        "id": "hcf5k61",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1631385403.0
    },
    {
        "author": "trickintown",
        "body": "IF….. and a very big if……….\nIBM after the Kyndryl spinoff gets a fair valuation.",
        "created_utc": 1631373596,
        "id": "hcfz6l6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631402396.0
    },
    {
        "author": "K2Mok",
        "body": "Ask me again in 5 to 10 years time and I hope I’ll be able to say IBM. \n\nIt definitely divides opinion and has been out of favour with plenty of investors for some time, question is can it return to being a strong tech growth company. Time will tell…",
        "created_utc": 1631680093,
        "id": "hcwvqkb",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1631708893.0
    },
    {
        "author": "luisdanielmesa",
        "body": "I have a lot of O, AGNC and NYMT. Those companies pay for my rent and services. They have room for growth as well, in my opinion.\n\nI also have the usual MSFT, AAPL, INTC, IBM... but the yields of the first 3 are my main dividend income...",
        "created_utc": 1631808922,
        "id": "hd3f9me",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1631837722.0
    },
    {
        "author": "Zurkarak",
        "body": "Everybody says they won’t because IBM, GE, bla bla bla bla.\n\nBut fuck, this big tech companies seem to cover many industries and want to cover more. Look at apple and the so called apple car or FB and all the VR shit they are developing.\n\n\nWhat if in 20 years they rule the world like in those dystopian movies.",
        "created_utc": 1630587074,
        "id": "hbb60ds",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630615874.0
    },
    {
        "author": "shortyafter",
        "body": "You don't have anything like Tesla or ARK funds, which is good.  I'm not deeply familiar with most of these companies, so I don't know what their revenue streams or growth prospects look like.  What I can say is that a lot of those names have been trading very high lately... AMD, Nvidia, TSM, ASML, etc. Those companies in particular all seem to have bright futures, but if there is any significant correction in tech stocks, you're very exposed, especially if you bought recently at high valuations.  You'll have very little margin of safety.\n\nAnd if there's any broader economic disruption, it's possible that not all of these companies make it out safe and sound, or at least as healthy as you'd like to seem them given current valuations.\n\nFor example, even good companies like Cisco didn't make it out in one piece from the dot-com bubble.  And old industry leaders like IBM and Intel have gotten hammered in the past two decades, while Microsoft made something of a surprise comeback after being declared dead around 2012.\n\nThe point is that if you've bought growth stories, that's OK, but it seems your whole portfolio is growth stories.  It's forward-looking.  Which is the idea, in a way, but IMO you want at least some of your portfolio dedicated to something that is solid in the present, and doesn't rely on a growth story in order to generate or even maintain returns.  The benefit of an ETF is you get a bit of everything, and even QQQ is quite diversified compared to your portfolio.  \n\nI'm new but this is my understanding of things.  I hope it made sense.",
        "created_utc": 1630586622,
        "id": "hbb54en",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630615422.0
    },
    {
        "author": "trickintown",
        "body": "IBM has a shit to become relevant after the spin off",
        "created_utc": 1630894347,
        "id": "hbre2u7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630923147.0
    },
    {
        "author": "metallica11",
        "body": "Spyyy oh oh oh treasury bonds oh oh ohh ibm oh ohh Berkshire *beats off faster*…ohh..mortgage backed securities ohh ohhh Perkins senior Citizen discounts ohh OH OMG HERE I COME",
        "created_utc": 1630944546,
        "id": "hbtm3ww",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630973346.0
    },
    {
        "author": "equinoxxxx1",
        "body": "What about DB2 from IBM.  I’ve heard this is good",
        "created_utc": 1630845935,
        "id": "hboiz4y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630874735.0
    },
    {
        "author": "captainthepuggle",
        "body": "Yeah it’s a good question and I should’ve clarified. Each of the 13 national quantum centers have a leading national labs, several partner institutions (universities) and then at least 3-4 industry (commercial) partners. \n\nSo commercial partners are involved with every quantum center as far as I’ve seen. \n\nFor example, Q-NEXT at Argonne is partnered with industry partners IBM, Intel, Boeing, Verizon and ColdQuanta to name a few. \n\nQSA (Berkeley) is partnered with Google, IBM and QED-C. \n\nSQMS (Fermilab) is partnered with Rigetti, Lockheed Martin, Janis and Goldman Sachs.\n\nC2QA (Brookhaven) has IBM mainly, and then nearly all the Ivy League schools. \n\nIt goes on.",
        "created_utc": 1631113531,
        "id": "hc2eijw",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1631142331.0
    },
    {
        "author": "BroteinPR",
        "body": "I’d argue your point is correct but AI isn’t going to be a Tesla-only thing.\n\nAmazon, Google, IBM are all advancing in artificial intelligence and machine learning (AI/ML) at a pretty rapid pace and self-driving capabilities will only be a small fraction of what AI can do.\n\nI can’t tell if this entire thread is full of Tesla fanboys or people the genuinely appreciate the complexity of the AI space but let’s not kid ourselves into thinking Tesla is going to have a lead forever. That’s disingenuous.",
        "created_utc": 1631122809,
        "id": "hc30wf7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631151609.0
    },
    {
        "author": "flobbley",
        "body": "Dividends reinvested, IBM returned 2.65% per year from March 2015 to today, in comparison VOO returned 15% per year (dividends reinvested) in the same time period. $10,000 in IBM in March 2015 would result in $11,800 today (it is worth noting that $10,000 in 2015 is worth $11,500 today, so a net gain of $300 when accounting for inflation), $10,000 in VOO would result in $24,800 today. *With the benefit of hindsight, holding IBM over that time period was a bad idea.",
        "created_utc": 1631200157,
        "id": "hc6tp3p",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631228957.0
    },
    {
        "author": "majnak",
        "body": "Missing some high class DDs.\n\nHere is mine: IBM, because the seem to do some stuff with quantum computers (leaps)",
        "created_utc": 1631120546,
        "id": "hc2vdvs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631149346.0
    },
    {
        "author": "krulp",
        "body": "People forget that before Ipod apple had been around for 24 years. It's wasn't a huge growth story to start off with. Companies to its competitors Microsoft and IBM, it did very poorly in the 90s.\n\n The true turning point of apple was the release of the iPod in 2001 which was a completely new product stream from before, which was just desktop computers.\n\nIf someone had advised selling apple stock in 1997, after flop which was the iMac, I don't think you could blame them.",
        "created_utc": 1631248211,
        "id": "hc9vsxi",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1631277011.0
    },
    {
        "author": "badgebruce",
        "body": "IBM",
        "created_utc": 1631218593,
        "id": "hc82c4t",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631247393.0
    },
    {
        "author": "badgebruce",
        "body": "\"Morgan Stanley's Keith Weiss sees another 10%-plus increase just ahead, a move that would push the yield on the software giant's shares to about 0.8%.\"\n\nIBM dividend 4.8%",
        "created_utc": 1631632219,
        "id": "hctty8k",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631661019.0
    },
    {
        "author": "Csula6",
        "body": "I have both shares of ATT and IBM. I'm happy with the dividends, but they're apparently loser stocks.\n\nA crash is coming. I'm not buying Apple now.",
        "created_utc": 1631770502,
        "id": "hd1ojv7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631799302.0
    },
    {
        "author": "hahdbdidndkdi",
        "body": "Ibm says hello.\n\nThey definitely are not.",
        "created_utc": 1630552988,
        "id": "hb9tbcq",
        "score": 0,
        "subreddit": "stocks",
        "created": 1630581788.0
    },
    {
        "author": "LackAccomplishe",
        "body": "It's legacy software company vs sexy software company. Those are ugly in EU. It's something akin to IBM but they're priced as shit.",
        "created_utc": 1630593037,
        "id": "hbbj9ut",
        "score": 0,
        "subreddit": "stocks",
        "created": 1630621837.0
    },
    {
        "author": "meowman3000",
        "body": "Sure, so its effectively IBM.  They can buy what they want.\n\nIts too bad they didnt have all those Cybersecurity companies before they lost their source code to Solarwinds.",
        "created_utc": 1631343289,
        "id": "hceqj4p",
        "score": -1,
        "subreddit": "stocks",
        "created": 1631372089.0
    },
    {
        "author": "metallica11",
        "body": "Found the boomer. \n\nLet me guess, PLTR is “just a bunch of kids trying to make software and ai is just a gimmick, IBM will take over”",
        "created_utc": 1630848677,
        "id": "hbons19",
        "score": -2,
        "subreddit": "stocks",
        "created": 1630877477.0
    },
    {
        "author": "chanudel",
        "body": "IBM",
        "created_utc": 1631250327,
        "id": "hc9z865",
        "score": -4,
        "subreddit": "StockMarket",
        "created": 1631279127.0
    },
    {
        "author": "tsimtsimtsim",
        "body": "People said the same about Intel and smartphones, and we all know how that went...",
        "created_utc": 1630546680,
        "id": "hb9go2g",
        "score": 140,
        "subreddit": "stocks",
        "created": 1630575480.0
    },
    {
        "author": "crepeblanket",
        "body": "What was the news about Intel delaying their govt deliveries so they bought some AMD and NVIDIA chips while waiting for Intel to come through? Intel being the defacto govt chip supplier doesn’t sound like an absolutely sure thing long term",
        "created_utc": 1630765009,
        "id": "hbkk4ay",
        "score": 34,
        "subreddit": "investing",
        "created": 1630793809.0
    },
    {
        "author": "jubothecat",
        "body": "Intel said it was going to build the world's fastest super computer like 10 years ago. Now, they were supposed to deliver it years ago, and they still don't have the technology to make what they said they would. Even if released today it would now only be like the 3rd fastest because they waited too long.\nTldr: even if Intel has these new government contracts, they are so far behind that they have a lot longer of a journey to be the best chip maker than people think (most laymen don't even know AMD is better right now).",
        "created_utc": 1630765482,
        "id": "hbkl4bs",
        "score": 28,
        "subreddit": "investing",
        "created": 1630794282.0
    },
    {
        "author": "Bamstradamus",
        "body": "DDR5 news might provide a pop, but they would still have to sell the memory.  I have said it over and over on CRSR posts, this chip shortage is not ending any time soon, the vast majority of people are still waiting on GPU's to upgrade anything, especially since at higher resolutions the bottleneck moves from the CPU to the GPU, you can run 4k60 on a first gen Ryzen as long as you have a GPU capable of outputting the frames.\n\nAdd to that historically the first set of chips on a new DDR is typically slower then the previous gens top tier, the fact all RAM is essentially the same since their are only 3 major manufacturers and everyone just repackages those chips, GSkill probably outbidding everyone else for \"the good chip\" at the start again *seriously did any of you even build a Ryzen system, Corsair had like 4 compatible sku's for the entire 300 series chipsets life, Gskill got all the B-die*\nand the fact we don't have any real world specs to work with yet I don't know anyone chomping at the bit for the DDR5 release.\n\nI can see the news drop leading to a pop, I do not see DDR5 sales making an actual contribution to value until the NEXT set of chipsets come from AMD/Intel.",
        "created_utc": 1631207033,
        "id": "hc7a6r0",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1631235833.0
    },
    {
        "author": "Not_FinancialAdvice",
        "body": "&gt; That's because Intel mobile chips were always power hungry. They couldn't get a day standby time or whatever horrible battery life it was. \n\nThe Intel PXA270 XScale processor (which was an ARM implementation) in my old Palm Treo 650 gave me 2-3 days of battery life. They sold the XScale IP to Marvell later on.",
        "created_utc": 1630560235,
        "id": "hba5qyf",
        "score": 16,
        "subreddit": "stocks",
        "created": 1630589035.0
    },
    {
        "author": "ra__account",
        "body": "See the recent discussion that we're still paying baggage fees that were markets as temporary after 9/11. If there's limited enough suppliers (like the AMD/Intel/NVidia trio), they can keep prices up without crossing the line of overtly colluding. Creating and manufacturing a powerful CPU is very costly and the only edge players like Apple have no interest in driving prices down.",
        "created_utc": 1630777573,
        "id": "hblc3s2",
        "score": 15,
        "subreddit": "investing",
        "created": 1630806373.0
    },
    {
        "author": "senecadocet1123",
        "body": "Baba, Tencent and Intel make up for 50% of my portfolio",
        "created_utc": 1631192236,
        "id": "hc6csed",
        "score": 11,
        "subreddit": "stocks",
        "created": 1631221036.0
    },
    {
        "author": "nwdogr",
        "body": "I know Intel has issues but I find it interesting that it has several times the revenue and operating income of NVDA but less than half the market cap. NVDA's got a *lot* of success priced in.",
        "created_utc": 1631193331,
        "id": "hc6etqm",
        "score": 10,
        "subreddit": "stocks",
        "created": 1631222131.0
    },
    {
        "author": "Adept-Investing",
        "body": "Intel",
        "created_utc": 1630721175,
        "id": "hbisizr",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1630749975.0
    },
    {
        "author": "Myleftarm",
        "body": "The post was about failed companies and Intel is a terrible example of one.",
        "created_utc": 1630896615,
        "id": "hbrijqi",
        "score": 10,
        "subreddit": "stocks",
        "created": 1630925415.0
    },
    {
        "author": "RobotArtichoke",
        "body": "INTC is such a boomer company. How did I ever get sucked into that pile of shit when everyone here was telling me to buy AMD. Sometimes you have to admit defeat.",
        "created_utc": 1630685966,
        "id": "hbgob55",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1630714766.0
    },
    {
        "author": "pasta4u",
        "body": "There are plenty of states that can. Intel has plants in New York and Texas i believe. \n\nYou can remediate the pollution  with proper processes.",
        "created_utc": 1630991261,
        "id": "hbwb8cu",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1631020061.0
    },
    {
        "author": "bigred91224",
        "body": "INTC is soo tempting right now given its P/E under 12.  \n  \nI really think AMD will replace Intel as the top CPU manufacturer, but Intel just seems *very* undervalued right now.",
        "created_utc": 1631207012,
        "id": "hc7a4yz",
        "score": 9,
        "subreddit": "stocks",
        "created": 1631235812.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "https://www.tomshardware.com/news/intel-ice-lake-inefficient-for-cloudflare\n\nNET chooses AMD over INTC for new processors",
        "created_utc": 1630515542,
        "id": "hb7i3n8",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630544342.0
    },
    {
        "author": "Jaypalm",
        "body": "ARM doesn’t make chips. Neither does AMD. ARM is an architecture, like x86. It’s an IP company. AMD designs and sells CPUs. As the underdog in the desktop CPU market they would be hurting themselves to collude with Intel when what they’re actually doing is making better products and undercutting Intel’s prices. I’m not saying there isn’t market collusion, but your arguments will have more merit if you actually know what you’re talking about.",
        "created_utc": 1630799360,
        "id": "hbmmlyz",
        "score": 8,
        "subreddit": "investing",
        "created": 1630828160.0
    },
    {
        "author": "paq12x",
        "body": "INTC has a stock split 2:1 at the end of July 2000.\n\nIn the last 10 years, return for INTC is 14% annually or a total of 268% in 10 years.  \n\nNot bad at all.",
        "created_utc": 1630760951,
        "id": "hbkc7t1",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630789751.0
    },
    {
        "author": "updownleftrightabsta",
        "body": "INTC is positive YTD, 1 year, 5 years. It hasn't done well but I wouldn't call it failing GE-style. OP just means stock price wise, not execution wise (related but not completely correlated)",
        "created_utc": 1630895328,
        "id": "hbrg0in",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630924128.0
    },
    {
        "author": "Xx_Majesticface_xX",
        "body": "TSMC is a fairly well known stock, however, I’m placing my bets on Global Foundries. While there were talks a few months ago in regards to Intel acquiring them, a lot of electronics that don’t require high end semi conductors(7nm TSMC, 8nm Samsung, 10nm Intel) are made using cheap, larger nodes that are less efficient. Global foundries failed to develop high end chips after they abandoned their rnd, but they hold a 15% market share(at last check) in markets which use lower grade nodes. Best part is, that they are supposedly going public in 2022. I personally think that this is a wise investment, though a rather obvious one, as any company which is trusted by the US government and hold a market share in a sector worth billions is a simple stock to buy",
        "created_utc": 1630714543,
        "id": "hbiflpp",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630743343.0
    },
    {
        "author": "Ryano3",
        "body": "21% MSFT\n\n21% AAPL\n\n19% AMZN\n\n10% GOOG\n\n9% NVDA\n\n8% BABA\n\n5% AMD\n\n5% INTC\n\n2% VOO\n\nup on everything but BABA and INTC, currently daily averaging into VOO",
        "created_utc": 1630987598,
        "id": "hbw5bf0",
        "score": 8,
        "subreddit": "stocks",
        "created": 1631016398.0
    },
    {
        "author": "BilldaCat10",
        "body": "so much less stress on the leaps.  i'm super bullish for 2022 and about 20% of my portfolio is in LEAPS.\n\nAAPL 160c Mar 2022 (not really a leap anymore)\n\nAAPL 170c Sept 2023\n\nABNB 180c Jan 2023\n\nAXP 220c Jan 2023\n\nBLDR 70c Feb 2022\n\nINTC 90c Jan 2023 (going to roll to 2024)\n\nMSFT 305c Jun 2023\n\nNLS 15c Jan 2023\n\nSPY 500c Dec 2023\n\nTAP 55c Jan 2023\n\nV 270c Jan 2023\n\nZ 150c Jan 2023\n\nlet's gooooo",
        "created_utc": 1631157662,
        "id": "hc53m49",
        "score": 7,
        "subreddit": "options",
        "created": 1631186462.0
    },
    {
        "author": "flobbley",
        "body": "I do find it interesting how many people are convinced that Intel is just too far behind and relegated to fall into obscurity when it was only like 6 years ago that that's exactly what people were saying about AMD and Intel was the darling. \n\nGranted I do think this time is \"different\" in that instead of market share shifting between two established players, we're seeing lots of companies spinning off to create their own chips with non-intel architecture. Still, I think the dismissal of Intel is overblown",
        "created_utc": 1631193709,
        "id": "hc6fkho",
        "score": 7,
        "subreddit": "stocks",
        "created": 1631222509.0
    },
    {
        "author": "Jordibato",
        "body": "Since it seem that for once intel decided to make a better than a 2015 product it might drive an abnormally large sales volume of DRAM but on the other hand with the GPU dirth no one is building PC's, but on the other other hand people may upgrade platform as a poor substitute of a new GPU, so definitely might be a catalyst for feb 22 earnings, 🚀🚀🚀🚀\n\n100 shares at 33,25 bags are heavy ,but so are my balls",
        "created_utc": 1631210362,
        "id": "hc7i8j9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1631239162.0
    },
    {
        "author": "preiser",
        "body": "ive been watching this the last 6 months or so as well. valuation is tasty and takeover target makes sense based on so many companies wanting to get into healthcare.   \n\n\nalso worth noting, the dogs of the dow strategy (investing in the 10 DOW components with lowest PE multiples) would include WBA. \n\nVZ also fits the dogs of dow mold but it has a good amount of debt. they also just bumped the divy up to 4.5%. other dogs of the dow based on PE for last year and their accompanying divy %\n\n\\-VZ (4.5% yield, 10.5% off 52 wk high)  \n\\-GS (1.22% yield, 2.25% off 52 wk high)\n\n\\-INTC (2.6%, yield, 21.87% off 52 wk high)\n\n\\-IBM (4.67% yield, 8.68% off 52 wk high)",
        "created_utc": 1631019283,
        "id": "hbxc5aq",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1631048083.0
    },
    {
        "author": "Both-Ad-7757",
        "body": "This is a fantastic explanation and I’m with you on Intel. Very well put good sir!",
        "created_utc": 1630630214,
        "id": "hbdz1us",
        "score": 6,
        "subreddit": "ValueInvesting",
        "created": 1630659014.0
    },
    {
        "author": "SnipahShot",
        "body": "And to add on top of that Intel finally put their foot in the gaming GPU market for the first time. Regardless of how good Alchemist will be, it will take profits from AMD and Nvidia, especially if it is as good as they make it sound.",
        "created_utc": 1630914900,
        "id": "hbsavdb",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630943700.0
    },
    {
        "author": "daaammmN",
        "body": "It all depends on if you overpaid or not.\n\nIntel was almost at the 80$ mark in the 2000s.\n\nSince then it has grown a lot, but still, 20 years later and it never reached its all time high.\n\nThis just proves that you can overpay for growth.\nIf you are overpaying, you might not see an increase for many years to come\n\nI haven't dug into MasterCard, but I did for Visa.\n\nIMO, Visa (and most of the market) is overpriced. The growth that Visa is projecting (mid teens) for the next 5 years is already priced in.\n\nIf the bull market continues, the stock price might increase, but it's just a matter of time before the correction arrives and reality kicks in.\n\nI want to own Visa, I like it very much. They have been buying back shares like crazy, which is awesome. It's on my watchlist. But it still has to drop a lot for me to be a buyer. I have no doubt that it will be a buy at some point in the future though.",
        "created_utc": 1630758713,
        "id": "hbk8hho",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630787513.0
    },
    {
        "author": "shashwat73",
        "body": "I added V and INTC. Low PE ratios, great companies, and good technicals on both",
        "created_utc": 1630680824,
        "id": "hbgbvlk",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630709624.0
    },
    {
        "author": "KayVerbruggen",
        "body": "Exactly, I'm fine with their show being a kind of quick screener if that's what they want to do. But their actions tell a different story. I first got confused when in their Intel video they said they're buying Intel because the numbers look good and the chips are fine. But then it seemed like they had no clue what semiconductor companies even do. But when I watched one of their videos where they said they were buying Alibaba, it just got really fucking bad. They were all staring at each other wondering why Alibaba was going down and had absolutely no clue what risks there are to investing in China. That was just the real confirmation that they actually do close to zero due diligence",
        "created_utc": 1631189766,
        "id": "hc68eb3",
        "score": 5,
        "subreddit": "ValueInvesting",
        "created": 1631218566.0
    },
    {
        "author": "KPalm_The_Wise",
        "body": "Just to temper expectations, but intel has already said their memory controller will still support DDR4, not sure what AMD is doing. But for Intel it's up to motherboard manufacturers to decide which memory they are supporting.",
        "created_utc": 1631220139,
        "id": "hc865dw",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1631248939.0
    },
    {
        "author": "TaxGuy_021",
        "body": "AMD and Nvidia dont have an insurmountable lead. They are ahead of Intel for sure for now, but I believe intel has what it takes to get back in the game.",
        "created_utc": 1630866603,
        "id": "hbprfhq",
        "score": 5,
        "subreddit": "investing",
        "created": 1630895403.0
    },
    {
        "author": "meowman3000",
        "body": "Intel is getting government money to setup fabs in the US, as part of an infrastructure bill.  I could see them treating TSMC like they do Huawei in the future if Intel gets enough capacity.  I could see a strong case for national security, in which case Nvidia and AMD would shift to Intel, assuming the fabs are competitive.\n\nA small chance at least.",
        "created_utc": 1630637279,
        "id": "hbee1ue",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630666079.0
    },
    {
        "author": "Nuclear_N",
        "body": "INTC has been such a dog.",
        "created_utc": 1630859096,
        "id": "hbpah9w",
        "score": 4,
        "subreddit": "investing",
        "created": 1630887896.0
    },
    {
        "author": "bcuap10",
        "body": "Markets in theory function well because of competition and displayed consumer/investor preference.\n\nThey gov should fund 5-10 startups and give them funding to create pilot plants. Then hold competitions to advance the companies forward for more funding.\n\nYou would end up with more surplus and innovation if 2-3 new companies emerge and then sub specialize in different parts than giving everything to a dinosaur like Intel.",
        "created_utc": 1630773662,
        "id": "hbl38jl",
        "score": 4,
        "subreddit": "investing",
        "created": 1630802462.0
    },
    {
        "author": "Pokesaurus_Rex",
        "body": "and Intel hasn’t innovated a CPU since like 2015…we are on 14nm++++++. They can’t even get a 7nm CPU to work and it got so bad they had to bring back one of their best designers out of fucking retirement.",
        "created_utc": 1630919676,
        "id": "hbsg83o",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630948476.0
    },
    {
        "author": "shortyafter",
        "body": "Love that valuation, love that revenue, love that dividend.\n\nLong INTC right here.",
        "created_utc": 1631207508,
        "id": "hc7bbxk",
        "score": 4,
        "subreddit": "stocks",
        "created": 1631236308.0
    },
    {
        "author": "sweYoda",
        "body": "Coca-Cola, Kroger, Tyson Foods, Disney, Google, Intel",
        "created_utc": 1630640934,
        "id": "hbela50",
        "score": 4,
        "subreddit": "investing",
        "created": 1630669734.0
    },
    {
        "author": "Sandvicheater",
        "body": "If NVDA gets the arm deal approved and Intel getting into graphics means the landscape will get changed.",
        "created_utc": 1631203577,
        "id": "hc71vdh",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631232377.0
    },
    {
        "author": "noobc4k3",
        "body": "Why is INTC  dumping AH?",
        "created_utc": 1630531290,
        "id": "hb8kdol",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630560090.0
    },
    {
        "author": "notmsnewty",
        "body": "ALYI - hemp batteries are the future. I hope this is the company.  Anyone else have intel?",
        "created_utc": 1630625285,
        "id": "hbdonrm",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1630654085.0
    },
    {
        "author": "datingadviceThrow789",
        "body": "INTC and CLF are the best govt plays moving forward. Love them both.",
        "created_utc": 1630600645,
        "id": "hbc1uwi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630629445.0
    },
    {
        "author": "GraysonMA",
        "body": "When you buy leaps you are taking on a lot of vega exposure which can add significant risk to your portfolio. However, vega gives you a second way to win if you stick to companies that have IVR/IV% near their 52 week lows. [Barchart is a great resource for finding these.](https://www.barchart.com/options/iv-rank-percentile/stocks?orderBy=optionsWeightedImpliedVolatility&amp;orderDir=asc)\nI also choose underlyings that have low correlation with each other. This keeps things a little less volatile which is especially important using any type of leverage. [PortfolioVisualizer has a great tool for this.](https://www.portfoliovisualizer.com/asset-correlations?s=y&amp;symbols=SPY+TLT+KO+PG+D+INTC+MCD+VZ+FB+MSFT+NVDA+LLY+NEE&amp;timePeriod=2&amp;tradingDays=60&amp;months=36). Leaps I bought recently are in PG, INTC, FB, D, MSFT, KO, VZ, and MCD. LLY is an solid low correlation pick but I’m waiting for a dip in IV.",
        "created_utc": 1630675696,
        "id": "hbg03gf",
        "score": 3,
        "subreddit": "options",
        "created": 1630704496.0
    },
    {
        "author": "him7403",
        "body": "Microsoft and Apple hold and buy Intel? That's a big lol 😂\n\nUnfortunately stock market doesn't follow your formula.",
        "created_utc": 1630868623,
        "id": "hbpvwt2",
        "score": 3,
        "subreddit": "investing",
        "created": 1630897423.0
    },
    {
        "author": "MentalValueFund",
        "body": "The fact you think the 7nm naming scheme from AMD is comparable to the naming scheme from Intel shows me you don’t know much about semiconductors.\n\nI’m not stating Intel isn’t behind the ball on manufacturing at the moment relative to TSMC, but an AMD 7nm design is equivalent to an Intel 10nm design. The naming conventions are literally market bullshit that haven’t meant anything since we moved to FinFET.",
        "created_utc": 1630996180,
        "id": "hbwi8qu",
        "score": 3,
        "subreddit": "stocks",
        "created": 1631024980.0
    },
    {
        "author": "Riflebursdoe",
        "body": "$LIDR.\n\n- Redemption percentage 84% \n- Short intrest 26.6% calculated on official free float 7.7m \n- Actual free float due to PIPE, Insiders and Cantor all being locked up 3.7m \n- Actual short intrest of real free float ~ 50% (im to lazy to calculate the exact percentage)\n- 80% borrow fee \n- Close to 0 shares to borrow \n- ITM calls 7.5$ &lt;100% IV \n- OTM calls 10$ 150% IV \n- big partners (Intel, Subaru, Continental, LG electronics)\n- meme-able pirate name\n- haven't popped yet. \n- funky ticker. \n\nhttps://docs.google.com/spreadsheets/u/0/d/1C65RwHVSLOUKkuJaf3RgkeDiuMmhrMMKYncfM7YrF0U/htmlview#gid=0\n\nhttps://mobile.twitter.com/Abby10Smalls/status/1433866282181533696",
        "created_utc": 1631216614,
        "id": "hc7xftx",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1631245414.0
    },
    {
        "author": "myglasstrip",
        "body": "Take a look at the Intel 20 year chart and tell me when intc got back to its last ath of 73.94 a share or whatever.",
        "created_utc": 1630538488,
        "id": "hb8zbv3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630567288.0
    },
    {
        "author": "donktastic",
        "body": "That's not completely true and even if it was it doesn't matter. The proprietary tech steps are all done in secure locations like the US, Israel and Ireland with the US doing 100% of their R&amp;D. The R&amp;D sites are massive and also do manufacturing which handles the most top secret stuff, like US military stuff. Asia only gets the cost saving steps that are not sensitive, like packaging. \n\nIf shit hit the fan and world war 3 broke out, Intel could easily do 100% of its process in the US or allied countries. The most important part being that Intel is a US company, is based in the USA and is invested in the success of the nation.",
        "created_utc": 1630782995,
        "id": "hblo2pd",
        "score": 3,
        "subreddit": "investing",
        "created": 1630811795.0
    },
    {
        "author": "Thin_Influence5878",
        "body": "INTC ftw",
        "created_utc": 1630866065,
        "id": "hbpq8bw",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1630894865.0
    },
    {
        "author": "TJMBeav",
        "body": "Bought $INTC shares $53.37 pre market.",
        "created_utc": 1631016840,
        "id": "hbx7vod",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631045640.0
    },
    {
        "author": "throughthehazel",
        "body": "INTC 50s 9/17 poots",
        "created_utc": 1630536020,
        "id": "hb8ud2v",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630564820.0
    },
    {
        "author": "Scion_capital_intern",
        "body": "Well CCP has already infiltrated all of our Intel agencies and defense contractors so.. \n\nIt's the same thing. But yes.",
        "created_utc": 1630879305,
        "id": "hbqji8o",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630908105.0
    },
    {
        "author": "senecadocet1123",
        "body": "The only one I would by heavily is Intel right now",
        "created_utc": 1630877550,
        "id": "hbqfrdi",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1630906350.0
    },
    {
        "author": "SugarDaddyVA",
        "body": "Their management has been terrible.  They missed a chip cycle which will set them back years in competition with other companies such as TMSC.  Great article explaining what happened here:  https://www.google.com/amp/s/www.tomshardware.com/amp/news/intel-announces-delay-to-7nm-processors-now-one-year-behind-expectations\n\nI’ll look at them again in a few years if they turn things around.",
        "created_utc": 1630868939,
        "id": "hbpwlw8",
        "score": 3,
        "subreddit": "investing",
        "created": 1630897739.0
    },
    {
        "author": "rotflolmaomgeez",
        "body": "So is NVDA and AMD.\n\nIntel has fabs, see how it works out for them.",
        "created_utc": 1631063530,
        "id": "hc05w2d",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631092330.0
    },
    {
        "author": "13thMasta",
        "body": "Dont get me started. See Brendon O'Connell's works if they're saved on the tubes. All tech is compromised; kill switch in all apple, windows, amd and intel devices.",
        "created_utc": 1631046540,
        "id": "hbz46tz",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1631075340.0
    },
    {
        "author": "Stoli1387",
        "body": "Intel if you're patient",
        "created_utc": 1630692101,
        "id": "hbh31da",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630720901.0
    },
    {
        "author": "VulfOfWallStreet",
        "body": "Eh, they have a lot of issues with producing their own technology. I think in general the semiconductor markets will continue to rise but I highly doubt Intel takes that sharp of a turn.",
        "created_utc": 1631248620,
        "id": "hc9wht1",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1631277420.0
    },
    {
        "author": "NPRjunkieDC",
        "body": "Intel is going to dedicate part of an Ireland factory to car chips I think is what I heard yesterday (on NPR)",
        "created_utc": 1631207475,
        "id": "hc7b93p",
        "score": 3,
        "subreddit": "stocks",
        "created": 1631236275.0
    },
    {
        "author": "828stocks",
        "body": "Thank you for my tasty dividend, INTC.  You might be fucking me, but at least you're buying dinner.",
        "created_utc": 1630593293,
        "id": "hbbjvvx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630622093.0
    },
    {
        "author": "DongKelly32",
        "body": "Look up AS ML (pretty sure they’re private but just being safe). They make the machine that makes shit for Intel, TSMC, AMD, NVDA, etc. and it costs $150m+",
        "created_utc": 1630698475,
        "id": "hbhhl5g",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630727275.0
    },
    {
        "author": "Afro_Superbiker",
        "body": "Here's hoping. I don't think their gpu will be aimed at the gaming market, so I don't think it will garner the same hype that a new release from Nvidia does.\n\nOver time though, especially with investment from the u.s with the aims of developing their u.s fabs, Intel will gain new life.",
        "created_utc": 1630714059,
        "id": "hbieok5",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1630742859.0
    },
    {
        "author": "mistermc90",
        "body": "Tip: just look where the cheap free cashflow to the firm / shareprice is!!!\n \n-BTI, ITB (big tobacco in general) //\n-INTC (semiconductor) //\n-RDSB (big oil/gas cashflow machine) //\n-VZ (telco with strong free CF in an oligopolistic market) //\n-FRE (strong german health company) //\n-VRTX (tremendous value drug company - 10/10 financials)",
        "created_utc": 1630688427,
        "id": "hbguas9",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630717227.0
    },
    {
        "author": "Parallelism09191989",
        "body": "Intel and TSM\n\nEverybody overreacting to AMD leapfrogging Intel.",
        "created_utc": 1630685309,
        "id": "hbgmpm0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630714109.0
    },
    {
        "author": "PrincPaco",
        "body": "Not so sure about some of those tickers, unless you're buying Puts. Regardless, I wish you Good luck.\n\nINTC LEAPS may be a good play.",
        "created_utc": 1630961251,
        "id": "hbuo7fc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630990051.0
    },
    {
        "author": "CrimsonBrit",
        "body": "INTC",
        "created_utc": 1630948074,
        "id": "hbtu8pw",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630976874.0
    },
    {
        "author": "Seanishungry117",
        "body": "Every time I buy spy puts I lose money\nEvery time I buy spy calls I lose money. \n\nLol. \n\nI actually have no spy positions as of today. \n\nCorsair, Nvidia, tesla, visa, Intel, Toyota, vti, voo, and efa make up my roth IRA positions.\n\nVisa leaps have caught my attention.\n\nI lost a shitload on Johnson &amp; Johnson options, only to realize they would have printed if I went out 5 more months.",
        "created_utc": 1631071895,
        "id": "hc0mvmm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631100695.0
    },
    {
        "author": "Maleficent_Algae_336",
        "body": "One of the best write ups I’ve read a brilliant job well laid out for laymen or women be great if our community can do a Bot that would enable us some relief from the price movements \nKeep up the information flow I’d follow your channel if you made one even subscribe to it for such Frank honest openness intel . Your a star",
        "created_utc": 1631081034,
        "id": "hc11fjr",
        "score": 2,
        "subreddit": "Wallstreetbetsnew",
        "created": 1631109834.0
    },
    {
        "author": "Economy-Cup5465",
        "body": "It is extremely nuanced. \n\n\\&gt;The thesis is that Tesla is far ahead in its self-driving capabilities that other car makers just can't catch up. And because they already have cars on the road now, they are collecting more data which is making their lead wider.\n\nIt is my view that the FSD tech would be more of an open space. Most of these companies will start using third party companies, akin to how PC manufacturers used Windows from Microsoft instead of creating their own OS. Initially some will try their hand at the market with their own bespoke solution(like the wild west days of 80's when we had commodores and sinclair spectrums). However after some time their will be a standardization(IBM PC). \n\nAt best I can see Tesla becoming like the Macintoshes:  \nTesla: Proprietary full self driving system:: Macintoshes : Proprietary OSes\n\n\\&gt;If any company is way ahead in self-driving, it's actually Waymo, not Tesla. They just launched a self-driving taxi service in San Francisco, a dense city with weird roads and many pedestrians.  \nTesla is boasting about FSD(which is between a very good cruise and a poor self driver). The key difference between waymo and tesla is that tesla is heavily reliant on an AI based system, whereas waymo(which does use AI) is heavily dependent on Geolocation and real time data.\n\n\\]&gt;The thesis is that Tesla is far ahead in its self-driving capabilities that other car makers just can't catch up. And because they already have cars on the road now, they are collecting more data which is making their lead wider.\n\nRun away from any person who says that leads are insurmountable. Just look at Intel. Went from being a market leader to being overtaken by near bankrupt competitors(See: AMD)",
        "created_utc": 1631112666,
        "id": "hc2cgdo",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631141466.0
    },
    {
        "author": "LiveInLayers",
        "body": "Would have loved to see INTC enter 52.5 so I could buy more leaps.",
        "created_utc": 1631114467,
        "id": "hc2gqdu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631143267.0
    },
    {
        "author": "spongesquare",
        "body": "What happened to Intel?",
        "created_utc": 1630516952,
        "id": "hb7ljkv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630545752.0
    },
    {
        "author": "Overhaul2977",
        "body": "AMD’s profit margin is pretty good, they are taking market share from intel and approaching Nvidia in performance for their GPUs, and they are innovating well under current management. The problem with your analysis is you’re looking at book value, you need to look at future growth and both companies they can take market share have a fair amount higher market cap, meaning it has plenty of space to grow if things keep going well for them. The stock market cares about future growth, not too much on past performance.\n\nTo give you a basic idea of investing, there are four types of companies - Dogs, Cash Cows, Question Marks, and Stars. AMD is at the Question Mark phase that is almost to Star. They are taking market share in a fast growing area. The typical investor strategy in that situation is to “buy”.",
        "created_utc": 1630588805,
        "id": "hbb9kpu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630617605.0
    },
    {
        "author": "ZeroSumBananas",
        "body": "Here are some stocks I have looked at some higher risk than others you can go with Google, Microsoft, Apple, Tesla, ISRG, Lucid, CHPT, Facebook, Intel this would be a contrarian buy, Nokia, Berkshire Hathaway, so those are some common stocks. Depends on your risk tolerance. If you want risk you can go with Chinese stocks....Not responsible for your success or failure. Not recommending anything. Good luck. Do your DD",
        "created_utc": 1630884623,
        "id": "hbqud9e",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630913423.0
    },
    {
        "author": "ErojectionPrection",
        "body": "I think nvidia is fine to hold onto for a while.\n\nThey're still far ahead of amd in the professional world but the money is in the consumer world. AMD has been very competitive in that regard over the years. But Intel is the bigger victim of AMD's success. Nvidia simply has real competition now. But only in a tiny area.",
        "created_utc": 1630912141,
        "id": "hbs7j12",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630940941.0
    },
    {
        "author": "merlinsbeers",
        "body": "IBM made probably the biggest mistake in business history by giving Microsoft and Intel the ability to make computers on the PC architecture without IBM involvement.\n\nThey could have owned that whole ecosystem and leveraged their incredible brand recognition to attract the talent that made it happen.\n\nBut, if they had, IBM management would have overcontrolled it so we'd probably all be using Macs and talking about PC only in conversations with words like Amiga, Imsai, and Heathkit.",
        "created_utc": 1630940177,
        "id": "hbtc2gd",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630968977.0
    },
    {
        "author": "pacifistrebel",
        "body": "I hope intel can turn around their fabrication business. If they can, the current price is a steal. If not.. who knows what will happen. The USA could benefit from competent domestic semiconductor fabrication.",
        "created_utc": 1630894021,
        "id": "hbrdf0r",
        "score": 2,
        "subreddit": "investing",
        "created": 1630922821.0
    },
    {
        "author": "WolfPackWSB",
        "body": "AMD Samsung Intel Xilinx TSM &amp; ON are the major ASIC manufacturers.. Most patents are held by TSM",
        "created_utc": 1630932103,
        "id": "hbsw3lq",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630960903.0
    },
    {
        "author": "niversally",
        "body": "You have a lot of superintendent Chalmers energy when he says he’s balding not bald respect the ing. Intel is failing not failed.",
        "created_utc": 1630895736,
        "id": "hbrgu4q",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630924536.0
    },
    {
        "author": "-C20H24O3",
        "body": "Someone asked the other day what stock to buy long term and I commented to replace SQ with Penpal and he said “Penpal is Intel and SQ is AMD” \n\nI thought of you and wanted to tag you just to see that tongue lashing you’d give him lol",
        "created_utc": 1631085241,
        "id": "hc16qu4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631114041.0
    },
    {
        "author": "mindspan",
        "body": "Well some idiot came out with an article stating that TSM was a poor buy and that Intel was the shit. His analysis was ridiculous and there was no disclosure of his positions. Also, it just seems to be a generally red day.",
        "created_utc": 1631115125,
        "id": "hc2ib1t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631143925.0
    },
    {
        "author": "tindalos",
        "body": "Intel can’t crack 14nm and you think the technology to inject chips would be used to track Bubba’s visit to Costco",
        "created_utc": 1631231053,
        "id": "hc8v6zt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631259853.0
    },
    {
        "author": "third_legatron",
        "body": "Eh, 6 well picked stocks can be diversified, all comes from someone's preference. If you're very well versed in a certain industry, you can have 6 stocks in the same sector, it all depends on the investor. \n\nI like to have 2 safe stocks, I have GE and APD. My riskier plays would be oil, speculative. And tech plays I'd probably buy back into lam, amd or Intel. Only tech I hold now is Nvidia. \n\nBut you can do very well with 2 stocks, but if you just want 2 stocks to own and not watch, I'd go spy and then something else very safe, like alphabet.",
        "created_utc": 1631156766,
        "id": "hc51ybz",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631185566.0
    },
    {
        "author": "jasoncyke",
        "body": "Intel has been such a letdown since it dipped below 60 dollars.",
        "created_utc": 1630549201,
        "id": "hb9lwcm",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630578001.0
    },
    {
        "author": "dancinadventures",
        "body": "Still cheaper than working w/Intel for chips. \n\nBullish",
        "created_utc": 1630997838,
        "id": "hbwkdr6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631026638.0
    },
    {
        "author": "Jacklewis98",
        "body": "I had a huge feeling Intel would be complacent, through what their management and executives actions towards AMD made me think they thought AMD would go bankrupt before they caught up",
        "created_utc": 1630602240,
        "id": "hbc5x87",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1630631040.0
    },
    {
        "author": "MrHeavyRunner",
        "body": "And so far they delivered. Look at the graph. Also saying \"AI/Machine learning is a niche technology\" - lol you must be kidding. There are so many uses, some of them are waiting to be discovered. IBM is old dinosaur, not much thread from this side. Intel also not involved here. AMD is starting, but it will take time. Also NVDA has all the know-how over many years, others do not. Money cannot buy everything...",
        "created_utc": 1631206542,
        "id": "hc79037",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631235342.0
    },
    {
        "author": "PufTheSavageDragon",
        "body": "everything money knows their audience. every video they spend a good minute explaining how they want to find companies that are undervalued. theyre so far off reality, they look at financials only and somehow come to the conclusion that every chinese company is undervalued. who would have thought! not trying to trash on them, i think intel and baba are good picks. its just a stupid idea to blind yourself of the situation",
        "created_utc": 1631224115,
        "id": "hc8frce",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1631252915.0
    },
    {
        "author": "LargeFatherOrtiz",
        "body": "my intc puts are ded",
        "created_utc": 1630608390,
        "id": "hbcladk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630637190.0
    },
    {
        "author": "Summebride",
        "body": "Stocks means stock market securities that you've surely heard of, Microsoft, Intel, JP Morgan, etc.\n\nBonds are a timed instrument where you lend your money to something and they pay it back later, with a slight amount extra.\n\nBonds have traditionally been for old people as they neither go up or down very much, and are predictable.  \n\nStocks can change in value radically and have traditionally been recommended for young  people so if you lose a lot of value, you have time to make it up.  \n\nBlended fund just means a mix of those two kinds of things.  \n\nAt 23 there's no other choice than stock.  \n\nAAR% likely means average annual return.  So if the AAR% was 4% and you have 1000 placed there, it would have gained about $40 during the year.  \n\nBunds are have recently been returning close to nothing.  Someday that might change but for now they're pretty much a worthless option for you.",
        "created_utc": 1630726021,
        "id": "hbj1hwp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630754821.0
    },
    {
        "author": "Trump_Ate_My_Ass",
        "body": "Which is better? 11th gen intel i7-11370H with Intel Iris XE graphics or AMD Ryzen 7 5700U with AMD Radeon graphics?",
        "created_utc": 1630535840,
        "id": "hb8tzt3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630564640.0
    },
    {
        "author": "Aggressive_Watch3782",
        "body": "Quik logic is a perfect short! I lost my shirt on them for long term gain. Every earnings call wait until next quarter…Nvidia blows it out of the park regularly and it’s basically a 50/50 after. It’s gone down when you just heard the most mind numbing numbers and then it goes down the next day! I ask how is this possible! \n-People are just trimming and taking profits! \nI don’t think that’s it, why take money out of the #1 stock that invented the Metavese and A/I by a fortuitous accident! Gaming company invented the GPU, Gaming company invented A/I, ray tracing and augmented reality!  Platform is best in class command a premium. \nNot many companies out their using their BILLIONS of free cash flow for R&amp;D which unlike Intel continues to make things we never dreamed about a reality today! \nOh yeah, 350 automobile companies are signed up for their driving platform and when Tesla is forced to use it . This stock will be out of reach because it’s going to be worth the most of any company today! This new Metavese thingy is at a minimum double what the impact of the game changing internet did… whaaat, I’m barely proficient now! Us old baskets are in a world of pain trying to figure that out. It is going to change the way all of us live and work so that many more of us get to also enjoy our best lives.",
        "created_utc": 1630806721,
        "id": "hbn0uzw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630835521.0
    },
    {
        "author": "datingadviceThrow789",
        "body": "Intel will join if China takes over Taiwan.",
        "created_utc": 1630785710,
        "id": "hblu2uy",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630814510.0
    },
    {
        "author": "LastTradeTonight",
        "body": "I know YouTube is filled with peep calling the wheel “free” money. \n\nLong term you won’t get the same raw SPY return. \nIt’s less volatile and more income driven. Also the capital lock-up is less per contract per 100 shares. \nStraight CC on SPY makes more sense than the put side bc it can get you a 70/30 risk profile with higher income. \n\n\nIf you don’t care about income and are long-term investor than buy-hold is going to work better than the wheel. \n\nPersonally, when I run the wheel it’s on a large cap with good options volume that has some vol but over all pretty stable. In the past companies like BAC, AAPL, INTC.  I haven’t run it since last year for obvious reasons.",
        "created_utc": 1630778216,
        "id": "hbldj7b",
        "score": 1,
        "subreddit": "options",
        "created": 1630807016.0
    },
    {
        "author": "maz-o",
        "body": "i kinda have this feeling too that intel will crush it in the coming 5 years",
        "created_utc": 1630743630,
        "id": "hbjpyd0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630772430.0
    },
    {
        "author": "moldyjellybean",
        "body": "Yes and INTC is not a tech company.  I've been in the datacenter field for many years and I'm indifferent to brand, I'm mostly looking at energy efficiency, tech advancements.  Someone wanted to invest in Intel last week and I spelled out why not.  Originally my thesis was around 2016 when I bought AMD and Intel had Brian K was head of Intel.  This is no go and it may turn around a bit on buybacks, financial engineering they have a ton of money but it's not on the back of technology.  \n\nAny non boomer working in cloud computing/semi field can tell you INTC is not where you want to put your money.  I believe Pat is more tech inclined but it's a long road and in the mean time you can invest in AMD, TSM, NVDA, AMZN, MSFT, APPL etc if you want exposure to semi or cloud computing.  \n\n\n\nhttps://old.reddit.com/r/wallstreetbets/comments/panf65/intel_is_50_bucks_just_saying/ha79m4v/",
        "created_utc": 1630866105,
        "id": "hbpqbjw",
        "score": 1,
        "subreddit": "investing",
        "created": 1630894905.0
    },
    {
        "author": "SnipahShot",
        "body": "Your comments seem like you are a 5 year old.\n\n\"Do you really think the super smart people they hire are morons that will sit around and let AAPL go under?\"\n\nHundreds of companies had \"super smart\" people.  \nAre you familiar with Nokia? BlockBuster? BlackBerry? IBM?  \nHeck, even Intel has been trading downwards for almost 6 months.\n\nIt doesn't matter how many \"super smart people\" a company has, if a company fails to innovate and expand their business they will start going down.  \nThis is not the case for Apple, but it is not because of \"super smart people\", it is because they still seem to innovate and expand.\n\nAlso, do you even know what exactly Apple are planning on doing in the healthcare and EV? Who their competition is in each of these fields?",
        "created_utc": 1630869503,
        "id": "hbpxuzt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630898303.0
    },
    {
        "author": "Premier_Legacy",
        "body": "Team intel . Any day now",
        "created_utc": 1630985938,
        "id": "hbw2ego",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631014738.0
    },
    {
        "author": "Hani95",
        "body": "So I'm actually going to do some market analysis on the direction of the market, and I'd like thoughts and a discussion if possible. Think Socratic discussion. \n\nIn the U.S. I think that the markets are going to soon start a rotation to value, and you can sort of see it starting to occur as bond yields have started to rise, meaning that growth stocks will start to become less attractive relative to value stocks. You've been seeing supply chain and logistics companies like Matson, Maersk, Zim, and other assorted shipping stocks boom during this time period. Commodities stocks in the aluminum sector are poised to outperform, because Guyana just had a coup, and it's a huge exporter of aluminum... Especially to China. With that said, steel and iron ore are the same with exports to China from Australia of iron ore outperforming despite negative relations between these two nations. Both of these types of stocks have outperformed year-to-date, and will continue to do so for the next month or two as forward looking investors look at commentary stating that supply chain, and commodity prices will be elevated well into next week. Finally, home builders have outperformed, and are poised to continue their outperformance due to a massive shortage of homes that will take years to a decade to fix.\n\nI believe in the latter months, in 2022, and heading into 2023 financials will outperform as yields for the 10 year T note rise. First, domestic debit and credit card transaction volume will rise (which bank CEO's , and Visa's CEO, have noted has already started to happen), and this will be followed by international travel spend (Which is very lucrative). This will primarily help Visa, and Mastercard as they have been essentially flat year to date and on a yearly basis. It will also help American Express, and Discover Financial to a lesser extent. Then, credit card balances will grow and forward looking investors will start looking at interest rate hikes by the FED in late 2022-2023, which is the one-two punch that bank stocks will need to see outsize profitability. The strong M&amp;A activity, even in the face of anti-trust scrutiny, is also helping banks. Third, ADP and other benefit provider/payroll companies will do well as payrolls continue to increase, and unemployment continues to go down. The runway is still clear there. Then, there are the mortgage companies where there currently has been a pricing war which should cool sometime in early 2022, allowing for Gain on Sale margins to normalize to roughly 115-185BPS, while the value of their Mortgage servicing rights should increase alongside the yield for the 10YR T notes. Open banking should continue its outperformance, with strong markets in Asia, the Middle East, Europe, and Latin and South America, and growing adoption in North America. Companies like Paysafe, PAG, Razer, etcetera should do well in this environment. Finally, the moratorium on school loan payments should cease very soon allowing companies like Navient and Sofi to regain momentum.\n\nI also believe that airlines will start to outperform starting in Q1-Q2 2022, as flight restrictions start falling away, and business travel starts to resume at a more normal tempo. Personally, Delta Airlines and the budget airlines are my preferred ones. Then, there are homebuilders who will continue their outperformance as they have significantly deleveraged and still have long runways for price to earnings growth. I'd expect dividend increases in the latter half of 2022 to reflect this. Third is General Electric under Larry Culp, who's turnaround efforts haven't recently been noticed, but who's conducted strong execution. From their wind turbines, to their jet engines, to their medical division, there is strong growth to be had and I believe we'll see a spurt in the share price to reflect the reality of 2022 and Culp's momentous turn around. I also believe chip fabricators (and chip designers) will outperform. TSM has been relatively flat in the last 3 months, save for a one week burst of over 5% to reflect the fact that they're increasing prices across the board from 10 to 20%. Intel, meanwhile, is building a chip fabrication plant in Ireland which will be entirely dedicated to vehicle chip manufacturing, which I think will be a success. Finally, I believe the used car (autonation), and new car companies such as Ford and GM as well as Volkswagen will outperform in 2022 due to the scarcity of vehicles, compounded by Hurricane Ida's destruction of numerous vehicles (And the risk that other natural disasters destroy even more vehicles).\n\nThe China rally, meanwhile, is unsustainable in the light of the regulatory tempo on the free market principle that China ever so briefly embraced. In light of all these actions, it is my firm belief that  China is, or will, embrace capitalism \"with chinese characteristics.\" The crackdowns are far from over, and I believe the state will go further in the realm of entertainment and video streaming, such as suspending screen time for minors on video streaming platforms (something they already do) to a level consistent to where they've placed video gaming limits to combat the myopia epidemic as well as fan culture. They are also likely to crackdown on drinking establishments, and liquor companies to crack down on the excessive drinking in China, in an attempt to stave off chronic health conditions that could accrue, as well as crack down on companies trying to profiteer off a rapidly aging China. These are just a few sectors where I see potential intervention, but there are likely others. The fact that systematic debt has reached such dizzying levels in China is also worrying, and presents a structural issue. A house of cards, if you will. The fact that JD bought an insignificant sum of shares, means that there is a rally in tech stock shares today is foolish, especially since it's broad based and not tailored means there's no solid shoring. Furthermore, the debt to equity levels for some companies, such as Iqiyi, Evergrande, and other stocks is extremely worrying.\n\nI believe emerging market stocks in Brazil, Mexico, India, the Middle East, and Turkey present better opportunities.",
        "created_utc": 1631041276,
        "id": "hbyrb2o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631070076.0
    },
    {
        "author": "MentalValueFund",
        "body": "Equivalent in transistor density. The post was about naming convention and originally before FinFET that’s what the “nm” moniker aimed to describe. Jesus you really are fucking dense. My entire post was pointing out how you clearly have no clue that calling out “omg Intel is on 14nm and amd on 7nm lolz 7 &lt; 14 so better!” Is nonsense.",
        "created_utc": 1630999057,
        "id": "hbwlv5o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631027857.0
    },
    {
        "author": "ummacles123",
        "body": "99% of retail customers dont know what the hell is that 14nm, they know Intel has always been in computers and has worked. AMD fanboys need to stop using that nm excuse.",
        "created_utc": 1630931677,
        "id": "hbsve50",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630960477.0
    },
    {
        "author": "Investingwifey",
        "body": "That’s true.  Bought some Intel a while back actually.",
        "created_utc": 1631070503,
        "id": "hc0k95c",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631099303.0
    },
    {
        "author": "Farscape1477",
        "body": "I’m not a fan of INTC. It’s up\n250% over the last 10 years, but companies like NVDA, AMD, and MU have delivered much better returns.",
        "created_utc": 1631073008,
        "id": "hc0owja",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631101808.0
    },
    {
        "author": "tsimtsimtsim",
        "body": "People said the same about Intel and smartphones, and we all know how that went...",
        "created_utc": 1630546680,
        "id": "hb9go2g",
        "score": 140,
        "subreddit": "stocks",
        "created": 1630575480.0
    },
    {
        "author": "Not_FinancialAdvice",
        "body": "&gt; That's because Intel mobile chips were always power hungry. They couldn't get a day standby time or whatever horrible battery life it was. \n\nThe Intel PXA270 XScale processor (which was an ARM implementation) in my old Palm Treo 650 gave me 2-3 days of battery life. They sold the XScale IP to Marvell later on.",
        "created_utc": 1630560235,
        "id": "hba5qyf",
        "score": 16,
        "subreddit": "stocks",
        "created": 1630589035.0
    },
    {
        "author": "Adept-Investing",
        "body": "Intel",
        "created_utc": 1630721175,
        "id": "hbisizr",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1630749975.0
    },
    {
        "author": "RobotArtichoke",
        "body": "INTC is such a boomer company. How did I ever get sucked into that pile of shit when everyone here was telling me to buy AMD. Sometimes you have to admit defeat.",
        "created_utc": 1630685966,
        "id": "hbgob55",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1630714766.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "https://www.tomshardware.com/news/intel-ice-lake-inefficient-for-cloudflare\n\nNET chooses AMD over INTC for new processors",
        "created_utc": 1630515542,
        "id": "hb7i3n8",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630544342.0
    },
    {
        "author": "Xx_Majesticface_xX",
        "body": "TSMC is a fairly well known stock, however, I’m placing my bets on Global Foundries. While there were talks a few months ago in regards to Intel acquiring them, a lot of electronics that don’t require high end semi conductors(7nm TSMC, 8nm Samsung, 10nm Intel) are made using cheap, larger nodes that are less efficient. Global foundries failed to develop high end chips after they abandoned their rnd, but they hold a 15% market share(at last check) in markets which use lower grade nodes. Best part is, that they are supposedly going public in 2022. I personally think that this is a wise investment, though a rather obvious one, as any company which is trusted by the US government and hold a market share in a sector worth billions is a simple stock to buy",
        "created_utc": 1630714543,
        "id": "hbiflpp",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630743343.0
    },
    {
        "author": "Both-Ad-7757",
        "body": "This is a fantastic explanation and I’m with you on Intel. Very well put good sir!",
        "created_utc": 1630630214,
        "id": "hbdz1us",
        "score": 6,
        "subreddit": "ValueInvesting",
        "created": 1630659014.0
    },
    {
        "author": "shashwat73",
        "body": "I added V and INTC. Low PE ratios, great companies, and good technicals on both",
        "created_utc": 1630680824,
        "id": "hbgbvlk",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630709624.0
    },
    {
        "author": "meowman3000",
        "body": "Intel is getting government money to setup fabs in the US, as part of an infrastructure bill.  I could see them treating TSMC like they do Huawei in the future if Intel gets enough capacity.  I could see a strong case for national security, in which case Nvidia and AMD would shift to Intel, assuming the fabs are competitive.\n\nA small chance at least.",
        "created_utc": 1630637279,
        "id": "hbee1ue",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630666079.0
    },
    {
        "author": "sweYoda",
        "body": "Coca-Cola, Kroger, Tyson Foods, Disney, Google, Intel",
        "created_utc": 1630640934,
        "id": "hbela50",
        "score": 4,
        "subreddit": "investing",
        "created": 1630669734.0
    },
    {
        "author": "noobc4k3",
        "body": "Why is INTC  dumping AH?",
        "created_utc": 1630531290,
        "id": "hb8kdol",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630560090.0
    },
    {
        "author": "notmsnewty",
        "body": "ALYI - hemp batteries are the future. I hope this is the company.  Anyone else have intel?",
        "created_utc": 1630625285,
        "id": "hbdonrm",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1630654085.0
    },
    {
        "author": "datingadviceThrow789",
        "body": "INTC and CLF are the best govt plays moving forward. Love them both.",
        "created_utc": 1630600645,
        "id": "hbc1uwi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630629445.0
    },
    {
        "author": "GraysonMA",
        "body": "When you buy leaps you are taking on a lot of vega exposure which can add significant risk to your portfolio. However, vega gives you a second way to win if you stick to companies that have IVR/IV% near their 52 week lows. [Barchart is a great resource for finding these.](https://www.barchart.com/options/iv-rank-percentile/stocks?orderBy=optionsWeightedImpliedVolatility&amp;orderDir=asc)\nI also choose underlyings that have low correlation with each other. This keeps things a little less volatile which is especially important using any type of leverage. [PortfolioVisualizer has a great tool for this.](https://www.portfoliovisualizer.com/asset-correlations?s=y&amp;symbols=SPY+TLT+KO+PG+D+INTC+MCD+VZ+FB+MSFT+NVDA+LLY+NEE&amp;timePeriod=2&amp;tradingDays=60&amp;months=36). Leaps I bought recently are in PG, INTC, FB, D, MSFT, KO, VZ, and MCD. LLY is an solid low correlation pick but I’m waiting for a dip in IV.",
        "created_utc": 1630675696,
        "id": "hbg03gf",
        "score": 3,
        "subreddit": "options",
        "created": 1630704496.0
    },
    {
        "author": "myglasstrip",
        "body": "Take a look at the Intel 20 year chart and tell me when intc got back to its last ath of 73.94 a share or whatever.",
        "created_utc": 1630538488,
        "id": "hb8zbv3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630567288.0
    },
    {
        "author": "throughthehazel",
        "body": "INTC 50s 9/17 poots",
        "created_utc": 1630536020,
        "id": "hb8ud2v",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630564820.0
    },
    {
        "author": "Stoli1387",
        "body": "Intel if you're patient",
        "created_utc": 1630692101,
        "id": "hbh31da",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630720901.0
    },
    {
        "author": "828stocks",
        "body": "Thank you for my tasty dividend, INTC.  You might be fucking me, but at least you're buying dinner.",
        "created_utc": 1630593293,
        "id": "hbbjvvx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630622093.0
    },
    {
        "author": "DongKelly32",
        "body": "Look up AS ML (pretty sure they’re private but just being safe). They make the machine that makes shit for Intel, TSMC, AMD, NVDA, etc. and it costs $150m+",
        "created_utc": 1630698475,
        "id": "hbhhl5g",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630727275.0
    },
    {
        "author": "Afro_Superbiker",
        "body": "Here's hoping. I don't think their gpu will be aimed at the gaming market, so I don't think it will garner the same hype that a new release from Nvidia does.\n\nOver time though, especially with investment from the u.s with the aims of developing their u.s fabs, Intel will gain new life.",
        "created_utc": 1630714059,
        "id": "hbieok5",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1630742859.0
    },
    {
        "author": "mistermc90",
        "body": "Tip: just look where the cheap free cashflow to the firm / shareprice is!!!\n \n-BTI, ITB (big tobacco in general) //\n-INTC (semiconductor) //\n-RDSB (big oil/gas cashflow machine) //\n-VZ (telco with strong free CF in an oligopolistic market) //\n-FRE (strong german health company) //\n-VRTX (tremendous value drug company - 10/10 financials)",
        "created_utc": 1630688427,
        "id": "hbguas9",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630717227.0
    },
    {
        "author": "Parallelism09191989",
        "body": "Intel and TSM\n\nEverybody overreacting to AMD leapfrogging Intel.",
        "created_utc": 1630685309,
        "id": "hbgmpm0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630714109.0
    },
    {
        "author": "spongesquare",
        "body": "What happened to Intel?",
        "created_utc": 1630516952,
        "id": "hb7ljkv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630545752.0
    },
    {
        "author": "Overhaul2977",
        "body": "AMD’s profit margin is pretty good, they are taking market share from intel and approaching Nvidia in performance for their GPUs, and they are innovating well under current management. The problem with your analysis is you’re looking at book value, you need to look at future growth and both companies they can take market share have a fair amount higher market cap, meaning it has plenty of space to grow if things keep going well for them. The stock market cares about future growth, not too much on past performance.\n\nTo give you a basic idea of investing, there are four types of companies - Dogs, Cash Cows, Question Marks, and Stars. AMD is at the Question Mark phase that is almost to Star. They are taking market share in a fast growing area. The typical investor strategy in that situation is to “buy”.",
        "created_utc": 1630588805,
        "id": "hbb9kpu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630617605.0
    },
    {
        "author": "jasoncyke",
        "body": "Intel has been such a letdown since it dipped below 60 dollars.",
        "created_utc": 1630549201,
        "id": "hb9lwcm",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630578001.0
    },
    {
        "author": "Jacklewis98",
        "body": "I had a huge feeling Intel would be complacent, through what their management and executives actions towards AMD made me think they thought AMD would go bankrupt before they caught up",
        "created_utc": 1630602240,
        "id": "hbc5x87",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1630631040.0
    },
    {
        "author": "LargeFatherOrtiz",
        "body": "my intc puts are ded",
        "created_utc": 1630608390,
        "id": "hbcladk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630637190.0
    },
    {
        "author": "Summebride",
        "body": "Stocks means stock market securities that you've surely heard of, Microsoft, Intel, JP Morgan, etc.\n\nBonds are a timed instrument where you lend your money to something and they pay it back later, with a slight amount extra.\n\nBonds have traditionally been for old people as they neither go up or down very much, and are predictable.  \n\nStocks can change in value radically and have traditionally been recommended for young  people so if you lose a lot of value, you have time to make it up.  \n\nBlended fund just means a mix of those two kinds of things.  \n\nAt 23 there's no other choice than stock.  \n\nAAR% likely means average annual return.  So if the AAR% was 4% and you have 1000 placed there, it would have gained about $40 during the year.  \n\nBunds are have recently been returning close to nothing.  Someday that might change but for now they're pretty much a worthless option for you.",
        "created_utc": 1630726021,
        "id": "hbj1hwp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630754821.0
    },
    {
        "author": "Trump_Ate_My_Ass",
        "body": "Which is better? 11th gen intel i7-11370H with Intel Iris XE graphics or AMD Ryzen 7 5700U with AMD Radeon graphics?",
        "created_utc": 1630535840,
        "id": "hb8tzt3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630564640.0
    },
    {
        "author": "maz-o",
        "body": "i kinda have this feeling too that intel will crush it in the coming 5 years",
        "created_utc": 1630743630,
        "id": "hbjpyd0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630772430.0
    },
    {
        "author": "SoyFuturesTrader",
        "body": "You know for people who really wanted to make money they’d go spent some time doing intel work in the DoD then maybe operations officer at the CIA then go off grid and spy on all the people with info in the know \n\nThen buy SPY call and put FDs accordingly",
        "created_utc": 1630642995,
        "id": "hbep0nq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630671795.0
    },
    {
        "author": "Afro_Superbiker",
        "body": "Great points, cheers! \n\nIntel is one of my value picks in my portfolio, and I hope their value is recognized in the future. \n\nThe stock price of AMD is ridiculous compared to them.",
        "created_utc": 1630633211,
        "id": "hbe5i3a",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1630662011.0
    },
    {
        "author": "Imaginary_Trader",
        "body": "Interesting comment on AMD and KISS. I bought in pre-zen too, thought it looked promising, but did in no way think that Intel would be on 14nm for so long. Maybe I didn't research enough about Intel and the going-ons there but it's still shocking to me that AMD was able to bridge such a gap.",
        "created_utc": 1630602051,
        "id": "hbc5g3u",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1630630851.0
    },
    {
        "author": "papasmurftp",
        "body": "Yes he's looking for some intel",
        "created_utc": 1630514673,
        "id": "hb7fx2t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630543473.0
    },
    {
        "author": "BooBeef",
        "body": "Yes but it would have to grow 1500% for its current evaluation to be a fair price. It’s market cap is more then half of Intel’s but AMD makes 6 billion in revenue while INTEL makes 78 billion in revenue. So it’s potential growth is more then priced in, it can only go down from here",
        "created_utc": 1630591171,
        "id": "hbbewh1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630619971.0
    },
    {
        "author": "shortyafter",
        "body": "You don't have anything like Tesla or ARK funds, which is good.  I'm not deeply familiar with most of these companies, so I don't know what their revenue streams or growth prospects look like.  What I can say is that a lot of those names have been trading very high lately... AMD, Nvidia, TSM, ASML, etc. Those companies in particular all seem to have bright futures, but if there is any significant correction in tech stocks, you're very exposed, especially if you bought recently at high valuations.  You'll have very little margin of safety.\n\nAnd if there's any broader economic disruption, it's possible that not all of these companies make it out safe and sound, or at least as healthy as you'd like to seem them given current valuations.\n\nFor example, even good companies like Cisco didn't make it out in one piece from the dot-com bubble.  And old industry leaders like IBM and Intel have gotten hammered in the past two decades, while Microsoft made something of a surprise comeback after being declared dead around 2012.\n\nThe point is that if you've bought growth stories, that's OK, but it seems your whole portfolio is growth stories.  It's forward-looking.  Which is the idea, in a way, but IMO you want at least some of your portfolio dedicated to something that is solid in the present, and doesn't rely on a growth story in order to generate or even maintain returns.  The benefit of an ETF is you get a bit of everything, and even QQQ is quite diversified compared to your portfolio.  \n\nI'm new but this is my understanding of things.  I hope it made sense.",
        "created_utc": 1630586622,
        "id": "hbb54en",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630615422.0
    },
    {
        "author": "BooBeef",
        "body": "Look at intel before 2017 - 2018. They were never increasing core counts on there desktop processors, and only did so at the end of 2018 early 2019 when AMD started releasing there RYZN and Thread-ripper  chipsets",
        "created_utc": 1630717596,
        "id": "hbillm3",
        "score": 1,
        "subreddit": "investing",
        "created": 1630746396.0
    },
    {
        "author": "Xerxes897",
        "body": "AMD is like a 2 year play at minimum. Got to be patient while they steal all the market share from Intel.",
        "created_utc": 1630691489,
        "id": "hbh1lmz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630720289.0
    },
    {
        "author": "notnagash",
        "body": "According to an article on NASDAQ Intel is 63% undervalued, i am pretty new to active investing and don't know mucj but I am expecting Intel to go pretty high if their gpu doesn't suck, maybe not as ridiculous as AMD but probably over their intrinsic value",
        "created_utc": 1630669948,
        "id": "hbfp5lm",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1630698748.0
    },
    {
        "author": "Overhaul2977",
        "body": "Yes however intel’s revenue is primarily driven by long-term contracts that were written when they were ahead. AMD is now ahead and those contracts will expire. A lot of investors expect AMD to win those contracts when they come up for renewal. Will that happen? Who knows. A lot of US govt. contracts are still being renewed with intel because intel manufacters their chips in the US.\n\nI personally don’t see AMD as over-priced for its potential, but I do believe most of its potential is now priced-in unless a major positive event occurs. I see more downside risk in the event intel makes a breakthrough (although that is highly unlikely for awhile) or a negative event occurs. \n\nRegardless, AMD’s run up is backed by fundamentals and reasonable expectations. There are definitely major downside risks since it has a P/E of almost 40, but it can definitely grow into that P/E if it continues its current trajectory. The biggest problem with AMD is their value isn’t primary driven by its own performance, but the poor performance of its competitor, which makes the investment a bit risky.",
        "created_utc": 1630602453,
        "id": "hbc6gic",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630631253.0
    },
    {
        "author": "MonoDun",
        "body": "&gt;**Someone close to Larry Fink told a friend of a friend he says 'Merv what if Tesla, Amazon, Intel collab on starting a datacenter, GPU, AI chip plant here in Texas, Fink's good for a billion, Biden will get about 10 billion approved and the other players add 9 billion poof no more chip shortage, in fact we flood the market to bankrupt the competition [Fink loved that part] Bidens going to announce it on Tuesday at 9:00 am, to calm the market, along with the rest of the new stimulus package.**   \n  \nThis is purely anecdotal, you have the right but not the obligation to believe it or not.",
        "created_utc": 1630730923,
        "id": "hbj9liu",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1630759723.0
    },
    {
        "author": "Xx_Majesticface_xX",
        "body": "No, I’m saying that there’s going to be a new stock in 2022 that will allow you to have access to a company with 15% of the market share in regards to cheap consumer electronics. I’m sorry but TSMC is a stock that every investors knows about, it’s not a bad stock but you aren’t going to get good returns. Invest in it, but I’m telling you about a stock that will probably succeed as GF isn’t going away. You obviously aren’t involved with computer and consumer electronics to know that it isn’t just TSMC, Samsung, and Intel, and that it isn’t just cpus and gpus, cars and fridges. The market is much larger than you think, and there are other companies you should be looking at. Invest in TSMC, you’ll still get a return, but don’t insult me over a stock that will also get you returns that’s opening in a few months. TSMC isn’t the next dodge coin, it’s basically apple or Amazon, a stock which won’t go down in price but also won’t see a huge jump as people have already invested in it.",
        "created_utc": 1630715301,
        "id": "hbih3j5",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1630744101.0
    },
    {
        "author": "VolatilityBox",
        "body": "Extremely strong business but the p/e overshoots their growth slightly. I know it's a long shot but Intel might catch up as a secondary player and take market share from them, given that they're subsidized by the US govt.",
        "created_utc": 1630618395,
        "id": "hbd9xy7",
        "score": 0,
        "subreddit": "stocks",
        "created": 1630647195.0
    },
    {
        "author": "-bjorn",
        "body": "Intel on what? 👀 ^^/s",
        "created_utc": 1630516989,
        "id": "hb7lmw0",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1630545789.0
    }
]