[
    {
        "author": "thetagodfather",
        "body": "T is the IBM / GE of telecom\n\nRandomly buy junk companies, fail to integrate the, sell other companies \n\nThen play all kinds of equity games without innovating or driving organic growth",
        "created_utc": 1638356257,
        "id": "hms6rx1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638385057.0
    },
    {
        "author": "AlE833",
        "body": "I don’t disagree with you. You could be right about the FAANG stocks. All I was saying is that technology is increasing exponentially and those companies are in the best position to take advantage, unless another Apple comes along. It’s crazy to see but think back to 2000, and where we have come in the last 20 years. Either those FAANG stocks will go the way of IBM or I’m betting they will innovate and become even bigger. \n\nI think Amazon could break out next year. It’s traded sideways for two years mainly due to investments they are making in infrastructure. \n\nWith small caps you could be right about that. But I’m sticking to what I know. I don’t know anything about small caps. With value plays you can’t go wrong with stocks like Costco, Walmart etc.",
        "created_utc": 1638402626,
        "id": "hmv46te",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638431426.0
    },
    {
        "author": "Flaky-Illustrator-52",
        "body": "For Amazon at least, I can only see AWS losing market share in the long term. I use Oracle Cloud for my hobby projects simply due to its affordability and making many of their services compatible with or flat out running on FOSS projects (odd that Oracle would make something like this considering its history as a company run like a mafia). \n\nOnce they add a CDN I will have zero reason to use AWS except for work since AWS pricing is just too high considering the competition it is facing.\n\nGoogle Cloud Platform has some room to grow, but it has embraced a multi-cloud type of strategy and is making tools to facilitate that so I can see their market share increasing long term... maybe. I can't speak to them as I haven't used GCP before.\n\nAzure seems like the slightly cheaper knockoff AWS without signed cookies in its CDN which even GCP has. Not sure about this since I don't use Azure.\n\nIBM cloud is... ew... and Alibaba/Yandex clouds... we don't talk about those. But maybe some companies will use IBM if that company gets its shit together like Oracle did. For now the only reason to use IBM is if you use DB2 or something. IBM cloud is way overpriced.\n\nTl;dr AWS will lose market share in the long term",
        "created_utc": 1638403493,
        "id": "hmv66xk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638432293.0
    },
    {
        "author": "ejMileman",
        "body": "If you can’t trust China at all then dump the biggest most China dependent stocks first.  No not baba or 10cent.  Ask yourself, where does Foxconn (Chinese company) bios every Apple phone? Where does Tesla build and sell half of its cars? Where does ibm and Oracle do most of their consulting.  If you don’t trust China, you better go back to the cave.",
        "created_utc": 1638414875,
        "id": "hmvwegi",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638443675.0
    },
    {
        "author": "ModsNeedParenting",
        "body": "Nah, OP is misinformed. IBM just bought another company in that field.\n\nIBM is leading in that field and has a lot of synergy with Hybrid Cloud as it is closer to manufacturer, server hardware and government contracts. IBM makes a lot of money from digital transformation and Hybrid Cloud is one of it.\n\n\nSome industries cannot use regular cloud.",
        "created_utc": 1638494543,
        "id": "hn0cyne",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638523343.0
    },
    {
        "author": "RationalExuberance7",
        "body": "Yea, Alibaba doesn’t meet my personal 3 criteria. So it’s not the top 3. \n\nBut it’s so cheap that it deserves a strong position. Even with all the risks mentioned and the delisting risk. This is my Munger copy - hopefully it’s not his version of Buffett’s IBM.",
        "created_utc": 1638652279,
        "id": "hn8obeq",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638681079.0
    },
    {
        "author": "cats-with-mittens",
        "body": "INTC is in the same league as IBM? That's a pretty morbid take on Intel.",
        "created_utc": 1638410751,
        "id": "hmvmuhx",
        "score": 1,
        "subreddit": "investing",
        "created": 1638439551.0
    },
    {
        "author": "absurd_logic589",
        "body": "I prefer working with GCP out if all of them. Had to do some contract work on IBM cloud it was not to bad actually. They are all really about the same though and it ultimately comes down to cost.",
        "created_utc": 1638462443,
        "id": "hmy4plq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638491243.0
    },
    {
        "author": "gsasquatch",
        "body": "Oracle and IBM have overpriced products aimed at big money customers.   \n\nYou don't use Oracle or IBM unless you have to.  They are way overpriced and needlessly obfuscated.   If you can get away with not using them, you save yourself some money and not use them.    You need grey neck beards to make their stuff work.  \n\nI like that Larry was involved in the America's cup, but he cheated.  Technically, pumping was allowed in the rules that he wrote but that's not sailing, it's paddling.   He's a douche canoe, and his database sucks ass.\n\nIBM was doing cloud computing 30 years ago, which is kind of ironic that their stuff wasn't used for it.   It's also ironic that as the world moves away from or hide the POSIX model, everything is looking more like an AS400.     IBM kind of missed out on this hypertext fad, and that was their death knell.   Maybe Watson can save them, but it might be a gimmick.    \n\nCisco did a nice job of getting all the \"I want a lucrative career in IT\" pups trained in on their stuff, essentially locking themselves in as the de-facto standard.   Nobody really cares about the wires in the wall though, it's always a cost center 2 layers deep.",
        "created_utc": 1638458822,
        "id": "hmxvpk8",
        "score": 1,
        "subreddit": "investing",
        "created": 1638487622.0
    },
    {
        "author": "LastPotato1214",
        "body": "Could've said the same about IBM, ATT, and GE not too long ago.",
        "created_utc": 1638500571,
        "id": "hn0qoay",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638529371.0
    },
    {
        "author": "davidbigham",
        "body": "Fking boomer Intel and IBM is green today.   Classic",
        "created_utc": 1638548826,
        "id": "hn30ddm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638577626.0
    },
    {
        "author": "steaveaseageal",
        "body": "Market wants us to buy into ibm like boomers? Or wat",
        "created_utc": 1638548416,
        "id": "hn2zc79",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638577216.0
    },
    {
        "author": "Asset_value_cash",
        "body": "!banbet  IBM 122 2w",
        "created_utc": 1638689556,
        "id": "hnat5f0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638718356.0
    },
    {
        "author": "gnnr25",
        "body": "Ford is the IBM of the auto industry. A behemoth that's too old and slow to move with the modern high growth large caps.",
        "created_utc": 1638720196,
        "id": "hnc3f00",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638748996.0
    },
    {
        "author": "Alpha_Trader_",
        "body": "INTC CSCO ORCL IBM have been ‘value traps’ for years. You literally could make this same argument every year for the past 10 years and still lose money.",
        "created_utc": 1638397466,
        "id": "hmusats",
        "score": 1,
        "subreddit": "investing",
        "created": 1638426266.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "Those are old technologies that have been already implemented in the induatry. Innovation is TSMCs SoIC.\n\nIt's like saying Intel was innovating when they soldered the metal heat piece onto the chip instead of how they used to glue it and leave a small gap. That's not innovation, that's being lazy and catching to standards. Users, like myself, had to take off the metal piece and put on copper instead to deal with excessive heat.\n\nIf you think that's innovation, power to you. Personally, I purchase products that aren't faulty out of the gate with tech/design that's already standard in the rest of the industry. You should also consider IBM if that's innovation for you.",
        "created_utc": 1638478795,
        "id": "hmzb9yv",
        "score": 1,
        "subreddit": "investing",
        "created": 1638507595.0
    },
    {
        "author": "RichieWOP",
        "body": "\nCompare the numbers on the following:\n\nVoxtur vs DocuSign (even with it falling 45% yesterday)\n\nEmerge Commerce vs Etsy\n\nAcuityAds vs The Trade Desk\n\nColumbia Care/Ayr Wellness and Verano vs Canopy Growth and Tilray\n\nConverge Technology Solutions vs IBM\n\nQuisitive Technology Solutions vs PayPal\n\nCloudMD and Reliq Health vs TelaDoc\n\nFansUnite vs DraftKings\n\nNanalysis Scientific vs TMO and Intuitive Surgical\n\nWhitecap Resources vs Exxon and Chevron\n\nPine Cliff Energy vs Tellurian\n\nTenet Fintech vs Upstart and Affirm\n\nAnd believe it or not I'm not even close to done. I am very serious when I say the Canadian small cap market is EXTREMELY cheap right now.",
        "created_utc": 1638649658,
        "id": "hn8ia7l",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638678458.0
    },
    {
        "author": "psykikk_streams",
        "body": "AWS is the big ol elephant in the room  and nobody in the near future will be able to even move that thing even tiny bit.   \n\n\nAzure / MSFT will increase its market share. thats about it. \n\nthere are already TONS of \"cloud service providers\" who in reality use AWS / Azure infrastructure.  as AWS / Azure adoption and multi-cloud-connectivity will become even easier as it already is, most application service providers will never worry / want to care about the actual infrastructure. \n\nall they want is scaleavle infrastructure at their fingertips. \n\nboth MSFT and AWS will be working heavily towards easier adoption and easier integration.\n\nI do not see anyone even close to being able to recplicate / compete on that scale. \n\na few yars ago people predicted Facebook (now Meat) becoming the next big competitor.   \nand Google. even IBM. \n\nwell, no. \n\nit would take MASSIVE amounts of cash and ressources to compete with both at the level they are at right now. \n\nthe only thing that would REALLY shake things up is a change in legislature and regularory goverance. aka monopoly breakups and such.",
        "created_utc": 1638447368,
        "id": "hmx8qqe",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638476168.0
    },
    {
        "author": "doctorzaius6969",
        "body": "IBM has given up on hybrid cloud? I thought that was their last hope",
        "created_utc": 1638440176,
        "id": "hmwze0c",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638468976.0
    },
    {
        "author": "vibrantbeige",
        "body": "Bought bunch of puts from lots of companies like amgen, jnj, IBM, chevron, exxon Mobil. Lost money on some but made a but of money from others (like 30% or so each time)",
        "created_utc": 1638440558,
        "id": "hmwzueu",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1638469358.0
    },
    {
        "author": "spacebizzle",
        "body": "Stephanie Link is one of the only people on CNBC with brains, nobody wants value stocks now but in software they’re going to outperform a lot of these cloud hype stocks next year.  IBM is viewed as a dino but still makes $75B revenue per year at the same market cap as SNOW which barley makes $1B.  \n\nSNOW will probably never make $75B and IBM, ORCL and MSFT will crush them if they start picking up steam.  Downtrend has already happened with Zoom, DOCU, TEAM, DDOG, NET and other high fliers.",
        "created_utc": 1638381365,
        "id": "hmtm6ae",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638410165.0
    },
    {
        "author": "_grey_wall",
        "body": "Ibm ruined redhat.  And pretty much everything else they touched.  Evil.",
        "created_utc": 1638380970,
        "id": "hmtl4y2",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1638409770.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "INTC, CSCO and IBM all fall into that set of thoughts.   Likely one or two may work out.  Maybe all 3.  I suppose if I was making that investment I would spread my investment across all 3.",
        "created_utc": 1638375683,
        "id": "hmt7oze",
        "score": 1,
        "subreddit": "investing",
        "created": 1638404483.0
    },
    {
        "author": "badgebruce",
        "body": "\"For the next few weeks, there could be a viable bullish trade in IBM. It has recently corrected 20% off the 2021 highs. More importantly, the stock has fallen into a substantial consolidation zone. These usually attract buyers looking for bargains...The conclusion then is that there is potentially more upside than downside risk from here.\"\n\n[link](https://investorplace.com/2021/12/trade-ibm-stock-tactically-into-the-new-year/)",
        "created_utc": 1638550181,
        "id": "hn33slr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638578981.0
    },
    {
        "author": "FullCopy",
        "body": "Nah, those were deadman walking for a long time. \n\nIBM missed the Cloud. They were doing time sharing on servers in the 60s. \n\nATT acquires companies to kill them \n\nGE - jet engines maybe.",
        "created_utc": 1638501128,
        "id": "hn0rxfc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638529928.0
    },
    {
        "author": "SaltyKrew",
        "body": "Intel is a stock that is going downhill. They’re far behind in the chip game, like 2-3 years. AMD is reducing supply issue by opening contracts with Samsung because AAPL is hogging the 3nm at TSMC. Intel draws way too much power with their products (probably due to their node size), why would a data center want to continue to use them when they can save millions with AMD/NVDA? \n\nBesides, IBM/Cisco isn’t a fair comparison because Lisa Su isn’t exactly an incompetent ceo. With the XILINIX deal and constant signings with data centers, they’re well poised to stay ahead of Intel in terms of stock growth. Intel could come back but they’re seriously not that innovative as they used to be.",
        "created_utc": 1638665317,
        "id": "hn9iobk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638694117.0
    },
    {
        "author": "KahlVados",
        "body": "Intel if the the tech savvy. I own IBM and that is nicely up today. Better stay away from these modern technology plays!",
        "created_utc": 1638591306,
        "id": "hn5nwkp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638620106.0
    },
    {
        "author": "-C20H24O3",
        "body": "Same. IBM and INTC about the only 2 things not killing me rn",
        "created_utc": 1638591367,
        "id": "hn5o0vr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638620167.0
    },
    {
        "author": "notapersonaltrainer",
        "body": "The Bitcoin network is a payment rail. It can be used to send BTC or dollar stablecoins through Lightning. \n\nVenmo is a closed network that works with other Venmo users. It and Paypal, Cash, every Bitcoin wallet, exchanges, Lightning, Twitter tips, Bitcoin ATMs, and more every day etc all plug into Bitcoin. \n\nBitcoin isn't a Venmo competitor, it's an open source SWIFT/Fedwire competitor. A better comparison is TCP/IP versus whatever proprietary shit IBM intranets were using to move data around.",
        "created_utc": 1638579905,
        "id": "hn50uno",
        "score": 1,
        "subreddit": "investing",
        "created": 1638608705.0
    },
    {
        "author": "sunnagoon",
        "body": "Brk.b, Intel, PM, OIH, Atvi, Fb, cvx, xom, eog, pxd, dow, lmt, ML, Amzn, hood (lol I know), C, PYPL, SLB, AXP, BABA (119 avg pride), IBM, DIS, RIO, UBER \n\nown most of these close to their recent lows.",
        "created_utc": 1638715874,
        "id": "hnbtsq0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638744674.0
    },
    {
        "author": "whatisevenavailable",
        "body": "Trash companies like Intel or IBM? Lol you are tripping",
        "created_utc": 1638749669,
        "id": "hne872a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638778469.0
    },
    {
        "author": "absurd_logic589",
        "body": "I made good money betting on IBM",
        "created_utc": 1638374642,
        "id": "hmt54hi",
        "score": 1,
        "subreddit": "investing",
        "created": 1638403442.0
    },
    {
        "author": "X-Zed87",
        "body": "Company is growing 30% YOY revenue, and priced like IBM which has had flat growth for 5 years. Sure FB is not the shining star anymore, but Fb is still growing, and Insta and WhatsApp and Occulus have a lot of tailwinds going forward. I agree the Reg issues are a risk, but usually nothing comes of them. FB probably has one the the strongest legal teams in the world at this point lol.",
        "created_utc": 1638418134,
        "id": "hmw3ctg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638446934.0
    },
    {
        "author": "FEDD33",
        "body": "Wish it was Nvidia instead of IBM.\n\nThe rest are pretty solid though.",
        "created_utc": 1638424038,
        "id": "hmwe960",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1638452838.0
    },
    {
        "author": "88crypto",
        "body": "Confirmation bias. It happened once, and you call it a pattern. One obvious thing,  it's on a downtrend. If stock goes up long term with good fundamentals - it will continue go up long term (look nvda, aapl, amd). Dinosaur shitstock (ibm, t, ge) will continue drilling. But you think this time is be different. This \"buying the dip\" mentality is like a desease here",
        "created_utc": 1638424965,
        "id": "hmwfrv0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638453765.0
    },
    {
        "author": "SuperSultan",
        "body": "Oracle has too much debt on its balance sheet. Cisco and IBM I don’t know too much but Intel has the potential to be a multibagger",
        "created_utc": 1638423788,
        "id": "hmwdtw2",
        "score": 1,
        "subreddit": "investing",
        "created": 1638452588.0
    },
    {
        "author": "gsasquatch",
        "body": "Intel usually has the fastest CPU on the market,  they tend to be more power efficient, and more expensive.    I haven't shopped for a CPU in a couple years though, so I don't know what's going on right now.  2 years ago Intel was king of the hill with the fastest and most expensive and I suspect they will regain that title soon enough, if history is any lesson, that title has been going back and forth ever since AMD was first able to capture it 10-15 years ago.\n\nIt's probably different now that servers are commoditized and in the cloud, but it once was only Intel for if you needed Microsoft stuff or IBM for real work in the server room.  AMD was just consumer level stuff.   Linux and VMWare lets real work happen on Intels.   Intels did better with VMware initially putting the segmenting into the chip.    \n\nThat Linux on consumer chips kind of supplanted IBM might be cautionary in that IBM was bluechip, and is now becoming somewhat of an also-ran.  \n\nIntel defined the standard, the \"x86\" and AMD followed it.  There's Moore's law, but who did Moore work for?  As of March 2021 Moore is worth $12.1B.\n\nI hardly consider Intel to be an underdog, that's new.  \n\nAs a stock, it's kind of boring.   I suppose I wouldn't expect huge gains like the recent Nvida stuff, but my sense is the company is pretty solid.  It's PE is much lower than AMD.   I own some INTC  because I thought it was a value, and consider it somewhat bluechip.",
        "created_utc": 1638457199,
        "id": "hmxrvxw",
        "score": 1,
        "subreddit": "investing",
        "created": 1638485999.0
    },
    {
        "author": "MenArePigs69",
        "body": "Tech boomers. Better off holding Nvidia or AMD. Next you’ll be shilling IBM.",
        "created_utc": 1638373016,
        "id": "hmt15gi",
        "score": 1,
        "subreddit": "investing",
        "created": 1638401816.0
    },
    {
        "author": "DDRaptors",
        "body": "IBM was probably requested for the dividend, lol.",
        "created_utc": 1638395376,
        "id": "hmumxn4",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1638424176.0
    },
    {
        "author": "DangerouslyCheesey",
        "body": "This is an argument for crypto, not Bitcoin.  Computers changed the world, but where is IBM now?  So did the internet, but Yahoo is gone.  Bitcoin feels like those to me: an early titan whose position in its prime felt unassailable, but with fatal flaws that left it unable to adapt to changes in the very fields it dominated.",
        "created_utc": 1638658613,
        "id": "hn933kl",
        "score": 1,
        "subreddit": "investing",
        "created": 1638687413.0
    },
    {
        "author": "Live_Jazz",
        "body": "They are going to be the IBM of the metaverase.",
        "created_utc": 1638504374,
        "id": "hn0yz2y",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638533174.0
    },
    {
        "author": "skilliard7",
        "body": "&gt; Intel draws way too much power with their products (probably due to their node size), why would a data center want to continue to use them when they can save millions with AMD/NVDA?\n\nIntel has been making a lot of improvements in this space and are on track to catch up.\n\nOne issue with AMD is software compatibility and reliability. Even if switching to AMD can save a few thousand dollars on energy costs, the costs associated with bugs resulting from driver issues can be much greater.\n\n&gt;Besides, IBM/Cisco isn’t a fair comparison because Lisa Su isn’t exactly an incompetent ceo.\n\nI never said she was. I think she's a great CEO, one of my favorite. But the stock is overvalued, nothing she can do about that. I'd happily buy AMD stock if their price drops below $50.\n\n&gt;Intel could come back but they’re seriously not that innovative as they used to be.\n\nAnd I'd argue that even if they don't innovate and just continue on autopilot for the next decade, they'll still outperform Nvidia and AMD, because AMD and Nvidia still have an insane amount of growth priced into their stock already.",
        "created_utc": 1638665822,
        "id": "hn9jtr5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638694622.0
    },
    {
        "author": "Robber_Rob",
        "body": "BABA, RDS.B, V, IBM, ZIM",
        "created_utc": 1638589200,
        "id": "hn5jreo",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638618000.0
    },
    {
        "author": "niyrex",
        "body": "There is value in large institutions that solve industry wide problems.  Both IBM and Intel fit that bill.  Even though you may not know it, you use IBM tech  daily.",
        "created_utc": 1638679294,
        "id": "hnacj8y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638708094.0
    },
    {
        "author": "WeekendInteresting13",
        "body": "Who else thinks it takes a shit at open?",
        "created_utc": 1638362615,
        "id": "hmsfpg6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638391415.0
    },
    {
        "author": "krzen",
        "body": "It wasn’t involved in the process?",
        "created_utc": 1638358421,
        "id": "hms9k08",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638387221.0
    },
    {
        "author": "geltance",
        "body": "so it will go either up or down?",
        "created_utc": 1638357024,
        "id": "hms7qng",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638385824.0
    },
    {
        "author": "hshamza",
        "body": "I lost my worn out leather wallet at a ARK conference, so I walked up to Cathie and asked her to please leave the room.\n\nShe said, \"that makes sense, less people should make it easier to find\".\n\nI replied, \"it's more because every time I catch a glimpse of your skin I think I found it\".",
        "created_utc": 1638347157,
        "id": "hmrw4sx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375957.0
    },
    {
        "author": "TheTechnicalTrader",
        "body": "It could also be done by going to the casino and putting everything on black. You’re forgetting the part where he would have to risk all of his money to make these kind of returns, most likely ending up losing everything.",
        "created_utc": 1638348653,
        "id": "hmrxx6o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638377453.0
    },
    {
        "author": "Interfecto",
        "body": "Nope, I was listening to a podcast and the host mentioned the doc, so I watched it and now I’m sad 🏎☹️",
        "created_utc": 1638348666,
        "id": "hmrxxt3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377466.0
    },
    {
        "author": "NatureTripsMe",
        "body": "I don’t know what you’re trying to say. It was more a covid thing since demand shrank 3%. Of course production had to shrink if you want to make money as a producer. And it did by 5%.  I look at data from EIA to determine production and then subtract consumption. This is really some standard stuff here. Not sure why you’re being weird about it. I found a Forbes piece from a chemical engineer whom has worked in the oil industry who describes a similar approach but is way better at describing the nuances:\nhttps://www.google.com/amp/s/www.forbes.com/sites/rrapier/2021/11/14/is-the-us-energy-independent/amp/",
        "created_utc": 1638346851,
        "id": "hmrvr62",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638375651.0
    },
    {
        "author": "ChiseledTwinkie",
        "body": "$PRTY is failing me. I bought the dip, it dipped more. Bought the dip. Dipped more. Bought some more dip today, let's hope it recovers. Omicrons a nothingburger",
        "created_utc": 1638348372,
        "id": "hmrxkvx",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1638377172.0
    },
    {
        "author": "No-Version-2123",
        "body": "Morning swaps it was a painful day to say the least",
        "created_utc": 1638348275,
        "id": "hmrxgsq",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1638377075.0
    },
    {
        "author": "McRich1",
        "body": "Last year, many WSB members were holding PLTR Dec calls.  All of them lost their money.  This year on Dec 2021. It would be #Wish.",
        "created_utc": 1638349140,
        "id": "hmryhu2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377940.0
    },
    {
        "author": "Frank_Boobtitsky",
        "body": "It shrinks?",
        "created_utc": 1638349199,
        "id": "hmrykb6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377999.0
    },
    {
        "author": "No-Negotiation-3128",
        "body": "Yes why not ;)\nLook:\n\n Evofem Biosciences, Inc. EVFM announced that it has entered into a definitive agreement with Keystone Capital Partners (\"Keystone Capital\") providing for the issuance and sale of an aggregate of 10,000 shares of Series B Convertible Stock in a registered direct offering for a purchase price of $1,000.00 per share.\n\nhttps://www.google.com/amp/s/finance.yahoo.com/amphtml/news/evofem-biosciences-announces-10-million-103100774.html",
        "created_utc": 1638349622,
        "id": "hmrz23z",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1638378422.0
    },
    {
        "author": "Upper-Equivalent3651",
        "body": "thanks.\n\nHope they are not there as crazy as here when it comes to debts",
        "created_utc": 1638345675,
        "id": "hmru9oo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374475.0
    },
    {
        "author": "ThatsHonestlyWildBro",
        "body": "TQQQ gonna absolutely moon in the morning ....back to where it was 1 week ago",
        "created_utc": 1638346102,
        "id": "hmrutcp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374902.0
    },
    {
        "author": "OogdayAyday",
        "body": "I've always wanted to try this, so today is the day I do it.\n\n\"FIRST\"",
        "created_utc": 1638346105,
        "id": "hmruti8",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638374905.0
    },
    {
        "author": "rolfie13",
        "body": "If you need to ask us, you're not ready. That being said, if you do decide to make this trade you're absolutely going to need to do two things beforehand. \n\n-Set a stop loss. Options are very volatile. What happens if you wake up one day and this call is down 30%? You won't know how you'll feel until it happens, and you won't be in the right frame of mind to make decisions after it has. This could very easily turn into a trade where you lose 100%. Pick a point, say 50% or whatever you're comfortable with so you can live to die another day.\n\n-Determine where you're going to take profits. This can go the other way too. You wake up to check on your option and it's up 100% just a couple weeks after opening the position. You're once again in a position where you aren't able to make unbiased decisions, and it can just as well go to zero still. These ones are the most demoralizing.\n\nWrite both your stop loss and take-profit point down on a physical piece of paper. It's more effective when it's staring you in the face. Good luck.",
        "created_utc": 1638345880,
        "id": "hmruj5x",
        "score": 1,
        "subreddit": "options",
        "created": 1638374680.0
    },
    {
        "author": "sgalligan17",
        "body": "It just has to do slightly worse than last month 🤷‍♂️",
        "created_utc": 1638346437,
        "id": "hmrv8iq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375237.0
    },
    {
        "author": "bitt3n",
        "body": "what's the advantage of buying it back before the end of the year?",
        "created_utc": 1638348558,
        "id": "hmrxt0j",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1638377358.0
    },
    {
        "author": "Electrical_Raisin_93",
        "body": "I was trading spy daily as well, it's hard and full of traps, nothing to rely on it, change your strategy",
        "created_utc": 1638348559,
        "id": "hmrxt17",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377359.0
    },
    {
        "author": "Rothiragay",
        "body": "BABA is surely going to be targeted by tax loss harvesting. Almost everyone who bought this year is holding it at a loss.",
        "created_utc": 1638349527,
        "id": "hmryy91",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638378327.0
    },
    {
        "author": "badasschap",
        "body": "It means GOLDMAN SACHS - MARKET HAS NOW PRICED IN A MAMMOTH C.7 MB/D NEGATIVE DEMAND HIT OVER THE NEXT THREE MONTHS, WITH NO OFFSETTING OPEC+ RESPONSE",
        "created_utc": 1638346283,
        "id": "hmrv1l7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375083.0
    },
    {
        "author": "Hot-Context8284",
        "body": "Just buy low, sell high. Don’t make it complicated",
        "created_utc": 1638346799,
        "id": "hmrvorf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638375599.0
    },
    {
        "author": "PeekingPotato",
        "body": "that sucks mate, but I´m sure it will go up again",
        "created_utc": 1638347746,
        "id": "hmrwtts",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638376546.0
    },
    {
        "author": "Upper-Equivalent3651",
        "body": "Well, the QE fucked a lot of things up, wouldnt you say?\n\nJust taking a look at treasuries and you cry. There was a time when you got interests for the risk you are taking the loaner goes bust. Now it seems all rules are out of the window.\n\nOne look at treasuries of Greece and my eyes go blank.\n\nNot even talking about sanctions. Fucked a lot of things up too. Or when people just do their own sanction thing (yes, clearstream, euroclear and whatever you call yourselves, I am talking to YOU!)\n\nAh well. You win one, you lose one.",
        "created_utc": 1638347943,
        "id": "hmrx2bm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376743.0
    },
    {
        "author": "Ozzy4253",
        "body": "Quantum computing stonk. Decades-long play.\n\nHigh risk high reward. But I'd it pulls off what it intends, it will impact virtually every city. Our science fiction stories of the future would be impossible without a QC at million qubits.",
        "created_utc": 1638345601,
        "id": "hmru65t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374401.0
    },
    {
        "author": "FoodCooker62",
        "body": "Do not listen to them. Nvidia at the current valuation is one of the biggest bubbles in the market. It should be $150 max and even then it's overvalued.",
        "created_utc": 1638345622,
        "id": "hmru77h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638374422.0
    },
    {
        "author": "MrMeeseeks987",
        "body": "Disney dropping to $100? It was around $100 when covid happened. I can’t see it going that low",
        "created_utc": 1638347840,
        "id": "hmrwxy0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638376640.0
    },
    {
        "author": "DenuvoSuks",
        "body": "He's timing was definitely not the best. We knew a long time this was coming, but announcing it when the covid was starting to make people nervous makes no sense. It could make it crash so hard he had to postpone it.",
        "created_utc": 1638348175,
        "id": "hmrxcf5",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638376975.0
    },
    {
        "author": "yaboiRich",
        "body": "as if sensing my presence it let out a big bellow. I said eeeeasy there big fella!",
        "created_utc": 1638348183,
        "id": "hmrxcsr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376983.0
    },
    {
        "author": "xcheezeplz",
        "body": "That's what oil does, it's not algos, the price is literally influenced by a cartel deciding what it should be. Now mix in market uncertainties and what else would you expect? \n\nUsually it only takes 2 times getting fucked trading oil before people swear it off.",
        "created_utc": 1638348207,
        "id": "hmrxdt7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377007.0
    },
    {
        "author": "DontWantUrSoch",
        "body": "Haha I love that..\n\nI understand this product seems exclusive/vanity for the very top 1% or perhaps it comes off as a reality to people in a distant future like 2050..however, just to explain, if they can take me from lower Brooklyn to any NYC airport in under an hour for 200usd or less I think that would make it worth it for so many people around the world, not just your average decently well of New Yorker. An Uber/cab would be around that price and it would slower… the train could be an option for some but it can be crowded, unreliable, and 100% disgusting.\n\nI say all these EvToad companies are overpriced, and many will not exist in the future but I do want the tech to enter our cityscape and soon.",
        "created_utc": 1638348219,
        "id": "hmrxebq",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638377019.0
    },
    {
        "author": "Phantom_Journey",
        "body": "Yeah, I sold a ton of VIX calls Wednesday at 20. I bough puts at 24 and 28. Didn’t cashed out when 5K up. I closed it flat. Now I’m back in for a month this time, waiting for some change. It’s.. fucking annoying.",
        "created_utc": 1638348966,
        "id": "hmryanq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377766.0
    },
    {
        "author": "InsertCatchyUserHere",
        "body": "I appreciate your thoughts in this section in particular:\n\n&amp;#x200B;\n\n&gt;What if my focus is entirely on rolling the short leg for credit? A completely different and legit way to think of a PMCC is that the long is something I expect to recoup for 0 net gain, it's just there to anchor the short legs...\n\n&amp;#x200B;\n\nI've recently been diving into PMCCs and have taken this outlook. I'm not particularly buying a LEAPS expecting it to be profitable when expiry comes around, I'm buying it for the privilege of selling CCs against it and extracting my profit from it one contract at a time. Any value still remaining near/at expiry is just an added bonus.",
        "created_utc": 1638348979,
        "id": "hmryb6h",
        "score": 1,
        "subreddit": "options",
        "created": 1638377779.0
    },
    {
        "author": "Fun-Marionberry-2540",
        "body": "Haha, alright. Fair enough.\n\nI guess I said what I said because I wanted to convey that I'm offsetting the interest payment with a short call. And if somehow that was novel or not, but I understand that you're saying the interest payment is for some other asset not the option, but in my mind it works differently because of the action path I've taken.\n\nSo Ok, \"Leveraged PMCC with Interested on Loan for other securities covered Strategy!\"",
        "created_utc": 1638345872,
        "id": "hmruisg",
        "score": 1,
        "subreddit": "options",
        "created": 1638374672.0
    },
    {
        "author": "AlwaysBlamesCanada",
        "body": "If it flies, floats, or fucks rent it, don’t buy it.",
        "created_utc": 1638346353,
        "id": "hmrv4og",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375153.0
    },
    {
        "author": "Murky-Plankton7469",
        "body": "As a person wanting to buy Tesla stock but knowing its grossly overvalued I thought the recent Musk debacle would be an opportunity for a real correction... How stupid was I?! \n \nEven at its lowest point it still stayed above 1k and I was hoping for something around 800-900 max.",
        "created_utc": 1638358348,
        "id": "hms9ghe",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638387148.0
    },
    {
        "author": "Redditsome22",
        "body": "[Pie graph](https://ibb.co/wwc9QhN?fbclid=IwAR1z1gj0gQ7T8nUUHXUVERiWjmndFdjXWnYv6Y-Y_BAsgDVGgiYFoKHRegU)\n\n&amp;#x200B;\n\nI have done a lot of repositioning into positions currently on what I considered a discount all of those flew high, too fast and burnt to the ground and beyond. went deep into BABA - currently 178avg and PYPL 211 avg - currently sadly sitting at an unrealized xx% loss. Also loaded on what was a speculative position last year with higher conviction now - bought quite a few CRSP at what I believe to be the bottom at the 78 range - currently avg at 102+-.{Not even mentioning my stupid PLTR,BB position - gambles going wrong atm, believing in the hype and the reason I bought hasnt changed still hence why i havent sold}\r  \n\r  \nAlthough I have sizeable losses here these positions have elevated my positions amazingly.\r  \n\r  \nHolding a sizeable position with xxx% returns on AMD and NIO and very bullish on SE - recently added to my position at 280\r  \n\r  \nbought into the AMC hype with a 14 avg and sold of 80% at around the 60 mark\r  \n\r  \n\r  \n\r  \nSquare shouldve been scalped and rebought 205-280 range and back is ridiculous but oh well\r  \n\r  \nsold JD into strenght to buy into my weaker positions - had a big position before. still bullish but seeing more upside elsewhere atm.\r  \n\r  \nI dont have any us mega caps- I know winners stay winners usually but I am looking for hopefully bigger returns albeith I run risk of big losses, clearly, as well - such as sizeble position in a clinical trial biotech AGTC - currently at a big loss aswell but that was expected. Lets see what happens here. stock at all time lows.\r  \n\r  \n\r  \n\r  \nfor example although im sitting at a 10avg with my SKLZ position the downside is limited here imo, and potential huge hence why I have been adding to my position lately a lot bellow 10\r  \n\r  \n\r  \n\r  \nI do recommend people look into CPNG and let me know their thoughts. I am torn between adding to this position or keeping it small.",
        "created_utc": 1638358232,
        "id": "hms9b17",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638387032.0
    },
    {
        "author": "Agitated-Savings-229",
        "body": "I guess the money i earned came hard... last year's drop taught me just to be patient. I was down almost a millions dollars but sat and waited and it all came back. Something options don't typically afford.",
        "created_utc": 1638359061,
        "id": "hmsafju",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387861.0
    },
    {
        "author": "Bossmoss599",
        "body": "Even in the under developed world there’s still vaccine misinformation. The polio vaccine in Northern Africa had to overcome misinformation like it was haram because it would make you sterile and was made with pork products.",
        "created_utc": 1638359085,
        "id": "hmsagpl",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638387885.0
    },
    {
        "author": "GoodellsMandMs",
        "body": "My sportsbook has the ability to set deposit limits and you can also lock yourself or of it forever\n\nIt's this not something you think they should be a doing? \n\nIf my gambling app has measures put in place to protect me why shouldn't my investment app?",
        "created_utc": 1638360058,
        "id": "hmsbtmf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638388858.0
    },
    {
        "author": "trail34",
        "body": "Ugh. I see this a lot, but it makes no sense. What’s better…\n\n1) profiting $1000 and paying $350 in taxes, netting you $650?\n\n2) profiting $1000 and purposely losing $1000, paying $0 in taxes, and netting you $0?\n\n3) profiting $1000 and purposely losing $2000, getting a $350 tax refund but you’re now at -$750 net?\n\n\nPeople are always so afraid of paying taxes. But I’d rather pay taxes and still have a profit than negate all my winnings by purposely selling stuff for less than I paid.",
        "created_utc": 1638360073,
        "id": "hmsbuca",
        "score": 1,
        "subreddit": "investing",
        "created": 1638388873.0
    },
    {
        "author": "Medz_For_Headz",
        "body": "So is it safe to buy the dip? or is the dip going to keep dipping??",
        "created_utc": 1638361098,
        "id": "hmsdbx1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389898.0
    },
    {
        "author": "Slow-Throat-1458",
        "body": "UTMA is a regular taxable account. It just has the minor listed as the beneficiary of the funds. No tax benefits. The trade off is that they can be used for anything, not just education.",
        "created_utc": 1638361546,
        "id": "hmse034",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638390346.0
    },
    {
        "author": "Wealth_Reasonable",
        "body": "it coming alive",
        "created_utc": 1638361602,
        "id": "hmse38d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390402.0
    },
    {
        "author": "_sillycibin_",
        "body": "just behind the number of money enthusiasts in the world.  which is what really most people who are in crypto are in it for.  they could give a shit about the narrative, feel good, change the world bs.  it's a speculative asset and they'll profit and gtfo when there are whiffs of trouble.  long term I think there are enough stupid people globally with growing interest to keep pushing btc up.",
        "created_utc": 1638362768,
        "id": "hmsfyma",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638391568.0
    },
    {
        "author": "ymi2f",
        "body": "Yeah but only chicks will buy it.   It's the new Jetta",
        "created_utc": 1638362789,
        "id": "hmsfzxs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391589.0
    },
    {
        "author": "Mister_Titty",
        "body": "The answer is experience and education. It IS possible to make good returns without getting your ass kicked, consistently, but only if you know what you're doing. And you won't find that education the easy way. It takes time; you will have to make mistakes and learn from them; you will have to educate yourself. Think of this as a wake-up call - you can either take investing seriously and devote a significant chunk of your time towards learning for the next ... however long it takes, or you can settle for the same returns and same risk as everyone else.",
        "created_utc": 1638362872,
        "id": "hmsg50f",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638391672.0
    },
    {
        "author": "eternalrefuge86",
        "body": "The SPY has been doing literally the same thing since Friday. So easy easy to play. Up? Buy puts. Down? Buy calls. Works til it doesn’t",
        "created_utc": 1638363788,
        "id": "hmshq8c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392588.0
    },
    {
        "author": "zth25",
        "body": "The profit motivation is not a genuine argument not to get vaccinated, is what I'm saying. Governments would buy the vaccine if it costs 10 or 20 or 100 bucks per shot because there is no alternative. Yet the cost for a shot is a reasonable 20 bucks. \n\nWe live in a free market society. Do we have to take the \"muh freedom\" crowd seriously when they use \"profit making\" as an excuse? They happily spend money on ivermectin, vitamin pills and moon crystals. \n\nOr blame \"big pharma\" when many gigantic pharma companies tried and failed to create a vaccine, and the most successful vaccines are made by start-up companies with cutting edge technology that use their profits to fund research into cancer, malaria and flu vaccines? Those are the literal heroes, not the villains.",
        "created_utc": 1638359211,
        "id": "hmsan0t",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638388011.0
    },
    {
        "author": "AutoModerator",
        "body": "This submission has been automatically removed because it may be a frequently asked question.  Please check our [wiki FAQ section](https://www.reddit.com/r/options/wiki/index) or re-post your question to the weekly [Options Questions Safe Haven](https://www.reddit.com/r/options/wiki/faq/subreddit_resources) thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/options) if you have any questions or concerns.*",
        "created_utc": 1638363037,
        "id": "hmsgf74",
        "score": 1,
        "subreddit": "options",
        "created": 1638391837.0
    },
    {
        "author": "WontQuitNow",
        "body": "In a world of uncertainty and volatility it makes a lil sense. Yes? No? ![img](emote|t5_2th52|4263)",
        "created_utc": 1638358222,
        "id": "hms9akb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387022.0
    },
    {
        "author": "Smithmonster",
        "body": "Missed that at first, thought you were joking at a dollar tent four loss. Don’t worry it will all bounce back tomorrow, or maybe next week. I sold all my shit waiting for the real dip to go long term, this market is Fukd.",
        "created_utc": 1638359518,
        "id": "hmsb2bu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388318.0
    },
    {
        "author": "aborack6",
        "body": "I only need it to open this high so I can dump my calls on another degen",
        "created_utc": 1638359546,
        "id": "hmsb3qi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388346.0
    },
    {
        "author": "msupz",
        "body": "Dare I say it? Ber r ___?",
        "created_utc": 1638361320,
        "id": "hmsdnuh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390120.0
    },
    {
        "author": "StarmanRick",
        "body": "Yea I looked into that one I think the warrants are 1/3. Also the presentation deck is out if you haven't seen it. \n\nhttps://www.sec.gov/Archives/edgar/data/0001838697/000121390021062704/ea151435ex99-2\\_broadscale.htm",
        "created_utc": 1638361841,
        "id": "hmsegpz",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638390641.0
    },
    {
        "author": "Inquisitor1",
        "body": "I mean it did come back to 14$, then it went to 24 from there. Then it dipped pre-earnings, then it went to 24.",
        "created_utc": 1638361856,
        "id": "hmsehlo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638390656.0
    },
    {
        "author": "barelyrolling42069v2",
        "body": "I know some of you retards have had to deal with this before. Kitty ran away on Saturday and I really can't think about anything else. I took all the steps to increase chances of his return and sitting on my hands waiting here is brutal. How to stop thinking about it? He is an expert hunter so I think he's still kicking as long as he found a warm spot to hunker down during the cold nights",
        "created_utc": 1638362999,
        "id": "hmsgctj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391799.0
    },
    {
        "author": "muchcoinmuchfun",
        "body": "I think it does at some point today after a rally but I’m holding puts and biassed.  I have one set of calls",
        "created_utc": 1638363447,
        "id": "hmsh4vp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392247.0
    },
    {
        "author": "WhoLickedMyDumpling",
        "body": "well apparently Goldman Sachs are the ones giving fidelity the information on shares available to short... so the question is, was it on purpose and to what end?",
        "created_utc": 1638358617,
        "id": "hms9tr6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387417.0
    },
    {
        "author": "taimusrs",
        "body": "Don't wanna jinx it but, today seems like a good day",
        "created_utc": 1638359403,
        "id": "hmsawl3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638388203.0
    },
    {
        "author": "tomis8",
        "body": "How to fix my banbet?  I placed a banbet, and visualmod said it wasn't accepted because I placed text after the time token.  Fixed the problem, but submitted a banbet with an incorrect price.  I edit the banbet immediately, but visualmod accepted the incorrect price.",
        "created_utc": 1638360105,
        "id": "hmsbvy4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388905.0
    },
    {
        "author": "Clay_2000lbs",
        "body": "Sounds like it was a typo…",
        "created_utc": 1638360149,
        "id": "hmsby6q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388949.0
    },
    {
        "author": "PrincPaco",
        "body": "The best way to combat COVID is to stop handling dirty money. Credit &amp; Debit cards are able to be sanitized after each use and added benefit, it helps my calls print and will send my kids to college. \n\n*Not medical or financial advice but forreal, stop selling payment processing stocks. Please and thank you",
        "created_utc": 1638361241,
        "id": "hmsdjk8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390041.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot. This Meme does not look like it has generated enough approval to stay on /r/wallstreetbets.                                        We algorithmically cull certain submission flairs whose response is not above a certain threshold to try and keep the page clean.",
        "created_utc": 1638361709,
        "id": "hmse98o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390509.0
    },
    {
        "author": "KorbenDallassssS",
        "body": "....and yet somehow you think after jpow's public retraction of the transitory narrative means that he'll somehow be ultra-bullish the very next day....\n\nThat transitory bullshit was the only reason anyone felt good about the charade continuing.  Jpow is too smart to drop the entire nuke in one meeting, will be slow dripping it over the next ~year, frog in boiling water style.",
        "created_utc": 1638362543,
        "id": "hmsfl6c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391343.0
    },
    {
        "author": "SalmonTheSalesman",
        "body": "Lmao they killed all the apes. Why was everyone bullish on it anyway?",
        "created_utc": 1638359803,
        "id": "hmsbgkm",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1638388603.0
    },
    {
        "author": "SenorDiablo",
        "body": "Good shit man! Bought some when you called it out but it took off before I could load the boat. Hope we see a modest gain today. Thanks again!",
        "created_utc": 1638360944,
        "id": "hmsd3kj",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638389744.0
    },
    {
        "author": "Aerotyne69",
        "body": "Happy December. If you been losing money, it can turn around. Don’t give up!",
        "created_utc": 1638361472,
        "id": "hmsdvzg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390272.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because was too short. Please make it a comment if it's not worth expounding on.",
        "created_utc": 1638361479,
        "id": "hmsdweu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390279.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. You submitted a Gain/Loss/YOLO that didn't look like it included **large** positions. Please read the rules. This check will fire if you included unnecessary pictures that don't show positions. Repost with the useless pictures omitted if you did that.",
        "created_utc": 1638362276,
        "id": "hmsf5ij",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391076.0
    },
    {
        "author": "derprondo",
        "body": "That won’t do shit, need to convert it to crack first.",
        "created_utc": 1638362310,
        "id": "hmsf7hl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391110.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. You submitted an image I've already seen recently.                        If you're submitting a position screenshot use Gain/Loss/YOLO flair or it'll be duplicate checked.\n                        If you submitted something and then immediatley deleted it... don't do that next time.\n\nhttps://i.redd.it/2ripvfukex281.jpg",
        "created_utc": 1638362412,
        "id": "hmsfdgp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391212.0
    },
    {
        "author": "offensiveniglet",
        "body": "You should avoid swimming, you're too dense for it. I'm impressed you managed to setup a brokerage account. YTD is January to today, otherwise known as a time period encompassing the current year. It can also refer to fiscal year start to current day but it is usually referring to calendar year.",
        "created_utc": 1638360890,
        "id": "hmsd0oi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638389690.0
    },
    {
        "author": "contrejo",
        "body": "But I don't like setting the limit because I fear that I will set it too low and at this point I'm not sure what amount of comfortable with. I have also set it too high",
        "created_utc": 1638360912,
        "id": "hmsd1uv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389712.0
    },
    {
        "author": "Smurf_Crime_Scene",
        "body": "Because there are so many mutations the vaccine is expected to be as effective OR LESS with \"less\" being a real possibility.\n\nYou are correct that it doesn't mean that the virus is in itself more lethal. It could be more lethal. Or less. We just don't know yet.",
        "created_utc": 1638361996,
        "id": "hmseph6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390796.0
    },
    {
        "author": "Inquisitor1",
        "body": "If you don't think a stock is going up why are you even holding it? You might be wrong when you think it's going up, but you don't know the future yet. If you have shit investments you don't believe in, you should have sold yesterday regardless if it's tax season or not.",
        "created_utc": 1638362035,
        "id": "hmserok",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638390835.0
    },
    {
        "author": "nalden",
        "body": "Title says it all! Luh mau",
        "created_utc": 1638362628,
        "id": "hmsfq5s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391428.0
    },
    {
        "author": "GlitteringEar5190",
        "body": "Yes buy calls with Jan/Feb expiry. Before their next earning. It will pay off.",
        "created_utc": 1638362633,
        "id": "hmsfqgl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391433.0
    },
    {
        "author": "JackWorthing",
        "body": "Same except 12/1 … it IS tempting to hold for a bit",
        "created_utc": 1638363403,
        "id": "hmsh224",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392203.0
    },
    {
        "author": "AmeriMan2",
        "body": "Yes. My roommate has 2 cats. I've let one escape before but it came back after a night of the litter box outside.\n\nIt's their *toilet*",
        "created_utc": 1638363416,
        "id": "hmsh2xj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392216.0
    },
    {
        "author": "Responsible-Fuel7725",
        "body": "Worst case scenario you are down .73%. That’s nothing. Wait until you see a 50% drop and it takes out hundreds of thousands of dollars from your account. Keep it in and wait. DCA your money. This is the way.",
        "created_utc": 1638358761,
        "id": "hmsa0sw",
        "score": 1,
        "subreddit": "investing",
        "created": 1638387561.0
    },
    {
        "author": "Weak-Pudding-322",
        "body": "6 &amp; 7 felt like a stretch. Not saying you’ve never seen it but to say it’s a regular thing? I don’t even know what you’re talking about",
        "created_utc": 1638359957,
        "id": "hmsbocs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388757.0
    },
    {
        "author": "BenRobNU",
        "body": "That sweater is fucking terrible. Let the GF take it as a parting gift.",
        "created_utc": 1638359985,
        "id": "hmsbprz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388785.0
    },
    {
        "author": "0005AD99",
        "body": "everyone so bullish is making me nervous. My NDX calls are up 100% do I sell before bell or let it ride? (before any ape calls me retard, yes we can trade CFDs in the pre market)",
        "created_utc": 1638360299,
        "id": "hmsc5tl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389099.0
    },
    {
        "author": "vladanHS",
        "body": "Where you got $300 number, at me it says $100?",
        "created_utc": 1638360301,
        "id": "hmsc5x0",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638389101.0
    },
    {
        "author": "contrejo",
        "body": "That guy sounds shady. The fact they don't want to give the formula for what's supposed to be a terrible pandemic further solidifies My belief that the pharmaceutical industry wants us to maintain our sickness and not cure it.",
        "created_utc": 1638360337,
        "id": "hmsc7qp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389137.0
    },
    {
        "author": "Diamondhands4dagainz",
        "body": "I can’t bet on it because I don’t know when the rates will rise. JPOW could come in today and say “Fuck it we’re gunna raise rates next week”. Cunt is a loose cannon now",
        "created_utc": 1638361190,
        "id": "hmsdgqw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389990.0
    },
    {
        "author": "AdmirableActuator",
        "body": "GOEV. Got it, sold for. 20% profit and it continued up.",
        "created_utc": 1638361663,
        "id": "hmse6mu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638390463.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because was too short. Please make it a comment if it's not worth expounding on.",
        "created_utc": 1638362492,
        "id": "hmsfi6u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391292.0
    },
    {
        "author": "bitstream_baller",
        "body": "IT guy here. Cisco is running 4-6 months out for a LOT of switches and gear. It hurts.",
        "created_utc": 1638362722,
        "id": "hmsfvx5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391522.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because was too short. Please make it a comment if it's not worth expounding on.",
        "created_utc": 1638363211,
        "id": "hmsgq2a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392011.0
    },
    {
        "author": "SlothInvesting1996",
        "body": "It will be down again",
        "created_utc": 1638363230,
        "id": "hmsgr8c",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638392030.0
    },
    {
        "author": "justsomeitguyhere",
        "body": "yes, I would buy all of the stocks, doesn't matter if it goes down any more.",
        "created_utc": 1638363237,
        "id": "hmsgrpi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392037.0
    },
    {
        "author": "big3n05",
        "body": "No one has made an electric airplane that is a viable passenger transport, much less the much less efficient VTOL (e.g., helicopter) type. Will it work eventually? I'm sure it will. But, we'll need the battery breakthroughs we are all hoping for first. More capacity, lighter weight, etc. It'll never work until then. Even when that is solved you are looking at probably 15 years or so for type certification at a minimum. The Honda Jet took about that long and that is a company with massive resources who is making small improvements to a form factor that is extremely well known.",
        "created_utc": 1638359010,
        "id": "hmsacyu",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638387810.0
    },
    {
        "author": "AutoModerator",
        "body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
        "created_utc": 1638359019,
        "id": "hmsadex",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387819.0
    },
    {
        "author": "TheTallestDwarf",
        "body": "Short answer: no. If there was such a method everybody would be doing it. \n\nThe risk to reward ratio is always increasing, and reducing risk always reduces potential rewards.",
        "created_utc": 1638359647,
        "id": "hmsb8rc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638388447.0
    },
    {
        "author": "Public-Angle82",
        "body": "Does anyone else feel like maybe rich folks just get together and decide to raise prices and blame it on inflation.",
        "created_utc": 1638359686,
        "id": "hmsbao1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388486.0
    },
    {
        "author": "abigailwimbleu",
        "body": "Do yourself a favor &amp; sell when it gets back up to $26-$27. Love PLTR but it’s been disappointing to hold to say the least",
        "created_utc": 1638360716,
        "id": "hmscrk5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389516.0
    },
    {
        "author": "Berto_",
        "body": "Burn it",
        "created_utc": 1638360748,
        "id": "hmsct88",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389548.0
    },
    {
        "author": "AutoModerator",
        "body": "Your submission was removed because it is a short post. Any self-post below 400 characters in the body will be removed.  Please refer to rule 6 and make sure your post meets our standards of effort. Automod evasion will be met with a lengthy ban. Do not post just an article; highlight the parts of the article you find relevant or offer some commentary surrounding the article. Self-posts that offer some simple thoughts or questions like \"what do you think\", \"here's my thoughts\", etc. belong as comments to existing posts or the [Daily Advice Thread](https://www.reddit.com/r/investing/about/sticky?num=2).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
        "created_utc": 1638362089,
        "id": "hmseur7",
        "score": 1,
        "subreddit": "investing",
        "created": 1638390889.0
    },
    {
        "author": "stevoacp1",
        "body": "closed my LRCX calls for 150%",
        "created_utc": 1638371671,
        "id": "hmsxyow",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638400471.0
    }
]