[
    {
        "author": "qwertyWarrior77",
        "body": "Wait wait wait you’re telling me that in the fine print they stated the right to do this and in all reality a broker can NOT offer the purchase of a security. Damn I was just about to sue the balls off fidelity for not letting me yolo into MicroCaps with no fillings but I guess it all adds up now.",
        "created_utc": 1619878372,
        "id": "gwjiv9f",
        "score": 169,
        "subreddit": "stocks",
        "created": 1619907172.0
    },
    {
        "author": "starhockey36",
        "body": "Do you know how many people blew up accounts thinking this market has way overrun reality? Everyone in the whole world knows equities are not sustainable at these levels right now. \n\nMy point is you may want to consider extending the date.",
        "created_utc": 1619939324,
        "id": "gwmtosi",
        "score": 157,
        "subreddit": "wallstreetbets",
        "created": 1619968124.0
    },
    {
        "author": "sling1221",
        "body": "SPCE on May 10th now",
        "created_utc": 1619874841,
        "id": "gwjcl5y",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1619903641.0
    },
    {
        "author": "salfkvoje",
        "body": "Bezos as new GME CEO immediately issues a 10:1 split, everyone has 10x more shares, shorters shit themselves now responsible for covering 10x their position, price at 17 immediately gets bought up by everyone back up to 200+\n\nAnd then weed becomes legal so my APHA and GRWG fucking print, and then also so do CLF and SMH for unknown reasons\n\nThen my dad comes home after 20 years and my ex remembers how much she loves me, also I can turn invisible (and back visible) at will",
        "created_utc": 1619954269,
        "id": "gwncs7r",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1619983069.0
    },
    {
        "author": "wiggle-le-air",
        "body": "I've made like 10 plays and hevent made a cent 😎\nGuess I'm a long-term investor now",
        "created_utc": 1619951216,
        "id": "gwn60ry",
        "score": 70,
        "subreddit": "StockMarket",
        "created": 1619980016.0
    },
    {
        "author": "AvenDonn",
        "body": "Nice call sweep.\n\nNow watch it trade sideways for another month",
        "created_utc": 1619940557,
        "id": "gwmv0uv",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1619969357.0
    },
    {
        "author": "fxrky",
        "body": "Cant wait to see the loss porn a week from now",
        "created_utc": 1619860798,
        "id": "gwivq85",
        "score": 62,
        "subreddit": "pennystocks",
        "created": 1619889598.0
    },
    {
        "author": "lcastill1",
        "body": "Very bad... but it’s still on sale so it’s not too late for him to get back in now",
        "created_utc": 1619893209,
        "id": "gwkholu",
        "score": 59,
        "subreddit": "StockMarket",
        "created": 1619922009.0
    },
    {
        "author": "McNultyLikesJameson",
        "body": "Sorry, you're now signed up to participate in a HUMANCENTiPAD.",
        "created_utc": 1619882420,
        "id": "gwjrx75",
        "score": 57,
        "subreddit": "stocks",
        "created": 1619911220.0
    },
    {
        "author": "MoonrakerRocket",
        "body": "Good time to mention all the quantitive easing the world has done (especially the US)? I mean, y’all printed like, 40% of the dollars in existence in the last 12 months which obviously isn’t good for managing future inflation. However, wouldn’t that also mean that extreme valuations aren’t really that high because the dollar is quickly becoming worth less and less? \n\nI mean, if Apple is worth $2T and that seems high to you, could it not just be that it now takes $2T to be worth c.$1.5T pre-pandemic? From overseas is kinda seems like it’s priced in. \n\nI suppose the counter argument could be that a LOT of the stimulus went into the market and is tied up. But that would also mean taking profits and crashing the market while also leading to greater cash in circulation, worsening inflation of day-to-day goods, or having inflated valuations and not seeing hyperinflation in the real world \n\nI don’t know how this shit works, I’m retarded. 🤔",
        "created_utc": 1619940735,
        "id": "gwmv7n7",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1619969535.0
    },
    {
        "author": "Desenski",
        "body": "Dying game company. That's a good one. Are you sure we're talking about the same company? They've paid off all debt, raised an additional $551m (they now have just under $1b in on hand cash) lead by an ecommerce genius.",
        "created_utc": 1619894824,
        "id": "gwklfqq",
        "score": 48,
        "subreddit": "StockMarket",
        "created": 1619923624.0
    },
    {
        "author": "PerestroikaPal",
        "body": "Lol no, I don't have 11k shares of GME. I have bought/sold a total of 11k shares during my GME shenanigans. Right now I own 300 shares. 100 were called away yesterday :(",
        "created_utc": 1619894828,
        "id": "gwklg4o",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1619923628.0
    },
    {
        "author": "PerestroikaPal",
        "body": "I'll keep writing for now. The premium has definitely dropped but getting $1k for a weekly or $2k for a couple weeks out is still very much worth it to me. I miss those $9k covered calls though",
        "created_utc": 1619898597,
        "id": "gwktqu1",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1619927397.0
    },
    {
        "author": "Cheapsuittt",
        "body": "Lesson 2 is more of the same except now there's two people kicking you in the balls from the front and back",
        "created_utc": 1619880364,
        "id": "gwjn6q8",
        "score": 39,
        "subreddit": "SPACs",
        "created": 1619909164.0
    },
    {
        "author": "stothel",
        "body": "with interest rate so low, it's not worth too much mental energy trying to maximize tax savings or yield on cash.\n\nI prefer short-term high quality corporate bond funds right now as cash equivalent holdings.  Be careful with bond funds that have non-trivial management fees though\n\nVCSH",
        "created_utc": 1619886087,
        "id": "gwk0o6y",
        "score": 38,
        "subreddit": "investing",
        "created": 1619914887.0
    },
    {
        "author": "oxyelevated",
        "body": "Man, I transferred my entire account to Schwab and wouldn’t you know, they failed to move over all my cash and certain shares. So I tried it again. Same thing.  I’ve tried 3x now to withdraw my cash (not shares) and the transaction continues to fail.",
        "created_utc": 1619891646,
        "id": "gwkdz3h",
        "score": 35,
        "subreddit": "stocks",
        "created": 1619920446.0
    },
    {
        "author": "HugeHungryHippo",
        "body": "Michael Burry waited years. I’m calling it now: major correction will happen in the next few years. \n\nMods, please give me a Nostradamus flare if I’m right!",
        "created_utc": 1619946537,
        "id": "gwn17p9",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1619975337.0
    },
    {
        "author": "Faelinor",
        "body": "You've sold enough to pay down the loan right and are just playing with your winnings now right? \n\nOr is this the wrong group for even a little bit of common sense lol",
        "created_utc": 1619951679,
        "id": "gwn6s1g",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1619980479.0
    },
    {
        "author": "SnooPineapples4548",
        "body": "I think they had a PP deal at 1.20. I’m at 1.25 now and considering averaging down. I think they’re on a good track and it will get better as the plastics ban takes effect. Price target around 1.60. I feel like there’s been a downtown lately among micro caps. All that said do your own DD.",
        "created_utc": 1619907431,
        "id": "gwlextq",
        "score": 26,
        "subreddit": "CanadianInvestor",
        "created": 1619936231.0
    },
    {
        "author": "DjMDMAPhd",
        "body": "If my child ever asks what times were like when I was young, I'll show him this and say, \"son, this is everything you'll ever need to know. Now I'm going out for a pack of smokes.\"",
        "created_utc": 1619952319,
        "id": "gwn7rds",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1619981119.0
    },
    {
        "author": "wab_AZ",
        "body": "RKT is no joke right now. Every mortgage company is beating earnings and short sellers still control the stock. It could go to 40+ all over again.",
        "created_utc": 1619887555,
        "id": "gwk44mc",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1619916355.0
    },
    {
        "author": "ConvergenceMan",
        "body": "Gotta love when people cherry pick price increases for certain items that have *known shortages* and then scream HYPERINFLATION.\n\nLumber, rhodium, steak, real estate in San Francisco, and now chicken wings - it's always the same pattern.\n\nLike a month ago, people were bitching in the news that bacon went up at Costco by $1, saying \"inflation is here!\"  Then last week I picked up high quality bacon from the local store for $2.99 / lb.\n\nIt's almost like epic, global supply chain issues caused by COVID lockdowns don't enter people's minds as a possible explanation of higher prices.",
        "created_utc": 1619922357,
        "id": "gwm5zqv",
        "score": 24,
        "subreddit": "investing",
        "created": 1619951157.0
    },
    {
        "author": "NrdRage",
        "body": "So this is interesting in theory.  Some flaws though:\n\n&amp;#x200B;\n\n1:  That would represent a historic collapse of the markets in a time which there is more money flowing into the markets than ever\n\n&amp;#x200B;\n\n2:  It also ignores the fact that the IB's have been TRYING to crash the market for 2 months now, but retail has been holding them off at the pass (look at the outflow from IB's - they've been selling like mad, but it keeps getting bought up)\n\n&amp;#x200B;\n\n3:   And it pains me to say it, because this acknowledges the market is currently completely broken, but technicals and oscillators on a market wide level presently don't work because of how much manipulation is going on.\n\n&amp;#x200B;\n\n4:  It ignores the fact that the Fed is willing to print any amount of your great-great-great-grandchildrens' money to keep this economy propped up.\n\n&amp;#x200B;\n\nWhat you're going to see is a channeled market, not a crashed on.",
        "created_utc": 1619943138,
        "id": "gwmxr6f",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1619971938.0
    },
    {
        "author": "psmithrupert",
        "body": "Well first of all, the car market internationally is still growing quite quickly (think China, India, Latin America) secondly the regulatory landscape as it is and as it seems to evolve into the future, will more or less force everyone to go electric. A few of the big names are not going to do so well in the transition ( at least one of the big Americans or maybe one the french would be my best guess). That’s a lot of market share that’s up for grabs. And if you think, well that’s going to go to Tesla or any of the newer names like Nio or whoever they are, well maybe, but selling a car is complicated, it involves a lot of logistics and maintenance is also a question.. so the big names  that are going to make it are in a pretty good position. And lastly, some of those companies make an insane amount of money already so they are a pretty safe investment for now. Volkswagen for example made 10 Billion$ profit last year. That’s after taxes. In a year that was generally considered bad for car makers...",
        "created_utc": 1619893736,
        "id": "gwkiwur",
        "score": 24,
        "subreddit": "stocks",
        "created": 1619922536.0
    },
    {
        "author": "Odin1367",
        "body": "Basically, I bought OCGN as a yolo with my dads entire portfolio that I manage for him back in December, started with 2K he gave me, flipped it to 3200 in oil stonks and then yolo’d that to OCGN at 2.60 a share for 1240 shares, been riding the rocket ever since and only now are people noticing it here lmao",
        "created_utc": 1619878415,
        "id": "gwjiyew",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1619907215.0
    },
    {
        "author": "Lahym",
        "body": "Love this stock right now, so much upside potential.  \n\n\nBought 2000 shares on Thursday and now I'm chillin in tendie town   [😋](https://emojipedia.org/face-savouring-delicious-food/) \n\n###",
        "created_utc": 1619896113,
        "id": "gwkoan0",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1619924913.0
    },
    {
        "author": "rkrum",
        "body": "I'm bullish on GDNP. I have only 1600 shares for now (around 5% of my current portfolio), but I'm planning on increasing my shares to at least 4000 while it's below $1.10.\n\nThe greatest catalyst for their growth will be the plastics ban. But considering our current scenario, the company has been steadily growing, announcing more sales and new products.\n\nI've been mainly focusing my small cap investment funds into sustainable areas, and I honestly love their product. There is a huge market for them, and considering we'll have the single-use plastic ban in the near future, I think it's a great company to invest in this year.\n\nBut hey, I'm just a common guy trying to invest in sustainable ideas and getting wealthier in the process. I'm no financial advisor, nor ultra-expert in investing. So, do your own dd :)",
        "created_utc": 1619911664,
        "id": "gwlmvqo",
        "score": 20,
        "subreddit": "CanadianInvestor",
        "created": 1619940464.0
    },
    {
        "author": "Powerofenki",
        "body": "10 Million now.",
        "created_utc": 1619880609,
        "id": "gwjnr3k",
        "score": 19,
        "subreddit": "stocks",
        "created": 1619909409.0
    },
    {
        "author": "PerestroikaPal",
        "body": "I started selling GME options in late mid-February after the second big spike that sent GME from $40 to $200. I did get some tendies on the initial squeeze in late January, so my entire 65k gain is from late January to now.",
        "created_utc": 1619895445,
        "id": "gwkmukq",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1619924245.0
    },
    {
        "author": "R-E-L-4-X",
        "body": "Friend, shortage in B2C supply started last year. Manufacturing is seeing the pinch now in certain channels. Raw materials are already scarce and the list grows each day. We will see a delayed ripple from all aforementioned posts. Too be clear I’m no bear, however we’re in for a ride at some point. The best monetary policy in history can only hope to soften the blow at best. And we’re talking more fiscal spending. It’s truly insanity.",
        "created_utc": 1619950723,
        "id": "gwn5h1i",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1619979523.0
    },
    {
        "author": "Davrotti",
        "body": "It is extremely difficult to point out from which part of the system the next crisis will emerge. I think that we can not know at this stage but that we can only argue that valuations are now relatively high.",
        "created_utc": 1619864823,
        "id": "gwizt71",
        "score": 17,
        "subreddit": "investing",
        "created": 1619893623.0
    },
    {
        "author": "spider2544",
        "body": "In that instance robinhood would be on the hook for so much cash in paper trades you had better believe they would pull every trick in the book to not go tits up. Vlad would be downstairs dumping coffee on servers just to get a service outage to be like “ohh shit we dont know this this could have happened, weird, well be back up shortly soon as we can figgure out the cause of the outage”\n\nThey now have a proven track record of fucking over people with accounts on their platform because the people trading on robinhood arent their customers, they are the product. Never keep money with a company whose intrests aren’t aligned with you as a customer.",
        "created_utc": 1619950439,
        "id": "gwn56ks",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1619979239.0
    },
    {
        "author": "Riverdragon32",
        "body": "Absolutely. I spent the last 5 years watching AMZN, questioning its high valuation, and wondering if it could maintain its growth and competitiveness. I bought my first shares of AMZN in 2020, with about a ~$3050 cost basis. If anything I would like to add more even at this current price. Because it's grown its earnings so much, it actually trades cheaper right now than at nearly any other point for the past 5 years on a P/E basis.",
        "created_utc": 1619908988,
        "id": "gwlhxry",
        "score": 17,
        "subreddit": "investing",
        "created": 1619937788.0
    },
    {
        "author": "StocksRGei",
        "body": "What the fuck are these r/investing comments? \n\nGet the fuck out of here pussies, if you cant handle risk go cry in the bonds markets. \n\nIts his money, he made a bet. Now fuck off.",
        "created_utc": 1619944917,
        "id": "gwmzl59",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1619973717.0
    },
    {
        "author": "robertleeblairjr",
        "body": "I doubt because of the post. I had hear about this a week or so back. Thought it was a joke at first. I was wrong. This is where our society is right now. Approaching our very own Idiocracy. *I like money. I like sex. Hey, I got an idea.*",
        "created_utc": 1619922118,
        "id": "gwm5lbk",
        "score": 16,
        "subreddit": "StockMarket",
        "created": 1619950918.0
    },
    {
        "author": "TheDevilintheDark",
        "body": "60% of my portfolio is now COIN so I can tell folks I run my own ARK ETF. \n\nSoon to be named ARK-Poor",
        "created_utc": 1619876139,
        "id": "gwjeoas",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1619904939.0
    },
    {
        "author": "kemar7856",
        "body": "Gamestop doesn't even sell video games anymore go to their store its all funkco and toys now. The employee's hair are also cotton candy colors",
        "created_utc": 1619866441,
        "id": "gwj1jbn",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1619895241.0
    },
    {
        "author": "Geoffs_Review_Corner",
        "body": "I'm right there with you. It used to be my favorite sub on Reddit. Now I check it occasionally just to see what they're up to.",
        "created_utc": 1619902787,
        "id": "gwl3ekf",
        "score": 16,
        "subreddit": "stocks",
        "created": 1619931587.0
    },
    {
        "author": "ImReellySmart",
        "body": "Growth in what form... they sell cars now and they sell cars in 5 years... nothing changes the way I see it.\n\nI understand that naturally the companies may grow but I'm talking about investors who are specifically investing in these companies now as the companies enter the EV market.",
        "created_utc": 1619891453,
        "id": "gwkdgfh",
        "score": 15,
        "subreddit": "stocks",
        "created": 1619920253.0
    },
    {
        "author": "TODO_getLife",
        "body": "Offtopic, but what happened to this sub? Used to be very active and now there's 1-2 new posts a day? Kinda confused.\n\nIt used to be a nice place with some balance compared to /r/stocks and them sometimes being pushy of certain narratives/stocks.",
        "created_utc": 1619902300,
        "id": "gwl26gu",
        "score": 15,
        "subreddit": "investing",
        "created": 1619931100.0
    },
    {
        "author": "BiGGAYCAREBEAR",
        "body": "Hi, my name is Warren Buffett. I’ve been around since the stock market first started trading. Due to inflation I am now worth billions. Thank you.",
        "created_utc": 1619887268,
        "id": "gwk3ffw",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1619916068.0
    },
    {
        "author": "anders9000",
        "body": "He's basically said there's nothing that can be bought for a fair price right now.",
        "created_utc": 1619893872,
        "id": "gwkj870",
        "score": 15,
        "subreddit": "StockMarket",
        "created": 1619922672.0
    },
    {
        "author": "EffectiveWar",
        "body": "I’m seeing a lot of people talking about how much money they have lost in the market. First, I am a boomer. I have over $9mm invested in boomer stocks And am up about 13% on those stocks. But I also have about $250,000 I gamble with from ideas I get from this sub. I am down on those stocks. But have had many hours of fun losing it on the YOLOing haha!\nI hope you youngsters are keeping your retirement funds separate from your gambling money. What am I saying, you have no retirement!\n\nThere is no shame in investing in boomer stocks kids. You just needed to do it 40 years ago. But the second best time is today!\n\nCiao for now!",
        "created_utc": 1619877386,
        "id": "gwjgw37",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1619906186.0
    },
    {
        "author": "badnewsbearass",
        "body": "I lost all my money on GME and now I’m living in a van down by the river",
        "created_utc": 1619882975,
        "id": "gwjt977",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1619911775.0
    },
    {
        "author": "kdundurs",
        "body": "We’ve been seeing growth selloff for a while now, nothing new about it. It’s already 50% off ath, so even if dips into $19 for a brief moment, it won’t stay there for more than a few minutes, unless they completely fail to impress earnings. It’s quite clear $20 is a hard floor and it will almost certainly never even touch close to $15 lmao. But you know what they say about broken clocks being right twice a day.. Keep preaching.",
        "created_utc": 1619867006,
        "id": "gwj25gz",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1619895806.0
    },
    {
        "author": "chill_cat_character",
        "body": "NrdRage, don't listen to this guy. I've been following you for a while now, and I have yet to find much better DD. You have made me a good amount of money so far. Keep doing you, you beautiful person!",
        "created_utc": 1619918842,
        "id": "gwlzvkt",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1619947642.0
    },
    {
        "author": "llamajake",
        "body": "I've had plans all week to hangout with this girl today, right? Well, she texts me saying she needs flexibility because now she's got errands and things to do today. Where does that leave me? Stuck in this fucking thread wishing for a red day instead of being stood up.",
        "created_utc": 1619890103,
        "id": "gwka950",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1619918903.0
    },
    {
        "author": "JiraSuxx2",
        "body": "I was bagholding some vaxart then woke up one day and it was +50% in my portfolio. Now I am going to be too greedy to sell and ride it back into the red.",
        "created_utc": 1619878162,
        "id": "gwjig21",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619906962.0
    },
    {
        "author": "tonufan",
        "body": "Yeah, people used to give me shit for using boomer broker Vanguard, then the Robinhood shit happened and now it's one of the best and most reliable (besides the shitty layout/UI).",
        "created_utc": 1619899533,
        "id": "gwkvsf6",
        "score": 13,
        "subreddit": "stocks",
        "created": 1619928333.0
    },
    {
        "author": "PieBig7670",
        "body": "wsb is now full of bots and fake posts",
        "created_utc": 1619885697,
        "id": "gwjzo0h",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619914497.0
    },
    {
        "author": "korismon",
        "body": "The pandemic actually helped increase interest as well,   so many of my friends who never played video games have gotten into them in a big way since then,  its cool cause they actually play games with me now",
        "created_utc": 1619854608,
        "id": "gwipebr",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619883408.0
    },
    {
        "author": "Excess0_2",
        "body": "because hendge funds run this sub now",
        "created_utc": 1619870368,
        "id": "gwj67i9",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619899168.0
    },
    {
        "author": "Ken385",
        "body": "Your contracts will now trade under the symbol TLRY1.  Each contract will deliver 83 shares of TLRY.  Over time, these options may become less liquid then regular TLRY options as most people won't be opening new contracts in these adjusted options.  Some brokers may also restrict opening transactions in adjusted options.\n\nThis change takes place Monday. There is a chance that you may have a problem trading them the first day.\n\nHere is the OCC memo on the merger.\n\n[https://infomemo.theocc.com/infomemos?number=48654](https://infomemo.theocc.com/infomemos?number=48654)",
        "created_utc": 1619872946,
        "id": "gwj9qmw",
        "score": 13,
        "subreddit": "options",
        "created": 1619901746.0
    },
    {
        "author": "PragmaticBoredom",
        "body": "The GameStop thing went from funny to fun to scary cult-like obsession in a matter of weeks. \n\nThe facts barely mattered when this started, but now they don’t even want to hear about reality. Just rocket emojis and conspiracy theories.",
        "created_utc": 1619901148,
        "id": "gwkzhoy",
        "score": 13,
        "subreddit": "stocks",
        "created": 1619929948.0
    },
    {
        "author": "YurMotherWasAHamster",
        "body": "The problem with inflation is that when it spikes, investors run from the market and store their money in other assets like treasuries, gold, and now crypto. It's more about where the capital flows than the valuation of companies.",
        "created_utc": 1619944382,
        "id": "gwmz1ib",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619973182.0
    },
    {
        "author": "Xerpy",
        "body": "Most crypto contrarians argue that crypto isn’t really being widely used as a currency right now and is really only a “store of value” and a pretty volatile one. A good amount of the volume is most likely speculative in an attempt to make money, fiat money.\n\nNot many merchants take crypto as payment, I can’t walk down to any mom and pop store and buy toilet paper by transferring some btc from my wallet. And really that’s the crux of the argument. Crypto or BTC specifically, was a reaction to the financial crisis and how the government effectively exercised MMT tactics and bailed out large financial institutions and wealthy risky gamblers at the expense of the every day people. The purpose was to replace a fiat currency with this decentralized currency but that won’t ever happen. I won’t get side tracked on political theory and the monetary system but for now cryptos are gaining traction because there’s money to be made, money that will most likely be converted back to fiat so people can buy things and live their life.\n\nAll that being said it’s not to say some people aren’t diehard believers, who hold almost all their wealth in crypto. I’d say it’s a rarity but don’t really have any of the data to back that up.",
        "created_utc": 1619893491,
        "id": "gwkic7u",
        "score": 13,
        "subreddit": "StockMarket",
        "created": 1619922291.0
    },
    {
        "author": "TheRandomnatrix",
        "body": "Self driving is still so far away as to be basically irrelevant right now.  Even if we had completely proven technology that was 100% safe TODAY there's so much fucking red tape we wouldn't see it for at least another ten years",
        "created_utc": 1619898116,
        "id": "gwkspra",
        "score": 13,
        "subreddit": "stocks",
        "created": 1619926916.0
    },
    {
        "author": "Silver-Tune6829",
        "body": "The big question is where is the short interest now? We had over 160 million shares of short volume April 16 and 17th. And a fair amount of daily Short volume after that. Could we be over 100 millions shares shorted right now ? 💎🙌",
        "created_utc": 1619912383,
        "id": "gwlo7kd",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619941183.0
    },
    {
        "author": "partially__derived",
        "body": "The generation that birthed the first meme lords are now discovering the financial world. This phenomenon will continue until it becomes the norm, and soon our grandkids will be reminiscing on days when Netflix only cost 7 Icy Dragons a month. \n\nThe future is now, old man.",
        "created_utc": 1619924251,
        "id": "gwm96pq",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1619953051.0
    },
    {
        "author": "alfapredator",
        "body": "It's a long term investment now",
        "created_utc": 1619857173,
        "id": "gwis26f",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1619885973.0
    },
    {
        "author": "Desenski",
        "body": "Go listen to the latest earnings report. 300% increase in ecommerce YoY. Q1 was profitable even through covid. The stores they shut down were low performing stores to reduce overhead. \n\nIn less than a year they went from owing a lot of money and on the verge of bankruptcy, to paying off all debt, have almost $1b in cash, and has replaced a large number of high end executives with well known and top performing people in their fields from very successful companies such as Chewy and Amazon. And let's also add in there that these executives' pay is now 100% stock based. Meaning their personal pay is directly related to the success of the company. No free rides collecting nice pay checks.",
        "created_utc": 1619900205,
        "id": "gwkx97j",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1619929005.0
    },
    {
        "author": "NrdRage",
        "body": "Still waiting on the terms of your bet /u/zeffy.\n\nIf you've got enough conviction to try and write a hit piece based on the dumbest \"dirt\" possible, you should have the conviction to stand behind it and put your money where your mouth is.\n\nThis isn't mainstream media, you don't get to write a hidden retraction three weeks from now.",
        "created_utc": 1619919992,
        "id": "gwm1x6e",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1619948792.0
    },
    {
        "author": "quiethandle",
        "body": "TurboTax only still exists because the IRS has been barred from providing the exact same service on the IRS website. It would be *easy* for the IRS to do that, and save everyone a ton of money and time, but they've been stopped by outside forces (mostly lobbying). In other words, TurboTax still exists because it's not a free market (specifically, the gov't has been kept out of the game).\n\nMost of the structure of the real estate process is based on extremely old and legacy factors. Old regulations, laws, and legacy banking that were all invented before computers, let alone the internet. But all of that can be streamlined and automated with technology - and it's happening now.\n\nThe expertise factor for real estate agents is needed only because you have to deal with the paperwork, rules, regulations, and critically, other people (the people who own the house you want to buy, or the people who want to buy your house). But if Zillow becomes the middle man, then as a user, you don't need to know or care about the other parties. You don't sell your house to another person, you sell it to Zillow. You don't buy your house from a person, you buy it from Zillow. Zillow owns the inventory of houses that are on the market for sale.\n\nZillow could become *the* US housing market.",
        "created_utc": 1619878958,
        "id": "gwjk1g9",
        "score": 12,
        "subreddit": "options",
        "created": 1619907758.0
    },
    {
        "author": "Humble_Ad_3832",
        "body": "I feel so attacked right now haha",
        "created_utc": 1619955123,
        "id": "gwne845",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1619983923.0
    },
    {
        "author": "FistyGorilla",
        "body": "You should see what’s happening in India right now.",
        "created_utc": 1619888425,
        "id": "gwk69fn",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1619917225.0
    },
    {
        "author": "UpToMyKnees1004",
        "body": "No hate. Just frustrating. \n\nHe's a smart guy and obviously saw value where I didn't. Seems the state of the market is leaving a lot of people scratching their heads right now.",
        "created_utc": 1619921798,
        "id": "gwm51mk",
        "score": 11,
        "subreddit": "StockMarket",
        "created": 1619950598.0
    },
    {
        "author": "krootzl88",
        "body": "Oh yes, certainly. \n\n* payed off their dept\n* sitting on about $700 million\n* has a solid revenue ($8Bn - 10$Bn/ year)\n* huge brand value (most talked about company)\n* increasing TAM (gaming and eSports)\n* customer base ready for online purchases\n* online retail transition already happening\n\nLast but certainly not least:\n\n* SOLID board of directory with legit superstars poached from $AMZN, Google and Chewy (including Ryan Cohen, of course)\n\nAll the above for a $11Bn market cap. My 100% based on logic evaluation sits around $35Bn now. NOT including any squeeze.",
        "created_utc": 1619936202,
        "id": "gwmq5ui",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1619965002.0
    },
    {
        "author": "BrazenBull",
        "body": "We doing penny stocks here now?",
        "created_utc": 1619905007,
        "id": "gwl8wgd",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1619933807.0
    },
    {
        "author": "ThedanishDane",
        "body": "Straigth out the gate, i'm honestly undecided/unsure on whether you or OP will end being right.   \nHowever, the difference between now and 1999 is that the growth companies of today actually make money, and A LOT of it. Facebook, Apple, Microsoft, Amazon, Google and the likes have shown that they either are, or have proven that they can be, hugely profitable compared to essentially all other companies of the past.   \nAnd because we have seen these examples, in the case of interest rate hikes, investors will be much more patient with their investments in \"zombie-companies\". I mean sure, several would collapse and we would see some retraction from specific companies like Wework, Uber and the like. I don't think interest rate hikes would cause the massive crash that many people seem to think.   \n\n\nBut i'm honestly conflicted, because i feel like there's some aspect to theories above that i haven't heard, or more likely don't understand. I'm also much more worried (from an investor standpoint) about government regulation as i feel a increasingly growing sentiment to regulate data privacy and to a lesser extent monopoly/oligopolies.",
        "created_utc": 1619864441,
        "id": "gwizez3",
        "score": 11,
        "subreddit": "investing",
        "created": 1619893241.0
    },
    {
        "author": "Rontheking",
        "body": "Saw a guy mention is in the daily thread a few days ago, checked it out when it was at around 20/30 ish and decided not to get in. Feels so fucking bad now lol",
        "created_utc": 1619863156,
        "id": "gwiy2xa",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1619891956.0
    },
    {
        "author": "AJ_LA1313",
        "body": "The only dips that are going to occur now are very short-term, desperate slams down by shorts, which will quickly be bought back up by longs. This company's absolute base is 300, it's all just a bunch of corruption and we're trying to ride the wave.",
        "created_utc": 1619905249,
        "id": "gwl9i3q",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1619934049.0
    },
    {
        "author": "Pepe_anon",
        "body": "I did the same put strategy for income too, but got greedy for higher premiums and now one of my put is in deep red territory.",
        "created_utc": 1619853921,
        "id": "gwioo3p",
        "score": 11,
        "subreddit": "options",
        "created": 1619882721.0
    },
    {
        "author": "MattGeiger",
        "body": "chip shortage hurting a lot of stocks right now.",
        "created_utc": 1619947450,
        "id": "gwn24yl",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1619976250.0
    },
    {
        "author": "FrankOBeans_1",
        "body": "Naked is the way, buy in now or play catchup later. Not even looking at selling till triple digits!",
        "created_utc": 1619887873,
        "id": "gwk4w9n",
        "score": 11,
        "subreddit": "Wallstreetbetsnew",
        "created": 1619916673.0
    },
    {
        "author": "BigBeezy905",
        "body": "Handjobs are now encouraged in all AMC theaters",
        "created_utc": 1619894375,
        "id": "gwkkejn",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619923175.0
    },
    {
        "author": "mauisponger",
        "body": "All you need to do is take NVAX for example. Then just think about a pill vaccine getting funding. There’s a chance you get caught holding but this price right now is superb regardless of blow up next week or not",
        "created_utc": 1619920313,
        "id": "gwm2i2t",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619949113.0
    },
    {
        "author": "UsernameIWontRegret",
        "body": "Okay I’ll give it a go. \n\nP/E ratios have been swinging out further and further over the past couple of decades. This is because the only way for growth stocks to make money is to increase the price of the stock. People may be fine now with overextended P/E ratios, but eventually most investors are not going to be okay with a stock that has the next 30, 40, 50, or 60 years priced in. They’re going to see that as a risk and choose not to invest. Then the “growth” of the growth stocks will either slow dramatically or come crashing down. \n\nWe are at the top left portion of an upside down parabola.",
        "created_utc": 1619870214,
        "id": "gwj60ae",
        "score": 10,
        "subreddit": "investing",
        "created": 1619899014.0
    },
    {
        "author": "NrdRage",
        "body": "Write a 5000 word post.\n\nThen control c it, and paste it into another post box.\n\nDo that about 30 times and see what the spacinh looks like after all those copies.\n\nNow you know what every Friday post entails doing as I hunt for whatever words are triggering auto delete",
        "created_utc": 1619916762,
        "id": "gwlw5yz",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619945562.0
    },
    {
        "author": "mishka__",
        "body": "Starting to feel like the markets are now just about either swing trading SPY or trying to time P&amp;D tickers. Fundamentals have completely gone out the window.",
        "created_utc": 1619884511,
        "id": "gwjwv47",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619913311.0
    },
    {
        "author": "loadmanagement",
        "body": "Before you consider GME, you'll want to hear this.\n\nInvesting legends and Motley Fool Co-founders David and Tom Gardner just revealed what they believe are the 10 best stocks for investors to buy right now...",
        "created_utc": 1619886710,
        "id": "gwk23r2",
        "score": 10,
        "subreddit": "options",
        "created": 1619915510.0
    },
    {
        "author": "rogue_shorter313",
        "body": "Nice work! Now transfer all that to fidelity! 💎 👐 🚀",
        "created_utc": 1619891435,
        "id": "gwkdf1u",
        "score": 10,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1619920235.0
    },
    {
        "author": "Walden_Walkabout",
        "body": "Well, they have trillions in assets and capital to work from stable clients that aren't blowing money on memes with while Robinhood has a fraction of that and has people trading way more than they should. \n\nRegardless, some of these brokers did put restrictions on GME, but they didn't need to go nearly as far as RH.\n\n https://www.marketwatch.com/story/gamestop-amc-trading-is-now-being-restricted-at-td-ameritrade-11611769804",
        "created_utc": 1619897615,
        "id": "gwkrmhr",
        "score": 10,
        "subreddit": "stocks",
        "created": 1619926415.0
    },
    {
        "author": "StatikSquid",
        "body": "There's like 5 new subs for GME right now",
        "created_utc": 1619904570,
        "id": "gwl7sxb",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619933370.0
    },
    {
        "author": "StonkWonker",
        "body": "Now this is a fact",
        "created_utc": 1619891495,
        "id": "gwkdjmx",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619920295.0
    },
    {
        "author": "CallsOnAlcoholism",
        "body": "Posting my sports bets because it’s the weekend shitposting and we need action:\n* RED SOX -1.5, 1u - Sox are on a heater and the Rangers are trash\n* Hornets -7.5, 3u - Pistons are putting out their farm team today. This looks like a lock\n* Steph Curry o35.5 points, 2u - if it ain’t broke, don’t fix it\n* Warriors -8.5, 1u - Dubs need every win they can get. Expecting them to ball out here\n* Wizards +4, 2u - Wizards are playing amazing ball right now and keep beating the spread. Again, if it ain’t broke...\n* Grizzlies TT o115.5, 1u - slightly worried about a blow-out here, but I’m tailing a guy in the sportsbook POTD thread who generally crushes it\n\ncc u/FannyPackPhantom",
        "created_utc": 1619909417,
        "id": "gwliqjh",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619938217.0
    },
    {
        "author": "Walt826",
        "body": "I’ve been watching AMZN’s P/E ratio for years now. It keeps going down, while the stock price keeps going up. I always figured they haven’t split the stock due to its high P/E in the past — waiting until it gets to 30-50 range. We are soon there and indeed there was a recent rumor a split will be coming soon. Likely this year.",
        "created_utc": 1619911502,
        "id": "gwlml2n",
        "score": 10,
        "subreddit": "investing",
        "created": 1619940302.0
    },
    {
        "author": "irresponsible_owl",
        "body": "An S&amp;P 500 fund is essentially a managed fund. Stocks are added and removed multiple times a year, like you said, by a committee. It's not an algorithm that chooses the stocks, it's a group of humans.\n\nThe S&amp;P 500, by its nature, will \"buy high\" and \"sell low\" because a company already needs to be successful to be added to the index and they remove unsuccessful companies.\n\nThere was a study a while ago that found that if you invested in the original list of companies in the S&amp;P 500 and didn't follow the index,  you'd outperform the index by a wide margin. That's because the index has a history of removing companies while they're down and later adding them back when they recover. If you simply held on to the companies, you'd have done better. And that even accounts for the fact that many of the original companies no longer exist.\n\nThe index was meant to track the state of the market, not provide the best returns. The fact that it's now a major investment is something the original designers of the index never intended.",
        "created_utc": 1619911643,
        "id": "gwlmudo",
        "score": 10,
        "subreddit": "stocks",
        "created": 1619940443.0
    },
    {
        "author": "Z0mbies8mywife",
        "body": "Nah man beeps and boops are so 2020 now days the kids put the little \"BluhBlehs\" in there. It's like a bleep and a bloop had a baby but there's a possibility that wompwomp might actually be the father.",
        "created_utc": 1619912154,
        "id": "gwlns7u",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619940954.0
    },
    {
        "author": "Waitwhonow",
        "body": "If ANYTHING we have learnt in this market in the past 4 months.\n\nIf it rises fast- it will fall faster( most low/mid cap stocks are totally crushed and still havent recovered- and these companies actually make Atleast ‘ something’  tangible)\n\nCrypto is not going to be any different.\n\nIts on its own cycle- but it will happen.\n\nAlso- the Mega cap companies like Amazon, msft are now calling for Crypto regulation- to combat the ransomware problem.\n\nIt will be a hard hard drop when that happens( and its a matter of WHEN- no IF)\n\nElon is responsible for this shitcoin rally.",
        "created_utc": 1619919290,
        "id": "gwm0o80",
        "score": 10,
        "subreddit": "StockMarket",
        "created": 1619948090.0
    },
    {
        "author": "ryanryans425",
        "body": "If you’re not getting into PSFE right now you’re a dumbass.  Most undervalued stock on the market, $40 by end of year easily.",
        "created_utc": 1619927880,
        "id": "gwmez0l",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1619956680.0
    },
    {
        "author": "ForeverYonge",
        "body": "The Amazon store is trash now. AWS and maybe prime content is where they are good. \n\nThe last book I ordered arrived mangled and they had to resend it. No way they made money on that. \n\nStore is full with cheap clones, some of which are Dropshipped from China. Inventory commingling means quality is always a wildcard. \n\nThe only time I still use Amazon is when I want a no questions asked return policy. For cheap stuff, I go to Ali express to get it much cheaper. For expensive stuff, buying from more official retailers is worth the slightly higher price.",
        "created_utc": 1619901573,
        "id": "gwl0hgc",
        "score": 9,
        "subreddit": "investing",
        "created": 1619930373.0
    },
    {
        "author": "adjacent-analyst",
        "body": "fuck \n\nnow we riot",
        "created_utc": 1619885346,
        "id": "gwjyu15",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1619914146.0
    },
    {
        "author": "conncurr24",
        "body": "Former PLTR bull here. PLTR is going to under $20 after earnings. Get out now unless you’re a part of the “$200 stock in 3-5 years” cult. Not financial advise just common sense lol.",
        "created_utc": 1619896140,
        "id": "gwkocuv",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1619924940.0
    },
    {
        "author": "Illier1",
        "body": "WSB users have been brigading subs for a while now and its kinda exhausting how little they know about the system",
        "created_utc": 1619917075,
        "id": "gwlwpzk",
        "score": 9,
        "subreddit": "stocks",
        "created": 1619945875.0
    },
    {
        "author": "green9206",
        "body": "You are right, market will see a correction later in the year(probably not in the summer) but the reasons are not because markets are overvalued. Market will correct due to a reason which is as of now currently unknown. Remember that markets always require a reason to correct, it doesn't matter what the reason is. The reason isn't important but the behaviour of the correction is far more important.\n\n I personally do not think the correction will be more than 20-25% so you can pretty forget about a big sized one because markets will never give you another such big opportunity to buy stocks at cheap prices because markets are not stupid. You will get cheaper prices, but not the prices you may still be satisfied with\n\n. Yes anything can happen in markets but I'm gonna go out on a limb and say its almost literally impossible for correction to be 40-50% range unless some country starts a war with usa or something or some huge volcano erupts and kills half of united states or some crazy shit like that.",
        "created_utc": 1619943732,
        "id": "gwmydh0",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1619972532.0
    },
    {
        "author": "gandhithegoat",
        "body": "If you’re not watching Warren buffet and Charlie munger right now at the Berkshire Hathaway annual meeting you’re wasting your weekend. Learnt more about the Automobile industry in two mins than i ever could.",
        "created_utc": 1619892076,
        "id": "gwkf10f",
        "score": 9,
        "subreddit": "SPACs",
        "created": 1619920876.0
    },
    {
        "author": "sharist_DIY_bio",
        "body": "Hmm, all the sector based threads have been dead for a while, if they ever were popping. I like how the mods think we are all going to dive in there now because they are highlighted in yellow. I mean, in theory, it was a good idea way back when. Now, maybe not so much, just not enough volume anywhere with the exception of ticker threads.",
        "created_utc": 1619870570,
        "id": "gwj6gx6",
        "score": 9,
        "subreddit": "SPACs",
        "created": 1619899370.0
    },
    {
        "author": "871643",
        "body": "Well, we're entering a period of high inflation (it's happening right now and isn't debatable). Soon (probably sooner than expected) the Fed will taper its QE and raise interest rates, which will eat into future earnings of companies who are unable to pass on the cost of rising commodity prices to consumers. The last period of high inflation was the 70s. I wasn't alive then and I'd wager that a huge percentage of you reading this weren't either. We don't have personal experience of high inflation. Everything is getting more expensive, and unless some of this inflation hits salaries (lol) we're going to see an outflow of capital from the stock market. \n\nPersonally, I'm looking at real estate, REITs, gold, uranium and will be dabbling in other asset classes which, historically, have done well during inflationary periods.",
        "created_utc": 1619867434,
        "id": "gwj2n9y",
        "score": 9,
        "subreddit": "investing",
        "created": 1619896234.0
    },
    {
        "author": "battlejac_74",
        "body": "If the dollar goes to shit.. ie:the depression.. all that paper, trust or whatever else you wanna call it, goes to shit.. and you now have a ton of Firestarter.  However,  the online imaginary numbers we all have, God knows where that goes. Another thought. When my dad was in his 30s (he is 60 now) some whack job \"boomer\" use to tell him \"you best get into gold while you can\". Dad, laughed, as did everyone else bc  it was just a metal of ancient days gone by such as the gold rush, and there's absolutely no way it will be worth buying... so, no one did. That man who suggested this also use to dig through the dumpsters at the AFB and take out scrap gold wire. Long story short... that mans son is friggin loaded.  He is dead but still, bc he had a hunch, and bought \"worthless metal\" instead of buying trusts &amp; bonds (the winners back then) he quadrupled his money. A) metal will continue to go up... slowly but ALWAYS goes up with the dollar where as the dollar may not. B) sometimes nutcase bear boomers are right C) GME is not always the answer. \nYes... I too am stupid.. yes, I have metal. Yes, one day, I see us going into another depression.",
        "created_utc": 1619920811,
        "id": "gwm3d7v",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1619949611.0
    },
    {
        "author": "NrdRage",
        "body": "2001 was a targeted correction that only significantly affected one sector.\n\n2008 was a broad correction that could not be solved by QE - only completely wiping out debt could have stopped that.\n\nOur problem right now is neither debt (well, I mean...it is, but nobody believes it) nor sector-specific froth.",
        "created_utc": 1619944183,
        "id": "gwmyu6y",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1619972983.0
    }
]