[
    {
        "author": "YourFriendlyUncle",
        "body": "That's a list of great US companies and IBM",
        "created_utc": 1638366951,
        "id": "hmsno2r",
        "permalink": "/r/CanadianInvestor/comments/r6f1xh/8_new_cdrs_have_been_released_as_of_december_1st/hmsno2r/",
        "score": 97,
        "subreddit": "CanadianInvestor",
        "created": 1638395751.0
    },
    {
        "author": "cats-with-mittens",
        "body": "Intel is in the same league as IBM? That's a pretty morbid take on Intel.",
        "created_utc": 1638410751,
        "id": "hmvmuhx",
        "permalink": "/r/investing/comments/r6gtla/intel_as_a_longterm_investment/hmvmuhx/",
        "score": 33,
        "subreddit": "investing",
        "created": 1638439551.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "INTC, CSCO and IBM all fall into that set of thoughts.   Likely one or two may work out.  Maybe all 3.  I suppose if I was making that investment I would spread my investment across all 3.",
        "created_utc": 1638375683,
        "id": "hmt7oze",
        "permalink": "/r/investing/comments/r6gtla/intel_as_a_longterm_investment/hmt7oze/",
        "score": 24,
        "subreddit": "investing",
        "created": 1638404483.0
    },
    {
        "author": "_grey_wall",
        "body": "Ibm ruined redhat.  And pretty much everything else they touched.  Evil.",
        "created_utc": 1638380970,
        "id": "hmtl4y2",
        "permalink": "/r/CanadianInvestor/comments/r6f1xh/8_new_cdrs_have_been_released_as_of_december_1st/hmtl4y2/",
        "score": 16,
        "subreddit": "CanadianInvestor",
        "created": 1638409770.0
    },
    {
        "author": "Alpha_Trader_",
        "body": "INTC CSCO ORCL IBM have been ‘value traps’ for years. You literally could make this same argument every year for the past 10 years and still lose money.",
        "created_utc": 1638397466,
        "id": "hmusats",
        "permalink": "/r/investing/comments/r6gtla/intel_as_a_longterm_investment/hmusats/",
        "score": 9,
        "subreddit": "investing",
        "created": 1638426266.0
    },
    {
        "author": "psykikk_streams",
        "body": "AWS is the big ol elephant in the room  and nobody in the near future will be able to even move that thing even tiny bit.   \n\n\nAzure / MSFT will increase its market share. thats about it. \n\nthere are already TONS of \"cloud service providers\" who in reality use AWS / Azure infrastructure.  as AWS / Azure adoption and multi-cloud-connectivity will become even easier as it already is, most application service providers will never worry / want to care about the actual infrastructure. \n\nall they want is scaleavle infrastructure at their fingertips. \n\nboth MSFT and AWS will be working heavily towards easier adoption and easier integration.\n\nI do not see anyone even close to being able to recplicate / compete on that scale. \n\na few yars ago people predicted Facebook (now Meat) becoming the next big competitor.   \nand Google. even IBM. \n\nwell, no. \n\nit would take MASSIVE amounts of cash and ressources to compete with both at the level they are at right now. \n\nthe only thing that would REALLY shake things up is a change in legislature and regularory goverance. aka monopoly breakups and such.",
        "created_utc": 1638447368,
        "id": "hmx8qqe",
        "permalink": "/r/stocks/comments/r73o10/the_cloud_will_be_reshuffled_what_are_your/hmx8qqe/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1638476168.0
    },
    {
        "author": "spacebizzle",
        "body": "Stephanie Link is one of the only people on CNBC with brains, nobody wants value stocks now but in software they’re going to outperform a lot of these cloud hype stocks next year.  IBM is viewed as a dino but still makes $75B revenue per year at the same market cap as SNOW which barley makes $1B.  \n\nSNOW will probably never make $75B and IBM, ORCL and MSFT will crush them if they start picking up steam.  Downtrend has already happened with Zoom, DOCU, TEAM, DDOG, NET and other high fliers.",
        "created_utc": 1638381365,
        "id": "hmtm6ae",
        "permalink": "/r/wallstreetbets/comments/r6c8u6/daily_discussion_thread_for_december_01_2021/hmtm6ae/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1638410165.0
    },
    {
        "author": "HinduHamma",
        "body": "Intel is never gonna die and “end” . No. Just like how Coke isn’t or ibm or Cisco or boeing etc \n\nHowever, that still doesn’t make them an attractive investment. Like big whoop, you found a company that’s too important For the world. What’s your point? There’s hundreds of those. \n\nThat doesn’t mean they’ll ever be attractive to investors. No one gives a shit if US govt gives intel handouts of 50b a year for chips . \n\nThat’s no different than boeing getting handouts from defense sector. They’ll never “end” as a company they are important as you say to the USA. Still doesn’t mean it’s worth a trillion dollar market cap. Companies being a safe haven are priced that way because they can’t report any surprises or WOW investors with new growth . They will just be safe and steady investments not surprise growth stocks that can potentially transform into something bigger",
        "created_utc": 1638420762,
        "id": "hmw8fru",
        "permalink": "/r/investing/comments/r6gtla/intel_as_a_longterm_investment/hmw8fru/",
        "score": 6,
        "subreddit": "investing",
        "created": 1638449562.0
    },
    {
        "author": "absurd_logic589",
        "body": "I made good money betting on IBM",
        "created_utc": 1638374642,
        "id": "hmt54hi",
        "permalink": "/r/investing/comments/r6gtla/intel_as_a_longterm_investment/hmt54hi/",
        "score": 5,
        "subreddit": "investing",
        "created": 1638403442.0
    },
    {
        "author": "SuperSultan",
        "body": "Oracle has too much debt on its balance sheet. Cisco and IBM I don’t know too much but Intel has the potential to be a multibagger",
        "created_utc": 1638423788,
        "id": "hmwdtw2",
        "permalink": "/r/investing/comments/r6gtla/intel_as_a_longterm_investment/hmwdtw2/",
        "score": 4,
        "subreddit": "investing",
        "created": 1638452588.0
    },
    {
        "author": "FEDD33",
        "body": "Wish it was Nvidia instead of IBM.\n\nThe rest are pretty solid though.",
        "created_utc": 1638424038,
        "id": "hmwe960",
        "permalink": "/r/CanadianInvestor/comments/r6f1xh/8_new_cdrs_have_been_released_as_of_december_1st/hmwe960/",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1638452838.0
    },
    {
        "author": "AlE833",
        "body": "I don’t disagree with you. You could be right about the FAANG stocks. All I was saying is that technology is increasing exponentially and those companies are in the best position to take advantage, unless another Apple comes along. It’s crazy to see but think back to 2000, and where we have come in the last 20 years. Either those FAANG stocks will go the way of IBM or I’m betting they will innovate and become even bigger. \n\nI think Amazon could break out next year. It’s traded sideways for two years mainly due to investments they are making in infrastructure. \n\nWith small caps you could be right about that. But I’m sticking to what I know. I don’t know anything about small caps. With value plays you can’t go wrong with stocks like Costco, Walmart etc.",
        "created_utc": 1638402626,
        "id": "hmv46te",
        "permalink": "/r/stocks/comments/r6rvwp/gravy_train_is_ending_soon/hmv46te/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1638431426.0
    },
    {
        "author": "Elegant_Tree_6003",
        "body": "Fintech companies are replacing the services provided by traditional banks. Fintech companies have better margins than traditional banks. Traditional banks have massive overhead in terms of physical locations. Just look at all the bank branches everywhere and think of how much the cost is to operate those. Younger generation doesn't need physical bank locations anymore.\n\nInvesting in traditional banks is like investing in IBM. Why would you want to invest in IBM when you have companies like google, apple, Microsoft that are simply technologically superior.",
        "created_utc": 1638404059,
        "id": "hmv7hcq",
        "permalink": "/r/stocks/comments/r6sc1c/citi_6_pe_ratio_and_32_dividend_whats_wrong_with/hmv7hcq/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1638432859.0
    },
    {
        "author": "Timeriot",
        "body": "I’m watching COST, U, and IBM. I’m thinking of adding more to DIS and V",
        "created_utc": 1638355013,
        "id": "hms59yf",
        "permalink": "/r/stocks/comments/r694ul/stocks_you_cant_wait_to_see_dip_because_youre/hms59yf/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1638383813.0
    },
    {
        "author": "Flaky-Illustrator-52",
        "body": "For Amazon at least, I can only see AWS losing market share in the long term. I use Oracle Cloud for my hobby projects simply due to its affordability and making many of their services compatible with or flat out running on FOSS projects (odd that Oracle would make something like this considering its history as a company run like a mafia). \n\nOnce they add a CDN I will have zero reason to use AWS except for work since AWS pricing is just too high considering the competition it is facing.\n\nGoogle Cloud Platform has some room to grow, but it has embraced a multi-cloud type of strategy and is making tools to facilitate that so I can see their market share increasing long term... maybe. I can't speak to them as I haven't used GCP before.\n\nAzure seems like the slightly cheaper knockoff AWS without signed cookies in its CDN which even GCP has. Not sure about this since I don't use Azure.\n\nIBM cloud is... ew... and Alibaba/Yandex clouds... we don't talk about those. But maybe some companies will use IBM if that company gets its shit together like Oracle did. For now the only reason to use IBM is if you use DB2 or something. IBM cloud is way overpriced.\n\nTl;dr AWS will lose market share in the long term",
        "created_utc": 1638403493,
        "id": "hmv66xk",
        "permalink": "/r/wallstreetbets/comments/r6e0b3/are_we_in_a_bubble_comparing_the_current_stock/hmv66xk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638432293.0
    },
    {
        "author": "doctorzaius6969",
        "body": "IBM has given up on hybrid cloud? I thought that was their last hope",
        "created_utc": 1638440176,
        "id": "hmwze0c",
        "permalink": "/r/stocks/comments/r73o10/the_cloud_will_be_reshuffled_what_are_your/hmwze0c/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1638468976.0
    },
    {
        "author": "vibrantbeige",
        "body": "Bought bunch of puts from lots of companies like amgen, jnj, IBM, chevron, exxon Mobil. Lost money on some but made a but of money from others (like 30% or so each time)",
        "created_utc": 1638440558,
        "id": "hmwzueu",
        "permalink": "/r/smallstreetbets/comments/r6q5bd/turned_36k_to_26k_in_a_month/hmwzueu/",
        "score": 2,
        "subreddit": "smallstreetbets",
        "created": 1638469358.0
    },
    {
        "author": "WorldlyString",
        "body": "Especially with quantum computing.  IBM is the world leader in that.",
        "created_utc": 1638414424,
        "id": "hmvvdz4",
        "permalink": "/r/stocks/comments/r6btk6/rstocks_daily_discussion_wednesday_dec_01_2021/hmvvdz4/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1638443224.0
    },
    {
        "author": "DDRaptors",
        "body": "IBM was probably requested for the dividend, lol.",
        "created_utc": 1638395376,
        "id": "hmumxn4",
        "permalink": "/r/CanadianInvestor/comments/r6f1xh/8_new_cdrs_have_been_released_as_of_december_1st/hmumxn4/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1638424176.0
    },
    {
        "author": "absurd_logic589",
        "body": "I prefer working with GCP out if all of them. Had to do some contract work on IBM cloud it was not to bad actually. They are all really about the same though and it ultimately comes down to cost.",
        "created_utc": 1638462443,
        "id": "hmy4plq",
        "permalink": "/r/stocks/comments/r73o10/the_cloud_will_be_reshuffled_what_are_your/hmy4plq/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638491243.0
    },
    {
        "author": "gsasquatch",
        "body": "Oracle and IBM have overpriced products aimed at big money customers.   \n\nYou don't use Oracle or IBM unless you have to.  They are way overpriced and needlessly obfuscated.   If you can get away with not using them, you save yourself some money and not use them.    You need grey neck beards to make their stuff work.  \n\nI like that Larry was involved in the America's cup, but he cheated.  Technically, pumping was allowed in the rules that he wrote but that's not sailing, it's paddling.   He's a douche canoe, and his database sucks ass.\n\nIBM was doing cloud computing 30 years ago, which is kind of ironic that their stuff wasn't used for it.   It's also ironic that as the world moves away from or hide the POSIX model, everything is looking more like an AS400.     IBM kind of missed out on this hypertext fad, and that was their death knell.   Maybe Watson can save them, but it might be a gimmick.    \n\nCisco did a nice job of getting all the \"I want a lucrative career in IT\" pups trained in on their stuff, essentially locking themselves in as the de-facto standard.   Nobody really cares about the wires in the wall though, it's always a cost center 2 layers deep.",
        "created_utc": 1638458822,
        "id": "hmxvpk8",
        "permalink": "/r/investing/comments/r6gtla/intel_as_a_longterm_investment/hmxvpk8/",
        "score": 1,
        "subreddit": "investing",
        "created": 1638487622.0
    },
    {
        "author": "thetagodfather",
        "body": "T is the IBM / GE of telecom\n\nRandomly buy junk companies, fail to integrate them, sell other companies \n\nThen play all kinds of equity games without innovating or driving organic growth",
        "created_utc": 1638356257,
        "id": "hms6rx1",
        "permalink": "/r/stocks/comments/r5zseg/att_sees_slower_wireless_growth_sending_stock_to/hms6rx1/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638385057.0
    },
    {
        "author": "ejMileman",
        "body": "If you can’t trust China at all then dump the biggest most China dependent stocks first.  No not baba or 10cent.  Ask yourself, where does Foxconn (Chinese company) bios every Apple phone? Where does Tesla build and sell half of its cars? Where does ibm and Oracle do most of their consulting.  If you don’t trust China, you better go back to the cave.",
        "created_utc": 1638414875,
        "id": "hmvwegi",
        "permalink": "/r/ValueInvesting/comments/r679pd/can_we_really_trust_china/hmvwegi/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638443675.0
    },
    {
        "author": "badgebruce",
        "body": "I'm holding too. Could easily double over time. Maybe more. Lots of upside for IBM too.",
        "created_utc": 1638379615,
        "id": "hmthni3",
        "permalink": "/r/stocks/comments/r6btk6/rstocks_daily_discussion_wednesday_dec_01_2021/hmthni3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638408415.0
    },
    {
        "author": "HinduHamma",
        "body": "Blue chip old school giants is what I was targeting . Not the ones that are overvalued but still churning out growth numbers and making moves to push their companies to new heights. Intel is doing nothing to innovate and push up they are just trying to keep what they had going and find ways to keep giving out divy and buybacks. \n\nInvestors want sexy. Intel , ibm Cisco coke Walmart ? Those old value blue chips are not sexy.",
        "created_utc": 1638457405,
        "id": "hmxsdcp",
        "permalink": "/r/investing/comments/r6gtla/intel_as_a_longterm_investment/hmxsdcp/",
        "score": 1,
        "subreddit": "investing",
        "created": 1638486205.0
    },
    {
        "author": "gsasquatch",
        "body": "Intel usually has the fastest CPU on the market,  they tend to be more power efficient, and more expensive.    I haven't shopped for a CPU in a couple years though, so I don't know what's going on right now.  2 years ago Intel was king of the hill with the fastest and most expensive and I suspect they will regain that title soon enough, if history is any lesson, that title has been going back and forth ever since AMD was first able to capture it 10-15 years ago.\n\nIt's probably different now that servers are commoditized and in the cloud, but it once was only Intel for if you needed Microsoft stuff or IBM for real work in the server room.  AMD was just consumer level stuff.   Linux and VMWare lets real work happen on Intels.   Intels did better with VMware initially putting the segmenting into the chip.    \n\nThat Linux on consumer chips kind of supplanted IBM might be cautionary in that IBM was bluechip, and is now becoming somewhat of an also-ran.  \n\nIntel defined the standard, the \"x86\" and AMD followed it.  There's Moore's law, but who did Moore work for?  As of March 2021 Moore is worth $12.1B.\n\nI hardly consider Intel to be an underdog, that's new.  \n\nAs a stock, it's kind of boring.   I suppose I wouldn't expect huge gains like the recent Nvida stuff, but my sense is the company is pretty solid.  It's PE is much lower than AMD.   I own some INTC  because I thought it was a value, and consider it somewhat bluechip.",
        "created_utc": 1638457199,
        "id": "hmxrvxw",
        "permalink": "/r/investing/comments/r6gtla/intel_as_a_longterm_investment/hmxrvxw/",
        "score": 1,
        "subreddit": "investing",
        "created": 1638485999.0
    },
    {
        "author": "X-Zed87",
        "body": "Company is growing 30% YOY revenue, and priced like IBM which has had flat growth for 5 years. Sure FB is not the shining star anymore, but Fb is still growing, and Insta and WhatsApp and Occulus have a lot of tailwinds going forward. I agree the Reg issues are a risk, but usually nothing comes of them. FB probably has one the the strongest legal teams in the world at this point lol.",
        "created_utc": 1638418134,
        "id": "hmw3ctg",
        "permalink": "/r/stocks/comments/r6rvwp/gravy_train_is_ending_soon/hmw3ctg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638446934.0
    },
    {
        "author": "88crypto",
        "body": "Confirmation bias. It happened once, and you call it a pattern. One obvious thing,  it's on a downtrend. If stock goes up long term with good fundamentals - it will continue go up long term (look nvda, aapl, amd). Dinosaur shitstock (ibm, t, ge) will continue drilling. But you think this time is different. This \"buying the dip\" mentality is like a desease here",
        "created_utc": 1638424965,
        "id": "hmwfrv0",
        "permalink": "/r/wallstreetbets/comments/r6p244/what_are_your_moves_tomorrow_december_02_2021/hmwfrv0/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1638453765.0
    },
    {
        "author": "MenArePigs69",
        "body": "Tech boomers. Better off holding Nvidia or AMD. Next you’ll be shilling IBM.",
        "created_utc": 1638373016,
        "id": "hmt15gi",
        "permalink": "/r/investing/comments/r6gtla/intel_as_a_longterm_investment/hmt15gi/",
        "score": -6,
        "subreddit": "investing",
        "created": 1638401816.0
    },
    {
        "author": "YourFriendlyUncle",
        "body": "That's a list of great US companies and IBM",
        "created_utc": 1638366951,
        "id": "hmsno2r",
        "permalink": "/r/CanadianInvestor/comments/r6f1xh/8_new_cdrs_have_been_released_as_of_december_1st/hmsno2r/",
        "score": 97,
        "subreddit": "CanadianInvestor",
        "created": 1638395751.0
    },
    {
        "author": "Timeriot",
        "body": "I’m watching COST, U, and IBM. I’m thinking of adding more to DIS and V",
        "created_utc": 1638355013,
        "id": "hms59yf",
        "permalink": "/r/stocks/comments/r694ul/stocks_you_cant_wait_to_see_dip_because_youre/hms59yf/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1638383813.0
    },
    {
        "author": "thetagodfather",
        "body": "T is the IBM / GE of telecom\n\nRandomly buy junk companies, fail to integrate them, sell other companies \n\nThen play all kinds of equity games without innovating or driving organic growth",
        "created_utc": 1638356257,
        "id": "hms6rx1",
        "permalink": "/r/stocks/comments/r5zseg/att_sees_slower_wireless_growth_sending_stock_to/hms6rx1/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638385057.0
    }
]