[
    {
        "author": "tsimtsimtsim",
        "body": "Many said the exact same about GE, ExxonMobil, IBM, Cisco, AT&amp;T, HP, Intel, etc. etc. etc.\n\nApple didn't start getting big until the iPhone came out in 2007, 14 yrs ago. Is it that hard to believe anything can happen in the next 20 years?\n\nGuess what the biggest company was 20 yrs ago in 2001... GE at 405 billion market cap. Microsoft was second at 290 billion. Apple was nowhere near top 10 at 8 billion.",
        "created_utc": 1630546630,
        "id": "hb9gk5c",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9gk5c/",
        "score": 325,
        "subreddit": "stocks",
        "created": 1630575430.0
    },
    {
        "author": "balls_deep_6969",
        "body": "Apple and microsoft &amp; spy. You want a stock that generally has large option volume. \n\nKeep an eye on the spreads between the bid and ask.\n\nBuy calls on red days and puts on green days.\n\nLearn how to do technical analysis by drawing support levels and overall trend. \n\nTry to stay away from weeklies. Maybe 1 month out at minimum. \n\nDon't buy SPY puts. You'll get burned lol",
        "created_utc": 1630557042,
        "id": "hba0nnj",
        "permalink": "/r/RobinHood/comments/pg8brd/new_to_buying_call_options_stock_recommendations/hba0nnj/",
        "score": 40,
        "subreddit": "RobinHood",
        "created": 1630585842.0
    },
    {
        "author": "BigDaddy6500",
        "body": "I don’t think they drop out of the top 10 for a very long time, but I think AMZN GOOG and MSFT from the trillion club can knock Apple out of first, something like NVDA too. TSLA as well if they succeed in many of their smaller ventures today.",
        "created_utc": 1630546517,
        "id": "hb9gbgg",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9gbgg/",
        "score": 23,
        "subreddit": "stocks",
        "created": 1630575317.0
    },
    {
        "author": "iamfar_",
        "body": "Seriously. The top 10 biggest companies in 2001 looks way different than now. Only Microsoft has stuck around.\n\nThe top 10 will look very different 20 years from now and there’s a very high chance Apple is no longer #1.",
        "created_utc": 1630547648,
        "id": "hb9ip2j",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9ip2j/",
        "score": 23,
        "subreddit": "stocks",
        "created": 1630576448.0
    },
    {
        "author": "Sir_Bryan",
        "body": "Is it though? Microsoft is incredibly diversified and their products are geared much more towards enterprise. If someone came up with a product that made the iPhone obsolete or even just much less popular, Apple would lose out massively just based on one product.",
        "created_utc": 1630555290,
        "id": "hb9xkfr",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9xkfr/",
        "score": 19,
        "subreddit": "stocks",
        "created": 1630584090.0
    },
    {
        "author": "Tensleepwyo",
        "body": "Diversify a bit my man. Not financial advice but if it were my 50k… I’d go:\n\n10k Apple \n20k Microsoft \n20k VOO or similar",
        "created_utc": 1630535228,
        "id": "hb8sqpn",
        "permalink": "/r/stocks/comments/pg18ib/thoughts_apple_for_first_stock/hb8sqpn/",
        "score": 18,
        "subreddit": "stocks",
        "created": 1630564028.0
    },
    {
        "author": "shortdaYOLO",
        "body": "Yeah their acquisition of Sinclair really gave them the ability to become a supplier of Space Systems Solutions. The Star trackers are not to bad either. \n\nThe launch market has really tight margins, both in engineering and financials. Space infrastructure and services is where money is really at.\n\nRocket Labs Photon platform is really nice, think of it as the Microsoft Azure or AWS of space. You can either build your own satellite(server), and run the ground systems(server farms) and pay your staff(staff), or you can just pay for the data(processing/storage).",
        "created_utc": 1630600945,
        "id": "hbc2meq",
        "permalink": "/r/wallstreetbets/comments/pgked2/rocket_lab_expands_space_systems_footprint_with/hbc2meq/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1630629745.0
    },
    {
        "author": "Current87",
        "body": "I think it's fair to compare Apple to Microsoft in this context...",
        "created_utc": 1630553005,
        "id": "hb9tcid",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9tcid/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1630581805.0
    },
    {
        "author": "BootyOptions",
        "body": "CNBCs scrolling stock ticker has become pretty hilarious.  It used to scroll through a ton of stuff, if you missed your stock it would take like 1 1/2 minutes for it to come up again.\n\nNow they just spam the results of the meme stocks of the day.   They won't tell you what MSFT is at but they'll show you the P&amp;D meme stock with a 150m market cap up 200% like 25 times while you wait.",
        "created_utc": 1630506804,
        "id": "hb6wri5",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb6wri5/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1630535604.0
    },
    {
        "author": "browtfmane",
        "body": "Why don’t people talk about or buy msft more ? This is one of the best companies in the world and has a bright future for big gains",
        "created_utc": 1630551484,
        "id": "hb9qfra",
        "permalink": "/r/CanadianInvestor/comments/pg1s1x/after_hours_discussion_thread_for_september_01/hb9qfra/",
        "score": 9,
        "subreddit": "CanadianInvestor",
        "created": 1630580284.0
    },
    {
        "author": "four1six_",
        "body": "1st world problems, I initiated a transfer for 2k to buy a new surface (thanks options!). MSFT announced today there's a surface event coming up so they're announcing new ones. So obviously now I have to wait.",
        "created_utc": 1630542255,
        "id": "hb96vig",
        "permalink": "/r/wallstreetbets/comments/pdrwfn/fraternal_association_of_gambling_gentlemen_and/hb96vig/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630571055.0
    },
    {
        "author": "boom_boom_man954",
        "body": "MSFT, GOOG, AMZN, TSLA are the safest best holds for the next 20 years.",
        "created_utc": 1630505122,
        "id": "hb6sty8",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb6sty8/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630533922.0
    },
    {
        "author": "Sinnnaaa",
        "body": "Literally use 10k to  set up recurring investments into blue chip stocks you believe will do good in the future. \n\nThen use the rest of the 40k and set up recurring investments into SPY. Investing into SPY is literally like investing into 500 of the best companies in the world. Facebook, Apple, Tesla, Microsoft, etc… \n\nLike this you scratch your itch to invest into individual companies with the 10k… which is a lot tbh. \n\nAnd now you have 40k into a proven system that brings great ROI every year. Data is there, like dude said “Googles your best friend”.\n\nWith 50k you can literally become a millionaire if you just don’t paper hand or do anything… literally. Like invest it and do nothing. No penny stocks, no Reddit stocks. It’s not worth it. It lucrative but not necessary for your situation. No need to YOLO your savings for fun.",
        "created_utc": 1630532451,
        "id": "hb8mxqw",
        "permalink": "/r/stocks/comments/pg18ib/thoughts_apple_for_first_stock/hb8mxqw/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630561251.0
    },
    {
        "author": "onceuponbanana",
        "body": "Facebook, Apple, Microsoft, Amazon, Google and Berkshire Hathoway are like 25% of SPY",
        "created_utc": 1630543604,
        "id": "hb99xej",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb99xej/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630572404.0
    },
    {
        "author": "rock00888",
        "body": "Your picks aren't well diversified. I'd personally recommend focusing on getting some more diverse assets. Healthcare, manufacturing, and utilities would all reduce the amount of risk you are taking for the return. It's probably worth holding on to apple and Microsoft (and the others if you have a risk tolerance and really believe in the companies), but directing new capital elsewhere.\n\nYou probably don't want to do this, but low cost ETFs can be your friend. They give broad exposure for not much money. Something to consider adding to your portfolio.\n\nI know this is an unpopular opinion here, but I think Tesla is a bad bet. I understand its rev is growing, but its valuation is very high for its corresponding fundamentals. It's also just building cars right now. So anything else that might come in the future is mostly speculative.",
        "created_utc": 1630519382,
        "id": "hb7rhu8",
        "permalink": "/r/stocks/comments/pfz5e5/about_to_turn_20_and_need_some_advice/hb7rhu8/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630548182.0
    },
    {
        "author": "michaels0510",
        "body": "Yep. I think EVs and cyber security will be in demand in the next 5 years+. Apple, Facebook and Microsoft all have good track records in terms of recovering from crashes. Even if there was a crash today, I feel these would all recover relatively quickly.",
        "created_utc": 1630596456,
        "id": "hbbrgyj",
        "permalink": "/r/stocks/comments/pgjvol/my_portfolio_is_too_deep_on_semiconductors_what/hbbrgyj/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630625256.0
    },
    {
        "author": "michaels0510",
        "body": "Anything techy. Apple, Facebook, Tesla, Microsoft and perhaps Crowdstrike.",
        "created_utc": 1630596162,
        "id": "hbbqqzb",
        "permalink": "/r/stocks/comments/pgjvol/my_portfolio_is_too_deep_on_semiconductors_what/hbbqqzb/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630624962.0
    },
    {
        "author": "tt598",
        "body": "Even Steve Ballmer couldn't kill Microsoft, I think they'll be fine for the next decades.",
        "created_utc": 1630568852,
        "id": "hbagyn4",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hbagyn4/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630597652.0
    },
    {
        "author": "mprey_",
        "body": "Well that's true for anything high growth/high beta. If you look at older deSPACs from 2019 and 2020 of course they have also had their ups and downs but the quality ones have held up very well. PRPL dropped to 5 after merger, it's at 25 now.\n\nObviously don't throw your entire portfolio in them, but you're not gonna get price appreciation in the double or triple digits from something like MSFT.",
        "created_utc": 1630581876,
        "id": "hbawqag",
        "permalink": "/r/SPACs/comments/pgcoa4/announcements_x_daily_discussion_for_thursday/hbawqag/",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1630610676.0
    },
    {
        "author": "senecadocet1123",
        "body": "Most probable scenario? Apple does fine but not great, gets surpassed by Microsoft, Google fb, amazon. Then China takes over: if the first big 6 are going to be Chinese 20 years from now, Apple won't be in the top 10",
        "created_utc": 1630567486,
        "id": "hbafcq4",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hbafcq4/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630596286.0
    },
    {
        "author": "mprey_",
        "body": "And before that, MSFT did fuck all for almost 15 years - so your point about survivorship bias can apply to anything.",
        "created_utc": 1630583477,
        "id": "hbazd8t",
        "permalink": "/r/SPACs/comments/pgcoa4/announcements_x_daily_discussion_for_thursday/hbazd8t/",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1630612277.0
    },
    {
        "author": "OlyBomaye",
        "body": "When will the sale of biometric data that Microsoft has been collecting from the  vaccination microchips show up in their financials?  Next quarter?",
        "created_utc": 1630588367,
        "id": "hbb8nmi",
        "permalink": "/r/wallstreetbets/comments/pdrwfn/fraternal_association_of_gambling_gentlemen_and/hbb8nmi/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630617167.0
    },
    {
        "author": "papasmurftp",
        "body": "Sold MSFT puts this morning at break even.  FML",
        "created_utc": 1630598130,
        "id": "hbbvh7e",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbbvh7e/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630626930.0
    },
    {
        "author": "professor_jeffjeff",
        "body": "Sell way OTM CCs on stocks you already own, so like 30 delta at most but 15 delta is safer and probably free money.  PMCC underlying should be the same criteria as if you wanted to just be long on the stock itself but the long call is cheaper than the stock so you can play on shit you couldn't afford to just buy 100 shares like AMZN, TSLA, etc.  \n\n&amp;#x200B;\n\nIf you want a better strategy than the wheel, what I do is size my position in 200-share minimum size and then buy-write 100 shares with a CC and then a CSP for the other 100 shares, so basically a covered strangle.  Profits from both sides of the wheel, is as directional as you want it to be (but generally directional with positive delta), and captures profits from gains in the underlying instead of fucking right off with those like if you're just selling a CSP with the wheel.  If you get assigned on your CSP, then switch to just CCs.  If you get assigned on your CCs then either go back in or switch to another underlying.  I might get assigned on MARA if it keeps going up, but if so then I'll get assigned at 43 where my entry was 30 and my adjusted basis is probably closer to 25 so that's not bad for 6 weeks or so on a single position in a $10k account (actual account is closer to $35k but I'm pretending it's only $10k so I can practice this shit without blowing up my account).  This strategy ONLY works because we're in the longest bull market in history, but because of that I want to be more directional.  If we get into a crash, then chase your underlying down with CCs and roll to 50 delta every time your CCs hit like 80 delta to lock in the intrinsic in the contract for a small additional profit.  Also sell call credit spreads as it falls and buy back in at the bottom with all the premium you made during the fall.  On the way up, put credit spreads and CSPs will make you more money.  If it stays at the bottom, then condor the fuck out of it and set a limit buy like $1 below your short call so you can turn that shit into a covered call and a long call; if it drops then just take assignment on the short put if you like the stock.  \n\n\nFor PMCC, the good part is you can use it on stocks you can't afford so NVDA, AMD, TSLA, AAPL, MSFT (premium is shit though), FB, etc.  It's also a much more efficient use of capital than an actual CC with the stock in terms of your ROC since you can hold more positions (so trade more positions but trade smaller; read up on the Kelly Criterion for gamblers to figure out position sizing).  With 10k I'd recommend 3 positions with a maximum of maybe 4 or 5 positions at most.  With any options selling strategy, your goal is to get rich very slowly but consistently.  Aim for like 1% per week and you'll do fine.",
        "created_utc": 1630556028,
        "id": "hb9yvo4",
        "permalink": "/r/wallstreetbets/comments/pfwujl/became_a_millionaire/hb9yvo4/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630584828.0
    },
    {
        "author": "dhpw2",
        "body": "**Main Portfolio:**  \nApple  \nMicrosoft  \nVisa  \nMastercard  \nFacebook  \nAlibaba  \nSquare  \nAMD  \n\n\n**Long shots/Play portfolio:**  \nPalantir  \nVirgin Galactic  \nGamestop  \nBlackberry  \nInvitae  \n\n\n**Looking to add in, in the future**  \nTaiwan Semiconductor  \nDisney  \nCostco  \nCoinbase  \nTesla  \nNvidia  \nJPMorgan  \nApplied Materials",
        "created_utc": 1630489444,
        "id": "hb62btv",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hb62btv/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630518244.0
    },
    {
        "author": "thejoker4059",
        "body": "Between TGT, MSFT, BABA, and SPY puts, I should just quit today jfc",
        "created_utc": 1630602645,
        "id": "hbc6xsd",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbc6xsd/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630631445.0
    },
    {
        "author": "Suspicious__Man",
        "body": "RBLOX puts\nCHWY calls\nSPY puts/calls\n\nthinking about MSFT leaps but haven't pulled the trigger.",
        "created_utc": 1630602638,
        "id": "hbc6x5v",
        "permalink": "/r/wallstreetbets/comments/pdrwfn/fraternal_association_of_gambling_gentlemen_and/hbc6x5v/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630631438.0
    },
    {
        "author": "69PutsOnYourPuts69",
        "body": "People are gonna need to replace phones computers from MSFT and APPLE, and a bunch of other shit you can find on AMZN They'll take out loans from banks to buy shit from HD to renovate instead of just fixing their houses and then I guess they'll go simp for pity likes on Facebook\n\nIdk, you asked",
        "created_utc": 1630537993,
        "id": "hb8ycnc",
        "permalink": "/r/wallstreetbets/comments/pdrwfn/fraternal_association_of_gambling_gentlemen_and/hb8ycnc/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630566793.0
    },
    {
        "author": "lurkman_420",
        "body": "NVDA 30%\nSWBI 13%\nAMD 11%\nMSFT 10%\nCARR 9%\nAAPL 7%\nHIMX 5%\nAMKR &lt;5%\nTSM &lt;5%\nRBBN &lt;5%\nECOM &lt;5%",
        "created_utc": 1630510510,
        "id": "hb75oof",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hb75oof/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630539310.0
    },
    {
        "author": "VersaceLazerz",
        "body": "Age 29, investing for retirement and engagement ring. I try to invest in areas that I know well or with brands that I regularly use. Started investing with only index funds and broadened to include individual tickers over time. Dipped a small amount into crypto this year as well.\n\n17%\tFB\n\n17%\tAMZN\n\n14%\tNVDA\n\n10%\tMSFT\n\n8%\tATVI\n\n8%\tVFV\n\n8%\tHXQ\n\n6%\tBABA\n\n6%\tNKE\n\n4%\tV\n\n1%\tETH",
        "created_utc": 1630535168,
        "id": "hb8smdg",
        "permalink": "/r/CanadianInvestor/comments/pfqpm7/rate_my_portfolio_megathread_for_september_2021/hb8smdg/",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1630563968.0
    },
    {
        "author": "bchen270",
        "body": "I think most people see Apple and  Microsoft to be very safe stocks. Others to consider would be the likes of Disney, Nike, Amazon, Google, Facebook.",
        "created_utc": 1630546212,
        "id": "hb9fnu6",
        "permalink": "/r/stocks/comments/pg18ib/thoughts_apple_for_first_stock/hb9fnu6/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630575012.0
    },
    {
        "author": "Sandvicheater",
        "body": "Buy MSFT and AAPL",
        "created_utc": 1630521868,
        "id": "hb7xjal",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7xjal/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630550668.0
    },
    {
        "author": "Hani95",
        "body": ":((((((((((( I like value growth, and I liked FB/Microsoft/AMD for a very long time. Still like them. Sad face.",
        "created_utc": 1630595938,
        "id": "hbbq6mx",
        "permalink": "/r/wallstreetbets/comments/pdrwfn/fraternal_association_of_gambling_gentlemen_and/hbbq6mx/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630624738.0
    },
    {
        "author": "IVIARSHALL_",
        "body": "c3.ai nobrainer great earnings and guidance, google and microsoft coop",
        "created_utc": 1630561556,
        "id": "hba7o3b",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hba7o3b/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630590356.0
    },
    {
        "author": "clownbaby777",
        "body": "msft breaking its trendline. probably looking to buy calls now",
        "created_utc": 1630597089,
        "id": "hbbszaf",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbbszaf/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630625889.0
    },
    {
        "author": "indigoismyfavorite",
        "body": "It was about five years after I got out of Harvard... \n\n...I get this call from Bill, who says, \"You wanna join me and Paul?\" \n\nIt was a two-bit little company they called Microsoft.\n\nAnd at first I think, \"Yeah. Like I'd like to lose more hair. \" \n\nBut, you know, then I started thinking",
        "created_utc": 1630535344,
        "id": "hb8sz78",
        "permalink": "/r/wallstreetbets/comments/pdrwfn/fraternal_association_of_gambling_gentlemen_and/hb8sz78/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630564144.0
    },
    {
        "author": "RADIO02118",
        "body": "That’s what I’ve been watching. Options volume at open. Calls bought at the market or near the ask, which suggests retail buying.\n\nAnd you’re right. It’s 100% tech. AAPL is actually the perfect example of what I’m talking about. You can see it in NVDA, TSLA and MSFT as well. Take a look!",
        "created_utc": 1630544232,
        "id": "hb9bb8q",
        "permalink": "/r/wallstreetbets/comments/pdrwfn/fraternal_association_of_gambling_gentlemen_and/hb9bb8q/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630573032.0
    },
    {
        "author": "schnowysno1",
        "body": "23. \n\n20% Amazon, 20% Facebook, 10% Microsoft, 10% Builders First Source, 8% Suncor, 8% ARC Resources, 4% Cenovus Energy, 5% Riocan, 5% RY, rest cash\n\nroast me.",
        "created_utc": 1630502722,
        "id": "hb6nieu",
        "permalink": "/r/CanadianInvestor/comments/pfqpm7/rate_my_portfolio_megathread_for_september_2021/hb6nieu/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1630531522.0
    },
    {
        "author": "NooshBagoosh",
        "body": "Open a self-directed Roth IRA and max it out every year if possible. The difference in tax-free growth over the course of 40 years is enormous.\n\nIf you're confident enough I'd personally recommend doing short term options trading in that account right now. If not, stick it all in an index or a blue chip stock like MSFT and don't look at it for a few decades.",
        "created_utc": 1630540625,
        "id": "hb93hvc",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb93hvc/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630569425.0
    },
    {
        "author": "summitrock",
        "body": "I’m buying Microsoft leaps.  First time leaping.  I have no idea what I’m doing.",
        "created_utc": 1630501683,
        "id": "hb6lcfc",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb6lcfc/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630530483.0
    },
    {
        "author": "silent_johnn",
        "body": "You're right. It's speculation. All of it.  Speculation that Apple will sell more iPhones and that Microsoft increases its cloud market share and FB continues to steal our personal data.\n\nFew here will admit it.",
        "created_utc": 1630592734,
        "id": "hbbijjn",
        "permalink": "/r/investing/comments/pge37e/daily_general_discussion_and_spitballin_thread/hbbijjn/",
        "score": 3,
        "subreddit": "investing",
        "created": 1630621534.0
    },
    {
        "author": "EuphoricWizard",
        "body": "Horrific trading day.  All movement is done in premarkets and its flat low volume during the day.  My MSFT calls bleed out from 100% to 20% and I dumped before they went negative at least",
        "created_utc": 1630601877,
        "id": "hbc503t",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbc503t/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630630677.0
    },
    {
        "author": "stonksrgud",
        "body": "Sold 1 leap Googl, 10 leaps MSFT, 10 leaps NVDA today.  Up ~100%, 100%, 70%.  All expiry 1/23.  Still have open leaps in all 3.  Some to 1/23 some to 6/23.  Even in this strong bull market, I just feel there’s gonna be a dip to buy more.  Wanted 1/4m cash on hand.  \n\nYes the baba/bidu leaps going well also.  Plus I snap bought 10c leaps 1/23 on ABBV when it was down ~$13 today.  Solid company, bottom left to top right and it only cost me ~$14k to give it a swing.\n\nNo plans for tomorrow unless something else goes the way Abbv did today.\n\nGood luck all!",
        "created_utc": 1630527312,
        "id": "hb8ayks",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8ayks/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630556112.0
    },
    {
        "author": "TitanOW",
        "body": "I think your portfolio is a little top heavy, but at approaching 20 that isn’t necessarily a bad thing. I’m 22 myself and Microsoft, apple, Tesla, and AMD are all in my top 5 holdings as well, but with a decent amount less weight. Biggest I have is Microsoft at 18% and the next is a 9% hold.\n\nThe biggest factor here is your age. At just under 20 you have well over 40 years on your investing horizon, and the companies in your top holdings aren’t going anywhere any time soon. Those companies will grow over that time guaranteed.\n\nWhat I would recommend though is reducing your top 3 to a 20% hold and using that money to invest in some S&amp;P 500 index funds or moving the money to a Roth IRA account which essentially will do the same thing but with management. Since you have extra income that you’re using to invest right now I’d also say to put the money you’re adding to your portfolio in one of the two places above as well, just so that all your eggs aren’t in the tech basket but have guaranteed growth from funds that follow the market as a whole. If you need recommendations on which ETFs to choose lmk.",
        "created_utc": 1630521132,
        "id": "hb7vr9a",
        "permalink": "/r/stocks/comments/pfz5e5/about_to_turn_20_and_need_some_advice/hb7vr9a/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630549932.0
    },
    {
        "author": "tony78ta",
        "body": "And Microsoft....but hindsight is 20x20...as they say.",
        "created_utc": 1630540673,
        "id": "hb93l6v",
        "permalink": "/r/stocks/comments/pg18ib/thoughts_apple_for_first_stock/hb93l6v/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630569473.0
    },
    {
        "author": "Raezul",
        "body": "MSFT is such a great stock. Never selling until 30 years later",
        "created_utc": 1630513163,
        "id": "hb7c6t9",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7c6t9/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630541963.0
    },
    {
        "author": "Tsunari",
        "body": "And a decade ago Microsoft was seen as nearing it's \"death\" and stagnating. I also agree that SAP isn't as sexy as Microsoft is today, just don't think your comparison makes sense. \n\nAlso if you now could tell me which US company does fashion &amp; consumer discretionary better than LVMH then I believe you could make a good point.",
        "created_utc": 1630594890,
        "id": "hbbnm5l",
        "permalink": "/r/stocks/comments/pgi9kl/why_dont_ukeuropean_stocks_get_much_attention/hbbnm5l/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630623690.0
    },
    {
        "author": "seansye",
        "body": "Seriously, only stocks you need rn are FAAG stocks and Microsoft. They have had 20 to 40% returns past 6 month.",
        "created_utc": 1630516030,
        "id": "hb7j9xc",
        "permalink": "/r/stocks/comments/pfqcg3/rstocks_daily_discussion_wednesday_sep_01_2021/hb7j9xc/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630544830.0
    },
    {
        "author": "Green_Lantern_4vr",
        "body": "Okay I bought calls on msft and TSLA shares. Enjoy your profit. Also I changed the password to greenlanternrulesheliterallyuseshisownwillpowerashisweaponhowisthatnotinspirational",
        "created_utc": 1630519988,
        "id": "hb7syyt",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7syyt/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630548788.0
    },
    {
        "author": "MightyManorMan",
        "body": "The point of markets is to always push the top of the index up. If you are waiting for it to go down, you might be waiting a long long long time. \n\nLook at Paypal, pretty close to value. Company is still growing, maybe 15% a year or so. EPS is up. Sitting on cash.\n\nLook at Apple, pretty close to value. Company still growing, maybe 5% a year or so. EPS is up. Sitting on cash. And buying back their shares if they go too low... bought back about 790 million shares in 2020.\n\nMicrosoft, a little over values, growing revenue, growing earnings, sitting on cash. And buying back their shares if they go too low... bought back about 50 million shares in 2020.\n\nThere is plenty of value.",
        "created_utc": 1630515969,
        "id": "hb7j4kr",
        "permalink": "/r/CanadianInvestor/comments/pfvw03/whos_still_buying_and_why/hb7j4kr/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1630544769.0
    },
    {
        "author": "WoOoOoOoShHhHh",
        "body": "I made a lot of money on MSFT leaps a few weeks ago.\n\nYou have any strike/date you like for the CHWY calls?",
        "created_utc": 1630602833,
        "id": "hbc7ej6",
        "permalink": "/r/wallstreetbets/comments/pdrwfn/fraternal_association_of_gambling_gentlemen_and/hbc7ej6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630631633.0
    },
    {
        "author": "McSwaggerKushai",
        "body": "SCHX - 22.5%, SCHD - 15.9%, SCHG - 12.9%, QQQM - 12.9%, MSFT - 12.4%, VEA - 6.5%, AAPL - 6.3%, VONG - 6.2%, SCHA - 4.3%\n\nJust starting out with investing, looking to add some mid and small cap etfs.",
        "created_utc": 1630560005,
        "id": "hba5eo9",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hba5eo9/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630588805.0
    },
    {
        "author": "underling1978",
        "body": "I'm running AAPL, MSFT and NVDA for tech stocks in my RRSP. Also holding NVDA in my TFSA. Planning on all 3 being solid for the long term.",
        "created_utc": 1630590473,
        "id": "hbbdb5z",
        "permalink": "/r/CanadianInvestor/comments/pg1s1x/after_hours_discussion_thread_for_september_01/hbbdb5z/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1630619273.0
    },
    {
        "author": "Justastonkie",
        "body": "Damn it MSFT",
        "created_utc": 1630594768,
        "id": "hbbnbq6",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbbnbq6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630623568.0
    },
    {
        "author": "papasmurftp",
        "body": "Calls on SPY puts on MSFT.  Small caps calls",
        "created_utc": 1630589197,
        "id": "hbbafq9",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hbbafq9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630617997.0
    },
    {
        "author": "LilPeePee93",
        "body": "Don’t take it into consideration at all. There was insider trading at Microsoft. There were HUGE sells worth $50,000,000+ from upper management when the stock was at $250, it’s now at $300.",
        "created_utc": 1630541362,
        "id": "hb94xhd",
        "permalink": "/r/stocks/comments/pfrdc9/how_seriously_should_we_consider_insider_trading/hb94xhd/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630570162.0
    },
    {
        "author": "fufm",
        "body": "Was anyone smart/ballsy enough to pick up some Apple puts today? Textbook exhaustion candle on the day for AAPL and most of tech in general (amzn + msft especially), looking almost certain we will have some pullback tomorrow.",
        "created_utc": 1630530113,
        "id": "hb8hquw",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8hquw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630558913.0
    },
    {
        "author": "Surfie",
        "body": "Breakouts are usually better for large caps in my opinion because you don't have to worry about so many bag holders. Look at NVDA when it broke 200. Look at AMD when it broke 100. Look at MSFT. Once they break long periods of consolidation, they continue to move even higher. Much less risk.",
        "created_utc": 1630551460,
        "id": "hb9qe1z",
        "permalink": "/r/wallstreetbets/comments/pg199e/pltr_financial_due_diligence_update_q221/hb9qe1z/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630580260.0
    },
    {
        "author": "doodguybro44",
        "body": "The good thing about broad index funds is you are still buying Apple, MSFT, all the FAANG and big names, as well as the broad diversity of the smaller brands so you can count on a safer overall investment due to owning the whole market.  If you aren't even sure whether or not to DCA, I wouldn't recommend stock picking.  \n\n&amp;#x200B;\n\nBuild your portfolio, and use your experience over time to educate yourself on how the market deals with news, and how you deal with market changes, psychologically.",
        "created_utc": 1630554142,
        "id": "hb9vh3i",
        "permalink": "/r/stocks/comments/pg18ib/thoughts_apple_for_first_stock/hb9vh3i/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630582942.0
    },
    {
        "author": "benjammin9292",
        "body": "MSFT 305c gonna expire worthless this Friday huh",
        "created_utc": 1630506531,
        "id": "hb6w4ic",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb6w4ic/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630535331.0
    },
    {
        "author": "Traditional-Leader54",
        "body": "If you don’t need the royalty payments now I would suggest looking into a retirement account and just let your money grow over the next 40 years. In the US these are tax deferred until age 55 or 62 depending on the plan. \n\nIf you want the payments now I’d look into dividend stocks. They are stocks that pay you money (I think quarterly) based on how many shares you have and how much money the company made that quarter. Think CocaCola, Microsoft, IBM, Apple, etc. Companies that earn consistently and aren’t going anywhere. This is less risky than investing in a startup company for a true royalty that only lasts if the company does. \n\nEither way talk to a stock broker for more info.",
        "created_utc": 1630507542,
        "id": "hb6yj1d",
        "permalink": "/r/investing/comments/pfpzk2/daily_advice_thread_all_basic_help_or_advice/hb6yj1d/",
        "score": 2,
        "subreddit": "investing",
        "created": 1630536342.0
    },
    {
        "author": "clownbaby777",
        "body": "msft falling, dip buy?",
        "created_utc": 1630595408,
        "id": "hbbovt3",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbbovt3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630624208.0
    },
    {
        "author": "GeorgeWashingtonTFP",
        "body": "Lol msft just sleeping",
        "created_utc": 1630598675,
        "id": "hbbwuu9",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbbwuu9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630627475.0
    },
    {
        "author": "MajesticCombination5",
        "body": "Just do monthlies or spreads on MSFT, damn near as close to a money printer as you're gonna find in the market",
        "created_utc": 1630506692,
        "id": "hb6whzm",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb6whzm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630535492.0
    },
    {
        "author": "fltpath",
        "body": "Didnt ARKX open at $21.50? Its only risen to $21.18 at this time....\n\nI think what is more telling is what is included in this new ARK fund, rather than what is not..\n\nSame old stuff,  \n\n*Among stocks in the benchmark are four megacaps: Amazon (NASDAQ:AMZN), Apple (NASDAQ:AAPL), Microsoft (NASDAQ:MSFT) and ARK favorite Tesla (NASDAQ:TSLA), a stalwart in the flagship ARK Innovation ETF (NYSEARCA:ARKK).*  \n*There are names familiar to ARK fund investors, like Coinbase (NASDAQ:COIN), Netflix (NASDAQ:NFLX) Roku (NASDAQ:ROKU) and Teladoc (NYSE:TDOC).*  \n*Other stocks include Deere (NYSE:DE), Chipotle (NYSE:CMG), Best Buy (NYSE:BBY), Airbnb (NASDAQ:ABNB) and Target (NYSE:TGT).*",
        "created_utc": 1630509394,
        "id": "hb72yss",
        "permalink": "/r/wallstreetbets/comments/pfrncw/another_one_cathie_woods_ark_files_for_new/hb72yss/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630538194.0
    },
    {
        "author": "ligmah91",
        "body": "MSFT has strong indicators for a small uptrend  today. RSI at 43, price is above MA &amp; EMA line. Hoping to make some gains with these calls I just made. Dumping tomorrow morning",
        "created_utc": 1630517007,
        "id": "hb7loen",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7loen/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630545807.0
    },
    {
        "author": "OlyBomaye",
        "body": "did you buy calls on microsoft too?",
        "created_utc": 1630594885,
        "id": "hbbnlq9",
        "permalink": "/r/wallstreetbets/comments/pdrwfn/fraternal_association_of_gambling_gentlemen_and/hbbnlq9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630623685.0
    },
    {
        "author": "rebatomm",
        "body": "A good question on the wrong place :)\n\nYour logic is good in a long term investing plan. \n\nThis forum is a hour/daily based investors, evaluations is the last thing people here will follow.\n\nJust as example, they invest in a failed tourism company in the beginning of pandemic and most of them won lots of cash. And they will keep a obvious garbage company just because, even if it goes to zero.\n\nIf you’re a long term investor this is a good place to get daily news but never, really never, follow a advice. Except mine of course :)\n\nMy opinion, not advice: AMD is garbage and intel is not much better. Apple and Microsoft are investing in their own cpus.\nIf you want something similar check nvidia.",
        "created_utc": 1630589175,
        "id": "hbbadyk",
        "permalink": "/r/wallstreetbets/comments/pghk1y/how_are_people_buying_shares_of_amd_at_this/hbbadyk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630617975.0
    },
    {
        "author": "capper78",
        "body": "Fuck it. Dumping these puts and buying every FANGMAN stock or call at close. All they are doing is flooding the open with market ask calls each morning\n\nToday is NFLX yesterday was AAPL. tomorrow probably MSFT or NVDA\n\nqueue the bog call *",
        "created_utc": 1630591632,
        "id": "hbbfyir",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbbfyir/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630620432.0
    },
    {
        "author": "WFCtothemoon",
        "body": "I bought FAANG and looking back wish I just bought qqq instead\n\nit's literally 10% apple, 10% microsoft, 10% amazon, 10% google, 4% facebook, nvda, paypal etc. and the rest high quality growth stocks\n\nif you want \"tech\", just go for the qqq and don't stock-pick I would say.",
        "created_utc": 1630586310,
        "id": "hbb4ix2",
        "permalink": "/r/stocks/comments/pg18ib/thoughts_apple_for_first_stock/hbb4ix2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630615110.0
    },
    {
        "author": "footlong24seven",
        "body": "Even if that's so, I'm not dumping my MSFT and NVDA shares.",
        "created_utc": 1630521874,
        "id": "hb7xjs2",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7xjs2/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630550674.0
    },
    {
        "author": "bartturner",
        "body": "It really does not make much sense.   Google is growing a lot faster both bottom line and top line.   Plus has a ton of assets that have yet been fully moentized.\n\nThen on top they have a lower P/E than Microsoft.   \n\nBut it creates a buying opportunity for Google.  It should not be surprising that Google is up already over 65% this year.  But there is tons of room for it to run further.",
        "created_utc": 1630489453,
        "id": "hb62c9x",
        "permalink": "/r/stocks/comments/pfaza9/why_does_microsoft_have_a_higher_pe_ratio_that/hb62c9x/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630518253.0
    },
    {
        "author": "fastnlite",
        "body": "Today was a crazy ride--that's why I'm in shares and holding for a good while before selling. As far as profitability, I think the metric that matters more is if they can keep growing. This isn't a mature company like SBUX or MSFT where you want to see lots of profits--this is a growth story, so look closer at growth.",
        "created_utc": 1630526026,
        "id": "hb87rlh",
        "permalink": "/r/wallstreetbets/comments/pfkm8l/another_sklz_shitpost_except_with_actual_dd_this/hb87rlh/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630554826.0
    },
    {
        "author": "NarNights",
        "body": "You're killing it with this port construction. MSFT vs. GOOG doesn't matter if you realize the cloud transformation potential.\n\nI put DDOG in the software box along with NET and Fastly. Great plays with the right entry, but smaller moat compared to cloud infrastructure / Docker hosts.\n\nI use DDOG at work. AWS is slowly copying their offering. Same story with NET. Will be interesting to see if they branch out, fade, or are bought up.",
        "created_utc": 1630523467,
        "id": "hb81fhy",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb81fhy/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630552267.0
    },
    {
        "author": "AccomplishedTrip144",
        "body": "I would plan to invest about 25 of the 50k now and watch the market for a few months to slowly invest the other 25k. So 5k now in apple is fine, but be aware apple just went up a little the last two days so it may look bad in the very short term. \n\nI think Microsoft is another good stock, as is VOO and SPXT. \n\nYou should also get some dividend stocks like IRM which has a dividend date of 9/14. Set everything to drip so dividends just get reinvested into more stock.",
        "created_utc": 1630531059,
        "id": "hb8jvfg",
        "permalink": "/r/stocks/comments/pg18ib/thoughts_apple_for_first_stock/hb8jvfg/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630559859.0
    },
    {
        "author": "bartturner",
        "body": "You can't go wrong with any of the big five.  Google, Apple, Amazon, FB and Microsoft.\n\nIdeally you own some of all five.  I do like Google the best of the group just because they have the longer runway.  Built on top of all the assets they own and yet to fully monetized.\n\nBut also really like Apple.   I have been lately moving Apple up and to #2 ahead of Amazon but after Google.\n\nFull disclosure.  I own all five and have for a long time.  Obviously Microsoft and Apple the longest as they are both so much older than the other 3.   I do think it is only a matter of time until Google overtakes Apple in market cap.",
        "created_utc": 1630576222,
        "id": "hbap7hy",
        "permalink": "/r/stocks/comments/pg18ib/thoughts_apple_for_first_stock/hbap7hy/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630605022.0
    },
    {
        "author": "RennieDelano",
        "body": "MSFT 20.4%\n\nAAPL 17.4%\nSQ 12.8%\nAMD 10.4%\nABBV 7.7%\nNIO 7.7%\nO 7.5%\nTTCF 4.3%\nPFE 3.8%\nCSCO 3.8%\nAFL 3.4%\nVTRS 0.7%\n\nI invest $1,000 a month. It’s a pretty boring portfolio.",
        "created_utc": 1630598999,
        "id": "hbbxo0d",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hbbxo0d/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630627799.0
    },
    {
        "author": "jessejerkoff",
        "body": "Well. From their last quarterly statement, of course the big profit drivers are azure and o365, but under more personal computing, wich accounts for 54 billion in revenue and 19.4 billion in profit you will find that surface mainly suffered from supply chain constraints due to Covid and the ongoing container shortage, and gaming as a whole in terms of overall revenue also increased.\n\nOf course it's not big enough of a profit center to call msft a gaming and device company, but I'm fairly sure, Satya wouldn't want to miss those 19 billion on the income statement",
        "created_utc": 1630498768,
        "id": "hb6frmp",
        "permalink": "/r/stocks/comments/pfaza9/why_does_microsoft_have_a_higher_pe_ratio_that/hb6frmp/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630527568.0
    },
    {
        "author": "Justastonkie",
        "body": "So MSFT is still going at it 😁",
        "created_utc": 1630503930,
        "id": "hb6q4zu",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb6q4zu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630532730.0
    },
    {
        "author": "Smipims",
        "body": "Biggest threat to this company is $MSFT. But there's enough computers in the world for $CRWD to continue to grow at an astounding rate. Almost every major tech company founded in the last 10-15 years is a customer of $CRWD.",
        "created_utc": 1630525560,
        "id": "hb86lti",
        "permalink": "/r/investing/comments/pffq3u/crowdstrike_earnings_for_quarter_2/hb86lti/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630554360.0
    },
    {
        "author": "Justastonkie",
        "body": "Made some MSFT calls then lost them. All good there is always another day. Cheer up",
        "created_utc": 1630531174,
        "id": "hb8k4lj",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8k4lj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630559974.0
    },
    {
        "author": "accountofyawaworht",
        "body": "I think what a lot of people are forgetting is the marketing genius of Apple. Apple is as iconic a brand as Coca-Cola and as fashionable as Chanel, in a way that Microsoft (or Samsung or Android) simply aren’t. That kind of image is a far more elusive nut to crack than simply producing excellent products. The best tech doesn’t always win in the market… as Betamax could surely tell you.",
        "created_utc": 1630595002,
        "id": "hbbnvnp",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hbbnvnp/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630623802.0
    },
    {
        "author": "ilongforyesterday",
        "body": "I think I’ll probably sell off my cost basis, but I’m very bullish on MSFT and will keep DCAing into it. Analyst price targets are generally for a 12 month time frame, I think it will rise more than just 325$ as long as they continue innovating and holding a competitive advantage with their software packages",
        "created_utc": 1630571886,
        "id": "hbaker2",
        "permalink": "/r/stocks/comments/p3vttm/discussion_on_microsoft_msft/hbaker2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630600686.0
    },
    {
        "author": "InteractiveDragon",
        "body": "Microsoft, Google, apple, Facebook and amazon make up something stupid like 30% of the sp500.\n\nThey are combined worth more than 9 trillion dollars. The chart looks like that because the valuations of these companies is propping the whole index up. And do these companies deserve their valuations? Most would argue yes. They are the greatest compounders in history.\n\nWe can't use traditional metrics to measure the market anymore. Or at least traditional values. This is how I can think there doesn't necessarily need to be a crash anytime soon. \n\nDoes that mean the market won't crash? Of course not. But it does mean looking at that chart and saying this has to come down, and soon, might not be completely accurate.\n\nMostly likely with the end of qe, things will get more volatile and then look for some unforseen geopolitical shock combing with that to send us into a bear market. It always seems to be the thing we don't see coming that's going to actually start the next recession. Everything else gets priced in. \n\nOr maybe this keeps going up for five more years.\n\nWho knows?",
        "created_utc": 1630574827,
        "id": "hbanmrk",
        "permalink": "/r/StockMarket/comments/pg08a0/i_really_want_some_rational_discussion_on_this/hbanmrk/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630603627.0
    },
    {
        "author": "four1six_",
        "body": "I was sold on the Pro 3 (I got one for free), so I def want an upgrade. I did marketing for MSFT for a while, and once I learned it ran full windows I was sold lol.",
        "created_utc": 1630551017,
        "id": "hb9pios",
        "permalink": "/r/wallstreetbets/comments/pdrwfn/fraternal_association_of_gambling_gentlemen_and/hb9pios/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630579817.0
    },
    {
        "author": "Abusing-Green",
        "body": "Dont buy game companies. Buy the platforms that play them.\n\nMSFT and SONY out performed both Activision and EA last year. And they'll probably continue to do so even during production luls that game studios experience between releases because of their alternative revenue sources",
        "created_utc": 1630527884,
        "id": "hb8cdpk",
        "permalink": "/r/StockMarket/comments/pejbot/looking_to_buy_a_gaming_company_budget_15000/hb8cdpk/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630556684.0
    },
    {
        "author": "adambrukirer",
        "body": "I realize I said sector but should've said industry. Any specific tech industries to look out for? I'm assuming you'd suggest EVs/cybersecurity and any blue chip tech stock like apple/facebook/microsoft etc?",
        "created_utc": 1630596323,
        "id": "hbbr5ba",
        "permalink": "/r/stocks/comments/pgjvol/my_portfolio_is_too_deep_on_semiconductors_what/hbbr5ba/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630625123.0
    },
    {
        "author": "awe2D2",
        "body": "The problem is that 25% of the S&amp;P 500 is in just 8 companies. Not really a good representation of 500 companies or the overall state of the economy when it's all being pushed by Apple, Amazon, Googles, Tesla's, Facebook, Microsoft and Berkshire. As long as people keep pouring money into those giants the S&amp;P will keep going up. The crash will occur when people start massively selling all of those, since they influence that chart more than 200 other S&amp;P companies, and then that'll drag down companies that are at perfectly reasonable prices.",
        "created_utc": 1630534390,
        "id": "hb8r156",
        "permalink": "/r/StockMarket/comments/pg08a0/i_really_want_some_rational_discussion_on_this/hb8r156/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630563190.0
    },
    {
        "author": "Historical-Egg3243",
        "body": "prolly nothing. big tech doesn't really trade on news, unless it effects the whole tech sector.  YMMV. I remember ppl thought losing the jedi contract would hurt MSFT. super green the next day.",
        "created_utc": 1630545535,
        "id": "hb9e6ka",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb9e6ka/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630574335.0
    },
    {
        "author": "BagSelect",
        "body": "Rblx, Msft, FB",
        "created_utc": 1630518948,
        "id": "hb7qfxb",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7qfxb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630547748.0
    },
    {
        "author": "Jimminycrickets411",
        "body": "FAANG isn’t going too nuts, but their p/Es are starting to get too large compared to their historical averages. I’m hoping for a correction this year. Been waiting forever to get some Microsoft at a better price",
        "created_utc": 1630528171,
        "id": "hb8d358",
        "permalink": "/r/StockMarket/comments/pg08a0/i_really_want_some_rational_discussion_on_this/hb8d358/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630556971.0
    },
    {
        "author": "solidmussel",
        "body": "The S&amp;P, though it does have some insanely valued growth companies, is mostly full of value. \n\nLet's look at top S&amp;P companies:\n\nApple \n\nMsft\n\nGoogle\n\nAmzn\n\nFb\n\nBrkb\n\nTsla\n\nNvda\n\nVisa\n\nJp Morgan\n\nJnj\n\nUnited health\n\nWalmart \n\nBank of America \n\nMaster card \n\nHome depot\n\nPayPal\n\nDisney\n\nAdobe\n\nI can really only identify tsla as \"insane growth\" no real profits. Maybe PayPal and NVDA too have high P/E. \n\nAnd the rest are pretty reasonably valued.   So when I look at the S&amp;P at today's prices, and I remember which companies im actually invested in, I tend to worry much less about a crash.",
        "created_utc": 1630589207,
        "id": "hbbagg9",
        "permalink": "/r/StockMarket/comments/pg08a0/i_really_want_some_rational_discussion_on_this/hbbagg9/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630618007.0
    },
    {
        "author": "bartturner",
        "body": "AI with Microsoft versus Google is not close and in favor of Google.\n\nLowest layer is silicon and their TPUs have been setting records with both training and inference at scale.\n\n\"Google's TPU Pods are Breaking Records — And We Aren't Surprised\"\n\nhttps://blog.bitvore.com/googles-tpu-pods-are-breaking-benchmark-records\n\nNext layer up above the silicon is basically the AI operating system. The most popular today is TensorFlow which is from Google. \n\nThe second most popular is Pytorch from Facebook.\n\nTensorFlow now has over 150K stars on Github.\n\nhttps://github.com/tensorflow/tensorflow\n\nOne of the most popular projects on Github.\n\nThe next layer above the framework is the algorithms. The best way to measure success with algorithms is the papers accepted at the canonical AI organization, NeurlIPS. \n\nIn 2018, 2019, 2020 and sure will be the same in 2021 has seen Google having the most papers accepted by a large margin.\n\nhttps://imgur.com/ZWeeqUg\n\nNext layer is data. Which is probably where people most think of Google and Facebook. But Google has the more valuable data.\nFacebook data is what you want people to think of you. \n\nVersus Google has more truthful information. There is probably no more valuable data than search queries you make. It is this very unusual window into who you are. But with Google there is then all their other services.\n\nYouTube has the video data. Google Maps the location data. Google Photos is the biggest repository of photos. The list goes on and on.\nThe next layer up is the applications. Search is the biggest AI/ML driven application in the world. \n\nSearch penetrates 99% of the population of the US and then on top of that Google now has over 92% share.\n\nhttps://gs.statcounter.com/search-engine-market-share",
        "created_utc": 1630489599,
        "id": "hb62ii1",
        "permalink": "/r/stocks/comments/pfaza9/why_does_microsoft_have_a_higher_pe_ratio_that/hb62ii1/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630518399.0
    },
    {
        "author": "fltpath",
        "body": "&gt;Among stocks in the benchmark are four megacaps: Amazon (NASDAQ:AMZN), Apple (NASDAQ:AAPL), Microsoft (NASDAQ:MSFT) and ARK favorite Tesla (NASDAQ:TSLA), a stalwart in the flagship ARK Innovation ETF (NYSEARCA:ARKK).  \n&gt;  \n&gt;There are names familiar to ARK fund investors, like Coinbase (NASDAQ:COIN), Netflix (NASDAQ:NFLX) Roku (NASDAQ:ROKU) and Teladoc (NYSE:TDOC).  \n&gt;  \n&gt;Other stocks include Deere (NYSE:DE), Chipotle (NYSE:CMG), Best Buy (NYSE:BBY), Airbnb (NASDAQ:ABNB) and Target (NYSE:TGT).",
        "created_utc": 1630516996,
        "id": "hb7lng4",
        "permalink": "/r/wallstreetbets/comments/pfrncw/another_one_cathie_woods_ark_files_for_new/hb7lng4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630545796.0
    },
    {
        "author": "jessejerkoff",
        "body": "Microsoft makes pc money through o365. If you are used to it, you will keep using it. Companies will need to pay. Even Chinese ones.",
        "created_utc": 1630487856,
        "id": "hb60isq",
        "permalink": "/r/stocks/comments/pfaza9/why_does_microsoft_have_a_higher_pe_ratio_that/hb60isq/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630516656.0
    },
    {
        "author": "Fickle_Particular_83",
        "body": "MSFT Teams is eating Zoom's lunch",
        "created_utc": 1630500523,
        "id": "hb6j0om",
        "permalink": "/r/stocks/comments/pf8wyc/why_is_zoom_share_price_falling_so_much/hb6j0om/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630529323.0
    },
    {
        "author": "underling1978",
        "body": "In my 40's, and been in the market (self directed) for just shy of 3 months. 50k emergency fund (high, but some large expenses expected in the short term: replace windows in house, new to me (used) second vehicle and/or replacement for primary vehicle).\n\nGoal 1: Beat the 90-90-90 rule. Nailed it.\n\n**TFSA**\n\nGoal 2: Max TFSA before EOY (Transferred 45k in the last 3 months) 5k contribution room to go. Estimated savings over next 4 months around 12k, which covers the remaining room plus next years. \n\nStill have just under 35k in BMO Growth fund, but have been averaging decent returns (without adding to my position), so not quite ready to pull the trigger on transfer to self directed yet.\n\nHoldings:\n\n|Ticker|Current Weight (%)|Target Weight (%)|\n|:-|:-|:-|\n|AQN|4.37|2|\n|BMO|4.63|2|\n|ENB|4.36|2|\n|KL|2.72|1|\n|NOK|0.82|0.5|\n|NVDA|4.84|1.5|\n|RY|4.15|2|\n|SU|5.14|1|\n|T|6.25|2|\n|TD|4.22|1|\n|TEC|12.60|15|\n|VDY|4.30|10|\n|VRE|10.00|15|\n|XEI|5.12|10|\n|XEQT|11.69|35|\n|Cash|15||\n\n&amp;#x200B;\n\n**RRSP**\n\nTransferred 12.5k cash, converted to USD \\~10k\n\nTransferred 2 personal RRSP accounts, one complete and one still in process for around 15k\n\nHoldings: AAPL (13%), COST 8%), KO (6%), MSFT (13.5%), NVDA (15%)\n\n&amp;#x200B;\n\n|Ticker|Current Weight (%)|Target Weight (%)|\n|:-|:-|:-|\n|AAPL|12.9||\n|COST|7.74||\n|KO|5.70||\n|MSFT|13.50||\n|NVDA|15.10||\n|Cash|45||\n\nI haven't decided fully on holdings in my RRSP, so sitting on a little cash for now while I figure it out. Might go SPY/QQQ for a portion. Maybe some additional XEQT. Maybe some XIT. Maybe some other specific stocks if I find any I like. \n\n&amp;#x200B;\n\nLong term plan is to continue maxing out TFSA and add 20k/yr (minimum) to RRSP until maxed (still \\~140k contribution room left after this years contributions) \n\nAppreciate any thoughts or insights into my portfolio, strategy, etc. It's not very exciting, but it's mine, and I've really enjoyed getting into the market after putting it off for so many years.",
        "created_utc": 1630603088,
        "id": "hbc81ab",
        "permalink": "/r/CanadianInvestor/comments/pfqpm7/rate_my_portfolio_megathread_for_september_2021/hbc81ab/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1630631888.0
    },
    {
        "author": "Doom_Sword",
        "body": "I have 3.75% in MSFT, just bought a bunch recently, very happy with my purchase.",
        "created_utc": 1630595031,
        "id": "hbbny78",
        "permalink": "/r/CanadianInvestor/comments/pg1s1x/after_hours_discussion_thread_for_september_01/hbbny78/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1630623831.0
    },
    {
        "author": "DejesusMorrobel",
        "body": "Just a bid of heads up, your evaluation should undertake more than two or three years. You should go back at least 10 years. Additionally, you should attempt to identify their moat, if they have one. As a technology company, they have big players to compete with, Alphabet, Microsoft, Amazon. Good overall evaluation.",
        "created_utc": 1630600376,
        "id": "hbc15lt",
        "permalink": "/r/StockMarket/comments/pg0osz/pltr_financial_due_diligence_update_q221/hbc15lt/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630629176.0
    },
    {
        "author": "LegendOfXela14",
        "body": "Having some issues getting my orders filled, not only to close trades but also open them. Is there anything I can do, like maybe to the limit prices to make them more appealing? (Ex: currently have 1 QQQ at 0.60 per unit and 1 MSFT at 1.40 per unit expiring tmrw and can't get it filled)",
        "created_utc": 1630592318,
        "id": "hbbhjye",
        "permalink": "/r/options/comments/pegbi9/options_questions_safe_haven_thread_aug_30_sept/hbbhjye/",
        "score": 1,
        "subreddit": "options",
        "created": 1630621118.0
    },
    {
        "author": "hi-imBen",
        "body": "Prediction:  SWKS is about to pop off in the next few weeks like SITM did (I'm up over 100% on SITM)",
        "created_utc": 1630503842,
        "id": "hb6pxve",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb6pxve/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630532642.0
    }
]