[
    {
        "author": "drchaz",
        "body": "Looks like Fidelity.  401ks at Fidelity let you opt in to buying individual stocks: https://www.brokerage-review.com/ira-account/401k/fidelity-brokerage-link-review.aspx.",
        "created_utc": 1619821382,
        "id": "gwh7vnx",
        "score": 101,
        "subreddit": "wallstreetbets",
        "created": 1619850182.0
    },
    {
        "author": "Weyland-U",
        "body": "Dude turn off your boomer mail in fidelity. I've had them e-delivery for 5years. I don't need my neighbors reading my paper statements",
        "created_utc": 1619130597,
        "id": "gvi0618",
        "score": 77,
        "subreddit": "wallstreetbets",
        "created": 1619159397.0
    },
    {
        "author": "joshtothesink",
        "body": "Fidelity boomer mails me proxy statements for my other investments, but I think some do email (Robbinghood). Plus, I guess it depends if you changed defaults to e-delivery on any of the brokers. You should get it automatically though, and instructions will be in the packet for how to respond. Cheers 🍌",
        "created_utc": 1619130225,
        "id": "gvhzdfg",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1619159025.0
    },
    {
        "author": "MallStreetWolf",
        "body": "Now, we just need Fidelity to update their mobile UI. Looks like they haven't touched it since '03.",
        "created_utc": 1617922099,
        "id": "gtv7yaq",
        "score": 62,
        "subreddit": "StockMarket",
        "created": 1617950899.0
    },
    {
        "author": "TheCatScratch",
        "body": "Sooo I called Fidelity to make sure my shares weren't being borrowed (which I assumed they weren't, but just in case). Out of curiosity I asked if it showed when shares needed to be returned to be included in the shareholder meeting and he said, and I quote, \"it looks like there's a deadline of 4/15.\" Wtf I wasn't even expecting an answer. Does that mean shares are being recalled?!!",
        "created_utc": 1617912250,
        "id": "gtum31o",
        "score": 62,
        "subreddit": "wallstreetbets",
        "created": 1617941050.0
    },
    {
        "author": "No_Instruction5780",
        "body": "Probably why it has the 5 to 1 buy/sell ratio for retail on Fidelity. Yet the price mysteriously keeps going down and everyone on WSB just talks crap about GME.",
        "created_utc": 1618796396,
        "id": "gv18glv",
        "score": 61,
        "subreddit": "wallstreetbets",
        "created": 1618825196.0
    },
    {
        "author": "Tendies350",
        "body": "My Fidelity Face ID can’t recognize me from all the crying today 😭",
        "created_utc": 1618442179,
        "id": "gujmvzm",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1618470979.0
    },
    {
        "author": "BigJuicyThanos",
        "body": "Hey bro congrats, it’s a good thing to see everybody buying more but you should def transfer to another brokerage. Robinhood might not let you sell during the squeeze and you can get really fucked hard for it. I transferred to fidelity, they told me it would take like 9 days to transfer, but it was done by the time day 2 came around. Very happy with my choice.",
        "created_utc": 1618694390,
        "id": "guwhz47",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1618723190.0
    },
    {
        "author": "Boner4Stoners",
        "body": "Don’t use either lmfao they are both dumpster grade brokers. \n\nGo get a real broker. TDA, Fidelity, Schwab, etc",
        "created_utc": 1619619849,
        "id": "gw6b9d2",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1619648649.0
    },
    {
        "author": "vinny-himself",
        "body": "I requested a full transfer out of Robinhood on Tuesday Morning and it has been completed tonight \n\nAll transfered Shares should appear on Fidelity by tomorrow (took 2 days) \n\nSpoke with rep and service was great \n\nnow imma just wait till tendies come to roost! \n\nTheres a big possibility for sell limit to be raised \nabove the “share price + 50%” only if apes keep requesting Fidelity to increase sell limit \n\n#AMC100000🚀🚀🚀🚀",
        "created_utc": 1619070919,
        "id": "gveyo4c",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1619099719.0
    },
    {
        "author": "Jeffamazon",
        "body": "0 shares available to short on Fidelity",
        "created_utc": 1617644265,
        "id": "gth58v4",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1617673065.0
    },
    {
        "author": "Alpra_Creem",
        "body": "Dude paid $75 to transfer his 0.3 share of GME from RH to Fidelity.\n\nhttps://preview.redd.it/ksx28ddwsyu61.jpg?width=720&amp;format=pjpg&amp;auto=webp&amp;s=777cb012e69160bdd8d91f34172a3902e7d46baa",
        "created_utc": 1619211970,
        "id": "gvm0xq8",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1619240770.0
    },
    {
        "author": "amazingv2k",
        "body": "I have a friend in Puerto Rico. Around 5 years back, we made a pact. Both of us buy lottery tickets once a month. If either one wins the jackpot, we will share it with each other. For me, it’s all fun and games, but for her it will be life changing if we win even a 6 figure amount. \n\nSo yesterday, I made her open a WeBull account (bcz Fidelity has some restrictions for PR Residents) and transferred enough cash to buy a couple of GME. Told her this is her lottery with a guaranteed chance of hitting a jackpot. Crossing my fingers that we keep trading sideways until the cash clears in her account and she is able to buy GME before it starts to moon. \n\nTLDR: Ape got another friend ape a ticket on the rocket. Because friends ride together.",
        "created_utc": 1617291418,
        "id": "gt1hn0m",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1617320218.0
    },
    {
        "author": "meech7607",
        "body": "I switched to Fidelity back when RH shit the bed the first time, but I keep the app on my phone to follow the stocks.\n\nOne, it's very pretty, and two I hope I'm somehow costing them resources and money just by using them as a stock ticker but not keeping any of my portfolio with them.",
        "created_utc": 1618539930,
        "id": "guohfyp",
        "score": 39,
        "subreddit": "Wallstreetbetsnew",
        "created": 1618568730.0
    },
    {
        "author": "chinesebrainslug",
        "body": "you sign up on a new broker, like fidelity. you initiate a transfer. \n\n&amp;#x200B;\n\nROBBINGHOOD HAS TOTAL CONTROL OF YOUR SHARES, YOU SIGNED THE TOS AND THEY CAN SELL YOUR SHARES WHEN THEY FEEL LIKE IT.",
        "created_utc": 1619817494,
        "id": "gwgzs3s",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1619846294.0
    },
    {
        "author": "h3fabio",
        "body": "I didn't think quickly enough.  But tbh, I wouldn't have anyway.  I called Fidelity to let them know.",
        "created_utc": 1617314930,
        "id": "gt2wnmj",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1617343730.0
    },
    {
        "author": "aslickdog",
        "body": "Dropped wife off at work @ 6:30, looked at premarket, saw low $160s and plummeting fast, raced home, opened Fidelity account of her very own linked to mine and my checking account. Texted her GME was on sale, now's her chance, bargain of bargains incoming!!  Zelle me cash I'll golden ticket in her new account. Few hours later she responds: \"don't open accts in my name, wtf? how is 183 a bargain? Its busy today, did you fold the laundry?\"\n\nShe totally doesn't believe me. Was hoping this would improve my relationship with her boyfriend. No good deed goes unpunished.",
        "created_utc": 1617645718,
        "id": "gth8gtf",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1617674518.0
    },
    {
        "author": "the_fucking_doctor",
        "body": "Well then, in that case, here you go:  [https://imgur.com/a/9nZh1Uk](https://imgur.com/a/9nZh1Uk) (750 shares spread across Vanguard, TDA, and Fidelity).  It's not a multi-million dollar play, I'm not that wealthy, but including shares and options I'm currently in for around $150k.",
        "created_utc": 1618509253,
        "id": "gumosi8",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1618538053.0
    },
    {
        "author": "GettinJimmywithit",
        "body": "Well, I finally did it boys and girls, transferred all my GME over to a fidelity account from robinhood. I feel FREEEEEE!!!",
        "created_utc": 1617307926,
        "id": "gt2hz4h",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1617336726.0
    },
    {
        "author": "Pitiful-Awareness-19",
        "body": "Just found out you could buy fractional shares on Fidelity. Guess who now has $0.00 cash available in their account. This guy! 🚀🌕",
        "created_utc": 1617732182,
        "id": "gtlgcc0",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1617760982.0
    },
    {
        "author": "cobrataco",
        "body": "YOU CAN TRANSFER SHARES AND CASH TO FIDELITY DO IT NOW WHILE GME TRADING SIDEWAYS GET OUT OF ROBINHOOD YOU SMOOTHBRAINS ARE ACTUALLY HELPING THE HEDGIES TRADING ON ROBINHOOD PLAYING RIGHT INTO CRAMERS WRINKLY SMELLY POOP STAINED HANDS\n\nall caps so smooth brains can read",
        "created_utc": 1617724249,
        "id": "gtky1mh",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1617753049.0
    },
    {
        "author": "LemonTekSunrise",
        "body": "Transferred out of Robinhood a few months ago to Schwab. Got tired of the wife constantly asking about all the bank transfers into Schwab. Joint accounts are a bitch. \n\nNow I’ve got Schwab, Webull, Fidelity, and TD Ameritrade. Now she just keeps looking for transfers to Schwab and doesn’t see me loading up in the other brokerages. \n\nThis is the way.",
        "created_utc": 1618451457,
        "id": "guk4rj9",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1618480257.0
    },
    {
        "author": "cuboidofficial",
        "body": "Fidelity is dope but I hate that I need over $10k balance for level 3 options",
        "created_utc": 1619559295,
        "id": "gw3mc4i",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1619588095.0
    },
    {
        "author": "jpjapers",
        "body": "Fidelity is showing more than 2x as many buys as sells.\nhttps://eresearch.fidelity.com/eresearch/gotoBL/fidelityTopOrders.jhtml",
        "created_utc": 1617904470,
        "id": "gtu436o",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1617933270.0
    },
    {
        "author": "HowdoImakemoney1",
        "body": "Guys I finally did it, I made the transfer to fidelity  from Robingay",
        "created_utc": 1617917921,
        "id": "gtuz0jk",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1617946721.0
    },
    {
        "author": "Juker57",
        "body": "Btw Fidelity is already showing 0 shares available to short for GME, this is the earliest in the day I have seen it hit 0.",
        "created_utc": 1617637440,
        "id": "gtgq2rt",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1617666240.0
    },
    {
        "author": "Bildeweest",
        "body": "Not sure if this is good or not. And anyone can verify this cuz I’m too lazy to take and link a pic. But Fidelity has switched it stance on GME it’s now bullish (7.7 / 10)on the website.",
        "created_utc": 1617304993,
        "id": "gt2bmn4",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1617333793.0
    },
    {
        "author": "Levzzz",
        "body": "Fidelity buy/sell ratio of GME today 75% buy, everyday it's the same. I know it's only one broker but i bet you it's more than 50% buy on all brokers.",
        "created_utc": 1617898622,
        "id": "gttq5e3",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1617927422.0
    },
    {
        "author": "walter1021",
        "body": "I want an app with the UI of RH, the data of webull and the integrity of fidelity is that too much to ask",
        "created_utc": 1618882756,
        "id": "gv5jmi3",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1618911556.0
    },
    {
        "author": "the_fellow_autist",
        "body": "So I got a notification from Fidelity about some \"transaction I made\". I went to open my account and there was $-2Million in my account from 200 appl contracts I don't own nor exercised. As I am trying to figure out what I did, 30 sec later all of it disappeared.  There's some fuckery afoot.",
        "created_utc": 1619784775,
        "id": "gwf0gr3",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1619813575.0
    },
    {
        "author": "19Med7",
        "body": "Fidelity customers have 12,700 buy orders, 3,144 sell orders, and the price dips? What am I missing here....",
        "created_utc": 1617982136,
        "id": "gtxv3qq",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1618010936.0
    },
    {
        "author": "Suitable-Resist-1865",
        "body": "I woulda jumped on board at the top but wasn’t listed on Fidelity till EOD...then got in a $3.98. Thanks Fidelity 🙏🏻",
        "created_utc": 1619555252,
        "id": "gw3d6xl",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1619584052.0
    },
    {
        "author": "Losthuntsman",
        "body": "I've seen people reporting 26.7 Millions Float and 13 million float. Which is it? Also anyone have any ideas why Fidelity wasn't listed in the Proxy Mat?",
        "created_utc": 1619133387,
        "id": "gvi5zyx",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1619162187.0
    },
    {
        "author": "TX_Rage89",
        "body": "When I transferred to Fidelity I had to leave a fraction of a share and it was sold without my consent. So yes this is true. Btw I didn’t keep the money it just disappeared.",
        "created_utc": 1619651905,
        "id": "gw8dy9f",
        "score": 28,
        "subreddit": "Wallstreetbetsnew",
        "created": 1619680705.0
    },
    {
        "author": "thecarrotrehydrator",
        "body": "Alright Apes on **Fidelity**, listen up.\n\nI had a **margin** account, but I *always selected cash* whenever I bought my shares.\n\nToday, I called to get my account changed from margin to cash. They removed margin from my account, but to my surprise, **my shares were listed as margin even though I always bought them with my cash.**\n\nThey had to change those shares to cash shares instead of margin.\n\nTLDR: If you have margin on your Fidelity account, your shares *may be* **margin** shares instead of cash shares *even* if you bought them with cash. **Remove margin from your account just to be safe!**",
        "created_utc": 1617905679,
        "id": "gtu6wd2",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1617934479.0
    },
    {
        "author": "abbccc224",
        "body": "Saw I had $350 in Fidelity cash reserves, so I bought 2 more🤷🏻‍♂️",
        "created_utc": 1618507358,
        "id": "gumke3v",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1618536158.0
    },
    {
        "author": "lucad_kilerz",
        "body": "576 shares deep, starting my transfer from robbinghood to Fidelity today! Wish me luck apes!",
        "created_utc": 1617989265,
        "id": "gtybis3",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1618018065.0
    },
    {
        "author": "9000Kittens",
        "body": "Looks like he’s using fidelity and they offer a service called “brokerage link” which allows you to self manage your 401k. I have the same program at my job. That means he didn’t cash out early so he won’t owe taxes right now.",
        "created_utc": 1619818389,
        "id": "gwh1ns4",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1619847189.0
    },
    {
        "author": "Mirfster",
        "body": "In Fidelity, look under [Accounts &amp; Trade] - [Statements] - [Proxy Materials]\n\nDependent on your delivery preferences (E-mail or Mail) is how you would get notified.\n\nJust checked mine and don't see it yet, maybe will tomorrow though.",
        "created_utc": 1619143145,
        "id": "gvipg0u",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1619171945.0
    },
    {
        "author": "Keepitlitt",
        "body": "Extremely important for all apes investing using Fidelity:\n\n“GameStop Corp (GME) Proxy Voting\n\nWe understand that there have been a lot of questions about proxy voting for the upcoming GME annual shareholder meetings. Here’s some information that can help with your questions.\n\nThe record date for the shareholding meeting is on April 15, 2021. This means that you must be a shareholder on this date. Keep in mind that the **last** day to buy shares and be registered as an owner on that record date was April 13, 2021. \n\nWhile the record date is April 15, 2021 voting materials may not be displayed for several weeks. If you do not see the ability to vote right away and you are an owner of these shares, please do not worry. Once more information is provided by the issuer you will receive communication about the voting process. \n\nTo view our proxy page please follow these instructions:\n\n1. Navigate to Fidelity.com and Log In \n2. From the Portfolio Summary page, click ‘Statements’  \n3. Select ‘Proxy Materials’ in the white menu at the top of the page. The following page will show all current available securities you are able eligible to vote on.  \n4. There will be a ‘Vote’ link in the ‘Status’ column if you are able to participate.  \n5. The link will take you to an independent Fidelity-affiliate website. There, you’ll be able to vote, review meeting agendas, and see related documents/learning materials.”",
        "created_utc": 1618499358,
        "id": "gum1wic",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1618528158.0
    },
    {
        "author": "NKisAlive",
        "body": "Where tf y'all buying MNMD. \n\nCan't buy on Fidelity or RH or TDA",
        "created_utc": 1619468093,
        "id": "gvyy79r",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1619496893.0
    },
    {
        "author": "SlowNeighborhood",
        "body": "*Fidelity wonders why 1000 clients just used all their buying power on box spreads*",
        "created_utc": 1618877193,
        "id": "gv58sgf",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1618905993.0
    },
    {
        "author": "PaintyGuys",
        "body": "I use it to watch the market, but do all my trading on Fidelity.",
        "created_utc": 1617998138,
        "id": "gtyv7v8",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1618026938.0
    },
    {
        "author": "Dontquestionmyexista",
        "body": "75% buys yesterday on Fidelity, love to fucking see it",
        "created_utc": 1617896801,
        "id": "gttlv8k",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1617925601.0
    },
    {
        "author": "PubertEHumphrey",
        "body": "Just realized I have 10k+ in my fidelity account 😋 all for GME. Dips it: I buy; Stays the same: I buy; it raises: I BUY!",
        "created_utc": 1617723054,
        "id": "gtkvc0m",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1617751854.0
    },
    {
        "author": "Kumber_Yum",
        "body": "I haven’t even checked my fidelity account today and I don’t plan on it. Price doesn’t matter when your not selling. 💪🦍💎🙌🚀",
        "created_utc": 1618420735,
        "id": "guibwhr",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1618449535.0
    },
    {
        "author": "amazingv2k",
        "body": "My transfer from RH to Fidelity was completed in 2 days. Initiated on 3/29 after market hours and completed on 3/31. Now I just need to call Fidelity and make all my positions show up as cash instead of margin. \n\nIf you’ve been thinking about transferring, you should do it now before shit gets real. \nThis is not financial advice.",
        "created_utc": 1617288779,
        "id": "gt1bume",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1617317579.0
    },
    {
        "author": "dorothymantooth2",
        "body": "Just got all my shares officially transferred into Fidelity from Robinhood, didn’t even take two days!",
        "created_utc": 1618419223,
        "id": "gui8fcg",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1618448023.0
    },
    {
        "author": "mhem7",
        "body": "It's on fidelity if you really want to send this thing skyrocketing past 90 cents a share",
        "created_utc": 1619335455,
        "id": "gvsoqth",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1619364255.0
    },
    {
        "author": "BlackMoldComics",
        "body": "Doesn’t hurt to check- I just checked with Fidelity and they said I was good! Took less than ten minutes :)",
        "created_utc": 1617913658,
        "id": "gtupcj9",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1617942458.0
    },
    {
        "author": "INFIDEL_420YOLO",
        "body": "Transferring to Fidelity from RH! Finally initiated transfer of all holdings. Let’s go! Fuck you RH!",
        "created_utc": 1618497314,
        "id": "gulxca4",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1618526114.0
    },
    {
        "author": "carl0076",
        "body": "Lmao Robinhood got shooters out here when i asked this thread about transferring from webull to fidelity https://i.imgur.com/jGu6eLl.jpg",
        "created_utc": 1617730729,
        "id": "gtlcz2l",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1617759529.0
    },
    {
        "author": "opiumkanobi",
        "body": "Anyone else laugh when Fidelity warns you about extreme volitilty everytime you purchase GME?",
        "created_utc": 1617900053,
        "id": "gtttl4c",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1617928853.0
    },
    {
        "author": "BradsArmPitt",
        "body": "Fidelity is showing 4,135 shortable shares on their screener. It's usually in the hundreds of thousands.\n\n# HOLY MOLY!",
        "created_utc": 1617899036,
        "id": "gttr57s",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1617927836.0
    },
    {
        "author": "rednight39",
        "body": "Fidelity",
        "created_utc": 1618890263,
        "id": "gv5xdd5",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1618919063.0
    },
    {
        "author": "JamesB2395",
        "body": "Finally decided to transfer to fidelity don’t leave me behind",
        "created_utc": 1618592609,
        "id": "guqtdew",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1618621409.0
    },
    {
        "author": "dewdont",
        "body": "I like to call fidelity just to hear them say my shares are owned only by me..\n\nFuck a Robinhood",
        "created_utc": 1617896398,
        "id": "gttkwtr",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1617925198.0
    },
    {
        "author": "GeminiKoil",
        "body": "Thank you for spreading the word, the account transfer FOMO is palpable. I transferred my account from Robinhood to Fidelity about a month ago and I can confirm every single thing you said in case anybody is wondering.",
        "created_utc": 1619068513,
        "id": "gvevksp",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1619097313.0
    },
    {
        "author": "Electrical-Rate-891",
        "body": "I wish fidelity would allow me to set a higher sell limit  than just 50% of current trading value.",
        "created_utc": 1618520031,
        "id": "gundnn3",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1618548831.0
    },
    {
        "author": "salamanderc0mmander",
        "body": "so hear my out on this, im a little amped up on adrenaline but bare with me. I just got off the phone with a rep from etrade, not a normal CS person but someone in i think a more advisor role. They know i transferred half my gme to fidelity. These are his exact paraphrased words 'well gme has a short interest of 25% versus 170% back in jan, and gamestop just issued to sell shares at 168 dollars so i dont think there will be another squeeze again.' now i challenged the idea that short interest is self reported so theres no incentive to be honest about it, and gme didnt sell shares at 168. apparently their team has been discussing GME further. now why the fuck would this person who works for etrade tell me facts that we know are false, the shorts have not covered and GME hasnt sold any shares at 168, if it wasnt in E-trades favor to have people buy more shares",
        "created_utc": 1617988635,
        "id": "gtya2kt",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1618017435.0
    },
    {
        "author": "-iTsRiPPz-",
        "body": "I know this ape is a little late but I just initiated the transfer of all my moon tickets out of RH and into my fidelity acct :) can’t wait to short the fuck out of their IPO once I’m a gorillionaire💎🙌🏼🦍🚀🌕",
        "created_utc": 1618581565,
        "id": "guq3vq2",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1618610365.0
    },
    {
        "author": "Maniacal_Grin",
        "body": "No commission at Schwab and Fidelity 😁",
        "created_utc": 1619202720,
        "id": "gvlgjsg",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1619231520.0
    },
    {
        "author": "TelFyr",
        "body": "You can buy over-the-counter through platforms like Vanguard and Fidelity!",
        "created_utc": 1619205834,
        "id": "gvlnie6",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1619234634.0
    },
    {
        "author": "Moss81-",
        "body": "Can we pour some out for the poor bastard going over good faith violations at Fidelity right now",
        "created_utc": 1618418436,
        "id": "gui6lop",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1618447236.0
    },
    {
        "author": "New-Geologist1087",
        "body": "I’ve been trying to diversify more after buying so much GME... on fidelity so I got 5 more today @ $185 on TD 👍",
        "created_utc": 1617730788,
        "id": "gtld3yi",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1617759588.0
    },
    {
        "author": "meta-cognizant",
        "body": "Zero commissions/fees for shares on Fidelity.",
        "created_utc": 1619743260,
        "id": "gwd8j8w",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1619772060.0
    },
    {
        "author": "OtherAcctTrackedNSA",
        "body": "RH isn’t a real broker... it’s on Fidelity",
        "created_utc": 1618528237,
        "id": "gunuxg2",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1618557037.0
    },
    {
        "author": "JoeBoredom",
        "body": "That's never happened to me with Fidelity or Ameritrade. Might want to use a professional brokerage. Yeah, I pay fees, but my trades execute.",
        "created_utc": 1619562238,
        "id": "gw3sqfd",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1619591038.0
    },
    {
        "author": "apianti",
        "body": "I AM GONNA SPAM THIS SO MUCH TODAY...\n\nIf you have shares that are loaned out, recall them immediately. If you are unsure, contact your broker and make sure your shares are not loaned out. If they are make sure you can get them back and opt out of lending if you can. Otherwise you won't be able to vote at the annual meeting. Here's some information on what I know:\n\nRH or eToro - You're screwed. They lend your share out, you have no control. Maybe they are nice and get it back for you so you can proxy vote but I am betting not... Maybe try to contact them, good luck with that...\n\nFidelity - Fully Paid Lending, must have $250k in assets, sign an agreement, specifically lend out your shares, and get part of the daily fee. You would know how to recall.\n\nETrade - Fully Paid Lending, must apply, sign an agreement, specifically lend out your shares, and get part of the daily fee. You would know how to recall.\n\nIB - Stock Yield Enhancement Program, must apply, sign an agreement, specifically lend out your shares, and get part of the daily fee. You would know how to recall your shares.\n\nWebull - Stock Lending Income Plan, must opt in, they pick stocks to short, you must leave the program to get stocks back unless they are returned. You should probably contact them.\n\nSchwab - Securities Lending Program, must apply, shares become part of a fund or something? You should contact them if you are unsure. I think you may have to contact them to leave the program as well to get your shares back, IDK.\n\nTD - Looks like TD loans your shares out but IDK if you can opt out or if they will automatically recall your shares. It may be the same fund as Schwab, you should contact them to make sure your shares are not loaned out.\n\nIf you are unsure if your shares are loaned out, you should contact your broker.",
        "created_utc": 1617981800,
        "id": "gtxuc5w",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1618010600.0
    },
    {
        "author": "Cheeseman527",
        "body": "Fidelity shows about 75% of GME orders today was buy orders. Just in case you were feeling doubt. Today was all manipulated. View it as a gift and buy the dip.",
        "created_utc": 1617928256,
        "id": "gtvjzy1",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1617957056.0
    },
    {
        "author": "Cynical-Sam",
        "body": "Fidelity managed to transfer my shares from Robinhood in one day, too easy",
        "created_utc": 1618498130,
        "id": "gulz4y1",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1618526930.0
    },
    {
        "author": "ReverendDonkBonkbonk",
        "body": "I'm so glad I got off Robinhood. Placing market orders on RH always bought at a higher price than I last saw. Buying market through Fidelity bought at a lower price than I saw. Fuck Robinhood.",
        "created_utc": 1618501668,
        "id": "gum787t",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1618530468.0
    },
    {
        "author": "Mile_High_Man",
        "body": "I did it guys, just started the transfer from RH to Fidelity! Last night was the last straw for me when they wouldn't let me buy more lil' puppers.",
        "created_utc": 1618602402,
        "id": "gurfce0",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1618631202.0
    },
    {
        "author": "carolina_chronic",
        "body": "I have Fidelity,  is it up to me to reach out and get access to vote or will they notify me?",
        "created_utc": 1619140443,
        "id": "gvik2f5",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1619169243.0
    },
    {
        "author": "Davscozal",
        "body": "[Buying is far outweighing Selling on Fidelity](https://eresearch.fidelity.com/eresearch/landing.jhtml)",
        "created_utc": 1617896749,
        "id": "gttlqsy",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1617925549.0
    },
    {
        "author": "RyFisch",
        "body": "I’m stoned as fuck looking at my fidelity app eating a banana rn",
        "created_utc": 1618466849,
        "id": "guksuux",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1618495649.0
    },
    {
        "author": "Yewtfmcd",
        "body": "Fidelity wont even let me put an order in “because of the risks assosciated with this stock” Its fucking $2.30 of my damn money, Fidelity. Let me spend it how I want!",
        "created_utc": 1619317321,
        "id": "gvrz6d5",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1619346121.0
    },
    {
        "author": "QuaggaSwagger",
        "body": "Fidelity tells you every rule you might be about to break.",
        "created_utc": 1617812629,
        "id": "gtpceu8",
        "score": 21,
        "subreddit": "smallstreetbets",
        "created": 1617841429.0
    },
    {
        "author": "tostrife",
        "body": "Hey question bro. I wanna leave RH cuz they suck ass. How does one transfer from one to the other? I already opened a fidelity its all ready to go.",
        "created_utc": 1619550348,
        "id": "gw31iir",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1619579148.0
    },
    {
        "author": "nerds-and-birds",
        "body": "GME going nuts. The ticker on Fidelity Active Trader Pro looks like it is spazzing out and glitching.",
        "created_utc": 1619470443,
        "id": "gvz3jr2",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1619499243.0
    },
    {
        "author": "monkey6123455",
        "body": "Gme marked bullish on fidelity",
        "created_utc": 1617738896,
        "id": "gtlvq5v",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1617767696.0
    },
    {
        "author": "paddydeee",
        "body": "Just initiated a full transfer from RH to fidelity. Honestly go fuck yourself Robinhood.",
        "created_utc": 1618584132,
        "id": "guq9ml5",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1618612932.0
    },
    {
        "author": "viciousvixen187",
        "body": "Every day you keep this up, I get the chance to buy another share :)  Bought another, and my mom who has never owned stock IN HER LIFE, opened a fidelity account and bought her first GME share this morning!  Suck it hedgies.  She needs to be a Gorillionaire too.",
        "created_utc": 1617985596,
        "id": "gty319n",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1618014396.0
    },
    {
        "author": "Arthaleon",
        "body": "Started my transfer from RH to Fidelity today... 😬😬",
        "created_utc": 1618580244,
        "id": "guq13wa",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1618609044.0
    },
    {
        "author": "Under_the_gaydar",
        "body": "I just got off the phone with Fidelity who confirmed I had a cash account and they will never Loan your shares Unless you sign a rehypothecation agreement",
        "created_utc": 1617916399,
        "id": "gtuvmro",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1617945199.0
    },
    {
        "author": "SrsSteel",
        "body": "Robinhood is so much more simple and intuitive than fidelity is.",
        "created_utc": 1618543639,
        "id": "guoo35f",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1618572439.0
    },
    {
        "author": "blakeflacid",
        "body": "$75 charge that is applied to the value of your stock and is only paid when you sell or you can just cover the cost yourself. Unless your account is greater than $25k in value, then Fidelity covers the RH transfer fee and it costs nothing. But all of that is irrelevant if the stock is $10,000,000 a share.",
        "created_utc": 1619552567,
        "id": "gw36vl7",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1619581367.0
    },
    {
        "author": "TheCatScratch",
        "body": "Sooo my last post I mentioned that fidelity absolutely gave me a date for shares to be returned on 4/15. I just called back (in case the guy I was talking to was a banana-eating ape), and the woman I spoke with also said \"4/15\" when I asked if there was anything listed regarding a share return deadline for voting. Am I going crazy? Like, doesn't this mean shares are being recalled?! Please send help.",
        "created_utc": 1617917407,
        "id": "gtuxufa",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1617946207.0
    },
    {
        "author": "Saint_Chrispy1",
        "body": "Fidelity says bullish, yahoo says hold... Now my bullishness has at least doubled. Buying a couple more....",
        "created_utc": 1617720807,
        "id": "gtkqblu",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1617749607.0
    },
    {
        "author": "Own_Order792",
        "body": "You can download fidelity active trader. It shows stuff in Realtime, its a little cumbersome and not very user friendly but if the you play with the interface for a bit it starts to make sense.",
        "created_utc": 1619071045,
        "id": "gveytsa",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1619099845.0
    },
    {
        "author": "INFIDEL_420YOLO",
        "body": "All y’all need to relax. These smooth brained poop throwing mods ain’t know what’s up. GME still going strong. We got this. I’m literally transferring all my GME NOW to fidelity. If I wanted to paper hand like a bitch then... well, I cant. No access until next Thursday! Let’s FUCKING GO!",
        "created_utc": 1618596946,
        "id": "gur3alw",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1618625746.0
    },
    {
        "author": "jrd1097",
        "body": "Finally started my transfer request from Robinhood to fidelity",
        "created_utc": 1617894199,
        "id": "gttfspp",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1617922999.0
    },
    {
        "author": "SkillsFlo",
        "body": "You can buy now as MMEDF.  I have my shares through Fidelity",
        "created_utc": 1619206301,
        "id": "gvlojhh",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1619235101.0
    },
    {
        "author": "KiddCaribou",
        "body": "Closed at 191.45 on Fidelity....   Way go to, all my fellow retards!!   See y'all on Monday!!",
        "created_utc": 1617307609,
        "id": "gt2hb4l",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1617336409.0
    },
    {
        "author": "deerwolf90",
        "body": "Initiated my transfer from webull to fidelity today, all but 1 share, will be done on 4.21!",
        "created_utc": 1618425261,
        "id": "guim92u",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1618454061.0
    },
    {
        "author": "Jackielynn1234",
        "body": "I switched to fidelity- they didn’t cover the $75 that RobinHood charged for transferring. It’s fine though, small price to pay for the piece of mind that it bought!",
        "created_utc": 1617927382,
        "id": "gtviag5",
        "score": 17,
        "subreddit": "StockMarket",
        "created": 1617956182.0
    },
    {
        "author": "jrarriesgado",
        "body": "WE SELL WHEN I SAY WE SELL AND BISH I FORGOT MY FIDELITY PASSWORD",
        "created_utc": 1618413344,
        "id": "guhutun",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1618442144.0
    },
    {
        "author": "LovableContrarian",
        "body": "Not on android, apparently.\n\nUsed Fidelity for years, and they still have the world's shittiest app.",
        "created_utc": 1618545347,
        "id": "guoqwvg",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1618574147.0
    },
    {
        "author": "ChefBoyAreWeFucked",
        "body": "Lol, is Fidelity adorable enough to send them 50% of yours?",
        "created_utc": 1618880066,
        "id": "gv5efdf",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1618908866.0
    },
    {
        "author": "platinumsparkles",
        "body": "ok the level 2 data on Fidelity active trader pro isnt working for GME only.... and in Thinkorswim my charts are 10 mins behind on GME... what is GOING ON??",
        "created_utc": 1618522477,
        "id": "gunj3no",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1618551277.0
    },
    {
        "author": "jeanneLstarr",
        "body": "If we are talking about cloud, I like PANW, FISV or ANET better.",
        "created_utc": 1617453757,
        "id": "gt8no6u",
        "score": 1,
        "subreddit": "options",
        "created": 1617482557.0
    },
    {
        "author": "thelandonblock",
        "body": "ETF’s: VTI (2.29%), VXUS (2.43%) \nI want to get these each to 5% so they account for 10% of my portfolio. \n\nStocks: AAPL (5%), HON (4.74%), BRK.B (4.66%), JPM (4.53%), ZG (4.08%), NEE (3.67%), APPH (3.38%), NKE (3.33%), AWK (3.28%), DKNG (3.08%), WMT (2.96%), FISV (2.88%), PLUG (2.56%), ABBV (2.57%), NIO (2.58%), GM (2.63%), AMD (2.48%), BHVN (2.35%), O (2.4%), SONY (2.33%), VZ (2.25%), GE (2.21%), WFC (2.23%), C (2.12%), PLTR (2.03%), AZEK (1.97%), KBH (1.92%), KTOS (1.63%), CMCSA (1.56%), ORCL (1.56%), MOS (1.5%), ADM (1.52%), OPEN (1.28%), OZON (1.26%), TECK (1.26%), CGC (1.21%), AJRD (1.18%), NOK (1.08%)\n\nI know that I have a lot of stocks. Don’t respond with the typical “that’s too many just buy an ETF”. I’m basically trying to have my own ETF where I pick stocks and try to beat the indexes. It may not work, but that’s my plan. I also have two ETF’s I will add to to further diversify and minimize volatility. Please evaluate my diversification and quality of the stocks I’ve picked.",
        "created_utc": 1617376306,
        "id": "gt5bnuw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617405106.0
    },
    {
        "author": "greensymbiote",
        "body": "That's actually average for the sector. Shift4 reported only 4% y-o-y growth. Fisv projects 5%. The real growth with be inorganic through M&amp;A and organic through expansion of US iGaming.  They've deliberately left that out of their projections to be conservative. Foley is known for underpromising and overperforming.",
        "created_utc": 1617820156,
        "id": "gtpu0ap",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617848956.0
    },
    {
        "author": "sclongjohnson",
        "body": "They lobbied our congress out of automating our taxes years ago. Fuck Intuit and Fuck H&amp;R Block",
        "created_utc": 1617808088,
        "id": "gtp1y48",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617836888.0
    },
    {
        "author": "Im_Sorry_MissJackson",
        "body": "I’m sorry but are you saying Intuit, the software company that makes TurboTax, is responsible for our complicated tax code? They have nothing to do with tax laws. They provide a product that makes it very easy to file taxes for noobs and experienced people alike. Taxes have been complicated since our government has made it so complicated for the past multiple decades. It was complicated before TurboTax existed.",
        "created_utc": 1617804067,
        "id": "gtot7d5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617832867.0
    },
    {
        "author": "Thin-Course-4054",
        "body": "dude is a sales rep for intuit",
        "created_utc": 1617810992,
        "id": "gtp8l7k",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617839792.0
    },
    {
        "author": "ppp475",
        "body": "Intuit has (successfully) lobbied multiple times for increased complexity in the tax code. They didn't start it, but they definitely made it worse.",
        "created_utc": 1617811316,
        "id": "gtp9cgz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617840116.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  7th of April\n\n\n\n## Upcoming events for Wednesday, April  7th\n\n - Expected earnings:\n\n  EXFO, LNDC, LW, MSM, RELL, RGP, RPM, SCHN, SMPL\n\n - Ex-div:\n\n  BBF, BFY, BLE, BNY, BSD, BSE, BZM, CPB, DHF, ETH, IMKTA, KRG, MEN, ORCL, RVSB, SAR, TSE, WNC\n\n - Economic events and announcements:\n\n    - Chicago Fed President Evans Speaks\n    - Consumer Credit (consensus: 5.00B, previous: -1.31B)\n    - Crude Oil Imports (previous: -0.170M)\n    - Crude Oil Inventories (consensus: -1.436M, previous: -0.876M)\n    - Cushing Crude Oil Inventories (previous: 0.782M)\n    - Distillate Fuel Production (previous: 0.137M)\n    - EIA Refinery Crude Runs  (previous: 0.552M)\n    - EIA Weekly Distillates Stocks (consensus: 0.486M, previous: 2.542M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 1.1%, previous: 2.3%)\n    - Exports (previous: 191.90B)\n    - FOMC Meeting Minutes\n    - FOMC Member Barkin Speaks\n    - Gasoline Inventories (consensus: -0.221M, previous: -1.735M)\n    - Gasoline Production (previous: 0.762M)\n    - Heating Oil Stockpiles (previous: 0.024M)\n    - IMF Meetings\n    - Imports (previous: 260.20B)\n    - MBA 30-Year Mortgage Rate (previous: 3.33%)\n    - MBA Mortgage Applications (previous: -2.2%)\n    - MBA Purchase Index (previous: 297.3)\n    - Mortgage Market Index (previous: 730.8)\n    - Mortgage Refinance Index (previous: 3,242.1)\n    - Trade Balance (consensus: -70.50B, previous: -68.20B)\n    - Trade Balance (consensus: -70.50B, previous: -68.20B)\n\n## Upcoming events for Thursday, April  8th\n\n - Stock splits:\n\n    - AVNW @ **2:1** (Payable date: 04/07/2021)\n    - BMUSY @ **110:100** (Payable date: 04/15/2021)\n    - ONEQ @ **10:1** (Payable date: 04/07/2021)\n\n - Expected earnings:\n\n  AEHR, APOG, CAG, CCF, INDT, LEDS, LEVI, LEXX, NTIC, PSMT, SJR, STZ, STZ.B, WDFC\n\n - Ex-div:\n\n  AEO, AFB, BRC, CIO, CULP, DCF, DRI, GD, GIS, GNTX, INSI, IVR, KIO, LGI, LOAN, MA, MORN, MRVL, NAD, NTAP, NYV, SPG, T, TOL, UDR, WDR\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.015%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,650K, previous: 3,794K)\n    - Fed Chair Powell Speaks\n    - IMF Meetings\n    - Initial Jobless Claims (consensus: 680K, previous: 719K)\n    - Jobless Claims 4-Week Avg. (previous: 719.00K)\n    - Natural Gas Storage (previous: 14B)\n\n## Upcoming events for Friday, April  9th\n\n - Stock splits:\n\n    - CYGIY @ **4:1** (Payable date: 04/08/2021)\n    - SBKO @ **5:4** (Payable date: 04/08/2021)\n\n - Expected earnings:\n\n  BRID, CCL, CUK\n\n - Ex-div:\n\n  AFIN, EBF, ECC, EIC, ESLT, GNL, GROW, HIFS, HRL, INTU, LNC, MKC, MKC.V, OGE, TCFC, UVV, VGI, WSBF, ZTR\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 4.2K)\n    - CFTC Copper speculative net positions (previous: 43.9K)\n    - CFTC Corn speculative net positions (previous: 535.3K)\n    - CFTC Crude Oil speculative net positions (previous: 531.3K)\n    - CFTC Gold speculative net positions (previous: 167.5K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -17.9K)\n    - CFTC Natural Gas speculative net positions (previous: -37.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -50.3K)\n    - CFTC Silver speculative net positions (previous: 29.0K)\n    - CFTC Soybeans speculative net positions (previous: 211.7K)\n    - CFTC Wheat speculative net positions (previous: 3.1K)\n    - Core PPI (consensus: 0.2%, previous: 0.2%)\n    - Core PPI (consensus: 2.7%, previous: 2.5%)\n    - IMF Meetings\n    - PPI (consensus: 0.5%, previous: 0.5%)\n    - PPI (consensus: 3.8%, previous: 2.8%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 337)\n    - U.S. Baker Hughes Total Rig Count (previous: 430)\n    - WASDE Report\n    - Wholesale Inventories (previous: 0.5%)\n    - Wholesale Trade Sales (consensus: 1.4%, previous: 4.6%)\n\n## Upcoming events for Saturday, April 10th\n\n - Economic events and announcements:\n\n    - IMF Meetings\n\n^^^^2021-04-07",
        "created_utc": 1617789613,
        "id": "gto6elb",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1617818413.0
    },
    {
        "author": "slywhippersnapper",
        "body": "Today I bought Semi’s &amp; Devon Energy.  Tomorrow Intuit",
        "created_utc": 1617694066,
        "id": "gtjo0wu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617722866.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  6th of April\n\n\n\n## Upcoming events for Tuesday, April  6th\n\n - Stock splits:\n\n    - CIMVF @ **1:1.558**\n\n - Expected earnings:\n\n  GBX, LNN, NTIC, PAYX, PCYO, SGH\n\n - Ex-div:\n\n  BDN, CMCSA, DGX, FINV, MMC, MOV, NYT, PFBC, PGR\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 3.910M)\n    - EIA Short-Term Energy Outlook\n    - IBD/TIPP Economic Optimism (previous: 55.4)\n    - IMF Meetings\n    - JOLTs Job Openings (consensus: 6.995M, previous: 6.917M)\n    - Redbook (previous: -17.4%)\n    - Redbook (previous: 9.8%)\n\n## Upcoming events for Wednesday, April  7th\n\n - Expected earnings:\n\n  EXFO, LNDC, LW, MSM, RELL, RGP, RPM, SCHN, SMPL\n\n - Ex-div:\n\n  BBF, BFY, BLE, BNY, BSD, BSE, BZM, CPB, DHF, ETH, IMKTA, KRG, MEN, ORCL, RVSB, SAR, TSE, WNC\n\n - Economic events and announcements:\n\n    - Chicago Fed President Evans Speaks\n    - Consumer Credit (consensus: 5.00B, previous: -1.31B)\n    - Crude Oil Imports (previous: -0.170M)\n    - Crude Oil Inventories (consensus: -1.325M, previous: -0.876M)\n    - Cushing Crude Oil Inventories (previous: 0.782M)\n    - Distillate Fuel Production (previous: 0.137M)\n    - EIA Refinery Crude Runs  (previous: 0.552M)\n    - EIA Weekly Distillates Stocks (consensus: 0.550M, previous: 2.542M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.9%, previous: 2.3%)\n    - Exports (previous: 191.90B)\n    - FOMC Meeting Minutes\n    - FOMC Member Barkin Speaks\n    - Gasoline Inventories (consensus: 0.075M, previous: -1.735M)\n    - Gasoline Production (previous: 0.762M)\n    - Heating Oil Stockpiles (previous: 0.024M)\n    - IMF Meetings\n    - Imports (previous: 260.20B)\n    - MBA 30-Year Mortgage Rate (previous: 3.33%)\n    - MBA Mortgage Applications (previous: -2.2%)\n    - MBA Purchase Index (previous: 297.3)\n    - Mortgage Market Index (previous: 730.8)\n    - Mortgage Refinance Index (previous: 3,242.1)\n    - Trade Balance (consensus: -70.50B, previous: -68.20B)\n    - Trade Balance (previous: -68.20B)\n\n## Upcoming events for Thursday, April  8th\n\n - Stock splits:\n\n    - AVNW @ **2:1** (Payable date: 04/07/2021)\n    - BMUSY @ **110:100** (Payable date: 04/15/2021)\n    - ONEQ @ **10:1** (Payable date: 04/07/2021)\n\n - Expected earnings:\n\n  AEHR, APOG, CAG, CCF, INDT, LEDS, LEVI, LEXX, PSMT, SJR, STZ, STZ.B, WDFC\n\n - Ex-div:\n\n  AEO, AFB, BRC, CIO, CULP, DCF, DRI, GD, GIS, GNTX, INSI, IVR, KIO, LGI, LOAN, MA, MORN, MRVL, NAD, NTAP, NYV, SPG, T, TOL, UDR, WDR\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.015%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,650K, previous: 3,794K)\n    - Fed Chair Powell Speaks\n    - IMF Meetings\n    - Initial Jobless Claims (consensus: 680K, previous: 719K)\n    - Jobless Claims 4-Week Avg. (previous: 719.00K)\n    - Natural Gas Storage (previous: 14B)\n\n## Upcoming events for Friday, April  9th\n\n - Stock splits:\n\n    - CYGIY @ **4:1** (Payable date: 04/08/2021)\n    - SBKO @ **5:4** (Payable date: 04/08/2021)\n\n - Ex-div:\n\n  AFIN, EBF, ECC, EIC, ESLT, GNL, GROW, HIFS, HRL, INTU, LNC, MKC, MKC.V, OGE, TCFC, UVV, VGI, WSBF, ZTR\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 4.2K)\n    - CFTC Copper speculative net positions (previous: 43.9K)\n    - CFTC Corn speculative net positions (previous: 535.3K)\n    - CFTC Crude Oil speculative net positions (previous: 531.3K)\n    - CFTC Gold speculative net positions (previous: 167.5K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -17.9K)\n    - CFTC Natural Gas speculative net positions (previous: -37.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -50.3K)\n    - CFTC Silver speculative net positions (previous: 29.0K)\n    - CFTC Soybeans speculative net positions (previous: 211.7K)\n    - CFTC Wheat speculative net positions (previous: 3.1K)\n    - Core PPI (consensus: 0.2%, previous: 0.2%)\n    - Core PPI (consensus: 2.7%, previous: 2.5%)\n    - IMF Meetings\n    - PPI (consensus: 0.5%, previous: 0.5%)\n    - PPI (consensus: 3.8%, previous: 2.8%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 337)\n    - U.S. Baker Hughes Total Rig Count (previous: 430)\n    - WASDE Report\n    - Wholesale Inventories (previous: 0.5%)\n    - Wholesale Trade Sales (consensus: 1.4%, previous: 4.6%)\n\n^^^^2021-04-06",
        "created_utc": 1617703216,
        "id": "gtjx31c",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1617732016.0
    },
    {
        "author": "mrob2",
        "body": "A lot of countries that still use cash have automatic taxes already. The reason the IS doesn’t is because of intuit and HR Block’s lobbying to keep it that way.",
        "created_utc": 1617724815,
        "id": "gtkzc65",
        "score": 1,
        "subreddit": "investing",
        "created": 1617753615.0
    },
    {
        "author": "vmarda",
        "body": " [$SHOP](https://twitter.com/search?q=%24SHOP&amp;src=cashtag_click) [$INTU](https://twitter.com/search?q=%24INTU&amp;src=cashtag_click) [$SQ](https://twitter.com/search?q=%24SQ&amp;src=cashtag_click) [$WIX](https://twitter.com/search?q=%24WIX&amp;src=cashtag_click) [$ZEN](https://twitter.com/search?q=%24ZEN&amp;src=cashtag_click) [$HUBS](https://twitter.com/search?q=%24HUBS&amp;src=cashtag_click) [$YEXT](https://twitter.com/search?q=%24YEXT&amp;src=cashtag_click) [$PCTY](https://twitter.com/search?q=%24PCTY&amp;src=cashtag_click) [$EB](https://twitter.com/search?q=%24EB&amp;src=cashtag_click)",
        "created_utc": 1617711590,
        "id": "gtk7zfe",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617740390.0
    },
    {
        "author": "Im_Sorry_MissJackson",
        "body": "LOL I don’t care about intuit or TurboTax.. Just seems silly to me that people blame them for offering a product that makes filing taxes easier, it is a legit service that obviously a lot of ppl find valuable",
        "created_utc": 1617811742,
        "id": "gtpac3o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617840542.0
    }
]