[
    {
        "author": "coolcomfort123",
        "body": "AMAT, LRCX, SWKS and QRVO.",
        "created_utc": 1625697144,
        "id": "h4ep9ez",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625725944.0
    },
    {
        "author": "coolcomfort123",
        "body": "TSM, AMD, LRCX, AMAT, SWKS and QRVO are good long term semi stocks.",
        "created_utc": 1625512368,
        "id": "h45o6vx",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625541168.0
    },
    {
        "author": "the_dalailama134",
        "body": "QRVO?",
        "created_utc": 1626382520,
        "id": "h5bjfcy",
        "score": 2,
        "subreddit": "stocks",
        "created": 1626411320.0
    },
    {
        "author": "Fox_Technicals",
        "body": "Jose $QRVO is one of my favorite semiconductor plays right now, beautiful weekly chart",
        "created_utc": 1626270836,
        "id": "h55kbp7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626299636.0
    },
    {
        "author": "DannZecca",
        "body": "I’m still adding these are just some of my holdings \nAMZN -40%\nGOOGL - 20%\nNETFLIX - 10\nSHOPIFY - 10\nSQUARE - 10\nQRVO - 10",
        "created_utc": 1626668794,
        "id": "h5ptlic",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626697594.0
    },
    {
        "author": "CLNEGreen",
        "body": "AMD or QRVO - “what the world needs now - is chips - sweet chips - it’s the only thing that there’s just too little of”. To borrow a line from a Burt Bacharach song",
        "created_utc": 1625359974,
        "id": "h3z5m9z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625388774.0
    },
    {
        "author": "Torrocks",
        "body": "Qorvo -  They getting into cars, medical equips, and obviously 5g.   Anything RF related qorvo is in it.   Price target of 240 by some analysts recently.  They have contracts, with Asus, Apple, Samsung, and many other.",
        "created_utc": 1625743726,
        "id": "h4gnbmw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625772526.0
    },
    {
        "author": "felunk",
        "body": "...for Apple, go over the wireless results of companies that sell to them.  AVGO wireless division gets 100% of revenues from apple so i like to watch their quarterly results, QCOM/SWKS/QRVO are also good indicators...",
        "created_utc": 1627560005,
        "id": "h6y2t47",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627588805.0
    },
    {
        "author": "MVST_100_OR_BUST",
        "body": "Just to be open and because I care more about y'all more than myself or Vogel I do want to mention that there has been a change in the lockup. Not good or bad just changed.\n\nIt's been all over the place since last year between Vogel and Wu. But this is the final iteration it seems.\n\nThe last iteration was\nWu: 25% locked for 1 year unless above $15 for 20 days. 75% two year locked \n\nOther Microvast shareholders: 6 months\n\nVogel/Tuscan: \n50% is locked for 1 year, unless it trades above $12.50 for 20 days. The other 50% is locked for 2 years.\n\n\n\n**Now it is**\nWu: 25% locked for 1 year unless above $15 for 20 days. 75% two year locked. (Yes unchanged)\n\nOther Microvast shareholders: 6 months\n\nVogel/Tuscan:\n**READ THIS CAREFULLY**\n \nOf 75% of shares, 67% of the shares are locked for 1 year unless above $12.50 for 20 days. The other 33% is locked for 1 year regardless of price. \n\nOf the other 25% of shares, 50% is locked for 1 year unless it trades over $12 for 20 days. The other 50% is locked for 1 year unless it trades over 15. However he will lose his shares if none of these conditions are met.\n\nThese lockups are fairly similar (e.g 67% of 75% is 50%). I don't know if he's fucking with me or I'm just stupid). In summarize it's leaning more positive in my opinion that Vogel got himself a poor man's \"FDs\" and is either bullish or likes to gamble. Can slightly sell more now if it goes up, but will forfeit ownership to them for $0 if it doesn't.",
        "created_utc": 1625260642,
        "id": "h3upv5h",
        "score": 61,
        "subreddit": "SPACs",
        "created": 1625289442.0
    },
    {
        "author": "CharcoalWhite",
        "body": "Western Union is still a great way to launder money and scam people so I'd say still bullish for a few more years",
        "created_utc": 1626315442,
        "id": "h587qp7",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1626344242.0
    },
    {
        "author": "Vivid-Director-8971",
        "body": "How about an OTC stock that has $300M+ in revenues, \\~$80M of adjusted Trailing Twelve Month EBITDA, a real management team with Fortune 500 senior executive experience, just refinanced debt in Q1 2021 (and has 5 years on the debt before maturity) that grew EBITDA 78% last quarter.  It could go up 3-5x.  Crazy part is this is a deep value stock where the earnings more than justify the increase in the valuation... so, it's not on the come, but here today!\n\nCatalysts?  They've applied to go on the NASDAQ and meet minimum requirements - meaning mutual funds can buy the stock now (see page 32 of 10K dated 2/25/2021).  Management about to have their first earnings call in August 2021 after not having one since March 2020.  I think analysts are going to cover the stock.  When they report Q2 2021, they'll cycle through the horrible Q2 2020 numbers due to pandemic... meaning the trailing twelve month EBITDA will go up 33% (if my projections of Q2 2021 that is at minimum on par with Q1 2021 is true... changing my adjusted TTM EBITDA to actual TTM EBITDA) and that'll get picked up by the quant trading machines.  And management could start going on the road to market the stock after focusing on debt refinancing over the course of the last year or two after their first earnings call in August 2021.  \n\n***CPI Card Group.  Ticker: PMTS.***  \\~$200M market cap.  $300M+ revenues.  Adjusted EBITDA of \\~$80M (adjusted meaning stripping out impact of Q2 2020 when everyone had a crap quarter - Q3 20 $17M, Q4 20 $17.5M, Q1 21 $22M and if you assume trend is new normal, then Q2 21 is $20M or so).  Last quarter, revenues up 20%, EBITDA up 78%, Op Inc up 137%, adj net income up 337% (adjusted for one-time refinancing costs of debt).  Refinanced their debt 3/2021 and have 5 years on their net $300M of debt.  While debt looks like a lot, remember Debt/EBITDA is only 3.75x - which will continue to down as EBITDA continues growing.  \n\nSo, here's the deal.  They make plastic credit cards.  In 2015/2016, the industry moved to EMV (Europay, Mastercard, and Visa) chips - the little chips you see on the right side of all your credit cards.  Manufacturers ramped up capacity.  Industry pulled forward demand and bought a ton of cards.  EMV chips lasted longer than magnetic stripes and expiration of cards went from 3 years to 5 years - reducing demand for cards significantly.  Industry was destroyed due to reduction of demand while supply went up.  #1 and #2 players Thales/Gemalto and Idemia both converted a bunch of their capacity to make drivers licenses and other forms of ID and took capacity out of the credit card industry.  CPI was weakened because they had debt from a dividend recap.  In 2017, CPI interest expense was higher than their EBITDA.  Company is hurtling towards bankruptcy.  \n\nIn 2017, one of their board members who had retired as CFO of Western Union (and before that First Data - so CFO of two Fortune 500 companies and a real exec... not the crap execs you usually see in OTC companies) comes out of retirement and jumps in as CEO.  So what happens?  CPI is hurtling towards bankruptcy and probably would have gone under except for the pandemic.  Why?  \n\nPricing on EMV chip cards had gone to crap and there was little profitability.  Prior CEO had tried to tell people that contactless cards was going to save the company's hide, but reality was that NO ONE wanted to pay for contactless cards or the terminals.  Most of the merchants had credit card readers / terminals that could read contactless, but it cost $150-200 in software to turn on the functionality.  Only maybe 30-40% of the terminals in late 2019 had the software installed.  \n\nWhat changed?  The pandemic!  Now getting out of the store quickly and making consumers comfortable with going into stores is important.  Not only does going contactless mean that you don't have to stick the card in that little slot and have to stand next to the cashier, but contactless transactions also go faster.  That's why retailers now are paying for the terminals.\n\nFor the card issuers, contactless and the pandemic is a chance to get people to shift from cash to credit / debit cards.  Read the Visa and Mastercard Q2 transcripts and earnings releases.  They say that $18T of transactions can go to credit cards because of contactless.  And in the US, there's a coin shortage that forces everyone to use credit cards.  2% of $18T of what were once cash transactions will pay for a ton of contactless cards!  Contactless is king and is here to stay whether or not the pandemic remains.  Oh and the pandemic is still here.  \n\nWhen issuers buy contactless cards, the average selling prices and gross profit doubles.  The company's business model has a very fixed cost.  If you look at the sales, general &amp; administrative expenses, they were actually DOWN in Q1 2021 even though gross profit went up.  That's how you end up with a 78% increase in EBITDA while revenues only increase by 20%.  Does that mean the end of it?  Nope.  Here's the really fun part.\n\nCPI's business has a mix of large issuers (JPMorgan Chase, BofA, USBancorp, etc - may not be actual customers, but type of customers) and small issuers (fintechs, credit unions, small issuers, etc).  If you read the Q4 2020 earnings letter, you'll see a large percentage (I think 70%) of large issuers have moved to contactless.  Small issuers as of Q4 2020 had only moved maybe 10% over to contactless.  It took small issuers 3-4 years to move to EMV from magnetic stripe and if this trend repeats, then the earnings for the company will go up for 3-4 years at a rapid clip as small issuers adopt contactless.  The increase in the earnings haven't stopped yet and have a long tail!  If you read the Q4 2020 letter, you'll see that small issuers made up 66% of the company's revenues - meaning that the business is weighted towards the part of the business that is going to grow as small issuers adopt contactless.  \n\nSo, what's the valuation for all I'm writing about - the answer is CHEAP.  Market cap is $200M.  Net debt is about $300M (actually less, let's keep the math easy).  $500M enterprise value.  Adjusted EBITDA of \\~$80M.  EV/Adj EBITDA is about 6.25x.  This again is on a company whose EBITDA grew 78% last quarter.  Prior two quarters also had explosive EBITDA growth of north of 50%.  Basically EBITDA has exploded since the pandemic hit and adoption of contactless increased rapidly.  \n\nAssuming a not outrageous 10x EV/EBITDA, then you get an enterprise value of $800M.  Back out the debt of $300M, then the market cap is $500M.  that's about a 3x return on current earnings power.  This isn't a pie in the sky if XYZ happens, but using CURRENT economic earnings.  \n\nWhere the valuation gets more interesting is if the earnings continue growing due to increased  adoption of contactless that's HERE TO STAY.  If EBITDA goes to $100M and EV/EBITDA goes to 15x, then one can get to a $1.5B enterprise value.  Again, back out $200M of debt and market cap is now $1.2B.  With 11.6M shares outstanding, it's possible to get to $100 stock price.  \n\nDon't take my word for it.  It isn't on the come.  Go read the company's Q3 2020 - Q1 2021 earnings letters.  Go read the company's 10Q and 10K.  On page 32 of the 10K dated 2/25/2021, you'll see this beauty \" We are evaluating our ability to return to listing on Nasdaq and intend to ***apply for listing on The Nasdaq Global Market as we are able and eligible to do so***.\"  They have already applied to go on the NASDAQ.  Just a matter of time.  \n\nTo recap:\n\n1. Real business... manufacturing business that makes real revenues and real profits\n2. Former CFO of two fortune 500 companies that came out of retirement to turn around the business\n3. Fast growing business with long tail from continued adoption of contactless credit cards from their majority small issuer (66% of revenues per Q4 2020 earnings letter) customers.\n4. Exposure to the fast growing fintech market (customers include oxygen and other fintechs)\n5. Fixed cost business model with explosive earnings growth as revenues continue growing.\n6. Cheap valuation due to being on the OTC and being currently ignored by all the fund screens and quantitative traders\n7. Cheap valuation (again just adjusting out Q2 2020 pandemic quarter that hurt the business temporarily) of ***6.25x EV/EBITDA*** while revenues and EBITDA exploding.\n8. Catalysts of NASDAQ listing, first earnings call since March 2020, potential analyst coverage, mutual buying due to re-listing, quantitative trader buying from stock showing up on screens with re-listing and continued adoption of contactless\n\nHappy to answer any questions.  Cheap valuation with earnings TODAY that is overlooked by the market.  This is the definition of deep value.",
        "created_utc": 1626312512,
        "id": "h5822ad",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1626341312.0
    },
    {
        "author": "Tarw1n",
        "body": "This is literally the only way WU still stays in business",
        "created_utc": 1626316070,
        "id": "h588y8i",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1626344870.0
    },
    {
        "author": "f1_manu",
        "body": "I've used it. Very good fees, good platform and pretty darn quick. It's up there with Remitly for me.\n\nMy ranking is:\n\n1. Remitly/Wise\n2. Western Union\n3. Xoom\n\nHaving said that, their market is dependent on ease of use and low fees and they don't really have a loyal customer base. So realistically any company could take over in 3-5 yrs time.",
        "created_utc": 1625665787,
        "id": "h4cqcgl",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625694587.0
    },
    {
        "author": "Lofibeats1988",
        "body": "So what is the real reason for this shit? The Delta Kappa Theta Phi Omega variant of Wu Flu? Remember when we were told once we had vaccines it would be the land of milk and honey? Pepperidge Farms remembers.",
        "created_utc": 1626701197,
        "id": "h5r0c52",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1626729997.0
    },
    {
        "author": "TheDudeAbidesFarOut",
        "body": "Wu-Tang forever....muthafukah!",
        "created_utc": 1625594349,
        "id": "h49fzp2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625623149.0
    },
    {
        "author": "bullsteak3000",
        "body": "don't forget to take profits and diversify- message from Wu-Tang Financial",
        "created_utc": 1625752786,
        "id": "h4h2req",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625781586.0
    },
    {
        "author": "TFCNU",
        "body": "God damn it. You made me actually look at this stock and now I'm bullish. Look at the company as a proxy for international migration. Borders finally opening up? More migration. All those stories about employers not being able to fill jobs? More migration. Climate change? More migration. Even if your thesis is right, it won't hit WU pocketbook for years.",
        "created_utc": 1626329697,
        "id": "h58vf7k",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626358497.0
    },
    {
        "author": "1wutheringheights",
        "body": "Announced they are partnering with Justin Wu to create the latest microbuddies and to teach everyone about the potential of the game to earn crypto, how to open a wallet and more basic stuff so the game will have a wider audience.",
        "created_utc": 1626210470,
        "id": "h52y3vc",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1626239270.0
    },
    {
        "author": "Unemployable1593",
        "body": "Wu Tang is for the children.",
        "created_utc": 1626209594,
        "id": "h52w6x3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626238394.0
    },
    {
        "author": "ExoticDankOnly",
        "body": "I love wu tang clan. Grew up listening to them 🥵",
        "created_utc": 1626597444,
        "id": "h5lzawl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626626244.0
    },
    {
        "author": "Pikaea",
        "body": "Oh you were right my bad. I just remember a thread here going in detail about the PIPE not being locked. I guess that was before the recent filings. However, Wu, and Vogel aren't subject to the same lock ups though if prices are hit.",
        "created_utc": 1626114653,
        "id": "h4y6dif",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1626143453.0
    },
    {
        "author": "Doctor_Profits",
        "body": "After I graduated college in 1998, I moved to a city and got a job for a company that had a ESPP.  The plan was that on the last day of each quarter, I could buy FDC stock at a 15% discount based on the stock price on the 1st day of the quarter, or the last day of the quarter, whichever was lower.  Over several years I accumulated almost 1000 shares of FDC.  8 years after I started working there, they spun off WU stock (which I sold soon after) and a few months after that they were bought by a private equity company and taken private.",
        "created_utc": 1625510024,
        "id": "h45jj2w",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1625538824.0
    },
    {
        "author": "Fart4Sale",
        "body": "Wu-Tang",
        "created_utc": 1626463981,
        "id": "h5fmd4x",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1626492781.0
    },
    {
        "author": "llennacs",
        "body": "Step into The Wu, Wu-tang financial.",
        "created_utc": 1625410581,
        "id": "h411f6d",
        "score": 1,
        "subreddit": "investing",
        "created": 1625439381.0
    },
    {
        "author": "12stolmylicenseplate",
        "body": "https://youtu.be/aRICiN0t2LY It’s Wu mothafukas Wutang Mothafukas",
        "created_utc": 1625348715,
        "id": "h3ymjie",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625377515.0
    },
    {
        "author": "Accurate_Station7458",
        "body": "Why does western union have $5.6billion in revenue. Other added advantages is traffic through website, currency fees, and interest on interim cash.",
        "created_utc": 1625581044,
        "id": "h48mu62",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625609844.0
    },
    {
        "author": "Juicyjccccc",
        "body": "Calls on Coin, puts on WU. Can't go tits up",
        "created_utc": 1626090592,
        "id": "h4wsdq0",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1626119392.0
    },
    {
        "author": "PrincPaco",
        "body": "Gonna go over to Western Union to send Buffett a telegram and see if he has any Value Stocks I should YOLO into.",
        "created_utc": 1626699455,
        "id": "h5qx4ii",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1626728255.0
    },
    {
        "author": "x-w-j",
        "body": "&gt;Wise is much, much cheaper than Paypal and has way better conversion rates.\n\nI beg to differ. Moneygram and WU offers better rates for bank to bank and depends on the currency.  \nAt the end of the day, this is an another online service where win or loss is dependent on much value the customer gets.",
        "created_utc": 1625687964,
        "id": "h4e484j",
        "score": -1,
        "subreddit": "stocks",
        "created": 1625716764.0
    },
    {
        "author": "futz_",
        "body": "If you're bullish on cr7yt0currency payments practically no one has mentioned SHORTING Western Union and MoneyGram. Using cr7pt0s such as XLM, Algorand and others you can send payments globally to anyone for sometimes fractions of a cent at much faster speeds. I think this could be juicy...",
        "created_utc": 1626022344,
        "id": "h4todsl",
        "score": -2,
        "subreddit": "wallstreetbets",
        "created": 1626051144.0
    },
    {
        "author": "dogeytdog10",
        "body": "When you hear the pop! Thats the sound of your head coming out of your ass! Bitcoin is Magic fairy dust its and intangible inflationary gambling mechanism with no known creator nor ceo nor country nor foundation standing upon solid judgement and determination of sound mind. It is this seemingly inexorable judgement of mind, inexorable even unto the questionability of its own structure and belief system. Like flies on shit,  bitcoin was supposed to be a digital western union or moneygram. Well i hate to burst everyones crypto bubble (elon) but you all have essebtially taken part un a internet swap of money values as if you plan to take over the world when all you are doing is playing high card low card. And if that starts making sense then you might understand that its tech not currency you would maybe buy stock in western union? Im sorry but i know bullshit when i smell it!",
        "created_utc": 1625894229,
        "id": "h4o87ee",
        "score": -6,
        "subreddit": "StockMarket",
        "created": 1625923029.0
    },
    {
        "author": "MVST_100_OR_BUST",
        "body": "Just to be open and because I care more about y'all more than myself or Vogel I do want to mention that there has been a change in the lockup. Not good or bad just changed.\n\nIt's been all over the place since last year between Vogel and Wu. But this is the final iteration it seems.\n\nThe last iteration was\nWu: 25% locked for 1 year unless above $15 for 20 days. 75% two year locked \n\nOther Microvast shareholders: 6 months\n\nVogel/Tuscan: \n50% is locked for 1 year, unless it trades above $12.50 for 20 days. The other 50% is locked for 2 years.\n\n\n\n**Now it is**\nWu: 25% locked for 1 year unless above $15 for 20 days. 75% two year locked. (Yes unchanged)\n\nOther Microvast shareholders: 6 months\n\nVogel/Tuscan:\n**READ THIS CAREFULLY**\n \nOf 75% of shares, 67% of the shares are locked for 1 year unless above $12.50 for 20 days. The other 33% is locked for 1 year regardless of price. \n\nOf the other 25% of shares, 50% is locked for 1 year unless it trades over $12 for 20 days. The other 50% is locked for 1 year unless it trades over 15. However he will lose his shares if none of these conditions are met.\n\nThese lockups are fairly similar (e.g 67% of 75% is 50%). I don't know if he's fucking with me or I'm just stupid). In summarize it's leaning more positive in my opinion that Vogel got himself a poor man's \"FDs\" and is either bullish or likes to gamble. Can slightly sell more now if it goes up, but will forfeit ownership to them for $0 if it doesn't.",
        "created_utc": 1625260642,
        "id": "h3upv5h",
        "score": 61,
        "subreddit": "SPACs",
        "created": 1625289442.0
    },
    {
        "author": "f1_manu",
        "body": "I've used it. Very good fees, good platform and pretty darn quick. It's up there with Remitly for me.\n\nMy ranking is:\n\n1. Remitly/Wise\n2. Western Union\n3. Xoom\n\nHaving said that, their market is dependent on ease of use and low fees and they don't really have a loyal customer base. So realistically any company could take over in 3-5 yrs time.",
        "created_utc": 1625665787,
        "id": "h4cqcgl",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625694587.0
    },
    {
        "author": "TheDudeAbidesFarOut",
        "body": "Wu-Tang forever....muthafukah!",
        "created_utc": 1625594349,
        "id": "h49fzp2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625623149.0
    },
    {
        "author": "bullsteak3000",
        "body": "don't forget to take profits and diversify- message from Wu-Tang Financial",
        "created_utc": 1625752786,
        "id": "h4h2req",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625781586.0
    },
    {
        "author": "Doctor_Profits",
        "body": "After I graduated college in 1998, I moved to a city and got a job for a company that had a ESPP.  The plan was that on the last day of each quarter, I could buy FDC stock at a 15% discount based on the stock price on the 1st day of the quarter, or the last day of the quarter, whichever was lower.  Over several years I accumulated almost 1000 shares of FDC.  8 years after I started working there, they spun off WU stock (which I sold soon after) and a few months after that they were bought by a private equity company and taken private.",
        "created_utc": 1625510024,
        "id": "h45jj2w",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1625538824.0
    },
    {
        "author": "llennacs",
        "body": "Step into The Wu, Wu-tang financial.",
        "created_utc": 1625410581,
        "id": "h411f6d",
        "score": 1,
        "subreddit": "investing",
        "created": 1625439381.0
    },
    {
        "author": "12stolmylicenseplate",
        "body": "https://youtu.be/aRICiN0t2LY It’s Wu mothafukas Wutang Mothafukas",
        "created_utc": 1625348715,
        "id": "h3ymjie",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625377515.0
    },
    {
        "author": "Accurate_Station7458",
        "body": "Why does western union have $5.6billion in revenue. Other added advantages is traffic through website, currency fees, and interest on interim cash.",
        "created_utc": 1625581044,
        "id": "h48mu62",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625609844.0
    },
    {
        "author": "x-w-j",
        "body": "&gt;Wise is much, much cheaper than Paypal and has way better conversion rates.\n\nI beg to differ. Moneygram and WU offers better rates for bank to bank and depends on the currency.  \nAt the end of the day, this is an another online service where win or loss is dependent on much value the customer gets.",
        "created_utc": 1625687964,
        "id": "h4e484j",
        "score": -1,
        "subreddit": "stocks",
        "created": 1625716764.0
    }
]