[
    {
        "author": "rubbleone",
        "body": "Peter Lynch \"worked at Fidelity\" is putting it lightly hahaha",
        "created_utc": 1623108835,
        "id": "h0yxteb",
        "score": 1166,
        "subreddit": "stocks",
        "created": 1623137635.0
    },
    {
        "author": "Oni_Imports",
        "body": "Dividends are underrated here because the average reddit investor is investing with like 10k-200k, and those people are right, at those levels dividends aren't going to do you much good.  \n\n\nHowever, people with well established retirement investments and a good amount of worth to them, dividends can be really nice. $2mil in a 4% dividend will give you a solid 80k/year passive income that you can live off of while all your other worth goes into other things. You don't have to watch the market every day, you don't have to actively trade, just enjoy your life and collect your cash. Also many dividend stocks struggle to go up in value, but also don't tend to drop dramatically for no reason. Dividends are an end-game feature, and a pretty nice one, but the average redditor that has 40k in a fidelity account isn't going to see much use out of them.",
        "created_utc": 1624142697,
        "id": "h2dc70y",
        "score": 1129,
        "subreddit": "investing",
        "created": 1624171497.0
    },
    {
        "author": "the_shek",
        "body": "anything but.... fidelity, schwab, bob's trading platform idk just not robinhood",
        "created_utc": 1623107780,
        "id": "h0yvpoe",
        "score": 279,
        "subreddit": "wallstreetbets",
        "created": 1623136580.0
    },
    {
        "author": "mudtires03",
        "body": "Stop giving Robinhood your money, move to WeBull TD Ameritrade Fidelity or Etrade",
        "created_utc": 1623439142,
        "id": "h1fr06t",
        "score": 272,
        "subreddit": "wallstreetbets",
        "created": 1623467942.0
    },
    {
        "author": "Zealousideal-Rub-954",
        "body": "Bought 800 shares of BB and spread them out between my TD and Fidelity accounts.  I am meme’d to the max!  Not selling any of the 3 stocks (GME, AMC, BB) until I have enough for a penis enlargement!",
        "created_utc": 1623096517,
        "id": "h0y6u05",
        "score": 175,
        "subreddit": "wallstreetbets",
        "created": 1623125317.0
    },
    {
        "author": "SirPalat",
        "body": "Fidelity had this study that said that the best performing retail investors were those that are dead and the second best performing are those who forgot their password",
        "created_utc": 1625089842,
        "id": "h3m059h",
        "score": 166,
        "subreddit": "stocks",
        "created": 1625118642.0
    },
    {
        "author": "987warthug",
        "body": "I liked Schwab's web interface, but their website goes down too often.  I switched to Fidelity and TDA.",
        "created_utc": 1623578924,
        "id": "h1lvtqr",
        "score": 155,
        "subreddit": "stocks",
        "created": 1623607724.0
    },
    {
        "author": "thats-bait",
        "body": "That’s cause all the smart apes transferred to fidelity lol. Fucking Robinhood gtfoh",
        "created_utc": 1623129330,
        "id": "h0zzku4",
        "score": 127,
        "subreddit": "wallstreetbets",
        "created": 1623158130.0
    },
    {
        "author": "melt_in_your_mouth",
        "body": "I don't understand this. To buy calls on Fidelity you need level 2. I want to pay cash for call contracts and they won't let me, basically saying it's their fiduciary responsibility to protect me from myself. I don't want margin and it's my money, why the hell can't I pay cash for a freakin $300 contract? I can write options with unlimited downside and limited upside, but I can't buy contracts with limited downside and unlimited upside? Irritates the hell outta me as I would've made thousands last week buying $AMC calls. Guess I'll have to try elsewhere.",
        "created_utc": 1623450216,
        "id": "h1gewlc",
        "score": 120,
        "subreddit": "options",
        "created": 1623479016.0
    },
    {
        "author": "BetterThanBuffet",
        "body": "TD Ameritrade has it too. But I know Fidelity doesn't.",
        "created_utc": 1623606601,
        "id": "h1n68xe",
        "score": 118,
        "subreddit": "stocks",
        "created": 1623635401.0
    },
    {
        "author": "Fwellimort",
        "body": "Worth it to pay commission for better execution any day when dealing with options.\n\nYou do know 1 contract is 100 shares, right?\n\nThe 'free option' brokerages like Robinhood have garbage price execution quality. And when it comes to contracts, even 1 cent off share price is equivalent to 100 shares of that 1 cent off volatility hence far greater than fee itself. I rather pay fee than have a 'free' traded contract that executes prices at a couple cents worse on both buy and sell (that's a lot of money lost per contract).\n\nThat said, there are other better brokerages for options (e.g.: Schwab, Fidelity, etc. are only $0.65 and are solid brokerages).",
        "created_utc": 1624665572,
        "id": "h31yl24",
        "score": 116,
        "subreddit": "wallstreetbets",
        "created": 1624694372.0
    },
    {
        "author": "FeCard",
        "body": "Fidelity and Vanguard are the ones recommended becuase they were the only 2 that didn't halt trading of GME/AMC when this all started",
        "created_utc": 1623599921,
        "id": "h1msopl",
        "score": 113,
        "subreddit": "stocks",
        "created": 1623628721.0
    },
    {
        "author": "reality72",
        "body": "He actually started off with a summer job golf caddying for some fidelity executives.",
        "created_utc": 1623116167,
        "id": "h0zcq2n",
        "score": 103,
        "subreddit": "stocks",
        "created": 1623144967.0
    },
    {
        "author": "Lightning1997",
        "body": "Fidelity is in the works of a new UI that’s just as good and they are the most neutral of all brokers from the january squeeze",
        "created_utc": 1622655967,
        "id": "h0c7zt8",
        "score": 97,
        "subreddit": "wallstreetbets",
        "created": 1622684767.0
    },
    {
        "author": "toydan",
        "body": "Jeezus you have to call the broker to do CCs on $GME and $AMC??!!? Wait 3 hours I am sure too.\n\nSo glad I have Fidelity tbh.",
        "created_utc": 1622984985,
        "id": "h0shtmn",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1623013785.0
    },
    {
        "author": "Sarpatox",
        "body": "Fidelity, I used to use Robinhood but after them blocking trading I switched. I really like fidelity, but the UI sucks tbh. I still use Robinhood for finding stocks but then actually buy them on fidelity.",
        "created_utc": 1623906418,
        "id": "h220w6f",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1623935218.0
    },
    {
        "author": "scsibusfault",
        "body": "I love that any meme stonk purchase on fidelity gets you a nice popup warning/email reminding you to safely plan your exit position. Lol.",
        "created_utc": 1623267096,
        "id": "h16weif",
        "score": 85,
        "subreddit": "wallstreetbets",
        "created": 1623295896.0
    },
    {
        "author": "lylemcd",
        "body": "That is a super polite way for Fidelity to call you dumb as fuck and then say they're ok with you being dumb as fuck so long as you're ok being dumb as fuck.  \n\n\nI want one.",
        "created_utc": 1624496250,
        "id": "h2u0uu3",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1624525050.0
    },
    {
        "author": "iguessjustdont",
        "body": "TLDR: Meh\n\nPhilosophy: Passive value tilt, stratified flat-weighting contingent upon Fidelity International Value Factor Index (Covington Trust)\n\n\r  \nAdvisor: FMR Co., Inc. (FMRC) (the Adviser), an affiliate of Fidelity Management &amp; Research Company (FMR), is the fund's manager. Geode Capital Management, LLC (Geode) serves as a sub-adviser for the fund.\n\n\r  \nManagement:\n\n\r  \nNotes: Patrick Waddell has been removed form senior management. Manav Verma has taken over many of the factor funds run by Geode advising and Fidelity per disclosure 497 on 2019-04-25\n\n\r  \nDeane Gyllenhaal (senior portfolio manager) has managed the fund since January 2018.\n\n\r  \nLouis Bottari (senior portfolio manager) has managed the fund since January 2018.\r  \nPeter Matthew (portfolio manager) has managed the fund since January 2018.\r  \nRobert Regan (portfolio manager) has managed the fund since January 2018.\r  \nManav Verma (portfolio manager) has managed the fund since March 2018.\n\n\r  \nBF index MSCI ACWI Ex USA Value. Std. Index MSCI ACWA Ex USA\n\n\r  \nExposure Region\tExposure (%)\tRel Std. Index\r  \nAmericas\t9.80%\t100.00%\r  \nEurope\t58.00%\t134.00%\r  \nAsia\t32.30%\t69.00%\r  \nStd. Index:\tMSCI ACWI Ex. USA USD\r  \n\r  \nDescriptive Info\tValue to Std. Index\r  \nBeta\t1.11\r  \nAlpha\t-4.1\r  \nMKT/Nav Spread\t0.37%\r  \nADV\t $             204,000.00 \r  \nNet AUM\t$28.62MM\r  \nCreation Unit Size\t100,000\r  \nPercentile Rank   (Incept)\t49\r  \nER\t0.39%\r  \n\r  \nFund shows substantial USD exposure for USD-based portfolios. No effective hedging identified. \n\n\r  \nLending permitted. Per NPORT-P filed on 2021-03-16 securities lending was conducted using all-cash collateral\n\n\r  \nListed: NYSE ARCA\n\n\r  \nPortfolio weightings range from .38% to 2.2% per NPORT-P on 2021-03-16\r  \nNotes: Fund limits 80% of investments to those held by the “Fidelity Value Factor Index”. It does not require proportional weighting. This index is developed mid-cap and large-cap only, limiting the fund exposure to mid and large-cap funds for the majority of investment. The fund does not maintain a small-cap allocation.\n\n\r  \nGeode is permitted to utilize statistical sampling techniques to match investment characteristics of a variety of factors between the index and the fund. \n\n\r  \nFiling 485BPOS filed 2021-02-24 discusses the proprietary weighting strategy of “Fidelity Value Factor Index”. The section goes on to explain the index’s weighting and composite scoring methodology. Composite measures: High FCF yield, low enterprise value to EBITDA, low price to tangible book value, and low price to future earnings. Size-bias is removed, and the highest composite scores are utilized. The country-weights of the index are intended to match the developed international market. Each stock group category is market-cap weighted internally, plus a group weighting adjustment is applied, then each sector is equal-weighted against the international market portfolio. \n\n\r  \nRebalancing is semi-annual in February and August\n\n\r  \nOpinion: \n\n\r  \nThe management structure warrants additional investigation, as the senior manager covers many funds, and there has been a senior-management change. Next step would be to analyze the overlap of non-senior portfolio managers to ensure at least some competent member of management treats this as a primary fund. Due to the low management fee and small capitalization this is unlikely. Additionally research must be completed as to the compensation agreements between Geode and its managers, as well as Fidelity and Geode. \n\n\r  \nThe underlying indexing strategy is uninspired and vulnerable to value traps. The low adherence required to the underlying index poses ethical conflict to primary managers of the fund dependent upon compensation agreements. This is compounded by the ability of Geode to allocate per their statistical sampling techniques. \n\n\r  \nWhile their mandate permits small and mid-cap securities, a large majority of the fund is large-cap. Size tilt should be accounted for when determining any allocation. Additionally, they have deviated from the global allocation with a Euro-centric tilt against their mandate. \n\n\r  \nRebalancing periods align with that of the MSCI ACWI Ex US index, which is quarterly rebalanced. Semi-annual rebalancing will result in drift away from MSCI on the underlying fund index. \n\n\r  \nCurrency risk of this fund may require portfolio-level currency management upon purchase. \n\n\r  \nInvestability is low due to low ADV and wide spreads, among other market impact concerns. This fund may be a target for creation-unit arbitrage given the large liquid underlying securities and relatively high premium available for the underlying securities. It should be noted total fund value equals only \\~11 creation units.",
        "created_utc": 1622558573,
        "id": "h0751r0",
        "score": 77,
        "subreddit": "investing",
        "created": 1622587373.0
    },
    {
        "author": "KnottyBelayer",
        "body": "I’ve seen green a lot more often after switching to Fidelity!",
        "created_utc": 1625078516,
        "id": "h3lafg0",
        "score": 74,
        "subreddit": "investing",
        "created": 1625107316.0
    },
    {
        "author": "robbie2scraps",
        "body": "Fidelity at 74%. Ridiculous",
        "created_utc": 1624902745,
        "id": "h3cfe89",
        "score": 71,
        "subreddit": "wallstreetbets",
        "created": 1624931545.0
    },
    {
        "author": "ApartPersonality1520",
        "body": "I switched to fidelity and boy did that show me just how little I know. Too much numbers for ape",
        "created_utc": 1622656002,
        "id": "h0c82xr",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1622684802.0
    },
    {
        "author": "MaximumStoke",
        "body": "There are tax rules you need to keep in mind, but moving money from account to account is your business. I moved an entire house down payment from Fidelity to a checking account without issue. I was actually surprised how fast the whole transaction was.",
        "created_utc": 1622591743,
        "id": "h095jp3",
        "score": 68,
        "subreddit": "stocks",
        "created": 1622620543.0
    },
    {
        "author": "staz5",
        "body": "TDA or fidelity.",
        "created_utc": 1623560127,
        "id": "h1ladez",
        "score": 58,
        "subreddit": "stocks",
        "created": 1623588927.0
    },
    {
        "author": "notherday11",
        "body": "I think a lot of it just has to do with significantly different technologies and complexity. RH was a late entrant into the field and benefitted from having a modern infrastructure. They don’t have a lot of the bureaucratic overhead that the major institutions have grown over the years, and (correct me if I’m wrong) RH doesn’t have numerous different types of accounts (401k, IRAs, college savings accounts, etc) all having different infrastructures all synchronizing into a mobile app. I imagine if you looked at diagrams detailing the systems designs between RH and the big guys (Fidelity, Vanguard, Schwab, TD, etc) you’d see that they’re way more complex and also old.\n\nNot that it’s an excuse, just my best guess. RH is probably just smaller and able to really laser focus on UI while the others have way more components for their tech teams to work on.",
        "created_utc": 1623600427,
        "id": "h1mtp6a",
        "score": 57,
        "subreddit": "stocks",
        "created": 1623629227.0
    },
    {
        "author": "glenndanzign00b",
        "body": "I went through a very similar situation on Friday when Anne, my wife of 15 years, saw my Fidelity account. Long story short, she loaded up the Rav4, round up my two boys and took off on me. Tough times, but great vid! Thanks for sharing!",
        "created_utc": 1623091081,
        "id": "h0xtxkr",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1623119881.0
    },
    {
        "author": "WolfPackWSB",
        "body": "GME AMC BB MVIS SPCE DISH &amp; WOOF calls for weekskiezzzz!!! Fidelity asked if I need an advisor 😂😂🦍🦍🚀🚀 Nope just a Helmet",
        "created_utc": 1622592834,
        "id": "h097nsy",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1622621634.0
    },
    {
        "author": "DM725",
        "body": "The reverse split thing was annoying recently.  But the OTC thing is dependent.  For example, I made a Fidelity account specifically for avoiding those OTC fees.  That's when I realized that certain OTC stocks that aren't up to date on their paperwork aren't even purchasable on Fidelity when they are on ETrade.  \n\nThen I also found out that international OTC stocks like EEENF have a $50 fee on Fidelity but it was only $5 on ETrade.",
        "created_utc": 1623601308,
        "id": "h1mvg88",
        "score": 56,
        "subreddit": "stocks",
        "created": 1623630108.0
    },
    {
        "author": "Hajajy",
        "body": "Moved from E-Trade to fidelity and there's a couple things I miss but overall very happy I switched! (I hear android getting huge app update this summer on fidelity and can't wait)",
        "created_utc": 1623613274,
        "id": "h1njwtv",
        "score": 54,
        "subreddit": "stocks",
        "created": 1623642074.0
    },
    {
        "author": "sullw214",
        "body": "Fidelity is pretty legit too.",
        "created_utc": 1622673070,
        "id": "h0dc1hs",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1622701870.0
    },
    {
        "author": "-Paradox-11",
        "body": "Life got in the way for a loooong time before I could finally start investing and saving. \n\n31 yo, $15k brokerage (msft, dkng, nvda, dis, vti, eglx) and $6k in Roth IRA (fidelity go account but will change back to regular Roth IRA so I can manage), $10k cash, little to no debt (finally) besides student loans (~$20k still to payoff). \n\nAggressive growth strategy, and using dollar-cost averaging for the most part. Saving roughly 20-30% of monthly take home and trying to bolster my portfolio sooner rather than later. \n\nI started investing in May of this year. Late bloomer, but hoping to have a sizable amount saved and invested by retirement (goal is 55 to retire).",
        "created_utc": 1624743468,
        "id": "h35c92w",
        "score": 54,
        "subreddit": "stocks",
        "created": 1624772268.0
    },
    {
        "author": "Ekgladiator",
        "body": "Sheesh I hope so! The fidelity app is so cluttered compared to something like Robinhood. I've gotten used to it now but it needs some tender love and care hahaa",
        "created_utc": 1623614536,
        "id": "h1nmi56",
        "score": 53,
        "subreddit": "stocks",
        "created": 1623643336.0
    },
    {
        "author": "mcrome04",
        "body": "Fidelity offers partial shares.",
        "created_utc": 1623980907,
        "id": "h25uc8n",
        "score": 53,
        "subreddit": "stocks",
        "created": 1624009707.0
    },
    {
        "author": "Amat3urPro",
        "body": "Coke and AT&amp;T are terrible examples of solid blue chip companies to invest in. Coke's ceo is running them into the ground and AT&amp;T is a slowly dying dinosaur. I would look heavily at Apple, Pepsi, Microsoft, CAT, HPQ, FIS, GE, NET, or TSMC/SMH/Intel/AMD. No hate for your advice just don't want a new trader getting burned on either of those zombie companies.",
        "created_utc": 1623952381,
        "id": "h245qm8",
        "score": 51,
        "subreddit": "investing",
        "created": 1623981181.0
    },
    {
        "author": "PM_ME_DANK",
        "body": "If I'm not mistaken it takes awhile to transfer large sums of money back out of RH. Also they sell your order flow and don't always give you the best execution. Fidelity has been great for me. While I'm not a huge fan of the 60 cent commission on every option contract and their app could use an upgrade the rest of their service is amazing. Customer service is responsive, research notes are great, they provide analyst reports on most companies, free seminars that teach you more about investing/options, allow you to trade on foreign exchanges, etc. If I had to summarize - RH is for newbies and Fidelity or TDA are big boy brokers",
        "created_utc": 1623561402,
        "id": "h1lc3qe",
        "score": 47,
        "subreddit": "stocks",
        "created": 1623590202.0
    },
    {
        "author": "AustereSpoon",
        "body": "Fidelity for real stocks. Rh is still my meme options gambling platform tho because they let literally any moron trade options...",
        "created_utc": 1623108711,
        "id": "h0yxkqd",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1623137511.0
    },
    {
        "author": "BigAssMidgette",
        "body": "Schwab or Fidelity.  Get out of RobbingHood.",
        "created_utc": 1624635712,
        "id": "h308drd",
        "score": 41,
        "subreddit": "StockMarket",
        "created": 1624664512.0
    },
    {
        "author": "Prometh3us85",
        "body": "Yeah get out now!!! Get. Fidelity  atleast!!",
        "created_utc": 1624602658,
        "id": "h2yvzxv",
        "score": 41,
        "subreddit": "StockMarket",
        "created": 1624631458.0
    },
    {
        "author": "seriouslykthen",
        "body": "I use Fidelity to trade and still use robinhood just to monitor stocks",
        "created_utc": 1623621101,
        "id": "h1nztm0",
        "score": 40,
        "subreddit": "stocks",
        "created": 1623649901.0
    },
    {
        "author": "Environmental-Emu242",
        "body": "My 3 year old logs me into my fidelity account every morning. If she can navigate fidelity, you can.",
        "created_utc": 1623975517,
        "id": "h25kbgk",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1624004317.0
    },
    {
        "author": "RocketExecutiveGreen",
        "body": "Fidelity",
        "created_utc": 1622644465,
        "id": "h0bg0nh",
        "score": 38,
        "subreddit": "StockMarket",
        "created": 1622673265.0
    },
    {
        "author": "Shirakiii",
        "body": "on FIDELITY today;\n\nAMC 25,293 BUY orders , 18,778 SELL orders\n\nBB 2631 BUY orders, 2462 SELL orders \n\nGME 16,933 BUY orders, **3340** SELL orders",
        "created_utc": 1624316600,
        "id": "h2lb1p6",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1624345400.0
    },
    {
        "author": "danf78",
        "body": "So now I gotta go and run to the mailbox to get the letters before my wife??? This is bullshit. Dropping Fidelity.",
        "created_utc": 1624485649,
        "id": "h2tgkd4",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1624514449.0
    },
    {
        "author": "razzy57",
        "body": "Agreed I was lucky to inherit a fidelity account so never had to mess with Robinhood. With seeing much of the younger generations use Robinhood for investing just makes me thank my grandfathers choices even more.",
        "created_utc": 1623563113,
        "id": "h1leggs",
        "score": 37,
        "subreddit": "stocks",
        "created": 1623591913.0
    },
    {
        "author": "Deku_115",
        "body": "Fidelity",
        "created_utc": 1622575040,
        "id": "h086iqv",
        "score": 35,
        "subreddit": "StockMarket",
        "created": 1622603840.0
    },
    {
        "author": "sokpuppet1",
        "body": "Fidelity. Vanguard’s interface is only a step above using punch cards in a 1970s IBM terminal.",
        "created_utc": 1623468791,
        "id": "h1hav5x",
        "score": 32,
        "subreddit": "stocks",
        "created": 1623497591.0
    },
    {
        "author": "plynthy",
        "body": "Fidelity is WAY more than 401ks and mutual funds haha, what the hell are you talking about?\n\nFidelity beats the absolute shit out of RH in nearly every way.  The fills and prices on fidelity are better.  They have actual data and research, rather than the barebones bullshit on Robinhood.  Their customer services is way better than RH.\n\nI literally can't understand why you would suggest trading on Fidelity is worse.",
        "created_utc": 1623678317,
        "id": "h1qa9e4",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1623707117.0
    },
    {
        "author": "Jakereddits",
        "body": "Robinhood pulls shenanigans, and Fidelity :)",
        "created_utc": 1623219825,
        "id": "h14gitg",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1623248625.0
    },
    {
        "author": "TwistedPinkyToe",
        "body": "Fidelity seems to be the best.",
        "created_utc": 1623613317,
        "id": "h1njzuw",
        "score": 30,
        "subreddit": "stocks",
        "created": 1623642117.0
    },
    {
        "author": "Dan-dckn",
        "body": "Fidelity has it rated at 10 for a buy and has for over a month",
        "created_utc": 1623360493,
        "id": "h1bvs10",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1623389293.0
    },
    {
        "author": "bigturbine",
        "body": "That's the wrong question. Mutual funds and ETFs can be indexed or actively managed. You mention two managed funds and a zero fee indexed fund.\n\nI prefer index funds with low expense ratios whether they are ETFs or mutual funds. But I own some managed funds. ETFs trade like stocks. Mutual funds trade at the end of the day. Many funds have a dual presence like VTI (total market ETF) and VTSAX (mutual fund version of VTI). I own ETFs and mutual funds.\n\nNote that Fidelity's zero fee funds are proprietary and can't ever be moved to another brokerage. For an IRA this is probably not a big problem.\n\nSome purchase questions\n\n1. What kind of fund asset class or factors do I want? (Total Market, Total non US, bonds, REITs, dividend yield, value, etc.)\n\n2. and what form of the fund do I want (ETF or mutual fund)\n\n3. Which specific fund or fund provider am I interested in (Fidelity, Vanguard, American, etc). What are their expense fees? Can I buy these funds with my broker? Is there a fee to buy these with my broker?",
        "created_utc": 1624136240,
        "id": "h2d0fcb",
        "score": 30,
        "subreddit": "investing",
        "created": 1624165040.0
    },
    {
        "author": "Fickle_Particular_83",
        "body": "I like how my fidelity app says CLNE is very bearish. Apparently somebody didn’t get the memo today",
        "created_utc": 1624025348,
        "id": "h27mcvq",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1624054148.0
    },
    {
        "author": "Carv-EDM",
        "body": "Step 1: Transfer to GoodBroker™️ (I like fidelity)\n\nStep 2: Make a list on RH with only tickers you have positions on\n\nStep 3: Use RH for frantically checking movement to make serotonin go brrrrrrrrr\n\nStep 4: Only use GoodBroker™️ to trade\n\nStep 5: Actually capitalize on positions when Wall Street devs patch the red crayon bug affecting your positions",
        "created_utc": 1623196359,
        "id": "h13b8f6",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1623225159.0
    },
    {
        "author": "Keith_13",
        "body": "They are just pissed off that there are people even dumber than them.\n\nThere was a guy on the Fidelity subreddit who was asking how many accounts he could open, because he thought that all his money from AMC wouldn't fit in one account.   I'm 99% sure he was serious.\n\nThese guys make the GME guys look like Warren Buffet.",
        "created_utc": 1624925764,
        "id": "h3dtyy1",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1624954564.0
    },
    {
        "author": "gregariousnatch",
        "body": "Long on ATOS and ABML. Wish I'd gotten on on TRCH but having cash flow issues xferring from RH to Fidelity this week and busy with selling a house and moving also.",
        "created_utc": 1624205530,
        "id": "h2fviux",
        "score": 28,
        "subreddit": "pennystocks",
        "created": 1624234330.0
    },
    {
        "author": "Gzrht",
        "body": "Fidelity",
        "created_utc": 1624455888,
        "id": "h2rmjvl",
        "score": 28,
        "subreddit": "stocks",
        "created": 1624484688.0
    },
    {
        "author": "MMX_Unforgiven",
        "body": "I love this approach so much. Lol you can’t lose until you sell for a loss. Also I rather my money sit in fidelity rather than under my mattress.",
        "created_utc": 1623353683,
        "id": "h1bghcl",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1623382483.0
    },
    {
        "author": "account030",
        "body": "She’s just looking for a little more Fidelity in your relationship.",
        "created_utc": 1624150996,
        "id": "h2dqhjb",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1624179796.0
    },
    {
        "author": "TheIndulgery",
        "body": "I earn 6 figures, but all my investing money came from $5000 I deposited into RH a year ago and turned into about $55k. My rule is that I only withdraw money from RH and Fidelity, never deposit more. I'll either keep making money or leave the casino with empty pockets",
        "created_utc": 1622951323,
        "id": "h0rcwrw",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1622980123.0
    },
    {
        "author": "margin_call_rep",
        "body": "sir, this is fidelity calling regarding your margin debt",
        "created_utc": 1623802498,
        "id": "h1wtrtg",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1623831298.0
    },
    {
        "author": "tomd1000",
        "body": "Guys Im buying a blackberry phone, downloading Fidelity, and then buying more BB stock.",
        "created_utc": 1622704784,
        "id": "h0ew02f",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1622733584.0
    },
    {
        "author": "DownrightNeighborly",
        "body": "Fidelity won’t fuck you",
        "created_utc": 1623675975,
        "id": "h1q5yp0",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1623704775.0
    },
    {
        "author": "jdp111",
        "body": "The Yahoo finance app is a great alternative. You can sync your brokerage account with it to. Obviously you can't trade on it but I just do research and look at my portfolio on it and make trades on the fidelity app.",
        "created_utc": 1625097000,
        "id": "h3mep1y",
        "score": 27,
        "subreddit": "StockMarket",
        "created": 1625125800.0
    },
    {
        "author": "AcanthocephalaOk1042",
        "body": "Especially institutional investors.  They see up, without fundamentals supporting the price they cash out.  You think fidelity investments gives a damn about your short squeeze, gamma squeeze.  They want to make money and will run away with gains.",
        "created_utc": 1623966988,
        "id": "h253mg5",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1623995788.0
    },
    {
        "author": "Braaapp-717",
        "body": "USE. FIDELITY.",
        "created_utc": 1623909467,
        "id": "h2253xr",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1623938267.0
    },
    {
        "author": "Fizzeek",
        "body": "I 2nd Fidelity.",
        "created_utc": 1623560408,
        "id": "h1larb6",
        "score": 26,
        "subreddit": "stocks",
        "created": 1623589208.0
    },
    {
        "author": "believe_in_this",
        "body": "What's your strategy? I've got a good rate of return (90% according to fidelity) but I'm only currently working with a little over a grand. And it hasn't gotten there quickly lol!",
        "created_utc": 1623543169,
        "id": "h1kizcj",
        "score": 25,
        "subreddit": "pennystocks",
        "created": 1623571969.0
    },
    {
        "author": "firstorbit",
        "body": "Fidelity is the only one that had zero trading restrictions and doesn't lend out your shares behind your back because every transaction on Robin hood is actually on margin.",
        "created_utc": 1622753755,
        "id": "h0hik7z",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1622782555.0
    },
    {
        "author": "gbeezy007",
        "body": "I tried this didn't work with fidelity lol",
        "created_utc": 1622838293,
        "id": "h0lya0w",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1622867093.0
    },
    {
        "author": "Chief-Lucifer",
        "body": "I know most brokerages do this but fidelity having it for only 15 days is news to me. Are they the ones that have the least restrictive rules?",
        "created_utc": 1624584114,
        "id": "h2y1vuo",
        "score": 23,
        "subreddit": "RobinHood",
        "created": 1624612914.0
    },
    {
        "author": "Wingardienleviosah",
        "body": "Vanguard and Fidelity aren't like the prime brokers/banks. Different business models.",
        "created_utc": 1624127619,
        "id": "h2ck8zx",
        "score": 23,
        "subreddit": "stocks",
        "created": 1624156419.0
    },
    {
        "author": "TallAssFuker",
        "body": "Fidelity gang",
        "created_utc": 1622885290,
        "id": "h0o3g7o",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1622914090.0
    },
    {
        "author": "payoneer_scottgalit",
        "body": "Thanks for your question. There are a number of ways in which we are very different, and the differences are really significant. First and foremost, Payoneer was custom-built for business to business transactions, while Paypal focuses primarily on consumer to business payments.   This means our infrastructure and pricing are targeted at bigger transactions at lower price points while Paypal is essentially built around consumer credit card infrastructure and pricing, which is too high for B2B.  Secondly, one of our key areas of focus and strength lies in our global breadth, including our focus on emerging markets – no other company really has the reach that Payoneer does. While some companies avoid emerging markets or shy away from geographies seen as higher risk, Payoneer’s mission has always been to be a global partner for businesses from everywhere in the world, and here we really stand out in the industry.  We’re excited to have built a branded global platform that is similar to Paypal in some ways, but focuses on the very large and very different B2B segment of the market.    \r  \n\r  \nIt’s also important to keep in mind these aren’t “winner take all” markets that Payoneer and Paypal operate in.  Paypal largely competes in the market for consumer payments.  This market supports something like $1 trillion of market capitalization with companies like Visa, MC, Square, Adyen, Fiserv, FIS, Stripe and more.  It’s a huge market with lots of winners.  We see ourselves as part of a group of companies that are opening up B2B payments globally, which is estimated at something like $100 trillion of volume each year.  Much like consumer payments, there is room for many winners and lots of value to be created for investors in the years to come from the digitalization of B2B commerce and payments.   We think we’re really well-positioned as a pioneer in this market with some really unique assets and are excited about our future.",
        "created_utc": 1622653938,
        "id": "h0c2w1t",
        "score": 22,
        "subreddit": "SPACs",
        "created": 1622682738.0
    },
    {
        "author": "bigboytrading",
        "body": "Dat new fidelity layout .. too clean",
        "created_utc": 1623198031,
        "id": "h13ek5x",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1623226831.0
    },
    {
        "author": "Kooky-Citron-4537",
        "body": "only 800 in cash on fidelity, is BB worth it",
        "created_utc": 1623084226,
        "id": "h0xdkty",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1623113026.0
    },
    {
        "author": "TacticalAgave",
        "body": "Been using fidelity dark mode so long I couldn’t figure out what app that was",
        "created_utc": 1623864313,
        "id": "h1zocgr",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1623893113.0
    },
    {
        "author": "FolayMingYoung",
        "body": "So fidelity did not freeze during that gme and AMC fiasco?",
        "created_utc": 1623600826,
        "id": "h1muhdg",
        "score": 21,
        "subreddit": "stocks",
        "created": 1623629626.0
    },
    {
        "author": "MrPeppa",
        "body": "Do what I do. Daily monitoring using RH's app. Actual buy and sell in Fidelity.",
        "created_utc": 1623590688,
        "id": "h1mbjww",
        "score": 21,
        "subreddit": "stocks",
        "created": 1623619488.0
    },
    {
        "author": "lFreightTrain",
        "body": "I also did this for both AMC and GME. Transferred everything to Fidelity, then bought .49 shares of each on RH. I remember when they were forcefully selling user’s partial shares some sold for $2500+. \n\nIt will be pennies compared to what I will receive selling my GME position. If I can make a quick $2k and be included in the class action that shuts them down, best believe I’m doing it. \n\nFor anyone that doesn’t own more than a few shares of both stocks, it’s a not-so-risky gamble to look into. Really for everyone, but if you’re sitting on 50+ shares of GME it’s just a drop in the bucket.",
        "created_utc": 1622606217,
        "id": "h09x9v0",
        "score": 20,
        "subreddit": "Wallstreetbetsnew",
        "created": 1622635017.0
    },
    {
        "author": "shiggity80",
        "body": "If this is an honest question, then all you need to do is create an account with any broker (fidelity, etc), deposit some cash, and then make a trade to buy a contract.",
        "created_utc": 1623177209,
        "id": "h124zyv",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1623206009.0
    },
    {
        "author": "Yvgar",
        "body": "careful if you have retirement accounts. \nI have a 401k and a Roth IRA through Fidelity, I withdrew contributions from the Roth (which is not taxable) in order to buy a house but the import into Turbotax reported it to the IRS simply as a withdrawal from a \"retirement account\" - so I got a nastygram two years later from the IRS stating I owed 4k in back taxes.  It was resolved but took documentation and six months of anxiously waiting correspondence.",
        "created_utc": 1624121085,
        "id": "h2c79qd",
        "score": 20,
        "subreddit": "stocks",
        "created": 1624149885.0
    },
    {
        "author": "IntroductionFunny873",
        "body": "Lots of big time Pro’s own this puppy. Tepper, Niels, Blackstone, Fidelity. Not your common post SPAC holders. They see the 12-24 month surge.",
        "created_utc": 1624590065,
        "id": "h2ycxk8",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1624618865.0
    },
    {
        "author": "Spookythicccdoyle",
        "body": "Ameritrade or fidelity 100% id avoid robinhood like a burning house if I were you. After what they have pulled and showed they are far from on retails side and also probably don’t have that much liquidity you are better off with a large institutional broker!",
        "created_utc": 1624455901,
        "id": "h2rmkrz",
        "score": 20,
        "subreddit": "stocks",
        "created": 1624484701.0
    },
    {
        "author": "Deeper_values",
        "body": "Fidelity may use the shares against your bet.. lend them out to short. It’s a doozy",
        "created_utc": 1624772341,
        "id": "h36nlu0",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1624801141.0
    },
    {
        "author": "tomorrowthesun",
        "body": "This is exactly how it went for me. Started at RH, realized they have problems.  Went to fidelity and they wont let you trade defined risk spreads at the low levels (I assume due to Pin risk, dunno) then on to Tastyworks mid tier.  So wont let me take any undefined risk which I'm fine with for now.",
        "created_utc": 1623461959,
        "id": "h1gzgie",
        "score": 19,
        "subreddit": "options",
        "created": 1623490759.0
    },
    {
        "author": "DroidChargers",
        "body": "The only reason people don't like fidelity is because the UI. And to be fair, it's pretty garbage. But fidelity has already stated they're working on a better one because of all their new customers' (a majority of which are apes) recommendations. Should be relatively soon for iOS and Android in the coming months.",
        "created_utc": 1623681124,
        "id": "h1qfyqo",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1623709924.0
    },
    {
        "author": "HeyYoChill",
        "body": "You can buy Vanguard ETFs through Fidelity.\n\nIt boils down to which UI you prefer and which has better research tools for your style.",
        "created_utc": 1623467025,
        "id": "h1h83pn",
        "score": 19,
        "subreddit": "stocks",
        "created": 1623495825.0
    },
    {
        "author": "one8e4",
        "body": "Check with fidelity, if they want your business they should be able to help. They probably also got alot of experience dealing with RH transfers.",
        "created_utc": 1623082124,
        "id": "h0x8kvu",
        "score": 19,
        "subreddit": "stocks",
        "created": 1623110924.0
    },
    {
        "author": "bob9879099",
        "body": "If you want to actively trade then Fidelity is the way to go. They have Active Trader Pro for just that. Likewise, they have free daily live classes over Zoom to teach you how to trade and give you market insights.\n\nIf you want to buy and hold, Vanguard is the way to go, assuming you have $10,000+ in Vanguard ETFs to avoid the annual account service fee",
        "created_utc": 1623467054,
        "id": "h1h85hq",
        "score": 18,
        "subreddit": "stocks",
        "created": 1623495854.0
    },
    {
        "author": "xCaitlynMarie",
        "body": "I tried to sell off my CLOV but Fidelity called me a paper handed bitch and wouldn't let me 🤷🏼‍♀️ To the moon 🚀🚀🚀",
        "created_utc": 1623241250,
        "id": "h157igd",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1623270050.0
    },
    {
        "author": "Ratsonlean",
        "body": "Yea lmao it's because everyone left robinthehood after what they did in January.. Apes are on fidelity! GME about to explode!!",
        "created_utc": 1623129422,
        "id": "h0zzpbq",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1623158222.0
    },
    {
        "author": "d5ht",
        "body": "I don’t know why every one keeps saying AMC is positive beta. Fidelity has it at  negative 3.61?",
        "created_utc": 1624924230,
        "id": "h3dr0zh",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1624953030.0
    },
    {
        "author": "puzzlesrus",
        "body": "I'd just move my account to a different broker.\n\nVanguard, Fidelity, Schwab -- basically all legit brokers -- let you choose specific lots of shares to trade. Robinhood is fun and has a great UI but I wouldn't trust them with my main trading account.",
        "created_utc": 1623101132,
        "id": "h0yhhq0",
        "score": 18,
        "subreddit": "investing",
        "created": 1623129932.0
    },
    {
        "author": "ppp475",
        "body": "... Fidelity has levels to their options.",
        "created_utc": 1622663361,
        "id": "h0cpq1u",
        "score": 18,
        "subreddit": "options",
        "created": 1622692161.0
    },
    {
        "author": "PotStocksDude",
        "body": "Haven't found a stock I couldn't buy on Fidelity",
        "created_utc": 1624555569,
        "id": "h2wntoe",
        "score": 18,
        "subreddit": "weedstocks",
        "created": 1624584369.0
    },
    {
        "author": "Kenshina",
        "body": "I dropped Robinhood after that shit with GME. I’ve been using Fidelity now. I’m not big time investor but every little bit less Robinhood has the better.",
        "created_utc": 1622984217,
        "id": "h0sgl2b",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1623013017.0
    },
    {
        "author": "MakinDePoops",
        "body": "Fidelity",
        "created_utc": 1623704231,
        "id": "h1rv11g",
        "score": 17,
        "subreddit": "Wallstreetbetsnew",
        "created": 1623733031.0
    },
    {
        "author": "cfherrman",
        "body": "I was going to buy my first call here but couldn't because fidelity wouldn't give me level 2",
        "created_utc": 1623157001,
        "id": "h10ugau",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1623185801.0
    },
    {
        "author": "Shmeepsheep",
        "body": "1)Price improvements @ Fidelity\n2)Better Fills\n3)They have yet to halt trading on certain stocks when they become HTB or volatile\n4)They have a much longer track record of not fucking up\n\nEDIT \n5)The tax forms at the end of the year dont have mistakes lol",
        "created_utc": 1623581585,
        "id": "h1lyqle",
        "score": 17,
        "subreddit": "stocks",
        "created": 1623610385.0
    },
    {
        "author": "glenndanzign00b",
        "body": "Thanks brother! My Fidelity account and family are in shambles, but glad we can share a few laughs. I’ll catch you around the WSB subreddit 😎",
        "created_utc": 1622860894,
        "id": "h0n6u6d",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1622889694.0
    }
]