[
    {
        "author": "_imytif",
        "body": "The world is way more globalised than it was a decade or two ago. Why would you compare market cap of fe FAANG to just US GDP? Apple gets more than 60% of its revenues from outside of the US.",
        "created_utc": 1623703168,
        "id": "h1rsqrw",
        "permalink": "/r/stocks/comments/nzt8fx/buffet_indicator/h1rsqrw/",
        "score": 2415,
        "subreddit": "stocks",
        "created": 1623731968.0
    },
    {
        "author": "StubbornChipmunk",
        "body": "I hope Apple annihilates Facebook.",
        "created_utc": 1623211424,
        "id": "h14450g",
        "permalink": "/r/stocks/comments/nvktu5/apple_is_encroaching_on_facebooks_territory_like/h14450g/",
        "score": 1574,
        "subreddit": "stocks",
        "created": 1623240224.0
    },
    {
        "author": "autard8",
        "body": "This is the equivalent of buying an iPhone and then Apple requiring a subscription to use the phone. This sets a dangerous precedent if allowed in the U.S.",
        "created_utc": 1624392161,
        "id": "h2otphr",
        "permalink": "/r/stocks/comments/o5vt01/big_change_for_peloton_will_no_longer_allow_use/h2otphr/",
        "score": 780,
        "subreddit": "stocks",
        "created": 1624420961.0
    },
    {
        "author": "wecandobetter2021",
        "body": "I’m not an expert in this area, but I feel like an 11-minute trip to the *edge* of space is basically not a trip to space at all.\n\nIt’s like that one time I had a connecting flight through La Guardia airport.  Sure, I saw New York from the plane, but that’s as close as I’ve ever been to the Big Apple.  This $28 million trip is the space version of that.",
        "created_utc": 1623552108,
        "id": "h1kxlg3",
        "permalink": "/r/stocks/comments/nym9od/winning_bid_for_a_seat_on_jeff_bezos_blue_origin/h1kxlg3/",
        "score": 565,
        "subreddit": "stocks",
        "created": 1623580908.0
    },
    {
        "author": "thinvanilla",
        "body": "Jesus Christ, $16b. When is Apple ever going to make a purchase this big? The biggest Apple made was Beats for $3b, so funny to think their biggest purchase is a vanity headphone brand.",
        "created_utc": 1622859199,
        "id": "h0n3r8d",
        "permalink": "/r/stocks/comments/nsjp6c/microsoft_wins_us_antitrust_okay_for_16_billion/h0n3r8d/",
        "score": 474,
        "subreddit": "stocks",
        "created": 1622887999.0
    },
    {
        "author": "ljgillzl",
        "body": "I feel ya. To add-on, the DTCC and everyone under their umbrella pushed these rules through to protect themselves like crazy this week. The Russel 1000 is more expensive to short, and far riskier to do their little ETF trick when there’s some serious companies who won’t be happy about being shorted. Apple don’t play that shit lol, so we may be looking at an end to that avenue, which is MASSIVE.",
        "created_utc": 1624767320,
        "id": "h36gnqp",
        "permalink": "/r/wallstreetbets/comments/o8mubt/gme_building_up_for_another_squeeze/h36gnqp/",
        "score": 459,
        "subreddit": "wallstreetbets",
        "created": 1624796120.0
    },
    {
        "author": "Footsteps_10",
        "body": "Taiwan Semi guaranteed to be 6% of the ETF along with Apple",
        "created_utc": 1624925161,
        "id": "h3dstog",
        "permalink": "/r/stocks/comments/o9vkdf/cathie_woods_ark_invest_files_to_create_a_bitcoin/h3dstog/",
        "score": 354,
        "subreddit": "stocks",
        "created": 1624953961.0
    },
    {
        "author": "aspergillum",
        "body": "Buffett in 2019\n\n&gt; “I think stocks are ridiculously cheap if you believe ... that 3% on the 30-year bonds makes sense,” Buffett said in an interview \n\nA month ago, at Berkshire's Annual investor meeting when asked about Apple and high tech valuations.\n\n&gt;\"If present (interest) rates were destined to be appropriate, if the 10 year (yield) should really be at the price it is, those companies that the fellow mentioned in this question, they're a bargain. I mean, they have the ability to deliver cash at a rate that, if you discounted back and you're discounting at present interest rates, stocks are very, very cheap.\"\n\nHe's clearly not comfortable with what's happened to interest rates.  Rates have been heading down for 30 years though.",
        "created_utc": 1623703930,
        "id": "h1rudpb",
        "permalink": "/r/stocks/comments/nzt8fx/buffet_indicator/h1rudpb/",
        "score": 306,
        "subreddit": "stocks",
        "created": 1623732730.0
    },
    {
        "author": "totsnotbiased",
        "body": "Ireland doesn’t have to agree, it’s being done to them.\n\nRight now a iPhone sold in France is being report as profit deriving from Ireland.\n\nNow France is going to force Apple to pay French taxes, it’s as simple as that",
        "created_utc": 1622906621,
        "id": "h0p094b",
        "permalink": "/r/stocks/comments/nsu9pz/g7_nations_back_deal_to_tax_multinationals/h0p094b/",
        "score": 282,
        "subreddit": "stocks",
        "created": 1622935421.0
    },
    {
        "author": "erikumali",
        "body": "Apple is still making spectacular advancements such as the M1 chip. This will further carve out their territory in the mobile space (laptop, phones, tablets), to the detriment of intel.\n\nOther than that, they have not been able to carve out new markets, but simply increase their foothold in current markets.\n\nSo in a way, they are still innovating, but are not as innovative as the Jobs years.",
        "created_utc": 1624399134,
        "id": "h2p8lpz",
        "permalink": "/r/investing/comments/o5w9xy/msft_closes_at_2_trillion_as_second_us_company/h2p8lpz/",
        "score": 274,
        "subreddit": "investing",
        "created": 1624427934.0
    },
    {
        "author": "Trailrunner1970",
        "body": "I sold Apple to buy more AMC 🤣🤣",
        "created_utc": 1622650207,
        "id": "h0btbxg",
        "permalink": "/r/wallstreetbets/comments/nqndf2/we_cant_stop_they_cant_stop_us_although_they_try/h0btbxg/",
        "score": 269,
        "subreddit": "wallstreetbets",
        "created": 1622679007.0
    },
    {
        "author": "Advanced_Criticism",
        "body": "Would highly recommend your first purchases be in index funds. Vanguard has some great products and you if you want some control you can choose funds that focus on growth (VGIAX comes to mind) or a blend of the total S&amp;P.\n\nThey're critical for long term wealth building. Would caution against YOLOing too early. You'll get burned unless you put your money in tried and true blue chips like AT&amp;T, Coca Cola, Apple, etc.",
        "created_utc": 1623947492,
        "id": "h23u2rm",
        "permalink": "/r/investing/comments/o1zxq4/should_i_focus_more_on_growth_or_dividend_stocks/h23u2rm/",
        "score": 267,
        "subreddit": "investing",
        "created": 1623976292.0
    },
    {
        "author": "EtadanikM",
        "body": "They are weighed down heavily by their existing market value. A $2 trillion company requires a tremendous amount of capital in flow to significantly move their share price. The lack of movement drives traders and investors away from the stock - which makes sense, because if you were chasing growth, then you'd much rather invest in a company that can rise 1000%. For Apple to rise 1000%, it'd need to be worth the entire GDP of the US. Just a matter of not enough potential returns on investment.",
        "created_utc": 1623170638,
        "id": "h11p8hf",
        "permalink": "/r/stocks/comments/nv506l/the_curious_case_of_aapl/h11p8hf/",
        "score": 263,
        "subreddit": "stocks",
        "created": 1623199438.0
    },
    {
        "author": "MS_Bizness_Man",
        "body": "I’ve been investing and trading since 2007. The biggest thing I’ve learned is to buy or sell the hype/news and not wait for the actual event. Example, the news about a merger happening and not waiting for the actual merger. My best early trade was Sirius XM and I waited for the merger but the news of the approved merger was when I should’ve sold and I thought I had a great profit but it will be even better when they get operating. Wrong! But my research was correct about that trade in the first place. Learned and moved forward. Next. Resist the temptation to trade!! This is really hard. I could’ve bought Goog, Netflix, FB, Apple and held all of that time and made tons more than what I did as a trader. Maybe separate the two and open two accounts. The “I never sell account” and the “trader account.” Buy dividend stocks or change the game companies in the I never sell account and reinvest the dividends into more stock and wait for stock splits. I’ve tried to have them both in the same account but when you stare at it everyday and some news about something big comes, I cut myself off at the knees and didn’t see it thru because I wanted to reallocate those dollars. Next, Don’t be afraid to cut your losses and move on from a stock. Also, don’t be afraid to take small profits all along the way. A win is a win! Sometimes taking a loss can be a win because you move on and in hindsight you find you could’ve lost even more. Hope this is what you guys are looking for! Hope it helps!",
        "created_utc": 1624312943,
        "id": "h2l3y7p",
        "permalink": "/r/stocks/comments/o56dpz/if_you_could_go_back_to_being_a_22yr_old_college/h2l3y7p/",
        "score": 249,
        "subreddit": "stocks",
        "created": 1624341743.0
    },
    {
        "author": "randomplaya4",
        "body": "From $140 we'll supply the whole fucking world with BlackBerry phones! Reign of Apple has come to an end!",
        "created_utc": 1622732273,
        "id": "h0g35hd",
        "permalink": "/r/wallstreetbets/comments/nrdbzc/once_upon_a_time_i_was_a_bb_factory_worker_bb/h0g35hd/",
        "score": 222,
        "subreddit": "wallstreetbets",
        "created": 1622761073.0
    },
    {
        "author": "dfreinc",
        "body": "it's apple.\n\napple releases something, half the god damn world buys it. \n\ni don't like their products personally but i invest because other people sure do. matter of fact, *it's all they can physically bring themselves to use*. you don't bet against that kind of addiction. \n\nshort term, yea maybe but i don't think it's going back to 90. i've been holding and people have been telling me \"back to 80\" since before december. they were wrong and the target has apparently moved up even among them. very weak bear cases on apple. apple might as well be heroin to a large part of the populace.",
        "created_utc": 1622755226,
        "id": "h0hmenp",
        "permalink": "/r/investing/comments/nrnnv0/i_think_aapl_is_at_its_peak_and_starts_to_show/h0hmenp/",
        "score": 214,
        "subreddit": "investing",
        "created": 1622784026.0
    },
    {
        "author": "flyhighy",
        "body": "Microsoft keep finding acquisition targets. Some fail, some will bring future growth. \n\nApple has a hard time deciding what to do with almost $200bn of cash and $100bn FCF every year.",
        "created_utc": 1622862851,
        "id": "h0nab41",
        "permalink": "/r/stocks/comments/nsjp6c/microsoft_wins_us_antitrust_okay_for_16_billion/h0nab41/",
        "score": 209,
        "subreddit": "stocks",
        "created": 1622891651.0
    },
    {
        "author": "jebronnlamezz",
        "body": "Microsoft  apple Netflix",
        "created_utc": 1623376760,
        "id": "h1cs1ct",
        "permalink": "/r/wallstreetbets/comments/nwxthn/the_two_trades_that_sent_me_to_the_moon_and_have/h1cs1ct/",
        "score": 205,
        "subreddit": "wallstreetbets",
        "created": 1623405560.0
    },
    {
        "author": "OwlHowland",
        "body": "Nah, fuck that. Sell everything. AAPL, BABA, your house, the Lambo, your firstborn. The apocalypse starts now. Horde guzzoline.",
        "created_utc": 1624028021,
        "id": "h27s7gu",
        "permalink": "/r/stocks/comments/o2o96v/dont_regret_selling_your_stocks_early/h27s7gu/",
        "score": 204,
        "subreddit": "stocks",
        "created": 1624056821.0
    },
    {
        "author": "Fatty_Boombalattie",
        "body": "Being a contrarian is one thing, but this is silly. Their product pipeline is just going to get better. M1X MacBook Pro refresh with rumored more ports (this is huge), MagSafe, better screen, etc. Lots of people have been holding out for this upgrade. The M1 Mac mini has been selling super well. The new AirTags (not my thing) will be a hit and probably has huge margins. The iPhone has been pretty stagnant but if Apple introduces Touch ID again (probably in-screen or a button like iPad Pro) that will be big for a lot of people. AirPods alone bring in 12 billon a year (more than AMD and Nvida’s total 2020 revenue). Nothing bearish about Apple’s future.",
        "created_utc": 1622759080,
        "id": "h0huyu9",
        "permalink": "/r/investing/comments/nrnnv0/i_think_aapl_is_at_its_peak_and_starts_to_show/h0huyu9/",
        "score": 199,
        "subreddit": "investing",
        "created": 1622787880.0
    },
    {
        "author": "Stardust_Crusaders1",
        "body": "I'm an 18 year old with 50% of portfolio in an S&amp;P 500 ETF and the other 50% in riskier allocations such as PLTR, STEM and AAPL. Total amount is only £170 because I'm still a student with no job 😅",
        "created_utc": 1624727791,
        "id": "h34hiwe",
        "permalink": "/r/stocks/comments/o8dxux/whats_your_current_portfolio_strategy_total_and/h34hiwe/",
        "score": 195,
        "subreddit": "stocks",
        "created": 1624756591.0
    },
    {
        "author": "ninjacereal",
        "body": "Tim Apple is alive",
        "created_utc": 1624953992,
        "id": "h3f2576",
        "permalink": "/r/wallstreetbets/comments/o9yuou/big_time_retard_move_planned_way_ahead_amzn_put/h3f2576/",
        "score": 194,
        "subreddit": "wallstreetbets",
        "created": 1624982792.0
    },
    {
        "author": "cultured-barbarian",
        "body": "They might as well throw AAPL in there too. Talk about a red herring.",
        "created_utc": 1622871758,
        "id": "h0no13m",
        "permalink": "/r/stocks/comments/nskazq/wall_street_reins_in_hedge_funds_short_bets_on/h0no13m/",
        "score": 194,
        "subreddit": "stocks",
        "created": 1622900558.0
    },
    {
        "author": "Rockefeller07",
        "body": "Apple should just make an Apple Bike with their iPads slapped on it, syncing it to your apple watch and apple fitness. Will probably wipe out Peloton lol",
        "created_utc": 1624392430,
        "id": "h2oub95",
        "permalink": "/r/stocks/comments/o5vt01/big_change_for_peloton_will_no_longer_allow_use/h2oub95/",
        "score": 191,
        "subreddit": "stocks",
        "created": 1624421230.0
    },
    {
        "author": "HyruleJedi",
        "body": "making money? \n\nI worked at apple, and that 'its about the customer experience' and all that bullshit is just that, bullshit. Its about profit.  Don't let any company tell you its not. \n\nI was on a call with Ron Johnson who said it best. At the retail level, of course the employees should focus on the customer, and not worry about sales, but in the end, when was it EVER not about making money\n\nThe whole 'awesomeness' of working at these companies 'free food, dry cleaning, day care, unlimited time off, open work schedules, is all about keeping you on campus doing work, and making it easy for you to stay on campus by offering those amenities.  Ohhh and keep you from conversing with other people at the other tech companies. \n\nI have a friend that works at google, he loves it, I got a firm 'talking to' when they found out I met up with him for drinks and dinner.  I was also told what bars were 'google bars' and to avoid them",
        "created_utc": 1624027847,
        "id": "h27rtm9",
        "permalink": "/r/wallstreetbets/comments/o2omr8/wsb_gets_an_internship_at_goldman_sachs/h27rtm9/",
        "score": 191,
        "subreddit": "wallstreetbets",
        "created": 1624056647.0
    },
    {
        "author": "hom6872",
        "body": "This is slightly misleading, even though it’s an interesting bit of information.  These Hedge Funds own many more stocks that aren’t listed here, many of which that are riskier with lower upside.  They may dip into their top holdings a little bit, but they aren’t significantly reducing their position on Amazon or Apple so they can hold on to Palantir, for example.",
        "created_utc": 1622685950,
        "id": "h0e21ba",
        "permalink": "/r/stocks/comments/nr1dkn/beware_of_what_amc_shorts_are_holding/h0e21ba/",
        "score": 185,
        "subreddit": "stocks",
        "created": 1622714750.0
    },
    {
        "author": "puts-on-sunglasses",
        "body": "&gt;they have not been able to carve out new markets\n\nmaybe not as utterly disruptive, but AirPods and the Apple Watch are new markets for them all the same",
        "created_utc": 1624399296,
        "id": "h2p8xhm",
        "permalink": "/r/investing/comments/o5w9xy/msft_closes_at_2_trillion_as_second_us_company/h2p8xhm/",
        "score": 164,
        "subreddit": "investing",
        "created": 1624428096.0
    },
    {
        "author": "GoretexFluffycoat",
        "body": "Let's crush the evil apple overlords.",
        "created_utc": 1622733774,
        "id": "h0g6rz1",
        "permalink": "/r/wallstreetbets/comments/nrdbzc/once_upon_a_time_i_was_a_bb_factory_worker_bb/h0g6rz1/",
        "score": 159,
        "subreddit": "wallstreetbets",
        "created": 1622762574.0
    },
    {
        "author": "kortokrizzle",
        "body": "Fuck you AAPL\n\n*sent from my iPhone*",
        "created_utc": 1623279631,
        "id": "h17pz1c",
        "permalink": "/r/wallstreetbets/comments/nw4vdx/what_are_your_moves_tomorrow_june_10_2021/h17pz1c/",
        "score": 151,
        "subreddit": "wallstreetbets",
        "created": 1623308431.0
    },
    {
        "author": "laziestsloth1",
        "body": "This is my stance on Apple too. They are far from innovation IMO, they are perfect case for excellence, quality and marketing.\n\nExcellence is where their products are immensely simply. Users don't need customization of dashboards, they want simplicity (Android vs iOS). \n\nUsers prefer high quality over quantity. Instead of having 10 features, please do 3 things but always correctly. Google pixelbuds bluetooth connection is absolute trash, while airpods are always working as intended. \n\nFinally marketing. They have created a brand that has a crazy following. Younger people associate apple products with socio-economic status. You can tell this from memes about dating people who use android/appear green on messages.",
        "created_utc": 1622763629,
        "id": "h0i49sm",
        "permalink": "/r/investing/comments/nrnnv0/i_think_aapl_is_at_its_peak_and_starts_to_show/h0i49sm/",
        "score": 147,
        "subreddit": "investing",
        "created": 1622792429.0
    },
    {
        "author": "EfficientInflation67",
        "body": "&gt;The main issue I have with SPOT is it is the only company in the music streaming game that needs to make money off of music streaming. All the other companies (AAPL, AMZN, GOOG) don't have to make a penny from their music streaming services because all of these companies have way more profitable lines of businesses  \n\n\nThis is an excellent point. Spotify has to break even and profit from music alone while other services can offer streaming as a part of the bundle. I am not too stoked with their podcast strategy but they could turn that power around. \n\nI had a bull thesis for Spotify but it was based on the assumption that they will be able to control music discovery and knock down the rates being paid to the labels but they didn't work out and Tiktok has really become the platform where pop hits are made which undermines Spotify's position with the labels.",
        "created_utc": 1623041410,
        "id": "h0vka4j",
        "permalink": "/r/investing/comments/nu3wrs/should_spotify_be_given_a_spot_in_a_stock/h0vka4j/",
        "score": 147,
        "subreddit": "investing",
        "created": 1623070210.0
    },
    {
        "author": "Regenbooggeit",
        "body": "I feel like liquidating all of my Apple and just throwing it at GME. My safest bet is my worst ticker, and my most risky is giving me all the life I need.",
        "created_utc": 1623327960,
        "id": "h19slgb",
        "permalink": "/r/wallstreetbets/comments/nwjw4u/gme_q1_earnings_megathread_the_morning_after/h19slgb/",
        "score": 139,
        "subreddit": "wallstreetbets",
        "created": 1623356760.0
    },
    {
        "author": "SnooCrickets2458",
        "body": "No, but Microsoft, Apple, and Disney are.",
        "created_utc": 1622701623,
        "id": "h0es6fg",
        "permalink": "/r/stocks/comments/nr1dkn/beware_of_what_amc_shorts_are_holding/h0es6fg/",
        "score": 137,
        "subreddit": "stocks",
        "created": 1622730423.0
    },
    {
        "author": "PurpleFiat",
        "body": "Apple has atleast proven to be more private than Facebook.",
        "created_utc": 1623205296,
        "id": "h13ssgg",
        "permalink": "/r/stocks/comments/nvktu5/apple_is_encroaching_on_facebooks_territory_like/h13ssgg/",
        "score": 136,
        "subreddit": "stocks",
        "created": 1623234096.0
    },
    {
        "author": "bmore_conslutant",
        "body": "&gt; They're critical for long term wealth building. Would caution against YOLOing too early. You'll get burned unless you put your money in tried and true blue chips like AT&amp;T, Coca Cola, Apple, etc.\n\nhonestly don't yolo ever\n\nmy strategy is to try to keep my single company bets to 1-5% of my net worth and do combo of shares / calls\n\nthat said if a position grows over 5% i'm not gonna cut a winner loose, i just don't invest more",
        "created_utc": 1623950490,
        "id": "h2416ei",
        "permalink": "/r/investing/comments/o1zxq4/should_i_focus_more_on_growth_or_dividend_stocks/h2416ei/",
        "score": 133,
        "subreddit": "investing",
        "created": 1623979290.0
    },
    {
        "author": "dafazman",
        "body": "My child had a custodial trading account since he was born. He's now in the second grade. It is legal for kids to trade. My kid likes AAPL.",
        "created_utc": 1624250011,
        "id": "h2i6w81",
        "permalink": "/r/stocks/comments/o4n02o/why_dont_high_schools_have_classes_on_stock_market/h2i6w81/",
        "score": 132,
        "subreddit": "stocks",
        "created": 1624278811.0
    },
    {
        "author": "Karnes",
        "body": "I think in general privacy is a sliding scale... AAPL being on the better end of that spectrum than most.  \n\nPeople were 'blown away' that the Colonial Pipeline hackers had most of their BTC clawed back.  As if the government &amp; other entities didn't have their own 'hackers', check that... the best-of-breed hackers.  \n\nI'm not tinfoil-hatting here.  Just being practical in the fact that there's really no such thing as 'guaranteed privacy/security' anywhere on the net.  Just a spectrum of lowish -&gt; high risk.",
        "created_utc": 1623205844,
        "id": "h13tub1",
        "permalink": "/r/stocks/comments/nvktu5/apple_is_encroaching_on_facebooks_territory_like/h13tub1/",
        "score": 126,
        "subreddit": "stocks",
        "created": 1623234644.0
    },
    {
        "author": "citizen3301",
        "body": "The people who talk this way are the ones who said AAPL was a bad buy because it was overvalued.",
        "created_utc": 1624823323,
        "id": "h38ssvs",
        "permalink": "/r/investing/comments/o93fz5/people_who_say_value_investing_is_dead_are_idiots/h38ssvs/",
        "score": 125,
        "subreddit": "investing",
        "created": 1624852123.0
    },
    {
        "author": "DerekPaxton",
        "body": "It’s more complex than that. Apple France buys a phone from Apple Ireland for $100 and sells it for $105. That generates $100 revenue and $5 of taxable profit for Apple France.\n\nIt seems wrong when it’s phrased like that. But it’s not much different from Walmart France buying PS5’s from Sony Japan for $100 and selling them for $105. In which case the $5 of taxable profit seems reasonable.\n\nYou can say that multinational companies shouldn’t be able to sell to themselves. But Apple Ireland and Apple France are different companies (albeit with the same parent company). It’s just obvious because they have the same name. You can make a law changing tax’s for companies with the same parent company but the companies will just reform to be separate to match the new tax structure.\n\nSo they need a consensus of countries to make this less lucrative. And countries that don’t comply could be pressured into doing so (companies reporting expenses to non-complying countries face an additional tax liability).\n\nNote: my examples above are vast oversimplifications of the ip licensing and other methods used to show expenses to other countries and skirt tax laws.",
        "created_utc": 1622910788,
        "id": "h0p9c69",
        "permalink": "/r/stocks/comments/nsu9pz/g7_nations_back_deal_to_tax_multinationals/h0p9c69/",
        "score": 124,
        "subreddit": "stocks",
        "created": 1622939588.0
    },
    {
        "author": "Warlover1",
        "body": "Not bringing down your dd but there isn't a next Apple, there is just Apple.",
        "created_utc": 1624817043,
        "id": "h38g53t",
        "permalink": "/r/wallstreetbets/comments/o92524/why_nio_will_be_the_next_apple_and_the_leader_of/h38g53t/",
        "score": 119,
        "subreddit": "wallstreetbets",
        "created": 1624845843.0
    },
    {
        "author": "msnebjsnsbek5786",
        "body": "You're not thinking about it correctly.\n\nWhen I was buying AAPL a few years ago, their dividend yield was higher than it is now despite the fact that they've raised their dividend every year since I originally bought it. So my dividend yield is lower but my cost basis dividend yield is higher.\n\nIt's not that MSFT doesn't pay a lot of dividends, it's that their dividends/future dividends are so highly coveted that it makes the yield look low. \n\nHere's an example: Buffett bought KO between 1988-1994 for a total cost of $1.3B. Since then Buffett has made $8.5B in total dividends. They will pay out $672M in dividends to Berkshire this year on an investment of $1.3B. KO only has a 3% dividend yield, but that is irrelevant because the cash on cash return doesn't care about current unrealized gains. \n\nSo let's say you bought MSFT exactly ten years ago at $23.71, then your cost basis dividend yield would be 9.2%. \n\nMost importantly, you wouldn't have to sell shares to receive that payment. That's the problem with appreciation, you have to sell a productive asset (shares) in order to receive an unproductive asset (cash), and even worse, the cash value for your shares is net taxes. Dividends are also net taxes but you didn't have to sell an asset to get them.",
        "created_utc": 1623445533,
        "id": "h1g5bbc",
        "permalink": "/r/stocks/comments/nxp7y7/what_is_the_point_of_1_dividends/h1g5bbc/",
        "score": 117,
        "subreddit": "stocks",
        "created": 1623474333.0
    },
    {
        "author": "deadjawa",
        "body": "That and GDP doesn’t account for the entirety of Facebook, Google, Netflix, a lot of Apple, and a lot of Amazon (except for the US made goods that they sell).\n\nSoooo to make a true “buffet indicator” you’d need to subtract a huge portion of big tech which would change the valuation immensely.",
        "created_utc": 1623707124,
        "id": "h1s1hbp",
        "permalink": "/r/stocks/comments/nzt8fx/buffet_indicator/h1s1hbp/",
        "score": 117,
        "subreddit": "stocks",
        "created": 1623735924.0
    },
    {
        "author": "BetweenCoffeeNSleep",
        "body": "Past performance doesn’t *perfectly* predict future performance, but it can inform likelihood of future performance. \n\nExample: I can’t say with absolute certainty that Apple will outperform AT&amp;T this year, but it’s likely enough that we can be confident in discussing Apple as the better investment for the near term.",
        "created_utc": 1624960851,
        "id": "h3f972i",
        "permalink": "/r/stocks/comments/oa4sm2/when_investing_in_stocks_what_important_truth_do/h3f972i/",
        "score": 112,
        "subreddit": "stocks",
        "created": 1624989651.0
    },
    {
        "author": "Mike_Ropenis",
        "body": "I am not complaining about prices at all. I am complaining about how there are 7-10 new subreddits that were created AFTER they already took over r/wsb that do not stop spamming and cannot stop spilling over into other subs, and they are filled to the brim with people who have literally no fuckin idea what they are talking about posting nothing but emojis and memes. \n\nOn r/stocks a post about AAPL today had a comment about hedge funds as they relate to GME and that this was a sign of manipulation. AAPL is the largest company in the world and yet it's a hedge fund conspiracy if someone posts it on reddit? How is that kind of mentality productive? \n\nWhy are the 95% of us not involved in meme stocks bombarded by this nonsense constantly? \"I LIKE THE STOCK\" ok great, there are 5000 other stocks that the rest of us want to discuss, stop posting rocket emojis and hold your shares forever without shitposting about it like some hero.",
        "created_utc": 1623865092,
        "id": "h1zq5uc",
        "permalink": "/r/investing/comments/o1918w/lets_be_honest_and_recognize_the_presence_of_a/h1zq5uc/",
        "score": 110,
        "subreddit": "investing",
        "created": 1623893892.0
    },
    {
        "author": "AlternativeNo6154",
        "body": "I think a lot of big US corps in spy have exposure to markets around the globe. Apple, Google, Netflix, Mcdonalds etc. And they will continue having this exposure as globalization continues. I dont think it matters either way. \n\nPlus, you might run into competition problems that Something like McDonalds is going to destroy some local chains in the emerging markets. Idk man, its a tough call.",
        "created_utc": 1624220468,
        "id": "h2gpyd4",
        "permalink": "/r/investing/comments/o4d7xh/should_investors_outside_the_us_be_concerned/h2gpyd4/",
        "score": 110,
        "subreddit": "investing",
        "created": 1624249268.0
    },
    {
        "author": "msnebjsnsbek5786",
        "body": "So there is this silly thing people believe, it's something like “infinite economic growth is impossible.” I hear it a lot on Reddit \n\nThere is no reason to believe that economic growth has a cap on it. Humanity is far more efficient, productive and intelligent than it ever has been. \n\nJust think about farming alone. 300 years ago you're looking about 90% of the population were farmers, in 1900 it was about 40%, now it's about 1.3% of the American population and America is a net exporter of food. Someone working minimum wage can afford to feed themselves for a day with about 1-2 hours of work. That boost to human productivity is massive. So even though you might be mopping floors in Mcdonalds, you're still massively more productive than you would have been 100 years ago when putting food on the table took the majority of your working time. \n\nThis progress of productivity is felt everywhere. Including with companies and their margins. They can produce more for less and you can consume more for less. The more consumption and gdp the more room for total gross profit.\n\nThink about how insane it is that the internet age is only about 25 years old and the massive leap in productivity and utility that has added. Maybe the markets are still catching up to that leap forward. Now think about 1900, when cars weren't even mainstream. \n\nOf course the market has gone up for 100 years. And of course it's up as the widespread adoption of the computer has taken hold. \n\nThese companies aren't fake (at least most of them aren't). Aapl really did produce $100B operation cash flow last year. Amzn really did have $420B in revenue. They did that by offering goods/services where one party agreed that their money was worth less utility than the product/service they were selling. It's none-zero sum game",
        "created_utc": 1623130151,
        "id": "h100ozs",
        "permalink": "/r/stocks/comments/nuwl16/will_the_ride_ever_end_index_funds_housing_and/h100ozs/",
        "score": 106,
        "subreddit": "stocks",
        "created": 1623158951.0
    },
    {
        "author": "We-are-many-",
        "body": "Go get a student loan and leave those AAPL shares alone.",
        "created_utc": 1623607210,
        "id": "h1n7hyc",
        "permalink": "/r/stocks/comments/nz1yrz/stock_advice/h1n7hyc/",
        "score": 102,
        "subreddit": "stocks",
        "created": 1623636010.0
    },
    {
        "author": "atdharris",
        "body": "Apple and other big tech had a massive run in 2020 during the pandemic. You can't expect that to happen forever. Eventually it will break out of the trading range it has been stuck in. If you own shares, hold them.",
        "created_utc": 1623164512,
        "id": "h11att6",
        "permalink": "/r/stocks/comments/nv506l/the_curious_case_of_aapl/h11att6/",
        "score": 102,
        "subreddit": "stocks",
        "created": 1623193312.0
    },
    {
        "author": "DrBlackGuy99",
        "body": "I own zero apple products but own 12 shares. Facebook I also hate and own shares.",
        "created_utc": 1624851013,
        "id": "h3a7qmf",
        "permalink": "/r/stocks/comments/o97e4e/what_stocks_do_you_hate_but_they_make_money_anyway/h3a7qmf/",
        "score": 99,
        "subreddit": "stocks",
        "created": 1624879813.0
    },
    {
        "author": "J_D_18",
        "body": "NVDA when it splits and PLTR, yes it was a meme stock but its 33% of my portfolio and has good financials and targets are always exceeded. Continue to increase your AMD and AAPL and I think you’ll be happy in 10 years!",
        "created_utc": 1625003107,
        "id": "h3hm6nn",
        "permalink": "/r/stocks/comments/oai5jy/what_are_your_highest_conviction_plays_for_the/h3hm6nn/",
        "score": 92,
        "subreddit": "stocks",
        "created": 1625031907.0
    },
    {
        "author": "compuzr",
        "body": "All these hedge funds AAPL shares added together make up about 0.11% of the AAPL share float. \n\n&amp;#x200B;\n\nIn other words, I wouldn't get my hopes up.",
        "created_utc": 1622696376,
        "id": "h0ekvlo",
        "permalink": "/r/stocks/comments/nr1dkn/beware_of_what_amc_shorts_are_holding/h0ekvlo/",
        "score": 91,
        "subreddit": "stocks",
        "created": 1622725176.0
    },
    {
        "author": "BerKantInoza",
        "body": "Reminds me of a funny comment I read a while back of someone wanting to create a \"Becky\" ETF\n\nApple, Starbucks, Facebook, Lulu Lemon, and a couple others I forget. And all jokes aside it would actually be a solid ETF lol",
        "created_utc": 1625020513,
        "id": "h3ildcj",
        "permalink": "/r/stocks/comments/oai5jy/what_are_your_highest_conviction_plays_for_the/h3ildcj/",
        "score": 88,
        "subreddit": "stocks",
        "created": 1625049313.0
    },
    {
        "author": "cookingboy",
        "body": "&gt; They are far from innovation\n\nWhat? Only people who say that are non-technical people who thinks innovation only means \"come up with some cool prototype and sell it as a Kickstarter project\". \n\nApple is widely regarded as one of the *most* innovative companies here in Silicon Valley and the deeper you dig, the more absurdly ahead you realize they are.\n\nWhen they shipped their first SoC with a six-instruction wide architecture it blew almost everyone's mind, well at least everyone who works in the uA field. \n\n&gt;Users prefer high quality over quantity\n\nThat's the thing, from an engineering perspective, it requires *far* more innovation to do something in high quality than just check a checkbox. It's easy to build a 1000hp car in your garage and run it a couple times on a drag strip and brag about the result on social media, but designing one to make it mass producible, safe enough and reliable enough to slap a warranty on it would require 100 times the work.",
        "created_utc": 1622772744,
        "id": "h0imzo1",
        "permalink": "/r/investing/comments/nrnnv0/i_think_aapl_is_at_its_peak_and_starts_to_show/h0imzo1/",
        "score": 86,
        "subreddit": "investing",
        "created": 1622801544.0
    },
    {
        "author": "heresdajudge",
        "body": "ControlTheNarrative could tell you the cost of betting against AAPL. They’re the worlds most valuable company for a reason.",
        "created_utc": 1622757244,
        "id": "h0hqvvi",
        "permalink": "/r/investing/comments/nrnnv0/i_think_aapl_is_at_its_peak_and_starts_to_show/h0hqvvi/",
        "score": 86,
        "subreddit": "investing",
        "created": 1622786044.0
    },
    {
        "author": "oarabbus",
        "body": "I feel like 5 years ago when Apple was worth 500B you’d be saying “surely you don’t expect it to surpass 2 Trillion in 5 years”\n\nAnd I’d have agreed yet here we are...",
        "created_utc": 1625013399,
        "id": "h3i7a5x",
        "permalink": "/r/investing/comments/oad95q/what_would_you_do_with_your_money_if_you_think/h3i7a5x/",
        "score": 86,
        "subreddit": "investing",
        "created": 1625042199.0
    },
    {
        "author": "innnx",
        "body": "Imagine thinking msft and aapl are not high growth",
        "created_utc": 1624692565,
        "id": "h33303g",
        "permalink": "/r/stocks/comments/o81utw/favorite_stocks_for_the_next_5_years_that_arent/h33303g/",
        "score": 85,
        "subreddit": "stocks",
        "created": 1624721365.0
    },
    {
        "author": "JohnGalt1776",
        "body": "I would love $75 AAPL. One can hope..",
        "created_utc": 1622690198,
        "id": "h0ea9oe",
        "permalink": "/r/stocks/comments/nr1dkn/beware_of_what_amc_shorts_are_holding/h0ea9oe/",
        "score": 82,
        "subreddit": "stocks",
        "created": 1622718998.0
    },
    {
        "author": "nosehairshaver",
        "body": "Tesla is to Apple as BB is to Android. This is just getting started.",
        "created_utc": 1624278421,
        "id": "h2j337m",
        "permalink": "/r/wallstreetbets/comments/o4tpwj/blackberry_qnx_software_is_now_embedded_in_over/h2j337m/",
        "score": 82,
        "subreddit": "wallstreetbets",
        "created": 1624307221.0
    },
    {
        "author": "darkMatterMatterz",
        "body": "I read on internet that AAPL has 420% short interest.",
        "created_utc": 1623849001,
        "id": "h1ypvne",
        "permalink": "/r/stocks/comments/o13xtm/by_no_means_a_dd_but_just_to_let_you_know/h1ypvne/",
        "score": 81,
        "subreddit": "stocks",
        "created": 1623877801.0
    },
    {
        "author": "chuck_portis",
        "body": "It just seems they'd rather pump the bubble bigger indefinitely than ever having to deal with it.  Considering how vulnerable we are now with COVID, a totally unexpected event, it seems like a major missed opportunity that the Fed didn't try harder to tighten and raise rates throughout Trump's presidency.\n\nI think Trump especially got spooked in 2018 when the market went down from tightening, so much so that he pulled the plug.  He viewed the stock market performance as the success gauge of his presidency.  And he was already approaching an election year.  \n\nI doubt the 2018 crash could sustain itself too much longer.  Fundamentals were strong.  In hindsight, it was a necessary pain which would have assured greater stability going forward.  You had stocks like Apple hitting PE's around 12 in 2018.  How much lower could it realistically have gone?\n\nThe Fed kept reversing course when the going got tough.  Now there's a real disaster ongoing, and they're totally backed into a corner.",
        "created_utc": 1624169256,
        "id": "h2eifrq",
        "permalink": "/r/investing/comments/o3uuy3/barrons_investors_are_calling_the_federal/h2eifrq/",
        "score": 78,
        "subreddit": "investing",
        "created": 1624198056.0
    },
    {
        "author": "neothedreamer",
        "body": "Everyone is overlook key facts - Pros also have disadvantages, they have tons of capital to invest, limits to their mandate on what they can invest in, how much they can invest in one position, indexes are only matching the companies in their index including zombie companies, don't normally trade options (selling CC can bring additional return for low risk on a long term position you may plan on keeping for years) etc.\n\nIf you only buy blue chips like Aapl, MSFT etc and sell CC on them far enough otm you will beat indexes because that is return they aren't even trying to chase.",
        "created_utc": 1623639663,
        "id": "h1owkle",
        "permalink": "/r/investing/comments/nz9dxc/is_bogles_style_passive_investing_really_better/h1owkle/",
        "score": 78,
        "subreddit": "investing",
        "created": 1623668463.0
    },
    {
        "author": "kadsmald",
        "body": "But what if Steven Apple had died from an exploding iPhone. That’s the true comparison",
        "created_utc": 1624960615,
        "id": "h3f8y55",
        "permalink": "/r/wallstreetbets/comments/o9yuou/big_time_retard_move_planned_way_ahead_amzn_put/h3f8y55/",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1624989415.0
    },
    {
        "author": "vipcopboop",
        "body": "Apple is juice, blackberry is my jam!",
        "created_utc": 1622745689,
        "id": "h0gzmuf",
        "permalink": "/r/wallstreetbets/comments/nrdbzc/once_upon_a_time_i_was_a_bb_factory_worker_bb/h0gzmuf/",
        "score": 77,
        "subreddit": "wallstreetbets",
        "created": 1622774489.0
    },
    {
        "author": "Forestur",
        "body": "Can we talk a bit about how the old CEO (Ulrich Kranz) of Canoo got recently hired by apple? I can’t write up a decent post on the topic cause I’m at work, just some LSD level speculation, but is it possible that Ulrich could lead a partnership between Apple and Canoo? I think apple promised some sort of EV around 2024, and what do they currently have? Nothing. But here’s Canoo with everything ready, except for a manufacturing deal (Apple gonna set that up?), AND a line of vehicles that look like something that would fit with Apple’s designs. I know Apple rumours have burned us in the past, but I can see a little weight to this type of speculation now",
        "created_utc": 1623767885,
        "id": "h1up248",
        "permalink": "/r/wallstreetbets/comments/o0bhqk/canoo_goev_the_ev_manufacturer_thats_ready_to/h1up248/",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1623796685.0
    },
    {
        "author": "highestinther0om",
        "body": "“Net” margin for Walmart is less than 2% (1.97) and for Apple is 26.38%.  It’s not the only factor of course….",
        "created_utc": 1624922129,
        "id": "h3dmx82",
        "permalink": "/r/stocks/comments/o9vqmv/why_doesnt_walmart_have_the_highest_market_cap/h3dmx82/",
        "score": 75,
        "subreddit": "stocks",
        "created": 1624950929.0
    },
    {
        "author": "JohannFaustCrypto",
        "body": "Good post, but GME is not a MEMESTOCK, that term is used by the media to deligitemize the value plays. Gamestop is and always has been a value play. The squeeze is just an added part.\n\nEdit: also what makes a stock a memestock? if we make memes about Apple or Amazon would that make them memestocks? Gamestop was a company at the verge of bankruptcy (because they are being naked shorted into oblivion) in 2020 which turned itself completely around, raised a ton of cash, is building an all star team with ex amazon employees and is now entering the e-commerce sector.",
        "created_utc": 1623166810,
        "id": "h11g1od",
        "permalink": "/r/stocks/comments/nv3m73/take_emotion_out_of_trading/h11g1od/",
        "score": 74,
        "subreddit": "stocks",
        "created": 1623195610.0
    },
    {
        "author": "javaHoosier",
        "body": "I’m an iOS AR Engineer and the potential is huge. Apple is doing phenomenal work to fill in the gaps at what causes the major bottlenecks.",
        "created_utc": 1624400625,
        "id": "h2pbjmi",
        "permalink": "/r/investing/comments/o5w9xy/msft_closes_at_2_trillion_as_second_us_company/h2pbjmi/",
        "score": 73,
        "subreddit": "investing",
        "created": 1624429425.0
    },
    {
        "author": "dancinadventures",
        "body": "In 2000 AppStore wasn’t a thing. They didn’t make software. They didn’t have licensing for Apple Development. AppStore purchases weren’t a thing. \n\nPeople used Nokia phones. Macs we’re overpriced hipster shit. They had to suck Intel off to get their chip supply chain. They didn’t become the top luxury phone in China. China market was broke a.f.\n\nWhat would’ve made you buy it in 2000? The iPod? Wait no that’s not even 2000… so I guess the iMac",
        "created_utc": 1624826502,
        "id": "h38za55",
        "permalink": "/r/investing/comments/o93fz5/people_who_say_value_investing_is_dead_are_idiots/h38za55/",
        "score": 73,
        "subreddit": "investing",
        "created": 1624855302.0
    },
    {
        "author": "caesar____augustus",
        "body": "All I see when I read posts like this is \"BUY MORE AAPL\"",
        "created_utc": 1622757482,
        "id": "h0hree0",
        "permalink": "/r/investing/comments/nrnnv0/i_think_aapl_is_at_its_peak_and_starts_to_show/h0hree0/",
        "score": 70,
        "subreddit": "investing",
        "created": 1622786282.0
    },
    {
        "author": "works_best_alone",
        "body": "I don't mean to be rude, but if Apple going from 127 to 125 (that's about a single percent!) is scaring you enough to make you exit that position, you are better off not actively picking stocks and sticking to an S&amp;P 500 or total market ETF. Keep watching the market and try again later when you have a bit more confidence.",
        "created_utc": 1622828069,
        "id": "h0lac62",
        "permalink": "/r/StockMarket/comments/nsakad/made_the_first_biggest_mistake_of_trading_so_far/h0lac62/",
        "score": 69,
        "subreddit": "StockMarket",
        "created": 1622856869.0
    },
    {
        "author": "rebeltrillionaire",
        "body": "I can’t be alone in thinking Tik Tok’s\nShelf life is almost 100% dictated by how long before they fully monetize and and ads overtake mindless consumption of a dedicated core of users.\n\nInstagram’s curated aspirational social performance has staying power because you’ll never want to delete a photo that was the highlight of a $3,000 vacation or a $700 concert.\n\nAds neatly fit in as people also drift away from posting their actual life and focus in on a singular topic which they’d like to be known for. \n\nStories allow glimpses into the “artists” life but it disappears and doesn’t ruin the aesthetic of a page.\n\nNothing Apple is introducing will fuck with IG.\n\nSnapchat I believed had staying power because sometimes we want to communicate without the baggage of a lifelong record.\n\nApple is looking to bring that functionality into iMessage. Which I can’t wait for… especially if you can split a contact into two types of communication somehow. \n\nI think millions of people are afraid to even sext their husbands and wives because our devices are too linked. A photo of your tits could be simultaneously seen on a TV, a watch, a desktop, a tablet… even in a house without kids that’s just too much digital scrubbing to worry about and make sexy. \n\nOf course beyond sexting it would be nice to be free from permanent records, but not all the time…\n\nI don’t think it’s useful either to have your only permanent records to be “I love you” and things that need to be remembered like a grocery list.\n\nThe other platform that to me makes the most sense for cannibalization is YouTube.\n\nApple has been the defacto standard for curated paid artists since iTunes. \n\nYouTube is becoming less and less the place to store a video of your co-worker doing some dumb shit and everyone in your circle and 30k strangers find hilarious. \n\nInstead it’s professional content producers who provide niche service and information.\n\nWhether it be FloatPlane, Patreon, or Onlyfans people are wanting to cut through bullshit and get that high-grade content, reward creators, and never hear another ad.\n\nEnter Apple. \n\nThey already provide the tools to create and  edit content. Why not provide the infrastructure of AppleTV and change the nature of Apple’s foray into streaming.\n\nI was thinking, even something as simple as the fact that rather than always having to stream every single thing. A creator could make their videos available for download and the consumer now has a video file that’s actually usable, editable, offline, and works in the entire ecosystem of Apple hardware and software. \n\nFor things like Recipes… that would be a game changer.",
        "created_utc": 1623229199,
        "id": "h14rcpt",
        "permalink": "/r/stocks/comments/nvktu5/apple_is_encroaching_on_facebooks_territory_like/h14rcpt/",
        "score": 69,
        "subreddit": "stocks",
        "created": 1623257999.0
    },
    {
        "author": "GroundSe7en",
        "body": "Credits to /u/ixamnis\n\n\" Here are some that I like. By no means an exhaustive list:\n\n**QQQ** \\- This one uses the NASDAQ 100 as its benchmark. Obviously it's an Indexed, non-managed ETF. XTF used to rate this one as a perfect 10.0 out of 10 rating, but recently dropped it to 9.9 out of 10. It has one of the highest rates of return over the past 10 years of any ETF. It does tend to be tech-heavy, especially with the FAANG +M stocks.  (Facebook, Apple, Amazon, Netflix, Google and Microsoft).  Other top holdings include TSLA, NVDA and ADBE.  (The rating dropped recently when the portfolio of the NASDAQ 100 was re-balanced).\n\n**VXUS** \\- Vanguard Total International Index Fund ETF - top holdings include BABA, Tencent, Samsung, Taiwan Semiconductors, Novartis, Toyota. This is a broad market fund investing only in companies overseas.  I'm not generally bullish on foreign markets, but this one is a very solid ETF with some companies that are likely to do extremely well for the foreseeable future.  XTF rates this one a perfect 10.0 out of 10.\n\nAt the suggestion of u/Here4TheCatPics, I'm also going to include **EFA** and **EEM**. These are Emerging Markets ETFs.  Both have some crossover in their top holdings with VXUS. **EFA** is rated 9.6/10 by XTF Analysts and **EEM** is rated only 5.7/10. **EEM** appears to be heavily invested in the Chinese market with Alibaba and TenCent the top two holdings. It also holds quite a bit of cash for an ETF. **EFA** appears to be more tilted toward the European market. \n\n**VOO**/**SPY** \\- **VOO** and **SPY** are non-managed funds indexed to the S&amp;P 500 Index. These funds are very popular on this subreddit, for good reason. They are well diversified, broad market funds investing in mostly US stocks. XTF rates these funds at 9.6 out of 10 because their return on investment over the long term is somewhat tempered by some of the blue chip stocks in the funds. But those stocks also help reduce volatility relative to some other ETFs. These are solid investments, but keep in mind that in the top 10 holdings there will be a lot of crossover between these funds and other broad market funds that hold US stocks like **QQQ**, **VTI**, **VTG**, **VOOG** and **SPYG**.  There are differences, of course, as well, but you always want to know where those duplications exist.\n\n**IWF** \\- This is a Russell 1000 indexed fund. It is one of my favorites that doesn't get talked about much. It does have a lot of crossover with the other funds mentioned above, but the mix is slightly different.  I would describe this fund as more aggressive than **VOO/SPY**, less volatile than **QQQ**.\n\n**IWM** \\- for someone looking to diversify a little bit, this is a great fund to look into. This fund is a non-managed, indexed fund that uses the Russell 2000 index as its benchmark. The big difference between the Russell 2000 index and many of the the other indexes is that the Russell 2000 index looks at small and mid-cap companies, rather than large-cap companies.  Thus, there is zero crossover between this one and the funds mentioned above. While this fund will move up and down with the market, it is often less volatile than the market overall. If you look at the charts, this fund has under-performed some of the other funds over the past few months while the market has been very volatile in an upward direction, but in a crash, this fund would probably outperform the rest of the market.  It has a 9.0/10 XTF rating.\n\nThere are also some sector funds you may want to look at:\n\n&amp;#x200B;\n\n**ICLN**/**TAN/FAN** \\- These funds are clean/renewable energy ETFs. ICLN is more broad while TAN focuses more specifically on solar energy and FAN specifically on wind generated energy. I think renewable energy companies are the future. There is no crossover in the top holdings of this fund with the top holdings of QQQ and most of the other broad market funds. Also, these are global, not just US based companies.  QCLN and PBW are also renewable energy funds, but they also contain a lot of TSLA, NIO and W.K. H.S. in their top holdings making them \"electric vehicle\" funds, as well.  No problem if you want to add that, but you'll find a lot of Tesla in some of the funds mentioned above.\n\n**ARK** group of funds: **ARKG**, **ARKF**, **ARKK ARKW**, **ARKQ**, **PRNT** and **IZRL**. These are managed funds investing in companies that invest in disruptive companies in their respective industries. Most posters on this subreddit are bullish on these funds. They are aggressive growth ETFs, but should be considered somewhat risky and volatile.\n\n* ARKG - Genomic Revolution\n* ARKF - Fintech\n* ARKK - Disruptive Companies (broader market)\n* ARKW - Internet/computer/technology  (Telsa is a top holding)\n* ARKQ - Robotics and artificial intelligence\n* PRNT - 3D printing technology\n* IZRL - disruptive companies based in Israel\n\nXL series of funds.  Similar to the ARK series, these tend to be more aggressive growth funds, however these are passively managed indexed funds with various benchmarks that usually are overloaded in the better companies within a sector:\n\n* **XLV** \\- Health Care\n* **XLK** \\- Technology\n* **XLY** \\- Consumer Discretionary\n* **XLF** \\- Financial\n* **XLU** \\- Utilities\n\nAt the suggestion of u/Shaun8030, I'm adding Cloud Computing as another sector to consider.  Some tickers in that sector include:  **WCLD**, **SKYY**, **CLOU**, **BUG** and **XIKT**. Of these **WCLD** has the best 52 week performance.  Top holdings in **WCLD** include **ZM**, **PLAN**, **CRM**, **CRWD**, **ZEN**, **WDAY**, **TENB**, **PCTY**, **DDOG**, **BL**.  Many of these are likely to also appear in **QQQ**, however, they would be in very small percentages as the Cap on these companies is much smaller.\n\nRead through the comments below. Many users have posted some other great suggestions, as well.\n\n***A nice portfolio might look something like this:***\n\n20% - Broad market US fund such as QQQ, VOO or IWF\n\n20% - VXUS - International\n\n20% - IWM - Small/Mid-cap broad market fund\n\n10% each in four sector funds of your choice\n\nHope this helps.\n\n&amp;#x200B;\n\n*I'm not a financial expert or advisor and this is not financial advice, just an opinion from a random internet person.  I do own shares in several, but not all of the funds listed above, including QQQ, IWF, some ARK funds, ICLN, VXUS, etc.*\n\n&amp;#x200B;\n\n**EDIT:**  WOW! Thanks for the awards and the positive comments.  I appreciate the feedback.  I hope this advice really helps some people.\"",
        "created_utc": 1623447021,
        "id": "h1g8hk1",
        "permalink": "/r/investing/comments/nxlekk/which_to_pick_schd_voo_vig_vti_vt_vym_vxus_veu/h1g8hk1/",
        "score": 68,
        "subreddit": "investing",
        "created": 1623475821.0
    },
    {
        "author": "kortokrizzle",
        "body": "Fuck you AAPL\n\n*sent from my iPhone*",
        "created_utc": 1623415585,
        "id": "h1eaum0",
        "permalink": "/r/wallstreetbets/comments/nxcaz5/daily_discussion_thread_for_june_11_2021/h1eaum0/",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1623444385.0
    },
    {
        "author": "Complete-Disaster513",
        "body": "Of all the companies that get labeled the next apple this one actually has a real but small chance of following their footsteps.  \n\nLike apple, $BB once dominated a market they lost and had to pivot into new places.  Apple did so successfully with the iPod and the IPhone.  $BB has a chance with Iot and cyber security.  \n\nI am not claiming $BB is a can’t lose trillion dollar company in 10 years but if they get this right they have a chance to absolutely dominate critical markets of the future.  Not to mention that they are strategically important to both Canada and the US government. \n\nThis is the type of stock you buy with money that you can lose and then promptly forget you bought for a decade or 2.  Then when you remember to check your account one day when you are fat and old you will die of a heart attack because your 2K investment is now worth 2 million.",
        "created_utc": 1623083063,
        "id": "h0xat11",
        "permalink": "/r/wallstreetbets/comments/nufjik/bb_blackberry_to_participate_in_upcoming_investor/h0xat11/",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1623111863.0
    },
    {
        "author": "hijfork",
        "body": "Not really, Apple has been rewarding shareholders with lots of buybacks. A sign of maturity maybe, but I won’t complain about FCF yield from one of the most profitable companies in the world.",
        "created_utc": 1622870058,
        "id": "h0nlqz4",
        "permalink": "/r/stocks/comments/nsjp6c/microsoft_wins_us_antitrust_okay_for_16_billion/h0nlqz4/",
        "score": 67,
        "subreddit": "stocks",
        "created": 1622898858.0
    },
    {
        "author": "p4madeus",
        "body": "Apple.\n\nIncredibly well run. Many revenue streams. Their gen-1 M series chips are making Intel sweat already. iPhone. App Store. Going nowhere but up over the long term.",
        "created_utc": 1624309919,
        "id": "h2kxkss",
        "permalink": "/r/stocks/comments/o555lb/if_you_could_only_buy_one_stock_for_the_rest_of/h2kxkss/",
        "score": 67,
        "subreddit": "stocks",
        "created": 1624338719.0
    },
    {
        "author": "N_o_B_o",
        "body": "CLOV to $40 and my student loans can suck my apple bag.",
        "created_utc": 1623087343,
        "id": "h0xl3on",
        "permalink": "/r/wallstreetbets/comments/nugy0v/gme_gains_50k_amc_gains_50k_now_to_clov_with_an/h0xl3on/",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1623116143.0
    },
    {
        "author": "cookingboy",
        "body": "&gt;it's all they can physically bring themselves to use. \n\nI'm embarrassed to admit most of my friends and I are those people. I've been using iPhones for the past 12 years and I don't see how it will change for the next 12 years. When my friends and I buy computers we just see if any online site has deals for the newest Macbook (some of us do build our own gaming PC though). Every smart watch in my social circle is an Apple Watch and no one I know can even name a current gen Android tablet (seriously do they still sell those?). A few of my friends are on Android phones and that's about it.\n\nBefore you paint us as some stereotypical Apple fanboys who are just attracted to empty marketing, most of us work for FAANG and have degrees in EE, CE, or CS. I can actually go down a rabbit hole and present a case that Apple's seemingly over-the-top marketing is actually *underselling* how far ahead they are in terms of technical lead over their competitors. \n\nPeople think Apple products are all about fancy designs and pretty colors because that's what their marketing focuses on. \n\nDifferent consumers may feel different things about Apple products, but a common emotion their competitors' engineers feel is just despair.",
        "created_utc": 1622763472,
        "id": "h0i3ygn",
        "permalink": "/r/investing/comments/nrnnv0/i_think_aapl_is_at_its_peak_and_starts_to_show/h0i3ygn/",
        "score": 66,
        "subreddit": "investing",
        "created": 1622792272.0
    },
    {
        "author": "piggydancer",
        "body": "I'm advising you to have a strategy, not to execute it perfectly. That's two completely different things. \n\nYou seem like you're getting upset at me, and perhaps I offended you with the just guessing part, but then tell me, what exactly is the input you used to get a 10-20% (which is a wide variance) over a 12 month period?\n\nThere needs to be an input to get an output. Especially if you come up with a numerical output, it requires a numerical input. \n\nDon't get frustrated, I'm trying to help, and you keep brushing over my main point.\n\nEntrance strategy!\n\nYou're thinking about it backwards. You're trying to figure out how to exit a stock, before you figure out how to enter one. You have to have an entrance strategy first. \n\nThat is why you're asking this question and don't have an answer. \n\nIf you enter a stock because of a valuation, you sell when it exceeds a valuation.\n\nIf you entered a stock because of a trend, you sell when it breaks that trend.\n\nIf you enter a stock because of a growth rate, you sell when it stops growing. \n\nIf you enter a stock because of its quality, you sell when that quality diminishes.\n\nAnd yes, sometimes you'll still be wrong. You'll never find a perfect strategy, or execute it perfectly. But you'll know what you're doing and why, and that will lead to a lot more positive and consistent results over the long run. \n\nAs far as right now, you can reevaluate. Think of it as buying a stock for the first time. What is your strategy going to be, and which stock fits that strategy better right now Google or Apple?",
        "created_utc": 1622853377,
        "id": "h0mt2rl",
        "permalink": "/r/stocks/comments/nsewch/when_do_you_sell_or_do_you_even_a_good_stock_like/h0mt2rl/",
        "score": 66,
        "subreddit": "stocks",
        "created": 1622882177.0
    },
    {
        "author": "InvestingBlog",
        "body": "Yeah depends on sector\n\nTech - Inputs cost about the same, total salaries are meaningless compared to earnings increase\n\nCompanies that charge % of revenue as a business model (Apple store, GOOGLE store, BABA) will murder\n\nCompanies with high input costs - Car, Airlines , are about to see their margins shrink to 0 unless new cars begin selling for 10%+ more\n\nAlso note - The price of Wood has increased 3-4x, and metals about 50%. What is the item people own that contains these things? Homes (globally), the value of the raw materials inside a home have increased  at a higher rate than the land it's on. People who think we are in a real estate bubble are in for a  rude awakening. New homes have become almost 2x more expensive to build",
        "created_utc": 1623355169,
        "id": "h1bjrux",
        "permalink": "/r/investing/comments/nwmq4r/cpi_rises_6_in_may_rate_of_inflation_rises_to_5/h1bjrux/",
        "score": 65,
        "subreddit": "investing",
        "created": 1623383969.0
    },
    {
        "author": "JRshoe1997",
        "body": "Fine by me. Been looking to buy some cheap AAPL shares.",
        "created_utc": 1622687124,
        "id": "h0e4fmw",
        "permalink": "/r/stocks/comments/nr1dkn/beware_of_what_amc_shorts_are_holding/h0e4fmw/",
        "score": 64,
        "subreddit": "stocks",
        "created": 1622715924.0
    },
    {
        "author": "artificialimpatience",
        "body": "Let’s all help push it up past #14 on the Apple App Store, it can be top 10 if we all download it and give five stars!!! And maybe buy something on it",
        "created_utc": 1623767465,
        "id": "h1uo5dh",
        "permalink": "/r/wallstreetbets/comments/o0ei0l/wish_to/h1uo5dh/",
        "score": 63,
        "subreddit": "wallstreetbets",
        "created": 1623796265.0
    },
    {
        "author": "ImmySnommis",
        "body": "This is a hilarious post... But I guess this is what the market has bred over the last decade or so with easy money.\n\nI'm in big on MSFT. Like 19% of my portfolio. Those reinvested dividends pay off in spades. Just like COST or AAPL. Your vision is quite narrow.",
        "created_utc": 1623444378,
        "id": "h1g2v03",
        "permalink": "/r/stocks/comments/nxp7y7/what_is_the_point_of_1_dividends/h1g2v03/",
        "score": 62,
        "subreddit": "stocks",
        "created": 1623473178.0
    },
    {
        "author": "SSS0222",
        "body": "Basically for increasing liquidity.\n\nThey act kind of like middle men in option pricing. To do trade without them, you need a person always on the other side of the trade, which is not always possible in options.\n\nFor example, if I decide to sell, say a random option, AAPL 17 SEP 117.5, at that exact second, it is possible that no one(normal trader) is interested in buying that one option directly to me. If no one is buying that exactly at that time, there wont be any bid price, hence there wont be a reference price, very illiquid market.\n\nSo the job of these market makers is thus to always give you quotes and to act as buyer and sellers of last resort at all the time. So even though there may not be normal trader like me trying to buy from me, the market maker gives me a quote and is ready to buy it to me at the bid price at any moment.\n\nThen say a few seconds later, there comes another trader who now wants to buy that option. Now the market marker gives him an ask quote and transfer my option to him.\n\nThe market maker thus makes money between the bid value given to me Vs the ask value recieved from other.\n\nRemember there are hundreds of option prices for AAPL for different strike and expiry, but only one stock price, hence it is always possible that nobody may be interested in that one random option at that exact second, unlike AAPL stock where there is always demand, so MMs become more important in options market.",
        "created_utc": 1622757028,
        "id": "h0hqens",
        "permalink": "/r/stocks/comments/nrg1xd/why_does_pre_market_exist_and_why_are_options_not/h0hqens/",
        "score": 62,
        "subreddit": "stocks",
        "created": 1622785828.0
    },
    {
        "author": "AngeloMonharti",
        "body": "Copying and pasting from an earlier conversation I had today:\n\nNvidia has a few CMP HX partner models preparing to launch - these are the mining specific cards. They have no display output which means they can't be used for gaming. Nvidia is also revising ALL current 30 series (except 3090 I believe) to a LHR (light hash rate) version which is a physical difference in the silicon. They are doing this to nerf ETH mining performance on their 30 series cards at the hardware level.\n\nCurrently, Nvidia's CMP HX mining cards make no economic sense to mine on since they are way less power efficient, and have no resale value since they can't be used for gaming. However, if Nvidia completely locks down ETH hash rate on the 30 series, they can increase their TAM by preventing miners from cannibalizing their gaming sales. So far, the CMP HX cards look like they are built on 10 series architecture so they will be able to be produced cheaper and in parallel to 30 series.\n\nLastly, the ARM deal seems to be moving along. Qualcomm has voiced concerns and said they are ready to invest in ARM as a partner if the Nvidia deal falls through. Nvidia says it has 3 other silicon manufacturers who support the Nvidia deal but details aren't known yet. Nvidia's recent rise is likely due to the probability of the ARM deal actually becoming more likely.\n\nIn case you dont understand why the ARM deal is good for NVDA, it means that all ARM-based chip manufacturers are beholden to NVDA. ARM is the most dominant CPU architecture for all mobile CPUs including micro controllers in other devices. Apple, qualcomm, samsung, amd, intel, huawei, IBM all have ARM licenses\n\nIt allows NVDA to penetrate the mobile market. Nvidia has the highest profit margins on their mobile CPUs because they don't have to rely on partners to distribute chunky desktop cards. They sell the silicon directly. Every iphone and samsung galaxy could have an Nvidia-produced CPU and GPU.\n\nThe reason ARM is used for mobile is because of its power efficiency. If Nvidia knows what they are doing (they do) then they know how they can use their proprietary access to ARM to create ultra performant and efficient server chips, feeding into their datacenter revenue.\n\nNvidia has announced plans to enter the server CPU market. When they announced this, Intel and AMD stock tanked 5% or so. My bet is that they are already working with ARM to deliver their CPU server chips\n\nTL;DR - ARM deal going through would make NVDA pull a page out of 2020 TSLA's book. Downside is ARM deal delays, pricing in approval then having it get denied. Would crush the stock.",
        "created_utc": 1624894321,
        "id": "h3bw68t",
        "permalink": "/r/stocks/comments/o9lrfo/thoughts_on_nvda_and_their_upcoming_split/h3bw68t/",
        "score": 62,
        "subreddit": "stocks",
        "created": 1624923121.0
    },
    {
        "author": "MasterCookSwag",
        "body": "hahaha, I swear to god 90% of the time I see someone say \"I got banned for XYZ\" it's not that at all. \n\nLike, \"/r/investing banned me for saying I bought AAPL\".  Their post: \"Fuck you, you fucking nerd, you're going to be poor forever you little bitch\" \n\nCan't understand why ya got banned....",
        "created_utc": 1624040325,
        "id": "h28jqa3",
        "permalink": "/r/investing/comments/o2w3qk/reminderclarification_on_our_stance_on_subreddit/h28jqa3/",
        "score": 61,
        "subreddit": "investing",
        "created": 1624069125.0
    },
    {
        "author": "quirkypanic2",
        "body": "I work in this industry so my $0.02….also on mobile so sorry.  I suspect that the stock price and P/E are taking into account the risk associated with intel.  They have struggled to deploy their newest technologies and are &gt;two years behind - executing and management of technical risk have been tough.  They have had to consider outsourcing operations to their competitors.\n\nI also think there are major potential headwinds with the direction chip companies are taking.  Take for example apple (M1), Tesla and google.  All are moving major applications from generalist chips where intel made their name to specialized chips designed to work with their(that companies) software.  Intel has to become a foundry to compete for this business (and has announced to invest to do just that) - but there will be more competition here for that.  Even servers which is where intel has been strong and showing some movement to custom chips.\n\nI think if they can sort out their technology scaling challenges they have great assets.  The new strategy from the exec team there seems decent And semi is expected to be strong for the next few years.  And their are some macro issues in their favor (concerns about too much tech concentration in Taiwan, lack of domestic (US) chip mfg.  But they have to get a good edge back and execute well or I think they have real risk of continuing to lose market share.\n\nTo those saying US government needs will fill.  until recently used IBMs old fab in fishkill ny for a lot of defense needs.  But missles don’t need the most advanced chips like you find in computers (fishkill was 90/65nm vs TSMC which is announcing 2nm).  However I think we need to see how much desire there is to preserve domestic leading edge semiconductor mfg.",
        "created_utc": 1624992624,
        "id": "h3gy9ve",
        "permalink": "/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/h3gy9ve/",
        "score": 60,
        "subreddit": "investing",
        "created": 1625021424.0
    },
    {
        "author": "dal2k305",
        "body": "Short term yes, long term absolutely not. If what you’re saying is true then AAPL, MSFT, AMZN and GOOG wouldn’t be the largest companies by market cap. If you look at revenue and profit there is a direct correlation between those things and the appreciation of a stock. The companies that perform the best year over year have the best stock performance and the companies that perform poorly crash. \n\nThe longer the time frame the more rational the market becomes.",
        "created_utc": 1623276726,
        "id": "h17jpzi",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h17jpzi/",
        "score": 60,
        "subreddit": "investing",
        "created": 1623305526.0
    },
    {
        "author": "ShadowLiberal",
        "body": "MSFT definitely feels like the unpopular step child right now when it comes to the big FAANG+M stocks. I've been buying into it heavily for months, at a minimum I've been buying 2 shares every pay check. But I rarely see others calling MSFT a buy at reddit or in investing channels. I've seen some people argue that they just won't keep growing, and a lot of others saying it's just too expensive. It doesn't normally get that much love (or even a lot of mentions at all) in investing youtube channels either.\n\nAMZN is almost always called a buy whenever anyone talks about it, I practically never see anyone argue not to buy it, and I've never seen anyone use any kind of analysis/numbers to justify it being overpriced.\n\nAAPL has some people who say it's stupidly overpriced, and some who say it's a crazy steal right now if you look at the forward PE ratio. It's just a more polarizing stock that has a lot haters and a lot of loyal fans.\n\nGOOG &amp; FB have their haters, but also have a lot of people who have been saying for a while that they're really undervalued. I've seen so many youtube videos over the last year or two calling both of them great buys.\n\nNFLX has it's doubters with many others making their own streaming services these days, but I still see a lot of people who argue they're still a great investment and will continue growing despite these challenges.",
        "created_utc": 1624399513,
        "id": "h2p9cyd",
        "permalink": "/r/stocks/comments/o5w8ta/msft_closes_at_2_trillion_as_second_us_company/h2p9cyd/",
        "score": 60,
        "subreddit": "stocks",
        "created": 1624428313.0
    },
    {
        "author": "Wilbur_Redenbacher",
        "body": "Hell, have you seen how hard AAPL dips after a *positive* earnings report?",
        "created_utc": 1623176792,
        "id": "h1240sf",
        "permalink": "/r/stocks/comments/nv506l/the_curious_case_of_aapl/h1240sf/",
        "score": 59,
        "subreddit": "stocks",
        "created": 1623205592.0
    },
    {
        "author": "SenTedStevens",
        "body": "Yes. I want to go back to the days of YOLOing everything on AAPL, AYYYYYMD, JNUG, fucking with The Mouse, Faggy Ds, ridiculous call/short options, and autistic horse-headed Canadians.\n\nI'm not some ape trying to change the world. I have no plans on donating to charities, opening some banana feeding non-profit for retarded apes, or what-have-you. I'm an opportunist that got in on a huge opportunity.",
        "created_utc": 1623278908,
        "id": "h17ogdu",
        "permalink": "/r/wallstreetbets/comments/nw5eda/why_has_this_turned_into_a_war_of_stock_vs_stock/h17ogdu/",
        "score": 59,
        "subreddit": "wallstreetbets",
        "created": 1623307708.0
    },
    {
        "author": "Pooker100",
        "body": "I was just thinking about that. Beats are essentially dead, I haven’t seen them in the wild for some time. They only have a small section dedicated to them in Apple stores.",
        "created_utc": 1622860387,
        "id": "h0n5x1q",
        "permalink": "/r/stocks/comments/nsjp6c/microsoft_wins_us_antitrust_okay_for_16_billion/h0n5x1q/",
        "score": 59,
        "subreddit": "stocks",
        "created": 1622889187.0
    },
    {
        "author": "growawaybro",
        "body": "Tesla getting ready to dethrone Apple in the next couple years",
        "created_utc": 1624503155,
        "id": "h2udwsw",
        "permalink": "/r/wallstreetbets/comments/o6q5uf/tsla_gang_fully_erect/h2udwsw/",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1624531955.0
    },
    {
        "author": "ComfortMailbox",
        "body": "That's why i only invest in food companies such as apple",
        "created_utc": 1624998167,
        "id": "h3hax6t",
        "permalink": "/r/wallstreetbets/comments/oac0kd/_/h3hax6t/",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1625026967.0
    },
    {
        "author": "Citizen_of_Danksburg",
        "body": "Thanks for the comment! \n\nI guess for background, I’m 24 and a half, just finished grad school in stats, and I’m making $65k/year (living with my parents rn but will be moving back to the RTP for work in late July). Before taxes, every two weeks I’ll be making about $2700. Thank god I have no debt (love my parents so much ❤️), but my current portfolio is this:\n\n100 shares of CRSP\n15 shares of AMC\n10 shares of WISH\n10 shares of CLOV\n\nThe 100 shares of CRSP I really don’t want to touch. I originally had 50 shares of MSFT at around $245 at its peak (then), sold it all for GME, diamond handed it, and then sold it for a slight loss at $90/share (bought in around $94/share). Used that money to buy CRSP because I felt like an idiot with my GME purchase, thinking it wouldn’t ever spike again. Also, like an idiot, while I was still living with my parents back home in Ohio, I was still on my lease back in NC and gambled $2500 (about 6 months worth of rent) in the market as well and lost about $1900 leaving me with just south of 2 months worth of rent. \n\nI’ve learned my lessons for sure, and I’m happy that I put money into CLOV and WISH yesterday, and I’m optimistic about AMC, but my goal is \n\n100 shares of BEAM, \n100 shares of FATE, \n100 shares of NTLA, \n25 shares of NVDA, \n25 shares of TSLA, \n50 shares of AMD, \n50 shares of AAPL, \n50 shares of MSFT, and \n50 shares of AI. \n\nThat said, I really want to get into purchasing calls, I just don’t really know how to. I use TD Ameritrade and I just want to make sure I’m doing it right and be super careful. I definitely have opinions about what prices certain stocks will be at by some time point I think, I just don’t know how to trade calls on those. I also don’t really know what “theta” is so that’s why I’m not in the options game. I see so many people making big bucks off it though. I don’t know the math/logistics of how that works but damn, I want my piece. \n\nThanks for coming to my Ted talk haha.",
        "created_utc": 1623244877,
        "id": "h15ed9s",
        "permalink": "/r/wallstreetbets/comments/nvonrs/500k_gain_today_with_wish_clne_and_vldr_leading/h15ed9s/",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1623273677.0
    },
    {
        "author": "infamous9111",
        "body": "If WISH hits $15 and SPY hits $430 tmr, I'll buy one Wendy's burger for every upvoter\n\nalso AAPL and MSFT have to go up at least $2",
        "created_utc": 1623821821,
        "id": "h1xrxi2",
        "permalink": "/r/wallstreetbets/comments/o0n6ry/what_are_your_moves_tomorrow_june_16_2021/h1xrxi2/",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1623850621.0
    },
    {
        "author": "throway1988sep",
        "body": "I wouldn’t - apple exposure is already built into the index funds as well, depending on which ones? so exposure will be greater than 5%.",
        "created_utc": 1623951039,
        "id": "h242i4t",
        "permalink": "/r/investing/comments/o1zxq4/should_i_focus_more_on_growth_or_dividend_stocks/h242i4t/",
        "score": 56,
        "subreddit": "investing",
        "created": 1623979839.0
    },
    {
        "author": "ron_leflore",
        "body": "Lots of people here don't understand bonds and advise others to just stick with stocks, don't listen to them.\n\nHere's what you need to know. \n\nFirst, most bonds  (excepting US treasuries) trade more like used cars than stocks. Each trade is unique and not exactly comparable. Because of this, bond traders are specialized. If you just put in an order and try to buy a few thousand dollars worth of a specific bond, you are going to overpay by a substantial amount. You need to be buying round lots ($100k worth) and know what you are doing to get a good price. Because of this, most retail investors should avoid buying individual bonds (except treasuries) and stick with bond funds.\n\nThere's many many more types of bonds than stocks in the US. There's one AAPL stock, but they probably have a dozen different types of bonds. Every city, county, school district, hospital, etc issues multiple types of bonds.\n\nAll the research saying passive investing (index funds) beats active investing is about stocks, not bonds. People just assume it's the same, but it's not. You'll make more in an actively managed bond fund than in an index bond fund.\n\nMost bonds will have lower volatility and lower returns than typical stocks, but this can be adjusted up with leverage. An easy way to invest in these are with CEFs, which often use leverage.\n\nHere's the total returns for PDI, a bond cef over the past eight years: 12%,20%, 6%, 18%, 19%, 8%, 23%, -9%, and (ytd in 2021) 13%. Because a large part of the total returns are paid out in distributions, it's best to reinvest the dividends and hold them in a tax advantaged account.\n\nIf you are in a high tax state, (CA, for example), and in a high tax bracket, it makes sense to be in a state specific municipal bond fund. One example is PCQ for California. This muni bond cef currently has a yield of 4.18% tax-free, which is the equivalent of about 8% taxable. I have about a third of my taxable account in these types of investments, because I'm quite happy to take a near certain 8%.\n\nI think everyone should have exposure to bonds. Anyone who puts 100% of their money in a single asset class really just doesn't know what they are doing. There's many types of bonds, but for some reason lots of  people here think there's one bond that yields 1% annually, and they advised avoiding that.",
        "created_utc": 1624200314,
        "id": "h2flg7h",
        "permalink": "/r/investing/comments/o409x8/investing_in_bonds_is_it_worth_it_and_why/h2flg7h/",
        "score": 55,
        "subreddit": "investing",
        "created": 1624229114.0
    },
    {
        "author": "wrighterjw10",
        "body": "This...but also, why do people keep acting like AAPL hasn't had solid returns 12mm??  A year ago, it was trading at about $88 a share.    \n53% returns in 12 months is making investors \"curious\"?  Would you pass on a 52% return over the next 12 months?  \nStop these posts.",
        "created_utc": 1623176777,
        "id": "h123z4d",
        "permalink": "/r/stocks/comments/nv506l/the_curious_case_of_aapl/h123z4d/",
        "score": 55,
        "subreddit": "stocks",
        "created": 1623205577.0
    },
    {
        "author": "RipInPepz",
        "body": "Sell now, buy and make huge gains, and buy Apple back at a discount after gme/amc crash the market. Win win.",
        "created_utc": 1624999930,
        "id": "h3hexod",
        "permalink": "/r/Wallstreetbetsnew/comments/oabphe/sell_apple_to_buy_amc_your_thoughts/h3hexod/",
        "score": 54,
        "subreddit": "Wallstreetbetsnew",
        "created": 1625028730.0
    },
    {
        "author": "Onetimebird13",
        "body": "Amazon, Tencent, Facebook, Microsoft, Baba, Lowes, Honeywell, Nvidia, Qualcomm, Apple, MercadoLibre, Etsy, Shopify, Visa, PayPal, Zscaler, Brookfield Assest, Nextera Energy, Abbvie, Vertex Pharma, Match, blizzard, T-Mobile, TD bank, Blackrock, Adobe, Unity, Autodesk, Macerich",
        "created_utc": 1623626743,
        "id": "h1oa3gy",
        "permalink": "/r/ValueInvesting/comments/nz8m0q/you_have_500k_and_you_have_to_build_a_portfolio/h1oa3gy/",
        "score": 46,
        "subreddit": "ValueInvesting",
        "created": 1623655543.0
    },
    {
        "author": "flobbley",
        "body": "Autodesk\n\nIt's not new and it's not super exciting tech or anything, but they're super ingrained into everything Civil Engineering and 3D modeling for design purposes. That and the stock is currently pretty reasonably priced.",
        "created_utc": 1622737981,
        "id": "h0ggzi9",
        "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/h0ggzi9/",
        "score": 34,
        "subreddit": "stocks",
        "created": 1622766781.0
    },
    {
        "author": "alialiali_bingo",
        "body": "$BSY and $ADSK on CAD side. There software is used to design, construction and maintenance of those infrastructure projects.",
        "created_utc": 1624583089,
        "id": "h2y029k",
        "permalink": "/r/stocks/comments/o788gl/what_bidens_1t_infrastructure_bill_really_is_less/h2y029k/",
        "score": 22,
        "subreddit": "stocks",
        "created": 1624611889.0
    },
    {
        "author": "Paulbo83",
        "body": "I use autodesk products every day for work and interned there in college. That is a money making machine right there",
        "created_utc": 1622742981,
        "id": "h0gt3kk",
        "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/h0gt3kk/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1622771781.0
    },
    {
        "author": "0ddb4l1",
        "body": "unfortunately adsk is severely overpriced. I've been a holder since $140 but recently sold out at $288. With that being said, Autodesk isn't going anywhere but up long term.\n\nThey have some solid stuff in the works with Autodesk Build and will continue to acquire companies to achieve growth.\n\nI personally like $PCOR and RSTAY/RSTAF",
        "created_utc": 1622755031,
        "id": "h0hloxu",
        "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/h0hloxu/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1622783831.0
    },
    {
        "author": "StonkDoctor1000",
        "body": "RKT ADSK BABA VIAC JPM \n\nMeme\n\nChart\n\nChart and undervalued \n\nChart and undervalued \n\nBanks to announce cockbacks tom",
        "created_utc": 1624845892,
        "id": "h39yyz8",
        "permalink": "/r/wallstreetbets/comments/o94f94/what_are_your_moves_tomorrow_june_28_2021/h39yyz8/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1624874692.0
    },
    {
        "author": "resi5",
        "body": "I miss the days where you could torrent any piece of professional software and use a cracked code to install it. Bastards are milking money with the subscription model now.. I miss the glory days of pirating 🏴‍☠️\n\n$ADBE $ADSK 🚀",
        "created_utc": 1624331062,
        "id": "h2m1fxn",
        "permalink": "/r/wallstreetbets/comments/o540ge/what_are_your_moves_tomorrow_june_22_2021/h2m1fxn/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1624359862.0
    },
    {
        "author": "babaNK",
        "body": "AutoDesk has a shitload of software, not only AutoCad/Inventor",
        "created_utc": 1622755672,
        "id": "h0hnfs2",
        "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/h0hnfs2/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1622784472.0
    },
    {
        "author": "HorseLove19",
        "body": "Autodesk pretty much dominates the 2D modeling space I think. I used solidworks in school this year and it’s awesome, but applying for civil engineering they really want u to know 2D planning stuff like autocad and revit",
        "created_utc": 1622761248,
        "id": "h0hzhuq",
        "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/h0hzhuq/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1622790048.0
    },
    {
        "author": "Ripoldo",
        "body": "Software is the worst. Adobe, Autodesk, Microsoft office, I use these a lot and the only major changes they've made in decades are how it looks. I think half their employees must be icon desingers. And now that everything's subscription based they'll probably stop even doing that.",
        "created_utc": 1622906313,
        "id": "h0ozfdy",
        "permalink": "/r/stocks/comments/nsjp6c/microsoft_wins_us_antitrust_okay_for_16_billion/h0ozfdy/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1622935113.0
    },
    {
        "author": "faster-than-car",
        "body": "Bought: hasbro, Etsy, Autodesk.\n\nSold: crsr, msft.",
        "created_utc": 1623686109,
        "id": "h1qqsjy",
        "permalink": "/r/stocks/comments/nziwu6/rstocks_daily_discussion_monday_jun_14_2021/h1qqsjy/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1623714909.0
    },
    {
        "author": "rygo796",
        "body": "Computer Aided Engineering, CAE.\n\nHard to say if there's any particular standouts.  Entire industry with solid growth and \\*gasp\\* profitability.\n\nPTC, ADSK, ANSS are some of the big ones.  CDNS and SNPS for EDA.",
        "created_utc": 1624455090,
        "id": "h2rl01y",
        "permalink": "/r/stocks/comments/o642ov/whats_your_industry_and_which_stocks_in_that/h2rl01y/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1624483890.0
    },
    {
        "author": "Summebride",
        "body": "Autodesk is nice, but I always prefer Adobe in that category.  Autodesk is needed by very niche companies and departments.  But Adobe software is needed by basically everyone.  Market is way more broad.",
        "created_utc": 1622786036,
        "id": "h0jazk6",
        "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/h0jazk6/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1622814836.0
    },
    {
        "author": "lordjonas88",
        "body": "Autodesk",
        "created_utc": 1624669101,
        "id": "h324sa5",
        "permalink": "/r/wallstreetbets/comments/o7zxxb/lists_of_stocks_that_will_benefit_from_joe_bidens/h324sa5/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624697901.0
    },
    {
        "author": "JonskMusic",
        "body": "Exactly. I don't get it. I mean... photoshop is/was ubiquitous but. its pricey for people. There are people who want to make content and can't afford 50 a month for Premiere etc. Also Adobe has been teasing some really cool AI stuff for years.... but where is it? They haven't really done anything huge in a while.. Creative Cloud is okay.. but its clunky and people don't like paying subscription and they don't like dealing with millions of passwords on an enterprise level etc. Adobe could be great.. but they need to do something big.... although every lawyer on the planet uses Acrobat and calls it Adobe. \"Do you have adobe?\"... Yet acrobat itself is kind of clunky as well.   \n\n\nBut who is their rival? If you look it up.. None of those companies have much to do with creating content: \"Adobe's top competitors include SAP, Salesforce, DocuSign, Dropbox, Getty Images, Shutterstock, Apple, Microsoft, IBM and Autodesk. Adobe is a software company developing digital marketing and media solutions.\"",
        "created_utc": 1623511752,
        "id": "h1iveuq",
        "permalink": "/r/StockMarket/comments/ny6vzo/adobe_poised_for_breakout_im_long_and_adding/h1iveuq/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1623540552.0
    },
    {
        "author": "DontUseEris",
        "body": "Neither is for assemblage. The CAD (assemblage software) is either SolidWorks  or AutoDesk. \n\nChegg has the answers to a lot of the questions in the textbooks it also has 24/7 tutoring. \n\nWolfram Alpha can answer almost any math question. If you are willing to go pro, I will show you how it got the answer.",
        "created_utc": 1623608000,
        "id": "h1n93zo",
        "permalink": "/r/stocks/comments/nyqfzt/products_or_services_that_are_just_starting_gain/h1n93zo/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1623636800.0
    },
    {
        "author": "notbrokemexican",
        "body": "Wrote about this. Autodesk directly lobbies for an infrastructure bill since it benefits from both long term training and subscriptions. Some projects may take much longer than scheduled, resulting in bonus income for orgs like Autodesk.\n\nThey have also done interesting things like enter the water business through acquisitions like Innovyze.\n\nhttps://www.reddit.com/r/wallstreetbets/comments/mjcpfw/understanding_the_infrastructure_bill_the_federal/?utm_medium=android_app&amp;utm_source=share",
        "created_utc": 1624634738,
        "id": "h3067ko",
        "permalink": "/r/stocks/comments/o788gl/what_bidens_1t_infrastructure_bill_really_is_less/h3067ko/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624663538.0
    },
    {
        "author": "StonkDoctor1000",
        "body": "ADSK 300 eow.  Good technical setup.",
        "created_utc": 1624840187,
        "id": "h39ovjw",
        "permalink": "/r/wallstreetbets/comments/o94f94/what_are_your_moves_tomorrow_june_28_2021/h39ovjw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624868987.0
    },
    {
        "author": "RationalExuberance7",
        "body": "Great ideas. \n\nFor allocation, I’d say:\n\n49.5% Autodesk\n\n49.5% Alibaba\n\n1% everything else",
        "created_utc": 1623696340,
        "id": "h1rdq2e",
        "permalink": "/r/ValueInvesting/comments/nz8m0q/you_have_500k_and_you_have_to_build_a_portfolio/h1rdq2e/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1623725140.0
    },
    {
        "author": "babywhiz",
        "body": "They did buy out OriginPC back in 2019 as well, which is where we get our Engineering Workstations from (Thanks Autodesk). \n\nhttps://www.originpc.com/landing/2019/corsair-acquires-origin-pc/",
        "created_utc": 1623755662,
        "id": "h1u3v47",
        "permalink": "/r/wallstreetbets/comments/nzlwcy/crsr_dd_part_2_or_why_corsair_will_swallow_the/h1u3v47/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623784462.0
    },
    {
        "author": "faster-than-car",
        "body": "Autodesk",
        "created_utc": 1623823664,
        "id": "h1xuazl",
        "permalink": "/r/stocks/comments/o0rrts/stock_to_build_portfolio_around/h1xuazl/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1623852464.0
    },
    {
        "author": "SpreadTheGlutes",
        "body": "$V $ADSK are my two US holdings",
        "created_utc": 1623348800,
        "id": "h1b4ldy",
        "permalink": "/r/CanadianInvestor/comments/nwjtsh/daily_discussion_thread_for_june_10_2021/h1b4ldy/",
        "score": 0,
        "subreddit": "CanadianInvestor",
        "created": 1623377600.0
    },
    {
        "author": "flobbley",
        "body": "Autodesk\n\nIt's not new and it's not super exciting tech or anything, but they're super ingrained into everything Civil Engineering and 3D modeling for design purposes. That and the stock is currently pretty reasonably priced.",
        "created_utc": 1622737981,
        "id": "h0ggzi9",
        "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/h0ggzi9/",
        "score": 34,
        "subreddit": "stocks",
        "created": 1622766781.0
    },
    {
        "author": "Paulbo83",
        "body": "I use autodesk products every day for work and interned there in college. That is a money making machine right there",
        "created_utc": 1622742981,
        "id": "h0gt3kk",
        "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/h0gt3kk/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1622771781.0
    },
    {
        "author": "0ddb4l1",
        "body": "unfortunately adsk is severely overpriced. I've been a holder since $140 but recently sold out at $288. With that being said, Autodesk isn't going anywhere but up long term.\n\nThey have some solid stuff in the works with Autodesk Build and will continue to acquire companies to achieve growth.\n\nI personally like $PCOR and RSTAY/RSTAF",
        "created_utc": 1622755031,
        "id": "h0hloxu",
        "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/h0hloxu/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1622783831.0
    },
    {
        "author": "babaNK",
        "body": "AutoDesk has a shitload of software, not only AutoCad/Inventor",
        "created_utc": 1622755672,
        "id": "h0hnfs2",
        "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/h0hnfs2/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1622784472.0
    },
    {
        "author": "HorseLove19",
        "body": "Autodesk pretty much dominates the 2D modeling space I think. I used solidworks in school this year and it’s awesome, but applying for civil engineering they really want u to know 2D planning stuff like autocad and revit",
        "created_utc": 1622761248,
        "id": "h0hzhuq",
        "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/h0hzhuq/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1622790048.0
    },
    {
        "author": "Ripoldo",
        "body": "Software is the worst. Adobe, Autodesk, Microsoft office, I use these a lot and the only major changes they've made in decades are how it looks. I think half their employees must be icon desingers. And now that everything's subscription based they'll probably stop even doing that.",
        "created_utc": 1622906313,
        "id": "h0ozfdy",
        "permalink": "/r/stocks/comments/nsjp6c/microsoft_wins_us_antitrust_okay_for_16_billion/h0ozfdy/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1622935113.0
    },
    {
        "author": "Summebride",
        "body": "Autodesk is nice, but I always prefer Adobe in that category.  Autodesk is needed by very niche companies and departments.  But Adobe software is needed by basically everyone.  Market is way more broad.",
        "created_utc": 1622786036,
        "id": "h0jazk6",
        "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/h0jazk6/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1622814836.0
    }
]