[
    {
        "author": "an_PR",
        "body": "Never looked in details into it but doesn’t Blackrock and Vanguard do it to collect TER? If these go to zero, you loose your money as your ETF loose value, not them",
        "created_utc": 1628069182,
        "id": "h7npu77",
        "score": 4,
        "subreddit": "stocks",
        "created": 1628097982.0
    },
    {
        "author": "layelaye419",
        "body": "This has to be posted again, because bears atill haven't learned:\n\nThis economic data looks grim, I think to myself. This is the right move. I look to the cracked screen of my iPhone 5s. A single 6/19 SPY 200p. I take a deep breath, and swipe up to submit the order. As RobinHood's little animation shows the order completing, I suddenly black out.\n\nI come to in a gray room, fluorescent lights humming above. I'm upright in a metal chair, restrained, with my arms and legs zip-tied. The only feature in the room is what I assume to be a Bloomberg Terminal in front of me (I've never seen one in real life). There's so many screens. It looks so professional. A dizzying array of charts, numbers and symbols light up its dozen monitors. In the center, the S&amp;P 500. 2700. Out of its bear market.\n\nI hear several sets of heavy footsteps approaching behind me. I try to look, but can't move much. I sense several burly men standing over my shoulders. To my surprise, Jerome Powell steps in front of me. I try to speak up but he cuts me off. \"What am I-\"\n\n\"Why did you short the domestic market?\" he asks.\n\n\"Huh?\" I respond, confused.\n\n\"Why did you short the domestic market?\" he demands, louder this time.\n\n\"I, uh... the coronavirus is a global pandemic. It's going to cause-\" WHAM! One of the thugs behind me slams my head with something heavy. It's a bundle of $100 bills. They're still warm from the printing press, and the fresh smell of ink fills my nose. It must be a million or more.\n\n\"It's priced in,\" he says coolly. \"So why did you short the domestic market?\"\n\nDizzy from the blow, I notice the screen behind the Chairman. The S&amp;P has climbed back to 2850. Impossible, I think to myself. \"Be-be-because unemployment is approaching 20 percent!\" I manage to answer. WHAM! Another blow strikes me. This time, a heavy bag filled with paper. It explodes on impact, raining bond certificates like confetti all over the small room. I catch a glimpse of some as they float to the ground. Investment grade bonds from Ford. Loans to cruise ship companies. Loans to a taco truck.\n\n\"Repeat after me: stocks only go up,\" Powell demands.\n\nI say nothing. On the terminal behind him, the S&amp;P has climbed well over 3000. An involuntary guh escapes my mouth as it falls agape.\n\nPowell frowns and continues, \"I'll ask you one more time: why did you short the domestic market?\"\n\nI feel like I'm going to pass out again, but with all the strength I can muster I shout, \"GDP declines are going to dwarf the Great Depression! The outbreak is far from over! Stimulating demand won't work if there's no supply! Social unrest is a real possibility! We're in uncharted ter-\" the hardest slam yet hits the back of my skull. It's a massive stack of printer paper. It falls to the floor with a thud. Some sort of Excel spreadsheet is on it. It's the Fed's balance sheet. It must be tens of thousands of pages long. I can't even count how many digits are in their asset balance.\n\n\"Stocks only go up,\" Powell repeats. Behind him, the chart shows the S&amp;P has continued its rise at a blistering pace. It leaves 3300 in the dust, making new all time highs.\n\nThe first two blows to my head left me feeling woozy. The third one, though, brought sudden clarity. Tears well up in my eyes, but they are not tears of sadness as my puts become worthless - oh no. They are tears of joy. Suddenly, I see it. Suddenly, the truth rings out as clearly as if a chorus of angels has descended from Heaven to sing it into my ears. How could I have been so wrong all these years? In this moment, I am enlightened. The pieces fall into place.\n\n\"Stocks only go up,\" I say.",
        "created_utc": 1630349932,
        "id": "hayns56",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630378732.0
    },
    {
        "author": "luxtwin",
        "body": "RGGI  \n\\*Robotics company - CEO's prior company AutoGuide AGVs sold to Teradyne for 165m while doing 4m in revenues.  This has similar products.  \n\\*Autonomous disinfecting robot on the market, and a second version launching soon during Covid-19 delta variants.  \n\\*4 products launching between now and Q4/Q1 2022, tied to warehouse logistical robotics and smart goods and traffic management systems.  \n\\*58m unrestricted - nice share structure.  Company funded with notes that convert at .15, 500% upside.  \n\\*4 months of accumulation at current price range, low volume and under the radar.  \nIndependent research report with a ton of good info just released: \n\n[https://drive.google.com/file/d/1QaNw2iLkl3X2R\\_qrolCd09aOSx788bC0/view](https://drive.google.com/file/d/1QaNw2iLkl3X2R_qrolCd09aOSx788bC0/view)",
        "created_utc": 1629127634,
        "id": "h9615dm",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1629156434.0
    },
    {
        "author": "WFCtothemoon",
        "body": "it's a difference in like 0,07% TER per year...does not really matter that much",
        "created_utc": 1628690633,
        "id": "h8j9zat",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628719433.0
    },
    {
        "author": "onemorecard",
        "body": "Feels like puts is the way for now. Made some good money from Chinese sell off, now time to shop around.\n\nThoughts on Paypal or Teradyne?",
        "created_utc": 1629378675,
        "id": "h9j1oxc",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629407475.0
    },
    {
        "author": "Euso36",
        "body": "What about Teradyne? TER test semiconductors so they're a service to semiconductor companies. Only 20bn market cap at present so long way to go if you ask me.",
        "created_utc": 1630055836,
        "id": "hajabeq",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630084636.0
    },
    {
        "author": "Zannierer",
        "body": "Because the average annual index growth in the last decade is 1-2% lower than interest rate and the decade before that was very volatile with a high P/E crash, thus for a long time it's not worth the risk. There should be a reason for underperformance, so I'm trying to take a hard look at those books and see what I can take away for my case and what can't.\n\nEdit: E1VFVN30 has TER of 0.8%, while the rest takes 1.5 to 2 times more. A common theme is either their NAV are too small, or they are new. Indexing is indeed the future, I just don't know when local investors catch on.",
        "created_utc": 1630453744,
        "id": "hb4fz5b",
        "score": 2,
        "subreddit": "investing",
        "created": 1630482544.0
    },
    {
        "author": "mo_faraway",
        "body": "What's the Contemporary Art Index and what's the TER?",
        "created_utc": 1629380806,
        "id": "h9j65u9",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1629409606.0
    },
    {
        "author": "ITM_ENRON_CALLS",
        "body": "Since animals can carry Covid and I look forward for one of these companies coming out with a Covid 19 shot for dogs and cats.  It will be a nice boo$ter 😏",
        "created_utc": 1628888296,
        "id": "h8txoz4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628917096.0
    },
    {
        "author": "Candy6132",
        "body": "I personally bet on nickel, as one of the biggest surge potential. Nickel is going to play the vital rolne in lithium-ion batteries, as it's one of the best ingredients for [cathode.It](https://cathode.It) is one of the biggest concerns of Elon Musk on his mission to have 1TWH battery production.[https://arstechnica.com/cars/2020/09/heres-what-tesla-will-put-in-its-new-batteries/](https://arstechnica.com/cars/2020/09/heres-what-tesla-will-put-in-its-new-batteries/)\n\nAnother metal is cobalt, though there's only a few stocks mining it and it's quite volatile market. Most of the cobalt is mined in Congo. The mining situation is unstable, and there are some conflicts around it. That's why there's no good ETF for cobalt miners so far.\n\nCopper had a surge recently and it's difficult for me to predict it. I think, I've missed this train.\n\nAbout energy production: Developed countries declare to 0 CO2 emission within few decades. That means switching to renewable energy sources. I don't see wind and solar playing big role in it, unlkie atomic energy. Some experts say there's going to be another uranium boom in the market. The facts are encouraging:  \ncurrent uranium price: 31,70 USD/lb  \ntotal uranium mining cost is around 60 USD/lb  \nammount of uranium to be used by utilities in 2021: 200 mln lbs  \nammount of uranium to be mined in 2021: 150 mln lbs  \nCurrent gap is covered by stock and disarming nuclear weapons. It is estimated, that these stock will go down by 50% over next 10 years.\n\n[https://www.virginiauranium.com/uranium-101/uranium-market-u-s-uranium-sources/](https://www.virginiauranium.com/uranium-101/uranium-market-u-s-uranium-sources/)\n\n17th june there was a new fund launched by Sprott Money - U.U or U.UN. The fund holds physical uranium in form of U3O8 or Yellowcake. The fund has 0,35 TER and is accesible via TSX.[https://sprott.com/investment-strategies/physical-commodity-funds/uranium/](https://sprott.com/investment-strategies/physical-commodity-funds/uranium/)",
        "created_utc": 1628863078,
        "id": "h8s8i4n",
        "score": 1,
        "subreddit": "investing",
        "created": 1628891878.0
    },
    {
        "author": "SuzyCreamcheezies",
        "body": "Some CEOs have speculated 18-24 months for legalization, so there's your timeframe. And aside from CGC and their agreements with TER/ACRG, I'm going to assume that conversation between other LPs and American companies are well under way. Just because Irwin didn't call up Ben Kovler to opine over his plans, does *not* mean they don't have one.\n\nThe rest of your thesis, about anyone waltzing in and becoming a cannabis company after legalization, is a cop out. Of course that is true. Amazon could buy their way into any state and dominate if they wanted to. But they haven't said their intentions were to do so, while some LPs have, once they are legally permitted.... how is that misleading?",
        "created_utc": 1629140511,
        "id": "h96y01d",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1629169311.0
    },
    {
        "author": "BrIDo88",
        "body": "1. A long term analyses of global diversified equity indexes vs actively managed funds aiming to beat those indexes will also demonstrate the same point. The overwhelming majority of actively managed funds do not beat the index they are benchmarked against after fees. That includes global equities. \n\n2. Following on from point 1, the comparison is valid and depends really on which index the active fund is benchmarked against. Many, many active funds aim to out perform “X” index and the data shows they fail to do so, after fees, over the long term. To your point if an investor was considering an activity managed fund that tracked global stocks - Janus Henderson Global Equity Fund that comes with a 0.85% TER - the evidence suggests he or she would have great returns by investing in a global equities tracker with a TER of 0.15% and get the same exposure but 5x cheaper. It does not matter to the investor if the manager, on paper, actually achieves their goal if the investor is still worse off!\n\n3. Your point about volatility. It’s a metric, for sure. But it’s importance is down to the investor and their risk tolerance. If reducing volatility was an issue the traditional thing to do would be to reduce equity exposure and increase bond exposure. As a comparison of active funds vs index trackers, sure it may be important to some people but long term investors will only care about the performance and their gains.  \n\n3. RE rising tides. You are exactly right. Active funds are let off the hook in a long term bull market. Again why pay them extra fees when they’re playing in easy mode. Again, how do you know who will steer the ship through troubled waters? You don’t, you can’t. It’s a guess. The data supporting index trackers goes back to the turn of the century, evidenced by data collection and the miracle of modern computing.",
        "created_utc": 1629143342,
        "id": "h9752pj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629172142.0
    },
    {
        "author": "dimonoid123",
        "body": "I just checked, as of December 31st, swap fee was 0.17%, it says up to 0.3%.\n\nSo, TER(which includes both MET and swap fee) for \n\nHSH is 0.28%\nHXS is 0.27%\n\nBut it may has changed so far, I couldn't find more recent information.",
        "created_utc": 1629599623,
        "id": "h9v3nrf",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1629628423.0
    },
    {
        "author": "captain_uranus",
        "body": "Idk why you're telling me- I got exactly what you meant. \n\nJust wasn't a fan of your such hard-hitting analysis (/s) that NVDA and AMD are the best semi-plays- yeah no shit. Better plays right now imo would be on the supply-side where a lot of those stocks (AMAT, KLAC, TER, MU) have traded sideways for months and undervalued semi supply-side tickers like AMKR, ASX, PLAB, SWKS.",
        "created_utc": 1630070424,
        "id": "hajx7r4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630099224.0
    },
    {
        "author": "mountainsprout1735",
        "body": "Teradyne also heading for an intra-day high! Hope this sets it up for a multi-day run. $TER",
        "created_utc": 1630349696,
        "id": "hayn7o6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630378496.0
    },
    {
        "author": "tradri3",
        "body": "Interesting.\n\nTo me EMVL looks more attractive. (Also has half the TER)",
        "created_utc": 1628130207,
        "id": "h7r9fk4",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1628159007.0
    },
    {
        "author": "Meneenz",
        "body": "&gt;it's got an MER of 0.16\n\nIt's more than that, when you include the TER.",
        "created_utc": 1628915193,
        "id": "h8vhnik",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1628943993.0
    },
    {
        "author": "okay_thatworks",
        "body": "TER gets another backer",
        "created_utc": 1628598231,
        "id": "h8ehrsz",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1628627031.0
    },
    {
        "author": "ParsimonCapital",
        "body": "I like your question as I am preparing a post at the moment on which global equity benchmark to select for benchmarking my own performance, a.o.. Please let the community know what you have decided and why, I would be interested to know. From where I am standing, both seem perfectly fine as a core equity investment for your portfolio.\n\nSWDA is high on my list as I know that I like MSCI's approach to index construction (frankly, I am just less familiar with SolActive so simply haven't done DD yet). Further, I believe that any passive investment in the stock market should be cap-weighted so that disqualifies TGGB (once again, I am looking at indices for benchmarking purposes, as I actually may like equal-weighted better to invest in).\n\nEqual weighted has its obvious merits, but note that such a weighting scheme works best when there is some mean reversion in share price. The last decade, betting on mean reversion has been a losing strategy as large firms (e.g., US tech) just became bigger and bigger. There are some fundamental reasons behind this (e.g., ineffective competition regulation, tax avoidance, bargaining power of large firms vs suppliers, consumers and the government) that are the driver of this, which may not subside soon.\n\nApart from the weighting scheme:\n\n\\- Both have same TER\n\n\\- SWDA allows securities lending, which may introduce unwanted risk to you. TGGB does not.\n\n\\- SWDA is massive and TGGB, with EUR 300m in assets, is rather mid-size. This may impact liquidity and the breadth and liquidity of any derivatives referencing the EFT. Also, if TGGB may not grow to the potential the manager wants it, they may discontinue the product. \n\n\\- Both don't seem to have a large replication error, but not that TGGB only has about 1 year of realized performance to prove that.\n\nGood luck choosing!",
        "created_utc": 1629495785,
        "id": "h9pr3gk",
        "score": 1,
        "subreddit": "investing",
        "created": 1629524585.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 31st of August\n\n\n\n## Upcoming events for Tuesday, August 31st\n\n - Stock splits:\n\n    - ACST @ **1:8**\n    - YLD @ **2:1** (Payable date: 08/30/2021)\n    - STG @ **2:25**\n\n - Expected earnings:\n\n  AENZ, AMBA, AMWD, BNR, BOSC, CAL, CHS, CHSCP, CNTB, CRESY, CRWD, DAO, DBI, FUTU, GGAL, HYW, LEJU, NTES, NYXH, ONE, PLAN, PVH, PYCR, THCA, TRIB\n\n - Ex-div:\n\n  AEM, ASB, ASH, AVY, BCC, BGFV, BLL, BRKR, BSY, BWA, CCNE, CCS, CDK, COWN, CRWS, CWEN, CWEN.A, CXP, EA, EBAY, EMCF, ESI, ESNT, FBC, FF, FFBC, FNCB, FORTY, FOX, FOXA, GCMG, GHL, GPI, GS, HAL, HAYN, HBB, HQI, HTLD, HY, IBKR, IPG, ITIC, JNPR, K, KHC, KRNY, LCNB, LMT, MCD, MCK, MGEE, MLM, MOFG, MTB, MVBF, NBTB, NNI, NPO, NTST, NVDA, O, ODFL, ONB, OPOF, ORI, PAHC, PANL, PFBI, PFG, PII, PINC, PRGS, PTVE, SAFT, SBGI, SF, SLB, SLGN, SSNC, STAR, TAC, TER, TRMK, TSN, TW, UFPI, UHS, VINP, VIRT, WEN, WMS, WTS, ZEUS\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (consensus: -2.833M, previous: -1.622M)\n    - CB Consumer Confidence (consensus: 124.0, previous: 129.1)\n    - Chicago PMI (consensus: 68.0, previous: 73.4)\n    - Dallas Fed Services Revenues (previous: 21.7)\n    - House Price Index (previous: 1.7%)\n    - House Price Index (previous: 18.0%)\n    - House Price Index (previous: 337.4)\n    - Redbook (previous: 16.6%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 18.5%, previous: 17.0%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 2.1%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.8%, previous: 1.8%)\n    - Texas Services Sector Outlook (previous: 33.3)\n\n## Upcoming events for Wednesday, September  1st\n\n - Expected earnings:\n\n  AI, ASAN, AURC, BF.A, BF.B, CHPT, CHWY, CONN, CPB, CPRT, CULP, DAKT, DY, EBR, EBR.B, EGAN, FIVE, GEF, GEF.B, GOTU, HEPA, LITB, MESO, MTRX, NCNO, NEWP, NTNX, OKTA, PHR, REX, RYAN, SMTC, SPWH, SWBI, VEEV, VRA, XIN\n\n - Ex-div:\n\n  ESBK, FAM, FCT, FDEU, FEI, FIF, FIV, FLNG, FMY, FPF, FPL, FSD, FTHY, HD, HLI, IGD, ITUB, KRO, LEA, LZB, MOS, NL, PAX, PTEN, QCOM, RAND, RCKY, RMBI, SSTK, VHI, VNT, WSR\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 625K, previous: 330K)\n    - Construction Spending (consensus: 0.2%, previous: 0.1%)\n    - Crude Oil Imports (previous: 0.426M)\n    - Crude Oil Inventories (consensus: -2.833M, previous: -2.979M)\n    - Cushing Crude Oil Inventories (previous: 0.070M)\n    - Distillate Fuel Production (previous: 0.140M)\n    - EIA Refinery Crude Runs  (previous: 0.066M)\n    - EIA Weekly Distillates Stocks (consensus: -0.600M, previous: 0.645M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.3%, previous: 0.2%)\n    - FOMC Member Bostic Speaks\n    - Gasoline Inventories (consensus: -1.700M, previous: -2.242M)\n    - Gasoline Production (previous: 0.249M)\n    - Heating Oil Stockpiles (previous: -0.299M)\n    - ISM Manufacturing Employment (previous: 52.9)\n    - ISM Manufacturing New Orders Index (previous: 64.9)\n    - ISM Manufacturing PMI (consensus: 58.7, previous: 59.5)\n    - ISM Manufacturing Prices (consensus: 83.8, previous: 85.7)\n    - MBA 30-Year Mortgage Rate (previous: 3.03%)\n    - MBA Delinquency Rates (previous: 5.47%)\n    - MBA Mortgage Applications (previous: 1.6%)\n    - MBA Purchase Index (previous: 257.5)\n    - Manufacturing PMI (previous: 61.2)\n    - Mortgage Market Index (previous: 737.1)\n    - Mortgage Refinance Index (previous: 3,520.7)\n    - Total Vehicle Sales (previous: 14.80M)\n\n## Upcoming events for Thursday, September  2nd\n\n - Expected earnings:\n\n  AEO, AVGO, BNED, BRC, BYSI, CCEP, CIEN, COO, CTHR, CTLP, DCI, DLNG, DLTH, DOCU, DOOO, EYES, FEDU, FFHL, GCO, GHG, GIII, GMS, GWRE, HOFT, HOLI, HPE, HRL, INM, JOAN, JW.A, JW.B, KFY, KIRK, LAW, LE, MCFT, MDB, MDLA, MEI, MEIP, MSON, NM, NNA, NX, OOMA, OXM, PD, PDCO, REDU, SAIC, SCWX, SECO, SIG, SINO, SQBG, TLYS, TTC, TUEM, VEON, WVFC, YEXT\n\n - Ex-div:\n\n  AFB, AGR, AJG, AMNB, AROW, BAX, BBD, BBDO, BBL, BF.A, BF.B, BHP, BOTJ, BRKS, CASS, CHRW, D, EBC, EBIX, FAT, FATBB, FDX, FFIC, FFNW, FLO, FNB, FRME, GAIN, GOLF, GPC, HBM, ICBK, KNX, LCII, LHX, LIN, MBCN, MBWM, MLI, MLR, NAVI, OBT, OTEX, OUT, PEBK, PEP, PRGO, PWP, PXD, RMR, SEE, SLM, SOR, SQM, STE, STRA, SU, SVBI, TILE, TRST, TT, UFCS, ULH, WHG, WM, WY\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.035%)\n    - 8-Week Bill Auction (previous: 0.060%)\n    - Challenger Job Cuts (previous: 18.942K)\n    - Continuing Jobless Claims (consensus: 2,775K, previous: 2,862K)\n    - Durables Excluding Defense (previous: -1.2%)\n    - Exports (previous: 207.70B)\n    - FOMC Member Bostic Speaks\n    - Factory Orders (consensus: 0.4%, previous: 1.5%)\n    - Factory orders ex transportation (previous: 1.4%)\n    - Imports (previous: 283.40B)\n    - Initial Jobless Claims (consensus: 345K, previous: 353K)\n    - Jobless Claims 4-Week Avg. (previous: 366.50K)\n    - Natural Gas Storage (previous: 29B)\n    - Nonfarm Productivity (consensus: 2.4%, previous: 2.3%)\n    - Trade Balance (consensus: -71.00B, previous: -75.70B)\n    - Unit Labor Costs (consensus: 1.0%, previous: 1.0%)\n\n## Upcoming events for Friday, September  3rd\n\n - Stock splits:\n\n    - SPLIF @ **1:20**\n\n - Expected earnings:\n\n  AHPI, ATXI, BHAT, CIDM, CJJD, CREG, CXDC, DSS, ENVB, HURC, INTG, JP, MVST, PBFS, PFSW, PVL, SCX, SFUN, TDAC, VWE\n\n - Ex-div:\n\n  AIN, AMKR, ANAT, ASX, AVT, CBSH, EFX, ESCA, FANH, HIHO, HWC, III, LOB, NFE, PBIP, PWOD, QIWI, ROST, SQFT, TFSL, TPR, UI, UNF\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.0%, previous: 4.0%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.4%)\n    - Average Weekly Hours (consensus: 34.8, previous: 34.8)\n    - CFTC Aluminium speculative net positions (previous: 3.9K)\n    - CFTC Copper speculative net positions (previous: 8.6K)\n    - CFTC Corn speculative net positions (previous: 331.0K)\n    - CFTC Crude Oil speculative net positions (previous: 374.3K)\n    - CFTC Gold speculative net positions (previous: 210.7K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -2.4K)\n    - CFTC Natural Gas speculative net positions (previous: -166.6K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 14.9K)\n    - CFTC Silver speculative net positions (previous: 21.9K)\n    - CFTC Soybeans speculative net positions (previous: 101.6K)\n    - CFTC Wheat speculative net positions (previous: 35.0K)\n    - Government Payrolls (previous: 240.0K)\n    - ISM Non-Manufacturing Business Activity (consensus: 62.5, previous: 67.0)\n    - ISM Non-Manufacturing Employment (previous: 53.8)\n    - ISM Non-Manufacturing New Orders (previous: 63.7)\n    - ISM Non-Manufacturing PMI (consensus: 61.8, previous: 64.1)\n    - ISM Non-Manufacturing Prices (previous: 82.3)\n    - Manufacturing Payrolls (consensus: 28K, previous: 27K)\n    - Markit Composite PMI (previous: 55.4)\n    - Nonfarm Payrolls (consensus: 728K, previous: 943K)\n    - Participation Rate (previous: 61.7%)\n    - Private Nonfarm Payrolls (consensus: 610K, previous: 703K)\n    - Services PMI (previous: 55.2)\n    - U.S. Baker Hughes Oil Rig Count (previous: 405)\n    - U.S. Baker Hughes Total Rig Count (previous: 503)\n    - U6 Unemployment Rate (previous: 9.2%)\n    - Unemployment Rate (consensus: 5.2%, previous: 5.4%)\n\n^^^^2021-08-31",
        "created_utc": 1630404016,
        "id": "hb1ezsy",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1630432816.0
    },
    {
        "author": "reddit-is-sus666",
        "body": "ASE Technology. Lam Research. Micron Technology. Qualcomm. Skyworks. Teradyne. And Taiwan Semiconductor  Manufacturing, which is the blood for all semi companies lol",
        "created_utc": 1629040627,
        "id": "h91f0sv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629069427.0
    },
    {
        "author": "jeffreynoyes001",
        "body": "Teradyne needs to go on a moon mission",
        "created_utc": 1629294926,
        "id": "h9eqx49",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1629323726.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 30th of August\n\n\n\n## Upcoming events for Monday, August 30th\n\n - Expected earnings:\n\n  ADMP, AKTS, AKU, AYTU, BPT, CAN, CEA, CIH, CLDR, CO, CTK, CTLT, DADA, DDL, GBRG, GENE, GWGH, HHLA, IFMK, IROQ, JOBS, LI, LIZI, LUB, NAT, NDSN, NEW, ONVO, PME, SMIT, SNP, SOL, STNE, TENX, TLK, ZM, ZNH\n\n - Ex-div:\n\n  ABTX, ACNB, ADC, AGNC, ALL, ARGO, AVAL, AY, BAM, BBU, BEP, BEPC, BIP, BIPC, BOH, BRMK, CABO, CFR, CODI, CPF, CR, CRAI, CRI, CRS, CRT, CSX, CTT, DNP, DOV, DOW, EAF, EFC, EL, EPR, ERF, EURN, FT, GLW, GRP.U, HUBB, KEY, KINS, KNSL, MARPS, MLAB, MNSO, NC, NETI, NOA, NWL, ORC, PBT, PFIS, POWI, PRT, PVL, RLI, SCL, SCM, SLG, SPB, STAG, STEP, TNC, TPVG, TSLX, UBOH, UNP\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.055%)\n    - 6-Month Bill Auction (previous: 0.050%)\n    - Dallas Fed Mfg Business Index (previous: 27.3)\n    - Investing.com Gold Index (actual: 56.2%, previous: 58.9%)\n    - Investing.com S&amp;P 500 Index (actual: 39.4%, previous: 48.2%)\n    - Pending Home Sales (consensus: 0.4%, previous: -1.9%)\n    - Pending Home Sales Index (previous: 112.8)\n\n## Upcoming events for Tuesday, August 31st\n\n - Stock splits:\n\n    - YLD @ **2:1** (Payable date: 08/30/2021)\n    - STG @ **2:25**\n\n - Expected earnings:\n\n  AENZ, AMBA, AMWD, BNR, BOSC, CAL, CHS, CHSCP, CMCM, CNTB, CRESY, CRWD, DAO, DBI, FUTU, GGAL, HYW, LEJU, NTES, NYXH, ONE, PLAN, PVH, PYCR, THCA, TIGR, TRIB\n\n - Ex-div:\n\n  AEM, ASB, ASH, AVY, BCC, BGFV, BLL, BRKR, BSY, BWA, CCNE, CCS, CDK, COWN, CRWS, CWEN, CWEN.A, CXP, EA, EBAY, EMCF, ESI, ESNT, FBC, FF, FFBC, FNCB, FORTY, FOX, FOXA, GCMG, GHL, GPI, GS, HAL, HAYN, HBB, HQI, HTLD, HY, IBKR, IPG, ITIC, JNPR, K, KHC, KRNY, LCNB, LMT, MCD, MCK, MGEE, MLM, MOFG, MTB, MVBF, NBTB, NNI, NPO, NTST, NVDA, O, ODFL, ONB, OPOF, ORI, PAHC, PANL, PFBI, PFG, PII, PINC, PRGS, PTVE, SAFT, SBGI, SF, SLB, SLGN, SSNC, STAR, TAC, TER, TRMK, TSN, TW, UFPI, UHS, VINP, VIRT, WEN, WMS, WTS, ZEUS\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -1.622M)\n    - CB Consumer Confidence (consensus: 124.0, previous: 129.1)\n    - Chicago PMI (consensus: 68.0, previous: 73.4)\n    - Dallas Fed Services Revenues (previous: 21.7)\n    - House Price Index (previous: 1.7%)\n    - House Price Index (previous: 18.0%)\n    - House Price Index (previous: 337.4)\n    - Redbook (previous: 16.6%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 18.6%, previous: 17.0%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 2.1%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.7%, previous: 1.8%)\n    - Texas Services Sector Outlook (previous: 33.3)\n\n## Upcoming events for Wednesday, September  1st\n\n - Expected earnings:\n\n  AI, ASAN, BF.A, BF.B, CHPT, CHWY, CONN, CPB, CPRT, CULP, DY, EBR, EBR.B, EGAN, FIVE, GEF, GEF.B, GOTU, HEPA, LITB, MTRX, NCNO, NTNX, OKTA, PHR, REX, RYAN, SMTC, SPWH, SWBI, VEEV, VRA, XIN\n\n - Ex-div:\n\n  ESBK, FAM, FCT, FDEU, FEI, FIF, FIV, FLNG, FMY, FPF, FPL, FSD, FTHY, HD, HLI, IGD, ITUB, KRO, LEA, LZB, MOS, NL, PAX, PTEN, QCOM, RAND, RCKY, RMBI, SSTK, VHI, VNT, WSR\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 638K, previous: 330K)\n    - Construction Spending (consensus: 0.3%, previous: 0.1%)\n    - Crude Oil Imports (previous: 0.426M)\n    - Crude Oil Inventories (consensus: -2.683M, previous: -2.979M)\n    - Cushing Crude Oil Inventories (previous: 0.070M)\n    - Distillate Fuel Production (previous: 0.140M)\n    - EIA Refinery Crude Runs  (previous: 0.066M)\n    - EIA Weekly Distillates Stocks (consensus: -0.271M, previous: 0.645M)\n    - EIA Weekly Refinery Utilization Rates (previous: 0.2%)\n    - FOMC Member Bostic Speaks\n    - Gasoline Inventories (consensus: -1.557M, previous: -2.242M)\n    - Gasoline Production (previous: 0.249M)\n    - Heating Oil Stockpiles (previous: -0.299M)\n    - ISM Manufacturing Employment (previous: 52.9)\n    - ISM Manufacturing New Orders Index (previous: 64.9)\n    - ISM Manufacturing PMI (consensus: 58.5, previous: 59.5)\n    - ISM Manufacturing Prices (consensus: 84.0, previous: 85.7)\n    - MBA 30-Year Mortgage Rate (previous: 3.03%)\n    - MBA Delinquency Rates (previous: 5.47%)\n    - MBA Mortgage Applications (previous: 1.6%)\n    - MBA Purchase Index (previous: 257.5)\n    - Manufacturing PMI (previous: 61.2)\n    - Mortgage Market Index (previous: 737.1)\n    - Mortgage Refinance Index (previous: 3,520.7)\n    - Total Vehicle Sales (previous: 14.80M)\n\n## Upcoming events for Thursday, September  2nd\n\n - Expected earnings:\n\n  AEO, AVGO, AZRE, BNED, BRC, BYSI, CCEP, CIEN, COO, CTHR, CTLP, DCI, DLNG, DLTH, DOCU, DOOO, EYES, FEDU, FFHL, GCO, GHG, GIII, GMS, GWRE, HOFT, HOLI, HOV, HPE, HRL, HUIZ, INM, JOAN, JW.A, JW.B, KFY, KIRK, LAW, LE, MCFT, MDB, MDLA, MEI, MEIP, MSON, NM, NNA, NX, OOMA, OXM, PD, PDCO, REDU, SAIC, SCWX, SECO, SIG, SINO, SQBG, TLYS, TTC, TUEM, VEON, WVFC, YEXT\n\n - Ex-div:\n\n  AFB, AGR, AJG, AMNB, AROW, BAX, BBD, BBDO, BBL, BF.A, BF.B, BHP, BOTJ, BRKS, CASS, CHRW, D, EBC, EBIX, FDX, FFIC, FFNW, FLO, FNB, FRME, GAIN, GOLF, GPC, HBM, ICBK, KNX, LCII, LHX, LIN, MBCN, MBWM, MLI, MLR, NAVI, OBT, OTEX, OUT, PEBK, PEP, PRGO, PWP, PXD, RMR, SEE, SLM, SOR, SQM, STE, STRA, SU, SVBI, TILE, TRST, TT, UFCS, ULH, WHG, WM, WY\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.035%)\n    - 8-Week Bill Auction (previous: 0.060%)\n    - Challenger Job Cuts (previous: 18.942K)\n    - Continuing Jobless Claims (previous: 2,862K)\n    - Durables Excluding Defense (previous: -1.2%)\n    - Exports (previous: 207.70B)\n    - FOMC Member Bostic Speaks\n    - Factory Orders (consensus: 0.3%, previous: 1.5%)\n    - Factory orders ex transportation (previous: 1.4%)\n    - Imports (previous: 283.40B)\n    - Initial Jobless Claims (consensus: 345K, previous: 353K)\n    - Jobless Claims 4-Week Avg. (previous: 366.50K)\n    - Natural Gas Storage (previous: 29B)\n    - Nonfarm Productivity (consensus: 2.4%, previous: 2.3%)\n    - Trade Balance (consensus: -70.90B, previous: -75.70B)\n    - Unit Labor Costs (consensus: 1.0%, previous: 1.0%)\n\n^^^^2021-08-30",
        "created_utc": 1630317614,
        "id": "hawte5c",
        "score": 0,
        "subreddit": "RobinHood",
        "created": 1630346414.0
    },
    {
        "author": "GME_retard-rocket",
        "body": "pre•pos•ter•ous!",
        "created_utc": 1629168615,
        "id": "h98qsuc",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1629197415.0
    }
]