[
    {
        "author": "stevoacp1",
        "body": "thinking of dumping my BABA shares. it has been nothing but a disappointment lately. CCP fucked my boy Jack Ma and my portfolio",
        "created_utc": 1614703913,
        "id": "gpfjxgl",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614732713.0
    },
    {
        "author": "dikbutt4lyfe",
        "body": "40 shares @ $27.50 limit buy set. If it dips back to MA like you say, I'm in! Otherwise I think I missed this ship",
        "created_utc": 1614707882,
        "id": "gpft1fy",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614736682.0
    },
    {
        "author": "TheFarau",
        "body": "To late to get RKT, sell yours and save your cash ma man. Most obvious pump ever",
        "created_utc": 1614712812,
        "id": "gpg4kbx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614741612.0
    },
    {
        "author": "Spartacus19845",
        "body": "5 day MA is below the 10 day MA on the SPY, the 10 day is crossing the 14 days...this is all looking to a rollover of the market in the near term.  Correction is here, yesterday was a head fake.",
        "created_utc": 1614709904,
        "id": "gpfxpkc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614738704.0
    },
    {
        "author": "RPVFlyer",
        "body": "Pushing to top of MA envelope. Let’s go!",
        "created_utc": 1614715035,
        "id": "gpg9qjj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614743835.0
    },
    {
        "author": "NPRjunkieDC",
        "body": "This applies to small and mid-cap too \n\nMy recommendation right now are \nNASDAQ CIDM + FLNT + PERI + HIMX + RWLK \n\nAlso mining in Lithium + copper + nickel + cobalt + manganese + rare earth + silver.  I have REEMF + REZZF + ALYI + TLOFF + ILHMF + SXOOF + UAMY + FCSMF + MLLOF + HNCKF + COCBF + MNGG + BMIX\n\nhttps://ragingbull.com/kb/how-to-make-money-with-penny-stocks/\n\nPennystocks can be a way to multiply your money but you can also lose it all. You should only put a small percentage of your portfolio on these cheap stocks .\n\nOtcmarkets.com you can see pennystocks that are being sold ,  up to date news by ticker + screener. Some stocks have warnings. \n\nUnbiastock.com shows you stocks that are trading last hour or 6-12-24.\n\nFinviz.com is a stock screener with many filters but only non-OTC .\n\nMy stock portfolio is a free app to monitor your portfolio .\n\nYou can also request email alerts from the ARK website with their daily trades of their extremely popular ETFs.\n\nTD Ameritrade lets you buy almost any stock.  RH and Webull don't allow OTC and most pennystocks are OTC. Fidelity also good but occasionally don't offer a stock. \n\nI trade 4-5 stocks daily but that is cuz I'm on my phone most of the day monitoring my 64 stock portfolio and seeing what others recommend or what is selling .\n\nThe general advice for pennystocks is to trade not invest . Occasionally you find a winner that you keep and might add to your holds. You make more money with several 20% short trades that add up over time vs chasing winners and losing money in the process. \n\nWe all make the mistake of getting in late, or selling too early . \n\nI don't do what some do like deeply research a company Sec filings , balance sheet etc. \n\nI go to Yahoo Finance free app and click View All. Check 50/200 MA + Float: ideally under 100M or much smaller.  Ideally the numbers at the bottom like earnings growth,  operating income,  EBITDA should be positive but rarely the case with pennystocks or companies that are growing. \n\nBillions of shares in a pennystock is a warning sign of a pump and dump, so is a price graph that has straight lines up, down and horizontal instead of the standard gradual curve .\n\nBefore a purchase I check Yahoo Finance conversations. You can see how much interest by number of new conversations.  Also good info from posters that know about the company.  Volume too is important.  Should be much higher than usual.\n\nI also go to Stocktwits for the same .\n\nSomeone pointed out that companies that price rises 100% in last year or months will probably keep going . This is very true in pennystocks. \n\nBut these sites + Reddit are full of pumpers and dumpers.  So read through the lines.\n\nFinally when a stock seems a winner by the point it crosses 100% for you many recoup investment.  I wait until 220-240% so I only have to sell 30% of stocks not 50%. This threshold usually happens in one day. A stock goes up gradually for days or weeks then suddenly flies. \n\nIf you are using RH or WB that don't allow pennystocks there is a subreddit r/RobinHoodPennyStocks .\nOn NASDAQ many options like CTRM + SNDL + DGLY + HIMX + CIDM + NOK + ATOM+ ENG \n\nhttps://www.allpennystocks.com/hotpennystocks/nsd.aspx",
        "created_utc": 1614712097,
        "id": "gpg2ve7",
        "score": 2,
        "subreddit": "investing",
        "created": 1614740897.0
    },
    {
        "author": "Salt-Chart3985",
        "body": "Your ma is a hoe",
        "created_utc": 1614714936,
        "id": "gpg9i1q",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614743736.0
    },
    {
        "author": "InTheMoneyAlex",
        "body": "Dump Curaleaf and hold more Cresco. I don’t like the inconsistency from Curaleaf and God awful edibles from NETA in MA. I’m going to buy MariMed which is a penny stock now but I see huge potential in the form of a buyout because they make amazing delicious edibles and deliver consistent high potency flowers. God knows Curaleaf’s got to get their shit together because if they think they’re selling good product now, God help them.",
        "created_utc": 1614703191,
        "id": "gpfi9k3",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1614731991.0
    },
    {
        "author": "Taru9595",
        "body": "DIRECTA non è male... Commissioni più basse in Italia, ed è una banca con sede a Torino. Portale nella media, ma tanto uso altri siti per guardare i grafici",
        "created_utc": 1614700113,
        "id": "gpfbctd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614728913.0
    },
    {
        "author": "StockDealer",
        "body": "&gt; I don't think the question is about the license, but rather why he has to appear before MA regulators.\n\nThat does not mean that *he's* the subject of an investigation. They could just be fact-finding, which would be very sensible.",
        "created_utc": 1614707584,
        "id": "gpfsciv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614736384.0
    },
    {
        "author": "ImActuallyUseless",
        "body": "CCP vs Jack Ma",
        "created_utc": 1614704162,
        "id": "gpfki84",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614732962.0
    },
    {
        "author": "Gixxxxxxx",
        "body": "Stay safe ma dude and never invest more than you’re willing to lose!",
        "created_utc": 1614713675,
        "id": "gpg6kt3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614742475.0
    },
    {
        "author": "FelWill",
        "body": "Yeah the boomer in me picked up mastercard and visa aswell",
        "created_utc": 1614708688,
        "id": "gpfuw09",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614737488.0
    },
    {
        "author": "BCR_Dane",
        "body": "Ma professed a me dit qu SPY va lever",
        "created_utc": 1614704193,
        "id": "gpfkktw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614732993.0
    },
    {
        "author": "schplat",
        "body": "I don't think the question is about the license, but rather why he has to appear before MA regulators.\n\nThe loss of license is perfectly reasonable, and he was delivering education at MM, so it's not like he was making trades for customers.  The appearance seems to be completely detached from the article, though.",
        "created_utc": 1614704758,
        "id": "gpflvm9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614733558.0
    },
    {
        "author": "ninjapenguin120",
        "body": "This  is fucking ridiculous. DFV has never made any pretense of giving financial advice here (he knows better). We just like the stock. We constantly make clear that you  should not build a portfolio based on what we do because we're  smooth-brained, crayon-eating fucking apes who don't even have an exit  strategy. We do that for a reason. Nobody lost money because of DFV. If  anyone who isn't a hedgie or an astroturf alias of one lost money, it's  because they followed self-described morons when they were openly  talking about how unsound their financial strategy was.\n\nI'll  tell you who does cause investors to lose money: the fucking hedges.  They find an easy target to fucking destroy, then they use strategies  like naked shorting, shit that should be illegal, to manipulate the  market and artificially inflate their short position, then destroy their  easy targets using lies and criminal behavior. They dredge up literal  fake news stories, feed it to the press, and those dumbasses somehow eat  the shit up, then broadcast that bullshit it to the whole country and  world. The hedgies literally manipulate the market, What causes these  bubbles and market manipulation is these shorting practices which any  ape in ECON102 would tell you is fucking dangerous. If we can  \"manipulate\" the market by just holding shares and not fucking doing  anything with them, then just make memes about it, the architects of  that market are probably fucking troglodytes.\n\nI  can't believe these dumbasses are investigating a YouTuber / Redditor, not people who actually hold the necessary power to engage in  financial practices that caused a panic to be possible. They're  interrogating everyday schmucks who engage in literally just having  shares, and those responsible are laughing their asses all the way to  the fucking bank. If the morons in MA are actually dumb enough to blame  us, this is only the first bet of many. The media will move on, but  we'll still be here making bets that stick it to the fucking rich pricks  and powerful morons standing between us and crispy motherfucking  chicken tendies.",
        "created_utc": 1614701008,
        "id": "gpfdcp6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614729808.0
    },
    {
        "author": "DynoJoe27",
        "body": "Anyone playing XLP - Consumer staples? It’s on its 200 day MA. If we have inflation, shouldn’t staples do well?",
        "created_utc": 1614714188,
        "id": "gpg7rfh",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1614742988.0
    },
    {
        "author": "lohith15",
        "body": "Went into RKT knowing only one day trade left \n\nThat mother fucker is about to make mu portfolio cross 25k and not worry about it at all",
        "created_utc": 1614711926,
        "id": "gpg2h46",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614740726.0
    },
    {
        "author": "Ykana1",
        "body": "I don’t even recognize 90% of the tickers being shilled here. What happened to FANG, TSLA, ARKs, SQ, AMD, MU, PLTR?",
        "created_utc": 1614713874,
        "id": "gpg717h",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614742674.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "i think there's still a solid play for TSM/MU etc but man its a fucked up timeline where you dont want to buy into a stock because its now well past an old meme strike\n\nguess MU $90c is here to stay until next cyclical cycle",
        "created_utc": 1614707851,
        "id": "gpfsyw2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614736651.0
    }
]