[
    {
        "author": "Laakhesis",
        "body": "If Reddit exist back in 2000, your question is rephrased to\n\n&gt;Thinking about taking my money out of ETF (QQQ) and put it into **Cisco, Oracle, Intel, Amgen, Qualcoom**, so I can reap the full benefits of the stock increasing for maximum results.\n\nHistorically, winners rotate and QQQ is just there to track it passively. This is something to think about.",
        "created_utc": 1629473883,
        "id": "h9o9lt5",
        "permalink": "/r/investing/comments/p87m62/thinking_about_taking_my_money_out_of_my_etf_qqq/h9o9lt5/",
        "score": 90,
        "subreddit": "investing",
        "created": 1629502683.0
    },
    {
        "author": "ratsmdj",
        "body": "Forreal, whats the entry and exit, or what gave you confirmation to enter a GME call?\n\nI know how options work. But all of a sudden there is an influx of accounts that posts gains on GME, saying OMG look at this or OMG look hella gains. What oracle gave you the decision to say hey now is a good time to buy calls and all at 5 dollar increment strikes til moon.\n\nOP account is an old account, last relevant posts 5 years ago and all of a sudden a bunch of posts lately.\n\nEither OP is a hermit and has hella gains in the market and been keep his mouth shut, but no one comes out of retirement and boom yolo GME meme stock and profits. This a trap. Watch everyone FOMO in calls and or shares and shit is going to tank. Not a shill. \n\nWebull can suck my dick, with their PFOF and 5 day settlement deposits.",
        "created_utc": 1629900587,
        "id": "haalu66",
        "permalink": "/r/wallstreetbets/comments/pb7z51/gme_call_options_go_brrrr/haalu66/",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1629929387.0
    },
    {
        "author": "notherday11",
        "body": "Not a million, but my pops put $25k into Oracle back in the mid 90’s and it’s worth like 700k now or something. He’s still sitting on it.\n\nHe isn’t even an active investor or any kind of pro, he just had a financial advisor that recommended it so he did it and then kind of forgot about it for like 10 years.\n\nIt’s just a matter of a fundamentally solid company + time in the market. He also invested like 10k into Sears and forgot about that until it was bone dry and gone. Diversification and what-not.",
        "created_utc": 1629636817,
        "id": "h9wk5dn",
        "permalink": "/r/stocks/comments/p998gj/does_anyone_have_a_story_about_how_owning_one_or/h9wk5dn/",
        "score": 68,
        "subreddit": "stocks",
        "created": 1629665617.0
    },
    {
        "author": "Tasonir",
        "body": "The Oracle has told us that GME will also be the final GME",
        "created_utc": 1629752401,
        "id": "ha2w0pw",
        "permalink": "/r/wallstreetbets/comments/p9yif3/gme_reminder_we_are_less_than_three_weeks_out/ha2w0pw/",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1629781201.0
    },
    {
        "author": "darkResponses",
        "body": "I only buy stocks on shit I hate. Comcast, Starbucks, ORCL.\n\nYou gotta recognize the more you hate, the more headspace they take. so they must be doing something right. cause that shit is free advertisement.",
        "created_utc": 1628870101,
        "id": "h8snmcs",
        "permalink": "/r/wallstreetbets/comments/p3np2t/sbux_going_to_make_your_some_bucks/h8snmcs/",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1628898901.0
    },
    {
        "author": "gnocchicotti",
        "body": "They are *talking* confident on ARM acquisition.\n\nI read between the lines on the conference call and I *heard* something more along the lines of \"we are confident that regulators will see how this is actually good for UK and the industry.\" Which implies a lot of pushback, and that the viewpoint is not at all accepted yet.\n\nI give them 50/50 odds at best of closing it. If they can close it, there will be so many restrictions on the deal that Nvidia will barely be able to realize synergies out of it that they can't do right now. The only real strategic benefit being that no other party can buy up ARM and use it to cut off Nvidia, since Nvidia is basically trying to take over the world.\n\nEdit: as another redditor below I should disclose I am a long term NVDA holder and they're my #2 holding. But they are proprietary/anticompetitive af and this acquisition will be bad for everyone in the world who isn't Nvidia. Like almost Oracle/Sun level.",
        "created_utc": 1629342617,
        "id": "h9hmgy1",
        "permalink": "/r/stocks/comments/p6zn4k/nvda_beats_earnings_estimates/h9hmgy1/",
        "score": 19,
        "subreddit": "stocks",
        "created": 1629371417.0
    },
    {
        "author": "DonkeyTron42",
        "body": "Just because some companies like Oracle and HP are moving their headquarters to Texas for tax incentives, doesn't mean the jobs are leaving California.",
        "created_utc": 1628817937,
        "id": "h8qa8b8",
        "permalink": "/r/stocks/comments/p38ua1/disney_is_moving_over_2000_corporate_jobs_from/h8qa8b8/",
        "score": 17,
        "subreddit": "stocks",
        "created": 1628846737.0
    },
    {
        "author": "Unlucky_Customer_438",
        "body": "Here is the list:\n\nAAPL, ALB, ADP, AA, ADM, AFL, ABT, ABBV, BAC, BAYZF, BHP, BMY, CSCO, CL, C, CB, CLX, CPB, CAH, COST, DG, GILD, GSL, GPC, GIS, GLNCY, EPD, HRB, HRL, HD, HON, HYG, FBHS, FDX, KMB, KSS, IBM, IRM, K, JNJ, INTC, SYY, LEG, LMT, TROW, TAP, TGT, T, TELNF, MCK, MMM, MAR, MO, MRK, MSFT, PRU, ORCL, ORAN, MDT, RBGLY, RIO, RGA, PBA, PETS, PEP, PFE, PPG, PG, XLE, XLU, WBA, WMT, VZ, UL, UNM \n\nMost are common names. Boring. Of course there are several others that may be better candidates than above, I just personally did DD on above. Other tips  are welcome - as I refresh my watch list every now and then. \n\nWith rest of my portfolio - I also trade FAANG and other risky high fliers (the ROKUs of the world). But stay fairly conservative.",
        "created_utc": 1628973572,
        "id": "h8yavsp",
        "permalink": "/r/options/comments/p4er10/2nd_post_on_selling_options_could_it_be_this_easy/h8yavsp/",
        "score": 17,
        "subreddit": "options",
        "created": 1629002372.0
    },
    {
        "author": "JackOfAllTrades211",
        "body": "That is how forecasting works. If you don't need assumptions, you're an oracle, and in that case you are already a billionaire.",
        "created_utc": 1628655286,
        "id": "h8hwy9m",
        "permalink": "/r/investing/comments/p1x594/coinbase_beats_earnings_estimates_for_q2/h8hwy9m/",
        "score": 15,
        "subreddit": "investing",
        "created": 1628684086.0
    },
    {
        "author": "80percentofme",
        "body": "Amazon wasn’t a top ten internet stock in 1997.  ORCL was.  Your $10k would be worth $20k now.  CSCO was.  Your $10k would be worth $8,500 now.  Of course, when you look back, you can pick winners.  It’s harder without hindsight.",
        "created_utc": 1628373074,
        "id": "h83oaql",
        "permalink": "/r/stocks/comments/ozrvsz/arkk_vs_goldman_sachs_unprofitable_company_basket/h83oaql/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1628401874.0
    },
    {
        "author": "Outrageous-Win-9449",
        "body": "That whole oracle thing, works until it doesn’t.",
        "created_utc": 1629341736,
        "id": "h9hkqzv",
        "permalink": "/r/wallstreetbets/comments/p6yxxc/what_are_your_moves_tomorrow_august_19_2021/h9hkqzv/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1629370536.0
    },
    {
        "author": "gothicka112",
        "body": "[Jeff Epstein](https://www.bvp.com/team/jeff-epstein) took Avepoint public through a SPAC merger. This man is the ex CFO of Oracle, sits on the board of AVPT, and incredibly meme worthy! Chris Hansen even wants to interview him for the lols 🚀🚀🚀",
        "created_utc": 1628621597,
        "id": "h8fy7m8",
        "permalink": "/r/wallstreetbets/comments/p1ttvt/avpt_earnings_call_today_tendies_incoming/h8fy7m8/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1628650397.0
    },
    {
        "author": "diaznutzinyomouf",
        "body": "I would like someone to post some DD as far as AvePoint vs Varonis since it seems Varonis is very similar and does much of the same thing with MSFT while trading at 15x to 20x revenue all while losing money.  I don't expect a whole lot of price movement THIS earnings report, I anticipate a much larger move near Q3 ER if Q2 provides confirmation (43m to 44m in rev) that they are on target to hit their revenue projection this year (already raised once). At some point as long as AvePoint executes as planned,  the market will respond. \n\nI don't really see a way that the largest SaaS cloud partner for the world's largest software/cloud company growing at 25% to 30% CAGR continues to trade at 9X when similar companies are at least trading at 30% higher. AvePoint also has a great team,  Jeff Teper, VP at Microsoft on board,  Jason Beal from Palo Alto Networks, Epstein as former CFO of Oracle, Koenig as former head of global technology investment at Goldman Sachs who's first IPO was ironically MSFT. \n\nThey have been executing a parallel M&amp;A plan alongside the SPAC process according to CEO, I expect acquisitions soon and AvePoint to execute as planned. The downside here is limited its already at the low range of valuation with a $23 bull target (VRNS revenue multiple). I feel very confident holding this, there's a ton of far worse holds making zero revenue or going backwards. \n\nAvePoint has zero debt (as of now,  who knows if their M&amp;A strategy changes that)  and is in my opinion a strong play whether the economy remains open or shuts down again. Another shutdown will actually benefit AvePoint,  and as we all know,  most companies are either permanently adopting WFH models to save on real estate costs or moving to a mostly WFH model. With so many working from home with access to sensitive data there going to be far more foreign actors attempting to compromise those systems and gain access which will result in more reliance on companies like AvePoint (Varonis too).",
        "created_utc": 1628461401,
        "id": "h87wm1u",
        "permalink": "/r/SPACs/comments/p0k2aa/avpt_first_post_merger_earnings/h87wm1u/",
        "score": 12,
        "subreddit": "SPACs",
        "created": 1628490201.0
    },
    {
        "author": "SlutMuppetLives",
        "body": "2008-2010 brought a lot of these cases to bear, because suddenly everything was cheap and nobody was sure which companies would survive. The dumping was massive, and people believed we would have a BEAR DECADE (not without reason...the housing market, of all things, was a dumpster fire sucked into a black pit of doom). \n\nFavorites: Blockbuster would make a comeback, overcome, or straight up buy out Netflix. GM was dead forever (went bankrupt, started another ticker, screwed investors). Ford would fold. Amazon was unsustainable. TSLA was a joke company run by a weird financial silicon valley type. SIRI radio wasn't sustainable. Oracle would buy out Microsoft and crush Apple, which would be bought out by Sony. Hulu was too late to the game, and Viacom had made a huge mistake buying them (Viacom was losing whole markets at the time, like NYC and Los Angeles). I also remember Radio Shack had a monster year that sent Bulls into a frenzy and then just died a slow cancerous death.\n\nDoes anyone else remember this? Traders and talking heads constantly trying to kill off big department stores like K-Mart, Sears, JC Penny, etc?\n\nAlso, so many people wrote off SHOP, it's actually quite hilarious to go back digging for early haters and short sellers.",
        "created_utc": 1629572202,
        "id": "h9tik6c",
        "permalink": "/r/stocks/comments/p8rc1g/what_are_your_favorite_bear_cases_for_stocks_that/h9tik6c/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1629601002.0
    },
    {
        "author": "HunterWesley",
        "body": "After consulting an oracle bone and some entrails, I have confirmed your findings.",
        "created_utc": 1629016226,
        "id": "h90dm0s",
        "permalink": "/r/wallstreetbets/comments/p4nlzy/its_time_for_amc_to_move_here_we_go/h90dm0s/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1629045026.0
    },
    {
        "author": "walter1021",
        "body": "Anyone: *says a play with semi decent consistency* \n\n3 month old account: “It works until it doesn’t” \n\nword good input bro next time I’ll just make sure to ask the omnipotent oracle I keep locked in my basement",
        "created_utc": 1629341628,
        "id": "h9hkjfz",
        "permalink": "/r/wallstreetbets/comments/p6yxxc/what_are_your_moves_tomorrow_august_19_2021/h9hkjfz/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1629370428.0
    },
    {
        "author": "darkResponses",
        "body": "this doesn't say when I exit. but I FUD wayfair before it did the stupid buyback. So my gain was tiny compared to what I should've made. \n\nORCL I was two days off and missed out on 20%. but my options were up 100% and ITM at that point. \n\nSo if you were to take all that into consideration. Hold for 2 days after I sell to maximize your profits.",
        "created_utc": 1628877012,
        "id": "h8t546v",
        "permalink": "/r/wallstreetbets/comments/p3np2t/sbux_going_to_make_your_some_bucks/h8t546v/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1628905812.0
    },
    {
        "author": "realister",
        "body": "As the oracle of Omaha says, \"be greedy when others are fearful.\"",
        "created_utc": 1629350631,
        "id": "h9hzt5w",
        "permalink": "/r/wallstreetbets/comments/p6yxxc/what_are_your_moves_tomorrow_august_19_2021/h9hzt5w/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1629379431.0
    },
    {
        "author": "NEW_JERSEY_PATRIOT",
        "body": "* Rising labor and shipping costs will eat their already small margins on retail.  \n* I think Prime membership will see slower growth due to increased competition.\n* AWS is in a very competitive field and will need to battle giants such as Google, Microsoft, IBM, Oracle.  They have a great start but industry is so competitive.\n\nI don't really have a bearish view on Amazon as they will obviously do fine for years to come, I just think there are better growth stocks out there.",
        "created_utc": 1630012181,
        "id": "hah3d7i",
        "permalink": "/r/stocks/comments/pc71xx/bear_case_for_amazonamzn/hah3d7i/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630040981.0
    },
    {
        "author": "Caesar_aut_nullus",
        "body": "What if Burry the Oracle was right all along?",
        "created_utc": 1629327047,
        "id": "h9gpxz9",
        "permalink": "/r/wallstreetbets/comments/p6yxxc/what_are_your_moves_tomorrow_august_19_2021/h9gpxz9/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1629355847.0
    },
    {
        "author": "jak0tak0",
        "body": "I have faith in the mattress oracle, but I am glad to have bought cheap put options right before close to limit the loss on the shares I bought.\n\nFingers crossed that the guidance is solid. 🤞",
        "created_utc": 1629924619,
        "id": "hac9h5n",
        "permalink": "/r/wallstreetbets/comments/paa5i3/500k_bet_on_slqt_heres_why/hac9h5n/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1629953419.0
    },
    {
        "author": "123random7",
        "body": "And Oracle (with Oracle Cloud Infra - [https://www.oracle.com/cloud/oci-vs-aws/](https://www.oracle.com/cloud/oci-vs-aws/) ).     \n\n\n*ORCL is up 39.51% up in 2021(year to date)*",
        "created_utc": 1629581267,
        "id": "h9u23q3",
        "permalink": "/r/stocks/comments/p8xcfv/why_the_hell_is_no_one_talking_about_the/h9u23q3/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1629610067.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "Yolo my entire portfolio into some Zynga 10C 12/17/21, my new strat after losing my entire portfolio in june is to buy calls after something sold off, worked with oracle so lets hope it works again.",
        "created_utc": 1628328997,
        "id": "h81f2ua",
        "permalink": "/r/wallstreetbets/comments/ozebic/weekend_discussion_thread_for_the_weekend_of/h81f2ua/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1628357797.0
    },
    {
        "author": "zethras",
        "body": "I went in with my friend. He was thinking of buying puts too or maybe both and as long as it moves more either direction, you make money lol... but ended buying only calls\\*, I guess we had too much fate on the mattress oracle.",
        "created_utc": 1629924815,
        "id": "hac9yns",
        "permalink": "/r/wallstreetbets/comments/paa5i3/500k_bet_on_slqt_heres_why/hac9yns/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1629953615.0
    },
    {
        "author": "Falcon4ever79",
        "body": "I found this info for Oracle Human Resources:\n\nContact Information\nOracle Corporation \n1001 Sunset Blvd, \nRocklin, California 95765\nPhone: +1 800 3922999\nEmail: april.mazon@oracle.com \nWeb: www.oracle.com\n\nHope this helps. Good luck.",
        "created_utc": 1628223750,
        "id": "h7wc4uj",
        "permalink": "/r/StockMarket/comments/oyz8qx/sun_microsystems_stock_issue/h7wc4uj/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1628252550.0
    },
    {
        "author": "UpSideofDown",
        "body": "LMAO, TDA emailing me about the ORCL $80 puts I bought a couple weeks ago, expiring today.  Good, will be glad to not see that mistake mocking me every time I open my port next week...",
        "created_utc": 1629472424,
        "id": "h9o5zlo",
        "permalink": "/r/wallstreetbets/comments/p825zj/daily_discussion_thread_for_august_20_2021/h9o5zlo/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629501224.0
    },
    {
        "author": "ihpsdm",
        "body": "The Oracle has spoken.",
        "created_utc": 1628133249,
        "id": "h7rfauc",
        "permalink": "/r/wallstreetbets/comments/oy0ywp/what_are_your_moves_tomorrow_august_05_2021/h7rfauc/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1628162049.0
    },
    {
        "author": "joezombie",
        "body": "You’re an oracle and I should bet my life savings on it?",
        "created_utc": 1629342285,
        "id": "h9hlu44",
        "permalink": "/r/wallstreetbets/comments/p6yxxc/what_are_your_moves_tomorrow_august_19_2021/h9hlu44/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629371085.0
    },
    {
        "author": "sc2bigjoe",
        "body": "Blockchain is the hottest new DBMS system, it’s groundbreaking. Think about all the popular DBMS over the years, Oracle, db2, sql, mainframe, mongodb. Blockchain is filling a gap that no other DBMS can do.",
        "created_utc": 1628852632,
        "id": "h8rqpe5",
        "permalink": "/r/investing/comments/p3i6xp/whats_the_deal_with_cryptocurrencies/h8rqpe5/",
        "score": 3,
        "subreddit": "investing",
        "created": 1628881432.0
    },
    {
        "author": "sweetleef",
        "body": "Selling puts is the same as a CC, risk wise.  And there are no \"safe buys\".\n\nThe problem with your thesis is that we're in the biggest bull market blowoff in decades.  It may help to look at what happened in 2000, which is similar to now.  Wild bullish euphoria, massive fed flooding, \"new paradigm\", market-wide parabolic moves, etc.  \n\nWhen it finally broke, it really broke, and a ton of those names people \"wouldn't mind owning\" fell 90% and stayed there for decades.  MSFT and ORCL took 17 years to regain the dot-com highs. QCOM took 20.  \"Safe\" names, the same - WMT, HD, and KMB took 12+ years.  Many of the biggest names of that era never came back at all, like LU and SUNW.   \n\nIf you're talking about wheeling and holding the underlying long term, the question isn't whether you'd be happy to own CLX at 160, it's whether you'd be happy to own it at 40, and wait 15-20 years for it to get back to 160.",
        "created_utc": 1629042469,
        "id": "h91jbsq",
        "permalink": "/r/options/comments/p4er10/2nd_post_on_selling_options_could_it_be_this_easy/h91jbsq/",
        "score": 3,
        "subreddit": "options",
        "created": 1629071269.0
    },
    {
        "author": "Caesar_aut_nullus",
        "body": "Dr. Burry the Oracle, Bear King",
        "created_utc": 1629646829,
        "id": "h9x4nyb",
        "permalink": "/r/wallstreetbets/comments/p8cqpr/weekend_discussion_thread_for_the_weekend_of/h9x4nyb/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629675629.0
    },
    {
        "author": "Lukequist",
        "body": "Not sure if I’m an [oracle](https://www.reddit.com/r/wallstreetbets/comments/p83k1y/fraternal_association_of_gambling_gentlemen_and/h9osngl/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf&amp;context=3) or if this was just a consequence of the market being up in general.",
        "created_utc": 1629732442,
        "id": "ha1j947",
        "permalink": "/r/wallstreetbets/comments/p997ik/fraternal_association_of_gambling_gentlemen_and/ha1j947/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629761242.0
    },
    {
        "author": "M_Scaevola",
        "body": "Cisco or Oracle. Both are tech, both are mature businesses, and both are largely ignored by the current tech mania.",
        "created_utc": 1629848104,
        "id": "ha8663z",
        "permalink": "/r/ValueInvesting/comments/pax7r1/which_stock_from_the_sp_500_would_you_want_to_do/ha8663z/",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1629876904.0
    },
    {
        "author": "XxKon_ArtxX",
        "body": "Oracle is a hidden gem all around..cloud storage is the future",
        "created_utc": 1628516998,
        "id": "h8aasc8",
        "permalink": "/r/wallstreetbets/comments/p0yfax/daily_discussion_thread_for_august_09_2021/h8aasc8/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1628545798.0
    },
    {
        "author": "Saajaadeen",
        "body": "Ahhh i got it well right now I just have stocks and they're listed below.\n\n&amp;#x200B;\n\n* $APPL\n* $MSFT\n* $GOOG\n* $GOOGL\n* $ORCL\n* $ADBE\n* $TSLA\n* $AMD",
        "created_utc": 1628186786,
        "id": "h7u3ty2",
        "permalink": "/r/StockMarket/comments/oymtsf/it_aint_much_but_its_honest_work/h7u3ty2/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1628215586.0
    },
    {
        "author": "Vast_Cricket",
        "body": "Stock investment service department is  probably at  Oracle Building 100, 100 Oracle Pkwy, Redwood City, CA 94065 Phone: (650) 506-7000   ORCL headquarters went to Austin, TX a few years ago.\n\nIf you have a US stock  brokerage in Seoul. Have them signed by your father and let them handle the conversion.   Most of the products Sun Developed are down in the drain. Alpha server, MySQL etc.  Old Sun have some presence in Santa Clara, CA.  Most of their buildings are sitting there not utilized.  ORCL vs Java conversion rate is what your father should ask!",
        "created_utc": 1628227100,
        "id": "h7whb0f",
        "permalink": "/r/StockMarket/comments/oyz8qx/sun_microsystems_stock_issue/h7whb0f/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1628255900.0
    },
    {
        "author": "Awesome____Sauce",
        "body": "how the hell is oracle at 90 dollars",
        "created_utc": 1628882332,
        "id": "h8ti7ua",
        "permalink": "/r/wallstreetbets/comments/p3kdnr/daily_discussion_thread_for_august_13_2021/h8ti7ua/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628911132.0
    },
    {
        "author": "yunglegendd",
        "body": "Lmao the Monty Hall problem is not some philosophical allegory. It’s strict mathematical statistics, nothing to do with an “all knowing oracle.”\n\nI think the Monty hall problem has very little to do with the stock market, but it’s strictly math",
        "created_utc": 1628974569,
        "id": "h8yd3nq",
        "permalink": "/r/investing/comments/p452jb/investing_warren_buffets_bet_and_the_monty_hall/h8yd3nq/",
        "score": 2,
        "subreddit": "investing",
        "created": 1629003369.0
    },
    {
        "author": "greygray",
        "body": "&gt;But the price still needs to be &lt;$1.2 per mile for the economics to work out for people to want to dump their own cars. And that’s assuming the current prices of cars, which would drop in parallel with per-mile prices dropping for AVs.\n\nI think one of the big pieces of this is transforming the general public's mindset about driving. There's a very strong car ownership culture in America that does need to be unwound (does not exist nearly as much in European cities or in China) wherein people are not correctly recognizing that time driving is **uncompensated labor**. The  layer of resistance is getting people to ditch their cars, and that may mean operating at breakeven or loss. After they've ditched their cars, they may become dependent on the service and may also begin to rethink the act of driving and discover that *not driving* affords them the opportunity to regain leisure time. While some people certainly enjoy driving and enjoy commuting, I think a lot of people would also benefit from being able to take naps in the car, play games, read Reddit, etc and be willing to pay a premium (slight or large) to avoid driving. \n\nPersonal anecdote: When I was living outside of SF, I would often Uber into the city instead of drive because (1) I didn't want to deal with parking my car and paying for parking (2) I wanted to be able to drink and not worry about DUIs (3) It was often cheaper to use public transit / Uber than to pay for gas, wear and tear (I drive a nice car), and parking (4) I like being able to browse the internet instead of drive. While the cost to operate that uber on a per mile might have been sub &lt;$2 I was willing to pay more money because of all of those factors.  \n\n&amp;#x200B;\n\n&gt;Also, she’s saying an $11T opportunity - that would typically be market size (i.e. revenue per year), not market cap… and autonomous trucks are a stretch to label “taxis”.\n\nI'm not really here to defend Cathie's numbers. I think they assume a much faster adoption rate than what I think is realistic, but I think that there's something inbetween what the average layperson thinks and her hyperbolic projection (though in all honesty, much closer to Cathie's projection than what's being alluded to in this thread). What I'm here to push on is the closemindedness being displayed by a lot of the doubters in this Reddit post. AV is coming and it's going to be a multi-trillion dollar opportunity that has planetscale impact. It's also coming a lot earlier than many people expect. \n\nI think a realistic TAM for the entire AV space (Taxis, public transit, and trucking) over the next 10 years is around $2T-3T revenue per year, and I would be surprised if the company that launches the first AV ridesharing network doesn't reach a $1T market cap within 10 years of debut. If we expand beyond pure driving and include sale of data, advertisement, oracle services, etc., I think revenue could get up to above $5T per year, though I don't think that AV companies will go that route immediately for fear of regulation. \n\nI think that the biggest constraint on bringing this to market is going to be manufacturing capability. Even if every single automaker in the world pivoted to becoming OEMs for the AV space, we probably aren't able to outfit enough AVs to meet AV demand, which is why I think a 20 year horizon on the &gt;$10T revenue mark is more prudent.",
        "created_utc": 1629998756,
        "id": "hag5yb9",
        "permalink": "/r/investing/comments/pbw1cc/cathie_wood_predicts_the_autonomous_taxi_network/hag5yb9/",
        "score": 2,
        "subreddit": "investing",
        "created": 1630027556.0
    },
    {
        "author": "Soybeanrice",
        "body": "ORCL is a beast. Some poor sap keeps triggering the \"Unusual options activity\" threshold for a bearish position and is getting prolapsed over and over",
        "created_utc": 1628001334,
        "id": "h7k27yp",
        "permalink": "/r/wallstreetbets/comments/ox095v/daily_discussion_thread_for_august_03_2021/h7k27yp/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628030134.0
    },
    {
        "author": "Ignatius_Minkoff",
        "body": "Should of gone to the Oracle at Delphi what a waste",
        "created_utc": 1628032200,
        "id": "h7m20pc",
        "permalink": "/r/wallstreetbets/comments/oxbkl9/what_are_your_moves_tomorrow_august_04_2021/h7m20pc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628061000.0
    },
    {
        "author": "bugbot83",
        "body": "Honestly hard to say I recommend one stock in particular. My portfolio fluctuates between 20-30 stocks and I only pick up about 2 or 3 new ones per year. I hold all the major players in cloud computing, semiconductors, hardware, and defense, as well as some random one-offs like Paypal, Tesla, and Honeywell. Tesla is the perfect example of a stock I wouldn’t recommend, even though I’m holding it. It helps to be sitting on some gains and having taken a lot off the table already. But if you look at the major tech companies like Google, Amazon, Microsoft, and Apple, who are crushing the earnings and skyrocketing, they seem “very high”, but their P/E’s are not necessarily higher than they’ve ever been. It’s hard to say I’d buy at these levels, but I’m certainly holding. Oracle and General Dynamics are the only stocks I’ve bought this year. But again, I see it as filling out a larger strategy of cloud computing and defense. I wouldn’t necessarily recommend those as a single holding. Oracle continues to be a player in database and cloud software and with General Dynamics, it’s hard to see who would ever replace them and I don’t see navy ships and submarines going out of style.",
        "created_utc": 1628215402,
        "id": "h7vvzh3",
        "permalink": "/r/ValueInvesting/comments/oycx9q/where_do_you_get_your_research/h7vvzh3/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1628244202.0
    },
    {
        "author": "sharkattackshark",
        "body": "Does anyone know if Oracle is buying Tik Tok yet?",
        "created_utc": 1628298774,
        "id": "h806j38",
        "permalink": "/r/wallstreetbets/comments/ozebic/weekend_discussion_thread_for_the_weekend_of/h806j38/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628327574.0
    },
    {
        "author": "CryptoDavid10",
        "body": "I don’t need monitors, I just ask the oracle to pick stocks",
        "created_utc": 1628925621,
        "id": "h8vweta",
        "permalink": "/r/wallstreetbets/comments/p3tl78/would_manny_monitors_help_you_make_more_or_lose/h8vweta/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628954421.0
    },
    {
        "author": "feedmeattention",
        "body": "Not sure if I’m missing it… the document you linked here shows the fund she manages following the trend of the market, yet still having higher returns. \n\nDidn’t know looking like a modest librarian helps you con billions out of people. If I learned anything from my time in sales, it’s usually the hot blondes (think Katie Holmes) that have an easier time.\n\nI’m not saying she’s an oracle, I’m saying she has been doing better than the market for decades now. And that’s an incredible achievement in the world of finance. I’m rather curious as to why people are jumping on some sort of bandwagon against her using “this article says she didn’t predict the future! she’s a joke!” as some sort of evidence that her investment decisions are poor.",
        "created_utc": 1629187575,
        "id": "h99k0yw",
        "permalink": "/r/ValueInvesting/comments/p5wg2e/looks_like_burry_is_shorting_arkk_i_ranted_about/h99k0yw/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1629216375.0
    },
    {
        "author": "hello801",
        "body": "I have been following sun ship trader on youtube and twitter:\n\n[https://www.youtube.com/results?search\\_query=sun+ship+trader](https://www.youtube.com/results?search_query=sun+ship+trader)\n\nI only pay attention to the shroom stocks he talks about on his youtube channel. I have no idea how good he is or not, but he has helped me visualize price points on some of the stocks he covers where it might be a good entry point. He has been wrong on some of these, so I don't view him as an oracle or anything . . . but I have learned some things. To be honest, I still need to get much better, but it has helped me realize how stocks need to digest big moves and often come down after a big moves higher . . . \n\nI just googled a few more: [https://www.youtube.com/watch?v=4zNCXnftcKw](https://www.youtube.com/watch?v=4zNCXnftcKw)\n\n[https://www.youtube.com/watch?v=eynxyoKgpng](https://www.youtube.com/watch?v=eynxyoKgpng)\n\nI'm sure there are much better options and perhaps people who are better traders than me can recommend them. I would also be interested . . .  .",
        "created_utc": 1630339201,
        "id": "haxxuna",
        "permalink": "/r/shroomstocks/comments/pef0q3/shrooms_talks_august_30_2021_daily_discussion/haxxuna/",
        "score": 2,
        "subreddit": "shroomstocks",
        "created": 1630368001.0
    },
    {
        "author": "mettle",
        "body": "It looks like no one's actually answered your question and are just reiterating skepticism. Perhaps that's what you were looking for? Note, too, there was a DoorDash survival thread from a few days ago the looks pretty identical. What I wrote there, and I'll write again:\n\n&gt;\\[H\\]ere's the high-level bullish case on why it may be quite risky to short them:  \n&gt;  \n&gt;Their revenue is growing at 2x per year -- 200% -- that's tremendous growth you can't find in too many other places and has held steady for 3 quarters.   \n&gt;  \n&gt;They have 4B in cash on hand, so even if they lose 100M/quarter, as the did recently, they can still stay afloat for 40 quarters  \n&gt;  \n&gt;Most important, cost of revenue (money going to drivers, restaurants and coupons) is only 52% of revenue  \n&gt;  \n&gt;What this last point means is that once they stop being in growth mode, they can presumably cut other costs significantly and still have a nice profit margin. That is, if they fire all the coders and middle managers, their margin would be 48%, which is plenty good. if people are hooked and they get rid of coupons and start squeezing restaurants and drivers, they'll make even more.  \n&gt;  \n&gt;Or another observation: if they return to the same proportion of cost of revenue from 9/2020 (43% vs. 52%), but just stay the same size, they'd have broken precisely even, even with all their inefficiencies.  \n&gt;  \n&gt;When your face is pressed close to the glass, it can be hard to see economies of scale at this size.  \n&gt;  \n&gt;Disclosure: I wouldn't touch the stock, long or short, with a 10 foot pole. I'm not crazy.\n\nand\n\n&gt;\\[To\\] reiterate the bull case (there's a million reasons why this wouldn't come to fruition) but back-of-the-envelope: restaurant revenue is \\~$1T, takeout \\~$300B, Doordash could eventually take 10% of that, say $30B, which puts revenue just below Oracle, about the same as Tesla, Raytheon and HPE. Those market caps are $250B, $700B, $130B and $20B.So, if you squint, DoorDash at $60B can slot right in there.I could do a fancy due diligence thing with forward free cash flow yadda yadda yadda, but I'm not that committed.\n\nHope that's what you were actually looking for.",
        "created_utc": 1628918757,
        "id": "h8vn8xi",
        "permalink": "/r/stocks/comments/p3ozbg/how_is_doordash_a_62_billion_company/h8vn8xi/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628947557.0
    },
    {
        "author": "the_GuelahPapyrus",
        "body": "Only mega stocks with extreme valuations go up after earnings. Unless you're Oracle or Microsoft. Then you drop and rebound harder than before.",
        "created_utc": 1628803428,
        "id": "h8pe7qz",
        "permalink": "/r/wallstreetbets/comments/p37krv/what_are_your_moves_tomorrow_august_13_2021/h8pe7qz/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628832228.0
    },
    {
        "author": "Steak-Complex",
        "body": "Neither is the halting problem but they require an oracle. In the Monty hall it was just the game show host iirc. \n\nIf there was a Monty hall stock problem there would require someone to know which stock of the 3 would go up and which would go down but such a person doesn't exist",
        "created_utc": 1628974840,
        "id": "h8ydp1h",
        "permalink": "/r/investing/comments/p452jb/investing_warren_buffets_bet_and_the_monty_hall/h8ydp1h/",
        "score": 2,
        "subreddit": "investing",
        "created": 1629003640.0
    },
    {
        "author": "gezza87",
        "body": "I found the oracle over here guys",
        "created_utc": 1629437679,
        "id": "h9mnlyi",
        "permalink": "/r/wallstreetbets/comments/p7urqu/1_to_20000_with_one_easy_trade/h9mnlyi/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629466479.0
    },
    {
        "author": "WrongAssumption",
        "body": "Oracle and SalesForce are two companies immediately springing to mind that have done this.",
        "created_utc": 1629010336,
        "id": "h906huu",
        "permalink": "/r/wallstreetbets/comments/p4fn0q/pay_attention_to_ups_stock_next_week/h906huu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629039136.0
    },
    {
        "author": "atdharris",
        "body": "Keep in mind Burry has been wrong many times. He nailed the mortgage crisis, but he's hardly an oracle.",
        "created_utc": 1629308376,
        "id": "h9fknb4",
        "permalink": "/r/investing/comments/p6bgsw/cathie_wood_rebuts_michael_burry_saying_he_misses/h9fknb4/",
        "score": 2,
        "subreddit": "investing",
        "created": 1629337176.0
    },
    {
        "author": "basedmentdweller",
        "body": "Yes I agree,  The bearded oracle has taught us we should have 60% equities and 40% safe stuff.  There's a lot to be said for sleeping well at night and 7 or 8% is more then enough!",
        "created_utc": 1629310315,
        "id": "h9fp1ih",
        "permalink": "/r/CanadianInvestor/comments/p6t91p/it_feels_like_everyones_risk_tolerance_is_way_too/h9fp1ih/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1629339115.0
    },
    {
        "author": "bdavid21wnec",
        "body": "Can someone smart tell me why my $ORCL $110c for 6/17 dropped by 30% in value with 10mins to go? Seems like a great buying opportunity at ~$1.50, but maybe I’m missing something",
        "created_utc": 1629759278,
        "id": "ha3c0ea",
        "permalink": "/r/wallstreetbets/comments/pa7km0/what_are_your_moves_tomorrow_august_24_2021/ha3c0ea/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629788078.0
    },
    {
        "author": "Ozbal42",
        "body": "&gt; Oracle sent a bunch of bald fucks in Nordstrom sales rack garbage to my work and they were visibly sweating after lunch don't compare them to other data solutions companies.\n\ni have no idea what you mean by this but its an hilarious image",
        "created_utc": 1629711319,
        "id": "ha0i00c",
        "permalink": "/r/wallstreetbets/comments/p96lm2/pltr_is_going_to_build_generational_tendiness/ha0i00c/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629740119.0
    },
    {
        "author": "Sumth1nSaucy",
        "body": "Fair enough. But you must be joking about them losing more money than Palantir? First of all, they're totally different companies with different businesses, but Palantir was founded in 2003 and AI was founded in 2009. So 6 year head start, which is a good thing IMO. They haven't yet reached the egregious overloaded market cap of Palantir yet, which allows us as investors to get in early on a promising company. \n\nAlso, I think Thomas Siebel is a very promising leader for the company. He was a part of Oracle and started Siebel Solutions (which merger with Oracle) and are both very successful software companies. He has the experience, has done it twice before, and it's cutting edge. They're growing rapidly at a sustainable pace. I'll definitely be holding my shares for the next decade. Been selling covered calls on them as well, so basically the shares were free at this point since IV has been so high but the stock has barely moved for months.",
        "created_utc": 1630170919,
        "id": "hapbsda",
        "permalink": "/r/wallstreetbets/comments/pd2wq6/most_anticipated_earnings_releases_for_the_week/hapbsda/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630199719.0
    },
    {
        "author": "urraca",
        "body": "I've installed it on literally thousands of linux servers.\n\nIt's literally right on their FAQ of what linux servers they support. Are you even doing a basic google search?\n\n[https://www.crowdstrike.com/endpoint-security-products/crowdstrike-falcon-faq/](https://www.crowdstrike.com/endpoint-security-products/crowdstrike-falcon-faq/)\n\n`What Linux versions does the Falcon agent support?`\r  \n`We support these x86_64 versions of these Linux server OSes:`\r  \n\r  \n`Amazon Linux 2`\r  \n`Amazon Linux AMI`\r  \n`2018.03`\r  \n`2017.09`\r  \n`2017.03`\r  \n`CentOS`\r  \n`8.0 – 8.3`\r  \n`7.1 – 7.9`\r  \n`6.7 – 6.10`\r  \n`Debian`\r  \n`9.4`\r  \n`Oracle Linux`\r  \n`Oracle Linux 6 - UEK 3, 4`\r  \n`Oracle Linux 7 - UEK 3, 4, 5`\r  \n`Red Hat Compatible Kernels (supported RHCK kernels are the same as for RHEL)`\r  \n`Red Hat Enterprise Linux (RHEL)`\r  \n`8.0-8.3`\r  \n`7.1-7.9`\r  \n`6.7-6.10`\r  \n`SUSE Linux Enterprise (SLES)`\r  \n`15`\r  \n`12.1 – 12.5`\r  \n`11.4`\r  \n`Ubuntu`\r  \n`20.04 LTS`\r  \n`20.04 AWS`\r  \n`20.04 GCP`\r  \n`18 AWS`\r  \n`18 GCP`\r  \n`18.04 LTS`\r  \n`16-AWS`\r  \n`16.04 LTS`\r  \n`14.04 LTS`\r  \n`Additional Linux Support`\r  \n`AWS ARM-based Graviton Processors`\r  \n`Amazon Linux 2`",
        "created_utc": 1630357082,
        "id": "haz52m1",
        "permalink": "/r/wallstreetbets/comments/peht4b/bb_cybersecurity_and_iot_leader_undervalued_by_10x/haz52m1/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630385882.0
    },
    {
        "author": "Misaiato",
        "body": "\"TECH seems played out\"\n\n???\n\nBuddy - I just can't even. \n\nMSFT reports that there are currently 1.3 B devices running Windows 10. If MSFT pushes some subscription like \"we'll do anti-virus for you for $1 per device per year\" and they get 10% adoption - that's $130 M in additional revenue in the blink of an eye.\n\nAAPL has an estimated 900 M active iPhones.  Again if they (and they did) bundle Apple TV, Music, and News, and they get 10% uptake (I think I got a deal for like $25 per month for a family membership), they're going to add - let's do quick, rough math:\n\n900 M devices, Family plan is for 5, so divide by 5\n180 M \"families\" (rough and dirty)\n10% of 180 M = 18 M\n18 M * $25 per month = 450 M monthly\n450 M * 12 = 5.4 B in additional annual revenue.\n\nYou know how many companies have a MARKET CAP greater than 5.4 B?\n\nAccording to https://companiesmarketcap.com/page/23/ it's 2249 companies *globally*\n\nIn fact, I scrolled through pages just to find the break point - according to that data, Macy's has a total market cap of $5.41 B, on the list at like position 2246.\n\nGuess who are the #1 and #2 ?  AAPL and MSFT. BRK.A is on that list at #8, and Buffet can't find a better tech opportunity than holding AAPL at over 5% of his portfolio.\n\nMSFT's growth couldn't possibly be *less* played out.  They are making huge inroads with cloud deployments despite AWS's continued dominance, Azure is very likely to run up the market share pie slice over the next 10 years.\n\nThey can easily acquire to continue to add revenue to their books, and there are \"killer apps\" we haven't even dreamed up that will run their workloads on Azure or a competitor without question.\n\nThere is no \"played out\" in tech. There is *only* tech going forward. \n\nBuffet is holding 26.2% of BRK.A in Kraft Heinz - people like ketchup and hot dogs for sure - but where is Kraft putting their money?\n\nhttps://www.reuters.com/world/uk/kraft-heinz-invest-199-million-british-manufacturing-facility-2021-06-01/\n\nNearly $200 M in a manufacturing facility that's going to \"add 50 jobs\"\n\nSo - automation. That factory will be the highest tech piece of kit in that part of the UK by miles.\n\nWhat kind of companies might be vying for the software to run such a facility?\n\nMSFT has a whole division called Dynamics that can compete with the ERP giants of SAP and Oracle.  I worked for SAP once upon a time, so while Dynamics isn't at that Royal Dutch Shell level of ERP, they are certainly in the $200 M manufacturing facility range with a very compelling offering.\n\nAnyway - I'm ranting on here a bit - but your post requires a lot more thought on your part.\n\nI think you're literally out of your damn mind to think that MSFT and AAPL will \"trade sideways and uptrend at index rates for the next few years\"\n\nIt literally only takes one new product, one new announcement, from either company, as demonstrated with napkin math above, to add billions in revenue to their balance sheets.  They've been doing it consistently for a very, very long time.  \n\nI think it's a mistake on your part to assume that just because MSFT and AAPL have been relatively quiet during Covid that their teams are just resting on their laurels and not working on the next game-changing technologies that we'll all be using sooner than you think.\n\nFucking LOOOOOOOONG MSFT and AAPL.",
        "created_utc": 1628187956,
        "id": "h7u6qqo",
        "permalink": "/r/options/comments/oyliq9/msft_or_brkbwhich_do_you_preferor_neither/h7u6qqo/",
        "score": 2,
        "subreddit": "options",
        "created": 1628216756.0
    },
    {
        "author": "Icelandicfarm78",
        "body": "Someone explain to me why Oracle has gone up in value this past year. Should trade the same way as IBM and AT&amp;T.  Garbage antiquated product with literally no growth over past ten years.",
        "created_utc": 1629238589,
        "id": "h9cbqy2",
        "permalink": "/r/wallstreetbets/comments/p6b7cz/what_are_your_moves_tomorrow_august_18_2021/h9cbqy2/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629267389.0
    },
    {
        "author": "Trex_in_F16",
        "body": "Oracle of wsb? 😯",
        "created_utc": 1629318765,
        "id": "h9g7wf4",
        "permalink": "/r/wallstreetbets/comments/p6yxxc/what_are_your_moves_tomorrow_august_19_2021/h9g7wf4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629347565.0
    },
    {
        "author": "WannabeGoodGoy",
        "body": "All right gay bois, I have a strong \\*feeling\\* that the market will open red and end up green by the end of the trading day tomorrow  (Spoiler alert: I am not an oracle, don't bet your life savings on it).",
        "created_utc": 1629342062,
        "id": "h9hlebb",
        "permalink": "/r/wallstreetbets/comments/p6yxxc/what_are_your_moves_tomorrow_august_19_2021/h9hlebb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629370862.0
    },
    {
        "author": "bigshooTer39",
        "body": "Thank you.  Never heard of it.  I typically check Glassdoor.  I’m in financial systems working primarily with Oracle software.  Not for Oracle but we use their suite of products. LA makes sense for the high salary.  If I was in a major city I’m sure I would make more.  I have incredible work life flexibility and work 100% remote now so I guess it’s a trade off",
        "created_utc": 1628597810,
        "id": "h8eh2nk",
        "permalink": "/r/wallstreetbets/comments/oxl4t3/lost_163k_capital_in_6_months_ama/h8eh2nk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628626610.0
    },
    {
        "author": "monkey7878",
        "body": "Google, IBM, oracle, cisco, Fortinet, Crowdstrike are my bets.",
        "created_utc": 1628972377,
        "id": "h8y895z",
        "permalink": "/r/stocks/comments/p4d4zh/which_stocks_at_least_50_off_their_52_week_highs/h8y895z/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629001177.0
    },
    {
        "author": "bbq-ribs",
        "body": "he looks pretty happy, does his happiness affect the stock market?\n\n\nif so we may have found the oracle traders were waiting over 2 decades for",
        "created_utc": 1629662505,
        "id": "h9y51sp",
        "permalink": "/r/wallstreetbets/comments/p8cqpr/weekend_discussion_thread_for_the_weekend_of/h9y51sp/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629691305.0
    },
    {
        "author": "Redditor45643335",
        "body": "I just checked the stock price of Oracle for like the first time in 10 years expecting it to be dead but its actually popping off... I thought it was in the same league as IBM and Cisco.",
        "created_utc": 1629482954,
        "id": "h9ow6we",
        "permalink": "/r/wallstreetbets/comments/p825zj/daily_discussion_thread_for_august_20_2021/h9ow6we/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629511754.0
    },
    {
        "author": "lowrankcluster",
        "body": "Couple of flaws in your statement.\n\n&gt;75% of the market now is Android.\n\nDoesn't matter. *Profits* Apple make selling to 5% of the global smartphone market is more than what the rest of 75% make.\n\n\\&gt; The problem with closed platforms is they will eventually find themselves behind.\n\nAgain, not true. There are plenty of examples of widely used software that are not open sourced and easily outcompete the open source counterparts. Windows and Mac in Desktop/Laptop space. Office by Microsoft. Database products by AWS/Oracle. Content creation software by Adobe. Many more.\n\n\\&gt; it's Apple vs. the world.\n\nAnd Apple has won in *every single* field they have entered. Self-driving and VR are upcoming techs, but just because its Apple vs world doesn't mean Apple will be at a huge disadvantage. Indeed, it is the world that is at disadvantage when Apple enters a field.\n\n\\&gt; Apple also charges a fee to develop apps. It's free on Android.\n\nDespite iOS being less than 20% of market, more than 50% of revenue developers make are on iOS. Not sure what fee are you talking about, but the fact that iOS is still a priority for developers despite them having to pay a fee actually puts Android in bad light.\n\n\\&gt; iOS it is a massive pain\n\n99% of people on this planet just download from App Store directly, whether it is iOS or Android.\n\n\\&gt; The reality is they're losing margin on their phones\n\niPhones are the most profitable item at Apple, accounting for majority of their profits. If you think that they are committing a financial fraud by reporting $20B+ profits from iPhone sales instead of a loss, then I don't know what to say. This would be the biggest scam in the history of mankind.\n\n\\&gt; Also we are at peak phones now - I only see downward pressure on margins due to the competition\n\nActually, if you think that smartphone sales are at peak (which is incorrect), then Apple is even more likely to maintain sales (generally, people who buy cheap &lt;$400 Android are less likely to buy a phone when new one comes out when old one works just fine).\n\n\\&gt; I always felt their original PE ratio\n\nPE ratio is high for companies who have high growth potential. Microsoft has been doing not bad in cloud segment and cloud segment market is not even at 5% potential. Now obviously, *you* don't think Apple and Microsoft will grow in future, but others do; so naturally, you would say their PE ratio is high.\n\n\\&gt; This was true years ago. Not true anymore.\n\nBased on sales of phones with cost &gt;= $700, Apple dominates and they do that with iPhone 12 more than they did with any other iPhone apart from iPhone 6.",
        "created_utc": 1628042819,
        "id": "h7mnsmr",
        "permalink": "/r/stocks/comments/opu5lc/intel_intc_q2_earnings_call_summary_07222021_pat/h7mnsmr/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628071619.0
    },
    {
        "author": "shortyafter",
        "body": "No, he's not an oracle, but that's entirely the point.  He admits his inability to predict things, and thus recommends prudent and conservative policies that can serve to mitigate potential risks and downside.  The Fed, on the other hand, is certain that they've got everything under control.",
        "created_utc": 1628171199,
        "id": "h7szcf5",
        "permalink": "/r/stocks/comments/oy57s2/the_coming_crisis/h7szcf5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628199999.0
    },
    {
        "author": "bootypatrol0889",
        "body": "Can I get your perspective on SPYG, MSFT, SQ, and ORCL? \n\nI feel SPYG is a slow grower but has always been successful.\n\nI feel MSFT is starting to outgrow its value a bit.\n\nSQ they have made a name for themselves, but I feel as if they are heavily over priced. They are basically paypal but deal with more point-of-transaction tech.\n\nORCL im on the fence, they are getting involved in a lot of companies and different parts of tech, but they exploded on value.",
        "created_utc": 1628212578,
        "id": "h7vq6ba",
        "permalink": "/r/stocks/comments/oymz16/delta_airlines/h7vq6ba/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628241378.0
    },
    {
        "author": "UpSideofDown",
        "body": "I have a good feeling about my ORCL puts next week...\n\n8/20p $80",
        "created_utc": 1628198651,
        "id": "h7uwnda",
        "permalink": "/r/wallstreetbets/comments/oyqh8q/what_are_your_moves_tomorrow_august_06_2021/h7uwnda/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628227451.0
    },
    {
        "author": "UpSideofDown",
        "body": "Figures...  The ONLY stock I'm short, ORCL, is popping off while the rest of the market tanks.   SMH",
        "created_utc": 1628000007,
        "id": "h7jzejt",
        "permalink": "/r/wallstreetbets/comments/ox095v/daily_discussion_thread_for_august_03_2021/h7jzejt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628028807.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$ORCL (Oracle) ready to hit back at and beyond ATHs by EOW",
        "created_utc": 1628001231,
        "id": "h7k20ih",
        "permalink": "/r/wallstreetbets/comments/ox095v/daily_discussion_thread_for_august_03_2021/h7k20ih/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628030031.0
    },
    {
        "author": "FinndBors",
        "body": "You are cherry-picking data. Not hp or compaq or oracle. Netflix and Amazon have high PEs right now.\n\nAlso, peak PEs mostly happened in 2001 when earnings crashed.\n\nDon’t get me wrong, 2000 on average for big tech probably had slightly higher ratios than we have today. But not by much. And some metrics like shitty companies IPOing, it’s worse.\n\nThe only thing that justifies valuations now compared to 2000 is the interest rates. If we had 2000 level interest rates, I’d be pulling my money out of the market.",
        "created_utc": 1627826528,
        "id": "h7bbovc",
        "permalink": "/r/investing/comments/ovlyl4/nikola_electric_truck_prototypes_were_powered_by/h7bbovc/",
        "score": 1,
        "subreddit": "investing",
        "created": 1627855328.0
    },
    {
        "author": "bad_aim_222",
        "body": "Isn't Texas a red state or has that change? Big companies from Silicon Valley like HP and Oracle are fed up with California and moving there. As far as your stereo type about people in red states, I think you should travel the country more. There are some depressing places in the middle of the country. But the people who live in places in Charleston, SC or Savannah, GA are some of the nicest people you'll meet in the country. Far more friendly and sincere than people I've met in LA or Orange County. I also just looked at the top 10 states with the highest drug addictions. California isn't in it, but the list is a half split between blue states and red states. Also elite schools aren't just in California. There is Harvard, MIT, and many more in New England. The education system in that area in general far beats out the California school systems.",
        "created_utc": 1628854887,
        "id": "h8ru42x",
        "permalink": "/r/stocks/comments/p38ua1/disney_is_moving_over_2000_corporate_jobs_from/h8ru42x/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628883687.0
    },
    {
        "author": "SpliTTMark",
        "body": "Is Amazon msft google cloudflare Salesforce ibm oracle bb not enough?",
        "created_utc": 1628811490,
        "id": "h8pvx1b",
        "permalink": "/r/stocks/comments/p30g1x/are_china_stocks_over_what_hope_is_there_itll/h8pvx1b/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628840290.0
    },
    {
        "author": "CommanderInTweet",
        "body": "Oracle 90C = free monies",
        "created_utc": 1628537496,
        "id": "h8bm432",
        "permalink": "/r/wallstreetbets/comments/p0yfax/daily_discussion_thread_for_august_09_2021/h8bm432/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628566296.0
    },
    {
        "author": "ManBearPig169",
        "body": "I feel like the ones that do end up doing well are because she bought and other people bought because they think shes some kinda Oracle.",
        "created_utc": 1628393819,
        "id": "h84qrh0",
        "permalink": "/r/wallstreetbets/comments/ozebic/weekend_discussion_thread_for_the_weekend_of/h84qrh0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628422619.0
    },
    {
        "author": "DrunkMonkeylondon",
        "body": "&gt;Not sure if I’m missing it… the document you linked here shows the fund she manages following the trend of the market, yet still having higher returns.  \n&gt;  \n&gt;Didn’t know looking like a modest librarian helps you con billions out of people. If I learned anything from my time in sales, it’s usually the hot blondes (think Katie Holmes) that have an easier time.  \n&gt;  \n&gt;I’m not saying she’s an oracle, I’m saying she has been doing better than the market for decades now. And that’s an incredible achievement in the world of finance. I’m rather curious as to why people are jumping on some sort of bandwagon against her using “this article says she didn’t predict the future! she’s a joke!” as some sort of evidence that her investment decisions are poor.\n\nFirstly, [have a look at this long-term record she created at her previous outfit](https://imgur.com/a/233jqI3). Her previous financial backer asked her to leave. Think about it. Why do you think they'd ask the great-and-almighty financial beast &amp; guru Cathy Wood to leave? Obviously she wasn't that good. She took from all her \"investors\" 2% of their portfolio as management fees. She took twice what they made !!\n\nSecondly, I don't expect to convince you; and, I am not attacking you. I have an issue with Cathy. I don't like Cathy Wood because I think she is a total sales person. The normal hedge fund and active investing fund is all about marketing. They want clients. Clients bring in money which they can siphon. They have huge presentations with great big powerpoints and amazing ohh-ahh graphs. If you look at the Roaring 20s, you had every so-called investor duping people out of their savings with amazing visions of the future - innovation, new financial systems, booming economic developments, new fresh &amp; rising markets, exciting ever-changing technologies, new communication and - best of all - everyone is going to get rich and make 200% per year. Same thing in the 1950s. Some investor I was reading about collected sums from admiring people and the whole thing flopped after a few years. In 1999, Alexander Cheung from the Monument Fund - after returning 117.3%, predicted his fund would gain 50%+ a year\r on the horizon. And it was new technology - the buzz word. Cathy Wood mentions all the right words. She talks about all the hyped-up exciting mega-sexy ideas of our times like space-travel, gene splicing, cry7ptocurrency, electric cars, semiconductors, RobinHood - and people love her. She doesn't discuss company fundamentals or their balance sheets. Who cares about the financials - people want drama and excitement, and that's what she does. I watched her in an interview, she said \"I want to improve humanity\". This woman just says all the uplifting and mesmerising lines people want to hear. You feel like you're part of something bigger than you. You're going to shape the planet. It's like how a minister speaks. And - of course - we're all going to get rich.\n\nAnyhow. This is how it looks to me, and it upsets me that people will lose so much of their savings going with this egomaniac. If you're a hardcore believer in Cathy Wood then probably nothing I could say would make any difference. At least, I hope you can see a different perspective.\n\nAll the bets with your investments :)",
        "created_utc": 1629196071,
        "id": "h99udr8",
        "permalink": "/r/ValueInvesting/comments/p5wg2e/looks_like_burry_is_shorting_arkk_i_ranted_about/h99udr8/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1629224871.0
    },
    {
        "author": "andrei_89",
        "body": "True, you only have to be right at Lotto once too, to become a millionaire. That doesn't make you an oracle. We call that luck.\n Your second statement is pure speculation and has no meaning. What does 'by a large margin' mean?",
        "created_utc": 1629213511,
        "id": "h9asf1h",
        "permalink": "/r/StockMarket/comments/p5kk1u/the_supercycle_or_a_bubble_waiting_to_be_burst/h9asf1h/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1629242311.0
    },
    {
        "author": "civildisobedient",
        "body": "I would avoid like the plague, but only because I have a passing familiarity with the Siebel CRM, which was Tom Siebel's former project before he sold it off to Oracle.  A giant, steaming mess.",
        "created_utc": 1629287951,
        "id": "h9eej30",
        "permalink": "/r/stocks/comments/p663uz/what_are_your_thoughts_on_c3ai/h9eej30/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629316751.0
    },
    {
        "author": "bungholio99",
        "body": "Do a smart pick that doesn’t make you work to much...do you understand tech maybe pick Oracle/Cisco, do you understand retail e-commerce maybe Amazon, best pick would maybe Coca Cola you understand the business and you can also rely on other reports..\n\nDon’t take something to fancy and difficult to understand and explain like google, coinbase or Tesla.",
        "created_utc": 1629869939,
        "id": "ha9cvbx",
        "permalink": "/r/ValueInvesting/comments/pax7r1/which_stock_from_the_sp_500_would_you_want_to_do/ha9cvbx/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1629898739.0
    },
    {
        "author": "M_Scaevola",
        "body": "A moat in consumer products is easy enough to spot. Progressive in car insurance (right now at least, maybe Geico makes a comeback). Apple in computers. Walmart. Amazon. Mars Candy. It’s all qualitative in nature though, so I don’t know how useful a service for that would be.\n\nGetting outside of consumer facing entities, you tend to need some familiarity with the industry (this is why lynch stresses local knowledge). Cisco for networking technologies. Microsoft and Oracle both dominate database markets, even with cloud in roads.\n\nConglomerates or even large business with multiple product lines may have moats in some areas, but not in others. Activision has a moat with candy crush, but they gave up their market share with World of Warcraft through sheer stupidity. Nintendo partially owns the Pokémon Company. But both companies also have a lot of other baggage that may hurt the company.",
        "created_utc": 1629736555,
        "id": "ha1t5et",
        "permalink": "/r/ValueInvesting/comments/p9yd2f/ive_read_a_couple_of_books_including_some_of/ha1t5et/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1629765355.0
    },
    {
        "author": "Ischmetch",
        "body": "Azure is rising but Google, IBM, and Oracle are irrelevant.",
        "created_utc": 1630030664,
        "id": "hai7rmo",
        "permalink": "/r/stocks/comments/pc71xx/bear_case_for_amazonamzn/hai7rmo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630059464.0
    },
    {
        "author": "Soft-Implement-4048",
        "body": "Cardano smart contracts, Ergo is their oracle and I would suspect that their Decentralized Exchange will come online.",
        "created_utc": 1630372985,
        "id": "hb042iv",
        "permalink": "/r/Wallstreetbetsnew/comments/pejoyv/low_risk_10x_opportunity/hb042iv/",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1630401785.0
    },
    {
        "author": "Porkysays",
        "body": "6-7% of all peeps dropping out of the game. Means nothing when we have a few billion waiting to join in the game. The homes will be foreclosed and bought by zillow and relisted. Stocks should do fine. Especially zillow stock. I am holding IBM and Tesla. IBM is undervalued turn around cloud stock that will start flying soon.  Tesla is about to be a government hand out company like Oracle or Lockheed. We have never had a crash during a democratic presidency and we aren;t getting one now.",
        "created_utc": 1627900021,
        "id": "h7exa1t",
        "permalink": "/r/stocks/comments/ow9e1i/moratorium_on_foreclosures_and_deferred_mortgage/h7exa1t/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627928821.0
    },
    {
        "author": "CommanderInTweet",
        "body": "Oracle puts about to print?",
        "created_utc": 1628017195,
        "id": "h7l3cvk",
        "permalink": "/r/wallstreetbets/comments/owmjjx/what_are_your_moves_tomorrow_august_03_2021/h7l3cvk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628045995.0
    },
    {
        "author": "tmoney_99",
        "body": "it’s fine ORCL you can be the only stonk the performs today",
        "created_utc": 1628001485,
        "id": "h7k2j5c",
        "permalink": "/r/wallstreetbets/comments/ox095v/daily_discussion_thread_for_august_03_2021/h7k2j5c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628030285.0
    },
    {
        "author": "arizonamoonshine",
        "body": "This aged well. FFWD to August 3, 2021. Moderna on the brink of $400.\n\nYou sir are an Oracle. Thoughts on earnings tomorrow? I have $300 Puts and am currently getting destroyed",
        "created_utc": 1628042567,
        "id": "h7mna8o",
        "permalink": "/r/wallstreetbets/comments/muu2xs/moderna_to_220_per_share_by_nov_1st/h7mna8o/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628071367.0
    },
    {
        "author": "PsyAyeAyeDuck",
        "body": "So because he was right once he's an economic oracle now?  Anyone claim a crash every single year.  It takes one person saying the right thing at the right time every single year and suddenly everything they say is going to happen.  \n\n\nIt's like going to a roulette wheel, say that the ball is going to land on 32, and claiming that someone is good gambler because the ball landed on 32 after X roulette spins.",
        "created_utc": 1628170506,
        "id": "h7sxvmu",
        "permalink": "/r/stocks/comments/oy57s2/the_coming_crisis/h7sxvmu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628199306.0
    },
    {
        "author": "tmoney_99",
        "body": "ORCL",
        "created_utc": 1628271700,
        "id": "h7ykkao",
        "permalink": "/r/wallstreetbets/comments/oz3mrm/daily_discussion_thread_for_august_06_2021/h7ykkao/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628300500.0
    },
    {
        "author": "Steak-Complex",
        "body": "The monty hall problem implies that existence of an all knowing oracle. (someone who knows where the car is). There is so such person in stocks, only people good at guessing.",
        "created_utc": 1628963840,
        "id": "h8xpdtb",
        "permalink": "/r/investing/comments/p452jb/investing_warren_buffets_bet_and_the_monty_hall/h8xpdtb/",
        "score": 1,
        "subreddit": "investing",
        "created": 1628992640.0
    },
    {
        "author": "Burnit0ut",
        "body": "They already have. Tesla, Oracle, Samsung, I think Apple too.",
        "created_utc": 1628807611,
        "id": "h8po0q4",
        "permalink": "/r/stocks/comments/p38ua1/disney_is_moving_over_2000_corporate_jobs_from/h8po0q4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628836411.0
    },
    {
        "author": "mettle",
        "body": "Again, i'm just reiterating the bull case (there's a million reasons why this wouldn't come to fruition) but back-of-the-envelope: restaurant revenue is \\~$1T, takeout \\~$300B, Doordash could eventually take 10% of that, say $30B, which puts revenue just below Oracle, about the same as Tesla, Raytheon and HPE. Those market caps are $250B, $700B, $130B and $20B.\n\nSo, if you squint, DoorDash at $60B can slot right in there.\n\nI could do a fancy due diligence thing with forward free cash flow yadda yadda yadda, but I'm not that committed.",
        "created_utc": 1628813134,
        "id": "h8pzq07",
        "permalink": "/r/stocks/comments/p2m8k1/doordash_survival/h8pzq07/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628841934.0
    },
    {
        "author": "CommanderInTweet",
        "body": "Oracle 90C going to be free money this week",
        "created_utc": 1628531798,
        "id": "h8b8mg6",
        "permalink": "/r/wallstreetbets/comments/p0yfax/daily_discussion_thread_for_august_09_2021/h8b8mg6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628560598.0
    },
    {
        "author": "SlothyPotato",
        "body": "I've noticed that ORCL has been spiking each morning, then quickly going back to flatish with a slow burn up. Bought $91Cs this morning to sell tomorrow morning. I am a TA god.",
        "created_utc": 1629248239,
        "id": "h9cv4k4",
        "permalink": "/r/wallstreetbets/comments/p6b7cz/what_are_your_moves_tomorrow_august_18_2021/h9cv4k4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629277039.0
    },
    {
        "author": "The_Sanch1128",
        "body": "No matter what the hack media suck-up writers may say, Buffett and Munger have not always been right.  They have been right more than wrong, and the degree of their being right has been more than the degree of their being wrong, but neither the Oracle nor his right bower have been infallible.\n\nAs for the Afghan army, anyone who was around in the early 70's when we turned all combat operations over to the SVA knew this would come as soon as we stopped propping them up.",
        "created_utc": 1629234993,
        "id": "h9c3psz",
        "permalink": "/r/stocks/comments/p62dds/chinese_stock_bloodbath_continues_with_baba/h9c3psz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629263793.0
    },
    {
        "author": "PromiseChain",
        "body": "Stock based compensation means the employees only make money if the company does well financially. The motivation is there and if you draw parallels to Tesla's beginnings (which isn't absurd at all, the only difference is the amount of advertising PLTR does and obviously they're in different sectors) they drive the culture of their employees to be company focused, even making cringy Lord of the Rings memes because that's just SO Palantir, btw we have some nice polos with the logo on it, they're free for fellow hobbits!\n\nPeople don't know how much they have in common with Tesla's culture now that they have 3K sales people all trying to increase the stock price they are being paid with. Peter Thiel and Elon being partners in the past? Couldn't be that they have similar philosophies socially and Karp reigns in the politics with actual know-how?\n\nYou don't have to be optimistic to see that this volume of sales people plus their weird yet powerful bubble is a trend that a lot of successful, long-term companies embrace. We're not talking ping-pong tables in the meeting rooms either we're talking people who make drones that clear minefields as a hobby. These people are carefully chosen and different and they're motivated to make PLTR line go up.\n\nI'm telling you. This is going to be looked back at as super obvious and people will say \"Duh why didn't I see what was happening look at all of these stupid PLTR windbreakers these guys have show up in when they make these deals?\"\n\nOracle sent a bunch of bald fucks in Nordstrom sales rack garbage to my work and they were visibly sweating after lunch don't compare them to other data solutions companies.",
        "created_utc": 1629680676,
        "id": "h9z7xc6",
        "permalink": "/r/wallstreetbets/comments/p96lm2/pltr_is_going_to_build_generational_tendiness/h9z7xc6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629709476.0
    },
    {
        "author": "zkdesk",
        "body": "I am confused as hell. That’s overcrowded space with AWS,  Google, Microsoft, Oracle, IBM, and another 10 smaller players. What’s so special about BASE?",
        "created_utc": 1629928611,
        "id": "hacj2qn",
        "permalink": "/r/wallstreetbets/comments/pbkgb2/base_may_be_the_best_stock_youve_never_heard_of/hacj2qn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629957411.0
    },
    {
        "author": "geniusmanchild",
        "body": "Y’all sleeping on WorkDay. They may be HR but they’re about cuck Oracle and SAP. Money machine.\n\nUp 5% after hours based on strong earnings.",
        "created_utc": 1630009963,
        "id": "hagxxcf",
        "permalink": "/r/wallstreetbets/comments/p997ik/fraternal_association_of_gambling_gentlemen_and/hagxxcf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630038763.0
    },
    {
        "author": "confused-caveman",
        "body": "What other cool stuff is there to do other than listen to the oracle prophesize?",
        "created_utc": 1630032069,
        "id": "haiaqxs",
        "permalink": "/r/ValueInvesting/comments/pbzmd2/anyone_been_to_the_berkshire_hathaway_annual/haiaqxs/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1630060869.0
    },
    {
        "author": "Dadd_io",
        "body": "Cisco, Intel, and Oracle were all dot-com darlings with large revenue and growth trajectories and PEs similar to Nvidia.  It wasn't all Webvan and pets.com (which by the way are basically Instacart and chewy. com all over again).",
        "created_utc": 1629748144,
        "id": "ha2lglk",
        "permalink": "/r/investing/comments/pa0kix/as_im_writing_this_nvda_has_overtaken_tsm_as_the/ha2lglk/",
        "score": 1,
        "subreddit": "investing",
        "created": 1629776944.0
    },
    {
        "author": "FinndBors",
        "body": "You are cherry-picking data. Not hp or compaq or oracle. Netflix and Amazon have high PEs right now.\n\nAlso, peak PEs mostly happened in 2001 when earnings crashed.\n\nDon’t get me wrong, 2000 on average for big tech probably had slightly higher ratios than we have today. But not by much. And some metrics like shitty companies IPOing, it’s worse.\n\nThe only thing that justifies valuations now compared to 2000 is the interest rates. If we had 2000 level interest rates, I’d be pulling my money out of the market.",
        "created_utc": 1627826528,
        "id": "h7bbovc",
        "permalink": "/r/investing/comments/ovlyl4/nikola_electric_truck_prototypes_were_powered_by/h7bbovc/",
        "score": 1,
        "subreddit": "investing",
        "created": 1627855328.0
    }
]