[
    {
        "author": "ShitItsReverseFlash",
        "body": "I did my voting for Palantir this morning while walking on the treadmill at the gym. Did it all through the Fidelity app on my phone. Super easy and I felt important for five minutes.",
        "created_utc": 1620228949,
        "id": "gx1cikl",
        "score": 305,
        "subreddit": "wallstreetbets",
        "created": 1620257749.0
    },
    {
        "author": "vzoadao",
        "body": "Is this an ad for fidelity",
        "created_utc": 1619908810,
        "id": "gwlhlo5",
        "score": 302,
        "subreddit": "wallstreetbets",
        "created": 1619937610.0
    },
    {
        "author": "Hopeful_Stoic",
        "body": "Try calling the number for the fidelity rep. Explain that all is according to plan and your trading activity is consistent with your investment objective. See what the reaction is. If you want to go to the next level..",
        "created_utc": 1620284457,
        "id": "gx4hhwd",
        "score": 281,
        "subreddit": "wallstreetbets",
        "created": 1620313257.0
    },
    {
        "author": "Feeling-Wallaby-4505",
        "body": "Fidelity",
        "created_utc": 1621259680,
        "id": "gyg17sa",
        "score": 254,
        "subreddit": "StockMarket",
        "created": 1621288480.0
    },
    {
        "author": "Asleepnolong3r",
        "body": "GME on fidelity requires 100% margin so he has either the Cash or the Securities to back it. Let the man ride the wave!",
        "created_utc": 1620756919,
        "id": "gxramkl",
        "score": 244,
        "subreddit": "wallstreetbets",
        "created": 1620785719.0
    },
    {
        "author": "Zombie-Feeling",
        "body": "I moved all my gme shares from RH to fidelity back in March  and yesterday i moved the rest of my portfolio to fidelity.",
        "created_utc": 1620096146,
        "id": "gwv1x4r",
        "score": 209,
        "subreddit": "wallstreetbets",
        "created": 1620124946.0
    },
    {
        "author": "goobymuggle",
        "body": "This is fidelity, it will always purchase on margin if you have it turned on for your account. You have to have the cash reqs to back it up.",
        "created_utc": 1620754806,
        "id": "gxr5gep",
        "score": 201,
        "subreddit": "wallstreetbets",
        "created": 1620783606.0
    },
    {
        "author": "GYN-k4H-Q3z-75B",
        "body": "House call makes it sound like somebody from Fidelity is coming to your home to slap you. You'd probably even like that.",
        "created_utc": 1620719000,
        "id": "gxpeheo",
        "score": 195,
        "subreddit": "wallstreetbets",
        "created": 1620747800.0
    },
    {
        "author": "NoMoLerking",
        "body": "You guys don’t post those Fidelity letters on the fridge?",
        "created_utc": 1621190410,
        "id": "gycphhy",
        "score": 195,
        "subreddit": "wallstreetbets",
        "created": 1621219210.0
    },
    {
        "author": "qwertyWarrior77",
        "body": "Wait wait wait you’re telling me that in the fine print they stated the right to do this and in all reality a broker can NOT offer the purchase of a security. Damn I was just about to sue the balls off fidelity for not letting me yolo into MicroCaps with no fillings but I guess it all adds up now.",
        "created_utc": 1619878372,
        "id": "gwjiv9f",
        "score": 169,
        "subreddit": "stocks",
        "created": 1619907172.0
    },
    {
        "author": "jfer_dpt",
        "body": "My opinion: Fidelity is among the best of brokers. They are also developing a more “user friendly” app due to an overwhelming number of requests",
        "created_utc": 1620179777,
        "id": "gwz7by4",
        "score": 168,
        "subreddit": "wallstreetbets",
        "created": 1620208577.0
    },
    {
        "author": "mcinthedorm",
        "body": "Fuck you it’s 6:30 am and my half asleep ass actually tried to find a ticker for Reading Railroad on Fidelity",
        "created_utc": 1620473395,
        "id": "gxdln70",
        "score": 166,
        "subreddit": "investing",
        "created": 1620502195.0
    },
    {
        "author": "ark_mod",
        "body": "If you have enough money in a trading account the company (Fidelity, Charles Schwab, etc.) will let you buy stocks on credit. This can amplify your gains - but also amplifies your loses which can easily wipe out your investment. \n\nAs an example, say I have 100k in Fidelity. I purchased a stock and it goes up 10% - it's now worth 110k - a nice 10k profit. However, if I wanted I could purchase on margin (credit) - using Fidelities money I buy $1 million in stock. This same 10% rise turns my 100k + 900k from Fidelity into $1.1 million - I see a profit of 100k on a 100k investment by leveraging the banks money to increase my position. This works great when the stocks (or options) value rises - the gains are amplified.\n\nThe opposite side occurs as well. Take the same example - $1 million in stock, $100k cash + $900k borrowed on margin - but the stock goes down 10%. If using only your money your $100k goes down to $90k. You lost 10%. Now with margin - your $100k + Fidelities $900k goes down 10%. However Fidelity is going to cover their loss. They do this through a margin call. Basically they have the right to sell all your assets they hold to prevent loss. They sell your full position - all $100k leaving you with $0 to make sure they get back the money they borrowed you (your now $90k + their now $810k = $900k you borrowed). \n\nBasically margin calls can wipe out your full position if the stock you bought on margin drops too much. Look at the recent collapse of Archegos Capital if your curious what a margin call in the billions of dollars looks like. Banks registered big losses because a Hedge Fund made some bad leveraged trades to an extreme scale.",
        "created_utc": 1620751117,
        "id": "gxqwgcf",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1620779917.0
    },
    {
        "author": "realTomDragon",
        "body": "Did you mean Fidelity or Vanguard?  = )",
        "created_utc": 1621183897,
        "id": "gycaqij",
        "score": 159,
        "subreddit": "stocks",
        "created": 1621212697.0
    },
    {
        "author": "jeff406",
        "body": "Beautiful. Now transfer them to fidelity so vlad doesn't snatch your tendies!",
        "created_utc": 1621874496,
        "id": "gzaflyc",
        "score": 153,
        "subreddit": "wallstreetbets",
        "created": 1621903296.0
    },
    {
        "author": "silverlack",
        "body": "Fidelity is great!",
        "created_utc": 1621262146,
        "id": "gyg6puh",
        "score": 142,
        "subreddit": "StockMarket",
        "created": 1621290946.0
    },
    {
        "author": "rfreitas115",
        "body": "Just initiated my transfer to Fidelity yesterday. Waited too long to do so. It was very easy",
        "created_utc": 1620388203,
        "id": "gx9h6rz",
        "score": 134,
        "subreddit": "Wallstreetbetsnew",
        "created": 1620417003.0
    },
    {
        "author": "420_E-SportsMasta",
        "body": "[no you want to fill up waterbed mattresses with gas, cuz you can hold more of it](https://i.imgur.com/X1fysRU_d.webp?maxwidth=640&amp;shape=thumb&amp;fidelity=medium)",
        "created_utc": 1621457232,
        "id": "gyqqlda",
        "score": 127,
        "subreddit": "wallstreetbets",
        "created": 1621486032.0
    },
    {
        "author": "asuhdue",
        "body": "“Deposits entire stimulus straight into FIDELITY account!”",
        "created_utc": 1620802935,
        "id": "gxtsmnn",
        "score": 126,
        "subreddit": "wallstreetbets",
        "created": 1620831735.0
    },
    {
        "author": "hsudonym_",
        "body": "Because Fidelity cares more about their customers than Robinhood does.",
        "created_utc": 1621272106,
        "id": "gygumlk",
        "score": 126,
        "subreddit": "StockMarket",
        "created": 1621300906.0
    },
    {
        "author": "bullshadow",
        "body": "3 days? Fidelity let’s you invest the money as soon as you hit transfer.",
        "created_utc": 1620907468,
        "id": "gxyvhsr",
        "score": 117,
        "subreddit": "stocks",
        "created": 1620936268.0
    },
    {
        "author": "yungchow",
        "body": "It’s the most user friendly brokerage app on mobile. By a massive degree.\n\nI use Robinhood to look at things, but fidelity to trade",
        "created_utc": 1620586773,
        "id": "gxixhxy",
        "score": 111,
        "subreddit": "StockMarket",
        "created": 1620615573.0
    },
    {
        "author": "bevo_expat",
        "body": "I think that is just the type of account the OP has access to with Fidelity. My account also shows “margin” even though I haven’t bought any shares using margin. \n\nIf you apply for options trading (level 3, I think is how they classify it) with Fidelity you automatically switch to a margin account.",
        "created_utc": 1620759529,
        "id": "gxrh0r1",
        "score": 89,
        "subreddit": "wallstreetbets",
        "created": 1620788329.0
    },
    {
        "author": "Kozy_Bear",
        "body": "I think more people are transferring out than opening new accounts. I remember somebody on r/GME saying they talked to a fidelity rep that told him over 8M Robinhood users transferred over to them, myself included.",
        "created_utc": 1619879186,
        "id": "gwjkk77",
        "score": 83,
        "subreddit": "stocks",
        "created": 1619907986.0
    },
    {
        "author": "BOOLinvestmentCo",
        "body": "The only phone call this year I have received when someone is checking to see if I was okay was Fidelity and it was just now",
        "created_utc": 1620821425,
        "id": "gxuefj2",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1620850225.0
    },
    {
        "author": "Item_Legitimate",
        "body": "\"Yes...Fidelity customer support? Yes, I would like to report fraudulent, unauthorized purchases in my brokerage account. Yes, all of the tech ones...\"",
        "created_utc": 1620737667,
        "id": "gxq22i8",
        "score": 70,
        "subreddit": "stocks",
        "created": 1620766467.0
    },
    {
        "author": "aBushelofApples",
        "body": "As an experiment, I picked 7 companies with equity summary scores of 9.0 or above from fidelity at the end of March. So far, I'm up 35% on average for those. They give a basic rundown of their fundamental analysis. \nMore recently I've just been fed up with the market and just putting money into index etfs.",
        "created_utc": 1621997122,
        "id": "gzgw76f",
        "score": 69,
        "subreddit": "stocks",
        "created": 1622025922.0
    },
    {
        "author": "shiv81",
        "body": "Time for a transfer to Fidelity or Schwab. Both are good but I've heard Fidelity has a nice app redesign coming soon",
        "created_utc": 1620227023,
        "id": "gx17vv8",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1620255823.0
    },
    {
        "author": "Dridas1",
        "body": "This is exactly what I have been saying!   No way should a hedge fund also be a market maker.  \n\nWith 002 off the table until late June, I’m considering a brokerage that doesn’t get paid  for order flow, like Fidelity.",
        "created_utc": 1620405809,
        "id": "gxaieum",
        "score": 68,
        "subreddit": "Wallstreetbetsnew",
        "created": 1620434609.0
    },
    {
        "author": "WhatUpCoral",
        "body": "Fidelity and Vanguard are two brokerages that the GME army seems to trust the most!",
        "created_utc": 1619887682,
        "id": "gwk4fqv",
        "score": 66,
        "subreddit": "stocks",
        "created": 1619916482.0
    },
    {
        "author": "Posts_as_Slick_Rick",
        "body": "fidelity treats me well. RH tried to bend me over and have their way with me a few times. After the third time, I said, \"not a fourth, NO SIR!\"",
        "created_utc": 1622139002,
        "id": "gznxdtc",
        "score": 62,
        "subreddit": "wallstreetbets",
        "created": 1622167802.0
    },
    {
        "author": "aloneforevaprolly",
        "body": "Fidelity or TD. I use TD and their customer service is fucking fantastic and their user interface on TOS (Think or Swim) is next level.",
        "created_utc": 1620568902,
        "id": "gxhxmh6",
        "score": 61,
        "subreddit": "stocks",
        "created": 1620597702.0
    },
    {
        "author": "APastaFreeD",
        "body": "LOL WHAT?! The broker you're using literally won't let you trade? That's ridiculous. I get \"flagged\" but that doesn't mean shit. My account is \"suspended\" but only means I can't trade until my cash has \"settled\" and even if I keep breaking the rule there are ZERO further consequences (I asked to make sure).\n\nTldr: Switch to Fidelity",
        "created_utc": 1620960634,
        "id": "gy21hvj",
        "score": 61,
        "subreddit": "pennystocks",
        "created": 1620989434.0
    },
    {
        "author": "Whyisthissobroken",
        "body": "I opened my Fidelity account in 1992. They've been fantastic ever since.",
        "created_utc": 1621607603,
        "id": "gyy43gj",
        "score": 59,
        "subreddit": "wallstreetbets",
        "created": 1621636403.0
    },
    {
        "author": "BreakfastHarvey",
        "body": "Fidelity. TD Ameritrade.",
        "created_utc": 1620565063,
        "id": "gxhrgas",
        "score": 57,
        "subreddit": "wallstreetbets",
        "created": 1620593863.0
    },
    {
        "author": "whirl-pool",
        "body": "TIL. Fidelity staff are our wives boyfriends.",
        "created_utc": 1620723181,
        "id": "gxpitnf",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1620751981.0
    },
    {
        "author": "chewtality",
        "body": "You can trade micro caps in Fidelity, you just have to call them ask them to let you. They read you a few warning statements and you agree to it, and then they turn it on for you.",
        "created_utc": 1619881166,
        "id": "gwjozfh",
        "score": 55,
        "subreddit": "stocks",
        "created": 1619909966.0
    },
    {
        "author": "Drwhalefart",
        "body": "Yeah but this is a Fidelity screenshot.",
        "created_utc": 1620766385,
        "id": "gxrxn7o",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1620795185.0
    },
    {
        "author": "irishdud1",
        "body": "Any time between now and July 16th is fine :)\n\n5/5 - Fidelity \"SHOULD\" provide proxy voting for GME\n\n5/6 - House financial committee with DTCC and GG from the SEC\n\nIV is scraping lows not seen since asking the hot chick to prom in high school.\n\nConfirmation: confirmed.",
        "created_utc": 1620166179,
        "id": "gwyelta",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1620194979.0
    },
    {
        "author": "brownstevemcqueen3",
        "body": "Fidelity fucks, love them",
        "created_utc": 1620080986,
        "id": "gwu6p0r",
        "score": 54,
        "subreddit": "Wallstreetbetsnew",
        "created": 1620109786.0
    },
    {
        "author": "PreciousMetalRefiner",
        "body": "I deleted Robinhood the first time Vlad fucked me, I won't be returning, fidelity works just fine.",
        "created_utc": 1620310357,
        "id": "gx5hh0l",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1620339157.0
    },
    {
        "author": "mydogisbad79",
        "body": "Guess think that throwing away 10K is a silent cry for help. \n“we care about your well being so kindly delete your account and throw your phone into the nearest lake. Signed Your friends at Fidelity.”",
        "created_utc": 1620281253,
        "id": "gx4dmnx",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1620310053.0
    },
    {
        "author": "laern2splel",
        "body": "You should read what Matt Levine (Bloomberg Columnist) thinks about that, he has a very interesting opinion.\n\nIf a few corporations (BlackRock, Fidelity, Vanguard) own all the index funds that all people invest in, then they effectively own all the companies in the world. It would then make sense for all the companies to work together to maximize profits in order to make the most money for their common owners. What the are long term implications here of indexing? Does it take away all of the competition needed to spark the innovation of capitalism? Do we really need competition to spark innovation? It will be interesting to see how it progresses.",
        "created_utc": 1621995702,
        "id": "gzgtiw0",
        "score": 51,
        "subreddit": "CanadianInvestor",
        "created": 1622024502.0
    },
    {
        "author": "StonkyDaddy",
        "body": "Fidelity just has better customer service cause boomers like to be tickled.",
        "created_utc": 1621272431,
        "id": "gygvfm7",
        "score": 49,
        "subreddit": "StockMarket",
        "created": 1621301231.0
    },
    {
        "author": "Mister_Titty",
        "body": "Right or wrong, I respect your analysis. \n\nI would like to try and adjust your thinking in one area: lack of institutional ownership in this case is a good thing. Why? Because as institutions get interested, it will only be a positive. And there's LOTS of room for institutions to enter. Just imagine if Fidelity decides to 'take a position'. A purchase of $20 million will move the stock! Then BlackRock increases their holdings, then Goldman, then Putnam, and so on.\n\nJMHO",
        "created_utc": 1621038171,
        "id": "gy5wgcm",
        "score": 48,
        "subreddit": "stocks",
        "created": 1621066971.0
    },
    {
        "author": "Apestrongretard",
        "body": "Including fidelity is currently working on a complete overhaul on there user interface to get and keep customers coming from rh. Smart move on their part. They didn't need the new customers but none the less they are accommodating to them.",
        "created_utc": 1619881940,
        "id": "gwjqsj3",
        "score": 48,
        "subreddit": "stocks",
        "created": 1619910740.0
    },
    {
        "author": "Keith_13",
        "body": "The idea that someone shorting 1200 shares drove the price down doesn't really make a lot of sense.\n\nYou don't even know that the drop in availability was due to someone shorting.  It could just as easily be someone whose shares are available to be borrowed sold some shares (and the rise to 3000 could be that someone bought some; not necessarily someone covering).\n\nPersonally I have 33k shares and about 25k are lent out.  Fidelity pays me 60% of the borrow rate and today I was getting 2.5%; I'm hoping that it really has spiked to 40% (which would pay me 24% annualized)",
        "created_utc": 1620854684,
        "id": "gxwjr2i",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1620883484.0
    },
    {
        "author": "pogkob",
        "body": "Dumb question. How many do you get on fidelity?",
        "created_utc": 1620945307,
        "id": "gy187f6",
        "score": 47,
        "subreddit": "pennystocks",
        "created": 1620974107.0
    },
    {
        "author": "hak8or",
        "body": "Regarding moat, they've got competitors like robinhood and even other brokerages deciding to get in on this, like fidelity is doing with their mobile app (similar style to robinhood).\n\nThis is going to be a race to the bottom, in whuch there is rarely money to be made.",
        "created_utc": 1622135143,
        "id": "gzno3ib",
        "score": 47,
        "subreddit": "investing",
        "created": 1622163943.0
    },
    {
        "author": "Farrisson_Hord",
        "body": "I hear good things about fidelity",
        "created_utc": 1620541095,
        "id": "gxh070l",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1620569895.0
    },
    {
        "author": "Casualredum",
        "body": "People do realize RH wasn’t the only company who haulted trades right? Td did and many others.... fidelity is nice but they need to seriously catch up RH user interface!",
        "created_utc": 1621266975,
        "id": "gygi6l2",
        "score": 47,
        "subreddit": "StockMarket",
        "created": 1621295775.0
    },
    {
        "author": "VicTheRealest",
        "body": "I called them and had it moved over already, and I don't have margin on my account but I think Fidelity still shows it that way still for me.",
        "created_utc": 1620008872,
        "id": "gwqksmh",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1620037672.0
    },
    {
        "author": "ThatOneDrunkUncle",
        "body": "Can someone call Fidelity for me and tell them I ran away to Mexico and died and can't cover my margin call",
        "created_utc": 1622236292,
        "id": "gzsytkk",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1622265092.0
    },
    {
        "author": "Tothoro",
        "body": "Be wary of any foreign transaction fees, Fidelity charges $50 per transaction for example.",
        "created_utc": 1620050960,
        "id": "gws99cb",
        "score": 45,
        "subreddit": "pennystocks",
        "created": 1620079760.0
    },
    {
        "author": "imakesignalsbigger",
        "body": "Blows my mind that an insanely profitable company loses 10% on a 1 cent miss. Oh well, I'll be here holding my designer bags until we fly again 😬\n\n Boomer mode activated. Switching to Fidelity and deleting the app. See you fuckers in Dec '21 💎✋",
        "created_utc": 1620250892,
        "id": "gx2t6ah",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1620279692.0
    },
    {
        "author": "bcush",
        "body": "If they learned, they moved to Fidelity or another legitimate brokerage. I just transferred my RobbedHood account this week.",
        "created_utc": 1622169370,
        "id": "gzpp626",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1622198170.0
    },
    {
        "author": "SpeculativeFantasm",
        "body": "That’s literally the opposite of what I’ve heard. I’ve always seen the definition be about trading price not valuation. Like on investopedia and fidelity website etc. \n\nI guess they are sometimes used differently but in general I’ve seen microcap and nanocap used instead of penny when defining them based on market cap.",
        "created_utc": 1620402827,
        "id": "gxabccs",
        "score": 44,
        "subreddit": "pennystocks",
        "created": 1620431627.0
    },
    {
        "author": "ThrowRA-4545",
        "body": "**IN**Fidelity all along boys",
        "created_utc": 1620744667,
        "id": "gxqh388",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1620773467.0
    },
    {
        "author": "terrybmw335",
        "body": "Also for all the shit RH takes it's best for YOLO and out of the money options. I use fidelity for my main account and they charge a commission on options trades. Plus it's nice to have a \"clean\" account with legit investments and a \"dirty\" account with all my WSB bullshit in it. RH is perfect for the dirty account.",
        "created_utc": 1621460706,
        "id": "gyqzldb",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1621489506.0
    },
    {
        "author": "Western_Resort",
        "body": "Fidelity, is a great platform, good customer service, lots of learning tools.\nThe desktop trader pro app is a great options learning tool",
        "created_utc": 1620225845,
        "id": "gx154vz",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1620254645.0
    },
    {
        "author": "KevinGracie",
        "body": "Bought on fidelity yesterday although I had put an order in for $157 and it executed at $157.35.",
        "created_utc": 1620415463,
        "id": "gxb432j",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1620444263.0
    },
    {
        "author": "RainbowUnicorns",
        "body": "Fidelity",
        "created_utc": 1622126333,
        "id": "gzn3h4s",
        "score": 42,
        "subreddit": "investing",
        "created": 1622155133.0
    },
    {
        "author": "titoman106",
        "body": "Took me about two days for everything to go through. If you weren’t on a cash account make sure to call fidelity to change your stocks from margin to cash. Customer service was helpful with no issues",
        "created_utc": 1620392952,
        "id": "gx9peh8",
        "score": 41,
        "subreddit": "Wallstreetbetsnew",
        "created": 1620421752.0
    },
    {
        "author": "MrMeatcandy",
        "body": "Fuck robinhood but gah damn I'm jealous cause fidelity won't let a guy play with options",
        "created_utc": 1622342810,
        "id": "gzxqxp1",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1622371610.0
    },
    {
        "author": "McthiccumTheChikum",
        "body": "Congrats on two things, firstly your gains and secondly learning first hand the invaluable lesson in growth of capital through investments in the greatest wealth generator in history, the stock market.\n\nA piece of advice would be to transfer your funds out of Robinhood and into a quality brokerage ex: Fidelity, Vanguard, Schwab, Etrade etc. You will thank yourself for doing it in the future.\n\nBest of luck, be patient, there will be periods where stocks only go down. Ride it out.",
        "created_utc": 1620235864,
        "id": "gx1tjcj",
        "score": 40,
        "subreddit": "StockMarket",
        "created": 1620264664.0
    },
    {
        "author": "manitowoc2250",
        "body": "Robin Hood halts buying and selling of volatile stocks and crip toes cause they don't have enough liquidity, in times of urgency to sell and make profits, they leave you holding the bag. Switch to fidelity",
        "created_utc": 1621614210,
        "id": "gyyivfz",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1621643010.0
    },
    {
        "author": "TheIrishBAMF",
        "body": "I like Fidelity more than several other platforms I've used for my retirement funds.",
        "created_utc": 1621183908,
        "id": "gycarem",
        "score": 39,
        "subreddit": "stocks",
        "created": 1621212708.0
    },
    {
        "author": "shes_a_gdb",
        "body": "I use Fidelity and they have no fees and do fractional shares. Stop using RH.",
        "created_utc": 1621827195,
        "id": "gz8i9wf",
        "score": 39,
        "subreddit": "stocks",
        "created": 1621855995.0
    },
    {
        "author": "admiral_asswank",
        "body": "Fidelity was basically the only broker that didn't halt buying, though.\n\nSooooo...\n\nShut the fuck up. L",
        "created_utc": 1621847578,
        "id": "gz96lym",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1621876378.0
    },
    {
        "author": "RuthlessBih",
        "body": "They have 50% of their orders that run through Citadel ( do your own research I may be wrong).\n\nFind a reliable brokerage and stick with them, who preferably didn't halt trading during the mini squeeze in January. \n\nSome APES are switching to Fidelity and Vanguard. \nThere are plenty of other brokerages that provide \"Pro\" services for trading which use different clearing houses which  can be beneficial.",
        "created_utc": 1621990990,
        "id": "gzgkavx",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1622019790.0
    },
    {
        "author": "hhh888hhhh",
        "body": "Congrats. My recommendation, choose Fidelity.",
        "created_utc": 1621553288,
        "id": "gyvtf4u",
        "score": 34,
        "subreddit": "stocks",
        "created": 1621582088.0
    },
    {
        "author": "ChimpanEh",
        "body": "So buy shares with Fidelity then retard",
        "created_utc": 1621990320,
        "id": "gzgiyr1",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1622019120.0
    },
    {
        "author": "frostedbutts_",
        "body": "never heard of fidelity randomly selling shit for people",
        "created_utc": 1620985980,
        "id": "gy2yi40",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1621014780.0
    },
    {
        "author": "A-Good-Doggo",
        "body": "Fidelity is coming out with a new app in a month or so. Looks similar to the Robinhood UI",
        "created_utc": 1620257721,
        "id": "gx37xzr",
        "score": 31,
        "subreddit": "StockMarket",
        "created": 1620286521.0
    },
    {
        "author": "Positive-Dimension75",
        "body": "I use Fidelity and this is not the case for me.  It's 3 days.",
        "created_utc": 1620907730,
        "id": "gxyvwxv",
        "score": 30,
        "subreddit": "stocks",
        "created": 1620936530.0
    },
    {
        "author": "Maximusgoobe",
        "body": "Several of my brokerages utilize a proxy voting system, so I get an email with a link and a voting number to enter. I click the link, enter the necessary info (usually a PIN), vote, and all done! I'll also add that I'm speaking from an American perspective, and only for my experience with Fidelity and TD Ameritrade. \n\nIf you don't get it in emails, you may just need to log into your brokerage's website and see how they'll notify you of an annual meeting.",
        "created_utc": 1621890419,
        "id": "gzbg55x",
        "score": 30,
        "subreddit": "StockMarket",
        "created": 1621919219.0
    },
    {
        "author": "Juicy_Brucesky",
        "body": "I'm convinced most gain porn on this sub is posted by companies like Webull, Robinhood, Fidelity, etc to try and show people how much money they could make if you start trading too!",
        "created_utc": 1621027404,
        "id": "gy5bb1i",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1621056204.0
    },
    {
        "author": "alamedastrip",
        "body": "No Robinhood.   Fidelity or schwab.   I have accounts with both and once schwab incorporates TD ameritrade, which is in the works. Schwab will be even better.",
        "created_utc": 1622488601,
        "id": "h041jst",
        "score": 29,
        "subreddit": "stocks",
        "created": 1622517401.0
    },
    {
        "author": "marine_guy",
        "body": "I have had Schwab for years and have not experienced anything that you just mentioned. I know everyone has different experiences but I have nothing but great things to say about them. I’ve had accounts with Vanguard, Schwab, and Fidelity. Schwab is by far my favorite.",
        "created_utc": 1621608784,
        "id": "gyy6pwu",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1621637584.0
    },
    {
        "author": "joremero",
        "body": "&gt;for accounting purposes you theoretically reduced the cost basis\n\nshouldn't you redo your statement?\n\nfor accounting purposes, you reduced the cost basis (nothing theoretical about it)...at least when it's assigned\n\n[fidelity link](https://www.fidelity.com/learning-center/investment-products/options/tax-implications-covered-calls)\n\n\"If a covered call is assigned, the strike price plus the premium received becomes the sale price of the stock in determining gain or loss. The resulting gain or loss depends upon the holding period and the basis of the underlying stock. If the stock delivered has a holding period greater than one year, the gain or loss would be long term.\"",
        "created_utc": 1622478280,
        "id": "h03gir1",
        "score": 29,
        "subreddit": "options",
        "created": 1622507080.0
    },
    {
        "author": "peedanoo",
        "body": "\"Fidelity hates this one trick\"",
        "created_utc": 1620786108,
        "id": "gxt2v81",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1620814908.0
    },
    {
        "author": "DistrictPsychedelic",
        "body": "Fidelity has never crashed on me, never did any hinky restrictions during rallies, lets me buy OTC, and every option I want. No idea why anybody keeps using RH, or any of the smaller platforms that do shady crap all the time.",
        "created_utc": 1621422204,
        "id": "gyok0qa",
        "score": 28,
        "subreddit": "pennystocks",
        "created": 1621451004.0
    },
    {
        "author": "scsibusfault",
        "body": "He died doing what he loved, holding his fidelity app in one hand and his pp in the other.",
        "created_utc": 1620413600,
        "id": "gxb02rk",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1620442400.0
    },
    {
        "author": "HankScorpioGlobexLtd",
        "body": "Cash &amp; close your fidelity account ASAP, delete this post, and send me the proceeds. Thanks, OP.",
        "created_utc": 1620857303,
        "id": "gxwpi92",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1620886103.0
    },
    {
        "author": "Daegoba",
        "body": "Contact Fidelity, tell them you want to open an individual account, and transfer assets. \n\nThey take care of everything from there.",
        "created_utc": 1620567637,
        "id": "gxhvm18",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1620596437.0
    },
    {
        "author": "12A1313IT",
        "body": "Taking the time to go through my account and posting all that proof for free internet points was the gayest thing I've ever done in my life. Don't trade on fidelity if you want to get free internet points",
        "created_utc": 1620851853,
        "id": "gxwd29e",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1620880653.0
    },
    {
        "author": "NN751JW",
        "body": "According to fidelity broker i spoke to today, they can't accept IOU or naked shares in a transaction....but i know ive heard to Robinhood has been caught when an asset transfer is processed...makes sense why they are so tight with Shit adel",
        "created_utc": 1620266238,
        "id": "gx3pcaq",
        "score": 27,
        "subreddit": "Wallstreetbetsnew",
        "created": 1620295038.0
    },
    {
        "author": "Bigrben37",
        "body": "I transferred to Fidelity after I learned this. \nRobinhood is fake! \nUsing a name that implies something and it is doing completely opposite. \nIt is betrayal. \nReal ROBINHOOD gang (back in time) would punish this type of hypocrisy.",
        "created_utc": 1620215400,
        "id": "gx0ks6h",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1620244200.0
    },
    {
        "author": "0shocklink",
        "body": "Fidelity has all that and more, also doesn’t block users from buying a specific stock.",
        "created_utc": 1622391824,
        "id": "gzzkfmr",
        "score": 27,
        "subreddit": "investing",
        "created": 1622420624.0
    },
    {
        "author": "Snoo_87806",
        "body": "Took me 3 attempts to finally get out, also Is switched to fidelity hehe, this song got me jacked",
        "created_utc": 1619916606,
        "id": "gwlvvxx",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1619945406.0
    },
    {
        "author": "OwnaGeJuiCe",
        "body": "I think this is just how fidelity lists it",
        "created_utc": 1620007105,
        "id": "gwqhml9",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1620035905.0
    },
    {
        "author": "dudeitsadell",
        "body": "Hi, hello Fidelity support. I made a typo, i meant to buy IPOE a few weeks ago, not IPOD. if you could just go ahead and change that, it'd be great",
        "created_utc": 1621956086,
        "id": "gzeffp2",
        "score": 25,
        "subreddit": "SPACs",
        "created": 1621984886.0
    },
    {
        "author": "kblas420",
        "body": "I used YouTube as well as fidelity knowledge center. But the majority of me learning options trading was buying a call and losing until I finally made some kind of money back. Trial and error with money you can afford to lose taught me the most. This is a casino after all, right?",
        "created_utc": 1622410789,
        "id": "h00m2hb",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1622439589.0
    },
    {
        "author": "Felix_FedEx",
        "body": "Just started my transfer out of robinhood to fidelity!",
        "created_utc": 1620225991,
        "id": "gx15gwk",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1620254791.0
    },
    {
        "author": "nativemissourian",
        "body": "I retired in 2019 at 57.   \nI hit one million dollars June of last year. 200K gain in 2020. I could have made more, but once I recovered from the March disaster I was pretty gun shy.      \n\n\n6% of salary in 401K with employer matching the same. With some lump sum profit sharing dumped in.   \n\n\nOne of the funds that rocked last year. I wish I could have kept much more in this fund.  \n  Fidelity® Growth Company Commingled Pool\n\n**YTD** (Daily)\\* +9.23% \t\t\t\t\t\t\n\nAverage Annual Returns 1 Yr +96.29%",
        "created_utc": 1619992144,
        "id": "gwpppae",
        "score": 25,
        "subreddit": "investing",
        "created": 1620020944.0
    },
    {
        "author": "we-are-all-monsters",
        "body": "I applied twice for options on Fidelity and they turned me down both times....\n\nSomehow, I have the feeling they were doing me a favor....",
        "created_utc": 1622083794,
        "id": "gzldpet",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1622112594.0
    },
    {
        "author": "Accomplished_Age5005",
        "body": "Not quite. Robinhood boots you into a margin account if you trade options. When this guy transferred, Fidelity had to leave them on margin",
        "created_utc": 1620007411,
        "id": "gwqi6gd",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1620036211.0
    },
    {
        "author": "newmoneyblownmoney",
        "body": "It’s the Fidelity app don’t think you can do that on there.",
        "created_utc": 1620751054,
        "id": "gxqwaz5",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1620779854.0
    },
    {
        "author": "azzurri2017",
        "body": "Your reply: \"As an ape, you're throwing all these big words at me that I have no choice but to take as disrespectful, my man.  I wholly hold Fidelity responsible for any and all negative impacts to my portoflio henceforth that may be due to my retarded trading activities.\"",
        "created_utc": 1620280770,
        "id": "gx4d0s8",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1620309570.0
    },
    {
        "author": "BigMeech21519",
        "body": "Is it safe to transfer my stocks out of robinhood to fidelity",
        "created_utc": 1622137067,
        "id": "gznsocc",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1622165867.0
    },
    {
        "author": "homeless_alchemist",
        "body": "MCO and FISV. FISV looks expensive from an earnings perspective, but it's earnings are impaired by merging costs and amortization. The FCF is really what you follow here.",
        "created_utc": 1621250919,
        "id": "gyfluil",
        "score": 4,
        "subreddit": "investing",
        "created": 1621279719.0
    },
    {
        "author": "DataOverGold",
        "body": "It’s been a crazy couple of months for Fintech companies. Year-to-date, here are the results for some of the most popular names in the industry:\n\nSquare: -6%  \nPaypal: 6%  \nLendingTree: -32%  \nGreen Dot: -27%  \nFiserv: 2.2%  \nMoneyGram: 45%  \nUpstart: 135%  \nLendingClub: 36%  \nPaysafe: -24%\n\nData from [Dillibits.com](https://Dillibits.com). Chart visualization from [flourish.studio](https://flourish.studio).",
        "created_utc": 1621259080,
        "id": "gyfzxsj",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1621287880.0
    },
    {
        "author": "atxnfo",
        "body": "I took AVGO, BA, INTC and FISV last week. Lower IV than I'd like but there's not a lot of volatility out there.",
        "created_utc": 1620580523,
        "id": "gxiknvf",
        "score": 2,
        "subreddit": "options",
        "created": 1620609323.0
    },
    {
        "author": "Detail009",
        "body": "Yeah depends upon how you mean that.  JPM is building out a lot of their own stuff, Capital One, etc...  When it comes to being the piping behind it all, I'm not sure anybody is winning, nor that a bank will win out there.  Core technology/infrastructure providers are likely in a better position.  Fiserv/FIS/Visa/take your pick.\n\nSome smaller banks have really looking to be the backend for fintechs (CrossRiver, Sutton, Avida, Evolve, and so on) but larger ones were late to the party.  I also don't know how many players we really need in that space.  \n\nSo far I think nobody is leading in truth.  If Regulatory changes occur re: open banking (which they probably will) then the playing field gets leveled pretty quickly and you go back to the ones building tech as the favorites.  Jamie Dimon has taken it the most seriously for the longest when it comes to banks, I'll say that.  \n\n&amp;#x200B;\n\nMy $.02",
        "created_utc": 1620487199,
        "id": "gxe8933",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1620515999.0
    },
    {
        "author": "StockNCryptoGodfathr",
        "body": "The only one I’m holding is FISV. Major holding of Lee Cooperman and its solid but PYPL starting to look good. I would put STNE on there too next time.",
        "created_utc": 1621283309,
        "id": "gyhld61",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1621312109.0
    }
]