[
    {
        "author": "BannerlordAdmirer",
        "body": "Intel under Paul Otellini is the ur-example of this. He focused completely on shutting down AMD for a good part of a decade, but completely missed the boat on the smartphone.",
        "created_utc": 1635998120,
        "id": "hj8qery",
        "permalink": "/r/stocks/comments/qmbzqn/name_a_company_that_is_amazing_but_has_terrible/hj8qery/",
        "score": 153,
        "subreddit": "stocks",
        "created": 1636026920.0
    },
    {
        "author": "xboodaddyx",
        "body": "Intel. Chip company that's a loser during a chip shortage, takes talent",
        "created_utc": 1636001816,
        "id": "hj8wfyf",
        "permalink": "/r/stocks/comments/qmbzqn/name_a_company_that_is_amazing_but_has_terrible/hj8wfyf/",
        "score": 137,
        "subreddit": "stocks",
        "created": 1636030616.0
    },
    {
        "author": "soAsian",
        "body": "1. x86 - AMD is now a fabless. all their resources goes to design\n\n2. foundry - Can Intel catch up with TSMC and Samsung? TSMC have 50% of the market share. its a pure play foundry with no conflict of interest unlike Intel. all TSMC's resources goes to foundry\n\n3. alternative chip - Apple shown us ARM is viable alternative to Intel's x86. AWS, Google and Alibaba is all in on design their own chip. \n\n\nCan Intel catch up?",
        "created_utc": 1635795519,
        "id": "hix63tc",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hix63tc/",
        "score": 71,
        "subreddit": "investing",
        "created": 1635824319.0
    },
    {
        "author": "RNKKNR",
        "body": "Intel releasing GPU's is good, but only if they end up beating the competition in performance/price. Considering that Intel has never released a ground breaking GPU in all its history - I remain skeptical.",
        "created_utc": 1636055856,
        "id": "hjbp2ry",
        "permalink": "/r/StockMarket/comments/qmqlm5/nvidia_is_up_because_there_will_be_increased/hjbp2ry/",
        "score": 61,
        "subreddit": "StockMarket",
        "created": 1636084656.0
    },
    {
        "author": "Cerbierus",
        "body": "Or you could interpret the PE ratio like this: why is the market only willing to pay 9.7x earning for intel Corp but willing to pay 110 for Nvidia",
        "created_utc": 1636052658,
        "id": "hjbgxq2",
        "permalink": "/r/StockMarket/comments/qmqlm5/nvidia_is_up_because_there_will_be_increased/hjbgxq2/",
        "score": 51,
        "subreddit": "StockMarket",
        "created": 1636081458.0
    },
    {
        "author": "ahminus",
        "body": "This isn't why AMD is crushing Intel right now.\n\nIt's because Epyc crushes everything Intel has on the performance/power curve, and AMD is getting fat, fat margins on those parts, while Intel's margins are cratering.  Intel's parts are simply garbage for data center buildouts.",
        "created_utc": 1636042626,
        "id": "hjar56n",
        "permalink": "/r/wallstreetbets/comments/qmndx2/intels_new_12gen_biglittle_processor_kicks_amds/hjar56n/",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1636071426.0
    },
    {
        "author": "PepeMcPeperson",
        "body": "Seems you made a mistake in the TSMC column. Using the market cap in USD and the earnings and revenue in TWD. Their Earnings should be 19.2B with revenue of 48B.\n\nI have been following the semi market closely for the past year and altough intel have made some mistakes in underinvesting the new CEO really is correcting these mistakes with a great roadmap for regaining the top position in the comming years.",
        "created_utc": 1635792507,
        "id": "hiwyr7x",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hiwyr7x/",
        "score": 41,
        "subreddit": "investing",
        "created": 1635821307.0
    },
    {
        "author": "ChoochMMM",
        "body": "https://www.reuters.com/article/us-intel-manufacturing/intel-to-spend-20-billion-on-u-s-chip-plants-as-ceo-challenges-asia-dominance-idUSKBN2BF2WU\n\nI LOVE how they are bolstering their US production. If this supply chain stuff has taught us anything, in house production ESPCIALLY of something with defense implications, could be huge for the bottom line. \n\nI think the time to buy low in Intel is happening now.",
        "created_utc": 1636047977,
        "id": "hjb51ao",
        "permalink": "/r/stocks/comments/qmoe30/intel_good_buying_opportunity_following_new_chips/hjb51ao/",
        "score": 35,
        "subreddit": "stocks",
        "created": 1636076777.0
    },
    {
        "author": "Ja_Nee_Misschien",
        "body": "Intel is mainly behind because they failed to order a lot of EUV machines early unlike TSMC and Samsung. This can be fixed by spending a bigger share of the profits on capex and buying a lot of these advanced EUV machines themselves and that is exactly what they are going to do and what pissed of some investors. Intel announced they will be the first to receive the next iteration of even more advanced EUV machines soon.\n\nBy being a foundry Intel can use all their IP for their customers. This will give them an advantage over TSMC and Samson for a sizable chunk of the market. Simply because they can throw in this IP so customers can design product only intel can make. Their packaging techniques are not the same as those of TSMC and at least a sizable share of the market will benefit from these. I'm not going to claim they will steamroll TSMC but they will be able to take market share. It's a new market. It will be the same as AMD doubling their data center business by taking a few percentages of market share from Intel. In the foundry business TSMC will be like Intel and Intel will be like AMD.\n\nAs a foundry you can make whatever the client designs. Intel clearly stated they will go for a mix and match strategy where clients can combine external IP like ARM with Intel IP like packaging or networking. X86 will always have a place but Intel clearly accepted that it's not only x86 anymore and they are adapting.",
        "created_utc": 1635797782,
        "id": "hixbq51",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixbq51/",
        "score": 32,
        "subreddit": "investing",
        "created": 1635826582.0
    },
    {
        "author": "ZZZzzss",
        "body": "And again it is the „i am an intel bagholder and try to push it everyday“ guy. What the fuck is wrong with your bullshit intel posts everyday.",
        "created_utc": 1636050555,
        "id": "hjbbl1z",
        "permalink": "/r/investing/comments/qmqyhx/nvidia_is_up_because_there_will_be_increased/hjbbl1z/",
        "score": 26,
        "subreddit": "investing",
        "created": 1636079355.0
    },
    {
        "author": "Rothiragay",
        "body": "&gt;look at what happened to Intel and Cisco in 2000. Twenty years later, their revenues have more than tripled and their profits have increased even more, all while buying back millions of shares. Yet still they haven't reached their 2000 share price\n\nI feel like you are quoting everything money here.",
        "created_utc": 1636037449,
        "id": "hjaduka",
        "permalink": "/r/stocks/comments/qmlsv5/nvidia_and_tesla_combined_are_now_worth_more_than/hjaduka/",
        "score": 22,
        "subreddit": "stocks",
        "created": 1636066249.0
    },
    {
        "author": "browow1",
        "body": "Saying it beat a year old product at double the power draw is not as big a win as you think, mayhaps. I do agree the potential is there for Intel to really do a turn around but it's still got a long way to go before they can even prove they are on the right track - this is just the bare bones minimum start.",
        "created_utc": 1636046947,
        "id": "hjb2dph",
        "permalink": "/r/stocks/comments/qmpmsh/intel_finally_beat_amd_in_the_cpu_markets_and_all/hjb2dph/",
        "score": 20,
        "subreddit": "stocks",
        "created": 1636075747.0
    },
    {
        "author": "FitMathematician4044",
        "body": "INTC is a value play. If they make the right moves they could be back in the game. They’re still a giant in the room.",
        "created_utc": 1635871376,
        "id": "hj13ddf",
        "permalink": "/r/wallstreetbets/comments/ql3vzm/be_careful_of_the_all_the_sudden_intc_suggestions/hj13ddf/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1635900176.0
    },
    {
        "author": "Ja_Nee_Misschien",
        "body": "Everyone know TSMC is using a different naming scheme to make it look like their nodes are more advanced. It's true that Intel had some delays and therefore some of their designs got stuck waiting on the new nodes. \n\nThe last time we have been looking at relative older designs made on older nodes. People seem to believe this os all Intel has but this is obviously not true. They have been developing new IP just like the rest of the industry.\n\nRocket lake is made on Intel 14nm and their chips offer better performance than similarly priced AMD chips made on 7nm. \n\nAlder lake is made on 10nm and outperforms even the more expensive AMD chips made on 7nm.\n\nEither Intel is able to make incredible designs that beat chip designs by AMD even if they are made on more advance nodes or TSMC wasn't really hones when naming the nodes. We'll see when Intel get's their EUV machines.\n\nWhat has changed is new leadership with a lot of technical expertise getting everything moving again.",
        "created_utc": 1635799532,
        "id": "hixg448",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixg448/",
        "score": 20,
        "subreddit": "investing",
        "created": 1635828332.0
    },
    {
        "author": "comboverice",
        "body": "INTC",
        "created_utc": 1635998821,
        "id": "hj8rmh7",
        "permalink": "/r/stocks/comments/qmbzqn/name_a_company_that_is_amazing_but_has_terrible/hj8rmh7/",
        "score": 19,
        "subreddit": "stocks",
        "created": 1636027621.0
    },
    {
        "author": "PepeMcPeperson",
        "body": "I am mostly a conservative investor so for the moment i'm only invested in INTC and texas instruments. If i had to open any other positions i would mostly go to the foundry businesses like TSMC or Samsung. \n\nI feel intel, samsung and tsmc are the more sure bets and have been the only ones able to participate in Moore's law the past few years making the leading edge really a oligoply.\n\nIntel since it is traing really cheap at a sub 10 PE with the companies management expecting the revenue to increase by 10% per year and margins only decreasing only 2-3%. With dividend and buybacks combined they return aboud 7% per year if their revenue of profits wouldn't increase which they almost certainly will.\n\nSamsung makes most of it's money from it's foundy business and retail electronics. If it's foundry business' orders decrease they can fill up the remaining space with their own needs. (same as intel)\n\nTsmc is the real leader in the industry with customers having reserved all capacity for years ahead.\n\nFor price targets i would recomend [this DFCF tool](https://tracktak.com/dashboard). You fill in what revenue growth you expect the comming years, how much the ROIC is and what margins you expect.\n\nNVDA and AMD seem like really good companies but they are priced for perfection.",
        "created_utc": 1635797149,
        "id": "hixa529",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixa529/",
        "score": 19,
        "subreddit": "investing",
        "created": 1635825949.0
    },
    {
        "author": "soAsian",
        "body": "https://semiwiki.com/semiconductor-manufacturers/tsmc/304446-highlights-of-the-tsmc-open-innovation-platform-ecosystem-forum/\n\nFoundry is simply not buying off the shelf equipment and hope for the best. this is why TSMC have over 50% market share. TSMC's ecosystem is much better than Intel.",
        "created_utc": 1635799050,
        "id": "hixex56",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixex56/",
        "score": 18,
        "subreddit": "investing",
        "created": 1635827850.0
    },
    {
        "author": "SnooPandas1674",
        "body": "Intel blew a 3-1 lead to AMD",
        "created_utc": 1636026129,
        "id": "hj9qiyt",
        "permalink": "/r/stocks/comments/qmbzqn/name_a_company_that_is_amazing_but_has_terrible/hj9qiyt/",
        "score": 18,
        "subreddit": "stocks",
        "created": 1636054929.0
    },
    {
        "author": "hotfrost93",
        "body": "Intel is the GE of tech. It's never gonna moon or meme so stop trying.",
        "created_utc": 1636053430,
        "id": "hjbiwb4",
        "permalink": "/r/StockMarket/comments/qmqlm5/nvidia_is_up_because_there_will_be_increased/hjbiwb4/",
        "score": 17,
        "subreddit": "StockMarket",
        "created": 1636082230.0
    },
    {
        "author": "atdharris",
        "body": "The obsession with making INTC a thing around here is truly bizarre.",
        "created_utc": 1636050074,
        "id": "hjbad8v",
        "permalink": "/r/investing/comments/qmqyhx/nvidia_is_up_because_there_will_be_increased/hjbad8v/",
        "score": 17,
        "subreddit": "investing",
        "created": 1636078874.0
    },
    {
        "author": "ThePandaRider",
        "body": "Yeah, this is a big reversal for Intel. Their 11th gen chips were worse than their 10th gen chips so the big performance leap from 10th/11th gen to 12th gen is good to see. \n\nEspecially so since this is their first attempt at a new architecture, so I would expect them to have more big improvements in the coming years. \n\nThat said, their chips aren't significantly better than AMD's for gaming at this point so I would expect them to go back and forth with AMD in terms of performance for a while.",
        "created_utc": 1636046260,
        "id": "hjb0lm4",
        "permalink": "/r/stocks/comments/qmoe30/intel_good_buying_opportunity_following_new_chips/hjb0lm4/",
        "score": 17,
        "subreddit": "stocks",
        "created": 1636075060.0
    },
    {
        "author": "pa1reddit",
        "body": "Seriously, you still trust INTC 😂",
        "created_utc": 1636041822,
        "id": "hjap20x",
        "permalink": "/r/wallstreetbets/comments/qmndx2/intels_new_12gen_biglittle_processor_kicks_amds/hjap20x/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1636070622.0
    },
    {
        "author": "SwaggerSaurus420",
        "body": "I've been holding Intel for a month now... I really think it's undervalued. I don't care if they're number two, they're not a shit company, not enough to warrant these results. Not a fan boy either, just got a feeling from observing the market for the past 25 years",
        "created_utc": 1635791318,
        "id": "hiwvunm",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hiwvunm/",
        "score": 16,
        "subreddit": "investing",
        "created": 1635820118.0
    },
    {
        "author": "Slaxle",
        "body": "I thought stocks traded at whatever price people thought they were worth? Like Intel is \"under valued\"and Tesla is \"over valued\" but no one is making money off of Intel. And I wouldn't bet against Tesla",
        "created_utc": 1636046846,
        "id": "hjb24hq",
        "permalink": "/r/stocks/comments/qmogyk/nvidia_is_going_to_break_300_today_currently_it/hjb24hq/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1636075646.0
    },
    {
        "author": "polhotpot69",
        "body": "Intc bagholders tryna pump so they can dump. This shit belongs in the 40s. Patty boy already said margins will decline for many more quarters as they plow tens of billions into tryna catch up with amd and tsmc. Good luck patty boy.",
        "created_utc": 1635858975,
        "id": "hj0aakv",
        "permalink": "/r/wallstreetbets/comments/ql3vzm/be_careful_of_the_all_the_sudden_intc_suggestions/hj0aakv/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1635887775.0
    },
    {
        "author": "Specialist_Coffee709",
        "body": "Dumb apes can’t figure out why $INTC annual earnings is higher than $AMD’s annual revenue. So much for catching up………haha! Apple would have switched to AMD.",
        "created_utc": 1635864636,
        "id": "hj0mylp",
        "permalink": "/r/wallstreetbets/comments/ql3vzm/be_careful_of_the_all_the_sudden_intc_suggestions/hj0mylp/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1635893436.0
    },
    {
        "author": "Dadd_io",
        "body": "Nvidia is a meme stock at this point -- Cisco from 2000.  But that doesn't make Intel a buy (and I bought some at 48).",
        "created_utc": 1636051103,
        "id": "hjbcz4u",
        "permalink": "/r/investing/comments/qmqyhx/nvidia_is_up_because_there_will_be_increased/hjbcz4u/",
        "score": 15,
        "subreddit": "investing",
        "created": 1636079903.0
    },
    {
        "author": "VotedOut",
        "body": "In the last 6 trading days Tesla has added roughly 300B market cap to its 900B high (900B to 1.2T).\n\nThis 300B market cap added in 6 days is more than the entire value of:\n\nToyota (249B)\n\nVolkswagen (149B)\n\nGM + Ford (80B + 71B)\n\nCisco (236B)\n\nIntel (200B)\n\nAdobe (almost) (304B)\n\nalmost 2x AMD (151B x2)",
        "created_utc": 1635801030,
        "id": "hixjrgm",
        "permalink": "/r/wallstreetbets/comments/qkmd3z/what_are_your_moves_tomorrow_november_02_2021/hixjrgm/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1635829830.0
    },
    {
        "author": "minervaDe",
        "body": "While you are correct, they have to capitalize in every single one of those spaces. It takes more than a decade to ramp up the necessary production facilities to be able to profit on those fronts. They're still struggling with driverless tech. Elon has said that it's more difficult than he ever expected. While, I believe they are the leaders, they are probably still a few years our before they can start making anything on the driverless tech front. Then they have to focus on energy, HVAC, etc. They're struggling with their new battery cells. This is priced for 10 years from now currently. If there is any weakness in the market, the evaluation will come down heavily. This is in a 1999 Intel-Like bubble right now. It will come down. They do not have the infrastructure in place to justify these evaluations.",
        "created_utc": 1635883663,
        "id": "hj1ytdz",
        "permalink": "/r/wallstreetbets/comments/qlb35d/yo_seriously_what_the_shit_would_tesla_even_need/hj1ytdz/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1635912463.0
    },
    {
        "author": "optimal_909",
        "body": "Valuations in the growth sector are all over the place. Nvidia may appear expensive vs. Intel, but definitely looks cheap vs. Tesla...",
        "created_utc": 1636056254,
        "id": "hjbq318",
        "permalink": "/r/StockMarket/comments/qmqlm5/nvidia_is_up_because_there_will_be_increased/hjbq318/",
        "score": 14,
        "subreddit": "StockMarket",
        "created": 1636085054.0
    },
    {
        "author": "Celodurismo",
        "body": "&gt;As a consumer, I wouldn't buy current intel chips so yeah\n\nWhy not?  They're still in the same ballpark as AMD chips and often come with a lot less headaches.",
        "created_utc": 1635791411,
        "id": "hiww2z5",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hiww2z5/",
        "score": 14,
        "subreddit": "investing",
        "created": 1635820211.0
    },
    {
        "author": "MPSW8",
        "body": "I work in the semiconductor industry and let me tell you the picture you paint is way too simple. \n\nDo you for once think the main reason intel is lagging behind technology wise is due to EUV machines not being adopted earlier?",
        "created_utc": 1635801586,
        "id": "hixl30g",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixl30g/",
        "score": 13,
        "subreddit": "investing",
        "created": 1635830386.0
    },
    {
        "author": "Glad-Marionberry-634",
        "body": "Finally someone advising to buy actually strong companies. Personally I hold msft (best investment yet) and Intel. Baba will probably come back so I don't blame anyone for buying/holding it, I just don't. Everyone else in this thread is advising to buy more meme stocks, id say take any profits you've made and walk away, eventually people will need their money that's tied up in those and you don't want to be a bag holder. MSFT is probably the safest and most solid tech company right now with the best credit, and tons of cash, etc, etc basically hard to find weak spots. If this person really wants serious advice I'd say count your blessings and get out of the meme stocks and into lower risk, maybe some etfs. There are a lot of sectors that were ignored that are poised to do well. If you really want individual stocks maybe NOK or RYAAY. Those are in a similar risk/reward range to their current portfolio but with a little more stability.",
        "created_utc": 1635950359,
        "id": "hj5iq4j",
        "permalink": "/r/StockMarket/comments/qls61a/need_advice_on_investing_extra_7000/hj5iq4j/",
        "score": 13,
        "subreddit": "StockMarket",
        "created": 1635979159.0
    },
    {
        "author": "dryu12",
        "body": "NVDA +60% in 3 months. AMD +55% in 3 months. INTC -6% in 3 months.",
        "created_utc": 1636049727,
        "id": "hjb9hw9",
        "permalink": "/r/wallstreetbets/comments/qmh95a/daily_discussion_thread_for_november_04_2021/hjb9hw9/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1636078527.0
    },
    {
        "author": "TmanGvl",
        "body": "I feel like majority of the consumers are waiting for the GPU market to come back to sanity. There's no point in buying a car without an engine. Not to mention the CPU is barely better than the AMD offerings that came out last year. Close, but no cigar, but it will get the confidence in Intel back again.\n\nThe real rally would start right around when they start pumping chips with 3nm hits the market.",
        "created_utc": 1636047378,
        "id": "hjb3hct",
        "permalink": "/r/stocks/comments/qmoe30/intel_good_buying_opportunity_following_new_chips/hjb3hct/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1636076178.0
    },
    {
        "author": "Plane-Meat-6697",
        "body": "Long Intel back to $70 let’s gooooo!",
        "created_utc": 1636040627,
        "id": "hjalz3d",
        "permalink": "/r/wallstreetbets/comments/qmndx2/intels_new_12gen_biglittle_processor_kicks_amds/hjalz3d/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1636069427.0
    },
    {
        "author": "cleanRubik",
        "body": "Intel is like a lazy sleeping giant. Whenever it’s been woken up it can innovate. But it takes a lot to wake it up. First time was athlon/AthlonXP/Athlon64. Once it pivoted to Core it regained the crown quickly. \n\nWill they be able to do it again? Dunno but can’t count them out so easily.",
        "created_utc": 1635815890,
        "id": "hiyhpzw",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hiyhpzw/",
        "score": 12,
        "subreddit": "investing",
        "created": 1635844690.0
    },
    {
        "author": "_unfortuN8",
        "body": "That's the pessimist's viewpoint. The optimist's viewpoint is that Intel fabs and process engineers have been churning out competitive products to AMD on inferior process equipment. \n\n\nIn this business, it takes significant capex to stay on the bleeding edge and gelsinger knows this. Now they are investing heavily in next-gen fabs, so it's not unreasonable to believe if they can even come close to squaring process technology with AMD, they can match/beat them on performance.",
        "created_utc": 1635807175,
        "id": "hixy6lq",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixy6lq/",
        "score": 12,
        "subreddit": "investing",
        "created": 1635835975.0
    },
    {
        "author": "kyperion",
        "body": "I'm convinced that the stocks price isn't related to the company's performance whatsoever but rather on public perception towards it (this includes a preference/desire towards dividends).\n\nSame thing for AMD in 2018. They were still sitting at 16/18 a share despite Zen architecture in 2017 literally screeching to every investor about a possible AMD breakout in the coming years. Sure enough, the newer processor generations start hitting the market for both enterprise and consumer; and they begin to reel back market value from Intel. \n\nIntel's now showing similar signs with the direction they're taking.",
        "created_utc": 1635797267,
        "id": "hixafmn",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixafmn/",
        "score": 12,
        "subreddit": "investing",
        "created": 1635826067.0
    },
    {
        "author": "Warren_MuffClit",
        "body": "People are gonna hate you for this. But I've been yoloing into intel shares for months. 1 trillion market cap is on the horizon. Just was a pity about the latest earnings report",
        "created_utc": 1636040649,
        "id": "hjam17d",
        "permalink": "/r/wallstreetbets/comments/qmndx2/intels_new_12gen_biglittle_processor_kicks_amds/hjam17d/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1636069449.0
    },
    {
        "author": "MentalValueFund",
        "body": "Lmao redditors in here thinking that managing chip design and fab is like driving a sports car. \n\nIntel fucked up its 2017 cycle to 10nm (7nm tsm equivalent) by aiming for an increase in yield density in the same step as a shrink in dies. They let that head of manufacturing run the company sideways for 3 years before finally going back to one of their most successful (and the first) CTO. \n\nThey’ve deployed an aggressive capex spend for next year to inc fab capacity that’s going to eat margins back to the mid 50% but ensure they remain dominant but have a clear roadmap to 20A. They were a step behind amd for a cycle in PC (still dominant in enterprise thanks to the suite of add one and support in the Xeon ecosystem) but the worst is well behind them.",
        "created_utc": 1636006908,
        "id": "hj93aic",
        "permalink": "/r/stocks/comments/qmbzqn/name_a_company_that_is_amazing_but_has_terrible/hj93aic/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1636035708.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "body": "Intel marketcap of 200 Billion.\n\nUS gov funding 52 Billion (maybe even more in future) of subsidies for chip manufacturers in the USA. Thats some free money for Intel directly to shareholders pockets.",
        "created_utc": 1635799864,
        "id": "hixgxgh",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixgxgh/",
        "score": 11,
        "subreddit": "investing",
        "created": 1635828664.0
    },
    {
        "author": "kirkpomidor",
        "body": "If $90k is the price for something other than a cheapo intel pentium iv crap literally every other premium car has that can barely play a song without hiccups while showing directions on a 90s interface dashboard then so be it.",
        "created_utc": 1636048456,
        "id": "hjb69no",
        "permalink": "/r/stocks/comments/qmjr7o/tesla_sells_1_of_cars_globally_yet_is_priced_more/hjb69no/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1636077256.0
    },
    {
        "author": "grub_step",
        "body": "What're the chances boomer congress gives intel 'fuck you' money to make a domestic chip foundry for \"national defence\"?",
        "created_utc": 1635896722,
        "id": "hj2vwxt",
        "permalink": "/r/wallstreetbets/comments/ql3vzm/be_careful_of_the_all_the_sudden_intc_suggestions/hj2vwxt/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1635925522.0
    },
    {
        "author": "NodeDotSwift",
        "body": "If you don't understand the risks, you don't understand the company. I'm not getting  spoon fed my opinions from online articles, I'm a software developer intimately familiar with Intels problems over the last few years.\n\nWe can ignore that they've fallen so far behind in process, and assume new CEO PatG is going to fix that by throwing tens of billions in new capex at it. So higher PP&amp;E costs but hey, they have the cash flow to support it. \n\nAnd we can ignore that TSMC and others are investing even higher amounts in maintaining their process lead, including in US based (Arizona) manufacturing.\n\nLastly lets ignore that AMD has been eating market share over the last decade and is positioned to maintain or grow x86 market share in the future.\n\nBut it's hard to ignore that Intel is losing probably their best PC customer, Apple. Apple never bought from AMD, always Intel, and always Intels higher end CPUs where it makes it's best margins. Last year Apple was likely close to 10% of Intels PC CPU business (not counting chromebooks which buy super cheap shitty CPUs).\n\nThis is only starting to show up in Intels financials. Apple moved their lowest end Macbooks and Mini to Apple Silicon in December of last year, just moved low end iMacs this summer, and now is moving all high end MacBooks to Apple Silicon right now. High end iMacs and Mac Pros get their Apple Silicon by mid next year and it's over, Intel permanently loses over 20M higher end CPU sales a year.\n\nBut worse is that Apple's M1x is not only faster than the fastest of Intel's new Alder Lake CPUs, its offering that performance at  roughly 1/3 the power draw and less than half the cost. Each of those new high end MacBook Pros would have had $500 Alder Lake CPUs (actually they would have been delayed till 2022 till Intel had volume) but TSMC is building Apple's M1x Pro and Max for $150-$250.\n\nYou might say, who cares? Apple was only 8% of PC market by units, even though those were all high end. Microsoft cares. Dell cares. Lenova cares. Now they have to go toe to toe with Apple MBPs that aren't just as fast or faster at the same price points, they are offering double the battery life, and run super cool.\n\nMicrosoft already sells the Surface X using an ARM processor. Their ARM processor sucks, but Apple Silicon has just given them the blueprint for fixing that. They are working on their \"Microsoft Silicon\" higher performance PC ARM processor as I write this. As is Samsung, Qualcomm, etc, etc. They can't sit buy and bleed sales to Apple because Intel's CPUs are too hot, too expensive and use too much power.\n\nSo these things are going to take a while, and unless Intel figures out how to take the cruft out of x86 to make it run far cooler and with lower power at the same performance levels, the ARM trend will continue to pick up speed and market share. Catch x86 up in process size is only one aspect of the ARM lead, on equal process sizes x86 is still at a big disadvantage in power consumption, maybe 2 to 1 instead of 3 to 1, but still big.\n\nBut the even bigger near term threat is to Intels' dominance in servers. Amazon's ARM based server architecture has huge advantages. It doesn't offer anywhere near the same level of single CPU performance, but that matters little to the vast majority of server customers. Instead it offers far more performance per dollar and because it uses so much less power it generates far less heat, meaning more can be packed into server rooms. This has led to some of the highest growth rates the industry has seen in decades, and it's already at 10% in one measure of cloud computering.\n\n[https://www.techpowerup.com/275971/aws-arm-based-graviton-processors-sees-the-biggest-growth-in-instance-share](https://www.techpowerup.com/275971/aws-arm-based-graviton-processors-sees-the-biggest-growth-in-instance-share)\n\nIt's a real risk that ARM based server architectures could have over 50% of cloud server installs in 5 years. That would gut Intel's biggest CPU market.\n\nSo no catch phrases, just some very real, and some very likely risks.",
        "created_utc": 1636047735,
        "id": "hjb4em8",
        "permalink": "/r/ValueInvesting/comments/qmi7ri/the_first_stock/hjb4em8/",
        "score": 11,
        "subreddit": "ValueInvesting",
        "created": 1636076535.0
    },
    {
        "author": "B1gChuckDaddySr",
        "body": "Cramer Last Night: SELL QCOM...Get rid of it quick...in morning or whenever get rid of it before earnings are released. You saw what happened to INTC....chip shortage crisis is a fiasco, nothing good can come of out it, earnings will be weak, guidance will be soft, just SELL it now!\n\nCramer Tonight: If you paid attention to me yesterday....you would've understood 3 things about QCOM 1) HOLD 2) BUY &amp; HOLD 3) HOLD &amp; BUY MORE....I told you earnings are going to be solid and strong, and the stock is highly likely to rally intra-day into earnings and after earnings are released. DON'T EVER DOUBT ME!!!!",
        "created_utc": 1635982851,
        "id": "hj7ts3x",
        "permalink": "/r/wallstreetbets/comments/qm2tw3/what_are_your_moves_tomorrow_november_04_2021/hj7ts3x/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1636011651.0
    },
    {
        "author": "ShaidarHaran2",
        "body": "&gt; foundry - Can Intel catch up with TSMC and Samsung? TSMC have 50% of the market share. its a pure play foundry with no conflict of interest unlike Intel. all TSMC's resources goes to foundry\n\nRight now it's not just TSMC, but every foundry is tapped out, the appetite for chips is overshadowing the supply. I think they could have success in the foundry biz even without being the best. Samsung isn't the best but gets plenty of orders.  \n \nI think there was also indication of Intel starting to consider ISA agnosticism back at architecture day? Gone are the days of x86-or-bust which even led them to make a \"GPU\" which was a bunch of tiny x86 cores (spoiler, didn't go well as a GPU, but stayed for a while as a server/compute accelerator)",
        "created_utc": 1635807747,
        "id": "hixzhsk",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixzhsk/",
        "score": 11,
        "subreddit": "investing",
        "created": 1635836547.0
    },
    {
        "author": "CanteenGreen",
        "body": "Intel is currently priced like it is already going under, while AMD is priced like it has already completely won. In real life, the race isn’t a landslide like everyone thinks. Bullish on intel.",
        "created_utc": 1636054269,
        "id": "hjbl0r7",
        "permalink": "/r/wallstreetbets/comments/qmndx2/intels_new_12gen_biglittle_processor_kicks_amds/hjbl0r7/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1636083069.0
    },
    {
        "author": "soAsian",
        "body": "agree.\n\nI'm not saying Intel can not catch up but Intel is fighting on three fronts. (x86, ARM and foundry)\n\nthat's a lot of money.",
        "created_utc": 1635805580,
        "id": "hixuix0",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixuix0/",
        "score": 10,
        "subreddit": "investing",
        "created": 1635834380.0
    },
    {
        "author": "Ja_Nee_Misschien",
        "body": "You worked in a datacenter and did some research in 2016? 2016.. Like 5 years ago??? How is this relevant for what is happening now with Intel?",
        "created_utc": 1635798055,
        "id": "hixcf17",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixcf17/",
        "score": 10,
        "subreddit": "investing",
        "created": 1635826855.0
    },
    {
        "author": "ThrowRA775203",
        "body": "Bought a couple days ago around $49. It’s an excellent opportunity. Not only are their new chips good, they have a young, hungry CEO that can change the trajectory of the company. \n\nOn top of that, they’re the only major US semiconductor fabrication company and will get tons of government backing as they scale to meet the chip demand. Very bullish on intel. Oh and, the entire business is valued at 9.5x their current annual profit AKA very cheap.",
        "created_utc": 1636048636,
        "id": "hjb6pws",
        "permalink": "/r/stocks/comments/qmoe30/intel_good_buying_opportunity_following_new_chips/hjb6pws/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1636077436.0
    },
    {
        "author": "BrandinoGames",
        "body": "The process node size that you are referring to is pretty arbitrary and means different things for different companies. Look at Intel's chips right now with Alder Lake. From what we know, they seem to perform very well against current generation AMD chips. Not to mention, Intel has had competing chips against AMD for a while (Ryzen started on 14nm, then 12nm, 7nm, 5nm, despite Intel being on a 14nm process node the entire time).\n\ntl;dr: process node size means nothing.",
        "created_utc": 1635798201,
        "id": "hixcsey",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixcsey/",
        "score": 10,
        "subreddit": "investing",
        "created": 1635827001.0
    },
    {
        "author": "ser_renely",
        "body": "For GPUs Intel could produce a dud and it would still make a killing with the current market, ironically.",
        "created_utc": 1635815559,
        "id": "hiygzp0",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hiygzp0/",
        "score": 10,
        "subreddit": "investing",
        "created": 1635844359.0
    },
    {
        "author": "Ja_Nee_Misschien",
        "body": "Intel is already producing working chips on the Intel 4 node. What are you talking about. Do you really believe their design teams have been sitting on their hands doing nothing?\n\nLook into the history of EUV and you'll learn this tech is absolutely nothing new for Intel. It's just that they didn't order the machines when they should have.\n\nJust look at Alder lake for example and the tile based designs they are going to bring out soon.\n\nHow can you be so ignorant that you actually believe you can tell me i don't know anything about this field at all? If you are going to bluff the next time please make it at least a bit believable.",
        "created_utc": 1635799864,
        "id": "hixgxfq",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixgxfq/",
        "score": 10,
        "subreddit": "investing",
        "created": 1635828664.0
    },
    {
        "author": "CanadianTerminator",
        "body": "10 years if growth and $ continue, a big if.\n\nThis happened in Dotcom. I remember even A+ companies, complete $ printers (which is not Tesla and unlikely to ever be) like Microsoft and Intel reaching sky high...Intel went over $500b at the height of the bubble. Both were monopolies, Tesla is not.",
        "created_utc": 1636033713,
        "id": "hja509x",
        "permalink": "/r/wallstreetbets/comments/qmjfa8/how_much_does_tesla_need_to_earn_in_order_to/hja509x/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1636062513.0
    },
    {
        "author": "RedKen19",
        "body": "For me it was Intel, still own shares and add to my position after every earnings report, when the stock tanks regardless of their actual results.",
        "created_utc": 1636029385,
        "id": "hj9w4ny",
        "permalink": "/r/ValueInvesting/comments/qmi7ri/the_first_stock/hj9w4ny/",
        "score": 10,
        "subreddit": "ValueInvesting",
        "created": 1636058185.0
    },
    {
        "author": "cbslinger",
        "body": "The M1 laptops are very impressive, they're a combination of great design and TSMC's most advanced process node. \n\nBut why do people keep conflating design and manufacturing? An M1 chip would have near identical performance on an identical node whether or not it was manufactured by TSMC or INTC. \n\nI think it's absolutely possible Intel will one day manufacture Apple's processors again. It may take 5 or even 10 years, but Intel is not asleep at the wheel anymore, and that means the world for their future.",
        "created_utc": 1635880085,
        "id": "hj1pl7a",
        "permalink": "/r/wallstreetbets/comments/ql3vzm/be_careful_of_the_all_the_sudden_intc_suggestions/hj1pl7a/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635908885.0
    },
    {
        "author": "BeaverWink",
        "body": "OP says\n\n&gt; Intel is gone up maybe 30% in the biggest stock run and semiconductor/cloud computing run in 5-6 years. Abysmal compared to every semi stock\n\nAnd that's a bad thing? We want to buy stocks for less money. Or does OP want to spend more money? If INTC tanked 99% that would be a good thing for new investors. How does this not make sense to people? Prior price action does not predict future price action. At all. \n\nYes. Intel is a value play. It's cheap as fuck. So people are recommending it. Will it go up? Who the fuck knows. Will AMD outperform? Dunno. No one does.",
        "created_utc": 1635946045,
        "id": "hj58kvh",
        "permalink": "/r/wallstreetbets/comments/ql3vzm/be_careful_of_the_all_the_sudden_intc_suggestions/hj58kvh/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635974845.0
    },
    {
        "author": "jwonz_",
        "body": "Which semi stocks are you in? What are your thoughts on what TSM price should be? What are your price targets on others (NVDA/INTC/AMD)?",
        "created_utc": 1635793079,
        "id": "hix058u",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hix058u/",
        "score": 8,
        "subreddit": "investing",
        "created": 1635821879.0
    },
    {
        "author": "Ja_Nee_Misschien",
        "body": "Intel claims the dividend will continue and they've got the finances to back it. Share buybacks might be a bit slower (my personal prediction).\n\nI do expect them to close the gap relative soon but i'm mostly exited about all the deals they are announcing.\n\nDon't forget most Investors are forward looking. If a company is profitable today and it's believable that profit will grow in the future the shares will rise in value. Don't forget right now you are only paying 9 times the profits for the shares, it's profitable and really cheap.\n\nInvestors don't care about AMD having a chip that is 10% faster for gaming today if they see new machines being rolled into the fabs, big deals with the likes of google and targets of the roadmaps being met.\n\nDuring the last presentation Pat mentioned the targets for new nodes were met sooner than planned, this used to be different. If he manages to be early or even just on time a few more times people will start to trust Intels predictions again.",
        "created_utc": 1635795768,
        "id": "hix6q2g",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hix6q2g/",
        "score": 8,
        "subreddit": "investing",
        "created": 1635824568.0
    },
    {
        "author": "Successful-Two-114",
        "body": "I’m buying INTC calls… when it hits $35 per share.",
        "created_utc": 1636042546,
        "id": "hjaqxqk",
        "permalink": "/r/wallstreetbets/comments/qmndx2/intels_new_12gen_biglittle_processor_kicks_amds/hjaqxqk/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1636071346.0
    },
    {
        "author": "FairCityIsGood",
        "body": "TSLA just added half a Pepsi or an Intel in one day.\n\nIntel have been innovating for 50 years and TSLA grows a half of their 50 years worth of growth in one day. lol",
        "created_utc": 1635805269,
        "id": "hixtt4b",
        "permalink": "/r/stocks/comments/qkaa5b/rstocks_daily_discussion_monday_nov_01_2021/hixtt4b/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635834069.0
    },
    {
        "author": "NoGifts_NoSantas",
        "body": "&gt;There was lots of disappointment and skepticism about a finance guy being made CEO of Intel (the first time that had happened).\n\nPaul Otellini (Intel's CEO ~10 years ago) was an accountant. He actually presided over significant technological advancement. A non-technical CEO can do well if they understand how to prioritize technical matters.",
        "created_utc": 1635825948,
        "id": "hiz250y",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hiz250y/",
        "score": 7,
        "subreddit": "investing",
        "created": 1635854748.0
    },
    {
        "author": "Pizza_n_Tendies",
        "body": "INTC $50 weeklies? Already have $49's.",
        "created_utc": 1635783049,
        "id": "hiwbzwq",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiwbzwq/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635811849.0
    },
    {
        "author": "audion00ba",
        "body": "There is nothing unique about their offerings and their product support sucks. So, they won't find a repeat customer in me. I don't buy stock in companies that treat me badly. \n\nIntel is trading at a PE of 9.7 and does much more complicated things.\n\nAdditionally, everyone that needed a Netgear device already has one since the pandemic.",
        "created_utc": 1635949704,
        "id": "hj5h434",
        "permalink": "/r/StockMarket/comments/qlr5le/netgear_ntgr_seems_undervalued/hj5h434/",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1635978504.0
    },
    {
        "author": "mobileuseratwork",
        "body": "Pro is that AMD has upward trend in regards to their capability chip wise. If they keep on this trend they will pick up more contracts and gain a higher market share percentage, meaning stonks will keep going up. If they gain a share akin to what Intel has held for a long time, it might hit those numbers.\n\nCons: market shifts totally, their products are not relevant, and AMD becomes Intel 2.0",
        "created_utc": 1635989476,
        "id": "hj88tpy",
        "permalink": "/r/wallstreetbets/comments/qm2vbo/1000_return_on_amd_all_profit/hj88tpy/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636018276.0
    },
    {
        "author": "SuperSimpleSam",
        "body": "&gt;So if you want cheaper exposure to the GPU market because of this recent news, Intel P/E 9.7 might have a better risk/reward with their GPU releases in Q1 2022.\n\nIf you buy 1 stock of Intel how much of that is GPU compared to all the other stuff they do? Intel is not the stock to buy for a GPU play.",
        "created_utc": 1636053492,
        "id": "hjbj1yk",
        "permalink": "/r/investing/comments/qmqyhx/nvidia_is_up_because_there_will_be_increased/hjbj1yk/",
        "score": 6,
        "subreddit": "investing",
        "created": 1636082292.0
    },
    {
        "author": "Stealth3S3",
        "body": "Found the intel bag holder",
        "created_utc": 1636049722,
        "id": "hjb9hhz",
        "permalink": "/r/stocks/comments/qmpmsh/intel_finally_beat_amd_in_the_cpu_markets_and_all/hjb9hhz/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636078522.0
    },
    {
        "author": "PM_ME_GDPR_QUESTIONS",
        "body": "AMD doesn't give a shit about retail. There's no margin there and INTC already saturates the enterprise market. There's no going up for Intel, it's entirely theirs too lose. EPYC is so cost efficient in Enterprise and Intel simply doesn't have an answer. 2026 calls assuming Pat doesn't fuck it up, but he absolutely gives off the Steve Ballmer/Microsoft vibe.",
        "created_utc": 1636052202,
        "id": "hjbfsbd",
        "permalink": "/r/wallstreetbets/comments/qmndx2/intels_new_12gen_biglittle_processor_kicks_amds/hjbfsbd/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636081002.0
    },
    {
        "author": "SunriseSurprise",
        "body": "NVDA with a PE ratio over 11x that of INTC and over 2.5x that of AMD...no way that sustains.",
        "created_utc": 1636048810,
        "id": "hjb765m",
        "permalink": "/r/wallstreetbets/comments/qmh95a/daily_discussion_thread_for_november_04_2021/hjb765m/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636077610.0
    },
    {
        "author": "ravivg",
        "body": "Dump that dead dog. Did you see the market today? AMD? NVDA? Why people keep beating that dead horse Intel is beyond me. It's not that they cannot have a comeback, but why waiting on the sidelines years waiting for it to happen while losing money.",
        "created_utc": 1636047212,
        "id": "hjb31x3",
        "permalink": "/r/stocks/comments/qmpmsh/intel_finally_beat_amd_in_the_cpu_markets_and_all/hjb31x3/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636076012.0
    },
    {
        "author": "kaskoosek",
        "body": "Me too at 48.2.\n\nIntel is definitely a buy.\n\nIt won't make you rich, however it will give you a yeild of 12 percent even if there is zeroe revenue growth.\n\nIf for one reason or another they start growing by even a small margin the p/e multiple would shoot up to 18 which would give you a return of 100 percent.\n\nLow downside stock, medium upside.\n\nTheir roadmap technology wise is competing with amd, at least alderlake is. It is not like they are suddenly obsolete.",
        "created_utc": 1636052628,
        "id": "hjbguyb",
        "permalink": "/r/investing/comments/qmqyhx/nvidia_is_up_because_there_will_be_increased/hjbguyb/",
        "score": 6,
        "subreddit": "investing",
        "created": 1636081428.0
    },
    {
        "author": "Intelligent-Scheme97",
        "body": "Intel",
        "created_utc": 1635938160,
        "id": "hj4uaey",
        "permalink": "/r/StockMarket/comments/qls61a/need_advice_on_investing_extra_7000/hj4uaey/",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1635966960.0
    },
    {
        "author": "rmdeluca",
        "body": "&gt;Samsung (which has 10x the revenue of Intel)\n\nDid you mean to say 3x?",
        "created_utc": 1635804290,
        "id": "hixrk4w",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixrk4w/",
        "score": 6,
        "subreddit": "investing",
        "created": 1635833090.0
    },
    {
        "author": "yardsale2",
        "body": "I am the guy who bought $1m in LEAPS on $INTC. They are super cheap at the moment. If intel hits ~$70, their returns are &gt; 300% here.",
        "created_utc": 1636049196,
        "id": "hjb85ne",
        "permalink": "/r/wallstreetbets/comments/qmndx2/intels_new_12gen_biglittle_processor_kicks_amds/hjb85ne/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636077996.0
    },
    {
        "author": "Ovidestus",
        "body": "No optimism for INTC? What's with its staleness?",
        "created_utc": 1636043506,
        "id": "hjatghj",
        "permalink": "/r/stocks/comments/qmgulx/rstocks_daily_discussion_options_trading_thursday/hjatghj/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636072306.0
    },
    {
        "author": "SnipahShot",
        "body": "I honestly don't care about green or red days. I invest in companies I believe in, so what does it matter if today it is up 0.2% or down 3%?\n\nYesterday I invested in Pfizer, Intel, Analog Devices and Microsoft. 3 of those had green, and Intel was up 1% yesterday.",
        "created_utc": 1636021029,
        "id": "hj9jbyl",
        "permalink": "/r/stocks/comments/qmbnzc/where_do_you_invest_on_green_days/hj9jbyl/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636049829.0
    },
    {
        "author": "Ja_Nee_Misschien",
        "body": "So what? The same has been said about AMD not being able to ever design a chip that could beat Intel chips. \n\nObviously Intel has a lot of expertise, experience and resources and with the right leadership (and the balls to not give in to investors and using all profits for share buybacks) Intel can easily grab a nice chunk of the global foundry business.",
        "created_utc": 1635800093,
        "id": "hixhhr0",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hixhhr0/",
        "score": 6,
        "subreddit": "investing",
        "created": 1635828893.0
    },
    {
        "author": "Specialist_Coffee709",
        "body": "Fuck WSB for hating on $INTC along with wall street. Pat is a cool guy and needs some of that WSB love. The more money you throw at a special company the better they become. The next trillion dollar company should be intel - 5x easy!",
        "created_utc": 1635788173,
        "id": "hiwo6ym",
        "permalink": "/r/wallstreetbets/comments/qjv4i3/intel_value_trap_or_undervalued/hiwo6ym/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635816973.0
    },
    {
        "author": "Desmater",
        "body": "Better do PMCC on them. I am bullish Intel but we probably won't see pay off until 2023+.",
        "created_utc": 1635974208,
        "id": "hj793np",
        "permalink": "/r/wallstreetbets/comments/qm42un/intel_yolo_update_still_holding_the_leaps/hj793np/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636003008.0
    },
    {
        "author": "thehandsoap",
        "body": "It’s cool they are finally doing something good but seeing the constant boomer articles shilling Intel every time AMD has a big Green Day just makes me think AMD is the future and intel will slowly die",
        "created_utc": 1636040755,
        "id": "hjamb78",
        "permalink": "/r/wallstreetbets/comments/qmndx2/intels_new_12gen_biglittle_processor_kicks_amds/hjamb78/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636069555.0
    },
    {
        "author": "cbslinger",
        "body": "You act like 2024 is an eternity away and not 'basically tomorrow' in the world of business. They have a plan to get back in the game - they've awakened finally thanks to new leadership that is willing to  make huge investments, spend what it takes to get the best talent, and take big business risks to try and not just catch up but re-establish leadership in 5 years or less. \n\nWhether or not it's actually feasible is up for debate. But as of recently INTC just started actually playing to win.",
        "created_utc": 1635871556,
        "id": "hj13tsg",
        "permalink": "/r/wallstreetbets/comments/ql3vzm/be_careful_of_the_all_the_sudden_intc_suggestions/hj13tsg/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635900356.0
    },
    {
        "author": "Sharkbait-115",
        "body": "Intel is a good company, people just prefer talking about AMD hype.",
        "created_utc": 1636046690,
        "id": "hjb1pyj",
        "permalink": "/r/stocks/comments/qmpmsh/intel_finally_beat_amd_in_the_cpu_markets_and_all/hjb1pyj/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636075490.0
    },
    {
        "author": "twill41385",
        "body": "Intel going to end up green on ex div day. Bullish AF.",
        "created_utc": 1636035670,
        "id": "hja9hdv",
        "permalink": "/r/wallstreetbets/comments/qmh95a/daily_discussion_thread_for_november_04_2021/hja9hdv/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636064470.0
    },
    {
        "author": "browow1",
        "body": "Even in that video your averaging about 10-13% better while overclocked and double the tdp. And ryzens almost a year old now (and not running overclocked) - it IS basically being compared to a different generation. It's great and I'm happy to see Intel back in the game but what I want to see from them are how they handle their foundries moving forward because thats been their biggest fuck up and also where their greatest potential still lies",
        "created_utc": 1636052208,
        "id": "hjbfswl",
        "permalink": "/r/stocks/comments/qmpmsh/intel_finally_beat_amd_in_the_cpu_markets_and_all/hjbfswl/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636081008.0
    },
    {
        "author": "spyaintnobitch",
        "body": "Intel looking at NVDA like Squidward through the window\n\nGet a better CEO and drop the dead weight moron",
        "created_utc": 1636028916,
        "id": "hj9v9ap",
        "permalink": "/r/wallstreetbets/comments/qmh95a/daily_discussion_thread_for_november_04_2021/hj9v9ap/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636057716.0
    },
    {
        "author": "shouldibuyahousee",
        "body": "How do you compare intel to Qualcomm?\n\n(Just noticed qcom opening 12% up premarket)\n\nCan you elaborate on the tech? (I’m in software).\n\nI’m pretty bullish on intel. I obviously acknowledge the trend (and have held AMD since before it’s rise), but as things are priced AMD way too expensive; market seems to price intel as dead which is premature.\n\nI actually hold a little qcom in my m1 portfolio in my semiconductor pie; how can I convince myself that it should be a larger slice?",
        "created_utc": 1636031372,
        "id": "hja00ai",
        "permalink": "/r/investing/comments/qmghro/daily_general_discussion_and_spitballin_thread/hja00ai/",
        "score": 5,
        "subreddit": "investing",
        "created": 1636060172.0
    },
    {
        "author": "I_cannot_continue",
        "body": "It could be a one off of Semiconductor supply or QCOM has figured out the supply chain. Also Huaweis death lifted QCOM. I do think INTC has a huge advantage manufacturing all their chips (which is why they're in my portfolio). What this may be the best case for is that more chip designers need to find a way to not rely solely on TSM.",
        "created_utc": 1636037227,
        "id": "hjadaly",
        "permalink": "/r/stocks/comments/qmgddb/qualcomm_qcom_eps_beats_by_029_beats_on_revenue/hjadaly/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636066027.0
    },
    {
        "author": "equals1",
        "body": "Does anyone mention moves or do we just do circle jerk therapy...INTC leaps",
        "created_utc": 1636017740,
        "id": "hj9fhdf",
        "permalink": "/r/wallstreetbets/comments/qm2tw3/what_are_your_moves_tomorrow_november_04_2021/hj9fhdf/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636046540.0
    },
    {
        "author": "Estake",
        "body": "I don't get this point, you're advising to buy intel over amd because you claim intel is undervalued and amd is overvalued, yet you own Nvidia which is 3x the valuation of Intel and posts numbers not even close to Intel.\n\nI completely understand wanting balance between value and growth in your own holdings but that doesn't really matter when giving advice to others does it?",
        "created_utc": 1635778754,
        "id": "hiw2b24",
        "permalink": "/r/investing/comments/qkaphs/amat_amd_instead_of_nio_qs_is_this_a_good_bet/hiw2b24/",
        "score": 5,
        "subreddit": "investing",
        "created": 1635807554.0
    },
    {
        "author": "CathieWoodisBAE",
        "body": "You’re right. This chip shortage has accelerated chinas need to acquire Taiwan. This will be a geopolitical and economic nightmare. It’s why the US government is working with intel to get chip production set up in the United States. Im not a gay bear but I’m very concerned something big is about to happen over Taiwan and it could be the start of a major recession or even worse a major war.",
        "created_utc": 1635863135,
        "id": "hj0jf6e",
        "permalink": "/r/wallstreetbets/comments/qkyh0q/china_tells_families_to_hoard_food_for_winter/hj0jf6e/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635891935.0
    },
    {
        "author": "LegitimateShameHands",
        "body": "Gus Richard upgraded AMD on October 27th and downgraded them today while upgrading INTC. How can you change your mind and upgrade and again downgrade within 4 days wtf",
        "created_utc": 1635768886,
        "id": "hivj5jc",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivj5jc/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635797686.0
    },
    {
        "author": "lixx0040",
        "body": "What's your rationale for holding INTC still?",
        "created_utc": 1635789664,
        "id": "hiwrtws",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hiwrtws/",
        "score": 5,
        "subreddit": "investing",
        "created": 1635818464.0
    },
    {
        "author": "someonesaymoney",
        "body": "&gt; Intel is mainly behind because they failed to order a lot of EUV machines early unlike TSMC and Samsung.\n\nThis is complete horseshit.  To pin the failure on nodes advancing simply because \"uhh we forget to order some equipment\" shows complete ignorance towards the industry.",
        "created_utc": 1635815323,
        "id": "hiygh2f",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hiygh2f/",
        "score": 5,
        "subreddit": "investing",
        "created": 1635844123.0
    },
    {
        "author": "bluefootedpig",
        "body": "Go safe I would say. Dividends. They aren't dependent on growing, they are paying out because they have a consistent income and have no plans to really expand. Think basics like cereal, soap, etc. Or even Intel which does server space and such. Or just invest into a broad market dividend. \n\nThe nice this is their dividend should grow with inflation, and because they don't require acquiring new business you don't run that risk.",
        "created_utc": 1635803226,
        "id": "hixp1d7",
        "permalink": "/r/investing/comments/qkk2nx/ive_saved_up_a_sizeable_sum_and_i_want_to_invest/hixp1d7/",
        "score": 5,
        "subreddit": "investing",
        "created": 1635832026.0
    },
    {
        "author": "mrlumpus98",
        "body": "Intel. Super cheap calls rn and it’s been gaining a lot of momentum. It’s recovering from\nA huge dip and futures don’t look to shabby",
        "created_utc": 1635851343,
        "id": "hizxboi",
        "permalink": "/r/wallstreetbets/comments/ql0v5g/daily_discussion_thread_for_november_02_2021/hizxboi/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635880143.0
    },
    {
        "author": "DavidAg02",
        "body": "Success of one company usually drives innovation and success in competing companies. Intel looks to be coming on strong with their new chips. You may have missed the boat with NVDA, but it might be a good time to get into INTC.",
        "created_utc": 1636036826,
        "id": "hjacalm",
        "permalink": "/r/stocks/comments/qmgulx/rstocks_daily_discussion_options_trading_thursday/hjacalm/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636065626.0
    },
    {
        "author": "Goldentll",
        "body": "Intel",
        "created_utc": 1636001935,
        "id": "hj8wmak",
        "permalink": "/r/stocks/comments/qmbzqn/name_a_company_that_is_amazing_but_has_terrible/hj8wmak/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636030735.0
    },
    {
        "author": "veilwalker",
        "body": "That is why I said contract with the new fabs being built. INTC would probably jump at the chance to add a big fab customer before their plants are even built. Also gives FB 18-24 months to get their designs done before the fab is even ready to start producing.\n\nThere will be a surplus of fab production space in 12-24 months so that isn't going to be an issue. Chip shortages are already starting to subside and the new fabs won't be in production for another year or two and the US govt is going to be throwing a bunch of money at it as well.",
        "created_utc": 1636047702,
        "id": "hjb4bjy",
        "permalink": "/r/stocks/comments/qmogyk/nvidia_is_going_to_break_300_today_currently_it/hjb4bjy/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636076502.0
    },
    {
        "author": "Ja_Nee_Misschien",
        "body": "He already made a deal with ASML for the machines. Pat knows these machines will allow Intel to take the lead again so he isn't afraid to make these bold statements.",
        "created_utc": 1635796279,
        "id": "hix7z6a",
        "permalink": "/r/investing/comments/qkihov/intc_cluster_buy_by_510_directors_and_ceo/hix7z6a/",
        "score": 5,
        "subreddit": "investing",
        "created": 1635825079.0
    },
    {
        "author": "kk7766",
        "body": "The fact that AAPL is worth more than TSLA is a JOKE!!!! TSLA should be worth more than AAPL + MSFT + AMZN + GOOGL COMBINED. TSLA is the FUTURE. Everyone is gonna own 5 Teslas each in the future!!!! No other cars will exist!!!! People won't even walk anymore just ride around it Teslas!!!!!",
        "created_utc": 1635781218,
        "id": "hiw7t1p",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw7t1p/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1635810018.0
    },
    {
        "author": "dbgtboi",
        "body": "TSLA isn't just a car company, they are a tech company and valued like one!\n\nAMZN - P/E of 66\n\nMSFT - P/E of 37\n\nAAPL - P/E of 27\n\nGOOG - P/E of 29\n\nTSLA - P/E of 360",
        "created_utc": 1635768959,
        "id": "hivj9lb",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivj9lb/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1635797759.0
    },
    {
        "author": "ybnesman",
        "body": "MSFT to $400 seems to be otw",
        "created_utc": 1635766811,
        "id": "hivg360",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivg360/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635795611.0
    },
    {
        "author": "tmoney_99",
        "body": "Someone poke MSFT with a stick",
        "created_utc": 1635776589,
        "id": "hivxivx",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivxivx/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635805389.0
    },
    {
        "author": "weaponized_teletubby",
        "body": "MSFT you dirty whore. You’re supposed to 🚀 not limp dick and flip like a dead fish.",
        "created_utc": 1635779067,
        "id": "hiw2zkc",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw2zkc/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635807867.0
    },
    {
        "author": "maz-o",
        "body": "1% down from ATH is not a sizeable dip.\n\nThat said MSFT is always a good buy.",
        "created_utc": 1635781857,
        "id": "hiw99kt",
        "permalink": "/r/stocks/comments/qkaa5b/rstocks_daily_discussion_monday_nov_01_2021/hiw99kt/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635810657.0
    },
    {
        "author": "captain_americano",
        "body": "Did MSFT, APPL and GOOG say a really bad swear?",
        "created_utc": 1635774715,
        "id": "hivtlwa",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivtlwa/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635803515.0
    },
    {
        "author": "ybnesman",
        "body": "MSFT 2-18 390 calls might be my move",
        "created_utc": 1635767589,
        "id": "hivh7ux",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivh7ux/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635796389.0
    },
    {
        "author": "tmoney_99",
        "body": "NVDA and MSFT with the fake dump get in now bozos",
        "created_utc": 1635773694,
        "id": "hivrkqv",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivrkqv/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635802494.0
    },
    {
        "author": "boom_boom_man954",
        "body": "buying TSLA now is like buying MSFT in 1999! it's a great investment, but won't pay off for 18 years!",
        "created_utc": 1635773905,
        "id": "hivrzj0",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivrzj0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635802705.0
    },
    {
        "author": "curiousprovisions",
        "body": "TSLA coming after MSFT",
        "created_utc": 1635778805,
        "id": "hiw2f1e",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw2f1e/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635807605.0
    },
    {
        "author": "boom_boom_man954",
        "body": "buying TSLA now is like buying MSFT in 1999? yay or nay?",
        "created_utc": 1635780069,
        "id": "hiw57ex",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw57ex/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635808869.0
    },
    {
        "author": "RH_Fucked_My_Account",
        "body": "Bought MSFT calls. \n\nEZ money",
        "created_utc": 1635780081,
        "id": "hiw58d7",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw58d7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635808881.0
    },
    {
        "author": "VisualMod",
        "body": "&gt;FANG+ Constituents:\n\\&gt;$AAPL 149.65 -0.1%\n$AMZN 3384.87 +0.19%\n$BABA 164.73 -0.1%\n$BIDU 161.51 -0.52%\n$FB 327.34 +1.18%\n$GOOG 2972.75 +0.27%\n$NFLX 692.5 +0.24%\n$NVDA 259.01 +1.31%\n$TSLA 1146.47 +2.91%\n$TWTR 54.24 +1.33%\n\\&gt;$MSFT 332.95 +0.42%\n\n^IGSquawk ^[@IGSquawk](http://twitter.com/IGSquawk) ^at ^2021-11-01 ^05:36:34 ^EDT-0400",
        "created_utc": 1635759402,
        "id": "hiv6yrf",
        "permalink": "/r/wallstreetbets/comments/qjxg0m/what_are_your_moves_tomorrow_november_01_2021/hiv6yrf/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635788202.0
    },
    {
        "author": "Motor_Somewhere7565",
        "body": "DIS and MSFT will also give you some good growth and dividends. I'd also throw IIPR in there as being a safe winner in a highly speculative sector that has so much more growth and a satisfying dividend.  \n\n\nI own shares in all three. They've just made me happy while I've carried bags for my spec growth picks.",
        "created_utc": 1635775519,
        "id": "hivv92a",
        "permalink": "/r/stocks/comments/qk4nht/safe_stocks_for_savings/hivv92a/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1635804319.0
    },
    {
        "author": "I_Ron_Butterfly",
        "body": "This is a simplified example, sophisticated investors aren’t actually mocking out takeover scenarios, they’re modelling buying a cash flow, which can be calculated on a per share basis. \n\nRegardless, Microsoft could buy Apple using just its own shares right now. Or a mix of shares and cash. Extremely extremely unlikely, but it is possible.",
        "created_utc": 1635767993,
        "id": "hivhsyq",
        "permalink": "/r/investing/comments/qk7r5b/why_do_stocks_have_any_value/hivhsyq/",
        "score": 4,
        "subreddit": "investing",
        "created": 1635796793.0
    },
    {
        "author": "Spiritual_Extreme_81",
        "body": "Imagine not buying that MSFT DIP 🤡",
        "created_utc": 1635780198,
        "id": "hiw5huv",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw5huv/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635808998.0
    },
    {
        "author": "Response_Legitimate",
        "body": "MSFT to 340?",
        "created_utc": 1635761119,
        "id": "hiv8ty4",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiv8ty4/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635789919.0
    },
    {
        "author": "1ngK",
        "body": "Averaged up on MSFT today, finally a sizeable dip.",
        "created_utc": 1635778506,
        "id": "hiw1rge",
        "permalink": "/r/stocks/comments/qkaa5b/rstocks_daily_discussion_monday_nov_01_2021/hiw1rge/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635807306.0
    },
    {
        "author": "ipreferconsole",
        "body": "MSFT ima need you to perk back up real quick",
        "created_utc": 1635772580,
        "id": "hivpggj",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivpggj/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635801380.0
    },
    {
        "author": "origami_asshole",
        "body": "Pete Najarian on Friday said msft calls 🤣 he’s even better to inverse than cramer",
        "created_utc": 1635778859,
        "id": "hiw2jb8",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw2jb8/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635807659.0
    },
    {
        "author": "Throwaway1021920087",
        "body": "MSFT shat the bed but TSLA is saving me",
        "created_utc": 1635781814,
        "id": "hiw963n",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw963n/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635810614.0
    },
    {
        "author": "The_SunBreaker",
        "body": "Younger investor (17) attempting to decide if my allocation is good.\nI'm currently split at 50% VTI , 20% VXUS, 25% in individual stock picks and the remaining 5% in BND and GBTC. \n\nVTI:  for its diversity in the US market and low expenses\nVXUS:    for its International exposure \nBND:    to learn about how bonds work and to see first hand how it works an asset.\nGRAYSCALE BITCOIN TRUST:   it tracks the movement of bitcoin. To give exposure into the crypto market until I understand enough to pick coins.\n\nMICROSOFT:   their dominance in the tech industry alsong with my personal opinion on the company's services, i feel they will last. \nTESLA:    their name recognition, headstart and market share  the Electric automotive industry. I feel the EVs market will explode in the coming years.\nAMAZON:  due to their absolute dominance over several different sectors, being a major player in logistics, retail, entertainment, web hosting and many other players. Amazon is a giant and im confident they will be around for some time.\nALBERTSONS: Went public rather recently owning multiple Grocery and pharmacy Chains in the Chicago land  They have a strong foothold in the area with potential to expand. Also my grocery of choice and place of employment. \n(These individual stocks are rough equal minus Albertsons which has about half as much Invested as the other postistions) \n\nI was wondering if this was an alright investment allocation for a someone younger that can withstand volatility for long-term gain?  I still have much to learn, im open to any advice.",
        "created_utc": 1635776075,
        "id": "hivwex4",
        "permalink": "/r/investing/comments/qk9x5t/daily_advice_thread_all_basic_help_or_advice/hivwex4/",
        "score": 3,
        "subreddit": "investing",
        "created": 1635804875.0
    },
    {
        "author": "DoIt4TheMayMays",
        "body": "Alright, mSfT wAs HoLdiNg SPY Friday..  \nWhat tf is keeping it afloat today?!",
        "created_utc": 1635782870,
        "id": "hiwbl6y",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiwbl6y/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635811670.0
    },
    {
        "author": "I_Ron_Butterfly",
        "body": "It is not physically impossible (even if unlikely). There’s no rule that only one single entity can buy another company. Apple and Google could agree to buy Microsoft and take it private. Or a consortium of say, 20 (40, 100, you get the idea) companies could do the same.",
        "created_utc": 1635768396,
        "id": "hivievs",
        "permalink": "/r/investing/comments/qk7r5b/why_do_stocks_have_any_value/hivievs/",
        "score": 2,
        "subreddit": "investing",
        "created": 1635797196.0
    },
    {
        "author": "bartturner",
        "body": "Would think the problem would be worse for the companies not named Google, Apple, Amazon, Facebook, Tesla or Microsoft.\n\nStill think the big guys are going to be able to attract the talent pretty easily.   I highly doubt Google is struggling to get resumes.\n\nBut the smaller tech companies it is going to get worse I suspect.  Specially if things economically start going bad.  That is what happened with the .Com bust.     Engineers gravitated more to safe jobs.   With more stable companies that they have heard of.  Like the big guys.",
        "created_utc": 1635758351,
        "id": "hiv5v98",
        "permalink": "/r/investing/comments/qjqasz/labor_shortage_is_the_biggest_concern_for_tech/hiv5v98/",
        "score": 2,
        "subreddit": "investing",
        "created": 1635787151.0
    },
    {
        "author": "lax_street",
        "body": "If you’re not buying msft then I’m not sorry for you I’m sorry for your parents at this point",
        "created_utc": 1635778038,
        "id": "hiw0qbz",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw0qbz/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635806838.0
    },
    {
        "author": "niftyifty",
        "body": "I’m going to say I did. It’s easy when you have conviction. I’m investing in companies, not playing market games.  Held Exxon since the 80’s. Though not only Valdez  but dropping 70% in two years recently. Not only did I hold, I added a little more (although not much to be honest. Mostly done adding to Exxon). \n\nAlso just to clarify those companies I listed were for a reason. Everyone pretends like it’s hard but I’m showing you it’s not. Pick any of the top ten companies in the country or world and you are likely to dominate the average. We have known for 50+ years that Exxon has its hands in government pockets. Easy pick. We’ve known for 30 years that Microsoft would rule the PC world. You could have waited 20 years “just to make sure” before increasing and you would destroy the S&amp;P. How about Walmart? Amazon? Apple? Disney? We always know that these companies control their sectors. You did not need to invest day one to make money. You just need to invest in good companies that make money consistently.",
        "created_utc": 1635782370,
        "id": "hiwagd9",
        "permalink": "/r/stocks/comments/qjqlh9/how_many_people_manage_to_beat_sp_500/hiwagd9/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635811170.0
    },
    {
        "author": "ipreferconsole",
        "body": "MSFT you have 5 days to make me not regret this FOMO cmon now shape up",
        "created_utc": 1635775313,
        "id": "hivutm9",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivutm9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635804113.0
    },
    {
        "author": "mathboom123",
        "body": "Just buy MSFT calls and be green EOD",
        "created_utc": 1635776307,
        "id": "hivwwuz",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivwwuz/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635805107.0
    },
    {
        "author": "SwetzAurus",
        "body": "amzn badly positioned for Q4, but irl retail in even worse position.\n\nhard to say if amzn moves up materially before the end of the year.\n\nGOOG &gt; FB &gt; MSFT &gt; AAPL &gt; AMZN &gt; NFLX, if I had to guess, total return from now until 1/1",
        "created_utc": 1635781826,
        "id": "hiw974j",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw974j/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635810626.0
    },
    {
        "author": "WestmontOG07",
        "body": "Exactly.\n\nEveryone is chasing “beating the S&amp;P” but, in the end, I’ll take a CAGR of 7-10%, on average, and be happy with it.\n\nSure, owning MSFT, NVDA, Monster Beverage would have been nice but the turtle always wins the race. \n\nInvesting comes down to patience and trusting empirical data, of which, there is plenty to prove slow and steady wins the race.",
        "created_utc": 1635782833,
        "id": "hiwbi55",
        "permalink": "/r/stocks/comments/qk978t/i_want_to_improve_my_knowledge_in_investing/hiwbi55/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635811633.0
    },
    {
        "author": "creemeeseason",
        "body": "I have a long position. It's my second largest holding after MSFT. I think as their biodiesel project comes online they will make lots of money. Also paying down debt from said project.  If they hit projections it'll be into the mid $90s and lots more growth as their new facilities open.",
        "created_utc": 1635760531,
        "id": "hiv86jj",
        "permalink": "/r/stocks/comments/qkaa5b/rstocks_daily_discussion_monday_nov_01_2021/hiv86jj/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635789331.0
    },
    {
        "author": "Woah_Slow_Down",
        "body": "&gt; Amazon continued to lead the worldwide IaaS market with $26.2 billion of revenue in 2020 and 41% market share (see Table 1). Amazon’s 28.7% growth was slightly slower than that of the market, with their sales growth primarily reflecting increased customer usage.\n\n\n\n&gt; Microsoft maintained the No. 2 position in Gartner’s IaaS market share with nearly 60% growth, reaching $12.7 billion in revenue in 2020\n\nThe pandemic heavily favored Microsoft. In terms of growth, Microsoft is the clear winner. Yes AWS wins due to sheer size in many metrics. Microsoft is gaining on em",
        "created_utc": 1635751175,
        "id": "hiuyitl",
        "permalink": "/r/wallstreetbets/comments/qjrtq1/the_only_things_that_are_certain_in_life_are/hiuyitl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635779975.0
    },
    {
        "author": "bartturner",
        "body": "Most definitely.     All five of the big tech guys (GOOG, AAPL, AMZN, MSFT and FB) all have room to grow.  But I would say Google has the most runway.  They just have more existing assets that have yet been fully monetized.\n\n\nIt is why Google is up over 4 times more than Apple so far this year (72% vs 16%) and Google should continue to out perform the other four.  But you want to own all five, IMHO.   I actually like Apple second to only Google.",
        "created_utc": 1635756949,
        "id": "hiv4gee",
        "permalink": "/r/stocks/comments/qjtshr/is_aapl_able_to_grow_much_more/hiv4gee/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635785749.0
    },
    {
        "author": "Serrot69",
        "body": "I’m beating it since I started investing in 2019. \n\nI basically hold companies in the S&amp;P but with different allocation. For example, 7% in Nvidia. \n\nMy portfolio sorted by allocation:\nMicrosoft,\nApple,\nGoogle,\nNvidia,\nJEPI,\nDatadog,\nAmazon,\nJP Morgan,\nTarget,\nDisney, \nVisa,\nSquare",
        "created_utc": 1635774716,
        "id": "hivtlzg",
        "permalink": "/r/stocks/comments/qjqlh9/how_many_people_manage_to_beat_sp_500/hivtlzg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635803516.0
    },
    {
        "author": "lescoobs",
        "body": "61 percent in VTSAX and VXUS\n\nIndividual stocks\n\nAAPL\n\nCOST\n\n CVS\n\n DIS\n\n IIPR\n\n JNJ\n\n JPM\n\nLUV\n\nMSFT \n\nNET\n\nNIKE\n\n O \n\nPEP\n\nPINS\n\nPLBY\n\nPLTR\n\nRTX\n\nSBUX\n\nTGT\n\nUUUU\n\nXOM\n\nConsidering adding NVDA and AMD but a bit worried I might be tech heavy and wondering if my overall portfolio is diversified enough.  Any feedback on portfolio would be appreciated.  Thank you",
        "created_utc": 1635780247,
        "id": "hiw5lsa",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hiw5lsa/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635809047.0
    },
    {
        "author": "Afrofreak1",
        "body": "We are talking multiple years here if not decades. Companies like Exxon. a.) They are in a dying industry and have been unsuccessful in pivoting away from fossil fuels to alternative sources of revenue. b.) They are a poorly run company that has had multiple CEOs in the past 10 years. c.) They have had declining revenue since 2014. d.) They are not reinvesting a lot of their profits back into the business because so much of it is released to shareholders as dividends. They know that that is one of the few reasons they are still in a lot of portfolios and ETFs. \"tHey pAy a HeAlThY dIvIdEnD.\" Yes, but as a result they are backed into a corner and their business plan is basically: Extract as much value from the business as possible while we still can. \n\nDoes that mean that you can't make money off Exxon stock? No, ofc not, and in fact it's one of the best performing stocks in the S&amp;P500 this year. However, a company that has peaked without any contingency plan to continued growth will never be able to match the returns of a company like Microsoft or Google that are growing 20+% Y-o-Y top and bottom line. I will happily pay a premium to companies that have an outstanding track record and ample room to grow and, more importantly, *the proven ability to seek out alternative sources of revenue*. That is not priced in because we don't even know where these companies are headed until they tell us. I am putting my faith in Nadella and Pichai to lead those companies to growth opportunities that investors hadn't even considered yet. \n\nMeanwhile back at Exxon they are just doing damage control to make sure that their dividend is paid at all costs. That is a terrible investment strategy and the difference in returns over the past decade show it. How likely is it do you think that Exxon will continue down this path and likewise for Microsoft and Google? I do not want companies that don't have a bright future ahead because the potential for sizeable returns is just so much smaller. Unfortunately, companies like Exxon still occupy a sizeable chunk in the S&amp;P500 because once-upon-a-time Exxon in particular was the largest company in the world by market cap. As a result, it drops the S&amp;P500s total return hence why I went with the NASDAQ-100. \n\nIt's not that I'm actively *picking* tech stocks, it's that I'm *removing* chronically underperforming companies like Exxon, Chevron, Wells Fargo, IBM, Ford, GM, etc. and the NASDAQ is the most similar to what an ideal portfolio would look like.",
        "created_utc": 1635773029,
        "id": "hivqasw",
        "permalink": "/r/investing/comments/qj1za5/how_hard_is_it_really_to_beat_the_sp/hivqasw/",
        "score": 1,
        "subreddit": "investing",
        "created": 1635801829.0
    },
    {
        "author": "jmad71",
        "body": "CM\nMSFT\nAAPL\nVUS\nPOW\nUSA",
        "created_utc": 1635775355,
        "id": "hivuwq1",
        "permalink": "/r/CanadianInvestor/comments/qkanim/rate_my_portfolio_megathread_for_november_2021/hivuwq1/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1635804155.0
    },
    {
        "author": "BullyBumble",
        "body": "If you’d bought MSFT calls instead of typing about them you’d be green rn.",
        "created_utc": 1635780537,
        "id": "hiw69af",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw69af/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635809337.0
    },
    {
        "author": "MustNotFapBruh",
        "body": "MSFT if u can only pick 1",
        "created_utc": 1635754002,
        "id": "hiv1gtg",
        "permalink": "/r/stocks/comments/qjtshr/is_aapl_able_to_grow_much_more/hiv1gtg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635782802.0
    },
    {
        "author": "MARCLOOP117",
        "body": "Early on in the year I was beating the S&amp;P from stocks like MSFT, ARKW, and BABA (plus a few others) but once BABA started tanking it took all my momentum away and now I'm back below it",
        "created_utc": 1635768942,
        "id": "hivj8n2",
        "permalink": "/r/stocks/comments/qjqlh9/how_many_people_manage_to_beat_sp_500/hivj8n2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635797742.0
    },
    {
        "author": "RumHam1",
        "body": "I agree with you on paypal, high expectations being priced in so theres a lot more fundamental downside.  Net and tsla also have super high valuations, but Microsoft doesnt really fit in with that crowd.  Even after this bump they're at 37 PE, so most of their growth has been earnings driven rather than hype.  \n\nPlus, they've got many segments that are insanely profitable plus growing quickly (something none of the others have).",
        "created_utc": 1635751549,
        "id": "hiuyxb8",
        "permalink": "/r/stocks/comments/qi8xzx/rstocks_daily_discussion_fundamentals_friday_oct/hiuyxb8/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635780349.0
    },
    {
        "author": "F1guy_5",
        "body": "Don't want to make a fucking post for this, but is MSFT still a good buy? Say it stays at current price level or drops a range 5 dollars or smth?",
        "created_utc": 1635752109,
        "id": "hiuzicy",
        "permalink": "/r/stocks/comments/qi8xzx/rstocks_daily_discussion_fundamentals_friday_oct/hiuzicy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635780909.0
    },
    {
        "author": "BrownMamba92",
        "body": "Thoughts on a MSFT stock spilt in the future?",
        "created_utc": 1635780318,
        "id": "hiw5rmx",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw5rmx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635809118.0
    },
    {
        "author": "Uttasarga",
        "body": "OP, MSFT (Microsoft) will move up by 10%.  \nYahoo Analysts have a good prediction on that.",
        "created_utc": 1635781953,
        "id": "hiw9hpe",
        "permalink": "/r/options/comments/qjwx6r/expected_moves_this_week_amc_roku_moderna/hiw9hpe/",
        "score": 1,
        "subreddit": "options",
        "created": 1635810753.0
    },
    {
        "author": "RedditMadeMeReddit",
        "body": "Microsoft Apple Netflix Google Amazon",
        "created_utc": 1635758485,
        "id": "hiv60c2",
        "permalink": "/r/wallstreetbets/comments/qj4aeu/its_maaam/hiv60c2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635787285.0
    },
    {
        "author": "shortyafter",
        "body": "They are conservative investors.  They fully admit that they could be wrong, but since there's no way of truly knowing if Microsoft will continue to aggressively grow for 5-10 years, they prefer to pass and focus elsewhere.",
        "created_utc": 1635767106,
        "id": "hivgie9",
        "permalink": "/r/stocks/comments/qi8xzx/rstocks_daily_discussion_fundamentals_friday_oct/hivgie9/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635795906.0
    },
    {
        "author": "VisualMod",
        "body": "&gt;FANG+ Constituents:\n\\&gt;$AAPL 148.63 -0.78%\n$AMZN 3335.43 -1.09%\n$BABA 170.36 +3.28%\n$BIDU 169.26 +4.33%\n$FB 330.19 +2.05%\n$GOOG 2913.42 -1.77%\n$NFLX 682.74 -1.1%\n$NVDA 256.57 +0.36%\n$TSLA 1155.1 +3.68%\n$TWTR 55.2 +3.1%\n\\&gt;$MSFT 327.09 -1.37%\n\n^IGSquawk ^[@IGSquawk](http://twitter.com/IGSquawk) ^at ^2021-11-01 ^11:15:11 ^EDT-0400",
        "created_utc": 1635779725,
        "id": "hiw4fjr",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw4fjr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635808525.0
    },
    {
        "author": "i_am_the_d_2",
        "body": "apple, google, facebook, amazon, microsoft, netflix hire probably close to a million engineers between them though. These are all people making at least 200k per year.",
        "created_utc": 1635781510,
        "id": "hiw8h7s",
        "permalink": "/r/investing/comments/qjqasz/labor_shortage_is_the_biggest_concern_for_tech/hiw8h7s/",
        "score": 1,
        "subreddit": "investing",
        "created": 1635810310.0
    },
    {
        "author": "whboer",
        "body": "All in on GOOGL and MSFT and don’t look back.",
        "created_utc": 1635766071,
        "id": "hivf1vr",
        "permalink": "/r/wallstreetbets/comments/qjwic5/next_best_opportunity/hivf1vr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635794871.0
    },
    {
        "author": "SwedishFish123",
        "body": "Shit I bought MSFT 11/19 calls because I thought there was a dip and now it’s dipping more",
        "created_utc": 1635776248,
        "id": "hivwsg2",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivwsg2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635805048.0
    },
    {
        "author": "RumHam1",
        "body": "Good video, I've not seen them before but they've got a good tools there and seem very competent. \n\nI think for me, they're using data from too long ago to justify their opinions.  Using a 5-year average of price/earnings is ok, because it normalizes the value of the company to their earnings at the time, and shows where wall street is pricing the company over time.  Using 5-year averages on earnings, or revenue only is dumb unless you think the company is going to regress on it's revenue.  \n\nAt one point they're averaging FCF for the last 5 years and comparing that to current market cap.  That just simply doesn't work when FCF today is nearly double what it was 5 years ago, and it's not only still growing - but it's still accelerating.  The fact that MSFT had 34B in free cash flow in 2016 is completely irrelevant to the stock's price today, where they have 56B in FCF.   \n\nThe way these guys are coming up with their valuations are as if MSFT isn't growing any more - it's more useful when looking at mature dividend companies, but it's not really a good way to value a company that is going to aggressively grow for the next 5-10 years.",
        "created_utc": 1635765781,
        "id": "hivenqd",
        "permalink": "/r/stocks/comments/qi8xzx/rstocks_daily_discussion_fundamentals_friday_oct/hivenqd/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635794581.0
    },
    {
        "author": "LogicalResearch4330",
        "body": "I’m not disagreeing with you but when you look at a company like Microsoft with 7.5B outstanding shares.\nVanguard and Blackrock own a significant amount with just over 1B. \n\nWhen a company like Snapchat went public they issued shares that had no voting rights. The two owners control shares that have 10 votes per share. Investors are completely locked out of decisions in that company.",
        "created_utc": 1635781333,
        "id": "hiw82kd",
        "permalink": "/r/pennystocks/comments/qk7qwn/why_do_stocks_have_any_value/hiw82kd/",
        "score": 0,
        "subreddit": "pennystocks",
        "created": 1635810133.0
    },
    {
        "author": "GekkoPSG",
        "body": "Could pop.  I so trust Chinese Brokerage Firms, especially ones that provide online brokerage services these days more than anything.  Think I'll sell all my AAPL, MSFT, and TSLA shares and  calls and yolo it all on this and buying a Wendy's franchise. . .",
        "created_utc": 1635759864,
        "id": "hiv7gdf",
        "permalink": "/r/Wallstreetbetsnew/comments/qirmz8/why_up_fintech_has_the_potential_to_roar_to_the/hiv7gdf/",
        "score": 0,
        "subreddit": "Wallstreetbetsnew",
        "created": 1635788664.0
    },
    {
        "author": "CarwashTendies",
        "body": "This will blowup and lead to defi….Mark Cuban knows it. Ryan Cohen knows it. Daniel wu tang wang knows it. \n\n*Apes Know It!!🚀💍*",
        "created_utc": 1636007757,
        "id": "hj94bo5",
        "permalink": "/r/wallstreetbets/comments/qmccl8/gme_updates_rocket_looks_imminent_strap_in_boys/hj94bo5/",
        "score": 346,
        "subreddit": "wallstreetbets",
        "created": 1636036557.0
    },
    {
        "author": "A_Wizard1717",
        "body": "Also invest in Wu Tang Clan",
        "created_utc": 1636499373,
        "id": "hjzy1sc",
        "permalink": "/r/wallstreetbets/comments/qq7cle/i_watched_all_martin_shkreli_videos_on_investing/hjzy1sc/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1636528173.0
    },
    {
        "author": "notpr1m",
        "body": "I think the crashes now are going to happen in individual stocks. Everyone talks about “the stock market…”\n\n…but it’s really a market of stocks. Cracks will start to show in the companies with dying business models (Western Union), companies that Covid hit hard and failed to adapt (certain hotel/travel/retail stocks), companies that misplayed Covid (Zillow) etc. \n\nLike you said, still liquidity but less of it… that’s true. Last year you had a lot of dumb money chasing the next TSLA and buying garbage like NKLA…now that frothiness is gone and you’re seeing TSLA rip away from that entire industry. Last year people bought SPACs as if they were all going to be winners…now you’re seeing money drain from the riskier mergers but stay with companies like SOFI or ME. \n\nAnd there are still many great value plays on the market that I like, and even better if they pay dividends because the fixed income market is basically dead.",
        "created_utc": 1636084547,
        "id": "hjdiwj8",
        "permalink": "/r/stocks/comments/qn2ih9/anybody_notice_the_massive_increase_in_the_number/hjdiwj8/",
        "score": 19,
        "subreddit": "stocks",
        "created": 1636113347.0
    },
    {
        "author": "ninkorn",
        "body": "Shkreli's Wu Tang album was sold by US Govt to some crypto collective and they found out that the CD is all scratched up because Shkreli used it as a coaster.",
        "created_utc": 1636596551,
        "id": "hk5fu5k",
        "permalink": "/r/wallstreetbets/comments/qr41y7/what_are_your_moves_tomorrow_november_11_2021/hk5fu5k/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1636625351.0
    },
    {
        "author": "MetricT",
        "body": "The Mankiw rule tells is what the Fed Rate *should be* given current unemployment/inflation.   The Wu-Xia shadow rate tells us what the Fed Rate effectively *is*.   The gap between the two is historically large right now, which means that the current Fed Rate is extremely inflationary.  The problem is, the Fed can't close the gap without crashing the economy, and appears to be deliberately choosing inflation as the \"least worst\" option.\n\nhttps://i.imgur.com/teo98Lu.png",
        "created_utc": 1636383563,
        "id": "hjt5uru",
        "permalink": "/r/investing/comments/qpe2gt/imo_the_market_is_strongly_underestimating_the/hjt5uru/",
        "score": 16,
        "subreddit": "investing",
        "created": 1636412363.0
    },
    {
        "author": "AndDeepSpoke",
        "body": "Betting against digital experience.  Check. \n\nBetting against liquidity.  Check.  \n\nBetting against convenience.  Check.\n\nBetting against disruption and innovation.  Check.  \n\nBetting against unit economics and track record.  Check.  \n\nBetting against exemplary leadership.  Check.\n\nEnjoy your OTM GME calls.  This is just cuck nonsense.  Your carrier pigeon can send Eric Wu an apology.",
        "created_utc": 1635973428,
        "id": "hj7750h",
        "permalink": "/r/wallstreetbets/comments/qlyhml/open_the_most_undervalued_moat_of_all_time/hj7750h/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1636002228.0
    },
    {
        "author": "VisualMod",
        "body": "&gt; The Wu-Tang Clan is not a group of investors. The members are rappers and they have nothing to do with Tesla or its stock price.",
        "created_utc": 1635824320,
        "id": "hiyzbe4",
        "permalink": "/r/wallstreetbets/comments/qkmd3z/what_are_your_moves_tomorrow_november_02_2021/hiyzbe4/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1635853120.0
    },
    {
        "author": "gr8uddini",
        "body": "Have you ever used Western Union?  That shit SUCKS!  I had someone western Union me $2500 about a year ago and it was the biggest pain in the ass, long wait times for phone verification and they interrogate you over the phone like you’re some kind of cocaine cowboy, all for $2500?!  No thanks, that’s the last time I use that crap.",
        "created_utc": 1636835257,
        "id": "hkhx1s9",
        "permalink": "/r/investing/comments/qt54cg/memecoins_dumber_than_you_think/hkhx1s9/",
        "score": 13,
        "subreddit": "investing",
        "created": 1636864057.0
    },
    {
        "author": "VisualMod",
        "body": "&gt;REPUBLICAN MICHELLE WU BECOMES FIRST WOMAN AND PERSON OF COLOR TO BE ELECTED AS BOSTON'S MAYOR\n\n^FXHedge ^[@Fxhedgers](http://twitter.com/Fxhedgers) ^at ^2021-11-02 ^22:38:14 ^EDT-0400",
        "created_utc": 1635907109,
        "id": "hj3kqfy",
        "permalink": "/r/wallstreetbets/comments/qlcs16/what_are_your_moves_tomorrow_november_03_2021/hj3kqfy/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635935909.0
    },
    {
        "author": "MetricT",
        "body": "The Wu-Xia shadow rate is available from the Atlanta Fed:\n\nhttps://www.atlantafed.org/cqer/research/wu-xia-shadow-federal-funds-rate\n\nThe Mankiw rule is based on unemployment (FRED::UNRATE) and inflation (FRED::CPILFESL, % chg YoY).   Here's the R Code I use to generate it, the Mankiw rule has a couple of permutations.\n\n    # Compute Mankiw rule using constants from Mankiw's original paper at\n    # http://scholar.harvard.edu/files/mankiw/files/us_monetary_policy_during_the_1990s.pdf\n    # mutate(Mankiw_Rule = 8.5 + 1.4 * (CPILFESL - UNRATE))\n    \n    # Compute Mankiw rule using updated constants by Lars Christensen\n    # at https://marketmonetarist.com/2014/09/16/mankiw-rule-tells-the-fed-to-tighten/\n    #mutate(Mankiw_Rule = 9.1 + 2.1 * (CPILFESL - UNRATE)) %&gt;%\n      \n    # This is my own spin on the Mankiw rule.   Mankiw apparently wanted to assume\n    # that inflation and unemployment were equally important to the Fed, when \n    # a regression + a little pragmatism suggests they treat inflation as more\n    # important than unemployment, at least before 2008.\n    mutate(Mankiw_Rule = 5.50 + (2.09 * CPILFESL) - (1.22 * UNRATE))",
        "created_utc": 1636387797,
        "id": "hjtfw2v",
        "permalink": "/r/investing/comments/qpe2gt/imo_the_market_is_strongly_underestimating_the/hjtfw2v/",
        "score": 11,
        "subreddit": "investing",
        "created": 1636416597.0
    },
    {
        "author": "RedditMadeMeReddit",
        "body": "He was smart and spent a lot of time arguing with people who knew nothing about financial markets other than \"capitalism is the problem\" which led to him getting on Skype with a black woman from Africa who called him the \"n-word\" and vamped on him being \"a Jew\" for about a half hour. At least he had the decency to call her the h-word. \n\nThis is my goal, too. Unfortunately, I'm going to need to buy that Wu-Tang album and all I can afford is an Insane Clown Posse album which got used as a coaster. Likewise, I don't have the ability to light other people's money on fire, but I do have matches and a gas can in my garage. Since I'm already Jewish and already been called the n-word by non-white people, I guess I'm halfway there. All I need is $4,000,000,000.",
        "created_utc": 1636518017,
        "id": "hk12qhg",
        "permalink": "/r/wallstreetbets/comments/qq7cle/i_watched_all_martin_shkreli_videos_on_investing/hk12qhg/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1636546817.0
    },
    {
        "author": "meta-cognizant",
        "body": "How long before TSLA investors start creating conspiracy theories based on the Wu Tang Clan?",
        "created_utc": 1635824304,
        "id": "hiyzaby",
        "permalink": "/r/wallstreetbets/comments/qkmd3z/what_are_your_moves_tomorrow_november_02_2021/hiyzaby/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635853104.0
    },
    {
        "author": "ThePassionOfTheRice",
        "body": "Keith Rabois is not the CEO. Eric Wu is the CEO. Rabois came up with the idea, but he doesn’t work there.",
        "created_utc": 1636004911,
        "id": "hj90rtd",
        "permalink": "/r/stocks/comments/qmbllg/opendoor_ceo_spat_on_twitter_with_real_insight/hj90rtd/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1636033711.0
    },
    {
        "author": "Snoo56029",
        "body": "Wu-Tang Clan aint nuthin to fucks with!!!",
        "created_utc": 1636465313,
        "id": "hjxn3iu",
        "permalink": "/r/wallstreetbets/comments/qq19w5/daily_discussion_thread_for_november_09_2021/hjxn3iu/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1636494113.0
    },
    {
        "author": "BunsBeyondBelief",
        "body": "Probably gonna buy some LEAPS on Western Union ($WU) tomorrow. They've got the option to buy back \\~$550 million in stock before the end of the year and last quarter the pace that they were repurchasing picked up a lot at the tail end. The price dropped from $22-$18 since last quarter ended, and I'm guessing they'll be buying a lot more back before the end of the year. That and I feel like they're about at the low end of their valuation, worst case I sell the options early 2022 having burned some theta.  \nAlso that video of a band's singer taking a piss on a guy's face during a concert seems like a pretty bullish indicator to me. Long liquid gold and golden showers.",
        "created_utc": 1636939647,
        "id": "hknxsvn",
        "permalink": "/r/wallstreetbets/comments/qtzc0g/what_are_your_moves_tomorrow_november_15_2021/hknxsvn/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636968447.0
    },
    {
        "author": "budsonguy",
        "body": "Alexa play Triumph by Wu-Tang Clan",
        "created_utc": 1636429962,
        "id": "hjw7u5g",
        "permalink": "/r/wallstreetbets/comments/qpn2qq/what_are_your_moves_tomorrow_november_09_2021/hjw7u5g/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636458762.0
    },
    {
        "author": "feniville",
        "body": "You forgot to list out that Method Man (Wu-Tang) was there at the NYNFT as well. \n\nHow do you miss that most important part?![img](emote|t5_2th52|4275)",
        "created_utc": 1636032314,
        "id": "hja1yv1",
        "permalink": "/r/wallstreetbets/comments/qmccl8/gme_updates_rocket_looks_imminent_strap_in_boys/hja1yv1/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636061114.0
    },
    {
        "author": "turdguy666",
        "body": "Probably gonna blow up eventually. Much like Wu Tang, shrooms are for the children.",
        "created_utc": 1636831089,
        "id": "hkhn5yx",
        "permalink": "/r/wallstreetbets/comments/qskqik/weekend_discussion_thread_for_the_weekend_of/hkhn5yx/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636859889.0
    },
    {
        "author": "ooslanegative",
        "body": "Wu Tang Financial, diversify yo bonds n***a",
        "created_utc": 1635920507,
        "id": "hj48wjv",
        "permalink": "/r/wallstreetbets/comments/qlcs16/what_are_your_moves_tomorrow_november_03_2021/hj48wjv/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635949307.0
    },
    {
        "author": "notapersonaltrainer",
        "body": "I haven't shopped wire services personally (because bitcoin exists) but it seems like WU fees [vary](https://www.westernunion.com/content/dam/wu/EU/EN/feeTableRetailEN-ES.PDF) widely based on location and amount. \n\nI'm guessing you saw a sign that put $4.99 in big letters and \"as low as\" in small letters. This is a common design tactic.\n\n&gt;Crypto is very volatile.\n\nYou can send stablecoins over Lightning for a fraction of a penny. The bitcoin network is a payment rail that can be used to settle between any currency transaction in under a second.",
        "created_utc": 1636831920,
        "id": "hkhp3e3",
        "permalink": "/r/investing/comments/qt54cg/memecoins_dumber_than_you_think/hkhp3e3/",
        "score": 4,
        "subreddit": "investing",
        "created": 1636860720.0
    },
    {
        "author": "marker853",
        "body": "If western union wants to survive, why dont they create their own crapto? they should have done this by now. they are going down the road of Blockbuster. smh",
        "created_utc": 1636374624,
        "id": "hjsodpl",
        "permalink": "/r/wallstreetbets/comments/qpb8yh/daily_discussion_thread_for_november_08_2021/hjsodpl/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636403424.0
    },
    {
        "author": "Koala_eiO",
        "body": "Here is my nigerian Western Union number.",
        "created_utc": 1635816837,
        "id": "hiyjsrj",
        "permalink": "/r/options/comments/qkrg72/7mil_margin_call/hiyjsrj/",
        "score": 3,
        "subreddit": "options",
        "created": 1635845637.0
    },
    {
        "author": "d3816547290",
        "body": "to throw the WU TANG 👐",
        "created_utc": 1636521683,
        "id": "hk192b1",
        "permalink": "/r/wallstreetbets/comments/qqm93q/yes/hk192b1/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636550483.0
    },
    {
        "author": "flying_cofin",
        "body": "Yeah, this company is bottom of barrel garbage. The call was a fucking joke. Couldn’t even hear or understand this Chinese clown Wu. No clarity on their new contracts or colour on future guidance.",
        "created_utc": 1637020749,
        "id": "hksczwu",
        "permalink": "/r/wallstreetbets/comments/qtu3rs/microvast_mvst_earnings_setup_for_tomorrow_monday/hksczwu/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1637049549.0
    },
    {
        "author": "RealPennyMuncher",
        "body": "Western Union and AT&amp;T bothe moving out from demand zones very nice moves",
        "created_utc": 1636563928,
        "id": "hk37v1k",
        "permalink": "/r/wallstreetbets/comments/qqrw8d/daily_discussion_thread_for_november_10_2021/hk37v1k/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636592728.0
    },
    {
        "author": "Yodaatc",
        "body": "Can anyone provide insight into the pros and cons of me buying more WU? Thank you in advance.",
        "created_utc": 1635952506,
        "id": "hj5o5dc",
        "permalink": "/r/stocks/comments/qlqsv6/rstocks_daily_discussion_wednesday_nov_03_2021/hj5o5dc/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635981306.0
    },
    {
        "author": "Unlimited_MacGyver",
        "body": "Wu tang did it better",
        "created_utc": 1635811276,
        "id": "hiy7fq1",
        "permalink": "/r/wallstreetbets/comments/qkmd3z/what_are_your_moves_tomorrow_november_02_2021/hiy7fq1/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635840076.0
    },
    {
        "author": "Hornysnek69",
        "body": "My WU puts up 230%",
        "created_utc": 1635946776,
        "id": "hj5a6a6",
        "permalink": "/r/wallstreetbets/comments/qlr721/daily_discussion_thread_for_november_03_2021/hj5a6a6/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635975576.0
    },
    {
        "author": "TheDesssertFox",
        "body": "Yup. GME people are fucking morons. I’ve been watching this debacle for a while. Every week there’s new villains and reasons for why MOASS is still yet to happen. It never comes to fruition and then they move to the next event while it all gets memory holed.  A few weeks ago it was the Wu-tang NFT. \n\nThey jerk themselves off when the stock goes up a few dollars even though a few bucks is nothing compared to how much it should go up according to their DD about the MOASS. When the stock does shit, it’s either part of the plan or because market forces caused it to do so.  \n\nThey delude themselves about technologies and industries that they don’t even understand themselves. They don’t ever reach out to people in these  industries to verify if what they assume is correct, it just is! They make up whatever shit that sounds nice in their fantasy land.  \n\nIve worked in the games industry and the shit they say about games distribution and GameStop’s future role is literally orthogonal to what actual consumers in the gaming industry want. It’s so fucking insane. \n\nHonestly fucked how the mods let this post get brigaded. apes brigade the fuck out of any thread related to GMe",
        "created_utc": 1636221941,
        "id": "hjksunc",
        "permalink": "/r/CanadianInvestor/comments/qnkuks/is_there_a_legitimate_bull_case_for_gamestop_gme/hjksunc/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1636250741.0
    },
    {
        "author": "Botboy141",
        "body": "Here's what I had to say last Friday.\n\nThere's a lot on HIMX but not much on Reddit.\n\nAMA or just listen to Thursday's earnings call. Super undervalued by every metric massive margin expansion. Market has written it off as temporary due to the semi shortage. While I think that's certainly a piece of the equation, it's only a piece. They have shifted product mix away from smartphone chips (low margin) to more tablets and auto industry screens (higher margin). These are growing segments with significantly higher margins. Both segments growing significant double digits YoY while smartphone chip sales decreased single digits.\n\nThey've also secured long term supply agreements for customers (for a fee and guaranteed minimum quantities) in addition to being paid fees to procure/guarantee capacity for non-customers for certain technologies.\n\nThey are also in the VR space and make boatloads on Smart TV stuff (Smart TV industry wide is projected to grow at 16% CAGR) and touchscreen display stuff.\n\nAdditional bear case: Wu brothers don't care about shareholders blah blah blah.\n\nCounter: Historically they pay out 75% of net profit as a dividend as is incentivized in the Taiwan tax structure.\n\nAnother Bear Case: China/Taiwan relations get significantly worse (or China straight goes to shit). Himax is a Taiwanese company with a lot of their customers and suppliers in China.\n\nhttps://www.himax.com.tw/investors/\n\nAs of today (2021-11-05), Himax Technologies's share price is $11.45. Himax Technologies's EPS without NRI for the trailing twelve months (TTM) ended in Jun. 2021 was $1.25. Therefore, Himax Technologies's **PE Ratio** without NRI for **today is 9.16**.\nDuring the past 13 years, Himax Technologies's highest PE Ratio without NRI was 270.77. The lowest was 7.04. And the **median was 25.11**.\n\nEdit: Forgot to mention https://www.nasdaq.com/market-activity/stocks/himx/short-interest\n\nApril 15th, 4m shares short (1 day to cover). Grew steadily as price dropped since May to now (10/15 report date) 24m and 10 days to cover.\n\nPublic owns 81m shares  \nInsiders own 49m shares  \nInstitutions own 34m shares  \nHedge funds own 9m shares\n\nI've been in since well before then, but yeah. Good times. Read the Q3 investor deck.\n\nPositions: a lot of leaps and shares and maybe some CSPs and CCs",
        "created_utc": 1636585097,
        "id": "hk4pyb8",
        "permalink": "/r/ValueInvesting/comments/qqqpgg/himx_thoughts_please/hk4pyb8/",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1636613897.0
    },
    {
        "author": "AnxiousScientistDude",
        "body": "I expected WU to crash after earnings, not even down 2%..",
        "created_utc": 1635935264,
        "id": "hj4q6he",
        "permalink": "/r/wallstreetbets/comments/qlr721/daily_discussion_thread_for_november_03_2021/hj4q6he/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635964064.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  2nd of November\n\n\n\n## Upcoming events for Tuesday, November  2nd\n\n - Expected earnings:\n\n  AAIC, ACH, ACOR, ACT, ADCT, ADXN, AFG, AGRX, AHH, AIZ, AKAM, AMCR, AME, AMED, AMGN, ANDE, APO, APPS, AQB, AQST, ARCB, ARGO, ARNC, AROC, ATVI, AVNS, AWK, AYX, BBGI, BCC, BFAM, BGFV, BHC, BKH, BLD, BLMN, BP, BRY, BSBR, BTG, BXC, CASA, CDK, CDLX, CEIX, CERS, CHCT, CHK, CIGI, CINR, CLNN, CLW, CMI, COP, COUR, CRK, CRSR, CRVL, CSLT, CTLT, CZR, DAR, DCO, DCP, DCPH, DD, DEA, DEI, DENN, DHT, DOX, DRRX, DS, DVN, EARN, EDU, EGHT, EIX, EKSO, EL, ELVT, ENLC, EOLS, EPD, ES, ESPR, ETN, ETRN, EXAS, EXEL, EXLS, EXPD, EXTN, EXTR, FMC, FNF, FRG, FRSH, FSTR, GAIN, GIC, GLDD, GLT, GLYC, GNRC, GNW, GPN, GPOR, GRBK, HALO, HCC, HEES, HEP, HLF, HLNE, HRB, HSC, HSIC, HURN, HY, IAA, IART, ICD, ICFI, ICHR, IDXX, IEP, INCY, INFI, INGR, INSP, INTG, INVE, IOSP, IPGP, IT, JBGS, JRVR, KAI, KAMN, KAR, KKR, KOPN, KTCC, LCII, LDOS, LEA, LGIH, LILA, LILAK, LIND, LPI, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, MANT, MCY, MDLZ, MDXG, MEC, METC, MG, MGNX, MGY, MIME, MINM, MKL, MLM, MMP, MOD, MPC, MPLX, MRCC, MRCY, MTCH, MTRN, MYGN, NAUT, NCSM, NE, NETI, NMIH, NNN, NP, NR, NRC, NRZ, NSA, NXRT, NXST, NYMT, OCN, OKE, OMCL, ORTX, OSPN, OVV, PAA, PACB, PAGP, PAHC, PAYC, PEAK, PEG, PFE, PINC, PIRS, PKI, PKOH, PMTS, PRO, PRTS, PRU, PTRS, PUMP, QUAD, RACE, RAMP, RARE, RCKY, RCM, RDN, RGNX, RIGL, RL, RM, ROK, RRR, RYAM, RYTM, SABR, SAGE, SEB, SEDG, SEE, SEVN, SFST, SGRY, SHIP, SKY, SKYT, SMCI, SNCY, SPLP, SPT, SQNS, SRC, SRCL, SREV, SRG, SRT, STAR, STE, STRL, TCS, TECH, TMUS, TMX, TNC, TRC, TRI, TRNS, TRTX, TSLX, TSQ, TTM, TVTY, TX, UA, UAA, UBCP, UFPT, UIS, UNM, USAC, USDP, UTL, VAL, VECO, VMD, VOYA, VRSK, VRTX, WAT, WBT, WEC, WEYS, WFRD, WLK, WLKP, WTI, WTTR, WU, XHR, XPO, XYL, Z, ZBRA, ZG, ZYME\n\n - Ex-div:\n\n  ASML, BRO, CAPL, CBAN, DSX, HFWA, LUB, MCBS, MKTX, MTX, NTIC, SSBK, TACO, TRS, USDP, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.090%)\n    - API Weekly Crude Oil Stock (previous: 2.318M)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - Redbook (previous: 15.6%)\n    - Total Vehicle Sales (previous: 9.66M)\n\n## Upcoming events for Wednesday, November  3rd\n\n - Expected earnings:\n\n  AAWW, ACA, ACEL, ACLS, ACNB, ACRE, ACRS, ADPT, AEE, AEMD, AFIN, AGIO, ALB, ALG, ALL, ALTM, AMOT, AMRN, AMSC, ANAB, ANSS, ANVS, APA, ARAY, ARC, ARTL, ARTNA, ASC, ASTE, ASXC, ATEX, ATGE, ATH, ATRC, ATXI, ATY, AUPH, AUTL, AVA, AVNW, AXGN, BBSI, BCRX, BCSF, BDC, BDSI, BGCP, BGSF, BIP, BKCC, BKNG, BLKB, BLUE, BNFT, BR, BRSP, BVH, BWA, CAKE, CBD, CCRN, CCU, CDAY, CDEV, CDW, CDXC, CENX, CF, CFMS, CGBD, CHNG, CIA, CIM, CIO, CIX, CKPT, CLH, CLR, CLVS, CMLS, CMP, COHN, CORT, CPE, CPK, CPRI, CPS, CRL, CRSP, CRTO, CSGS, CSTE, CSWI, CTRA, CTVA, CUTR, CVE, CVGI, CVS, CW, CWAN, CWH, CYTK, DFIN, DIOD, DISCA, DISCB, DISCK, DMAC, DNOW, DRTT, DXC, DXYN, EA, EAT, ECPG, EGY, ELA, ELF, EMR, EPR, EQH, EQIX, EQX, ET, ETR, ETSY, EVA, EVH, EVOP, EVRG, EVRI, EXC, EXPI, EYPT, FBRT, FDP, FLMN, FLT, FLXN, FNV, FOE, FORR, FOX, FOXA, FPH, FRGI, FRPH, FSLY, FSR, FUN, FYBR, GCP, GDDY, GDEN, GFL, GHC, GHL, GLBZ, GLRE, GMAB, GMRE, GNK, GRP.U, GTHX, H, HARP, HBB, HBIO, HBM, HBP, HDSN, HFC, HLMN, HMN, HR, HRTX, HST, HUBS, HUM, HZNP, IAG, ICLR, ICPT, ICUI, IIPR, IMXI, INFN, INMB, INN, INOV, INSG, IO, IONS, IR, ITI, ITIC, ITT, ITUB, IVR, JLL, JMP, KE, KIDS, KL, KLTR, KNBE, KPTI, KRO, KTOS, KW, LAMR, LANC, LAND, LBTYA, LBTYB, LBTYK, LCI, LCTX, LEXX, LHCG, LIVN, LL, LNC, LPG, LUMN, LUMO, LXRX, LYTS, MAC, MAR, MATX, MAXR, MCHX, MCS, MDU, MET, MFC, MGM, MGNI, MGPI, MGYR, MLNK, MLP, MLR, MNKD, MNRL, MPLN, MRO, MRTX, MTG, MTTR, MTW, NC, NCLH, NESR, NEXT, NFE, NHTC, NI, NL, NMFC, NODK, NRP, NSR, NUS, NVST, NYT, OAS, OCDX, ODP, ODT, OLP, OM, OMI, OMP, ONCS, ONCT, ONEM, OPRT, ORA, ORCC, OSUR, OSW, OTIC, PARR, PBI, PBPB, PCRX, PEN, PETQ, PFIE, PING, PK, PLMR, PLTK, PLYA, PRAX, PRG, PSN, PTC, PTGX, PTVE, PW, PXD, QCOM, QGEN, QLYS, QMCO, QNST, QRVO, QTWO, QUOT, RADA, RCII, RCKT, RDWR, REGI, RGLD, RGR, RMNI, RNWK, ROCC, ROKU, RPD, RPT, RRD, RTLR, RVI, RVLV, RVPH, RYI, RYN, SAFT, SANA, SAND, SB, SBGI, SBOW, SBRA, SD, SENEA, SENEB, SGC, SHOO, SITE, SITM, SJI, SKLZ, SLF, SLRC, SMG, SNSE, SPNS, SPNT, SPOK, SPPI, SPR, SPWR, SPXC, SRDX, SRPT, SSRM, SSSS, STAA, STGW, STLA, STN, SUM, SUN, SUNS, SUP, SUPN, SWM, SWN, SYN, SYNH, TALO, TARS, TBPH, TCON, TCPC, TGB, TISI, TLK, TNDM, TPC, TPVG, TREC, TRMB, TRNO, TRUE, TRUP, TS, TSP, TT, TTGT, TTWO, TUP, TWNK, TXG, UBX, UE, UEC, UGP, UHAL, UMH, UPLD, UTHR, UVV, VAPO, VEL, VGR, VIRT, VKTX, VMAR, VMEO, VNDA, VNTR, VRTV, VSH, VTOL, VVNT, VVV, WHD, WING, WK, WTS, YELL, ZD, ZY\n\n - Ex-div:\n\n  AWI, BBD, BBDO, BSMX, CATC, FELE, FMX, HESM, HOPE, NEP, STBA, WSFS\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 400K, previous: 568K)\n    - Crude Oil Imports (previous: 0.702M)\n    - Crude Oil Inventories (consensus: 1.567M, previous: 4.267M)\n    - Cushing Crude Oil Inventories (previous: -3.899M)\n    - Distillate Fuel Production (previous: 0.164M)\n    - Durables Excluding Defense (previous: -2.0%)\n    - EIA Refinery Crude Runs  (previous: 0.058M)\n    - EIA Weekly Distillates Stocks (consensus: -1.533M, previous: -0.432M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 0.4%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Factory Orders (consensus: 0.1%, previous: 1.2%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Fed Interest Rate Decision (previous: 0.25%)\n    - Gasoline Inventories (consensus: -1.200M, previous: -1.994M)\n    - Gasoline Production (previous: 0.012M)\n    - Heating Oil Stockpiles (previous: -0.031M)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 62.3)\n    - ISM Non-Manufacturing Employment (previous: 53.0)\n    - ISM Non-Manufacturing New Orders (previous: 63.5)\n    - ISM Non-Manufacturing PMI (consensus: 62.0, previous: 61.9)\n    - ISM Non-Manufacturing Prices (previous: 77.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.30%)\n    - MBA Mortgage Applications (previous: 0.3%)\n    - MBA Purchase Index (previous: 275.6)\n    - Markit Composite PMI (consensus: 57.3, previous: 57.3)\n    - Mortgage Market Index (previous: 645.1)\n    - Mortgage Refinance Index (previous: 2,763.8)\n    - Services PMI (consensus: 58.2, previous: 58.2)\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n\n^^^^2021-11-02",
        "created_utc": 1635847213,
        "id": "hizs3wm",
        "permalink": "/r/RobinHood/comments/ql0uy9/daily_discussion_thread_november_2nd_2021/hizs3wm/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635876013.0
    },
    {
        "author": "Toofast4yall",
        "body": "When El Salvador made btc legal tender, it cut into Western Union profits to the tune of several hundred million dollars. Other Latin American countries are looking into doing the same thing. My fiance is Venezuelan and I travel through Latin America frequently. Many people have bank accounts that hold US dollars and use those bank accounts to use paypal. They also have other services that allow sending money internationally. The revenue for all those services is going to zero within a few years. Something to keep in mind for anyone long on Paypal or similar stocks.",
        "created_utc": 1635828205,
        "id": "hiz5q4d",
        "permalink": "/r/stocks/comments/qkiuz3/paypal_still_down_trending_with_no_new_updates/hiz5q4d/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635857005.0
    },
    {
        "author": "VisualMod",
        "body": "&gt;\\*Western Union and Mastercard Expand Global Partnership\n$WU $MA\n\n^\\*Walter ^Bloomberg ^[@DeItaone](http://twitter.com/DeItaone) ^at ^2021-11-12 ^08:05:20 ^EST-0500",
        "created_utc": 1636722334,
        "id": "hkbtbvy",
        "permalink": "/r/wallstreetbets/comments/qs8s63/daily_discussion_thread_for_november_12_2021/hkbtbvy/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636751134.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  1st of November\n\n\n\n## Upcoming events for Monday, November  1st\n\n - Expected earnings:\n\n  ABIO, ADC, ADTN, ADUS, AKTS, ALX, AMC, AMG, AMRC, ANAT, ANET, APEN, APLS, AWR, BEN, BNL, BRKR, BRX, BWXT, CACC, CAR, CCLP, CEA, CHGG, CLDB, CLX, CNA, CORR, CPLP, CRNT, CRUS, CSR, CSWC, CURO, CVI, CWBC, DSPG, DSS, DZSI, EC, EEX, EGRX, ENBL, EPRT, EVER, FANG, FEDU, FGBI, FN, GAIA, GAME, GSS, GTE, GXO, HLIT, HNRG, HOLX, IPI, ISEE, IVAC, IVT, IX, JELD, KFRC, KLDO, KMT, KOF, L, LDI, LEG, LKCO, LTRN, LXU, MCK, MFIN, MGP, MNOV, MOS, MRBK, MVBF, NBIX, NERV, NRIM, NSP, NSSC, NTR, NXPI, O, OGS, OIS, ON, ONVO, OTTR, PCG, PDLB, PLOW, PSA, RHP, RIG, RMBS, RRX, RYAAY, SBAC, SBT, SKT, SMLR, SNDX, SOI, SPG, SUNW, SXC, TA, TKR, TRVG, TRVN, TTI, UAN, UNVR, VBIV, VNO, VNOM, VRNS, WBK, WLFC, WMB, WMK, WTRG, XENT, ZI\n\n - Ex-div:\n\n  AES, BANR, BKR, ETRN, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, HIHO, IGD, ITUB, LMRK, O, OMF, SHLX, SPH, SRCE, VER, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.055%)\n    - 6-Month Bill Auction (previous: 0.060%)\n    - Construction Spending (consensus: 0.4%, previous: 0.3%)\n    - ISM Manufacturing Employment (previous: 50.2)\n    - ISM Manufacturing New Orders Index (previous: 66.7)\n    - ISM Manufacturing PMI (consensus: 60.5, previous: 61.1)\n    - ISM Manufacturing Prices (consensus: 78.5, previous: 81.2)\n    - Investing.com Gold Index (actual: 59.9%, previous: 54.3%)\n    - Investing.com S&amp;P 500 Index (actual: 57.5%, previous: 47.2%)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 59.2, previous: 60.7)\n    - Total Vehicle Sales (previous: 9.66M)\n\n## Upcoming events for Tuesday, November  2nd\n\n - Expected earnings:\n\n  AAIC, ACH, ACOR, ACT, ADCT, ADXN, AFG, AGRX, AHH, AIZ, AKAM, AMCR, AME, AMED, AMGN, ANDE, APO, APPS, AQB, AQST, ARCB, ARGO, ARNC, AROC, ATVI, AVNS, AWK, AYX, BBGI, BCC, BFAM, BGFV, BHC, BKH, BLD, BLMN, BP, BRY, BSBR, BTG, BXC, CASA, CDK, CDLX, CEIX, CERS, CHCT, CHK, CIGI, CINR, CLNN, CLW, CMI, COP, COUR, CRK, CRSR, CRVL, CSLT, CTLT, CZR, DAR, DCO, DCP, DCPH, DD, DEA, DEI, DENN, DHT, DOX, DRRX, DS, DVN, EARN, EDU, EGHT, EIX, EKSO, EL, ELVT, ENLC, EOLS, EPD, ESPR, ETN, ETRN, EXAS, EXEL, EXLS, EXPD, EXTN, EXTR, FMC, FNF, FRG, FRSH, FSP, FSTR, GAIN, GIC, GLDD, GLT, GLYC, GNRC, GNW, GPN, GPOR, GRBK, HALO, HCC, HEES, HEP, HLF, HLNE, HRB, HSC, HSIC, HURN, HY, IAA, IART, ICD, ICFI, ICHR, IDXX, IEP, INCY, INFI, INGR, INSP, INTG, INVE, IOSP, IPGP, IT, JBGS, JRVR, KAI, KAMN, KAR, KKR, KOPN, KTCC, LCII, LDOS, LEA, LGIH, LILA, LILAK, LIND, LPI, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, MANT, MCY, MDLZ, MDXG, MEC, METC, MG, MGNX, MGY, MIME, MINM, MKL, MLM, MMP, MOD, MPC, MPLX, MRCC, MRCY, MTCH, MTRN, MYGN, NAUT, NCSM, NE, NETI, NMIH, NNN, NP, NR, NRC, NRZ, NSA, NXRT, NXST, NYMT, OCFT, OCN, OKE, OMCL, OMIC, ORTX, OSPN, OVV, PAA, PACB, PAGP, PAHC, PAYC, PEAK, PEG, PFE, PINC, PIRS, PKI, PKOH, PMTS, PRO, PRTS, PRU, PTRS, PUMP, QUAD, RACE, RAMP, RARE, RCKY, RCM, RDN, RGNX, RIGL, RL, RM, ROK, RRD, RRR, RYAM, RYTM, SABR, SAGE, SEB, SEDG, SEE, SEVN, SFST, SGRY, SHIP, SKY, SKYT, SMCI, SNCY, SPLP, SPT, SQNS, SRC, SRCL, SREV, SRG, SRT, STAR, STE, STRL, TCS, TECH, TMUS, TMX, TNC, TRC, TRI, TRNS, TRTX, TSLX, TSQ, TTM, TVTY, TX, UA, UAA, UBCP, UFPT, UIS, UNM, USAC, USDP, UTL, VAL, VECO, VMD, VOYA, VRSK, VRTX, WAT, WBT, WEC, WEYS, WFRD, WLK, WLKP, WTI, WTTR, WU, XHR, XPO, XYL, Z, ZBRA, ZG, ZYME\n\n - Ex-div:\n\n  ASML, BRO, CAPL, CBAN, DSX, HFWA, LUB, MCBS, MKTX, MTX, NTIC, SSBK, TACO, TRS, USDP, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.090%)\n    - API Weekly Crude Oil Stock (previous: 2.318M)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - Redbook (previous: 15.6%)\n\n## Upcoming events for Wednesday, November  3rd\n\n - Expected earnings:\n\n  AAWW, ACA, ACEL, ACLS, ACRE, ACRS, ADPT, AEE, AFIN, AGIO, ALB, ALL, ALTM, AMOT, AMRN, AMSC, ANAB, ANSS, ANVS, APA, ARAY, ARC, ARTL, ARTNA, ASC, ASTE, ASXC, ATEX, ATGE, ATH, ATRC, ATXI, ATY, AUPH, AUTL, AVA, AVNW, AXGN, BBSI, BCRX, BCSF, BDC, BDSI, BGCP, BGSF, BIP, BKCC, BKNG, BLKB, BLUE, BNFT, BR, BRSP, BVH, BWA, CAKE, CCRN, CCU, CDAY, CDEV, CDW, CDXC, CENX, CF, CFMS, CGBD, CHNG, CIA, CIM, CIO, CIX, CKPT, CLH, CLR, CLVS, CMLS, CMP, COHN, CORT, CPE, CPK, CPRI, CPS, CRL, CRTO, CSGS, CSTE, CSWI, CTRA, CTVA, CUTR, CVE, CVGI, CVS, CW, CWAN, CWH, CYTK, DFIN, DIOD, DISCA, DISCB, DISCK, DMAC, DNOW, DRTT, DXC, DXYN, EA, EAT, ECPG, EGY, ELA, ELF, EMR, EPR, EQH, EQIX, EQX, ES, ET, ETR, ETSY, EVA, EVH, EVOP, EVRG, EVRI, EXC, EXPI, EYPT, FDP, FLMN, FLT, FLXN, FNV, FOE, FORR, FOX, FOXA, FRGI, FRPH, FSLY, FSR, FUN, FYBR, GCP, GDDY, GDEN, GFL, GHC, GHL, GLBZ, GLRE, GMAB, GMRE, GNK, GRP.U, GTHX, H, HARP, HBB, HBIO, HBM, HBP, HDSN, HFC, HLMN, HMN, HOFV, HR, HRTX, HST, HUBS, HUM, HZNP, IAG, ICLR, ICPT, ICUI, IDN, IIPR, IMXI, INFN, INMB, INN, INSG, IO, IONS, IR, ITI, ITIC, ITT, ITUB, IVR, JLL, KE, KIDS, KL, KLTR, KNBE, KPTI, KRO, KTOS, KW, LAMR, LANC, LAND, LBTYA, LBTYB, LBTYK, LCI, LCTX, LEXX, LHCG, LIVN, LL, LNC, LPG, LUMN, LUMO, LYTS, MAC, MAR, MATX, MAXR, MCHX, MCS, MDU, MET, MFC, MGM, MGNI, MGPI, MGYR, MLNK, MLP, MLR, MNKD, MNRL, MPLN, MRO, MRTX, MTG, MTTR, MTW, NC, NCLH, NESR, NEXT, NFE, NHTC, NI, NL, NMFC, NODK, NRP, NUS, NVST, NYT, OAS, OCDX, ODP, OLP, OM, OMI, OMP, ONCT, ONEM, OPRT, ORA, ORCC, OSUR, OSW, OTIC, PARR, PBI, PBPB, PCRX, PEN, PETQ, PFIE, PING, PK, PLMR, PLTK, PLYA, PRAX, PRG, PRTA, PSN, PTC, PTGX, PTVE, PXD, QCOM, QGEN, QLYS, QMCO, QNST, QRVO, QTWO, QUOT, RADA, RC, RCII, RCKT, RDWR, REGI, RGLD, RGR, RMNI, RNWK, ROCC, ROKU, RPD, RPT, RTLR, RVI, RVLV, RVPH, RYI, RYN, SAFT, SANA, SAND, SBGI, SBOW, SBRA, SD, SENEA, SENEB, SGC, SGMO, SHOO, SITE, SITM, SJI, SKLZ, SLF, SLRC, SMG, SNSE, SPNS, SPNT, SPPI, SPR, SPWR, SPXC, SRDX, SRPT, SSRM, SSSS, STAA, STCN, STGW, STN, SUM, SUN, SUNS, SUP, SUPN, SWM, SWN, SYN, SYNH, TALO, TARS, TBPH, TCON, TCPC, TGB, TISI, TLK, TNDM, TPC, TPVG, TREC, TRMB, TRNO, TRUE, TRUP, TS, TSP, TT, TTGT, TTWO, TUP, TWNK, TXG, UBX, UE, UGP, UHAL, UMH, UPLD, VAPO, VEL, VGR, VIRT, VKTX, VMAR, VMEO, VNDA, VNTR, VRTV, VSH, VTOL, VVNT, VVV, WHD, WING, WK, WTS, YELL, ZD, ZY\n\n - Ex-div:\n\n  AWI, BBD, BBDO, BSMX, CATC, FELE, FMX, HESM, HOPE, NEP, STBA, WSFS\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 400K, previous: 568K)\n    - Crude Oil Imports (previous: 0.702M)\n    - Crude Oil Inventories (previous: 4.267M)\n    - Cushing Crude Oil Inventories (previous: -3.899M)\n    - Distillate Fuel Production (previous: 0.164M)\n    - Durables Excluding Defense (previous: -2.0%)\n    - EIA Refinery Crude Runs  (previous: 0.058M)\n    - EIA Weekly Distillates Stocks (consensus: -2.311M, previous: -0.432M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.3%, previous: 0.4%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Factory Orders (consensus: 0.1%, previous: 1.2%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Fed Interest Rate Decision (previous: 0.25%)\n    - Gasoline Inventories (previous: -1.994M)\n    - Gasoline Production (previous: 0.012M)\n    - Heating Oil Stockpiles (previous: -0.031M)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 62.3)\n    - ISM Non-Manufacturing Employment (previous: 53.0)\n    - ISM Non-Manufacturing New Orders (previous: 63.5)\n    - ISM Non-Manufacturing PMI (consensus: 62.1, previous: 61.9)\n    - ISM Non-Manufacturing Prices (previous: 77.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.30%)\n    - MBA Mortgage Applications (previous: 0.3%)\n    - MBA Purchase Index (previous: 275.6)\n    - Markit Composite PMI (consensus: 57.3, previous: 57.3)\n    - Mortgage Market Index (previous: 645.1)\n    - Mortgage Refinance Index (previous: 2,763.8)\n    - Services PMI (consensus: 58.2, previous: 58.2)\n    - Trade Balance (consensus: -80.30B, previous: -73.30B)\n\n^^^^2021-11-01",
        "created_utc": 1635760818,
        "id": "hiv8hui",
        "permalink": "/r/RobinHood/comments/qkan8y/daily_discussion_thread_november_1st_2021/hiv8hui/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635789618.0
    },
    {
        "author": "NextTrillion",
        "body": "No, if you haven’t been to Argentina recently, you don’t know how this messes with everything. In my little bubble, I’m a foreigner, but restaurants refused my CC because payments are withheld for a month, and within a month, the meal you just ate might not cover the cost of the uncooked food. Add to that, ATMs costed a massive % of cash deducted. Like 10%.\n\nSo we ended up having someone wire us some cash, and the rate was something impressive, like I could make 33% gains from reselling the cash, but like the true tard that I am, got way too excited by the value trap because Western Union seemed very happy to offload their cash on me. Once the pandemic hit, I couldn’t even spend it, so I’m stuck with $500 worth of Argentine cash that is probably worth $180 right now IF I can find a buyer.",
        "created_utc": 1636587497,
        "id": "hk4vi3e",
        "permalink": "/r/wallstreetbets/comments/qr1jo7/fixed_it_from_a_previous_post/hk4vi3e/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636616297.0
    },
    {
        "author": "ItsEntirelyPosssible",
        "body": "C.R.E.A.M wu-tang",
        "created_utc": 1636437238,
        "id": "hjwl9h8",
        "permalink": "/r/wallstreetbets/comments/qpwzr6/any_suggestions_to_the_playlist/hjwl9h8/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636466038.0
    },
    {
        "author": "FrTedChannel4",
        "body": "SPY daily chart repping Wu-Tang.",
        "created_utc": 1635796285,
        "id": "hix7zp4",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hix7zp4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635825085.0
    },
    {
        "author": "rjsheine",
        "body": "The Wu tang thing?",
        "created_utc": 1635866637,
        "id": "hj0rqvm",
        "permalink": "/r/wallstreetbets/comments/ql0v5g/daily_discussion_thread_for_november_02_2021/hj0rqvm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635895437.0
    },
    {
        "author": "RealPennyMuncher",
        "body": "Guys. Look at WU",
        "created_utc": 1636396119,
        "id": "hju0nz6",
        "permalink": "/r/wallstreetbets/comments/qpb8yh/daily_discussion_thread_for_november_08_2021/hju0nz6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636424919.0
    },
    {
        "author": "RewtDooDoo",
        "body": "You clearly haven't been paying attention to the amount of institutional money coming into the market. BTC already had a 50% correction this year and bounced right back.\n\nOr the continued adoption worldwide of bitcoin and crypto currency. Smart money follows smart money and all the banks and funds are starting to get into crypto, hence why it's still early. With more money comes more stability, as we're starting to see. You would actually have to follow BTC metrics to understand this though. \n\nThere's going to be a massive supply shock, that's why everyone even the big players are accumulating. This will bring financial freedom to billions of people worldwide who don't have access to bank accounts, let alone appreciable assets. More countries will continue to adopt BTC as legal tender and benefit from it as well. El Salvador has already invested $13M profits into schools, and there are more people with a BTC wallet than a bank account. No longer will people in the 2nd/3rd world be held hostage by Western Union fees, or INSANE inflation rates.\n\nYou're thinking very close mindedly, I of course know it's a volatile space because of the timing but it's also the perfect time for a retail investor to take advantage. I've also been taking profits on the way up just as I would with any stock. Whether you like it or not, I've done my research on crypto, believe in it, found the value, bought low and made my way to amazing gains both realized and unrealized. How are your negative yielding bonds doing? How about gold? Tech is the future, defi will be a huge portion of the tech industry. There's trillions of dollars of negative yielding bonds in the market, that's trillions of dollars looking for the next best store of value and guess what everyone's buying.\n\nNot financial advice, I definitely wouldn't take any advice from anyone on this sub here otherwise I wouldn't have these gains. Do your own DD.",
        "created_utc": 1636392621,
        "id": "hjts1rl",
        "permalink": "/r/CanadianInvestor/comments/qpb8vi/daily_discussion_thread_for_november_08_2021/hjts1rl/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1636421421.0
    },
    {
        "author": "Country_Gravy420",
        "body": "Wu Tang Clan ain't nothing to fuck with.",
        "created_utc": 1635860891,
        "id": "hj0ecw5",
        "permalink": "/r/wallstreetbets/comments/ql0v5g/daily_discussion_thread_for_november_02_2021/hj0ecw5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635889691.0
    },
    {
        "author": "AcademicParticular69",
        "body": "i mean its pretty evident that cohen is a member of pleasr dao, which bought the wu tang album. other than that im out, but thats not crazy.",
        "created_utc": 1635824909,
        "id": "hiz0d5g",
        "permalink": "/r/wallstreetbets/comments/qkmd3z/what_are_your_moves_tomorrow_november_02_2021/hiz0d5g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635853709.0
    },
    {
        "author": "scarr34",
        "body": "No way western union is still in bussiness",
        "created_utc": 1636374837,
        "id": "hjsopxt",
        "permalink": "/r/wallstreetbets/comments/qpb8yh/daily_discussion_thread_for_november_08_2021/hjsopxt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636403637.0
    },
    {
        "author": "Yodaatc",
        "body": "WU",
        "created_utc": 1636730028,
        "id": "hkc9fz4",
        "permalink": "/r/wallstreetbets/comments/qs8s63/daily_discussion_thread_for_november_12_2021/hkc9fz4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636758828.0
    },
    {
        "author": "RealPennyMuncher",
        "body": "Took more Western union. Earnings beat. Upgraded and at Pandemic lows. 2024 long.",
        "created_utc": 1637093989,
        "id": "hkwasjd",
        "permalink": "/r/wallstreetbets/comments/qv5cg4/daily_discussion_thread_for_november_16_2021/hkwasjd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637122789.0
    },
    {
        "author": "Mr_Doghouse",
        "body": "Likely related to Hyzon’s involvement in the Ascent Hydrogen fund: “Ascent is led by Mark Gordon, veteran Wall Street energy investor with senior positions at Goldman Sachs, Soros Fund Management, Paulson &amp; Co and Janus Henderson; and capital markets executive David Wu, a former Rothschild banker and Chairman of Capital Markets for Fosun International, one of the largest investment conglomerates in the world.”\n\n[Ascent Hydrogen Fund](https://ascent-funds.com/)",
        "created_utc": 1637142535,
        "id": "hkyxwgg",
        "permalink": "/r/wallstreetbets/comments/qu3dx5/soros_fund_george_soros_discloses_updated/hkyxwgg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637171335.0
    },
    {
        "author": "AnxiousScientistDude",
        "body": "Your chart is missing WU, which is reporting today.",
        "created_utc": 1635860642,
        "id": "hj0dtad",
        "permalink": "/r/options/comments/qjyu8s/historical_post_earnings_moves_mega_compilation/hj0dtad/",
        "score": 1,
        "subreddit": "options",
        "created": 1635889442.0
    },
    {
        "author": "AnxiousScientistDude",
        "body": "Got a WU 18p/19c strangle for earnings. This thing's gonna move at least 6%.",
        "created_utc": 1635860718,
        "id": "hj0dzgf",
        "permalink": "/r/wallstreetbets/comments/ql0v5g/daily_discussion_thread_for_november_02_2021/hj0dzgf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635889518.0
    },
    {
        "author": "damanamathos",
        "body": "He hasn't updated his LinkedIn. Eric Wu became Chairman of the Board in December 2020. Not sure when Keith left the Board but was probably before the SPAC merger went through.\n\nCurrent Board of Directors: [https://investor.opendoor.com/corporate-governance/board-of-directors](https://investor.opendoor.com/corporate-governance/board-of-directors)",
        "created_utc": 1636245316,
        "id": "hjm8yc9",
        "permalink": "/r/stocks/comments/qmbllg/opendoor_ceo_spat_on_twitter_with_real_insight/hjm8yc9/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636274116.0
    },
    {
        "author": "Supersmashlord",
        "body": "Whatever dude he owns a piece of art, you should've bought wu tangs last album which only sold 50k copies if you loved em so much. I love wu tang but ive never paid for their shit.",
        "created_utc": 1636512853,
        "id": "hk0s842",
        "permalink": "/r/wallstreetbets/comments/qq7cle/i_watched_all_martin_shkreli_videos_on_investing/hk0s842/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636541653.0
    },
    {
        "author": "xX69WeedSnipePussyXx",
        "body": "Most members of Wu think it’s garbage and didn’t know they were making an album.",
        "created_utc": 1636510556,
        "id": "hk0n2gy",
        "permalink": "/r/wallstreetbets/comments/qq7cle/i_watched_all_martin_shkreli_videos_on_investing/hk0n2gy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636539356.0
    },
    {
        "author": "AnxiousScientistDude",
        "body": "WU puts for earnings",
        "created_utc": 1635882910,
        "id": "hj1wv5e",
        "permalink": "/r/wallstreetbets/comments/ql0v5g/daily_discussion_thread_for_november_02_2021/hj1wv5e/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635911710.0
    },
    {
        "author": "American--American",
        "body": "If Wu Tang is in I'm in",
        "created_utc": 1636040923,
        "id": "hjamqsz",
        "permalink": "/r/wallstreetbets/comments/qmccl8/gme_updates_rocket_looks_imminent_strap_in_boys/hjamqsz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636069723.0
    },
    {
        "author": "RealPennyMuncher",
        "body": "Western union and A&amp;T and T also at like, decade lows",
        "created_utc": 1636025415,
        "id": "hj9pent",
        "permalink": "/r/wallstreetbets/comments/qmh95a/daily_discussion_thread_for_november_04_2021/hj9pent/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636054215.0
    },
    {
        "author": "UndeadCakeMix",
        "body": "So \"wu mao\" for anyone that speaks Mandarin literally means \"50 cents\" it's what people are called when they defend the CPC regardless if it is a logical argument. And anyone that defends the CPC is automatically a bot or a broke joke that doesn't deserve anything besides a boot in their mouth. Even if you're not judging either government the moment you pick out the flaw in one while the defending the CPC for that specific subject you're automatically a 'wumao' or a 'communist' so uhh... Welcome I think? Clean pitchforks go in that corner over there, bloody ones we clean up over there or hang on the wall as a trophy, just make sure you seal it and sanitize it.",
        "created_utc": 1636567525,
        "id": "hk3h6ml",
        "permalink": "/r/wallstreetbets/comments/qqw2pw/china_pulled_an_08_and_i_feel_we_are_fucked/hk3h6ml/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636596325.0
    },
    {
        "author": "Dammit_forgot_pw",
        "body": "AA\n\nC\n\nPOWW\n\nDFS\n\nPYPL\n\nWU",
        "created_utc": 1636374466,
        "id": "hjso4hm",
        "permalink": "/r/wallstreetbets/comments/qpb8yh/daily_discussion_thread_for_november_08_2021/hjso4hm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636403266.0
    },
    {
        "author": "Yodaatc",
        "body": "WU and VZ",
        "created_utc": 1636730169,
        "id": "hkc9rjk",
        "permalink": "/r/wallstreetbets/comments/qs8s63/daily_discussion_thread_for_november_12_2021/hkc9rjk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636758969.0
    },
    {
        "author": "7leafclover7",
        "body": "Diversify your bonds - Wu tang",
        "created_utc": 1636920260,
        "id": "hkmnkzc",
        "permalink": "/r/stocks/comments/qtmxsk/im_19_years_old_and_made_28_k_in_the_stock_market/hkmnkzc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636949060.0
    },
    {
        "author": "Stellardong",
        "body": "Wu tang clan aint nothin to fuck with",
        "created_utc": 1635826506,
        "id": "hiz31s9",
        "permalink": "/r/wallstreetbets/comments/qkmd3z/what_are_your_moves_tomorrow_november_02_2021/hiz31s9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635855306.0
    },
    {
        "author": "Botboy141",
        "body": "There's a lot on HIMX but not much on Reddit.\n\nAMA or just listen to Thursday's earnings call. Super undervalued by every metric massive margin expansion. Market has written it off as temporary due to the semi shortage. While I think that's certainly a piece of the equation, it's only a piece. They have shifted product mix away from smartphone chips (low margin) to more tablets and auto industry screens (higher margin). These are growing segments with significantly higher margins. Both segments growing significant double digits YoY while smartphone chip sales decreased single digits.\n\nThey've also secured long term supply agreements for customers (for a fee and guaranteed minimum quantities) in addition to being paid fees to procure/guarantee capacity for non-customers for certain technologies.\n\nThey are also in the VR space and make boatloads on Smart TV stuff (Smart TV industry wide is projected to grow at 16% CAGR) and touchscreen display stuff.\n\nAdditional bear case: Wu brothers don't care about shareholders blah blah blah.\n\nCounter: Historically they pay out 75% of net profit as a dividend as is incentivized in the Taiwan tax structure.\n\nAnother Bear Case: China/Taiwan relations get significantly worse (or China straight goes to shit). Himax is a Taiwanese company with a lot of their customers and suppliers in China.\n\nhttps://www.himax.com.tw/investors/\n\nAs of today (2021-11-05), Himax Technologies's share price is $11.45. Himax Technologies's EPS without NRI for the trailing twelve months (TTM) ended in Jun. 2021 was $1.25. Therefore, Himax Technologies's PE Ratio without NRI for today is 9.16.\nDuring the past 13 years, Himax Technologies's highest PE Ratio without NRI was 270.77. The lowest was 7.04. And the median was 25.11.",
        "created_utc": 1636169186,
        "id": "hji9lf8",
        "permalink": "/r/wallstreetbets/comments/qnonui/100k_retirement_account_yolo_will_make_all_5_of/hji9lf8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636197986.0
    },
    {
        "author": "firebadmattgood",
        "body": "&gt;companies with dying business models (Western Union)\n\nlmao I love the insertion of this little tech bro fantasy",
        "created_utc": 1636123956,
        "id": "hjf6qed",
        "permalink": "/r/stocks/comments/qn2ih9/anybody_notice_the_massive_increase_in_the_number/hjf6qed/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636152756.0
    },
    {
        "author": "thekookreport",
        "body": "While not dismissing your point, I'd say this...people have many reasons for selling a stock, but only one reason for buying a stock.  Last year on $GSHD I was really nervous b/c insiders kept dumping stock.  It's up 100% since then.  They just wanted to diversify.  I see Eric Wu going from 32MM shares at Q4 2020 up to 40MM shares at Q4 2021 (likely conversion of a stock grant).",
        "created_utc": 1636150939,
        "id": "hjh51vr",
        "permalink": "/r/wallstreetbets/comments/qmsejn/open_maybe_not_the_pos_you_think_it_is/hjh51vr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636179739.0
    },
    {
        "author": "thesippycup",
        "body": "Whatever happened to that underground Wu Tang album handed over to the government?",
        "created_utc": 1636596519,
        "id": "hk5frmi",
        "permalink": "/r/wallstreetbets/comments/qr41y7/what_are_your_moves_tomorrow_november_11_2021/hk5frmi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636625319.0
    },
    {
        "author": "T3amk1ll",
        "body": "&gt;The Mankiw rule tells is what the Fed Rate should be given current unemployment/inflation. The Wu-Xia shadow rate tells us what the Fed Rate effectively is. \n\nJust to follow up on this \n\nThe Taylor Rule shows what the interest rate should be based on inflation and GDP (descriptive, i.e. can only show it ex post)\n\nThe Mankow Rule shows what the rate should be given unemployment/inflation (so this is related to the Phillips Curve?)\n\nWu-Xia shadow rate shows what the rate effectively is taking *what* exactly into consideration? I've read on it and it says it is what the effective rate is when at the zero lower bound - but what does it take into consideration when showing this rate?",
        "created_utc": 1636466180,
        "id": "hjxou07",
        "permalink": "/r/investing/comments/qpe2gt/imo_the_market_is_strongly_underestimating_the/hjxou07/",
        "score": 1,
        "subreddit": "investing",
        "created": 1636494980.0
    },
    {
        "author": "sbos_",
        "body": " &gt; “As an established battery technology company with proven products and a robust pipeline of new technologies, we are excited by the industry demand and validation of our battery solutions. I am pleased to report that we have won several new multi-year contracts with leading OEMs, driving substantial growth in forecasted contracted revenue since the business combination was announced in February 2021. Furthermore, as part of our continuing mission to develop disruptive battery technology and advance a greener, more electric future, we expect to announce two new products in the first quarter of 2022. These products will complement our existing portfolio of battery solutions with industry leading charging times, extended life cycles, and enhanced safety performance,” said Yang Wu, Microvast’s President and Chief Executive Officer.\n\nQuitely optimistic",
        "created_utc": 1637049064,
        "id": "hktv8of",
        "permalink": "/r/SPACs/comments/qv2nbg/microvast_reports_third_quarter_2021_results/hktv8of/",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1637077864.0
    },
    {
        "author": "bleeetiso",
        "body": "Wu Tang Financial!!!",
        "created_utc": 1637103222,
        "id": "hkwxwmg",
        "permalink": "/r/CanadianInvestor/comments/qvi24m/sitting_on_enbridge_stock_collecting_dividends/hkwxwmg/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1637132022.0
    },
    {
        "author": "Yodaatc",
        "body": "WU",
        "created_utc": 1636937706,
        "id": "hknto2t",
        "permalink": "/r/stocks/comments/qtrh2g/in_your_opinion_which_stock_is_most_undervalued/hknto2t/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636966506.0
    },
    {
        "author": "Noledollars",
        "body": "Agree …. this was an opportunity (once again) to tell the MVST story - FAIL. It was very clear that this call appeared to be an inconvenience to Wu. He couldn’t end the call soon enough. Need to hire a real CEO and let him focus on tech development!",
        "created_utc": 1637109506,
        "id": "hkxccqq",
        "permalink": "/r/SPACs/comments/qv2nbg/microvast_reports_third_quarter_2021_results/hkxccqq/",
        "score": 0,
        "subreddit": "SPACs",
        "created": 1637138306.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "body": "With expensive fees sure I agree. Some are 100% speculation with no real world use (the most famouse one has fees of $5-$50 per transaction, which is insane and has no purpose as a result).\n\nWith low fees and onchain scaleability they can compete with Western-union/Visa/Paypal and have fees at a fraction of a cent compared to 3-5% that these legacy companies charge.",
        "created_utc": 1636477861,
        "id": "hjygcvm",
        "permalink": "/r/stocks/comments/qq5umq/despite_solid_earnings_why_has_paypal_and_most/hjygcvm/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1636506661.0
    },
    {
        "author": "PrettyFlyGuyStark",
        "body": "Western union is for boomers",
        "created_utc": 1636374669,
        "id": "hjsogbt",
        "permalink": "/r/wallstreetbets/comments/qpb8yh/daily_discussion_thread_for_november_08_2021/hjsogbt/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1636403469.0
    },
    {
        "author": "DCD-NOT-DFV",
        "body": "For real for real... Invest in GME and LOOPRING! Now, before the next week starts and quote me on this people, \"LOOPRING = $5.00 plus next week and GME = $322.00.\" proof or ban me by the end of the week. If no one takes this \"suggestion\", don't come crying about the regret of missing out. Remember the golden rule: YOLO! \n\n*(DISCLAIMER: all information provided in this post, is not the opinion of the OP, REDDIT, or any specific deity. I am the sole proprietor to the aforementioned nostradamus effect. If any or all participants feels the need to donate to my wallet, once the week ends and your wallets get it heavy, contact me directly through DM @ nostradamus-effect/NFT/WU-TANG/GME/LOOPRING.net)*",
        "created_utc": 1636912919,
        "id": "hkm3pqa",
        "permalink": "/r/stocks/comments/qtmxsk/im_19_years_old_and_made_28_k_in_the_stock_market/hkm3pqa/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1636941719.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "body": "eg. BCH (also on OTC markets under BCHG). Fraction of a penny fees, scales onchain, instant decentralized settlement. Western Union/.Visa/Paypal will be out of business. Some centralized middleman services may appear, but nothing like their 3-5% transaction fees they currently charge every merchant.\n\nThis companies days as a free nest egg are coming to an end.",
        "created_utc": 1636476558,
        "id": "hjyd21m",
        "permalink": "/r/stocks/comments/qq5umq/despite_solid_earnings_why_has_paypal_and_most/hjyd21m/",
        "score": -1,
        "subreddit": "stocks",
        "created": 1636505358.0
    },
    {
        "author": "uselessbystander34",
        "body": "Just in case you didn’t know it is no coincidence that musk is selling his shares, just read the article and see for yourself!!! I don’t care what they say, musk was given all of Tesla’s research and he is aligning all of his ducks!!! Don’t get caught holding when the elite are dumping their shares \n\n\n\n\n\n\n\n\n\n\nShow More\n\n\n\n\n\n\n\n\n\n\nAdvertisement\n\n\nEnglish News Lifestyle People\nElon Musk becomes richest man on same day when inventor Nikola Tesla died 78 years ago\nElon Musk, founder, CEO of SpaceX and CEO and product architect of Tesla, Inc, becomes the richest man on the same day when inventor Nikola Tesla died 78 years ago.\n\n\n\n\n\n\n\n\nElon Musk becomes the richest man on the same day when inventor Nikola Tesla died 78 years ago  \nIndia TV Lifestyle Desk New Delhi January 08, 2021 22:14 IST\nElon Musk, founder, CEO, and chief designer of SpaceX and CEO and product architect of Tesla Inc, has become the world's richest man, pushing Amazon founder Jeff Bezos on the second spot. On Thursday, Tesla Inc.’s share price surged 7.9%, making Musk now worth $194.8 billion, or $9.5 billion more than Bezos. But do you know, January 7, when Elon Musk became the richest man in the world, on the same day in 1943, Nikola Tesla died? Yes!\nADVERTISEMENT\n\nFlexible Law\nPrograms\nFind a Law Degree\nProgram that Fits Your\nSchedule. Apply Now.\nNew England Law | Boston\nOpen\n\n\n\n\nAds by\nSend feedback\nWhy this ad? \n\nAds by\nSend feedback\nWhy this ad? \nAd was inappropriate\nNot interested in this ad\nAd covered content\nSeen this ad multiple times\n\nThanks. Feedback improves Google ads\nThanks. Feedback improves Google ads\n\nAd closed by\nAd closed by\n\n\nADVERTISEMENT\n\nNikola Tesla, after whom Tesla Motors is named died on January 7, 1943. He was a Serbian-American engineer, inventor and physicist who made scores of breakthroughs in the development, transmission and application of electric power. He is best known for his contributions to the design of the modern alternating current (AC) electricity supply system.\nNikola invented the first motor with alternating current and developed technology for AC generation. In late 1886, He met Alfred S. Brown, a Western Union superintendent, and New York attorney Charles Fletcher Peck. Based on Nikola's new ideas for electrical equipment, they agreed to back the inventor financially and handle his patents. Together they formed the Tesla Electric Company in April 1887. Later, they set up a laboratory for Tesla in Manhattan, where he worked on improving and developing new types of electric motors, generators, and other devices.\n\nAdvertisement\n\n\n\n\nIQ Test: What Is Your IQ?\n\n\nBrainable IQ Test\n\nOpen\n\n\n\n\n\n\n\n\nAds by\nSend feedback\nWhy this ad? \n\nAds by\nSend feedback\nWhy this ad? \nAd covered content\nNot interested in this ad\nSeen this ad multiple times\nAd was inappropriate\n\nThanks. Feedback improves Google ads\nThanks. Feedback improves Google ads\n\nAd closed by\nAd closed by\n\n\n\n\nStarting in 1894, Tesla began investigating radiant energy of \"invisible\" kinds after he had noticed damaged film in his laboratory.  He conducted a range of experiments with mechanical oscillators/generators, electrical discharge tubes, and early X-ray imaging. \nAs the years passed, he started living in a hotel in New York in his last decades, working on new inventions.\nIn his last days, he fed the city's pigeons and interacted with them.\n\nAdvertisement\n\nShow full article\n\n\n\nHere Are 23 of the Coolest Gifts for This 202123 Insanely Cool Gadgets You'll Regret Not Getting Before They Sell Out   \nTrendingGifts\n|\nSponsored\nClick Here\n\n\n\nThis 13 Second Trick Catches Any Cheater, Brace Yourself\n\nPeoplewhiz\n|\nSponsored\nLearn More\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMore from lifestyle\n\t\t\n\t\tDurga Puja 2021: Madhvi Pal, Jharkhand's first woman idol maker continues late husband's business\n\t\t\n\t\tKamla Bhasin passes away: Netizens pay tribute to feminist icon, 'Rest in power'\n\t\t\n\t\tHow can teachers cope with virtual fatigue: 10 expert tips\n\t\t\n\t\tHappy Teacher's Day 2021: Inspiring quotes by Dr Sarvepalli Radhakrishnan\n\t\tAbout UsContact UsElectionsAdvertisePrivacy PolicyInvestors ColumnLegal DisclaimerCSR Policy\n© 2009-2021 Independent News Service, All Rights Reserved.\n\n\n\nBanking That Fits Your Life\nCapital One Café\n\nDine-in\n\nTakeout\n\nDelivery\nHingham\nOPEN\n10AM–6PM\n94 Derby St. Suite 223, Suite 223, Hingh…",
        "created_utc": 1636329530,
        "id": "hjqpjl2",
        "permalink": "/r/wallstreetbets/comments/qooebv/elons_playing_4d_chess/hjqpjl2/",
        "score": -3,
        "subreddit": "wallstreetbets",
        "created": 1636358330.0
    },
    {
        "author": "HiramP20",
        "body": "Yeah I aint reading all that. \n\nFuck martin shkreli, he disrespected wu tang",
        "created_utc": 1636514905,
        "id": "hk0wm4l",
        "permalink": "/r/wallstreetbets/comments/qq7cle/i_watched_all_martin_shkreli_videos_on_investing/hk0wm4l/",
        "score": -5,
        "subreddit": "wallstreetbets",
        "created": 1636543705.0
    },
    {
        "author": "Renegade2592",
        "body": "Imagine being bullish on AMD and NVIDIA but not on GME, the company who sells the games and equipment that tech goes towards playing.\n\nGME is the #1 retail gaming provider, gets a cut of Microsoft digital revenue. Gaming is a top 3 growth industry y.o.y. for 20 years. \n\n3 billion gamers in the world\n\nPapa Cohen\n\nWu-Tang",
        "created_utc": 1636393270,
        "id": "hjttota",
        "permalink": "/r/wallstreetbets/comments/qpb8yh/daily_discussion_thread_for_november_08_2021/hjttota/",
        "score": -13,
        "subreddit": "wallstreetbets",
        "created": 1636422070.0
    }
]