[
    {
        "author": "ModernBuddha1",
        "body": "BB Gateway next gen VPN will take out Z-Scaler and Citrix and any other old VPN Provider. The Gateway is crazy fast, 3x faster than regular VPN that are bulky because they require hardware and licensing. The gateway is cloud based(not a hardware) so can be scaled up to millions of users in seconds unlike regular VPN!! It's also Ai enabled.\n\nThe Blackberry Persona will get rid of OKTA. OKTA is currently leading but they don't have the ai powered solution for Identity Access Mgmt. The persona is ai powered and part of Identity Access Mgmt.\n\nCrowdstrike and Carbon Black and SentenialOne cant stand against Blackberry Cylance(UES). The UES is preventative and acts before payload executes in milliseconds. Over next few months as enterprise and gov realize the power of Prevention, BB will be the leader. Plus all iot like cars, drones, traffic lights, busses, trains, etc require cybersecurity and BB Cylance light weight agent is the only compatible cybersecurity since majority of the iot device run BB QNX. You can't run any of the competition on QNX!!! this is kinda monopoly lol but BB has a reason. lol.\n\nBB has a huge moat and growth coming through in coming years that hasn't been priced. These analyst are trying to manipulate the stock either for personal gains or competition. But game is over for them!!",
        "created_utc": 1635016528,
        "id": "hhrtehr",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1635045328.0
    },
    {
        "author": "Rang_Dipkin",
        "body": "In the ER after I tried to catch Citrix CTXS knife",
        "created_utc": 1634046975,
        "id": "hgcru7n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634075775.0
    },
    {
        "author": "WisconsinGardener",
        "body": "Keeping an eye on Citrix - $CTXS - looks oversold.",
        "created_utc": 1634071321,
        "id": "hgeelw7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634100121.0
    }
]