[
    {
        "author": "latesatifaction",
        "body": "ASX going nuts today for WEB and FLT\nWebjet and Flight Centre",
        "created_utc": 1633316962,
        "id": "hfb4le4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633345762.0
    },
    {
        "author": "awe2D2",
        "body": "So my portfolio isn't at these % yet, but after I get some extra cash from my house sale this is how I have it planned. \n\n1/4 dividend stocks (Canadian Banks, energy, telecom, REITs), 1/4 trading in riskier growth stocks (HITI, RECO, EGLX, ACDC, FLT, etc), 3/8 in ETFs (managed by TD Waterhouse) and 1/8 cash. \n\nThe cash may be used for buying dips, but it's planned to be mostly there for emergency or large expenses, as a buffer for my checking account that the bills come from. \nOver time profits from the growth account will be moved into the long term dividend, and as the numbers grow the %cash should shrink. \n\nI like picking my own companies but poor trading decisions in the past led me to put my RRSPs into a professionally managed account where I don't make the decisions, and it's probably my safest portion.",
        "created_utc": 1633112827,
        "id": "hf062u9",
        "score": 1,
        "subreddit": "investing",
        "created": 1633141627.0
    },
    {
        "author": "flaterate6187",
        "body": "FLT in Canada already has all government approvals and is operating with contracts already. Working out of Calgary Airport. \nI am a waiter in fine dining. When executives come in in happy moods I take notice. Group of 6 came in At 1:30, started ordering $300 &amp; $400 bottles of wine. \nNo one ever notices what they say in front of the waiter. These guys were definitely celebrating something big. \nDidn’t mention any names, but they all laughed every time one of them mentioned that it was an\n“Amazing” deal the had been offered .\n\nAnyone else heard news regarding Amazon using them? Or maybe a buy out?\n\nGotta watch this one.",
        "created_utc": 1633741054,
        "id": "hfxba9j",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1633769854.0
    }
]