[
    {
        "author": "fademefamm",
        "body": "15 of your last posts are about Intel. My dude how heavy are your bags?",
        "created_utc": 1635347649,
        "id": "hi9845s",
        "permalink": "/r/stocks/comments/qgx0uj/intel_core_i512600k_cpu_up_to_50_faster_than/hi9845s/",
        "score": 748,
        "subreddit": "stocks",
        "created": 1635376449.0
    },
    {
        "author": "djOH1",
        "body": "Op must have some pretty big intel bags \n\n*check post history*",
        "created_utc": 1635345713,
        "id": "hi93dqs",
        "permalink": "/r/stocks/comments/qgx0uj/intel_core_i512600k_cpu_up_to_50_faster_than/hi93dqs/",
        "score": 300,
        "subreddit": "stocks",
        "created": 1635374513.0
    },
    {
        "author": "XVOS",
        "body": "“Intel worth it?” “I don’t see the stock going anywhere anytime soon.”\n\n&amp;#x200B;\n\nLooks like you answered your own question. This should be axiomatic, but if you don’t like a stock in the short-medium term DONT BUY IT. You can always buy it later and own something that you think will offer better returns in the short term.",
        "created_utc": 1634996446,
        "id": "hhqphvw",
        "permalink": "/r/stocks/comments/qe1fnu/intel_worth_it/hhqphvw/",
        "score": 234,
        "subreddit": "stocks",
        "created": 1635025246.0
    },
    {
        "author": "Netveg",
        "body": "Started with BAC, INTC, MSFT, Sprint, NOK, F, ARI and FCX.  Dumped slow performers of Sprint, NOK, ARI, F, and FCX to fund a house addition while minimizing capital gains tax.  Subsequently re-added ARI, and new positions in AAPL, SPOT, and POAHY.  Currently evaluating adding positions in ROOT and PLUG.",
        "created_utc": 1634257823,
        "id": "hgofp1x",
        "permalink": "/r/StockMarket/comments/q8c7bs/got_into_investing_9_years_ago_and_heres_how_my/hgofp1x/",
        "score": 211,
        "subreddit": "StockMarket",
        "created": 1634286623.0
    },
    {
        "author": "dreamingofaustralia",
        "body": "I have no direct position in Intel or any other semis but I love reading about the industry. \n\nIntel is \"cheap\" right now because they've failed at executing pretty much every darn thing they've attempted in the past five years. \n\nNow they have a new, more technical CEO, and are trying to regain their previous mojo. \n\nIf you're investing in Intel rn, you are betting that Intel can do the following:\n\n1) Stop having fab execution errors. Intel must succeed at their roadmap for the next 5 years without any major delays.\n\n2) Launch their new foundry program (a low margin business) to compete with TSMC while simultaneously getting their margins back to 60%+. Having a successful number two depends on number one being successful.\n\n3) Continue to better compete against AMD/Nvidia without resorting to lower pricing/margin.\n\n4) Deal with the emergence of ARM competition in server and other high margin areas.\n\nIf they are able to handle these challenges over the next 5 years then I think you can make a pretty decent return on your investment. However, if they have continued missteps, then you'd probably have better returns just investing in the SP500 or competitors like AMD/Nvidia. It's either a tremendous value, or a value trap, and only time will tell.",
        "created_utc": 1635292405,
        "id": "hi6l3d3",
        "permalink": "/r/investing/comments/qgj6pf/is_there_any_dd_on_intel_corp_intc_im_considering/hi6l3d3/",
        "score": 201,
        "subreddit": "investing",
        "created": 1635321205.0
    },
    {
        "author": "Sheeple81",
        "body": "As a holder of both AMD and Intel for a while now, I can tell you Intel is it's own worst nightmare.",
        "created_utc": 1635174522,
        "id": "hhzrj9g",
        "permalink": "/r/wallstreetbets/comments/qfipvw/intels_nightmare/hhzrj9g/",
        "score": 194,
        "subreddit": "wallstreetbets",
        "created": 1635203322.0
    },
    {
        "author": "Patrickstarho",
        "body": "Imo I think intel will be around for a long time. I’m waiting for them to hit $45 and then load up shares.",
        "created_utc": 1634981486,
        "id": "hhq4myp",
        "permalink": "/r/stocks/comments/qe1fnu/intel_worth_it/hhq4myp/",
        "score": 184,
        "subreddit": "stocks",
        "created": 1635010286.0
    },
    {
        "author": "JimboinSC",
        "body": "TLDR....but Jesus, some serious Intel and appreciate your post.",
        "created_utc": 1634382958,
        "id": "hguk3zn",
        "permalink": "/r/wallstreetbets/comments/q99qig/must_read_naked_short_selling_the_truth_is_much/hguk3zn/",
        "score": 135,
        "subreddit": "wallstreetbets",
        "created": 1634411758.0
    },
    {
        "author": "RightSideOfTheBase",
        "body": "That data center miss was key. AMD reports next week. I expect their data center numbers to be big. If so, I don't understand what more people need to see to realize that Intel is losing market share and falling further and further behind their competition. There's a lot of Intel fanboys out there. They're mostly value/dividend investors. These are the same people who fell in love with T and defended their investment in that dog for years. Now go look at the T chart and tell me how you feel about it. Unless there's drastic changes Intel will be T IMO.",
        "created_utc": 1634991875,
        "id": "hhqhid7",
        "permalink": "/r/stocks/comments/qe1fnu/intel_worth_it/hhqhid7/",
        "score": 121,
        "subreddit": "stocks",
        "created": 1635020675.0
    },
    {
        "author": "Paul_Ostert",
        "body": "I'm asking the same thing of Intel.",
        "created_utc": 1635378545,
        "id": "hibd19w",
        "permalink": "/r/stocks/comments/qh9osa/ibm_cant_keep_going_down_right/hibd19w/",
        "score": 106,
        "subreddit": "stocks",
        "created": 1635407345.0
    },
    {
        "author": "mountaincabinlife",
        "body": "Intel ain’t the forefront of a revolution",
        "created_utc": 1635194974,
        "id": "hi15v7n",
        "permalink": "/r/StockMarket/comments/qfngrp/take_a_look_at_this_chart_of_tesla_since_2020_to/hi15v7n/",
        "score": 97,
        "subreddit": "StockMarket",
        "created": 1635223774.0
    },
    {
        "author": "The9thRunaway",
        "body": "I'd likely take a modest position if INTC dips to $40-$45.\n\nBuying INTC is a risk.  Anyone that says otherwise is either lying to you or themselves.  You are betting on a chip manufacturer that can't manufacture their own chips and who's chips are one to two generations behind.\n\nThe fact that INTC is big with a huge market share and steady cashflow is no guarantee that it can continue.  It does, however, afford it a reasonable chance of executing a turnaround.\n\nRegarding the dividend:  payout ratio is modest at around 30% but the 2.5% yield is pretty modest too.  And I'm not convinced that it's safe given the size of capex investments they're looking to make against the potential to falling revenue and increased costs.\n\nDo I think INTC will succeed in it's turnaround?  I think it will find a way to survive.  But if INTC does fail at this turn around, the door may shut permanently.",
        "created_utc": 1634996900,
        "id": "hhqqd4z",
        "permalink": "/r/stocks/comments/qe1fnu/intel_worth_it/hhqqd4z/",
        "score": 83,
        "subreddit": "stocks",
        "created": 1635025700.0
    },
    {
        "author": "CJT2013",
        "body": "Buy it. And AMD\n\nI’ve been suggesting these 2 (and INTC and still do) for years\n\nCash rich, innovative, tech company breaking barriers\n\n**People told me years ago that the prices were already too high.**",
        "created_utc": 1635540605,
        "id": "hik7y5v",
        "permalink": "/r/stocks/comments/qik4sz/is_nvidia_still_a_buy_at_this_valuation_why_or/hik7y5v/",
        "score": 80,
        "subreddit": "stocks",
        "created": 1635569405.0
    },
    {
        "author": "dahliatree",
        "body": "everyone hates intel but it'd be funny as fuck to see the whiplash",
        "created_utc": 1635034247,
        "id": "hhsvwg9",
        "permalink": "/r/stocks/comments/qefyzx/leaked_intel_alder_lake_mobility_cpu_benchmarks/hhsvwg9/",
        "score": 77,
        "subreddit": "stocks",
        "created": 1635063047.0
    },
    {
        "author": "not_creative1",
        "body": "The problem is, intel is getting left behind in PC/laptop  processors by aapl. Apple is on a league of its own, and someone like nvdia or Qualcomm will create the M1 equivalent for PC.\n\n\nAnd the other problem as someone who works in Silicon Valley, in this industry and has a lot of friends in Intel is: \n\nIntel has been bleeding talent left and right for the last 5 years. \n\nIntel pays very low compared to Silicon Valley standards, that’s partly because there is so much competition for talent from nvidia, apple, Qualcomm who are all killing it.  And as a big chunk of compensation is tied in RSUs, Intel cannot compete with salaries as these companies stocks have done extremely well. Apple’s stock has gone up 300% in 5 years and if 30% of your compensation is RSUs, then you are basically getting 30-40% yoy raises for 5 years straight. No way Intel can keep up with that.\n\nIntel pays like 30-50% lower for a comparable position at apple. You just cannot retain top talent with that kind of a pay disparity. Anyone I know, who is talented enough and can leave Intel, has left Intel. \n\n\nIntel is seriously at the danger of becoming IBM of chip makers. Especially now, with amazon working on its own server chips, google working on its own, Microsoft is rumoured to be working on their own silicon for azure. Apparently Qualcomm is going to compete in PC processors. Intel is increasingly looking its in a death spiral. Google, Amazon, Microsoft can pay intel’s top people 2x and poach them left and right. Because these companies are swimming in money form their other businesses.\n\n\nOne thing they have going for them is their fabs. With the increased attention to on shoring chip manufacturing, they should leverage that and start manufacturing chips from competitors for domestic consumption, especially like the defence industry. They have a healthy head start with chip manufacturing infrastructure and know how. They should lean into that. The days of them competing to make the best processors in the world is over.",
        "created_utc": 1634873087,
        "id": "hhksgak",
        "permalink": "/r/wallstreetbets/comments/qd1o8q/how_its_going/hhksgak/",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1634901887.0
    },
    {
        "author": "imjustdmac",
        "body": "Laughs in Intel 🙄",
        "created_utc": 1634848059,
        "id": "hhja4av",
        "permalink": "/r/StockMarket/comments/qd0ifx/facebook_shares_sharp_decline_after_hours/hhja4av/",
        "score": 72,
        "subreddit": "StockMarket",
        "created": 1634876859.0
    },
    {
        "author": "bearhunter429",
        "body": "What a fucking surprise, Intel crashed for the 56th time in a row after reporting earnings.",
        "created_utc": 1634846571,
        "id": "hhj6col",
        "permalink": "/r/wallstreetbets/comments/qd038x/what_are_your_moves_tomorrow_october_22_2021/hhj6col/",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1634875371.0
    },
    {
        "author": "ravivg",
        "body": "Love AMD! So glad I didn't listen to all those experts on Youtube telling me it's overvalued, buy Intel instead it has a P/E below 20 blablabla.",
        "created_utc": 1635281753,
        "id": "hi5wfwg",
        "permalink": "/r/stocks/comments/qgf9pe/amd_crushes_earnings/hi5wfwg/",
        "score": 69,
        "subreddit": "stocks",
        "created": 1635310553.0
    },
    {
        "author": "whoseyourdatadaddy",
        "body": "Wow they haven’t bought so much so soon in years. I’ve dissected those forms. This is some real movement. However I’d wait a few weeks or start to dollar cost average in rn.\n\nI’ve held numerous line dated options throughout the last two years. Some were leaps. Most were losers and cut them out after 30-40 percent loss. A few had a sizeable percent increase which I closed of course.\n\nHowever I always told myself the day intel really really really seems like it could go .. I would seriously get almost or over 2 year leaps. I think that day has come.\n\nI will consider and do more research on latest happenings but I am in no rush for these. Or maybe I will scratch my itch and get a few while I still research. Wouldn’t be the first time I’ve tried long dated derivatives with intel lol. If I had a a penny lol",
        "created_utc": 1635298124,
        "id": "hi6xnqu",
        "permalink": "/r/options/comments/qgkld7/ceo_pat_gelsinger_and_other_intel_insiders_bought/hi6xnqu/",
        "score": 67,
        "subreddit": "options",
        "created": 1635326924.0
    },
    {
        "author": "TappmanC",
        "body": "And IBM, Intel, QQQ - I wonder why",
        "created_utc": 1634849729,
        "id": "hhje9ps",
        "permalink": "/r/StockMarket/comments/qd0ifx/facebook_shares_sharp_decline_after_hours/hhje9ps/",
        "score": 66,
        "subreddit": "StockMarket",
        "created": 1634878529.0
    },
    {
        "author": "XinjDK",
        "body": "Intel has been known to cheat like crazy before, so I couldn't agree more with you.",
        "created_utc": 1635054809,
        "id": "hhty31j",
        "permalink": "/r/stocks/comments/qefyzx/leaked_intel_alder_lake_mobility_cpu_benchmarks/hhty31j/",
        "score": 65,
        "subreddit": "stocks",
        "created": 1635083609.0
    },
    {
        "author": "conrad98",
        "body": "No kidding. Intc has been trading flat for years as AMD is eating their lunch. Intc just isn't a growth stock.   \nGreat if you want to hold shares to collect dividends but how can a tech company in today's climate trade flat when all of their peers are up 20 to 50% this year?",
        "created_utc": 1635118456,
        "id": "hhxa2bf",
        "permalink": "/r/wallstreetbets/comments/qf2z9b/intel_is_not_comparable_to_socalled_value_traps/hhxa2bf/",
        "score": 63,
        "subreddit": "wallstreetbets",
        "created": 1635147256.0
    },
    {
        "author": "Hutz_Lionel",
        "body": "Intel back to the same price it was during the 1999 run up.\n\n\nNice",
        "created_utc": 1634864804,
        "id": "hhkb888",
        "permalink": "/r/wallstreetbets/comments/qd1o8q/how_its_going/hhkb888/",
        "score": 63,
        "subreddit": "wallstreetbets",
        "created": 1634893604.0
    },
    {
        "author": "jmbxyz",
        "body": "Underrated stocks are often the ones that currently no one wants to touch... so I am going to say intel and the reactions that I will get will at least proof that this is indeed a stock with a very bad reputation currently.\n\nWith the current chip shortage and the expectation that the demand in chips will even increase in the future, I see no way that intel revenue will not increase, even if competitors have the better product (which they can not produce enough of to meet the demand). And if intel manages to catch up in product quality, they have a lot of upside potential.",
        "created_utc": 1635536164,
        "id": "hijwlzs",
        "permalink": "/r/ValueInvesting/comments/qii9we/underrated_stock_what_is_your_pick/hijwlzs/",
        "score": 53,
        "subreddit": "ValueInvesting",
        "created": 1635564964.0
    },
    {
        "author": "AxeLond",
        "body": "I see the company going somewhere. Last year they sold off their entire memory business to SK Hynix, now they're outsourcing their silicon manufacturing to TSMC, revenue and net income is trending down (-1% Y/Y), cash on hand is down 45%. Clearly it's a company in decline right now, which is why the P/E is so low.\r  \n\r  \nHigh end semiconductor is a very zero-sum game, every processor sale loss by intel is a sale gained by AMD. If you look at AMD stock they're revenue is up 99.3% Y/Y and net income up 353% Y/Y (mostly due to COVID, but intel had same situation). AMD's revenue wasn't much of a threat to Intel previously. In Q2 2020 AMD made $1.93 billion and Intel $19.7 billion, now AMD is at $3.85 billion and are starting to make significant impact on Intel's numbers.\r  \n\r  \nIntel knew they were on a shit trajectory, that's why they fired their bean counter CEO at the start of this year. However after 8 years of bean counting and coasting on their legacy it's hard to just turn the company around on a dime. I like their new CEO Pat Gelsinger, he has good vision and plans for the company, however I need proof that they can actually execute before I touch Intel.\n\nTheir numbers will continue trending down in the short term, it will be 2 years before the new chip fabs under Pat Gelsinger come online. If AMD keeps their pace of growth at 50%, and continue to execute as well as they have been, then AMD's quarterly revenue would continue to grow to $8.7 billion.  Assuming that increase all comes out of Intel's lunch then Intel's revenue would be declining from $19.6 billion to $14.8 billion (-25%) over the next two years.",
        "created_utc": 1634983996,
        "id": "hhq7dri",
        "permalink": "/r/stocks/comments/qe1fnu/intel_worth_it/hhq7dri/",
        "score": 53,
        "subreddit": "stocks",
        "created": 1635012796.0
    },
    {
        "author": "WestmontOG07",
        "body": "Here are the positives with the report:\n\n1. As should have been expected, margins have increased (via the world wide chip shortage) so that's good. (Increased by about 300 basis points Year over year for the quarter.\n2. The company raised guidance on EPS and on Margin guidance Now expecting GAAP EPS of $4.50 and non-GAAP EPS of $5.28 and GAAP gross margin of 55% and non-GAAP gross margin of 57%.\n3. In the third quarter, the company generated $9.9 billion in cash from operations and paid dividends of $1.4 billion.\n4. Full year spending: $18-19 Billion. \n\nThose are the positives BUT the negatives are the same negatives that have existed before.\n\nFrankly, I am going to continue to hold although I am getting trounced BC I believe that with their deep coffers Intel has the wherewithal to get where they need to go --- IF --- they EXECUTE. If they don't execute, frankly, I see this company going the route of IBM. \n\nI will be patience but MAN is it hard to be optimistic given the stiff competition from very competent competitors, namely, AMD!\n\n&amp;#x200B;\n\nLONG INTC / LONG AMD.",
        "created_utc": 1634850650,
        "id": "hhjgge3",
        "permalink": "/r/stocks/comments/qd0q34/intc_sinks_after_company_blames_shrinking_pc_chip/hhjgge3/",
        "score": 51,
        "subreddit": "stocks",
        "created": 1634879450.0
    },
    {
        "author": "rockinoutwith2",
        "body": "&gt; 500k for the CEO isnt much.\n\nespecially when:\n\n&gt;Intel lured new CEO Pat Gelsinger with a package valued at $116 million\n\nand\n\n&gt;If Gelsinger buys up to $10 million in Intel stock, the company said it will give him a matching number of restricted shares.",
        "created_utc": 1635302055,
        "id": "hi76bmd",
        "permalink": "/r/investing/comments/qgkj7d/ceo_pat_gelsinger_and_other_intel_insiders_bought/hi76bmd/",
        "score": 50,
        "subreddit": "investing",
        "created": 1635330855.0
    },
    {
        "author": "Stock_Candle",
        "body": "After all the meme stock and options YOLOs I've seen this year, when I see someone pitching a bluechip like Intel I feel touched. Like damn, that's a company actually making money.",
        "created_utc": 1634428931,
        "id": "hgx8p71",
        "permalink": "/r/StockMarket/comments/q9mlg8/why_i_think_intc_intel_stock_is_undervalued_the/hgx8p71/",
        "score": 49,
        "subreddit": "StockMarket",
        "created": 1634457731.0
    },
    {
        "author": "NodeDotSwift",
        "body": "Intels biggest problem isn’t AMD, it’s ARM. There is no way they don’t lose major market share to ARM in PCs and servers over next 5-10 years. ARM advantage in power efficiency, heat and cost is huge right now.\n\nAmazon ARM based Graviton is by far the fastest growing server architecture. And Intel lost 20M units a year when Apple (who never used AMD) switched to Apple Silicon.\n\nMicrosoft and other PC venders are actively building their own high performance ARM processors just to ensure their laptops can keep up with the M1.",
        "created_utc": 1633216226,
        "id": "hf5nfpq",
        "permalink": "/r/ValueInvesting/comments/q02p4v/intel/hf5nfpq/",
        "score": 48,
        "subreddit": "ValueInvesting",
        "created": 1633245026.0
    },
    {
        "author": "jlaw224",
        "body": "Why does no one ever consider the fact that NVDA and AMD are chip designers while Intel is a designer and manufacturer when they make these comparisons? IMO the manufacturers are going to be the ones benefiting the most from this chip shortage bc any additional supply they can produce will be gobbled up by the market. Meanwhile, NVDA and AMD can design as many chips as they want but still need to wait on manufacturers. A better comparison would be between Intel and TSM.",
        "created_utc": 1633374570,
        "id": "hfdy2w1",
        "permalink": "/r/StockMarket/comments/q17xof/intel_vs_amd_vs_nvidia_looking_for_a_chip_stock/hfdy2w1/",
        "score": 46,
        "subreddit": "StockMarket",
        "created": 1633403370.0
    },
    {
        "author": "Pedromac",
        "body": "That's Osama bin Laden's beard on zukks face.\n\nFor years the most sofisticated government technology and web of Intel couldn't figure out where Osama was and he was in a cave. Read in to that how you'd like.",
        "created_utc": 1633474886,
        "id": "hfje194",
        "permalink": "/r/wallstreetbets/comments/q21eqb/zucc_at_his_next_virtual_hearing/hfje194/",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1633503686.0
    },
    {
        "author": "rasp215",
        "body": "That's what people said when it hit 1T. In house chips killing both intel and AMD's offerings. New macbooks are home runs. Apple watch is taking off and Apple car is around the corner.",
        "created_utc": 1635281663,
        "id": "hi5w7mj",
        "permalink": "/r/stocks/comments/qgexke/microsoft_earnings_are_out_here_are_the_numbers/hi5w7mj/",
        "score": 46,
        "subreddit": "stocks",
        "created": 1635310463.0
    },
    {
        "author": "HiImWeaboo",
        "body": "This guy must be in deep. Making daily post about INTC.",
        "created_utc": 1635526911,
        "id": "hij8zqd",
        "permalink": "/r/investing/comments/qiglgk/intel_pe_compared_to_nvidia_and_amd_is_just_crazy/hij8zqd/",
        "score": 45,
        "subreddit": "investing",
        "created": 1635555711.0
    },
    {
        "author": "LyfeGaveLemons",
        "body": "You know INTC is in a pretty interesting position. For those saying \"value trap\" i think sure, theres some credence to that thought. AMD NVDA have been the stock market darlings, mostly for good reason. INTC did not spend enough of its money on its tech thinking theyd be the only big players for awhile.\n\nHOWEVER, I COULD see it as a national security threat not to have a player like INTC be in a solid spot for making chips, leaving it all in the hands of the Taiwanese who make like 3/4s of the worlds semiconductors. You know, with China &amp; all.",
        "created_utc": 1634443719,
        "id": "hgy2bz4",
        "permalink": "/r/StockMarket/comments/q9mlg8/why_i_think_intc_intel_stock_is_undervalued_the/hgy2bz4/",
        "score": 45,
        "subreddit": "StockMarket",
        "created": 1634472519.0
    },
    {
        "author": "RightSideOfTheBase",
        "body": "AT&amp;T.\n\nHonestly, there's better semi companies to invest in then Intel. Nvidia, AMD, Marvel, Taiwan Semi, Broadcom, KLAC, Lamb Research, ASML, all of these are better picks then Intel.",
        "created_utc": 1634992320,
        "id": "hhqi6s9",
        "permalink": "/r/stocks/comments/qe1fnu/intel_worth_it/hhqi6s9/",
        "score": 45,
        "subreddit": "stocks",
        "created": 1635021120.0
    },
    {
        "author": "Tony49UK",
        "body": "I remember when Intel unveiled a super duper, extra fast CPU.  A couple of years ago and forgot to announce that it was not just water cooled but had a custom modified fish tank water chiller connected to the CPU.  That for noise reasons had to be in the next room and needed so much juice that it would trip the fuses in any normal US home.  No doubt the CPU was especially binned and delidded as well.  With extra special liquid metal, instead of TIM.\n\nSuffice to say that it never got a real world launch.",
        "created_utc": 1635358155,
        "id": "hi9yj0y",
        "permalink": "/r/stocks/comments/qgx0uj/intel_core_i512600k_cpu_up_to_50_faster_than/hi9yj0y/",
        "score": 45,
        "subreddit": "stocks",
        "created": 1635386955.0
    },
    {
        "author": "rtx3080ti",
        "body": "&gt; For manufacturing, Intel is turning to TSMC’s N6 process to do it\n\nThere’s the problem. If they could fab these themselves, we’d be in completely different world.",
        "created_utc": 1634926872,
        "id": "hhnfod9",
        "permalink": "/r/stocks/comments/qdmpzj/intc_down_12_today_no_new_information_gpu_release/hhnfod9/",
        "score": 44,
        "subreddit": "stocks",
        "created": 1634955672.0
    },
    {
        "author": "NigraOvis",
        "body": "Is it really both sides. They are competitors in a vast pool of customers. It's not red vs black. Consumers don't buy all AMD or all intel",
        "created_utc": 1635179222,
        "id": "hi02vlm",
        "permalink": "/r/wallstreetbets/comments/qfipvw/intels_nightmare/hi02vlm/",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1635208022.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/Lamesonlmsn (1/0) made a bet that INTC would go to 52.0 when it was 55.72 and it did, congrats you fuckin nerd.",
        "created_utc": 1634848969,
        "id": "hhjcen9",
        "permalink": "/r/wallstreetbets/comments/qd038x/what_are_your_moves_tomorrow_october_22_2021/hhjcen9/",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1634877769.0
    },
    {
        "author": "ZZZzzss",
        "body": "Could you stop posting your Intel is undervalued shit everyday. They are far behind their competitors and valued with a low p/e for a reason. I would say Intel Bagholder detected.",
        "created_utc": 1635527588,
        "id": "hijaqfb",
        "permalink": "/r/investing/comments/qiglgk/intel_pe_compared_to_nvidia_and_amd_is_just_crazy/hijaqfb/",
        "score": 42,
        "subreddit": "investing",
        "created": 1635556388.0
    },
    {
        "author": "mitchcana96",
        "body": "I'd take AMD right now just based on quantifiable and perceived growth over the next few years and into the beginning of 2025. After that or a little before intc could be a good buy if they can get competitive again. I'm definitely biased towards semi conductor companies though",
        "created_utc": 1633565212,
        "id": "hfo3olo",
        "permalink": "/r/stocks/comments/q2wh8s/pltr_vs_amd/hfo3olo/",
        "score": 42,
        "subreddit": "stocks",
        "created": 1633594012.0
    },
    {
        "author": "bungholio99",
        "body": "Intel is missing all semi conducteur growth markets like IOT/Server/Storage.\nPC Business isn’t sustainable and they also lose to AMD.\n\nThere is a reason why no Analyst says it’s a buy.\n\nThe new Factory will start working in 5 Years till then it’s only investment and bad for EPS.\n\nIntel tried everything but they failed, technical issues were costly spectre/meltdown.\nIntel lost most lead engineers.\n\nAnd you shouldn’t forget that unlawful competition behavior and intel go side by side, the set record in recieving fines.\n\nhttps://www.reuters.com/article/us-eu-intel-antitrust-idUSKBN20X1FV\n\nMaybe touch it in 3-4 years but definitly not now.",
        "created_utc": 1634983190,
        "id": "hhq6h9a",
        "permalink": "/r/stocks/comments/qe1fnu/intel_worth_it/hhq6h9a/",
        "score": 41,
        "subreddit": "stocks",
        "created": 1635011990.0
    },
    {
        "author": "thinvanilla",
        "body": "Yep and it's not even just Apple. Microsoft and Amazon are developing their own ARM chips specifically for their data centres, which is Intel's main market. Anybody with stock in Intel needs to know that Microsoft/Amazon are working on ARM chips, this is a massive red flag:\n\nhttps://www.theverge.com/2020/12/18/22189450/microsoft-arm-processors-chips-servers-surface-report\n\nhttps://www.reuters.com/article/uk-amazon-chips-idUKKBN28B5TH\n\nAnd the world's most powerful supercomputer uses ARM chips:\n\nhttps://en.wikipedia.org/wiki/Fugaku_(supercomputer)\n\nApple probably won't supply chips but they have set the bar for all other companies to aim for. ARM chips have been proven as viable alternatives.",
        "created_utc": 1635005337,
        "id": "hhr49u2",
        "permalink": "/r/stocks/comments/qe1fnu/intel_worth_it/hhr49u2/",
        "score": 39,
        "subreddit": "stocks",
        "created": 1635034137.0
    },
    {
        "author": "omen_tenebris",
        "body": "Dude, i hate to pop your sperm bubble but it was likely tested on windows 11 and the task scheduler borked ryzen by at least 15%. I'd not get my hopes up Intel beating ryzen 5xxx. If they match, they should be happy",
        "created_utc": 1635359084,
        "id": "hia0xyf",
        "permalink": "/r/stocks/comments/qgx0uj/intel_core_i512600k_cpu_up_to_50_faster_than/hia0xyf/",
        "score": 39,
        "subreddit": "stocks",
        "created": 1635387884.0
    },
    {
        "author": "VanSex",
        "body": "I own $1000 of intel and even I'm rolling my eyes. P/E is a good starting point for evaluating a stock, but it can be deceptive.\n\nIntel has that P/E for a reason.",
        "created_utc": 1635526684,
        "id": "hij8epr",
        "permalink": "/r/investing/comments/qiglgk/intel_pe_compared_to_nvidia_and_amd_is_just_crazy/hij8epr/",
        "score": 38,
        "subreddit": "investing",
        "created": 1635555484.0
    },
    {
        "author": "VictorDanville",
        "body": "I wonder if salary is a good metric to determine how well a company will do. For example, I did quick google search on average software engineer salary for Intel was $100k while for AMD was $150k... well that makes me bearish on Intel. How can Intel turn things around if the top talent can find better pay elsewhere?",
        "created_utc": 1635121380,
        "id": "hhxfstl",
        "permalink": "/r/stocks/comments/qf2hml/this_week_will_be_insane/hhxfstl/",
        "score": 37,
        "subreddit": "stocks",
        "created": 1635150180.0
    },
    {
        "author": "awoeoc",
        "body": "I bought $40k in intel calls and I now have $10k in intel calls and sleep like a baby. I also invested heavily in BABA and lost a ton there and sleep like a baby. I also invested in JD and sleep like a baby. also bought a ton of MU and sleep like a baby. So yeah you gotta be willing to take your losses.\n\nI'm also as retarded as a baby.",
        "created_utc": 1633110542,
        "id": "hf00t2g",
        "permalink": "/r/wallstreetbets/comments/pz44fr/i_sold_these_aapl_150_1215_calls_at_a_huge_loss/hf00t2g/",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1633139342.0
    },
    {
        "author": "JDMKing24",
        "body": "Also this is the fair value that came out of my DCF analysis. I would like them at 35 though so until then I'm not touching it. Intel is not the only stock in the market.",
        "created_utc": 1634996610,
        "id": "hhqptba",
        "permalink": "/r/stocks/comments/qe1fnu/intel_worth_it/hhqptba/",
        "score": 37,
        "subreddit": "stocks",
        "created": 1635025410.0
    },
    {
        "author": "FinndBors",
        "body": "I don't have a position and I haven't analyzed the chip market in detail, but here are your risk factors:\n\n* Intel gets its act together (unlikely, but the other time AMD beat Intel, Intel finally woke up and fixed their shit and AMD cratered. I doubt Intel will until next generation fabs in a couple years though).\n* Server chips move away from x86 to ARM for performance per watt/cost issues.\n* General relevance of CPU drops -- more dollars spent on specialized chips for AI over general purpose CPUs.",
        "created_utc": 1634833819,
        "id": "hhian9u",
        "permalink": "/r/stocks/comments/qcvc2r/im_struggling_to_find_a_bad_side_to_buying_amd/hhian9u/",
        "score": 37,
        "subreddit": "stocks",
        "created": 1634862619.0
    },
    {
        "author": "wyo45",
        "body": "Have no opinion on intel really other than I’ve seen this happen so many times the last year or 2. Intel releases a report and hate pours on like a waterfall the stock falls like 20% into the low 40s then for whatever reason the street buys it up again….\n\nHonestly, it’s puzzling to me. This stock has so much hate and love loss, but wtf does it always get bought from the low 40s up to the 50s or even 60 every time… \n\nKnowing this part of me wants to jump on board if it hits 45 or below and sell covered calls. But then again I got trapped in T for years with that mentality so I’m not sure if it’s even worth messing with. \n\nSemis are such a limelight industry. Feel like one month this company is The best in the breed then the next month it’s the worst… probably better off with a semi ETF",
        "created_utc": 1634992824,
        "id": "hhqizz6",
        "permalink": "/r/stocks/comments/qe1fnu/intel_worth_it/hhqizz6/",
        "score": 36,
        "subreddit": "stocks",
        "created": 1635021624.0
    },
    {
        "author": "chadsaggindik",
        "body": "Thanks for the intel, nancy pelosi would be proud.",
        "created_utc": 1635550849,
        "id": "hikvi27",
        "permalink": "/r/wallstreetbets/comments/qimm2r/the_current_state_of_the_shipping_industry/hikvi27/",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1635579649.0
    },
    {
        "author": "Dumb_Vampire_Girl",
        "body": "I like that I only invested in Intel and IBM thinking I was smarter than all the other tech holders. (:",
        "created_utc": 1634857727,
        "id": "hhjw86f",
        "permalink": "/r/wallstreetbets/comments/qd1o8q/how_its_going/hhjw86f/",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1634886527.0
    },
    {
        "author": "Look_here_Listen_",
        "body": "Intel is a buy in the Mid to low 40’s. Intel still behind tsm/amd by a few years and it will take large capital spending to catch up. AMD will continue to eat massive amounts of intc market share in the meantime",
        "created_utc": 1634926547,
        "id": "hhnevb7",
        "permalink": "/r/stocks/comments/qdmpzj/intc_down_12_today_no_new_information_gpu_release/hhnevb7/",
        "score": 35,
        "subreddit": "stocks",
        "created": 1634955347.0
    },
    {
        "author": "Not_FinancialAdvice",
        "body": "I think that given the pricing and availability environment we're in, if they just have available GPUs with reasonable pricing (not like $500), even a chip with middling performance might see good sales numbers.\n\nDisclosure: INTC, AMD shareholder",
        "created_utc": 1634934164,
        "id": "hhnxcp5",
        "permalink": "/r/stocks/comments/qdmpzj/intc_down_12_today_no_new_information_gpu_release/hhnxcp5/",
        "score": 35,
        "subreddit": "stocks",
        "created": 1634962964.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "body": "They are getting a US government subsidy to make their own chip plants in the USA.\n\n I guess thats free money from US taxpayers going to INTC shareholders.",
        "created_utc": 1634927021,
        "id": "hhng1oe",
        "permalink": "/r/stocks/comments/qdmpzj/intc_down_12_today_no_new_information_gpu_release/hhng1oe/",
        "score": 35,
        "subreddit": "stocks",
        "created": 1634955821.0
    },
    {
        "author": "batido6",
        "body": "Yeah I’ve read into that a bit. Would love some intel on the Twitter though.",
        "created_utc": 1633387494,
        "id": "hfevsql",
        "permalink": "/r/stocks/comments/q1fenv/is_the_nancy_pelosi_stock_tracker_twitter_legit/hfevsql/",
        "score": 34,
        "subreddit": "stocks",
        "created": 1633416294.0
    },
    {
        "author": "GushingGranny1",
        "body": "INTC is AMD's physically deformed and retarded cousin and who the fuck uses SNAP when there's Tic Tok?",
        "created_utc": 1634853222,
        "id": "hhjmeok",
        "permalink": "/r/wallstreetbets/comments/qd1o8q/how_its_going/hhjmeok/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1634882022.0
    },
    {
        "author": "PS_its_me",
        "body": "intel chart is identical",
        "created_utc": 1634848808,
        "id": "hhjc02c",
        "permalink": "/r/StockMarket/comments/qd0ifx/facebook_shares_sharp_decline_after_hours/hhjc02c/",
        "score": 33,
        "subreddit": "StockMarket",
        "created": 1634877608.0
    },
    {
        "author": "han_bylo",
        "body": "Ya me too I'm starting to feel dumb with all the intel I'm holding.    Cant even really move covered calls with any value",
        "created_utc": 1635378734,
        "id": "hibdgk5",
        "permalink": "/r/stocks/comments/qh9osa/ibm_cant_keep_going_down_right/hibdgk5/",
        "score": 33,
        "subreddit": "stocks",
        "created": 1635407534.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "body": "This is the reason Intel is going to be paid by the the US gov to make factories in the US.",
        "created_utc": 1633824714,
        "id": "hg1lrc7",
        "permalink": "/r/stocks/comments/q4tr4w/chinas_xi_vows_reunification_with_taiwan/hg1lrc7/",
        "score": 32,
        "subreddit": "stocks",
        "created": 1633853514.0
    },
    {
        "author": "junju009",
        "body": "I dunno, it’s intel. Last time AMD caught intel with their pants down, it lasted 2 years before they came back and made sure AMD never had another competitive product for over 10 years. They got complacent and AMD took over. Remember that Intel also has more software engineers than AMD has employees. They have a lot resources and shouldn’t be counted out. I expect their hybrid core laptops to be big\n\nAnd I say this as someone with 3 AMD PCs",
        "created_utc": 1635011477,
        "id": "hhri066",
        "permalink": "/r/stocks/comments/qe1fnu/intel_worth_it/hhri066/",
        "score": 32,
        "subreddit": "stocks",
        "created": 1635040277.0
    },
    {
        "author": "super_neo",
        "body": "Intel fell behind with the release of 7nm processor and also Apple ditched Intel processors as they came up with their own M1 processors. \n\n[https://www.theverge.com/22597713/intel-7nm-delay-summer-2020-apple-arm-switch-roadmap-gelsinger-ceo](https://www.theverge.com/22597713/intel-7nm-delay-summer-2020-apple-arm-switch-roadmap-gelsinger-ceo)\n\nhttps://www.theguardian.com/technology/2020/jun/22/apple-ditches-intel-for-arm-processors-in-big-sur-computers",
        "created_utc": 1634442346,
        "id": "hgxzsz9",
        "permalink": "/r/StockMarket/comments/q9mlg8/why_i_think_intc_intel_stock_is_undervalued_the/hgxzsz9/",
        "score": 32,
        "subreddit": "StockMarket",
        "created": 1634471146.0
    },
    {
        "author": "dontggme",
        "body": "People won't want to hear it. Reddit has a hate boner for Intel. It's still a top 20 QQQ holding. I'm very bullish into the new year after the correction.",
        "created_utc": 1635033643,
        "id": "hhsumqa",
        "permalink": "/r/stocks/comments/qefyzx/leaked_intel_alder_lake_mobility_cpu_benchmarks/hhsumqa/",
        "score": 32,
        "subreddit": "stocks",
        "created": 1635062443.0
    },
    {
        "author": "Demi_em",
        "body": "My family member 51, speaks broken english, barely can compose an email and download apps onto his phone, **yet he trades options on RH**. He is on a group message where a person \"has all the Intel. he's a millionaire.\"",
        "created_utc": 1633989071,
        "id": "hga2qe0",
        "permalink": "/r/wallstreetbets/comments/q60t21/wsb_yolo_club_recruitment_center/hga2qe0/",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1634017871.0
    },
    {
        "author": "Rbelkc",
        "body": "Yes but they’re not making the technology chips of tomorrow they have fallen way behind TSM which is developing 3 nanometer tech Intel is still up around 12, so it doesn’t get the love. Look for more downside this week",
        "created_utc": 1634447470,
        "id": "hgy8iwd",
        "permalink": "/r/StockMarket/comments/q9mlg8/why_i_think_intc_intel_stock_is_undervalued_the/hgy8iwd/",
        "score": 31,
        "subreddit": "StockMarket",
        "created": 1634476270.0
    },
    {
        "author": "OrcaBull",
        "body": "Fuck Snap, Fuck Whirlpool, Fuck intel, and Fuck Chipotle (short)!",
        "created_utc": 1634848456,
        "id": "hhjb408",
        "permalink": "/r/wallstreetbets/comments/qd0jss/im_having_a_bad_hour/hhjb408/",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1634877256.0
    },
    {
        "author": "danmalek466",
        "body": "HIBB, INTC, MMM, HPQ",
        "created_utc": 1635385532,
        "id": "hibsufb",
        "permalink": "/r/stocks/comments/qhbcle/what_do_you_think_is_currently_undervalued_in_the/hibsufb/",
        "score": 31,
        "subreddit": "stocks",
        "created": 1635414332.0
    },
    {
        "author": "lsmokel",
        "body": "I lost all my “normal” gains for the year in the month of Sept, but I also managed to consistently pick up more shares or new positions in QQQ, SPYX, VXUS, NVDA, SOFI, and INTC.",
        "created_utc": 1633220509,
        "id": "hf5wy0b",
        "permalink": "/r/stocks/comments/q06f4p/falling_knives_club/hf5wy0b/",
        "score": 30,
        "subreddit": "stocks",
        "created": 1633249309.0
    },
    {
        "author": "Rothiragay",
        "body": "Just remember your Value stock like Intel are going to drop if the bubble pops too. The only way to hedge against it is by shorting buying puts or going long on a inverse ETF.",
        "created_utc": 1634222026,
        "id": "hgm5y1m",
        "permalink": "/r/investing/comments/q7yz7n/producer_price_inflation_hits_new_record_high/hgm5y1m/",
        "score": 29,
        "subreddit": "investing",
        "created": 1634250826.0
    },
    {
        "author": "whatkindpinetrees",
        "body": "American made chips are important for national security they control our fighter planes, missiles, rockets, satellites, ..etc. the deep pocket DoD would be stupid not to help Intel become world leader again.",
        "created_utc": 1635709551,
        "id": "hisuwfv",
        "permalink": "/r/wallstreetbets/comments/qjv4i3/intel_value_trap_or_undervalued/hisuwfv/",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1635738351.0
    },
    {
        "author": "Right-Fee6202",
        "body": "I feel like Amd calls gotta go brrrr after intel dropped 10%. I know it’s been running up, but I bought Amd puts last earning in July and su bae said we don’t do things like that here. \n\nPart of my confidence is that I’m sure they’ll finalize the Xilinx merger details since it already got approved a while back, and the call should be a good place to discuss it in regards to guidance.",
        "created_utc": 1635011610,
        "id": "hhriak4",
        "permalink": "/r/wallstreetbets/comments/qe2ki6/most_anticipated_earnings_releases_for_the/hhriak4/",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1635040410.0
    },
    {
        "author": "Benjunmin",
        "body": "Stock prices always reflect future performance. Lots of people think Intel won’t do well in the future. Nvidia and AMD are taking over their customers.",
        "created_utc": 1635212901,
        "id": "hi29wz6",
        "permalink": "/r/stocks/comments/qfvh20/what_am_i_missing_on_intel/hi29wz6/",
        "score": 28,
        "subreddit": "stocks",
        "created": 1635241701.0
    },
    {
        "author": "IllmaticaL1",
        "body": "Yes INTC is undervalued because AMD is eating its lunch.\n\nEdit: AMD*",
        "created_utc": 1634442381,
        "id": "hgxzvd1",
        "permalink": "/r/StockMarket/comments/q9mlg8/why_i_think_intc_intel_stock_is_undervalued_the/hgxzvd1/",
        "score": 27,
        "subreddit": "StockMarket",
        "created": 1634471181.0
    },
    {
        "author": "SpliTTMark",
        "body": "amd UP\n\nnvda UP\n\nintc DOWN",
        "created_utc": 1635354912,
        "id": "hi9q6nh",
        "permalink": "/r/stocks/comments/qgx0uj/intel_core_i512600k_cpu_up_to_50_faster_than/hi9q6nh/",
        "score": 27,
        "subreddit": "stocks",
        "created": 1635383712.0
    },
    {
        "author": "ThePandaRider",
        "body": "It's easier to lose money with NVDA and AMD too, their current valuations are high and near perfect executions are priced in. If things get bumpy and Intel is able to surprise everyone with their GPUs then those valuations may start collapsing.",
        "created_utc": 1635442501,
        "id": "hien0u7",
        "permalink": "/r/stocks/comments/qhpw5a/why_i_am_bullish_on_intc/hien0u7/",
        "score": 27,
        "subreddit": "stocks",
        "created": 1635471301.0
    },
    {
        "author": "Shortdast0ck",
        "body": "Haven’t tested it out personally but someone from my shop has an M1 and he says it runs nice.  No fan, very low energy consumption and you can throw things at it and you can’t even feel that hiccup.  So as fast as this Intel chip may be, I wonder how much of an energy hog it is compared to the M1.  Can it run as quiet?  Can it sip on that laptop battery?  Speed isn’t the only thing to factor in here.",
        "created_utc": 1635038027,
        "id": "hht3xgw",
        "permalink": "/r/stocks/comments/qefyzx/leaked_intel_alder_lake_mobility_cpu_benchmarks/hht3xgw/",
        "score": 27,
        "subreddit": "stocks",
        "created": 1635066827.0
    },
    {
        "author": "backfire97",
        "body": "You say they censor news, but you literally just went to /r/AMD and made a post about Intel. It's no wonder they removed your post - it's very clearly stated in the rules that all discussion should be only about AMD products.\n\nThe section of the rule you violated: \n&gt;Content that is primarily about a competitor or industry that merely references AMD, AMD products or technologies would not meet this criteria",
        "created_utc": 1635361077,
        "id": "hia63dz",
        "permalink": "/r/stocks/comments/qgx0uj/intel_core_i512600k_cpu_up_to_50_faster_than/hia63dz/",
        "score": 26,
        "subreddit": "stocks",
        "created": 1635389877.0
    },
    {
        "author": "Investing8675309",
        "body": "Would search this sub’s history for analysis, INTC and BABA seem to come up at least once a week.",
        "created_utc": 1634210931,
        "id": "hglkn45",
        "permalink": "/r/ValueInvesting/comments/q7wjyz/thoughts_about_intel/hglkn45/",
        "score": 25,
        "subreddit": "ValueInvesting",
        "created": 1634239731.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "Remember when Intel reported earnings and blamed cloud companies making their own chips is what caused a shrinkage in their server sector?\n\nI commented that they're going to AMD and posting how they're increasing performance. Here we are, Netflix did exactly that.\n\nAMD numba 1.",
        "created_utc": 1635283496,
        "id": "hi60spr",
        "permalink": "/r/stocks/comments/qgf9pe/amd_crushes_earnings/hi60spr/",
        "score": 25,
        "subreddit": "stocks",
        "created": 1635312296.0
    },
    {
        "author": "stippleworth",
        "body": "Lucid Intel Google Microsoft Apple - Bitcoin Amazon Lowes Loews Samsung",
        "created_utc": 1635451932,
        "id": "hifaxz2",
        "permalink": "/r/stocks/comments/qht5z1/facebook_changes_company_name_to_meta/hifaxz2/",
        "score": 25,
        "subreddit": "stocks",
        "created": 1635480732.0
    },
    {
        "author": "alles_long",
        "body": "[previous post](https://www.reddit.com/r/wallstreetbets/comments/qaqldg/amd_update_in_su_bae_we_trust/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n\nIntel earnings tomorrow. They’ll suck, losing market share in server markets. Guess who’s winning market share.\n\nIn Su Bae we trust.",
        "created_utc": 1634737421,
        "id": "hhczmv9",
        "permalink": "/r/wallstreetbets/comments/qc1618/amd_update_2_were_just_getting_started/hhczmv9/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1634766221.0
    },
    {
        "author": "WestmontOG07",
        "body": "Intel remains, fundamentally, a stock that I believe in. Yes, AMD is absolutely eating their lunch and NVIDIA is, frankly, in a league of their own, however, Intel has a relatively new CEO that has TONS of experience in the game and is turning this titanic sized company around --- it just takes time. \n\nThey are going to start competing with the like of Taiwan Semi on the fab side of the business and, fundamentally, I would argue, they are the strongest positioned chip company.\n\n$23 Billion of cash on hand against $36 billion of long term debt.\n\nMore importantly, the company is clearing, after tax net income of over $20 billion each and every year, which is expected to continue WITH dividend raises.\n\nThe companies future growth prospects will rely on one thing and one thing alone: Execution! If the company can start to execute, they have incredible fundamentals and can buy anything and everything they want. \n\nThis is why I have a significant stake in Intel and will continue to hold.\n\nLONG INTC. LONG AMD. LONG NVIDIA.",
        "created_utc": 1634819942,
        "id": "hhhfowb",
        "permalink": "/r/stocks/comments/qcoshn/intel_reports_earnings_on_thursday_what_to_expect/hhhfowb/",
        "score": 25,
        "subreddit": "stocks",
        "created": 1634848742.0
    },
    {
        "author": "Recoil42",
        "body": "Intel and TSMC are competing at different levels.\n\nAt this point, TSMC is Coke Classic, Intel is RC Cola.\n\nIt's not to say Intel doesn't have a good product, but TSMC is *so good* that Apple bought out their entire run of 5nm production last year. They've got NVIDIA, AMD, Qualcomm, and Mediatek practically fighting to work with them.\n\nIt's basically a bidding war to work with TSMC right now — they're that good at what they do, they're dramatically leading the competitors.\n\nRight now, Samsung beats them *only* on margin. Intel will have go further than that, considering they've never done pure-play foundry work before and lack a track record. \n\n(Disclosure: I have positions in TSMC)",
        "created_utc": 1635296798,
        "id": "hi6urpl",
        "permalink": "/r/investing/comments/qgj6pf/is_there_any_dd_on_intel_corp_intc_im_considering/hi6urpl/",
        "score": 24,
        "subreddit": "investing",
        "created": 1635325598.0
    },
    {
        "author": "Evilbred",
        "body": "I bought in on Intel at $52 and I'm buying in more now.\n\nThey're suffering in the short term, but I'm a bit of a hardware enthusiast, and what I see on the horizon in the near term is VERY promising.\n\nI think you'll need a stomach for a long play, but I wouldn't rule out Intel going to $150 by Q4 2023.\n\n&amp;#x200B;\n\nRight now they have a completely new architecture, a whole new paradigm, when it comes to server and PC x86 CPUs. Their Alder Lake product line is using big.LITTLE setup, and the initial benchmarks show incredible performance increase over their current offerings. To the point where their 12900K shows the ability to match AMD's top consumer CPUs, 5950X in multicore and significantly beat them in single core (basically meaning they can do very parallel work just as fast, but do the non-parallel single throughput workloads much faster).\n\n&amp;#x200B;\n\nIntel is also preparing to launch their first real dedicated graphics cards starting in Q2 2022. This is Nvidia's bread and butter and where alot of AMD's profit comes from as well. You may or may not be aware of the madness that is the graphics card market right now, with prices skyrocketing 200-300% and demand has been outstripping supply by huge amounts for 12 months now. \n\n&amp;#x200B;\n\nIntel's long term plan is the expansion of it's fabrication foundries. You may have heard that semi-conductor production is a dog's breakfast right now. Production of everything from cars, to computers to toasters is being slowed by the fact that chips can't be made fast enough for them. The big chip manufacturers for most of these things are TSMC, Samsung and to a lesser extent, Global Foundries. Intel is making a play, likely using huge amounts of government money, to increase their production ability, move the capacity to produce chips to the US (which is currently a high national security concern). It will take 2-4 years to make this happen, but it's a great direction to move in, especially since a short time ago Intel was toying with the idea of getting rid of it's production capability.\n\n&amp;#x200B;\n\nAll in all, I think Intel has a great future, but they have probably one more quarter before we see the effects of their turnaround strategy and if it will work.",
        "created_utc": 1634922310,
        "id": "hhn4e5b",
        "permalink": "/r/wallstreetbets/comments/qdhe1p/thanks_for_blowing_earnings_intc/hhn4e5b/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1634951110.0
    },
    {
        "author": "ClosedGuard",
        "body": "Intel crumbled after earnings which is crazy because they made 18 bil in revenue but where off the mark by like 11k and they beat eps by 53%. Earnings season can get real weird at times",
        "created_utc": 1635133657,
        "id": "hhy3a52",
        "permalink": "/r/stocks/comments/qf2hml/this_week_will_be_insane/hhy3a52/",
        "score": 24,
        "subreddit": "stocks",
        "created": 1635162457.0
    },
    {
        "author": "cloudiett",
        "body": "Intel has been $40-$60 range for 5 years.",
        "created_utc": 1635122979,
        "id": "hhxizt1",
        "permalink": "/r/wallstreetbets/comments/qf2z9b/intel_is_not_comparable_to_socalled_value_traps/hhxizt1/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1635151779.0
    },
    {
        "author": "l33t_p3n1s",
        "body": "INTC stock price gets beaten to shit, and they are still making $20 billion a year in profit, more than the *REVENUE* of AMD and NVDA combined. They decide to take $10 billion off the top and spend it on some chip fabs or R&amp;D, it's more than AMD's total revenue and they're still earning more than AMD's revenue. \n\nIn the real financial world, they write down the expense over several years and it's a couple percent hit to their bottom line. Meanwhile, they've gotten chunked for 30 percent over it. Looks like an overreaction to me.\n\nAMD is riding a lot of hype because they temporarily \"won\" the high-end CPU performance battle, and video cards are selling as fast as they can make them. That doesn't last forever. I remember when AMD was in second place and floundering technologically, and their share price was around $3. Betting against INTC right now strikes me kind of like betting against Microsoft 10 years ago. In the short term they're exciting, but over the next decade? Right now looks like the time when you'll look back and say they were very cheap.",
        "created_utc": 1635147241,
        "id": "hhylser",
        "permalink": "/r/wallstreetbets/comments/qf2z9b/intel_is_not_comparable_to_socalled_value_traps/hhylser/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1635176041.0
    },
    {
        "author": "RollingWithDaPunches",
        "body": "Intel beat EPS by some 50%... and got sold hard... WTF is it with investors? Can anyone explain?   \nThe company is still a behemoth in the PC/Server space. It's not doing great tech wise, but they're first in line for the next EUV machines from ASML. They're signing some contracts with TSMC to have 5nm chips done by them... what am I missing (or what are investors missing?)",
        "created_utc": 1634872120,
        "id": "hhkqixk",
        "permalink": "/r/wallstreetbets/comments/qd1o8q/how_its_going/hhkqixk/",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1634900920.0
    },
    {
        "author": "Rjlv6",
        "body": "Personally I think people are blowing the ARM threat completely out of proportion. In my view the concern it poses is that ARM will allow more companies to develop their own in house design plus a new  CPU competitors will enter the market. That being said Intel has an enormous amount of advantages over any possible entrant into the CPU space. Lets not forget they've been in this position for the majority of their corporate history. They fought Power PC and won. They competed in against a multitude of x86 vendors which they brutally destroyed like DEC, Cyrix [https://en.wikipedia.org/wiki/List\\_of\\_x86\\_manufacturers](https://en.wikipedia.org/wiki/List_of_x86_manufacturers) the only exception is AMD which itself has almost died multiple times. Had Intel not rested on their laurels AMD would be dead now too and this is coming from someone who loves AMD to death. (I bought AMD @ $4 back in 2014). \n\nNot only does Intel have some of the best CPU designers in the industry their Roadmap is insane. They are planning on marrying together all of their IP CPU, GPU, FPGA's, Memory, Software and all the other random highly competitive stuff intel does. I think Big.Little married with chiplets and AI accelerators will be a game changer. The only other company I see approaching this scale of capability is AMD. I also don't think every single company will have their own inhouse designs, building CPU's is very expensive and complicated. The expertise is limited and you open yourself up to a whole host of complications. Yes it makes sense for Apple, Amazon, Microsoft etc. But the small to medium sized players will still need a common platform if they want to exist. \n\nThe Foundry is a risk yes but I believe Intel has the finances and talent necessary to figure out this problem. Perhaps they could even go license a new node from Samsung similar to Global foundries. Or maybe Intel and Samsung partner up to develop new nodes to take on TSMC. To me its not a crazy though that Intel and Apple might partner up on the manufacturing side either. Apple has tried to be less dependent on TSMC by leveraging Global Foundries but they just could keep up with TSMC. I don't think anyone wants to be in a situation where there is one FAB to rule them all especially with the geopolitical risks. I'm willing to bet that their massive war chest will help them solve this problem. If not they can always pull an AMD and sell the fab.\n\n&amp;#x200B;\n\nIn my opinion Intel's problems have been self inflicted by poor management under Brian Krzanich. They got lazy meanwhile and AMD came in and smashed them. Imagine if Intel began doing their plans 10 years ago? What would the market would look like? The missing element is aggressive management hopefully Pat and Intel's $20 Billion in annual profit will be the answer. The downside is large if the fail yes but the upside is also huge. Imagine Intel retuned as a vertically integrated AI powerhouse that brings giant leaps in performance with every new generation. Intel is the only company in the world capable of doing this. People are underestimating Intel just as they underestimated AMD its a complex situation and takes time to play out but if anyone can pull it off its Intel.\n\n&amp;#x200B;\n\nSee Moore's law is dead for more info on the tech\n\nhttps://www.youtube.com/watch?v=g44zQII9GV4",
        "created_utc": 1635024584,
        "id": "hhsb8pr",
        "permalink": "/r/stocks/comments/qe1fnu/intel_worth_it/hhsb8pr/",
        "score": 23,
        "subreddit": "stocks",
        "created": 1635053384.0
    },
    {
        "author": "Guinga2710",
        "body": "Intel doesnt make revenue just from pcs, a big part is governments, institutions and businesses, but amd is dominating desktops and gaming pcs, their chips are just better and cheaper. And at first amd was supposed to be just gaming, but now it is growing into a threat to the whole consumer computer business. Intel had been in a position where it didnt have to do much to be the dominant leader, they didnt inovate much and kept prices high, which upset a lot of people. They are delaying 7nm to 2022 or 2023 and amd is already launching next year the 5nm chips. Now the monopoly is being challenged, and intel has tl catch up.\nEven schools which are now replacing old desktops are buying amd desktops.\nCan you tell me about someone who is under 30 years old and knows computers who would rather buy intel chips than a ryzen?",
        "created_utc": 1634432496,
        "id": "hgxgaka",
        "permalink": "/r/StockMarket/comments/q9mlg8/why_i_think_intc_intel_stock_is_undervalued_the/hgxgaka/",
        "score": 23,
        "subreddit": "StockMarket",
        "created": 1634461296.0
    },
    {
        "author": "veilwalker",
        "body": "NVDA isn't going to be allowed to buy ARM. UK won't give it up.\n\nNVDA is way overvalued at the moment. What was it like 700 billion as of last Friday. That is silly.\n\nThe nm stuff isn't really accurate for any of them anymore so not worried about a rebrand.\n\nPretty sure data centers are still dominated by INTC, right? It was only a matter of time before someone put forward a competitive product. This has already spurred renewed effort from INTC and their new products sound good.\n\nI haven't seen any product comparisons for the newest INTC chips but as I recall they were described as better/highly competitive.\n\nAt the end of the day INTC has to execute and show that they are ready willing and able to compete across the board.\n\nMobileye also has a good chance to really start generating some revenue and they have investments in a lot of interesting companies that should bear fruit over the coming year(s).",
        "created_utc": 1635708035,
        "id": "hisr7ly",
        "permalink": "/r/wallstreetbets/comments/qjv4i3/intel_value_trap_or_undervalued/hisr7ly/",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1635736835.0
    },
    {
        "author": "Killingroughtime",
        "body": "You're good Intel-ling jokes",
        "created_utc": 1634855024,
        "id": "hhjqf2u",
        "permalink": "/r/StockMarket/comments/qd0ifx/facebook_shares_sharp_decline_after_hours/hhjqf2u/",
        "score": 23,
        "subreddit": "StockMarket",
        "created": 1634883824.0
    },
    {
        "author": "thinvanilla",
        "body": "Intel could well go the way of Kodak in the coming decade; around, but not in nearly the same capacity. Intel's main business is in data centres, I think something close to 99% of data centres use Intel, and the big 3 are Google, Microsoft, and Amazon. While Apple is very unlikely to start supplying their chips to other companies, what they have done is proven to everyone just how powerful and efficient ARM chips can be and what happens when you drop a stagnant supplier.\n\nApple may not supply chips but other companies will. We now know that Microsoft and Amazon are working on custom ARM chips for their own data centres, and we also know that the world's most powerful supercomputer runs on ARM chips too. Intel has slept through all of this thinking their ~99% data centre marketshare is safe, but they will very quickly begin to lose marketshare once Microsoft and Amazon are happy with their ARM developments. This is without even mentioning AMD which is also making strides.\n\nI just see it as Intel will begin to shrink and pivot their business a bit, I don't think they'll disappear but I wouldn't expect much growth either. They could make and supply ARM chips themselves, but they don't make nearly as much money as Apple, Google, Microsoft, Amazon, so they won't be able to afford the same engineers who can make such developments. One of the main reasons Apple's chips have been so successful is because they can afford to throw *a lot* of money at it.",
        "created_utc": 1635004751,
        "id": "hhr2ztw",
        "permalink": "/r/stocks/comments/qe1fnu/intel_worth_it/hhr2ztw/",
        "score": 22,
        "subreddit": "stocks",
        "created": 1635033551.0
    },
    {
        "author": "FeCard",
        "body": "Hahaha Intel gets really good competitive news and all the desperado AMD fans come out of the woodworks to check post history.",
        "created_utc": 1635354385,
        "id": "hi9ovjo",
        "permalink": "/r/stocks/comments/qgx0uj/intel_core_i512600k_cpu_up_to_50_faster_than/hi9ovjo/",
        "score": 22,
        "subreddit": "stocks",
        "created": 1635383185.0
    },
    {
        "author": "IceWook",
        "body": "INTC has been consistently falling since the beginning of April. Now a week after they post earnings that were disappointing to say the least, and a competitor that moved away from their chips released a company that showed marked improvement on theirs, leaks suddenly appear that show their new chip is somehow magically better than another competitors?\n\nSerious doubt.",
        "created_utc": 1635349115,
        "id": "hi9brp8",
        "permalink": "/r/stocks/comments/qgx0uj/intel_core_i512600k_cpu_up_to_50_faster_than/hi9brp8/",
        "score": 22,
        "subreddit": "stocks",
        "created": 1635377915.0
    },
    {
        "author": "scoofy",
        "body": "My tinfoil bet on INTC. \n\nWhen the US govt sheepishly admits it’s not willing to enter a real war for chips, TSCM will be effective neutered, and INTC will become the dominant manufacturer. \n\nThe outlays for this are already beginning stages.",
        "created_utc": 1635005784,
        "id": "hhr585v",
        "permalink": "/r/stocks/comments/qe1fnu/intel_worth_it/hhr585v/",
        "score": 22,
        "subreddit": "stocks",
        "created": 1635034584.0
    },
    {
        "author": "cuchiplancheo",
        "body": "&gt; They want someone to hold their bags\n\nWithout a doubt. I have INTC on my watchlist... but, this thing will trade flat and most likely dip for the foreseeable future.",
        "created_utc": 1635313936,
        "id": "hi7rcxl",
        "permalink": "/r/options/comments/qgkld7/ceo_pat_gelsinger_and_other_intel_insiders_bought/hi7rcxl/",
        "score": 22,
        "subreddit": "options",
        "created": 1635342736.0
    },
    {
        "author": "Eccentricc",
        "body": "I love my AMD and won't touch Intel. Shit ass company that fucked up years ago. I hope you enjoyed your 0.1% gain in 3 months Intel gave you. Go buy yourself a Blunt because you need it",
        "created_utc": 1635351421,
        "id": "hi9heec",
        "permalink": "/r/stocks/comments/qgx0uj/intel_core_i512600k_cpu_up_to_50_faster_than/hi9heec/",
        "score": 22,
        "subreddit": "stocks",
        "created": 1635380221.0
    },
    {
        "author": "Thereal180mph",
        "body": "6 years ago it looked like AMD might go out a business. They did spin off global foundries. Intel will one day be back in the limelight, just a matter of when",
        "created_utc": 1635300981,
        "id": "hi73yuc",
        "permalink": "/r/investing/comments/qgkj7d/ceo_pat_gelsinger_and_other_intel_insiders_bought/hi73yuc/",
        "score": 22,
        "subreddit": "investing",
        "created": 1635329781.0
    },
    {
        "author": "cookingboy",
        "body": "&gt;\tAnd the big-little design is the right one for energy efficiency, as proved by Apple 5 years ago\n\nA lot of Apple’s energy efficiency is the result of their, or rather, TSMC’s node process advantage. Intel dropped the ball on the fab side of things and it shows. \n\nThere is also a bit of factor from Apple’s chips implement the ARM ISA instead of the x86 ISA, which comes with things like fixed instruction length.",
        "created_utc": 1635357584,
        "id": "hi9x23r",
        "permalink": "/r/investing/comments/qgx3ee/intel_core_i512600k_cpu_up_to_50_faster_than/hi9x23r/",
        "score": 22,
        "subreddit": "investing",
        "created": 1635386384.0
    },
    {
        "author": "Viscoden",
        "body": "These companies all have a moat. Intuit just started acquisitions in order to start growing again, PayPal and Facebook are still growing rapidly. \n\nPM is probably more of a dividend play for them.",
        "created_utc": 1635015832,
        "id": "hhrrsa4",
        "permalink": "/r/stocks/comments/qeapvh/are_old_stocks_of_established_companies_the_best/hhrrsa4/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1635044632.0
    },
    {
        "author": "NooshBagoosh",
        "body": "INTU $600. What a fuckin' run... 15% in October for a large cap.",
        "created_utc": 1635177534,
        "id": "hhzyq2u",
        "permalink": "/r/wallstreetbets/comments/qfdc03/daily_discussion_thread_for_october_25_2021/hhzyq2u/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635206334.0
    },
    {
        "author": "karmalizing",
        "body": "Tech marketing is just generally a boring ass industry, plus then DMS focuses mostly on insurance companies at that.\n\nNot exactly imaginative / hype inspiring.\n\nBut then, who knew Mail Chimp was worth $12 Billion before they sold to Intuit either... they are also tech marketing.",
        "created_utc": 1633545287,
        "id": "hfmuzhu",
        "permalink": "/r/SPACs/comments/q2f2vl/announcements_x_daily_discussion_for_wednesday/hfmuzhu/",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1633574087.0
    },
    {
        "author": "ItIsntAnonymous",
        "body": "You know, I have no idea what it would take to bear-proof a trash can, but if it means the trash can looks differently than normal and trash is deposited differently than normal, *I* might be one of those “dumbest” tourists.  I admit I sometimes get stumped by things that function differently than I intuit.",
        "created_utc": 1633982259,
        "id": "hg9nqr8",
        "permalink": "/r/wallstreetbets/comments/q5t7ff/good_morning_fellow_bulls_wake_up/hg9nqr8/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634011059.0
    },
    {
        "author": "OilBerta",
        "body": "Intu, goog, nothing out of the ordinary. Wish i had got into lspd though.",
        "created_utc": 1633187952,
        "id": "hf3ubfe",
        "permalink": "/r/wallstreetbets/comments/pzwysq/what_are_some_of_the_best_stocks_yall_traded_or/hf3ubfe/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633216752.0
    },
    {
        "author": "PrincPaco",
        "body": "I used Intuit Proseries when I did taxes. I liked the program. On a real note though, Fck tax prep.  That's 3 months of the year to try and make enough to trade FDs on. The other 9 months you're left dealing with degenerate deadbeats that haven't filed in 6 years and are tired of getting mail.",
        "created_utc": 1633602133,
        "id": "hfpnjuk",
        "permalink": "/r/wallstreetbets/comments/q35qc8/daily_discussion_thread_for_october_07_2021/hfpnjuk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633630933.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  6th of October\n\n\n\n## Upcoming events for Wednesday, October  6th\n\n - Expected earnings:\n\n  AYI, EDUC, HIHO, IDT, LEVI, LOOP, RELL, RGP, RPM, STCN, STZ, STZ.B, TMQ, VLGEA\n\n - Ex-div:\n\n  ABM, CPB, CVA, FCPT, IMKTA, PFBC, PGR, RVSB, SSD, TIMB, VLGEA, WNC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 428K, previous: 374K)\n    - Crude Oil Imports (previous: -0.124M)\n    - Crude Oil Inventories (consensus: -0.418M, previous: 4.578M)\n    - Cushing Crude Oil Inventories (previous: 0.131M)\n    - Distillate Fuel Production (previous: 0.194M)\n    - EIA Refinery Crude Runs  (previous: 0.068M)\n    - EIA Weekly Distillates Stocks (consensus: -1.007M, previous: 0.385M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 0.6%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Bostic Speaks\n    - Gasoline Inventories (consensus: -0.279M, previous: 0.193M)\n    - Gasoline Production (previous: 0.246M)\n    - Heating Oil Stockpiles (previous: -0.366M)\n    - MBA 30-Year Mortgage Rate (previous: 3.10%)\n    - MBA Mortgage Applications (previous: -1.1%)\n    - MBA Purchase Index (previous: 280.4)\n    - Mortgage Market Index (previous: 734.9)\n    - Mortgage Refinance Index (previous: 3,359.5)\n\n## Upcoming events for Thursday, October  7th\n\n - Expected earnings:\n\n  ACCD, CAG, HELE, LW, TLRY\n\n - Ex-div:\n\n  AEO, AFB, AXP, BRC, CIO, CULP, DRI, EBF, FLIC, FSFG, GD, GIS, GNTX, GROW, HBNC, ISAA, LGI, LMNR, LNC, LOAN, MA, MMC, MRVL, NTAP, NYT, SGA, T, TBLD, TD, TOL, TTEC, UDR, UVV, WSBF\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.040%)\n    - Challenger Job Cuts (previous: 15.723K)\n    - Consumer Credit (consensus: 17.50B, previous: 17.00B)\n    - Continuing Jobless Claims (consensus: 2,780K, previous: 2,802K)\n    - FOMC Member Williams Speaks\n    - Initial Jobless Claims (consensus: 348K, previous: 362K)\n    - Jobless Claims 4-Week Avg. (previous: 340.00K)\n    - Natural Gas Storage (previous: 88B)\n\n## Upcoming events for Friday, October  8th\n\n - Expected earnings:\n\n  BYRN\n\n - Ex-div:\n\n  ACV, AFIN, AIO, ASAI, BBVA, BRW, CBH, CCD, CGO, CHI, CHW, CPZ, CSQ, ECC, EDF, EDI, EFL, EIC, EVF, FNLC, GBCI, GFED, GNL, HPF, HPI, HPS, HTD, INTU, IVR, JW.A, MBT, MKC, MKC.V, NCV, NCZ, NYC, OGE, ORCL, PCI, PCK, PCN, PCQ, PDI, PDO, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, TBLD, TR, UBFO, VGI, ZTR\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.6%, previous: 4.3%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.6%)\n    - Average Weekly Hours (consensus: 34.7, previous: 34.7)\n    - Building Permits (previous: 5.6%)\n    - CFTC Aluminium speculative net positions (previous: 4.3K)\n    - CFTC Copper speculative net positions (previous: 18.6K)\n    - CFTC Corn speculative net positions (previous: 278.5K)\n    - CFTC Crude Oil speculative net positions (previous: 373.8K)\n    - CFTC Gold speculative net positions (previous: 168.4K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -2.3K)\n    - CFTC Natural Gas speculative net positions (previous: -146.7K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 73.2K)\n    - CFTC Silver speculative net positions (previous: 16.7K)\n    - CFTC Soybeans speculative net positions (previous: 64.7K)\n    - CFTC Wheat speculative net positions (previous: -3.6K)\n    - Government Payrolls (previous: -8.0K)\n    - Manufacturing Payrolls (consensus: 25K, previous: 37K)\n    - Nonfarm Payrolls (consensus: 473K, previous: 235K)\n    - Participation Rate (previous: 61.7%)\n    - Private Nonfarm Payrolls (consensus: 450K, previous: 243K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 421)\n    - U.S. Baker Hughes Total Rig Count (previous: 521)\n    - U6 Unemployment Rate (previous: 8.8%)\n    - Unemployment Rate (consensus: 5.1%, previous: 5.2%)\n    - Wholesale Inventories (previous: 1.2%)\n    - Wholesale Trade Sales (consensus: 1.0%, previous: 2.0%)\n\n^^^^2021-10-06",
        "created_utc": 1633514445,
        "id": "hfl4gus",
        "permalink": "/r/RobinHood/comments/q2h9n5/daily_discussion_thread_october_6th_2021/hfl4gus/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1633543245.0
    },
    {
        "author": "Tabashet",
        "body": "Hi everyone,\n\nLeveraging in a margin account using line of credit.\n\nXEQT.TO - 95%\nVFV.TO - 20.27%\nTD.TO - 10%\nAAPL - 1.03%\nSHOP - 0.69%\nUPST - 0.92%\nSNOW - 0.23%\nINTU - 0.13%\nBTCC.B.TO - 0.04%\nETHX.B.TO - 0.04%\n\nMost of my money is in the top 3 you see there. There rest I distribute across Motley Fool Stock Advisor picks which are what you see below besides AAPL, BTCC, and ETHX. Any thoughts? Should I keep adding to XEQT or continue to increase exposure to particular companies?",
        "created_utc": 1634275954,
        "id": "hgpfspe",
        "permalink": "/r/CanadianInvestor/comments/pz4t97/rate_my_portfolio_megathread_for_october_2021/hgpfspe/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1634304754.0
    },
    {
        "author": "NooshBagoosh",
        "body": "Groan. INTU up 7% in the last five days. Made a few grand on shares but completely missed option plays because I was shell-shocked from the big tech beatdown. Almost up to pre-dump highs.",
        "created_utc": 1634587413,
        "id": "hh5dq4m",
        "permalink": "/r/wallstreetbets/comments/qaupdv/what_are_your_moves_tomorrow_october_19_2021/hh5dq4m/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634616213.0
    },
    {
        "author": "NooshBagoosh",
        "body": "INTU hit $590. Just a steady, 12% run over the last two weeks for a $160 billion company. Month out options back in early October would have been such a sick play...",
        "created_utc": 1634928377,
        "id": "hhnjd2z",
        "permalink": "/r/wallstreetbets/comments/qddlkc/daily_discussion_thread_for_october_22_2021/hhnjd2z/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634957177.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  7th of October\n\n\n\n## Upcoming events for Thursday, October  7th\n\n - Expected earnings:\n\n  ACCD, CAG, HELE, LW, PKE, TLRY\n\n - Ex-div:\n\n  AEO, AFB, AXP, BRC, CIO, CULP, DRI, EBF, FLIC, FSFG, GD, GIS, GNTX, GROW, HBNC, ISAA, LGI, LMNR, LNC, LOAN, MA, MMC, MRVL, NTAP, NYT, SGA, T, TD, TOL, TTEC, UDR, UVV, WSBF\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.040%)\n    - Challenger Job Cuts (previous: 15.723K)\n    - Consumer Credit (consensus: 17.50B, previous: 17.00B)\n    - Continuing Jobless Claims (consensus: 2,780K, previous: 2,802K)\n    - FOMC Member Williams Speaks\n    - Initial Jobless Claims (consensus: 348K, previous: 362K)\n    - Jobless Claims 4-Week Avg. (previous: 340.00K)\n    - Natural Gas Storage (consensus: 105B, previous: 88B)\n\n## Upcoming events for Friday, October  8th\n\n - Expected earnings:\n\n  BYRN\n\n - Ex-div:\n\n  ACV, AFIN, AIO, ASAI, BBVA, BRW, CBH, CCD, CGO, CHI, CHW, CPZ, CSQ, ECC, EDF, EDI, EFL, EIC, EVF, FNLC, GBCI, GFED, GNL, HPF, HPI, HPS, HTD, INTU, IVR, JW.A, MBT, MKC, MKC.V, NCV, NCZ, NYC, OGE, ORCL, PCI, PCK, PCN, PCQ, PDI, PDO, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, TBLD, TR, UBFO, VGI, ZTR\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.6%, previous: 4.3%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.6%)\n    - Average Weekly Hours (consensus: 34.7, previous: 34.7)\n    - Building Permits (previous: 5.6%)\n    - CFTC Aluminium speculative net positions (previous: 4.3K)\n    - CFTC Copper speculative net positions (previous: 18.6K)\n    - CFTC Corn speculative net positions (previous: 278.5K)\n    - CFTC Crude Oil speculative net positions (previous: 373.8K)\n    - CFTC Gold speculative net positions (previous: 168.4K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -2.3K)\n    - CFTC Natural Gas speculative net positions (previous: -146.7K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 73.2K)\n    - CFTC Silver speculative net positions (previous: 16.7K)\n    - CFTC Soybeans speculative net positions (previous: 64.7K)\n    - CFTC Wheat speculative net positions (previous: -3.6K)\n    - Government Payrolls (previous: -8.0K)\n    - Manufacturing Payrolls (consensus: 25K, previous: 37K)\n    - Nonfarm Payrolls (consensus: 500K, previous: 235K)\n    - Participation Rate (previous: 61.7%)\n    - Private Nonfarm Payrolls (consensus: 455K, previous: 243K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 421)\n    - U.S. Baker Hughes Total Rig Count (previous: 521)\n    - U6 Unemployment Rate (previous: 8.8%)\n    - Unemployment Rate (consensus: 5.1%, previous: 5.2%)\n    - Wholesale Inventories (previous: 1.2%)\n    - Wholesale Trade Sales (consensus: 1.0%, previous: 2.0%)\n\n## Upcoming events for Sunday, October 10th\n\n - Economic events and announcements:\n\n    - WASDE Report\n\n^^^^2021-10-07",
        "created_utc": 1633600813,
        "id": "hfpm29v",
        "permalink": "/r/RobinHood/comments/q35q41/daily_discussion_thread_october_7th_2021/hfpm29v/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1633629613.0
    },
    {
        "author": "CMQinvesting",
        "body": "Intuit",
        "created_utc": 1635219074,
        "id": "hi2mcw9",
        "permalink": "/r/stocks/comments/qfqo6y/what_are_your_highest_conviction_stock_picks_for/hi2mcw9/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635247874.0
    },
    {
        "author": "Green_Lantern_4vr",
        "body": "Calls On intuit? Ok",
        "created_utc": 1633343317,
        "id": "hfc2xur",
        "permalink": "/r/wallstreetbets/comments/q0q5fh/from_may_post_never_went_through_400112k_in_less/hfc2xur/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633372117.0
    },
    {
        "author": "NooshBagoosh",
        "body": "Still can't figure out this market; missed a nice day on software. Big openers for INTU, ADBE, and ADSK. The latter of which is still holding at +2.5%.",
        "created_utc": 1634142552,
        "id": "hgi0v6d",
        "permalink": "/r/wallstreetbets/comments/q77v1k/daily_discussion_thread_for_october_13_2021/hgi0v6d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634171352.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  5th of October\n\n\n\n## Upcoming events for Tuesday, October  5th\n\n - Stock splits:\n\n    - ISRG @ **3:1** (Payable date: 10/04/2021)\n\n - Expected earnings:\n\n  PEP, SAR\n\n - Ex-div:\n\n  BDN, CMCSA, CVBF, GPS, JPM, PKBK, ROP, TTC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.075%)\n    - API Weekly Crude Oil Stock (previous: 4.127M)\n    - Exports (previous: 212.80B)\n    - FOMC Member Quarles Speaks\n    - IBD/TIPP Economic Optimism (previous: 48.5)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 60.1)\n    - ISM Non-Manufacturing Employment (previous: 53.7)\n    - ISM Non-Manufacturing New Orders (previous: 63.2)\n    - ISM Non-Manufacturing PMI (consensus: 60.0, previous: 61.7)\n    - ISM Non-Manufacturing Prices (previous: 75.4)\n    - Imports (previous: 282.90B)\n    - Markit Composite PMI (consensus: 54.5, previous: 55.4)\n    - Redbook (previous: 16.5%)\n    - Services PMI (consensus: 54.4, previous: 55.1)\n    - Trade Balance (consensus: -70.50B, previous: -70.10B)\n\n## Upcoming events for Wednesday, October  6th\n\n - Expected earnings:\n\n  AYI, EDUC, HIHO, IDT, LEVI, LOOP, RELL, RGP, RPM, STCN, STZ, STZ.B, TMQ, VLGEA\n\n - Ex-div:\n\n  ABM, CPB, CVA, FCPT, IMKTA, PFBC, PGR, RVSB, SSD, TIMB, VLGEA, WNC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 428K, previous: 374K)\n    - Crude Oil Imports (previous: -0.124M)\n    - Crude Oil Inventories (consensus: -0.300M, previous: 4.578M)\n    - Cushing Crude Oil Inventories (previous: 0.131M)\n    - Distillate Fuel Production (previous: 0.194M)\n    - EIA Refinery Crude Runs  (previous: 0.068M)\n    - EIA Weekly Distillates Stocks (consensus: -0.750M, previous: 0.385M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 0.6%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Bostic Speaks\n    - Gasoline Inventories (consensus: 0.150M, previous: 0.193M)\n    - Gasoline Production (previous: 0.246M)\n    - Heating Oil Stockpiles (previous: -0.366M)\n    - MBA 30-Year Mortgage Rate (previous: 3.10%)\n    - MBA Mortgage Applications (previous: -1.1%)\n    - MBA Purchase Index (previous: 280.4)\n    - Mortgage Market Index (previous: 734.9)\n    - Mortgage Refinance Index (previous: 3,359.5)\n\n## Upcoming events for Thursday, October  7th\n\n - Expected earnings:\n\n  ACCD, CAG, HELE, LW, TLRY\n\n - Ex-div:\n\n  AEO, AFB, AXP, BRC, CIO, CULP, DRI, EBF, FLIC, FSFG, GD, GIS, GNTX, GROW, HBNC, ISAA, LGI, LMNR, LNC, LOAN, MA, MMC, MRVL, NTAP, NYT, SGA, T, TD, TOL, TTEC, UDR, UVV, WSBF\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.040%)\n    - Challenger Job Cuts (previous: 15.723K)\n    - Consumer Credit (consensus: 17.50B, previous: 17.00B)\n    - Continuing Jobless Claims (consensus: 2,780K, previous: 2,802K)\n    - FOMC Member Williams Speaks\n    - Initial Jobless Claims (consensus: 348K, previous: 362K)\n    - Jobless Claims 4-Week Avg. (previous: 340.00K)\n    - Natural Gas Storage (previous: 88B)\n\n## Upcoming events for Friday, October  8th\n\n - Expected earnings:\n\n  BYRN\n\n - Ex-div:\n\n  AFIN, BRW, ECC, EDF, EDI, EIC, FNLC, GBCI, GFED, GNL, INTU, IVR, JW.A, MBT, MKC, MKC.V, NYC, OGE, ORCL, TR, UBFO, VGI, ZTR\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.6%, previous: 4.3%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.6%)\n    - Average Weekly Hours (consensus: 34.7, previous: 34.7)\n    - Building Permits (previous: 5.6%)\n    - CFTC Aluminium speculative net positions (previous: 4.3K)\n    - CFTC Copper speculative net positions (previous: 18.6K)\n    - CFTC Corn speculative net positions (previous: 278.5K)\n    - CFTC Crude Oil speculative net positions (previous: 373.8K)\n    - CFTC Gold speculative net positions (previous: 168.4K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -2.3K)\n    - CFTC Natural Gas speculative net positions (previous: -146.7K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 73.2K)\n    - CFTC Silver speculative net positions (previous: 16.7K)\n    - CFTC Soybeans speculative net positions (previous: 64.7K)\n    - CFTC Wheat speculative net positions (previous: -3.6K)\n    - Government Payrolls (previous: -8.0K)\n    - Manufacturing Payrolls (consensus: 30K, previous: 37K)\n    - Nonfarm Payrolls (consensus: 488K, previous: 235K)\n    - Participation Rate (previous: 61.7%)\n    - Private Nonfarm Payrolls (consensus: 480K, previous: 243K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 421)\n    - U.S. Baker Hughes Total Rig Count (previous: 521)\n    - U6 Unemployment Rate (previous: 8.8%)\n    - Unemployment Rate (consensus: 5.1%, previous: 5.2%)\n    - Wholesale Inventories (previous: 1.2%)\n    - Wholesale Trade Sales (consensus: 1.0%, previous: 2.0%)\n\n^^^^2021-10-05",
        "created_utc": 1633428015,
        "id": "hfgmulb",
        "permalink": "/r/RobinHood/comments/q1t7gv/daily_discussion_thread_october_5th_2021/hfgmulb/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1633456815.0
    },
    {
        "author": "NooshBagoosh",
        "body": "INTU taking it even worse than the rest of big tech in these last few red days.",
        "created_utc": 1633357466,
        "id": "hfcqohy",
        "permalink": "/r/wallstreetbets/comments/q12dpj/daily_discussion_thread_for_october_04_2021/hfcqohy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633386266.0
    },
    {
        "author": "lo0oped",
        "body": "I'm surprised no one is talking about INTU 🤑🤑🤑",
        "created_utc": 1634586812,
        "id": "hh5c9nn",
        "permalink": "/r/wallstreetbets/comments/qajk42/daily_discussion_thread_for_october_18_2021/hh5c9nn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634615612.0
    },
    {
        "author": "NooshBagoosh",
        "body": "Whelp, there it is. INTU back up to ATH just a few weeks after that big tech beatdown. And here I am missing the entire run on options.",
        "created_utc": 1634909800,
        "id": "hhm9qrt",
        "permalink": "/r/wallstreetbets/comments/qddlkc/daily_discussion_thread_for_october_22_2021/hhm9qrt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634938600.0
    },
    {
        "author": "shoushaa",
        "body": "$intu \nCheck it",
        "created_utc": 1635184636,
        "id": "hi0g1sg",
        "permalink": "/r/stocks/comments/qfmep0/any_good_mega_caps_between_50bn_and_200bn/hi0g1sg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635213436.0
    },
    {
        "author": "Fit-Mycologist-6951",
        "body": "What tech company should I aim to work for as an analyst for compensation and benefits? \n\n#My contract with my current company won’t be renewed. \n\nLooking to be a business analyst/systems analyst/cloud/business inteligence/something tech that isn’t heavy with coding. I want to make a change and make a good salary in my life. Previously made 45-50k salary. Want to make 6 figures some day\n\n1. Salesforce \n\n2. SAP\n\n3. Taketwointeractive\n\n4. Zynga \n\n5. Microsoft (idk how good you have to be)\n\n6. Intuit\n\n7. Workday\n\n8. Another tech company\n\nSkills: basic python, some sql, excel, some salesforce exp, some visualization exp. please help tech and trading friends.",
        "created_utc": 1635112133,
        "id": "hhwwmjc",
        "permalink": "/r/wallstreetbets/comments/qezvzm/what_are_your_moves_tomorrow_october_25_2021/hhwwmjc/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1635140933.0
    },
    {
        "author": "svanegmond",
        "body": "I would start with reading the financial statements of these companies and seeing how they explain themselves.\n\nI am more than a bit interested to see how Intel is going to deal with ARM, who is the hyper-intelligent velociraptor charging up behind their lumbering jeep.  I don't even mean desktops.  I mean servers, which change over in terms of technology on an insane tempo compared to consumer devices.  Data centre operators are going to see the power savings with ARM and are going to drop Intel like a hot potato.   Apple's ability to ship the \\*same silicon\\* in iPad, Macbook air, and iMac format, with better performance, and no need for a fan... man, I don't know what else would put them on notice.     The same designs can be wrapped up on a Linux or Windows server already.  I can run an ARM instance at amazon today.  If this trend picks up steam, the server HALF of their business is going to get rekt. And did you notice that Windows is shipping ARM versions? I sure did.\n\nOr we could consider that Intel's leadership completely *blew it* when it comes to the various new semiconductor businesses that were invented in the last 2 decades, namely phones (ceded to Qualcomm and ARM), tablets (same), game consoles (ARM, AMD), cars (blackberry, microsoft), smart TVs (qualcomm).  They have a small IoT hobby business, but I would be real worried about Nvidia in this department, who are iterating fast with Jetson.\n\nI just looked at AMD's 5 year stock price chart compared to my previous favourite chart, Intuit, and holy cow, they have just completely kicked ass.\n\nTrue fact, Intel's 5 year performance is worse than Blackberry's.\n\ntldr; Intel = woof",
        "created_utc": 1635217934,
        "id": "hi2k7eu",
        "permalink": "/r/CanadianInvestor/comments/qfp07w/after_hours_discussion_thread_for_october_25_2021/hi2k7eu/",
        "score": 0,
        "subreddit": "CanadianInvestor",
        "created": 1635246734.0
    }
]