[
    {
        "author": "trueshot-aura",
        "body": "I don’t have a strategy for finding the next stock going to the moon. But I’ve found over the years that when I find something that I believe is objectively undervalued I buy into it with conviction and see strong returns very consistently. Been able to grow at 40%+ a year. \n\nFWIW top of my list right now is $WDC , $LMT , $FDX \n\nGL on the gains and thanks for the read OP",
        "created_utc": 1630730981,
        "id": "hbj9ore",
        "permalink": "/r/stocks/comments/phjocd/the_last_2_weeks_have_saw_a_lot_of_stocks_double/hbj9ore/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630759781.0
    },
    {
        "author": "JourneymanInvestor",
        "body": "RBLX, COIN, WDC, STX, and TTWO. Roblox, especially, has printed money for me all year long (going long and short based on technical analysis).",
        "created_utc": 1630885948,
        "id": "hbqx125",
        "permalink": "/r/smallstreetbets/comments/picvj8/what_do_you_feel_have_been_your_5_most_profitable/hbqx125/",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1630914748.0
    },
    {
        "author": "BannerlordAdmirer",
        "body": "So now, the big inflation component is a supply shortage - the other component, velocity of money, which is what spills inflation into every aspect of the economy, has yet to take off. When this happens we see what we see now - industry-specific inflation while others that don't make sense to have inflation aren't showing it. \n\nMost consumables are domestic and insulated from international freight shipping cost. As long as the local supply is not constrained, there's not much threat of inflation at first. Why would you expect to see the price of fruit go up when they ship in from the next state over and the crop yield is good? \n\nAnd four different industries that all face supply chain issues will take different amounts of time before the costs start getting passed onto the consumer. This is common with companies like Western Digital or Toshiba that buy semiconductor chips (NAND, DRAM chips) because they know to stockpile inventory ahead of time. They can deplete inventory and shelter clients from cost increases for a while, while they're waiting for backlogged orders to be met. \n\nWhereas the cost of building a new home was driven up by lumber shortage. So those home construction companies didn't anticipate a lumber shortage and we saw more immediate price impact.",
        "created_utc": 1630783518,
        "id": "hblp7vc",
        "permalink": "/r/stocks/comments/phx8an/why_dont_we_have_higher_consumer_prices/hblp7vc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630812318.0
    },
    {
        "author": "skilliard7",
        "body": "Western Digital. Enterprise data needs are constantly growing as the internet contains more and more media of increasing quality. As drives die and need replacement, there is a constant need.\n\nWhile the industry is highly cyclical, there is a lot of potential long term, and the barrier to entry in the field is very high.",
        "created_utc": 1631199911,
        "id": "hc6t503",
        "permalink": "/r/stocks/comments/pkvonq/what_is_your_biggest_holding_for_the_long_term/hc6t503/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631228711.0
    },
    {
        "author": "PeepeepoopooboyXxX",
        "body": "I haven’t had one break on me yet unless if I dropped it. If they consistently break I wouldn’t be using them and pay a little extra for western digital",
        "created_utc": 1630805876,
        "id": "hbmz8bq",
        "permalink": "/r/stocks/comments/pi21ek/why_i_think_you_should_short_seagate_technology/hbmz8bq/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630834676.0
    },
    {
        "author": "FalseSavings",
        "body": "If it is on sale, buy!  Just bought more WDC since it is on sale.",
        "created_utc": 1631131420,
        "id": "hc3lvq9",
        "permalink": "/r/stocks/comments/pkeld8/the_september_effect/hc3lvq9/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631160220.0
    }
]