[
    {
        "author": "QuoProQuid",
        "body": "20% AAPL\n\n20% ENPH (actually sold this near the top but buying back in soon)\n\n10% XOM\n\n5% NTDOY\n\n5% INTC\n\n5% PLTR\n\n5% CRSR\n\n10% mixed in DKNG, DIS, CNBS, and a small bag in CD Project Red.\n\n20% Cash (no idea where to put it right now). Leaning towards a fintech maybe? Or increasing DIS position.",
        "created_utc": 1638362230,
        "id": "hmsf2xr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638391030.0
    },
    {
        "author": "MadCritic",
        "body": "Opened up positions in ABNB, PINS, ENPH, and SQ today. Watch me get fucked",
        "created_utc": 1638538788,
        "id": "hn2dd64",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638567588.0
    },
    {
        "author": "JollySpaceCowboy",
        "body": "COST, DOCN, CRWD, CRM, U, HD, PANW, ENPH, AWK, CDW, UPST",
        "created_utc": 1638374133,
        "id": "hmt3v0p",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638402933.0
    },
    {
        "author": "WeekendInteresting13",
        "body": "Who else thinks it takes a shit at open?",
        "created_utc": 1638362615,
        "id": "hmsfpg6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638391415.0
    },
    {
        "author": "krzen",
        "body": "It wasn’t involved in the process?",
        "created_utc": 1638358421,
        "id": "hms9k08",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638387221.0
    },
    {
        "author": "geltance",
        "body": "so it will go either up or down?",
        "created_utc": 1638357024,
        "id": "hms7qng",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638385824.0
    },
    {
        "author": "hshamza",
        "body": "I lost my worn out leather wallet at a ARK conference, so I walked up to Cathie and asked her to please leave the room.\n\nShe said, \"that makes sense, less people should make it easier to find\".\n\nI replied, \"it's more because every time I catch a glimpse of your skin I think I found it\".",
        "created_utc": 1638347157,
        "id": "hmrw4sx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375957.0
    },
    {
        "author": "TheTechnicalTrader",
        "body": "It could also be done by going to the casino and putting everything on black. You’re forgetting the part where he would have to risk all of his money to make these kind of returns, most likely ending up losing everything.",
        "created_utc": 1638348653,
        "id": "hmrxx6o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638377453.0
    },
    {
        "author": "Interfecto",
        "body": "Nope, I was listening to a podcast and the host mentioned the doc, so I watched it and now I’m sad 🏎☹️",
        "created_utc": 1638348666,
        "id": "hmrxxt3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377466.0
    },
    {
        "author": "NatureTripsMe",
        "body": "I don’t know what you’re trying to say. It was more a covid thing since demand shrank 3%. Of course production had to shrink if you want to make money as a producer. And it did by 5%.  I look at data from EIA to determine production and then subtract consumption. This is really some standard stuff here. Not sure why you’re being weird about it. I found a Forbes piece from a chemical engineer whom has worked in the oil industry who describes a similar approach but is way better at describing the nuances:\nhttps://www.google.com/amp/s/www.forbes.com/sites/rrapier/2021/11/14/is-the-us-energy-independent/amp/",
        "created_utc": 1638346851,
        "id": "hmrvr62",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638375651.0
    },
    {
        "author": "ChiseledTwinkie",
        "body": "$PRTY is failing me. I bought the dip, it dipped more. Bought the dip. Dipped more. Bought some more dip today, let's hope it recovers. Omicrons a nothingburger",
        "created_utc": 1638348372,
        "id": "hmrxkvx",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1638377172.0
    },
    {
        "author": "No-Version-2123",
        "body": "Morning swaps it was a painful day to say the least",
        "created_utc": 1638348275,
        "id": "hmrxgsq",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1638377075.0
    },
    {
        "author": "McRich1",
        "body": "Last year, many WSB members were holding PLTR Dec calls.  All of them lost their money.  This year on Dec 2021. It would be #Wish.",
        "created_utc": 1638349140,
        "id": "hmryhu2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377940.0
    },
    {
        "author": "Frank_Boobtitsky",
        "body": "It shrinks?",
        "created_utc": 1638349199,
        "id": "hmrykb6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377999.0
    },
    {
        "author": "No-Negotiation-3128",
        "body": "Yes why not ;)\nLook:\n\n Evofem Biosciences, Inc. EVFM announced that it has entered into a definitive agreement with Keystone Capital Partners (\"Keystone Capital\") providing for the issuance and sale of an aggregate of 10,000 shares of Series B Convertible Stock in a registered direct offering for a purchase price of $1,000.00 per share.\n\nhttps://www.google.com/amp/s/finance.yahoo.com/amphtml/news/evofem-biosciences-announces-10-million-103100774.html",
        "created_utc": 1638349622,
        "id": "hmrz23z",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1638378422.0
    },
    {
        "author": "Upper-Equivalent3651",
        "body": "thanks.\n\nHope they are not there as crazy as here when it comes to debts",
        "created_utc": 1638345675,
        "id": "hmru9oo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374475.0
    },
    {
        "author": "ThatsHonestlyWildBro",
        "body": "TQQQ gonna absolutely moon in the morning ....back to where it was 1 week ago",
        "created_utc": 1638346102,
        "id": "hmrutcp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374902.0
    },
    {
        "author": "OogdayAyday",
        "body": "I've always wanted to try this, so today is the day I do it.\n\n\"FIRST\"",
        "created_utc": 1638346105,
        "id": "hmruti8",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638374905.0
    },
    {
        "author": "rolfie13",
        "body": "If you need to ask us, you're not ready. That being said, if you do decide to make this trade you're absolutely going to need to do two things beforehand. \n\n-Set a stop loss. Options are very volatile. What happens if you wake up one day and this call is down 30%? You won't know how you'll feel until it happens, and you won't be in the right frame of mind to make decisions after it has. This could very easily turn into a trade where you lose 100%. Pick a point, say 50% or whatever you're comfortable with so you can live to die another day.\n\n-Determine where you're going to take profits. This can go the other way too. You wake up to check on your option and it's up 100% just a couple weeks after opening the position. You're once again in a position where you aren't able to make unbiased decisions, and it can just as well go to zero still. These ones are the most demoralizing.\n\nWrite both your stop loss and take-profit point down on a physical piece of paper. It's more effective when it's staring you in the face. Good luck.",
        "created_utc": 1638345880,
        "id": "hmruj5x",
        "score": 1,
        "subreddit": "options",
        "created": 1638374680.0
    },
    {
        "author": "sgalligan17",
        "body": "It just has to do slightly worse than last month 🤷‍♂️",
        "created_utc": 1638346437,
        "id": "hmrv8iq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375237.0
    },
    {
        "author": "bitt3n",
        "body": "what's the advantage of buying it back before the end of the year?",
        "created_utc": 1638348558,
        "id": "hmrxt0j",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1638377358.0
    },
    {
        "author": "Electrical_Raisin_93",
        "body": "I was trading spy daily as well, it's hard and full of traps, nothing to rely on it, change your strategy",
        "created_utc": 1638348559,
        "id": "hmrxt17",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377359.0
    },
    {
        "author": "Rothiragay",
        "body": "BABA is surely going to be targeted by tax loss harvesting. Almost everyone who bought this year is holding it at a loss.",
        "created_utc": 1638349527,
        "id": "hmryy91",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638378327.0
    },
    {
        "author": "badasschap",
        "body": "It means GOLDMAN SACHS - MARKET HAS NOW PRICED IN A MAMMOTH C.7 MB/D NEGATIVE DEMAND HIT OVER THE NEXT THREE MONTHS, WITH NO OFFSETTING OPEC+ RESPONSE",
        "created_utc": 1638346283,
        "id": "hmrv1l7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375083.0
    },
    {
        "author": "Hot-Context8284",
        "body": "Just buy low, sell high. Don’t make it complicated",
        "created_utc": 1638346799,
        "id": "hmrvorf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638375599.0
    },
    {
        "author": "PeekingPotato",
        "body": "that sucks mate, but I´m sure it will go up again",
        "created_utc": 1638347746,
        "id": "hmrwtts",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638376546.0
    },
    {
        "author": "Upper-Equivalent3651",
        "body": "Well, the QE fucked a lot of things up, wouldnt you say?\n\nJust taking a look at treasuries and you cry. There was a time when you got interests for the risk you are taking the loaner goes bust. Now it seems all rules are out of the window.\n\nOne look at treasuries of Greece and my eyes go blank.\n\nNot even talking about sanctions. Fucked a lot of things up too. Or when people just do their own sanction thing (yes, clearstream, euroclear and whatever you call yourselves, I am talking to YOU!)\n\nAh well. You win one, you lose one.",
        "created_utc": 1638347943,
        "id": "hmrx2bm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376743.0
    },
    {
        "author": "Ozzy4253",
        "body": "Quantum computing stonk. Decades-long play.\n\nHigh risk high reward. But I'd it pulls off what it intends, it will impact virtually every city. Our science fiction stories of the future would be impossible without a QC at million qubits.",
        "created_utc": 1638345601,
        "id": "hmru65t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374401.0
    },
    {
        "author": "FoodCooker62",
        "body": "Do not listen to them. Nvidia at the current valuation is one of the biggest bubbles in the market. It should be $150 max and even then it's overvalued.",
        "created_utc": 1638345622,
        "id": "hmru77h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638374422.0
    },
    {
        "author": "MrMeeseeks987",
        "body": "Disney dropping to $100? It was around $100 when covid happened. I can’t see it going that low",
        "created_utc": 1638347840,
        "id": "hmrwxy0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638376640.0
    },
    {
        "author": "DenuvoSuks",
        "body": "He's timing was definitely not the best. We knew a long time this was coming, but announcing it when the covid was starting to make people nervous makes no sense. It could make it crash so hard he had to postpone it.",
        "created_utc": 1638348175,
        "id": "hmrxcf5",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638376975.0
    },
    {
        "author": "yaboiRich",
        "body": "as if sensing my presence it let out a big bellow. I said eeeeasy there big fella!",
        "created_utc": 1638348183,
        "id": "hmrxcsr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376983.0
    },
    {
        "author": "xcheezeplz",
        "body": "That's what oil does, it's not algos, the price is literally influenced by a cartel deciding what it should be. Now mix in market uncertainties and what else would you expect? \n\nUsually it only takes 2 times getting fucked trading oil before people swear it off.",
        "created_utc": 1638348207,
        "id": "hmrxdt7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377007.0
    },
    {
        "author": "DontWantUrSoch",
        "body": "Haha I love that..\n\nI understand this product seems exclusive/vanity for the very top 1% or perhaps it comes off as a reality to people in a distant future like 2050..however, just to explain, if they can take me from lower Brooklyn to any NYC airport in under an hour for 200usd or less I think that would make it worth it for so many people around the world, not just your average decently well of New Yorker. An Uber/cab would be around that price and it would slower… the train could be an option for some but it can be crowded, unreliable, and 100% disgusting.\n\nI say all these EvToad companies are overpriced, and many will not exist in the future but I do want the tech to enter our cityscape and soon.",
        "created_utc": 1638348219,
        "id": "hmrxebq",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638377019.0
    },
    {
        "author": "Phantom_Journey",
        "body": "Yeah, I sold a ton of VIX calls Wednesday at 20. I bough puts at 24 and 28. Didn’t cashed out when 5K up. I closed it flat. Now I’m back in for a month this time, waiting for some change. It’s.. fucking annoying.",
        "created_utc": 1638348966,
        "id": "hmryanq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377766.0
    },
    {
        "author": "InsertCatchyUserHere",
        "body": "I appreciate your thoughts in this section in particular:\n\n&amp;#x200B;\n\n&gt;What if my focus is entirely on rolling the short leg for credit? A completely different and legit way to think of a PMCC is that the long is something I expect to recoup for 0 net gain, it's just there to anchor the short legs...\n\n&amp;#x200B;\n\nI've recently been diving into PMCCs and have taken this outlook. I'm not particularly buying a LEAPS expecting it to be profitable when expiry comes around, I'm buying it for the privilege of selling CCs against it and extracting my profit from it one contract at a time. Any value still remaining near/at expiry is just an added bonus.",
        "created_utc": 1638348979,
        "id": "hmryb6h",
        "score": 1,
        "subreddit": "options",
        "created": 1638377779.0
    },
    {
        "author": "Fun-Marionberry-2540",
        "body": "Haha, alright. Fair enough.\n\nI guess I said what I said because I wanted to convey that I'm offsetting the interest payment with a short call. And if somehow that was novel or not, but I understand that you're saying the interest payment is for some other asset not the option, but in my mind it works differently because of the action path I've taken.\n\nSo Ok, \"Leveraged PMCC with Interested on Loan for other securities covered Strategy!\"",
        "created_utc": 1638345872,
        "id": "hmruisg",
        "score": 1,
        "subreddit": "options",
        "created": 1638374672.0
    },
    {
        "author": "AlwaysBlamesCanada",
        "body": "If it flies, floats, or fucks rent it, don’t buy it.",
        "created_utc": 1638346353,
        "id": "hmrv4og",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375153.0
    },
    {
        "author": "Murky-Plankton7469",
        "body": "As a person wanting to buy Tesla stock but knowing its grossly overvalued I thought the recent Musk debacle would be an opportunity for a real correction... How stupid was I?! \n \nEven at its lowest point it still stayed above 1k and I was hoping for something around 800-900 max.",
        "created_utc": 1638358348,
        "id": "hms9ghe",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638387148.0
    },
    {
        "author": "Redditsome22",
        "body": "[Pie graph](https://ibb.co/wwc9QhN?fbclid=IwAR1z1gj0gQ7T8nUUHXUVERiWjmndFdjXWnYv6Y-Y_BAsgDVGgiYFoKHRegU)\n\n&amp;#x200B;\n\nI have done a lot of repositioning into positions currently on what I considered a discount all of those flew high, too fast and burnt to the ground and beyond. went deep into BABA - currently 178avg and PYPL 211 avg - currently sadly sitting at an unrealized xx% loss. Also loaded on what was a speculative position last year with higher conviction now - bought quite a few CRSP at what I believe to be the bottom at the 78 range - currently avg at 102+-.{Not even mentioning my stupid PLTR,BB position - gambles going wrong atm, believing in the hype and the reason I bought hasnt changed still hence why i havent sold}\r  \n\r  \nAlthough I have sizeable losses here these positions have elevated my positions amazingly.\r  \n\r  \nHolding a sizeable position with xxx% returns on AMD and NIO and very bullish on SE - recently added to my position at 280\r  \n\r  \nbought into the AMC hype with a 14 avg and sold of 80% at around the 60 mark\r  \n\r  \n\r  \n\r  \nSquare shouldve been scalped and rebought 205-280 range and back is ridiculous but oh well\r  \n\r  \nsold JD into strenght to buy into my weaker positions - had a big position before. still bullish but seeing more upside elsewhere atm.\r  \n\r  \nI dont have any us mega caps- I know winners stay winners usually but I am looking for hopefully bigger returns albeith I run risk of big losses, clearly, as well - such as sizeble position in a clinical trial biotech AGTC - currently at a big loss aswell but that was expected. Lets see what happens here. stock at all time lows.\r  \n\r  \n\r  \n\r  \nfor example although im sitting at a 10avg with my SKLZ position the downside is limited here imo, and potential huge hence why I have been adding to my position lately a lot bellow 10\r  \n\r  \n\r  \n\r  \nI do recommend people look into CPNG and let me know their thoughts. I am torn between adding to this position or keeping it small.",
        "created_utc": 1638358232,
        "id": "hms9b17",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638387032.0
    },
    {
        "author": "Agitated-Savings-229",
        "body": "I guess the money i earned came hard... last year's drop taught me just to be patient. I was down almost a millions dollars but sat and waited and it all came back. Something options don't typically afford.",
        "created_utc": 1638359061,
        "id": "hmsafju",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387861.0
    },
    {
        "author": "Bossmoss599",
        "body": "Even in the under developed world there’s still vaccine misinformation. The polio vaccine in Northern Africa had to overcome misinformation like it was haram because it would make you sterile and was made with pork products.",
        "created_utc": 1638359085,
        "id": "hmsagpl",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638387885.0
    },
    {
        "author": "GoodellsMandMs",
        "body": "My sportsbook has the ability to set deposit limits and you can also lock yourself or of it forever\n\nIt's this not something you think they should be a doing? \n\nIf my gambling app has measures put in place to protect me why shouldn't my investment app?",
        "created_utc": 1638360058,
        "id": "hmsbtmf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638388858.0
    },
    {
        "author": "trail34",
        "body": "Ugh. I see this a lot, but it makes no sense. What’s better…\n\n1) profiting $1000 and paying $350 in taxes, netting you $650?\n\n2) profiting $1000 and purposely losing $1000, paying $0 in taxes, and netting you $0?\n\n3) profiting $1000 and purposely losing $2000, getting a $350 tax refund but you’re now at -$750 net?\n\n\nPeople are always so afraid of paying taxes. But I’d rather pay taxes and still have a profit than negate all my winnings by purposely selling stuff for less than I paid.",
        "created_utc": 1638360073,
        "id": "hmsbuca",
        "score": 1,
        "subreddit": "investing",
        "created": 1638388873.0
    },
    {
        "author": "Medz_For_Headz",
        "body": "So is it safe to buy the dip? or is the dip going to keep dipping??",
        "created_utc": 1638361098,
        "id": "hmsdbx1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389898.0
    },
    {
        "author": "Slow-Throat-1458",
        "body": "UTMA is a regular taxable account. It just has the minor listed as the beneficiary of the funds. No tax benefits. The trade off is that they can be used for anything, not just education.",
        "created_utc": 1638361546,
        "id": "hmse034",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638390346.0
    },
    {
        "author": "Wealth_Reasonable",
        "body": "it coming alive",
        "created_utc": 1638361602,
        "id": "hmse38d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390402.0
    },
    {
        "author": "_sillycibin_",
        "body": "just behind the number of money enthusiasts in the world.  which is what really most people who are in crypto are in it for.  they could give a shit about the narrative, feel good, change the world bs.  it's a speculative asset and they'll profit and gtfo when there are whiffs of trouble.  long term I think there are enough stupid people globally with growing interest to keep pushing btc up.",
        "created_utc": 1638362768,
        "id": "hmsfyma",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638391568.0
    },
    {
        "author": "ymi2f",
        "body": "Yeah but only chicks will buy it.   It's the new Jetta",
        "created_utc": 1638362789,
        "id": "hmsfzxs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391589.0
    },
    {
        "author": "Mister_Titty",
        "body": "The answer is experience and education. It IS possible to make good returns without getting your ass kicked, consistently, but only if you know what you're doing. And you won't find that education the easy way. It takes time; you will have to make mistakes and learn from them; you will have to educate yourself. Think of this as a wake-up call - you can either take investing seriously and devote a significant chunk of your time towards learning for the next ... however long it takes, or you can settle for the same returns and same risk as everyone else.",
        "created_utc": 1638362872,
        "id": "hmsg50f",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638391672.0
    },
    {
        "author": "eternalrefuge86",
        "body": "The SPY has been doing literally the same thing since Friday. So easy easy to play. Up? Buy puts. Down? Buy calls. Works til it doesn’t",
        "created_utc": 1638363788,
        "id": "hmshq8c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392588.0
    },
    {
        "author": "zth25",
        "body": "The profit motivation is not a genuine argument not to get vaccinated, is what I'm saying. Governments would buy the vaccine if it costs 10 or 20 or 100 bucks per shot because there is no alternative. Yet the cost for a shot is a reasonable 20 bucks. \n\nWe live in a free market society. Do we have to take the \"muh freedom\" crowd seriously when they use \"profit making\" as an excuse? They happily spend money on ivermectin, vitamin pills and moon crystals. \n\nOr blame \"big pharma\" when many gigantic pharma companies tried and failed to create a vaccine, and the most successful vaccines are made by start-up companies with cutting edge technology that use their profits to fund research into cancer, malaria and flu vaccines? Those are the literal heroes, not the villains.",
        "created_utc": 1638359211,
        "id": "hmsan0t",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638388011.0
    },
    {
        "author": "AutoModerator",
        "body": "This submission has been automatically removed because it may be a frequently asked question.  Please check our [wiki FAQ section](https://www.reddit.com/r/options/wiki/index) or re-post your question to the weekly [Options Questions Safe Haven](https://www.reddit.com/r/options/wiki/faq/subreddit_resources) thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/options) if you have any questions or concerns.*",
        "created_utc": 1638363037,
        "id": "hmsgf74",
        "score": 1,
        "subreddit": "options",
        "created": 1638391837.0
    },
    {
        "author": "WontQuitNow",
        "body": "In a world of uncertainty and volatility it makes a lil sense. Yes? No? ![img](emote|t5_2th52|4263)",
        "created_utc": 1638358222,
        "id": "hms9akb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387022.0
    },
    {
        "author": "Smithmonster",
        "body": "Missed that at first, thought you were joking at a dollar tent four loss. Don’t worry it will all bounce back tomorrow, or maybe next week. I sold all my shit waiting for the real dip to go long term, this market is Fukd.",
        "created_utc": 1638359518,
        "id": "hmsb2bu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388318.0
    },
    {
        "author": "aborack6",
        "body": "I only need it to open this high so I can dump my calls on another degen",
        "created_utc": 1638359546,
        "id": "hmsb3qi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388346.0
    },
    {
        "author": "msupz",
        "body": "Dare I say it? Ber r ___?",
        "created_utc": 1638361320,
        "id": "hmsdnuh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390120.0
    },
    {
        "author": "StarmanRick",
        "body": "Yea I looked into that one I think the warrants are 1/3. Also the presentation deck is out if you haven't seen it. \n\nhttps://www.sec.gov/Archives/edgar/data/0001838697/000121390021062704/ea151435ex99-2\\_broadscale.htm",
        "created_utc": 1638361841,
        "id": "hmsegpz",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638390641.0
    },
    {
        "author": "Inquisitor1",
        "body": "I mean it did come back to 14$, then it went to 24 from there. Then it dipped pre-earnings, then it went to 24.",
        "created_utc": 1638361856,
        "id": "hmsehlo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638390656.0
    },
    {
        "author": "barelyrolling42069v2",
        "body": "I know some of you retards have had to deal with this before. Kitty ran away on Saturday and I really can't think about anything else. I took all the steps to increase chances of his return and sitting on my hands waiting here is brutal. How to stop thinking about it? He is an expert hunter so I think he's still kicking as long as he found a warm spot to hunker down during the cold nights",
        "created_utc": 1638362999,
        "id": "hmsgctj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391799.0
    },
    {
        "author": "muchcoinmuchfun",
        "body": "I think it does at some point today after a rally but I’m holding puts and biassed.  I have one set of calls",
        "created_utc": 1638363447,
        "id": "hmsh4vp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392247.0
    },
    {
        "author": "WhoLickedMyDumpling",
        "body": "well apparently Goldman Sachs are the ones giving fidelity the information on shares available to short... so the question is, was it on purpose and to what end?",
        "created_utc": 1638358617,
        "id": "hms9tr6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387417.0
    },
    {
        "author": "taimusrs",
        "body": "Don't wanna jinx it but, today seems like a good day",
        "created_utc": 1638359403,
        "id": "hmsawl3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638388203.0
    },
    {
        "author": "tomis8",
        "body": "How to fix my banbet?  I placed a banbet, and visualmod said it wasn't accepted because I placed text after the time token.  Fixed the problem, but submitted a banbet with an incorrect price.  I edit the banbet immediately, but visualmod accepted the incorrect price.",
        "created_utc": 1638360105,
        "id": "hmsbvy4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388905.0
    },
    {
        "author": "Clay_2000lbs",
        "body": "Sounds like it was a typo…",
        "created_utc": 1638360149,
        "id": "hmsby6q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388949.0
    },
    {
        "author": "PrincPaco",
        "body": "The best way to combat COVID is to stop handling dirty money. Credit &amp; Debit cards are able to be sanitized after each use and added benefit, it helps my calls print and will send my kids to college. \n\n*Not medical or financial advice but forreal, stop selling payment processing stocks. Please and thank you",
        "created_utc": 1638361241,
        "id": "hmsdjk8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390041.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot. This Meme does not look like it has generated enough approval to stay on /r/wallstreetbets.                                        We algorithmically cull certain submission flairs whose response is not above a certain threshold to try and keep the page clean.",
        "created_utc": 1638361709,
        "id": "hmse98o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390509.0
    },
    {
        "author": "KorbenDallassssS",
        "body": "....and yet somehow you think after jpow's public retraction of the transitory narrative means that he'll somehow be ultra-bullish the very next day....\n\nThat transitory bullshit was the only reason anyone felt good about the charade continuing.  Jpow is too smart to drop the entire nuke in one meeting, will be slow dripping it over the next ~year, frog in boiling water style.",
        "created_utc": 1638362543,
        "id": "hmsfl6c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391343.0
    },
    {
        "author": "SalmonTheSalesman",
        "body": "Lmao they killed all the apes. Why was everyone bullish on it anyway?",
        "created_utc": 1638359803,
        "id": "hmsbgkm",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1638388603.0
    },
    {
        "author": "SenorDiablo",
        "body": "Good shit man! Bought some when you called it out but it took off before I could load the boat. Hope we see a modest gain today. Thanks again!",
        "created_utc": 1638360944,
        "id": "hmsd3kj",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638389744.0
    },
    {
        "author": "Aerotyne69",
        "body": "Happy December. If you been losing money, it can turn around. Don’t give up!",
        "created_utc": 1638361472,
        "id": "hmsdvzg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390272.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because was too short. Please make it a comment if it's not worth expounding on.",
        "created_utc": 1638361479,
        "id": "hmsdweu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390279.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. You submitted a Gain/Loss/YOLO that didn't look like it included **large** positions. Please read the rules. This check will fire if you included unnecessary pictures that don't show positions. Repost with the useless pictures omitted if you did that.",
        "created_utc": 1638362276,
        "id": "hmsf5ij",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391076.0
    },
    {
        "author": "derprondo",
        "body": "That won’t do shit, need to convert it to crack first.",
        "created_utc": 1638362310,
        "id": "hmsf7hl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391110.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. You submitted an image I've already seen recently.                        If you're submitting a position screenshot use Gain/Loss/YOLO flair or it'll be duplicate checked.\n                        If you submitted something and then immediatley deleted it... don't do that next time.\n\nhttps://i.redd.it/2ripvfukex281.jpg",
        "created_utc": 1638362412,
        "id": "hmsfdgp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391212.0
    },
    {
        "author": "offensiveniglet",
        "body": "You should avoid swimming, you're too dense for it. I'm impressed you managed to setup a brokerage account. YTD is January to today, otherwise known as a time period encompassing the current year. It can also refer to fiscal year start to current day but it is usually referring to calendar year.",
        "created_utc": 1638360890,
        "id": "hmsd0oi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638389690.0
    },
    {
        "author": "contrejo",
        "body": "But I don't like setting the limit because I fear that I will set it too low and at this point I'm not sure what amount of comfortable with. I have also set it too high",
        "created_utc": 1638360912,
        "id": "hmsd1uv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389712.0
    },
    {
        "author": "Smurf_Crime_Scene",
        "body": "Because there are so many mutations the vaccine is expected to be as effective OR LESS with \"less\" being a real possibility.\n\nYou are correct that it doesn't mean that the virus is in itself more lethal. It could be more lethal. Or less. We just don't know yet.",
        "created_utc": 1638361996,
        "id": "hmseph6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390796.0
    },
    {
        "author": "Inquisitor1",
        "body": "If you don't think a stock is going up why are you even holding it? You might be wrong when you think it's going up, but you don't know the future yet. If you have shit investments you don't believe in, you should have sold yesterday regardless if it's tax season or not.",
        "created_utc": 1638362035,
        "id": "hmserok",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638390835.0
    },
    {
        "author": "nalden",
        "body": "Title says it all! Luh mau",
        "created_utc": 1638362628,
        "id": "hmsfq5s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391428.0
    },
    {
        "author": "GlitteringEar5190",
        "body": "Yes buy calls with Jan/Feb expiry. Before their next earning. It will pay off.",
        "created_utc": 1638362633,
        "id": "hmsfqgl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391433.0
    },
    {
        "author": "JackWorthing",
        "body": "Same except 12/1 … it IS tempting to hold for a bit",
        "created_utc": 1638363403,
        "id": "hmsh224",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392203.0
    },
    {
        "author": "AmeriMan2",
        "body": "Yes. My roommate has 2 cats. I've let one escape before but it came back after a night of the litter box outside.\n\nIt's their *toilet*",
        "created_utc": 1638363416,
        "id": "hmsh2xj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392216.0
    },
    {
        "author": "Responsible-Fuel7725",
        "body": "Worst case scenario you are down .73%. That’s nothing. Wait until you see a 50% drop and it takes out hundreds of thousands of dollars from your account. Keep it in and wait. DCA your money. This is the way.",
        "created_utc": 1638358761,
        "id": "hmsa0sw",
        "score": 1,
        "subreddit": "investing",
        "created": 1638387561.0
    },
    {
        "author": "Weak-Pudding-322",
        "body": "6 &amp; 7 felt like a stretch. Not saying you’ve never seen it but to say it’s a regular thing? I don’t even know what you’re talking about",
        "created_utc": 1638359957,
        "id": "hmsbocs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388757.0
    },
    {
        "author": "BenRobNU",
        "body": "That sweater is fucking terrible. Let the GF take it as a parting gift.",
        "created_utc": 1638359985,
        "id": "hmsbprz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388785.0
    },
    {
        "author": "0005AD99",
        "body": "everyone so bullish is making me nervous. My NDX calls are up 100% do I sell before bell or let it ride? (before any ape calls me retard, yes we can trade CFDs in the pre market)",
        "created_utc": 1638360299,
        "id": "hmsc5tl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389099.0
    },
    {
        "author": "vladanHS",
        "body": "Where you got $300 number, at me it says $100?",
        "created_utc": 1638360301,
        "id": "hmsc5x0",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638389101.0
    },
    {
        "author": "contrejo",
        "body": "That guy sounds shady. The fact they don't want to give the formula for what's supposed to be a terrible pandemic further solidifies My belief that the pharmaceutical industry wants us to maintain our sickness and not cure it.",
        "created_utc": 1638360337,
        "id": "hmsc7qp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389137.0
    },
    {
        "author": "Diamondhands4dagainz",
        "body": "I can’t bet on it because I don’t know when the rates will rise. JPOW could come in today and say “Fuck it we’re gunna raise rates next week”. Cunt is a loose cannon now",
        "created_utc": 1638361190,
        "id": "hmsdgqw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389990.0
    },
    {
        "author": "AdmirableActuator",
        "body": "GOEV. Got it, sold for. 20% profit and it continued up.",
        "created_utc": 1638361663,
        "id": "hmse6mu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638390463.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because was too short. Please make it a comment if it's not worth expounding on.",
        "created_utc": 1638362492,
        "id": "hmsfi6u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391292.0
    },
    {
        "author": "bitstream_baller",
        "body": "IT guy here. Cisco is running 4-6 months out for a LOT of switches and gear. It hurts.",
        "created_utc": 1638362722,
        "id": "hmsfvx5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391522.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because was too short. Please make it a comment if it's not worth expounding on.",
        "created_utc": 1638363211,
        "id": "hmsgq2a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392011.0
    },
    {
        "author": "SlothInvesting1996",
        "body": "It will be down again",
        "created_utc": 1638363230,
        "id": "hmsgr8c",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638392030.0
    },
    {
        "author": "justsomeitguyhere",
        "body": "yes, I would buy all of the stocks, doesn't matter if it goes down any more.",
        "created_utc": 1638363237,
        "id": "hmsgrpi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392037.0
    },
    {
        "author": "big3n05",
        "body": "No one has made an electric airplane that is a viable passenger transport, much less the much less efficient VTOL (e.g., helicopter) type. Will it work eventually? I'm sure it will. But, we'll need the battery breakthroughs we are all hoping for first. More capacity, lighter weight, etc. It'll never work until then. Even when that is solved you are looking at probably 15 years or so for type certification at a minimum. The Honda Jet took about that long and that is a company with massive resources who is making small improvements to a form factor that is extremely well known.",
        "created_utc": 1638359010,
        "id": "hmsacyu",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638387810.0
    },
    {
        "author": "AutoModerator",
        "body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
        "created_utc": 1638359019,
        "id": "hmsadex",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387819.0
    },
    {
        "author": "TheTallestDwarf",
        "body": "Short answer: no. If there was such a method everybody would be doing it. \n\nThe risk to reward ratio is always increasing, and reducing risk always reduces potential rewards.",
        "created_utc": 1638359647,
        "id": "hmsb8rc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638388447.0
    },
    {
        "author": "Public-Angle82",
        "body": "Does anyone else feel like maybe rich folks just get together and decide to raise prices and blame it on inflation.",
        "created_utc": 1638359686,
        "id": "hmsbao1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388486.0
    },
    {
        "author": "abigailwimbleu",
        "body": "Do yourself a favor &amp; sell when it gets back up to $26-$27. Love PLTR but it’s been disappointing to hold to say the least",
        "created_utc": 1638360716,
        "id": "hmscrk5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389516.0
    },
    {
        "author": "Berto_",
        "body": "Burn it",
        "created_utc": 1638360748,
        "id": "hmsct88",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389548.0
    },
    {
        "author": "AutoModerator",
        "body": "Your submission was removed because it is a short post. Any self-post below 400 characters in the body will be removed.  Please refer to rule 6 and make sure your post meets our standards of effort. Automod evasion will be met with a lengthy ban. Do not post just an article; highlight the parts of the article you find relevant or offer some commentary surrounding the article. Self-posts that offer some simple thoughts or questions like \"what do you think\", \"here's my thoughts\", etc. belong as comments to existing posts or the [Daily Advice Thread](https://www.reddit.com/r/investing/about/sticky?num=2).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
        "created_utc": 1638362089,
        "id": "hmseur7",
        "score": 1,
        "subreddit": "investing",
        "created": 1638390889.0
    },
    {
        "author": "abrahamlincoln20",
        "body": "AT&amp;T, though most of the growth would probably come from the spun off WBD, but you get them both if you buy now. Even cheaper than Intel.",
        "created_utc": 1638347148,
        "id": "hmrw4ck",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638375948.0
    },
    {
        "author": "Interfecto",
        "body": "Nope, I was listening to a podcast and the host mentioned the doc, so I watched it and now I’m sad 🏎☹️",
        "created_utc": 1638348666,
        "id": "hmrxxt3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377466.0
    },
    {
        "author": "LeafsAreCryBabies",
        "body": "The problem is that though these companies are probably going to be really profitable in the next few years, one would most likely need to hold them after merger.\n\nThe crypto market could enter a bear market in a few months so I feel that would limit profit on the SPAC.\n\nWith that said, another blow off top for this bull run in crypto may be profitable for this SPAC  for those who invest now. \n\nFood for thought",
        "created_utc": 1638347626,
        "id": "hmrwoo5",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638376426.0
    },
    {
        "author": "sleepyguy007",
        "body": "Yeah I figured. ... Used to live there.  I actually live in LA now and it's starting to get that bad.  I feel like I need this sub just to figure out how to get the money to not have to deal with these issues sadly",
        "created_utc": 1638345681,
        "id": "hmru9yq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374481.0
    },
    {
        "author": "StockTipsTips",
        "body": "You have needs and wants. Inflation is when you have less spending power with the same paycheck. Now let’s assume prices skyrocketed. You would economize on your needs and scale back on your wants. If enough people cut back on buying wants you have a situation where the same amount of companies are competing for what remains behind on decreased business. Stonks go down.",
        "created_utc": 1638349856,
        "id": "hmrzbsv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638378656.0
    },
    {
        "author": "badasschap",
        "body": "It means GOLDMAN SACHS - MARKET HAS NOW PRICED IN A MAMMOTH C.7 MB/D NEGATIVE DEMAND HIT OVER THE NEXT THREE MONTHS, WITH NO OFFSETTING OPEC+ RESPONSE",
        "created_utc": 1638346283,
        "id": "hmrv1l7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375083.0
    },
    {
        "author": "tisgamebeterhavep0rn",
        "body": "He busted a couple of times by now and it's just sleeping soundly",
        "created_utc": 1638346758,
        "id": "hmrvmvq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375558.0
    },
    {
        "author": "Sallys_Thigh_Gap",
        "body": "I was up 12% like 2 weeks ago and then BABA and a few more growth stocks collapsed and now I'm down 2% overall.\n\nI'm worried I'm down overall and we're in a massive bull market :/",
        "created_utc": 1638346782,
        "id": "hmrvnzc",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638375582.0
    },
    {
        "author": "Upper-Equivalent3651",
        "body": "Well, the QE fucked a lot of things up, wouldnt you say?\n\nJust taking a look at treasuries and you cry. There was a time when you got interests for the risk you are taking the loaner goes bust. Now it seems all rules are out of the window.\n\nOne look at treasuries of Greece and my eyes go blank.\n\nNot even talking about sanctions. Fucked a lot of things up too. Or when people just do their own sanction thing (yes, clearstream, euroclear and whatever you call yourselves, I am talking to YOU!)\n\nAh well. You win one, you lose one.",
        "created_utc": 1638347943,
        "id": "hmrx2bm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376743.0
    },
    {
        "author": "wolfiasty",
        "body": "PRPB, you Beauty of a Princess.\n\nCONX, you Shiny Star in the sky.\n\nCRHC, you Fabulous Black Horse.\n\nHalf of CCIV gains in paper loss. Can we start December rally now pretty please ?",
        "created_utc": 1638348804,
        "id": "hmry3t2",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638377604.0
    },
    {
        "author": "xcheezeplz",
        "body": "That's what oil does, it's not algos, the price is literally influenced by a cartel deciding what it should be. Now mix in market uncertainties and what else would you expect? \n\nUsually it only takes 2 times getting fucked trading oil before people swear it off.",
        "created_utc": 1638348207,
        "id": "hmrxdt7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377007.0
    },
    {
        "author": "Crater_Animator",
        "body": "Shoulda waited till mid-end December. Volatility is super high right now, and we're heading  for a little correction or more.",
        "created_utc": 1638348152,
        "id": "hmrxbey",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638376952.0
    },
    {
        "author": "Phantom_Journey",
        "body": "Yeah, I sold a ton of VIX calls Wednesday at 20. I bough puts at 24 and 28. Didn’t cashed out when 5K up. I closed it flat. Now I’m back in for a month this time, waiting for some change. It’s.. fucking annoying.",
        "created_utc": 1638348966,
        "id": "hmryanq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377766.0
    },
    {
        "author": "SomeKindOfSorbet",
        "body": "But Intel doing bad for the last year doesn't mean it's going to for the next 2 years. I'm making this call for now, not for a year in the past.",
        "created_utc": 1638346951,
        "id": "hmrvvqi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638375751.0
    },
    {
        "author": "Redditsome22",
        "body": "[Pie graph](https://ibb.co/wwc9QhN?fbclid=IwAR1z1gj0gQ7T8nUUHXUVERiWjmndFdjXWnYv6Y-Y_BAsgDVGgiYFoKHRegU)\n\n&amp;#x200B;\n\nI have done a lot of repositioning into positions currently on what I considered a discount all of those flew high, too fast and burnt to the ground and beyond. went deep into BABA - currently 178avg and PYPL 211 avg - currently sadly sitting at an unrealized xx% loss. Also loaded on what was a speculative position last year with higher conviction now - bought quite a few CRSP at what I believe to be the bottom at the 78 range - currently avg at 102+-.{Not even mentioning my stupid PLTR,BB position - gambles going wrong atm, believing in the hype and the reason I bought hasnt changed still hence why i havent sold}\r  \n\r  \nAlthough I have sizeable losses here these positions have elevated my positions amazingly.\r  \n\r  \nHolding a sizeable position with xxx% returns on AMD and NIO and very bullish on SE - recently added to my position at 280\r  \n\r  \nbought into the AMC hype with a 14 avg and sold of 80% at around the 60 mark\r  \n\r  \n\r  \n\r  \nSquare shouldve been scalped and rebought 205-280 range and back is ridiculous but oh well\r  \n\r  \nsold JD into strenght to buy into my weaker positions - had a big position before. still bullish but seeing more upside elsewhere atm.\r  \n\r  \nI dont have any us mega caps- I know winners stay winners usually but I am looking for hopefully bigger returns albeith I run risk of big losses, clearly, as well - such as sizeble position in a clinical trial biotech AGTC - currently at a big loss aswell but that was expected. Lets see what happens here. stock at all time lows.\r  \n\r  \n\r  \n\r  \nfor example although im sitting at a 10avg with my SKLZ position the downside is limited here imo, and potential huge hence why I have been adding to my position lately a lot bellow 10\r  \n\r  \n\r  \n\r  \nI do recommend people look into CPNG and let me know their thoughts. I am torn between adding to this position or keeping it small.",
        "created_utc": 1638358232,
        "id": "hms9b17",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638387032.0
    },
    {
        "author": "trail34",
        "body": "Ugh. I see this a lot, but it makes no sense. What’s better…\n\n1) profiting $1000 and paying $350 in taxes, netting you $650?\n\n2) profiting $1000 and purposely losing $1000, paying $0 in taxes, and netting you $0?\n\n3) profiting $1000 and purposely losing $2000, getting a $350 tax refund but you’re now at -$750 net?\n\n\nPeople are always so afraid of paying taxes. But I’d rather pay taxes and still have a profit than negate all my winnings by purposely selling stuff for less than I paid.",
        "created_utc": 1638360073,
        "id": "hmsbuca",
        "score": 1,
        "subreddit": "investing",
        "created": 1638388873.0
    },
    {
        "author": "dutch9494",
        "body": "If you’re looking for high risk high reward NAKD might be your thing. It’s basically this lingerie company that got beaten to its knees by the pandemic and is now being used to transform in to CENNTRO in order to take that private company to the Nasdaq.",
        "created_utc": 1638358202,
        "id": "hms99l7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638387002.0
    },
    {
        "author": "yachtykek",
        "body": "seriously tho, this shit is too easy. calls on big tech. buy on da dips. fuck with tesla aka forrest gump every now and then. getting rich in the stock market for dummies",
        "created_utc": 1638360128,
        "id": "hmsbx3c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388928.0
    },
    {
        "author": "rjenks29",
        "body": "Now.",
        "created_utc": 1638360147,
        "id": "hmsby25",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638388947.0
    },
    {
        "author": "Fine-Ad6513",
        "body": "kind of unfair equivalence because the Nokia business has been disrupted in the last 15 years severely. They couldn't get an alternative to a good smartphone. They try to catch up with 5G now but they are still behind. Now with Baba I agree that they might face more antagonism, but how exactly do you see the online retail business being disrupted in the 10-20 years to come in China? Also, antagonists need time to build an infrastructure.",
        "created_utc": 1638361709,
        "id": "hmse9a6",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638390509.0
    },
    {
        "author": "Diamondhands4dagainz",
        "body": "I can’t bet on it because I don’t know when the rates will rise. JPOW could come in today and say “Fuck it we’re gunna raise rates next week”. Cunt is a loose cannon now",
        "created_utc": 1638361190,
        "id": "hmsdgqw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389990.0
    },
    {
        "author": "hurricane_floss",
        "body": "Find a stock you like, I like PayPal right now.. and then just slide money into my massive bag.",
        "created_utc": 1638351589,
        "id": "hms1asd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638380389.0
    },
    {
        "author": "Superddone20222",
        "body": "lol the entire world is green. sorry bears you guys had your 2 out of 3 days but now the party is over.",
        "created_utc": 1638354233,
        "id": "hms4c9e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383033.0
    },
    {
        "author": "DodgeBeluga",
        "body": "This. Nothing in China is above Xi now that he’s got another official term and put him self as peer of Deng.",
        "created_utc": 1638356565,
        "id": "hms75nu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638385365.0
    },
    {
        "author": "Super_NiceGuy",
        "body": "Well it does look like a bubble but it is impossible to say if it is and if that is the case then when it will pop. There are just so much going on right now that it can be pumped for many different reasons, some legitim and some retardness. I think it is way over priced but on the other hand my knowledge fits in a pinch.",
        "created_utc": 1638352321,
        "id": "hms256p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638381121.0
    },
    {
        "author": "MrPacksAlot",
        "body": "Yeah it’s now a flagrant foul",
        "created_utc": 1638352298,
        "id": "hms2475",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638381098.0
    },
    {
        "author": "TruncateReed",
        "body": "waiting for a dip is like waiting until your school sweetheart is getting a divorce to get it after all. if you had the balls back then, you wouldn't have to wait now. never look back, never regret missed opportunities: because while you regret them, you are already missing new ones.",
        "created_utc": 1638353909,
        "id": "hms3ym0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638382709.0
    },
    {
        "author": "Brief-Garbage",
        "body": "I think they are in a bubble, but can see an actual use case for them in e.g. licencing or gaming.\n\nRight now though, there are a whole bunch of gaming tokens being released for games that haven't been released yet and have 0 users. This is peak bubble, speculating that this game is going to actually have users, and that the users will want items in it badly enough to pay $10k for in game items. \n\nThey also need to deal with existing games made by all the best developers, and that are free to play. Why on earth would a game that requires everyone to buy $1000 items take off if 99.9% would rather play Fortnite or COD for free? These NFTs are in for 99.9999% drops to come close to regular games if they want mass market appeal.",
        "created_utc": 1638352173,
        "id": "hms1yv7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638380973.0
    },
    {
        "author": "parttimeschizo",
        "body": "What? No way, each dose costs about $20 and while they might be “free”, they are subsidized through taxation obviously. Now, regardless of what the data shows good or bad, do they have a profit motivation to keep their mass vaccination campaign going, yes or no?",
        "created_utc": 1638353029,
        "id": "hms2y8g",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638381829.0
    },
    {
        "author": "sinncab6",
        "body": "Lol created in January but right you have other accounts but you must just use this one for WSB?\n\nEither way dont try bullshitting everyone like you are some elite old school wall street bets guy when you like 90% of the people on here now myself included found out about this sub then.  The difference is I used GME for what it was worth a quick pump and dump, and not a social cause that the shittiest ran company on the planet towards customers and employees alike was going to cause the great proletariat uprising and usher in a utopian society like you Jim Jones following kool aid kids believe.",
        "created_utc": 1638351183,
        "id": "hms0u9p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379983.0
    },
    {
        "author": "Nearby_Paint_2196",
        "body": "Im not cocky enough to say we’re in anything like a Great Depression right now.  It’s possible we are, who knows.",
        "created_utc": 1638351130,
        "id": "hms0s3t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379930.0
    },
    {
        "author": "Bull_City_Bull_919",
        "body": "Stop trading now. Setting yourself up for failure more so. If you’re over working by charting &amp; examining everything you’re receiving diminished returns because you’re cooked brother. Walk away for a week or two",
        "created_utc": 1638354292,
        "id": "hms4et8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383092.0
    },
    {
        "author": "Phaeax",
        "body": "Need pump the market now with free monies and load up on puts at ATH so can dump",
        "created_utc": 1638355110,
        "id": "hms5e88",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383910.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Market really be like “so you say there’s *more money now*",
        "created_utc": 1638356734,
        "id": "hms7dct",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638385534.0
    },
    {
        "author": "marker853",
        "body": "Wendys burgers were different 20 years ago. They are absolute shit now.",
        "created_utc": 1638356023,
        "id": "hms6huc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638384823.0
    },
    {
        "author": "stockninja39",
        "body": "PSA: handies are now $15 because inflation or just because I want to charge this much 🖕",
        "created_utc": 1638356821,
        "id": "hms7hfy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638385621.0
    },
    {
        "author": "jason-landry",
        "body": "The stock market is like legalized gambling. You win some, and you loose some. I have been investing for 30 years. There have been many ups and downs, but for the most part, you WILL make money if you play your cards right. Do not quit now! Make sure you diversify your portfolio. Diversification could mean: Stocks, Bonds, ETFs, Mutual Funds, physical Gold &amp; Silver, Crypto, CASH! \n\nThe S&amp;P 500 Index is a good fund if you're into mutual funds. You should also look at international stock funds, small cap and mid size funds too. Twenty or thirty years from now you'll look back at the advice that you have been given and hopefully be smiling. Make sure to read a lot on the topic of investing, and read periodicals like *Barron's* for some great info. All the best in your investing journey.",
        "created_utc": 1638355131,
        "id": "hms5f43",
        "score": 1,
        "subreddit": "investing",
        "created": 1638383931.0
    },
    {
        "author": "TheOriginalBushToad",
        "body": "TGT, AMZN, KSS, XRT, UPS.  Santa rally starts now!",
        "created_utc": 1638357031,
        "id": "hms7qyl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638385831.0
    },
    {
        "author": "Tersiv",
        "body": "Great write up. Now show us your % performance..",
        "created_utc": 1638355966,
        "id": "hms6fft",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638384766.0
    },
    {
        "author": "freakymreaky",
        "body": "Intel was a great company at 2000 and you could easily see intel sticking around for next 20 years, which it has and it more than quadrupled revenue etc. But stock price? Thats another story. Same thing is happening with NVDA and TSLA right now. Both will be around in 2041 most likely and their profit and revenue will 3X, 4X but I dont see stock price going higher.",
        "created_utc": 1638356298,
        "id": "hms6tpr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638385098.0
    },
    {
        "author": "Fahim_2001",
        "body": "I knew it was going to be green today, this shit is becoming so predictable now.",
        "created_utc": 1638356926,
        "id": "hms7m8p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638385726.0
    },
    {
        "author": "MADEUPDINOSAURFACTS",
        "body": "The person below explained it well but if you are familiar with stocks, they work exactly the same way.  $IWM is trading at $152 and I short 100 shares there thinking its the top, and it rallies to $300 am I making money or losing money?\n\nConversely, $IWM is trading at $152 and I buy 100 shares there and it is now trading at $300, am I making money or losing money?\n\nSame applies to options.",
        "created_utc": 1638361574,
        "id": "hmse1nb",
        "score": 1,
        "subreddit": "options",
        "created": 1638390374.0
    },
    {
        "author": "zabi_01",
        "body": "Anyone investing in GME now is just putting their money on fire",
        "created_utc": 1638361055,
        "id": "hmsd9ne",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389855.0
    },
    {
        "author": "VisualMod",
        "body": "/u/qwert1225 is now special.",
        "created_utc": 1638358755,
        "id": "hmsa0hy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387555.0
    },
    {
        "author": "Ratchet_as_fuck",
        "body": "I was planning on buying shares and selling OTM covered calls, the premium is so high on options right now!",
        "created_utc": 1638360122,
        "id": "hmsbwtp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388922.0
    },
    {
        "author": "Dwarfguy",
        "body": "At least I still have my youth and my health... for now",
        "created_utc": 1638358258,
        "id": "hms9c7y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387058.0
    },
    {
        "author": "AnAssholesBestFriend",
        "body": "Market yesterday: Nooooo non-transitory inflation and Omicron, i hate you!!!!\n\nMarket 5 minutes after close and this AM: wtf i love inflation and covid now",
        "created_utc": 1638359702,
        "id": "hmsbbi8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388502.0
    },
    {
        "author": "quintanarooty",
        "body": "You forgot \"the price of a gallon of milk is now $300\"",
        "created_utc": 1638361947,
        "id": "hmsems9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390747.0
    },
    {
        "author": "VisualMod",
        "body": "/u/realister is now special.",
        "created_utc": 1638358621,
        "id": "hms9tz7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387421.0
    },
    {
        "author": "RoPrime12",
        "body": "Right, but look at realistic growth. Everyone is in euphoria now. How likely is it that they will not grow 40%? I would argue pretty high, as the tech industry go an enourmous bump since March 2020.",
        "created_utc": 1638360097,
        "id": "hmsbvkf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638388897.0
    },
    {
        "author": "TGD187",
        "body": "My January 22 170C AAPL will print, won't they?! Fucking bought them during the Gamestop craze and watched them dump since then, tendies seem to be on the menu now.",
        "created_utc": 1638358359,
        "id": "hms9gzn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387159.0
    },
    {
        "author": "Spirit_Panda",
        "body": "&gt;**Extended lockup period agreed upon by investors\n\nHow exactly is this an NPV positive thesis? \n\n&gt;**Large percentage of Institutional investors\n\nNot sure why you think this is a good thing lol. It actually exposes the stock to violent selloffs.\n\n&gt;**0% redemption per today's filing\n\nSPAC squeezes are actually based on high redemption % which reduces the float. 0% redemption is actually bad for a squeeze thesis because dilution is at maximum. \n\n&gt;**High short interest with high borrow rates (less incentive to short due to massive upside)\n\nOk.\n\n&gt;**Great company with a huge market\n\nLol tell me their plan to become profitable again? Have you even looked at their financials?\n\nGood Lord man. This is the state of financial market participants now.",
        "created_utc": 1638360946,
        "id": "hmsd3q2",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638389746.0
    },
    {
        "author": "Gordon_Betto",
        "body": "Good. Now sell it and enjoy a lifelong story-tell story with a happy end.",
        "created_utc": 1638360976,
        "id": "hmsd5b9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389776.0
    },
    {
        "author": "neotoxgg",
        "body": "Now do it with stocks that are down ytd",
        "created_utc": 1638359347,
        "id": "hmsatp3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638388147.0
    },
    {
        "author": "SStauning",
        "body": "VALE the mining company? You're kidding, right? I mean, a Gamma squeeze on that dog... now that's funny.",
        "created_utc": 1638361888,
        "id": "hmsejgi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390688.0
    },
    {
        "author": "EarningsBitch",
        "body": "Friendship with SPY ended, now SOXL is my best friend",
        "created_utc": 1638361155,
        "id": "hmsdevm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389955.0
    },
    {
        "author": "elonhole",
        "body": "Marlet on friday: nooo fucking omicron😵\nMarket on monday: shit I love omicron now🤑\nMarket on tuesday: noooo fuck, inflation is non-transitory😵\nMarket today: wait I love inflation wtf🤑",
        "created_utc": 1638361136,
        "id": "hmsddvz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389936.0
    },
    {
        "author": "EnginrA",
        "body": "Yeah thats my face right now",
        "created_utc": 1638361759,
        "id": "hmsec2u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390559.0
    },
    {
        "author": "golden_bear_2016",
        "body": "Damn wtf, we back to Kangaroo market now??",
        "created_utc": 1638352906,
        "id": "hms2t6g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638381706.0
    },
    {
        "author": "SnipahShot",
        "body": "PayPal lost a lot of its value, people will be selling now to reduce their taxes probably.",
        "created_utc": 1638352956,
        "id": "hms2v9j",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638381756.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "&gt;How is this not all over the newswires\n\nIt is.\n\nBut you're falling victim to irrational hyperbole and exaggeration.\n\nMany of us have been saying since the start of this bull market that when the inflows stopped, there would be a correction, so be ready for that.\n\nTheir job is not to keep the market trading mostly-sideways, their job is to support the real economy. Now that companies are doing better, getting strong revenues... it doesn't really matter if the market does a hard correction. It isn't needed for there to have been a \"mistake.\" They communicate what is necessary to try to keep people calm, until the time comes for a change, and then the change is made. There is nothing in \"promote effectively the goals of maximum employment, stable prices, and moderate long-term interest rates\" about stonks always going up. If they had tapered a year ago, as you seem to be suggesting, before employment had recovered then companies might not have done the same amount of hiring. That was the goal all along, and they've been saying that all along. If you've been listening to them. A lot of people have been responding with continuous cynicism, instead of listening, and those people are less prepared to rotate their investments on time.\n\nIt is up to each of us, as traders and investors, to be prepared for things like this, and to make sane choices.",
        "created_utc": 1638349358,
        "id": "hmryr70",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638378158.0
    },
    {
        "author": "CoffeeAndDachshunds",
        "body": "Yeah, I'm a huge bear, but the correct answer for investing some money is always \"now\".",
        "created_utc": 1638350036,
        "id": "hmrzj84",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638378836.0
    },
    {
        "author": "mrtmra",
        "body": "Congrats, you are the one winner who made money out of 11million of us. Now let me fk your wife.",
        "created_utc": 1638351998,
        "id": "hms1rno",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638380798.0
    },
    {
        "author": "tortoisepump",
        "body": "ATVI a steaming pile of shit right now. Currently $58.  Worth a some calls if it hits $52 which was their March 2020 low? Or is this dumpster fire beyond saving?",
        "created_utc": 1638349655,
        "id": "hmrz3gn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638378455.0
    },
    {
        "author": "RedditPropagandaTool",
        "body": "I've speculated (I purposefully don't use the word investing) with a very small sum in EUR P2P lending since 2019. After Covid, my losses are about equal to the profits, and even worse if you count taxes. Right now, I'm withdrawing everything.\n\nHow it works is that you basically just send money to some Latvian bank account, there is no regulation, and there is no guarantee that you will ever get any of your money back. It's all hopes and promises.\n\nThe buyback obligation is false advertising, because it counts for nothing if the company defaults (which happens all the time).\n\nWorst of all, when there is a crisis, everything stops, and right when you need the money to invest in the stock market (in bear market), you instead have your cash tied up in some Eastern European account.",
        "created_utc": 1638351299,
        "id": "hms0z0i",
        "score": 1,
        "subreddit": "investing",
        "created": 1638380099.0
    },
    {
        "author": "i-bet-you",
        "body": "You’re probably a real broke mother fucker by now",
        "created_utc": 1638348794,
        "id": "hmry3cm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377594.0
    },
    {
        "author": "sinncab6",
        "body": "Yeah there's no firm time table for HBO max getting folded in until that happens this is just going to waffle in its range just like Viacom.\n\nFar better places you can stick your money in now but whenever HBO max ends up there I'm all over it but right now Season 468 of Gold Rush and Deadliest catch ain't really moving the needle",
        "created_utc": 1638347395,
        "id": "hmrwf0f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376195.0
    },
    {
        "author": "rifaplax21",
        "body": "Finally some good fucking news for NIO. It's been a busy month for them. Successful expansion (albeit small) to Norway. Partnership with Shell. All time high deliveries (slightly higher than previous high). This is going to be a slow cooker but I'm feeling good about the long haul now.",
        "created_utc": 1638347952,
        "id": "hmrx2px",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376752.0
    },
    {
        "author": "WhenMoonsk",
        "body": "What’s with all the Russian talk now",
        "created_utc": 1638346257,
        "id": "hmrv0fg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375057.0
    },
    {
        "author": "T1m3Wizard",
        "body": "Tsk tsk. Now she won.",
        "created_utc": 1638346715,
        "id": "hmrvkxl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375515.0
    },
    {
        "author": "Attorney-Outside",
        "body": "yes very much, maybe Thursday will be red since we've been zig-zagging for a week now",
        "created_utc": 1638347332,
        "id": "hmrwcb8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376132.0
    },
    {
        "author": "ravioli_bruh",
        "body": "$20 trillion market cap incoming now that it's an ev company",
        "created_utc": 1638346376,
        "id": "hmrv5qa",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638375176.0
    },
    {
        "author": "StopTheBan420",
        "body": "Been up since 6 am working, now I gotta get up at 6 again and I’m scared to go to sleep and miss the alarm. Fuckkk also bears r fukkk",
        "created_utc": 1638346100,
        "id": "hmrutan",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374900.0
    },
    {
        "author": "Jerome_BRRR_Powell",
        "body": "Superstonk was cool for a while, than it got lame af and now its sad...\n\nFolks thinking a single share can give them generational wealth, selling it for 1m +....",
        "created_utc": 1638345654,
        "id": "hmru8s0",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638374454.0
    },
    {
        "author": "Veolt1",
        "body": "So I guess now would be the time to start buying the dip unless it constantly goes down till it's clear what omicron is capable of.",
        "created_utc": 1638346051,
        "id": "hmrur34",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1638374851.0
    },
    {
        "author": "Rodrigo87",
        "body": "What's worse. Losing 500k but have no debt or getting a loan for 50k, losing that and now you have debt.",
        "created_utc": 1638345721,
        "id": "hmrubsq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374521.0
    },
    {
        "author": "whatshisuserface",
        "body": "The years 2100, covid did a few cycles in the Greek alphabet and is now at omega-29, PLTR is slowly but surely approaching $23",
        "created_utc": 1638346157,
        "id": "hmruvx3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374957.0
    },
    {
        "author": "Chgralac73",
        "body": "Jack Ma was selling Baba stock to west and buying Chinese media companies. gov did not like it. they are now going more into ok we got oligopoly going on, lets go standard oil on them and allow small startups to get bigger. tencent and alibaba were essentially forcing anyone else to partner/sell equity to them.\n\nits like in us. facebook should have never been allowed to buy instagram and whatsupp\n\nthat being said what happens to stock people already own? i mean nio is really attractive with being able to switch battery out",
        "created_utc": 1638354464,
        "id": "hms4m4r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383264.0
    },
    {
        "author": "Specific-Dot6556",
        "body": "I've always been told the market tries to price in future potential so it my guess is it may pop on negative news since demand is strong now and once they fix any issues from the negative news then demand should theoretically be even higher. Although that's making the assumption the company will resolve those issues. Takes severe optimism imo.",
        "created_utc": 1638356076,
        "id": "hms6k32",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638384876.0
    },
    {
        "author": "SDI_Sunset",
        "body": "are happy bears trending now?",
        "created_utc": 1638345803,
        "id": "hmruflm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374603.0
    },
    {
        "author": "Jazzlike-Actuary382",
        "body": "While the general consensus is that the average taxes will increase, we don't know which taxes. They could increase sales taxes and lower income taxes for example, making a Roth a bad investment now.\n\nAnother possibility is maybe in the future there will be a basic income since lots of jobs could get automated and income taxes could be reduced to 0 to incentivize work for those who want to live on more than the basic income.\n\nThat's why it's prudent to diversify with taxes and have both Roth and traditional accounts. I personally contribute only to Roth because company matches to Roth 401k are considered traditional so if you have a Roth 401k you're already diversified. Your contributions are post-tax but the company's are pre-tax.",
        "created_utc": 1638346409,
        "id": "hmrv77m",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638375209.0
    },
    {
        "author": "Spiritual-Truck-7521",
        "body": "I just want to see if I'm still on reddit or alive to get this reminder now.",
        "created_utc": 1638345647,
        "id": "hmru8ge",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374447.0
    },
    {
        "author": "SlogCorp",
        "body": "I don't get them. I don't hate them, I just don't understand it. And I've tried. So they're not a play for me that's for sure. NFTs are the first thing that has made me feel old. Just turned 40, been feeling fine about it. Tried to read up on NFTs and now I need a walker.",
        "created_utc": 1638345698,
        "id": "hmruaqv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638374498.0
    },
    {
        "author": "kgg42",
        "body": "First the Russians interfered with the election, now they’re interfering with our subreddit 🥴",
        "created_utc": 1638346037,
        "id": "hmruqh8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374837.0
    },
    {
        "author": "McKoijion",
        "body": "Welp, here we go. A few months ago (even after it plunged following Jack Ma's statements), Alibaba was still one of the 10 most valuable companies on the planet. Now it has gone the way of Tibet, the Uyghurs, Tiananmen Square, Hong Kong, hopefully not Taiwan, etc. Moral of the story: don't piss off dictators. \n\nhttps://finance.yahoo.com/news/china-plans-ban-loophole-used-073233461.html",
        "created_utc": 1638348901,
        "id": "hmry7xk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377701.0
    },
    {
        "author": "ApartPersonality1520",
        "body": "If you click on the video you can clearly see he is autistic. \n\nProbably reading this right now",
        "created_utc": 1638349292,
        "id": "hmryoe9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638378092.0
    },
    {
        "author": "Just_Crazy",
        "body": "Best time to invest is 20 years ago. Second one is now",
        "created_utc": 1638347813,
        "id": "hmrwwsf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638376613.0
    },
    {
        "author": "AnotherDegenerateFK",
        "body": "The liquor is calling the shots now, Randy",
        "created_utc": 1638348425,
        "id": "hmrxn62",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377225.0
    },
    {
        "author": "wolfiasty",
        "body": "Now for our holdings to go green as well.",
        "created_utc": 1638349970,
        "id": "hmrzgil",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638378770.0
    },
    {
        "author": "Upper-Equivalent3651",
        "body": "Grats! Great bet.\n\nFor now.",
        "created_utc": 1638348064,
        "id": "hmrx7i2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376864.0
    },
    {
        "author": "DoctorPumpAndDump",
        "body": "This market keeps fucking me. I bought SPY calls last Wednesday before the market closed and sold for a huge loss on Friday and switched to puts which i also sold for a massive loss on Monday. Then yesterday i bought puts right before market close and now futures keep going up for no reason.",
        "created_utc": 1638350455,
        "id": "hms00et",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379255.0
    },
    {
        "author": "Jericho3434",
        "body": "35 years? Is that a thing now?",
        "created_utc": 1638348596,
        "id": "hmrxunj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377396.0
    },
    {
        "author": "zzzerocool",
        "body": "Yep, Disney + isn't much of a Netflix competitor. Disney+ plus Hulu is. I think they're in an awkward spot where they share ownership of Hulu until 2024 with Comcast where they can then buy them out for fair value. I wonder the exact details, it sounds like Disney is hesitant to go all in on Hulu because it will cost them more in the end to own it. That's actually what Comcast is legally feuding with them now about, they're saying that Disney is sandbagging with slow expansion of Hulu in foreign markets so they won't have to pay Comcast as much. I wonder if that's limiting how much Disney wants to invest in Hulu original content right now as well.",
        "created_utc": 1638350773,
        "id": "hms0djn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638379573.0
    },
    {
        "author": "MrSteveC",
        "body": "Beef was a better quality back then, now more additives to the mix. Stop going in the front door for your protein. Behind the dumpster outback pure protein served.",
        "created_utc": 1638356367,
        "id": "hms6wpy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638385167.0
    },
    {
        "author": "Andrew_the_giant",
        "body": "Youre just realizing this now?",
        "created_utc": 1638355563,
        "id": "hms5xnl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638384363.0
    },
    {
        "author": "wearahat03",
        "body": "Have you done a DCF valuation for that? \n\nBecause if they doubled their revenue just 2 years, with constant margins, their profits would go from 8bn to 32bn which would put them at 26PE in just 2 years\n\nNo one is expecting NVDA to double revenues every year, if they were expected to, their valuation would be far higher than it is now",
        "created_utc": 1638350871,
        "id": "hms0hgd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638379671.0
    },
    {
        "author": "Garpcui",
        "body": "Just wait till the first Omicron case is announced in the USA (any day now). I guarantee you are gonna cry that day.",
        "created_utc": 1638355008,
        "id": "hms59pr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383808.0
    },
    {
        "author": "James383Magnum",
        "body": "Hey everyone:\n\nI currently have a large portion of my portfolio in TDB627. Over the last few years, I have been slowly selling this off to buy individual stocks. I would like to sell my units in this to buy  individual stocks and ETFs. My time horizon is 29 years.\n\nMy investing strategy is to buy and DRIP stocks/ETFs/etc that pay consistently growing dividends and also provide good long-term total returns (10% per year or better). I am also trying to diversify by having equal weighting in every sector.\n\nThe diversifying part is where I am having trouble. Right now, the sectors I don't have exposure to are: Energy, Consumer Discretionary, Basic Materials, and Healthcare. I have yet to find an individual company in these sectors that I like enough to buy stock in. I have found energy to be a particularly tricky sector.\n\nIs there an ETF that has equal-sector weighting, and has performed well over the long-term? Or would I be better served by buying an S&amp;P 500 or TSX60 ETF?\n\nThanks!",
        "created_utc": 1638355390,
        "id": "hms5q6o",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1638384190.0
    },
    {
        "author": "thetasbitch",
        "body": "LISTEN CLOSE POORS:\n\nIf you made put spreads out of your puts yesterday, instead of holding overnight because you were out of day trades, you would at least have some profit right now. Instead your puts are dead.",
        "created_utc": 1638354430,
        "id": "hms4kmq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383230.0
    },
    {
        "author": "AngryBirdCasualGamer",
        "body": "I think a similar scheme lead to the collapse of Greensill Capital recently.  They provided loans for various things to do with supply chain management.\n\nSteel Magnate Sanjeev Gupta was taking the loans from Greensill then aggressively acquiring companies and assets into his “empire” then immediately using those assets to acquire further loans from Greensill at values inflated wayyy above actual book value.\n\nIn effect he was buying companies, getting control of their assets, immediately securing loans against the assets and then using those loans to buy further companies / assets. etc. \n\nIt’s funny because Gupta is still going but Greensill collapsed because the bigger banks it was using for its own finance decided it was being too risky and froze its accounts leading to its collapse.  \n\nGupta kinda did what you’re asking about but it’s all pretty dodgy and it appears as though he has gotten away with it, at least for now.",
        "created_utc": 1638356882,
        "id": "hms7k94",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638385682.0
    }
]