[
    {
        "author": "Foullacy",
        "body": "????\n\nCitrix is none of those things.",
        "created_utc": 1637031847,
        "id": "hkt1vbx",
        "score": 7,
        "subreddit": "stocks",
        "created": 1637060647.0
    },
    {
        "author": "chihighflyer",
        "body": "Sorry but VMware causes random pc crashes on our HP based systems, Citrix is buggy but more reliable on a whole.",
        "created_utc": 1637066879,
        "id": "hkuibqz",
        "score": 3,
        "subreddit": "stocks",
        "created": 1637095679.0
    },
    {
        "author": "peachezandsteam",
        "body": "Twitter?  I don’t understand how they are not one of the biggest companies in the world given the ubiquity of their product.\n\nHow about the “old” and forgotten tech stocks like INTC, CSCO, CTXS, ORCL, etc?",
        "created_utc": 1636121322,
        "id": "hjf095r",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636150122.0
    },
    {
        "author": "OutMotoring",
        "body": "I havent used citrix since 2000. I didnt know this company is still alive",
        "created_utc": 1637034212,
        "id": "hkt70cj",
        "score": 3,
        "subreddit": "stocks",
        "created": 1637063012.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  4th of November\n\n\n\n## Upcoming events for Thursday, November  4th\n\n - Expected earnings:\n\n  AAOI, AAON, AAU, ABC, ABNB, ABUS, ACET, ACIW, ACMR, ACR, ACRX, ADAP, ADMA, ADMS, ADVM, ADXN, AE, AERI, AES, AEZS, AFCG, AG, AGLE, AGO, AGS, AHCO, AIG, AINV, AIV, AJX, AKBA, AL, ALBO, ALE, ALEX, ALGS, ALHC, ALKT, ALLO, ALRM, ALTR, AMEH, AMH, AMN, AMPY, AMRK, AMYT, ANGI, ANIK, AOSL, APD, APLE, APPN, APR, APRE, APT, APTV, AQMS, ARC, ARDX, ARNA, ARQT, ARVN, ARW, ASMB, ASPS, ASRT, ATAX, ATEC, ATLO, ATNX, ATRA, ATRS, ATSG, ATUS, AUMN, AUTO, AVLR, AVRO, AXNX, BABA, BALY, BAP, BATRA, BATRK, BBD, BBDO, BBIO, BCE, BCLI, BCOR, BCYC, BDX, BE, BEPC, BFS, BGNE, BGS, BHF, BIGC, BILL, BKD, BL, BLCM, BLDR, BLFS, BLI, BLL, BLPH, BNGO, BPMP, BRG, BSBK, BSGM, BXRX, CABO, CAI, CALA, CARS, CBAY, CBIO, CC, CCOI, CDR, CDTX, CDXS, CDZI, CEMI, CFLT, CFX, CGNX, CHH, CHUY, CI, CIR, CLBS, CLDT, CLDX, CLFD, CLI, CLLS, CLNE, CLXT, CMBM, CMRX, CMT, CNCE, CNDT, CNHI, CNP, CNQ, CNXN, COLD, COLL, COMM, CPLG, CPLP, CRAI, CRDF, CRMD, CRON, CRY, CS, CTHR, CTLP, CTMX, CTSO, CTT, CTXS, CUBE, CVCO, CVET, CVNA, CVRX, CWEN, CWEN.A, CWK, CXP, CYBR, CYCN, CYRX, DBRG, DBX, DDOG, DEN, DHC, DIN, DISH, DK, DKL, DLX, DMLP, DNB, DNLI, DNN, DOCN, DRH, DRNA, DUK, DVAX, DWSN, DYN, EBS, ECOR, ED, EGLE, EIGR, ELOX, ENDP, ENG, EOG, EPAM, ERF, ERII, ESTE, ETTX, EURN, EVC, EWCZ, EXPE, FARM, FAT, FATBB, FATE, FCRD, FDUS, FIS, FLNT, FND, FNKO, FOCS, FOLD, FOR, FOXF, FROG, FRT, FSLR, FTNT, FULC, FVCB, FVE, FWONA, FWONK, GBT, GDOT, GDP, GDYN, GEL, GEO, GERN, GH, GIL, GKOS, GLPG, GMED, GNE, GNL, GOGO, GOLD, GOLF, GOVX, GPP, GPRE, GPRO, GRFS, GROW, GRTS, GSBD, GTN, GTN.A, GTYH, HALL, HASI, HBI, HEAR, HHC, HII, HIMX, HL, HMHC, HMPT, HRTG, HSKA, HTA, HWM, HZN, IAC, IBOC, IBP, ICL, IDCC, IDRA, IFRX, IGMS, IHC, IHRT, III, ILMN, IMH, IMMR, IMRA, IMUX, INDP, INDT, ING, INGN, INOD, INS, IOVA, IRM, IRTC, IRWD, ISDR, ISPC, ITP, ITRI, JNCE, JYNT, K, KALA, KBAL, KDMN, KDNY, KFFB, KIQ, KMPH, KOP, KRP, KRTX, KTB, KURA, KVHI, KWR, KYMR, KZR, LABP, LASR, LAUR, LAZY, LBRDA, LBRDK, LCUT, LFVN, LGF.A, LGF.B, LITE, LLNW, LND, LNG, LNT, LNTH, LOCO, LORL, LPTH, LSPD, LSXMA, LSXMB, LSXMK, LTHM, LTRPA, LTRPB, LXP, LYV, MACK, MAIN, MASS, MBUU, MCHP, MDGL, MDRX, MED, MELI, MGEE, MGLN, MGTA, MGTX, MITK, MITO, MLAB, MLCO, MNDT, MNST, MP, MRIN, MRNA, MSC, MSGM, MSI, MTBC, MTD, MTEM, MTSI, MTX, MTZ, MUR, MUX, MXC, MYE, NATR, NE, NEO, NEPH, NET, NFG, NH, NHC, NINE, NKLA, NKSH, NKTR, NLOK, NMM, NNBR, NNI, NOMD, NPTN, NREF, NRG, NS, NSIT, NTCT, NTLA, NTRA, NTUS, NVAX, NVMI, NWS, NWSA, NXTC, OBSV, OEC, OGE, OHI, OLED, ONCT, ONTO, OPCH, OPTN, ORGS, ORIC, ORLA, OTEX, OTRK, OUT, OXY, OYST, PAC, PAE, PALT, PASG, PBA, PBH, PBYI, PCOR, PCTI, PCTY, PDCE, PDEX, PECO, PEI, PENN, PESI, PFSI, PGNY, PH, PHI, PINS, PLM, PLNT, PLX, PMT, PODD, PPL, PRCT, PRDO, PRMW, PROF, PRTA, PRVB, PSNL, PTMN, PTON, PWFL, PWP, PWR, PZG, PZZA, QDEL, QRTEA, QRTEB, QTRX, RBA, RC, RCUS, RDFN, REFR, REG, REGN, REPL, REYN, REZI, RFP, RGA, RGLS, RGS, RKT, RLJ, RMAX, RNGR, RUN, RWAY, SALM, SATS, SELB, SEM, SFE, SFM, SGA, SGMO, SHAK, SHO, SHYF, SID, SIGA, SKM, SLDB, SLQT, SLRX, SMHI, SMLP, SNPO, SO, SPRO, SQ, SRLP, SRRA, SRTS, SSYS, STFC, STKS, STNE, STOR, STRA, STRO, SVC, SVM, SVRA, SWCH, SWKS, SWX, SXI, SYBX, SYNA, TAL, TCX, TDC, TDS, TDW, TEF, TFFP, TGH, TGNA, TGP, TGTX, THR, TIPT, TK, TMCI, TMST, TNK, TPL, TRGP, TRHC, TRIN, TTOO, TTSH, TUEM, TWI, UBER, UEIC, UFCS, UIHC, UNIT, UONE, UONEK, USM, USPH, USWS, VATE, VCTR, VG, VHI, VIA, VIAC, VIACA, VIAO, VIAV, VIR, VLDR, VMC, VNT, VRAY, VRRM, VSAT, VSTO, VTVT, VVI, W, WCC, WD, WELL, WFCF, WLDN, WLL, WMC, WMS, WPM, WSC, WSTG, WW, WWE, WYNN, XENE, XFOR, XLRN, XOMA, XONE, XRAY, XTNT, XXII, Y, YELP, YMAB, YTRA, ZBH, ZEUS, ZGNX, ZTS\n\n - Ex-div:\n\n  AFB, AMX, ARLP, BKEP, BMRC, BPRN, CEQP, CFFN, CMCO, CMS, CPLP, CVCY, DAN, DKL, ET, FBC, FCBC, FCF, FE, FFWM, FRAF, FRBA, GPP, HCC, HSII, HWKN, HWM, IBCP, ICBK, IDA, INTC, JBHT, LBAI, LBC, LVHD, LW, MMLP, MMP, NSC, NWBI, NWLI, NYCB, OHI, PFE, PNFP, RELL, SIRI, SRLP, STZ, STZ.B, SUN, TGP, UL, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Challenger Job Cuts (previous: 17.895K)\n    - Continuing Jobless Claims (consensus: 2,118K, previous: 2,243K)\n    - Exports (previous: 213.70B)\n    - Imports (previous: 287.00B)\n    - Initial Jobless Claims (consensus: 275K, previous: 281K)\n    - Jobless Claims 4-Week Avg. (previous: 299.25K)\n    - Natural Gas Storage (consensus: 63B, previous: 87B)\n    - Nonfarm Productivity (consensus: -3.0%, previous: 2.1%)\n    - OPEC Meeting\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n    - Unit Labor Costs (consensus: 7.0%, previous: 1.3%)\n\n## Upcoming events for Friday, November  5th\n\n - Expected earnings:\n\n  AAMC, AENZ, AMCX, AMR, AMRX, AREC, ATNM, AXL, AY, AYRO, BBU, BCH, BEP, BH, BH.A, BRK.A, BRK.B, CGAU, CGC, CKX, CLMT, CNK, CNTY, CQP, CRNX, CRT, CVR, CZNC, D, DKNG, DOC, DSEY, DTM, DXPE, DXYN, EAF, ECOL, ELAN, ENB, ENIC, ENLV, EPZM, ESGR, ESNT, FET, FLR, FTSI, GBL, GBNY, GCI, GLP, GOOS, GRPN, GSAT, GT, GTS, HE, HMC, HMTV, HRC, HSON, INTT, JCI, JCS, KFS, KIM, LFT, LMRK, MBIO, MFA, MGA, MITT, MMI, MODV, MOG.A, MOG.B, MOSY, MTNB, NATH, NEN, NMRK, NOG, NOVN, NPO, NTP, NVIV, NVO, NWLI, NWN, OCGN, OFIX, OFS, ONCY, PAYA, PFSW, PHVS, PLYM, PNW, PVL, RAND, RSLS, SAMG, SBR, SCYX, SII, SRE, SRNE, SSP, SYRS, TELL, TEN, TGS, THM, TILE, TIXT, TKC, TM, TPHS, TRP, TSE, TU, TUSK, UBOH, UFS, UI, UK, VHC, VRS, VST, VTR, VWTR, WRN, WTM, XELA, YORW\n\n - Ex-div:\n\n  AAPL, AB, ALX, AMP, ARTNA, ASRV, BCO, BSBR, CLAR, CLB, CWT, DHF, ENBL, FBIZ, FBK, FHI, FIBK, GLOP, GLP, GWW, HAFC, HBCP, HBT, JHG, LAZ, LPX, MC, MCI, MN, MRLN, MUSA, NATI, NMM, NS, NSEC, OCFC, PCTI, PEAK, PEBO, PETS, RUSHA, RUSHB, RWAY, SCHN, SHEN, SJW, SXI, VNO, WABC, WMK, WVFC, X, XLNX\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.9%, previous: 4.6%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.6%)\n    - Average Weekly Hours (consensus: 34.8, previous: 34.8)\n    - CFTC Aluminium speculative net positions (previous: 4.2K)\n    - CFTC Copper speculative net positions (previous: 37.3K)\n    - CFTC Corn speculative net positions (previous: 307.8K)\n    - CFTC Crude Oil speculative net positions (previous: 423.7K)\n    - CFTC Gold speculative net positions (previous: 214.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.3K)\n    - CFTC Natural Gas speculative net positions (previous: -138.2K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 96.5K)\n    - CFTC Silver speculative net positions (previous: 37.5K)\n    - CFTC Soybeans speculative net positions (previous: 43.2K)\n    - CFTC Wheat speculative net positions (previous: 0.8K)\n    - Consumer Credit (consensus: 15.90B, previous: 14.38B)\n    - Government Payrolls (previous: -123.0K)\n    - Manufacturing Payrolls (consensus: 27K, previous: 26K)\n    - Nonfarm Payrolls (consensus: 450K, previous: 194K)\n    - Participation Rate (previous: 61.6%)\n    - Private Nonfarm Payrolls (consensus: 400K, previous: 317K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 443)\n    - U.S. Baker Hughes Total Rig Count (previous: 542)\n    - U6 Unemployment Rate (previous: 8.5%)\n    - Unemployment Rate (consensus: 4.7%, previous: 4.8%)\n\n^^^^2021-11-04",
        "created_utc": 1636020014,
        "id": "hj9i3rw",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1636048814.0
    },
    {
        "author": "lcarav",
        "body": "The only competitors that are listed are Ringcentral (not on the S&amp;P) and Citrix (on the S&amp;P, but current mcap is only $10.5B). All the other listed companies providing this product/service seem to be within larger groups (Microsoft, Google, Cisco, Verizon,etc) and then there's Teamviewer in Germany (&lt;3B mcap)",
        "created_utc": 1637757527,
        "id": "hlw723v",
        "score": 2,
        "subreddit": "stocks",
        "created": 1637786327.0
    },
    {
        "author": "RunYouCleverGirl_",
        "body": "Can confirm. I work for a large healthcare organization and work maintaining the Citrix infrastructure. Super helpful virtualizing the software opposed to local installs on hundreds of thousands of devices.",
        "created_utc": 1637119387,
        "id": "hkxymy3",
        "score": 2,
        "subreddit": "stocks",
        "created": 1637148187.0
    },
    {
        "author": "Devil-Deetz",
        "body": "Citrix Software is great. The issue is it has many touch points, and is the entry point to a user's applications / desktops. Therefore Citrix gets the blame even if it's a network or storage related problem. I've seen people blame Citrix and it turns out their network connection is down. Most Citrix issues are actually an issue somewhere else and a result of poor implementation or rattling infrastructure.",
        "created_utc": 1637306234,
        "id": "hl888uv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1637335034.0
    },
    {
        "author": "_Sgushonka",
        "body": "FISV",
        "created_utc": 1635880582,
        "id": "hj1qukn",
        "score": 8,
        "subreddit": "stocks",
        "created": 1635909382.0
    },
    {
        "author": "I_love_avocados1",
        "body": "It’s most payment processors, not just PayPal. Look what’s happening to old school competitors like $EEFT, $FIS, $FISV, $GPN, not to mention $MA, and $V.",
        "created_utc": 1635864325,
        "id": "hj0m8a9",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635893125.0
    },
    {
        "author": "noname45678",
        "body": "FISV",
        "created_utc": 1635892406,
        "id": "hj2lfrk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635921206.0
    }
]