[
    {
        "author": "Poor_Peasant",
        "body": "Thats some impressive DD OP. Had to check if you were legit however... first posts about Hearthstone, Citrix and Golf... yeah ok that checks out. I'll join for a few bricks.",
        "created_utc": 1628945496,
        "id": "h8wlnu3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628974296.0
    },
    {
        "author": "greytoc",
        "body": "Company stocks can fall and it can take years and sometimes decades to recover. \n\nThere were quite a few well known high-flying tech stocks in the 90's and early 2000's that never recovered or are only now recovering.  The ones that always pop into my mind include Cisco, Intel, GE, Akamai, VeriSign, Checkpoint. Citrix. I'm sure there are more examples including companies that eventually failed or were delisted. \n\nAnd please don't ask me why they pop into my mind.",
        "created_utc": 1629227525,
        "id": "h9blqnt",
        "score": 2,
        "subreddit": "investing",
        "created": 1629256325.0
    },
    {
        "author": "Incendras",
        "body": "WTF does it need Citrix for? are you logging into a virtual windows machine (yes even Xenapp is a Windows VM at EOD) because you are on linux?",
        "created_utc": 1628619561,
        "id": "h8ftczq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628648361.0
    },
    {
        "author": "delsystem32exe",
        "body": "they appear to have less volume and open interest a lot of times. for example, citrix and bigc come to mind.",
        "created_utc": 1628541449,
        "id": "h8bvept",
        "score": 2,
        "subreddit": "options",
        "created": 1628570249.0
    },
    {
        "author": "Mr_Brozart",
        "body": "I work in the industry and I struggle to see the long term growth potential of VMware. On-premise hardware will start to linger in favour of cloud, VDI is useful for legacy apps but a lot of companies struggled with remote working because they used thin client devices that were bound to the office and as great as Carbon Black might look, Microsoft will continue to grow its security capabilities and take more of the market as enterprise organisations consolidate and get more value for money from their M365 licences.\n\nCitrix is another great company that needs to transform itself before it’s too late, at least they have more patented technology than Microsoft partner with to use with their WVD offering (HDX technology).",
        "created_utc": 1628153616,
        "id": "h7s8jqk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628182416.0
    },
    {
        "author": "UltraMachoTaco",
        "body": "CTXS got the dip going",
        "created_utc": 1628002921,
        "id": "h7k5hwq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628031721.0
    },
    {
        "author": "fatnigmongolfagotcuz",
        "body": "schwab's software needs citrix on linux and somehow i fucked it up, not gonna try again",
        "created_utc": 1628619287,
        "id": "h8fspe5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628648087.0
    }
]