[
    {
        "author": "schultzy99",
        "body": "Enphase $ENPH.  Energy management. Micro inverter technology for solar, and storage. Adjusts current to match demand exactly and instantly.  Enabling microgrid creation and solar that will work without grid or storage. Also enables peer to peer energy sales with blockchain control. No one else comes close. Not even Tesla.  Just launched.",
        "created_utc": 1635993107,
        "id": "hj8gpi3",
        "score": 87,
        "subreddit": "stocks",
        "created": 1636021907.0
    },
    {
        "author": "SmackEh",
        "body": "NVDA, TSLA, ENPH...All insane market caps",
        "created_utc": 1636248151,
        "id": "hjmexbs",
        "score": 55,
        "subreddit": "stocks",
        "created": 1636276951.0
    },
    {
        "author": "BIMFgang",
        "body": "I get what you are saying but I did in fact buy it. There’s a difference between complete hindsight and actually buying and profiting off of it which I have done numerous times, I think their was only one occasion where I ever lost money on ENPH.",
        "created_utc": 1636150019,
        "id": "hjh2re6",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1636178819.0
    },
    {
        "author": "SpliTTMark",
        "body": "I tried to tell people i sold enph/etsy at 170 but every stock subreddit wants 3 paragraphs of dd",
        "created_utc": 1636411217,
        "id": "hjv273o",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636440017.0
    },
    {
        "author": "Zealousideal-Bear-56",
        "body": "Bro, I had ENPH at .92, then it dropped to .85, bought more. Went back to .92, sold half. Sold the rest at 1.05. Bought back in at 2.00, sold at 4.00, never went back. Someone close to me started following it. He got in at $20 big and HODL’d. He’s a millionaire.",
        "created_utc": 1635993464,
        "id": "hj8hgls",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1636022264.0
    },
    {
        "author": "Dr_Faci1ier",
        "body": "I sold a bunch of spacs at NAV like DCRC to go heavy on ENVX under $14, it was too good of an opportunity to pass up. You have innovative batteries but on an actual timeline with production already started this year, backed by someone like T.J. Rodgers that all ENPH investors should know about.\n\nI remember there was a post comparing the different battery spacs way back based on their revenue projections and a lot of people were convinced MVST/FREY/RMO were better because of their crazy projections. I'd rather have a company lowball their guidance and surpass them than come out with insane projections that miss.",
        "created_utc": 1635955440,
        "id": "hj5vuev",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1635984240.0
    },
    {
        "author": "chugler92",
        "body": "Retirement- TSLA MSFT GOOG NVDA AMD \n5-10 years - ENPH ETSY APPS EXPI DKNG",
        "created_utc": 1636208985,
        "id": "hjjyned",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636237785.0
    },
    {
        "author": "AmeriMan2",
        "body": "I love enph.\n\n1 share at 4.13",
        "created_utc": 1635800383,
        "id": "hixi74k",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635829183.0
    },
    {
        "author": "psychcloud",
        "body": "TSLA PLUG ENPH FCEL moon mission baby",
        "created_utc": 1635808972,
        "id": "hiy29ae",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635837772.0
    },
    {
        "author": "AmeriMan2",
        "body": "After 3 years, i sold enph.\n\nMixed feelings.  I got in at 4.70",
        "created_utc": 1636035307,
        "id": "hja8mtk",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636064107.0
    },
    {
        "author": "SilkyThighs",
        "body": "TSLA ENPH NET will never make any sense so just enjoy the ride",
        "created_utc": 1635801184,
        "id": "hixk4kq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635829984.0
    },
    {
        "author": "Itsyaboi2020251",
        "body": "22 Year Old: \n\nICLN - 0.57%\n\nSE - 10%\n\nSTEM: 1.2%\n\nENPH: 33% (cost basis 26)\n\nFSMEX: 2%\n\nMSFT: 12% \n\nLIT: 1%\n\nPYPL: 1%\n\nSPY: 2%\n\nQQQ: 20%\n\nNET: 2%\n\nAMAZN: 8%\n\nTSLA: 50% (cost basis $34)\n\nThis is across a few accounts and I also have some calls open on CLF and STEM and SOFI but most of my portfolio is Enphase and Tesla",
        "created_utc": 1635980192,
        "id": "hj7npnm",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636008992.0
    },
    {
        "author": "Microtonal_Valley",
        "body": "Having everything stored on your phone seems to be the way of the future, why not your banking and finances as well?\n\nSOFI isn't the most innovative but i think a lot of people underrate how popular the one-stop-shop banking, investing, financing, loans and hopefully more to come will be in the future. Average people look for ease of use, SOFI makes money easy.\n\nI also think Solar and Genomics and data are worth looking into $MAXN, SPWR, ENPH, CRSP",
        "created_utc": 1636044492,
        "id": "hjaw1g8",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636073292.0
    },
    {
        "author": "Sizzmo1",
        "body": "ENPH is my favorite stock.  It's a bitter sweet relationship.  It's a boomer stock but swings like a meme stock often.  My latest run with it was buying at $160,  thinking the market will be flat and sold nov monthly $170 calls.  Will end up with $6k profit but leave $15k behind.",
        "created_utc": 1636157975,
        "id": "hjhlxee",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636186775.0
    },
    {
        "author": "Ap3X_GunT3R",
        "body": "First of all we need more investors with that mindset.\n\nSecondly, I don’t think many people actually know the extent our planet is screwed right now. \n- we have 30 years of warming guaranteed right now. Even if we stopped producing green house gasses tomorrow\n- Europe is projected to hit their 2030 goals in 2040\n- most major corporations have net zero carbon emission goals targeting 2030-2050, but we’re projected to hit 1.5 degrees warming before 2030\n- yes oil cannot disappear overnight otherwise everything would be disrupted, but OP is looking for stocks that will help reduce environmental destruction in the long term. \n\nMost people have yet to realize the extent young people and new generations will have to live significantly different lives, given even mild case warming scenarios. \n\nEnergy “producers” I like: NEE, Vestas, BEPC, ENPH\n\nEVs: Tesla, Rivian, Nio (there are other car makers going fully electric but for OPs purpose I’m only listing present day 100% EV companies I like) \n\nETFs: ICLN, QCLN, TAN (can always look at their holdings for more ideas) \n\nOther: Origin Materials\n\nI also think battery recycling is a huge thing for the EV space but will need a few years for a leader to emerge. \n\nDisc: Uranium gang is alive and well in this thread. Totally viable investment play as I agree it’s probably going to play a big part in the future. That being said someone else can speak to it better than me.",
        "created_utc": 1635944265,
        "id": "hj54x6j",
        "score": 2,
        "subreddit": "investing",
        "created": 1635973065.0
    },
    {
        "author": "sammyp1999",
        "body": "Constantly shilling them, but after solars recent bump after a very lackluster year, I think they'll pop hard again next year. Maybe not as much as in 2020, but companies like ENPH are expanding like crazy, getting great new partnerships, and developing pretty stunning tech. ENPH has also navigated the chip shortage superbly and is gearing up for the moon.\n\nI'd recommend TAN (it's an ETF but who cares) and ENPH.",
        "created_utc": 1636327169,
        "id": "hjqk4al",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636355969.0
    },
    {
        "author": "axel-07",
        "body": "I am trying to build a balanced stocks portofolio and until know this is what I have:\n\nAAPL\t8.71%\r  \nMSFT\t8.12%\r  \nJNJ\t        6.44%\r  \nO     \t5.65%\r  \nADM\t5.05%\r  \nAPPS\t5.03%\r  \nENPH\t4.78%\r  \nINTC\t4.59%\r  \nPEP  \t4.56%\r  \nCAG\t4.47%\r  \nSQ\t        4.31%\r  \nSNY\t        4.04%\r  \nCRSR\t3.58%\r  \nTM\t        3.57%\r  \nVICI\t        3.51%\r  \nARCC\t3.34%\r  \nHPQ\t3.12%\r  \nMDLZ\t2.45%\r  \nSBSW\t2.38%\r  \nCVX \t2.28%\r  \nPATH\t2.23%\r  \nBTG \t2.16%\r  \nPAAS\t2.09%\r  \nKMI \t2.00%\r  \nARCT\t1.53%",
        "created_utc": 1636465870,
        "id": "hjxo7qr",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636494670.0
    },
    {
        "author": "us9er",
        "body": "Agreed, steel prices have already come down a lot over the last few weeks and month according to: [https://tradingeconomics.com/commodity/steel](https://tradingeconomics.com/commodity/steel)\n\nI also think ARRY is very cheap in terms of P/S and Forward EPS compared to some other solar companies that trade at much higher valuations. They do other stuff though especially the micro inverter guys (ENPH / SEDG)\n\nAlways nice to hear from someone that is in the business. I think that's people were made aware of ENPH a few years ago (by some solar installer on reddit)",
        "created_utc": 1635889054,
        "id": "hj2cyhh",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635917854.0
    },
    {
        "author": "brianjamesxx",
        "body": "$ENPH will never have a red day ever again for the rest of this company's existence!",
        "created_utc": 1636382994,
        "id": "hjt4k8v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636411794.0
    },
    {
        "author": "Dr_Faci1ier",
        "body": "It really is a beast, I haven't been paying attention to it but it's still my highest conviction deSPAC. It's fitting it's around all time highs around the same time as ENPH",
        "created_utc": 1635861785,
        "id": "hj0gc67",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1635890585.0
    },
    {
        "author": "NPRjunkieDC",
        "body": "ASPN + AEHR + CWBR + ENPH + ORGN",
        "created_utc": 1635884763,
        "id": "hj21o4h",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635913563.0
    },
    {
        "author": "AmeriMan2",
        "body": "Plug\n enph\nNio\nSpy \nTesla\nLucid",
        "created_utc": 1636167578,
        "id": "hji6hva",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636196378.0
    },
    {
        "author": "Diamond-Tendies",
        "body": "Somehow I’m at 25%, not really sure how tho.\nENPH giving me big boner time.",
        "created_utc": 1636050978,
        "id": "hjbcniu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636079778.0
    },
    {
        "author": "Itonlygetshigher420",
        "body": "&gt;very well position especially as they still own 2.5m shares of $ENPH. N\n\nwow!!! You would have made a Killing off that move in ENPH. And props to you for still holding. \n\n10k = 120k? \n\nwere your 1200% large gains in $$$ amounts?",
        "created_utc": 1635807302,
        "id": "hixygvy",
        "score": 1,
        "subreddit": "investing",
        "created": 1635836102.0
    },
    {
        "author": "Itonlygetshigher420",
        "body": "I'm adding more maxn on the daily my friend.\n\n24s and 25s. \n\n\nI'm going upto 60s.\n\nThat's 2.2b market cap for a 1.b revenue generating company.\n\nKEEP buying and holding.\n\nEnph and sedg have run alot so not them.",
        "created_utc": 1636091578,
        "id": "hjdtp53",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636120378.0
    },
    {
        "author": "ghostManaCat",
        "body": "Many solar stocks have been around for years and are quite overpriced and overvalued. Many cannabis stocks, particularly US cannabis stocks are still otc and cheap. \n\nI’m not sure ENPH at $243.76 with a 211.84 P/E is gonna give me a better return over the next 10 years than CRLBF at $8.90 that is cheap and possibly undervalued because it still marching toward profitability but continues to grow revenue.\n\nThe math isn’t as simple as you portray it, but maybe I’m overcomplicating it.",
        "created_utc": 1636390441,
        "id": "hjtmjal",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636419241.0
    },
    {
        "author": "Mike_Ropenis",
        "body": "In a 5 year window there are a dozen stocks that are massive MASSIVE companies that are up 2x-5x like Target (TGT),  Home Depot (HD), and Amazon (AMZN). In the last 2 years there are companies like TSLA, ENPH, and then moonshots like GME, AMC, PLTR, BB, and D__W__A__C that doubled or tripled in a short window.\n\nOne of my accounts is up 449% on ENPH in the last 2 years, my biggest regret is selling the shares I bought at 19 and buying back in at high 40s.",
        "created_utc": 1636250899,
        "id": "hjmkl63",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636279699.0
    },
    {
        "author": "ted206",
        "body": "Enph for sure, Sedg most likely.",
        "created_utc": 1635801985,
        "id": "hixm1wt",
        "score": 1,
        "subreddit": "investing",
        "created": 1635830785.0
    },
    {
        "author": "scorful",
        "body": "Another one that has grown tremendously is Enphase $ENPH, they are in the solar business with micro inverters. They were &lt; a dollar stock a few years ago and now popped over $200 a share for 20,000% gain over the last few years",
        "created_utc": 1636029953,
        "id": "hj9x7p8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636058753.0
    },
    {
        "author": "callme_thebandit",
        "body": "I really need FSLR to pull an ENPH on earnings tonight",
        "created_utc": 1636039973,
        "id": "hjak9pu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636068773.0
    },
    {
        "author": "Ensemble_InABox",
        "body": "I put my like 80% of my life savings into ENPH in Summer 2019 and have 12x'd it since then, a life changing decision. I remain extremely bullish in ENPH, although short/mid term price action is pretty much impossible to predict.\n\nIQ8 is peerless in the semiconductor space, and signals ENPH's first foray into commercial solar. Growth in new continents (S. America and Europe) is barely starting, with India representing massive growth in the long term, and US residential adoption of solar is somewhere around 5%. I expect ENPH to continue to be an alpha generator for at least 5 more years, and hit &gt;$1000 / share, and IMO that is conservative. \n\nSPWR is very well position especially as they still own 2.5m shares of $ENPH. Not super familiar with MAXN, but I think they have some sort of very unfavorable distribution agreement until EOY '22",
        "created_utc": 1635807047,
        "id": "hixxvuc",
        "score": 1,
        "subreddit": "investing",
        "created": 1635835847.0
    },
    {
        "author": "ritholtz76",
        "body": "Is it late to get into solar stocks. I nimbled bit into RUN, FSLR and ENPH. Should have added more few months.",
        "created_utc": 1636089927,
        "id": "hjdrg2w",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636118727.0
    },
    {
        "author": "MadMax_08",
        "body": "Been winning on ENPH. Anyone else riding the wave?",
        "created_utc": 1635776840,
        "id": "hivy2xr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635805640.0
    },
    {
        "author": "chugler92",
        "body": "Big tech is where I revert back to, my favourites are TSLA,NVDA,AMD,MSFT,AAPL, GOOG.  Some others that I think will do well besides the big companies -ENPH, ETSY, EXPI, APPS, DKNG  PLTR",
        "created_utc": 1635810187,
        "id": "hiy4zrt",
        "score": 1,
        "subreddit": "investing",
        "created": 1635838987.0
    },
    {
        "author": "Itonlygetshigher420",
        "body": "&gt;1100\n\nthats really good! almost $250k in gains. Yes! hopefully you can make that double with $enph, if not, thats more then enough capital to start a portfolio to hit some good returns.",
        "created_utc": 1635813909,
        "id": "hiydcmu",
        "score": 1,
        "subreddit": "investing",
        "created": 1635842709.0
    },
    {
        "author": "Itonlygetshigher420",
        "body": "&gt;e also bought some MAXN and I just never got around to transferring the money to my account to buy it.\n\nthank you. I only started with $10k a few years ago. I got some good returns with $ENPH, $SQ, and through long dated calls, just increased the returns really quick.\n\nI bought sunpower last year in the 20s and sold at the top right before the market pull back in january. \n\nI always found that maxn/sunpower tend to run in tandem. When sunpower started racing towards 30s, i knew that maxn wouldnt be far behind, and i wasnt wrong. From a charting point of view, it looks ready for the same breakout that sunpower had. \n\nSo i'm still trying to load in the 22s mark for when I can - right before the breakout.",
        "created_utc": 1635757414,
        "id": "hiv4x2v",
        "score": 1,
        "subreddit": "investing",
        "created": 1635786214.0
    },
    {
        "author": "BIMFgang",
        "body": "I bought ENPH at 176 prior to earnings as well. Can’t post images for whatever reason to show you.",
        "created_utc": 1636150092,
        "id": "hjh2y2i",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1636178892.0
    },
    {
        "author": "AmeriMan2",
        "body": "All in with enph earnings to spy 470c lets go 🇺🇸",
        "created_utc": 1636035517,
        "id": "hja94ec",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1636064317.0
    },
    {
        "author": "KliFNinja",
        "body": "Well i am a fan of TSLA SEDG and ENPH but das just me. They are down some from last week good for a possible buy atm.",
        "created_utc": 1636289795,
        "id": "hjo29mo",
        "score": 0,
        "subreddit": "pennystocks",
        "created": 1636318595.0
    },
    {
        "author": "themostcanadianguy",
        "body": "It’s kinda funny that fidelity sends you these letters lol sorry to hear dude",
        "created_utc": 1636131956,
        "id": "hjfrcm3",
        "score": 2173,
        "subreddit": "wallstreetbets",
        "created": 1636160756.0
    },
    {
        "author": "The_Hindu_Hammer",
        "body": "Fidelity is like “Uhh you good bro?”",
        "created_utc": 1636134360,
        "id": "hjfxkwl",
        "score": 1001,
        "subreddit": "wallstreetbets",
        "created": 1636163160.0
    },
    {
        "author": "Not-a-Banker",
        "body": "out of curiosity what was he doing that he didnt feel that he offered a valuable service? if fidelity is considered risk averse and they want to help you protect/grow your assets, they are a major player in the retirement accounts game, and they stepped up in a lot of ways over the past year (things related to Covid, GME, etc), what was not valuable about what your brother in law was doing?",
        "created_utc": 1636138811,
        "id": "hjg979p",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1636167611.0
    },
    {
        "author": "whomcanthisbe",
        "body": "Tbh I still use Robinhood to check out the market Bc the UIUX is just miles ahead of everything else. I use fidelity to actually buy/sell.",
        "created_utc": 1635875572,
        "id": "hj1dx6h",
        "score": 113,
        "subreddit": "StockMarket",
        "created": 1635904372.0
    },
    {
        "author": "Splaishe",
        "body": "+1 for Fidelity, -1 for Robinhood",
        "created_utc": 1636039895,
        "id": "hjak2e7",
        "score": 106,
        "subreddit": "StockMarket",
        "created": 1636068695.0
    },
    {
        "author": "norwegianmorningw00d",
        "body": "Mate just download any app with fractional shares and buy Tesla from there \n\nFidelity Webull Stash M1 Sofi Robinhood Schwab CashApp",
        "created_utc": 1636037519,
        "id": "hjae0q7",
        "score": 81,
        "subreddit": "StockMarket",
        "created": 1636066319.0
    },
    {
        "author": "flibbidygibbit",
        "body": "I bought in after that. I only wish I had a crystal ball to average down when it hit the upper 30s in february. I averaged up once and down again.\n\nI've DRS'd most of my shares. I left a few in Fidelity for the Tendieman.",
        "created_utc": 1636059851,
        "id": "hjbzao5",
        "score": 67,
        "subreddit": "wallstreetbets",
        "created": 1636088651.0
    },
    {
        "author": "cdevon95",
        "body": "I was mainly referring to the fallacy of doing it again.  \nAll of sudden you're taking 20% out every week pretending you didn't get lucky this one time. Next thing you know you're opening a margin account with $8.67 in your bank account thinking \"this is it. This is the winner\". Now you owe Fidelity $54,000 and you're not sure how you got here.  because nobody seems to believe the first one is always free",
        "created_utc": 1636138224,
        "id": "hjg7nqf",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1636167024.0
    },
    {
        "author": "Firemanbets99",
        "body": "I have fidelity to hold my shares but I use robinhood for option trading. It’s far more simple than all the other apps and fidelity won’t even give me access to option trading",
        "created_utc": 1635817637,
        "id": "hiylkw8",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1635846437.0
    },
    {
        "author": "poolandapondforyou",
        "body": "Fidelity doesn’t have a fiduciary responsibility toward you either.   No broker does.",
        "created_utc": 1635829732,
        "id": "hiz7xr3",
        "score": 57,
        "subreddit": "wallstreetbets",
        "created": 1635858532.0
    },
    {
        "author": "tired_trotter",
        "body": "Yep, Fidelity does send these. I've lost 10k and got such a letter from them. Also they've stripped my options trading permissions lol",
        "created_utc": 1636154414,
        "id": "hjhdlxm",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1636183214.0
    },
    {
        "author": "throwatworkay",
        "body": "Until the legit brokers like TDA or Fidelity make a non boomer, easy to read and digest app, I'll stay with RH. \n\nI'll put big money in the legit brokers for a long hold, but RH is my meme/ what if account.",
        "created_utc": 1636045711,
        "id": "hjaz736",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1636074511.0
    },
    {
        "author": "horizons59",
        "body": "Fidelity and Schwab are .65 to open and zero to close for Fidelity under 1.00 per contract. \n\nFills on RH is how they give you free trades. You are just paying a fee with slow and crappy fills.",
        "created_utc": 1636256793,
        "id": "hjmvvhr",
        "score": 45,
        "subreddit": "options",
        "created": 1636285593.0
    },
    {
        "author": "Runner20mph",
        "body": "I have moved to Fidelity",
        "created_utc": 1635814925,
        "id": "hiyflad",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1635843725.0
    },
    {
        "author": "SetzerWithFixedDice",
        "body": "The weirdest shit just happened to me at Fidelity. \n\nOh, wait, no it didn’t, because it doesn’t fuck up like Robinhood.",
        "created_utc": 1635976145,
        "id": "hj7dzh3",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1636004945.0
    },
    {
        "author": "lucky5150",
        "body": "I do, everyday. In my defense I have more in Fidelity, But.. and in true WSB fashion, I can't leave RH until I pay off margin. And to do that I'd need to sell. And well. 💎🤚",
        "created_utc": 1635798593,
        "id": "hixds40",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1635827393.0
    },
    {
        "author": "Jangande",
        "body": "Say fidelity one more time",
        "created_utc": 1636081649,
        "id": "hjdddyw",
        "score": 36,
        "subreddit": "investing",
        "created": 1636110449.0
    },
    {
        "author": "FinalDevice",
        "body": "They almost certainly have called about margin calls in the past, only to be told not to call.\n\nWhile I don't have experience with Schwab, I know fidelity has picked up the phone to call me about much smaller amounts.",
        "created_utc": 1635818518,
        "id": "hiynj85",
        "score": 30,
        "subreddit": "options",
        "created": 1635847318.0
    },
    {
        "author": "ovomin",
        "body": "fidelity now has a beta option and it transforms the app into a better lookalike robinhood",
        "created_utc": 1635942106,
        "id": "hj50t1r",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1635970906.0
    },
    {
        "author": "gadzookery12",
        "body": "Fidelity",
        "created_utc": 1636199731,
        "id": "hjjgnyc",
        "score": 27,
        "subreddit": "StockMarket",
        "created": 1636228531.0
    },
    {
        "author": "Leroy--Brown",
        "body": "First off:\n\nCheck the cost of certificates for Disney stock that sell online. Not the value of the shares, but the paper certificates themselves. These are collectors items, and look into this first before you get rid of the certificates.\n\nSecondly, do you have a broker? Like, a real broker that isn't Robinhood? Contact Charles Schwab, vanguard, fidelity, or one of the many other real brokerages and see (if you have an account) how much these certs would be in real value today if redeemed, with dividends.",
        "created_utc": 1635911976,
        "id": "hj3vcba",
        "score": 27,
        "subreddit": "stocks",
        "created": 1635940776.0
    },
    {
        "author": "InsertCleverNameHur",
        "body": "I make a deposit into fidelity and I can make a trade 30 seconds later. Multiple brokerage accounts for different purposes.",
        "created_utc": 1636206082,
        "id": "hjjscla",
        "score": 24,
        "subreddit": "StockMarket",
        "created": 1636234882.0
    },
    {
        "author": "thisismyeighthtry",
        "body": "Fidelity has a beta app rn where they basically just lifted the RH UI. That's what I've been using",
        "created_utc": 1636050792,
        "id": "hjbc6hh",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1636079592.0
    },
    {
        "author": "JonathanL73",
        "body": "1.) High rate of accounts getting hacked, some even with 2FV enabled.\n\n2.) For the longest time they didn't even have a customer support phone number, they're difficult to get ahold of if a problem arises.\n\n3.) Unstable and unreliable app, RH became completely unusable, multiple times during the Covid March 2020 crash. When other brokers stayed operational\n\n4.) Payment for order flow. RH makes money buy selling your buy orders to high frequency trade hedge funds, who are then able to \"frontrun\" the stock, meaning they can buy the stock a milisecond before you do, thus raising the price your market orders get filled. So you're actually paying more for stocks on RH than if you used another broker.\n\n5.) Conflict of interest, RH primary customer, Citadel was caught illegally naked shorting meme stock. During the meme stock frenzy, RH users weren't allowed to buy shares of certain companies, whereas with other brokers you could.\n\n6.) RH has history of being fined by the SEC, and countless lawsuits regarding not having the best user's interest in mind.\n\n7.) Glitchy Options display. RH falsely displayed losses for a young options trader who was actually in the green. He ended up committing suicide because of it.\n\n8.) If you care about margin %, Interactive Brokers and M1 Finance both have cheaper margin %\n\n9.) Not good for buying Crypto. You don't have access to your wallet keys, and you're not allowed to transfer your crypto to anew wallet, so you're forced to liquidate it if you want to move it elsewhere, which creates a taxable event. Also questions have raised if RH really holds the crypto that you \"own\" on their app.\n\nAlso it's not 2019 anymore, it's 2021. Countless apps have clean simple UI. SoFi &amp; Fidelity Beta both have clean UI",
        "created_utc": 1636202763,
        "id": "hjjlpp6",
        "score": 20,
        "subreddit": "StockMarket",
        "created": 1636231563.0
    },
    {
        "author": "boskle",
        "body": "Perhaps, with enough people and if purchasing through Fidelity with IEX routing or directly from GameStop via its transfer agent, Computershare.",
        "created_utc": 1635999504,
        "id": "hj8srs1",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1636028304.0
    },
    {
        "author": "xanre_",
        "body": "Lol. I got denied for margin on my new fidelity account. Then i applied again but exaggerated my net worth/liquidity and i was instantly approved",
        "created_utc": 1635942871,
        "id": "hj5285g",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1635971671.0
    },
    {
        "author": "vanillagorillamints",
        "body": "Fidelity",
        "created_utc": 1636082871,
        "id": "hjdfr41",
        "score": 18,
        "subreddit": "investing",
        "created": 1636111671.0
    },
    {
        "author": "Is_ael",
        "body": "Now what do you do when you can’t be approved for options trading on fidelity?",
        "created_utc": 1636116532,
        "id": "hjepzmj",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1636145332.0
    },
    {
        "author": "Homesober",
        "body": "How do I make Fidelity let me buy 0dte options 😭😭",
        "created_utc": 1636150640,
        "id": "hjh4arl",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1636179440.0
    },
    {
        "author": "zentechinc",
        "body": "I'm a high up software dude at Fidelity.\n\nBest company I've ever worked at.\n\nCharismatic ceo, friendly staff, no yelling (been here a little while now and never heard anyone get snippy during a code release or troubleshooting issue).\n\nNot sure what your brother in laws issue was.",
        "created_utc": 1636162303,
        "id": "hjhvek5",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1636191103.0
    },
    {
        "author": "chicasparagus",
        "body": "Precisely why some people find it funny. \n\nBut sending these doesn’t help Fidelity in any way shape or form, so why else would they be doing it other than to warn a person. \n\nI mean you’re awfully cynical and nothing can change that, so you do you.",
        "created_utc": 1636137799,
        "id": "hjg6jlq",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1636166599.0
    },
    {
        "author": "Fog_Juice",
        "body": "I got into Robinhood after GME squeezed. It's just easier than Fidelity plus crypto. Applying for options took 30 seconds compared to 3 weeks.",
        "created_utc": 1636048541,
        "id": "hjb6ha3",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1636077341.0
    },
    {
        "author": "Poopdicks69",
        "body": "Only 54k in debt to fidelity? I would feel like a millionaire.",
        "created_utc": 1636143684,
        "id": "hjgm88v",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1636172484.0
    },
    {
        "author": "Rick420-",
        "body": "Fidelity Pro. This is the unreleased beta version so u wont be able to get it yet",
        "created_utc": 1636161759,
        "id": "hjhu8lo",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1636190559.0
    },
    {
        "author": "GoddamnRelapse",
        "body": "Was supposed to buy $3000 worth of AMC yesterday, but FUCKING FIDELITY can't settle money fast enough. 🤬",
        "created_utc": 1635887900,
        "id": "hj29x87",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635916700.0
    },
    {
        "author": "Big-Toe6215",
        "body": "Got my letter from Fidelity saying that I lost a lot of money.  My account gets restricted in 30 days without a signed consent to continue.\n\n&amp;#x200B;\n\nDon't they know that I'm in a trade that can 40X and I'll make it all back up and then some?",
        "created_utc": 1636031773,
        "id": "hja0tir",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1636060573.0
    },
    {
        "author": "gayforgoblin",
        "body": "If my account is 100% in CROX shares but it's split across my Fidelity, Vanguard, and Schwab accounts, am I diversified?\n\nSaw some guy named kevin o leary on youtube telling me to diversify so it's got me thinkin",
        "created_utc": 1635992727,
        "id": "hj8fwu8",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1636021527.0
    },
    {
        "author": "therealJcrusin",
        "body": "A list of buyers for this stock\n\nGoogle\nFidelity \nLockheed Martin \nKia\nHyundai \nBill Gates\nRobert Bosch\nSamsung \nMicheal Dell\nAmazon\nHewlett Packard\n\n\nStill not convinced? Look any of those up to see their investments.",
        "created_utc": 1636200537,
        "id": "hjjhy2e",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1636229337.0
    },
    {
        "author": "OuthouseBacksplash",
        "body": "Fidelity has a great new mobile app that had a beta Vue similar to RH. That is what I would look at.",
        "created_utc": 1636207035,
        "id": "hjjuc38",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1636235835.0
    },
    {
        "author": "onat_akosha_",
        "body": "So funny!!! Fidelity (mis) calculates all deposits as gains, so dumb - and don’t get me started on how they screw up margin calculations",
        "created_utc": 1636220063,
        "id": "hjkohgy",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1636248863.0
    },
    {
        "author": "Cow_Interesting",
        "body": "Fidelity all the way…. No I don’t work for them! How dare you",
        "created_utc": 1636059588,
        "id": "hjbyn03",
        "score": 10,
        "subreddit": "StockMarket",
        "created": 1636088388.0
    },
    {
        "author": "HiIAmFromTheInternet",
        "body": "I had been with Etrade for like…10 years? 7 digit account balance. Moved the whole fucking thing to Fidelity because they couldn’t DRS my shares in a timely manner. Fidelity did 5000 shares in 3 days, Etrade couldn’t do 3000 in 30 days. \n\nNot sure what the fuck up is on ETrades end, but oh man they are fucking up.",
        "created_utc": 1635805741,
        "id": "hixuw6m",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1635834541.0
    },
    {
        "author": "NoleScole",
        "body": "Idk what wells fargo has been doing but settled cash applies to all brokerages unless you have a margin account. You can’t set up market trade at any brokerages. You can set up a limit order. I think you might be saying you can’t buy or sell at market, after hours. With fidelity you have to sign up for after hours trading. Then you have to go to their website to trade after hours or pre market hours. It isn’t available in the app.\n\nI use fidelity for long term I’ve been with them for years. They’re not my favorite to navigate though. I prefer others for trading and watchlist.",
        "created_utc": 1636084489,
        "id": "hjdisue",
        "score": 9,
        "subreddit": "stocks",
        "created": 1636113289.0
    },
    {
        "author": "FreeEuropeYouCunts",
        "body": "[How I dress up before logging into Fidelity, knowing that TSLA had greater gains in one month than my portfolio's entire YTD](https://i.imgur.com/xEcrowX.jpg)",
        "created_utc": 1635805927,
        "id": "hixvbj9",
        "score": 9,
        "subreddit": "stocks",
        "created": 1635834727.0
    },
    {
        "author": "SnowInTheTundra",
        "body": "Brokerage firms should send you souvenirs and shit if you hit milestones in your investment. Like get a 100k net worth and Fidelity sends you a mug in the mail.",
        "created_utc": 1636153268,
        "id": "hjhau7z",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1636182068.0
    },
    {
        "author": "Jello_Available",
        "body": "People hate RH, because they restricted trading when it was profitable for retail investors like you and I. I didn’t personally invest in GME or AMC, but I moved the amount I had (10k) over to Fidelity, where I already have my 401k and Roth, on that principle alone. Can’t trust a brokerage that restricts trading when it’s convenient for them….the fact that people miss this HUGE red flag is alarming.",
        "created_utc": 1636055393,
        "id": "hjbnw5a",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1636084193.0
    },
    {
        "author": "cw8950",
        "body": "Good luck to all those who hold BTTX today!! Wanted to fomo in but fidelity doesn’t let me trade until 7am so looks like I missed the boat lol. Just curious what brokers allow trading for during early premarket?",
        "created_utc": 1635759657,
        "id": "hiv78eb",
        "score": 8,
        "subreddit": "SPACs",
        "created": 1635788457.0
    },
    {
        "author": "seb_a",
        "body": "WeBull too restricted trading just like RH. E*TRADE did as well. To Fidelity I went.",
        "created_utc": 1636043633,
        "id": "hjatslg",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1636072433.0
    },
    {
        "author": "Helpy-Mchelperton",
        "body": "I got a FED call during the Columbus day thing on fidelity and they let me take care of it myself instead of liquidating my stuff. Pretty cool of them. Just saying. 🤷‍♂️",
        "created_utc": 1636282543,
        "id": "hjns0qj",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1636311343.0
    },
    {
        "author": "MythrowawayAcc5678",
        "body": "I'm still with RH but not very much money is it in. for example, RH has a really nice and simple layout combined with the DRIP option, something webull doesn't have. on top of that, RH's graphs are super easy to read, and show all the info without it being cluttered. Fidelity doesn't live stream stocks meaning unlike with RH, you need to refresh every 5 seconds to see the price movements. \n\nI use fidelity for my Roth, RH for my second smaller portfolio, and webull for day trading and other stuff. Coinbase is for crypto. typically I find it better to separate portfolios and some layouts are better than others. you wouldn't use robinhood for extreme technical analysis and you wouldn't use webull for long term buy and hold.",
        "created_utc": 1635877167,
        "id": "hj1hz2x",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1635905967.0
    },
    {
        "author": "SnowInTheTundra",
        "body": "What can Robinhood or Fidelity even do if you get margin called? Do people go to court over this shit?",
        "created_utc": 1636072373,
        "id": "hjct4v8",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636101173.0
    },
    {
        "author": "Peelboy",
        "body": "I have been using Fidelity for a while now and love the customer service and there is a physical location a couple miles from me.  I'm in the process of moving all my random retirement and other accounts over there now.",
        "created_utc": 1636207456,
        "id": "hjjv92p",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636236256.0
    },
    {
        "author": "rotaercz",
        "body": "Everyone is using Fidelity because they didn't turn off buys during the GME sneeze.",
        "created_utc": 1636108670,
        "id": "hjedfq9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636137470.0
    },
    {
        "author": "sorengard123",
        "body": "Simple, quality of investor base. A CFO's dream is blue-chip long only funds like Fidelity and Wellington which buy and hold forever. Management doesn't want hedge funds grilling them every quarter over why the margin isn't 20bp higher or activists threatening to fire them. They want investors who trust them to run the business well over the long-term. There's a reason why Charter Communications is bullet proof. It has the highest institutional ownership on the Street and spends zero time courting investors or investment banks.",
        "created_utc": 1636084218,
        "id": "hjdibof",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1636113018.0
    },
    {
        "author": "trump2024_3312",
        "body": "If the fidelity app is right this isn't a bad dividend stock",
        "created_utc": 1636271020,
        "id": "hjnfnp4",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636299820.0
    },
    {
        "author": "wordyplayer",
        "body": "Weird.   Fidelity provides a great service.    What was his job there??",
        "created_utc": 1636161291,
        "id": "hjht7wt",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636190091.0
    },
    {
        "author": "Neo1331",
        "body": "I’m at about $8,000 in commissions in Fidelity and they told me to go pound sand…☹️",
        "created_utc": 1636260906,
        "id": "hjn2xok",
        "score": 7,
        "subreddit": "options",
        "created": 1636289706.0
    },
    {
        "author": "I_love_avocados1",
        "body": "It’s most payment processors, not just PayPal. Look what’s happening to old school competitors like $EEFT, $FIS, $FISV, $GPN, not to mention $MA, and $V.",
        "created_utc": 1635864325,
        "id": "hj0m8a9",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635893125.0
    },
    {
        "author": "hellohi1994",
        "body": "I kept buying and selling if you wanna see the trades I bought it’ll take me some work but look at my post I jus made, I kept half sent to fidelity still hodling",
        "created_utc": 1635978535,
        "id": "hj7jtoo",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1636007335.0
    },
    {
        "author": "Jonnydoo",
        "body": "Why didn't you just lie to fidelity to get higher options levels.",
        "created_utc": 1636149132,
        "id": "hjh0j7j",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636177932.0
    },
    {
        "author": "MrEwThatsGross",
        "body": "Robinhood to get fucked. Fidelity for SPY",
        "created_utc": 1635970820,
        "id": "hj709qw",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635999620.0
    },
    {
        "author": "McKoijion",
        "body": "There's a legit investing lesson here. I used to say that Robinhood had a well designed app UI, but a terrible back end infrastructure. Meanwhile, Vanguard, Fidelity, and Schwab have great back end infrastructure, but terrible, outdated UIs. I used to think what those companies did was the hard part, and Robinhood just put some paint on a pig. I joked it was a race to see who could fix themselves up faster. But it's been almost a year, and those old school websites are as bad as ever.\n\nVanguard's bad UI is somewhat on purpose, and Schwab bought TDA and Thinkorswim. But Fidelity is an embarrassment. Active Trader Pro is the single oldest and worst performing piece of software I've had the misfortune of interacting with in the past decade. Their mobile app is terrible as well, though I commend them for trying to introduce a nicer looking, but still barely functional Robinhood knockoff beta.\n\nBasically, good design is priceless. But since an investor's job is to put a price on things, I'll just say it's very valuable. Haters always said that Steve Jobs was just the pretty boy frontman, but there are a lot of computer companies and only one is the largest corporation on the planet by simply coasting on Jobs's designs. It's hard to write good code or build a brokerage, but it's almost impossible to create good design.\n\nBasically, leaps on $MLKN",
        "created_utc": 1636085115,
        "id": "hjdjwq9",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636113915.0
    },
    {
        "author": "havestickswilltravel",
        "body": "I am with Fidelity. Can I register thru them? Ape not smart.",
        "created_utc": 1636050755,
        "id": "hjbc39e",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636079555.0
    },
    {
        "author": "I_need_my_fix_damnit",
        "body": "Also on fidelity",
        "created_utc": 1635903489,
        "id": "hj3c863",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1635932289.0
    },
    {
        "author": "dahhb",
        "body": "I got a response from one of those guys on Twitter, CannaVestments, yesterday. \n\nI carefully searched for all Reddit posts about this tweet. The best response I have is this is not a big deal. My takeaway: it is unlikely that less conservative, larger brokers like TD and Fidelity will start to block MSO OTC trades due to it still being a schedule one drug.\n\nHere's the thread from yesterday:\n\nhttps://www.reddit.com/r/weedstocks/comments/qiyczy/daily\\_discussion\\_thread\\_october\\_30\\_2021/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3",
        "created_utc": 1635812675,
        "id": "hiyajy9",
        "score": 5,
        "subreddit": "weedstocks",
        "created": 1635841475.0
    },
    {
        "author": "BuffMaltese",
        "body": "Last bearish bet I made I lost 11k the next day and Fidelity sent me a letter.",
        "created_utc": 1636060922,
        "id": "hjc1z77",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636089722.0
    },
    {
        "author": "alexgalt",
        "body": "Still Robinhood for new people. Fidelity is fine, but there is a reason why Robinhood remains ultra popular with people who are just learning.",
        "created_utc": 1636053591,
        "id": "hjbjazv",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636082391.0
    },
    {
        "author": "hunter994",
        "body": "I'm pretty sure you need to be a high net worth individual and a customer of the brokerage firm that publishes them, alternatively independent analysts offer subscriptions I think. Fidelity and Robinhood usually have (what I assume to be automatically generated) reports that have comps and such, but they aren't that great. I'm sure the others do to, but I haven't checked them out. \n\nThis is mostly speculation based off what I see other people talking about, I'm not a high net worth individual, and I don't value analyst reports.",
        "created_utc": 1636140213,
        "id": "hjgcyq1",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1636169013.0
    },
    {
        "author": "TCB47",
        "body": "Fidelity.  And as a post below states, it's not margin when cash secured.",
        "created_utc": 1636151336,
        "id": "hjh61h4",
        "score": 5,
        "subreddit": "options",
        "created": 1636180136.0
    },
    {
        "author": "bigdogc",
        "body": "You need to get a rep. Ask them to match IBKR. I’m at 0.85% with fidelity",
        "created_utc": 1636226679,
        "id": "hjl3o3b",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636255479.0
    },
    {
        "author": "tebedam",
        "body": "Just move your money to Interactive Brokers, that's what I did. It takes about 10 business days, the process is automated. Whatever margin you already have will also transfer.\n\nI tried margin on Fidelity for a month, had ~$350k on margin and kept trying to negotiate a better deal with multiple phone calls. All I got in the end was 5.5%. After that I moved the account and now my blended rate is ~1.2%. \n\nI set up a PRO account on IBKR, you pay a few fees and commissions this way, but overall get massive value due to low margin rates.",
        "created_utc": 1636221615,
        "id": "hjks3e9",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636250415.0
    },
    {
        "author": "AutisticDravenMain",
        "body": "IIRC, there’s 5K minimum for margin. There’s also fees on options. I just use Fidelity for my long positions and IRA, if you want to play with options, there are better choices.",
        "created_utc": 1635826938,
        "id": "hiz3qxd",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635855738.0
    },
    {
        "author": "Sven1542",
        "body": "I have no used the TDA app, but fidelity is kind of a pain for an option novice.",
        "created_utc": 1636046691,
        "id": "hjb1q14",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636075491.0
    },
    {
        "author": "redbaronx",
        "body": "I’m on Fidelity, you have to agree to some terms to trade penny stocks tho.",
        "created_utc": 1635795103,
        "id": "hix52rn",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1635823903.0
    },
    {
        "author": "joethearchitect3",
        "body": "This 401k plan had a Brokerage link option where you could buy individual stocks. Fidelity and Merrill Lynch have this option, but not every company 401k plan gives you the brokerage link option. It’s a powerful tool for your retirement investment accounts if you’re an active investor",
        "created_utc": 1635938224,
        "id": "hj4udwi",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635967024.0
    },
    {
        "author": "Conscious-Soil9055",
        "body": "Webull (Their app and desktop program are by far the best I've used. they lack a couple of features but they release weekly updates)\n\nFidelity (They are by far the most conservative and least risky, they will frustrate you at times but its really to stop you from doing dumb things.) Fidelity is also nice because i manage 5 different retirement accounts there.\n\nE-Trade (I've heard great things, never used or seen, but people that do rave)\n\nI just opened an account with IBKR only for the low margin rate for my long term taxable account. It is very clunky. Fidelity's simple web version blows IBKR out of the water.",
        "created_utc": 1636206432,
        "id": "hjjt2kj",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636235232.0
    },
    {
        "author": "drwhiskeyscarn429",
        "body": "Fidelity has become a bunch of bitches lately…\n\nIt’s like they don’t understand option arbitrage",
        "created_utc": 1635935855,
        "id": "hj4qz23",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635964655.0
    },
    {
        "author": "dh4645",
        "body": "I like fidelity",
        "created_utc": 1636143164,
        "id": "hjgktu1",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636171964.0
    },
    {
        "author": "internet_humor",
        "body": "\"Hello Fucktard,\n\nYou good?\n\nIte, cool\"\n\n~Fidelity",
        "created_utc": 1636168475,
        "id": "hji88ha",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636197275.0
    },
    {
        "author": "code_man_",
        "body": "Fidelity has the zero expense ratio index mutual funds.\n\nBut most people tend to argue that the Vanguard equivalent ETFs are better because they are more liquid and proven over time.",
        "created_utc": 1635829242,
        "id": "hiz78qa",
        "score": 4,
        "subreddit": "stocks",
        "created": 1635858042.0
    },
    {
        "author": "positronicsubprocess",
        "body": "I am slowly moving to fidelity but I do love the simplicity of the interface. Also I made decent money in the post IPO pop/volatility by selling covered calls on my IPO allotment",
        "created_utc": 1635976466,
        "id": "hj7es6t",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636005266.0
    },
    {
        "author": "momofuku18",
        "body": "Yup!  Plus, OP, welcome to Fidelity!",
        "created_utc": 1635974766,
        "id": "hj7aiil",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1636003566.0
    },
    {
        "author": "CHERCK_FLOKI",
        "body": "Fidelity won't let me trade 0dte options. Wtf.",
        "created_utc": 1636130498,
        "id": "hjfnk2m",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636159298.0
    },
    {
        "author": "sockalicious",
        "body": "&gt; He said he couldn't stand taking peoples money and not really offering a valuable service.\n\nYeah, he got fired.  I've been with Fidelity for 25 years and they've been nothing but great.",
        "created_utc": 1636166131,
        "id": "hji3jwu",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636194931.0
    },
    {
        "author": "Banabak",
        "body": "Yea , ton of money directed into vanguard / fidelity in 401k/ iras every two weeks",
        "created_utc": 1636079340,
        "id": "hjd8lx7",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636108140.0
    },
    {
        "author": "Grundle_Monster",
        "body": "You know what fidelity didn’t do? Expose that capital to the kind of risk that you took to make $3k",
        "created_utc": 1635978557,
        "id": "hj7jvl5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636007357.0
    },
    {
        "author": "mandykayte",
        "body": "Fidelity as well. Just make sure you enable penny stocks.",
        "created_utc": 1635878104,
        "id": "hj1keuk",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1635906904.0
    },
    {
        "author": "GiveMeMyM0ney",
        "body": "3 minute conversation with fidelity. They will know why you are calling.",
        "created_utc": 1636079452,
        "id": "hjd8uqo",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636108252.0
    },
    {
        "author": "GaylrdFocker",
        "body": "Not all Fidelity 401Ks allow that, mine did not.  Your plan still needs to make that an option, it isn't by default because you're at Fidelity.  And there are a lot more 401K companies than Fidelity, they never said they were with Fidelity.",
        "created_utc": 1636081139,
        "id": "hjdcd7b",
        "score": 4,
        "subreddit": "investing",
        "created": 1636109939.0
    },
    {
        "author": "LonelyGirlNeedsLove",
        "body": "Mann the fidelity app is just.... 😂 everytime i click on my account the little circle will spin forever and my info can never seem to load. If only Robinghood wasn't sketchy.",
        "created_utc": 1635910464,
        "id": "hj3s7dq",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1635939264.0
    },
    {
        "author": "WeenisWrinkle",
        "body": "Fidelity, Schwab, Vanguard are my 3 favorite.",
        "created_utc": 1636129790,
        "id": "hjflofi",
        "score": 4,
        "subreddit": "investing",
        "created": 1636158590.0
    },
    {
        "author": "x11onMac",
        "body": "You forgot the $150 transfer fee Robinhood eats as you transfer to fidelity hence you’ll lose 100% 😂",
        "created_utc": 1636231411,
        "id": "hjlef1a",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636260211.0
    },
    {
        "author": "sirachah",
        "body": "Well, I’m happy today. I was watching live and I never saw anything above that on fidelity. Although I do see now there was a peak of 29.10, I’m not sure if that’s a price correction. Either way, thanks to OP for hooking us up! I’m looking forward to his next play.",
        "created_utc": 1635787336,
        "id": "hiwm5ln",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1635816136.0
    },
    {
        "author": "StarfishSpencer",
        "body": "Put money in my Fidelity account to buy some NMG last week, but the cash didn't clear in time. Price went up over fifty cents this morning before I could nab some, and then promptly dropped ten after I did so. Somehow it always seems to work out like this for me, lol.",
        "created_utc": 1635781945,
        "id": "hiw9gz2",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635810745.0
    },
    {
        "author": "MajorKeyBro",
        "body": "What am I faking? I have DRS shares in the pool, and Fidelity shares I bought via IEX. But im also a retard that buys calls before the big runs.",
        "created_utc": 1635799701,
        "id": "hixgj6y",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635828501.0
    },
    {
        "author": "DudelyMore",
        "body": "It's fine. And insured. Just keep using Fidelity for everything else and pretend it's not there for a decade. That said, they charged me zero to close an outside account and transfer to them, so get on the phone and talk to one of their support staff.",
        "created_utc": 1636006796,
        "id": "hj935e4",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636035596.0
    },
    {
        "author": "Praughfet",
        "body": "Depending on the trade and reserve capital,  if  iam out of settled funds and complete a trade for say $500 profit or more,  ill wire money right back in and take the 30 fee as cost of business to have those funds ready again in 15 minutes.\n\nGFV was tricky.. i did get pinged at first , which made no sense to me\n\n i had an hour long phone call with fidelity about the GFV and the guy could flat out not answer me..   For OTC you have to trade with settled funds, a GFV is a trade made without settled funds, so how can that be....after an hour back and forth with the lackey i finally got transferred to a senior broker and was told to look at my cash available to withdraw to gauge if a GFV is possible.  no further problems.",
        "created_utc": 1635976783,
        "id": "hj7fl2d",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1636005583.0
    },
    {
        "author": "LastPotato1214",
        "body": "$900m pipe... I might regret holding, but I wouldn't mind adding on any dip.   No anpan analysis, but these dudes look long...  Janus Henderson Investors, Fidelity, BlackRock, Neuberger Berman funds, and Goldman Sachs for 200m of it.",
        "created_utc": 1636061883,
        "id": "hjc4chq",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1636090683.0
    },
    {
        "author": "_hiddenscout",
        "body": "NRDS is available to buy on Fidelity. Still on the fence on this IPO.",
        "created_utc": 1636043719,
        "id": "hjau0s6",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636072519.0
    },
    {
        "author": "kft99",
        "body": "Fidelity is very quick.",
        "created_utc": 1635951385,
        "id": "hj5lbdj",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1635980185.0
    },
    {
        "author": "_Sgushonka",
        "body": "FISV",
        "created_utc": 1635880582,
        "id": "hj1qukn",
        "score": 8,
        "subreddit": "stocks",
        "created": 1635909382.0
    },
    {
        "author": "I_love_avocados1",
        "body": "It’s most payment processors, not just PayPal. Look what’s happening to old school competitors like $EEFT, $FIS, $FISV, $GPN, not to mention $MA, and $V.",
        "created_utc": 1635864325,
        "id": "hj0m8a9",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635893125.0
    },
    {
        "author": "noname45678",
        "body": "FISV",
        "created_utc": 1635892406,
        "id": "hj2lfrk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635921206.0
    }
]