[
    {
        "author": "vierzehnter",
        "body": "the ultimate oracle",
        "created_utc": 1610382575,
        "id": "giwb8xr",
        "permalink": "/r/wallstreetbets/comments/kv61jk/the_ultimate_retard/giwb8xr/",
        "score": 253,
        "subreddit": "wallstreetbets",
        "created": 1610411375.0
    },
    {
        "author": "TheGamerHelper",
        "body": "OH GREAT ORACLE price target for BB?",
        "created_utc": 1610655613,
        "id": "gj9kj6c",
        "permalink": "/r/wallstreetbets/comments/kxdout/i_am_the_gme_oracle/gj9kj6c/",
        "score": 96,
        "subreddit": "wallstreetbets",
        "created": 1610684413.0
    },
    {
        "author": "SeanPaytonTouchMePP",
        "body": "I fucking crushed my Oracle interview boys. Hopefully only one more to go.",
        "created_utc": 1611185915,
        "id": "gk03woi",
        "permalink": "/r/wallstreetbets/comments/l1if69/what_are_your_moves_tomorrow_january_21_2021/gk03woi/",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1611214715.0
    },
    {
        "author": "brbcripwalking",
        "body": "Noobs gather around for story time.\n\nOnce upon a time, the short interest on GameStop was 140% (what in the Roth IRA fuck) and the shares hit $490.\n\nWhat does that mean?\n\nI’ll explain like we’re on a short bus on the way to space camp. Keep your arms and legs inside the vehicle all times.\n\n_____\n\nThere’s only 100 crack rocks in the streets of Compton. Then these greedy ass bloods at Melvin St ask to borrow 140 crack rocks to return later and to pay interest on those rocks even though only 100 exist.\n\nMelvin St does this without actually holding any crack because they’re not about that life. They’ll buy and return the rock when it’s cheaper in the future than when they borrowed it and pocket the change.\n\nThey do this order to drive the friendly neighborhood crack dealer GangStop out of business.\n\nMelvin St been doing this for years and when the last did this, one crack rock is worth $4. Melvin St really wants the rock to hit $0 and for GangStop to go out of business.\n\n______\n\nI love GangStop. They sell me my hood rat stuff for cheap. So I buy 10 crack rocks. My homies at Grove St Bets likes GangStop too. So they buy 10 crack rocks.\n\nThere’s only 80 rocks available in the wild now.\n\n______\n\nRyan Cohen and his gang of crips see value in this enterprise. They come in and buy up 30 crack rocks which is a controlling stake. Now there is only 50 rocks left in the wild and shorts still have to return 140 rocks. \n\nThe price of a crack rock skyrockets because Ryan Cohen promises to close underperforming corners and sell the gang shit online instead.\n\nCall options to buy a bag of crack rock at a certain price are purchased and this drives the prices up. The kingpins who wrote those contracts buy up rocks in case those calls are exercised. This is called gamma hedging.\n\n______\n\nGrove St Bets gets wind of this and /u/deepfuckingvalue the oracle of the crack rock leads the charge in buying up crack rock to fuck the nerds at Melvin St. Now there is only 30 rock available for sale.\n\nToday, a price of a crack rock is $312. And the supply of crack on the streets is dwindling. Melvin St tried their darndest to manipulate the pricing on this because they’re about to get gang banged if the debts are called in. This is called a margin call.\n\n______\n\nThe snitch ass bitches at the Citadel Community Center (who has a stake in Melvin St) called in the police commissioner at Apex Clearing House and they put pressure on Robinhood, Webull, E-Trade, etc to stop allowing the purchase of crack rock.\n\nHowever when the kingpins start gamma hedging, Melvin knows they’ll either be butt fucked or gangbanged on the street.\n\n______\n\nThey still owe 140 pieces of crack rock when there is only 100 available. On top of that rocks are held by OG Ryan Cohen, Smart institutions, GSB, and Ja Rule.\n\nMelvin St and friends will have to pay any price in order to return the rocks that they borrowed to keep their homes and are already $70b in the hole.\n\nhttps://www.reuters.com/article/us-retail-trading-shortbets-idUSKBN29X1SW?taid=6012f37e9ac87d000147d4e3\n\n______\n\nSome say the price of a rock could reach $10,000.\n\nIn order for that to happen. You must follow rule number 4 of Biggie Smalls 10 Crack Commandments. Never get high on your own supply. \n\nTLDR: Hold that shit. Cocaines a helluva drug.",
        "created_utc": 1611890666,
        "id": "gl6rm8k",
        "permalink": "/r/wallstreetbets/comments/l7ept4/daily_discussion_thread_part_6_for_january_28_2021/gl6rm8k/",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1611919466.0
    },
    {
        "author": "SeeMontgomeryBurns",
        "body": "Really I’d rather he just not say anything because as soon as he sells it breaks all momentum. It could keep going after he sells he’s not some oracle.",
        "created_utc": 1611426697,
        "id": "gkf7wp9",
        "permalink": "/r/stocks/comments/l3e54f/gme_infinite_gamma_squeeze_gap_in_option_market/gkf7wp9/",
        "score": 48,
        "subreddit": "stocks",
        "created": 1611455497.0
    },
    {
        "author": "EducationalHour9357",
        "body": "Imagine anyone other than DFV trying to claim they’re the GME Oracle.",
        "created_utc": 1610660515,
        "id": "gj9x1eg",
        "permalink": "/r/wallstreetbets/comments/kxdout/i_am_the_gme_oracle/gj9x1eg/",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1610689315.0
    },
    {
        "author": "DispassionateObs",
        "body": "How could you have known in 1999 that AAPL would develop the iPhone? This kind of regret is pure hindsight. Many big companies in 1999 like INTC, CSCO and ORCL would have given you horrible returns had you bought them.",
        "created_utc": 1610048617,
        "id": "gigjgt7",
        "permalink": "/r/investing/comments/ksic77/if_you_had_invested_in_railroads_in_1830s_britain/gigjgt7/",
        "score": 39,
        "subreddit": "investing",
        "created": 1610077417.0
    },
    {
        "author": "-__-----",
        "body": "I agree with the sentiment, but disagree with the FAANG example since Netflix isn’t even as much of a tech company as Disney is these days. They’ve always been the company that doesn’t belong in the acronym.\n\nUnfortunately my suggested acronym of Facebook, Apple, Google, Oracle, and Tesla never quite caught on.",
        "created_utc": 1611265292,
        "id": "gk3vdh0",
        "permalink": "/r/investing/comments/l1upan/heres_the_evidence_that_were_not_in_a_bubble/gk3vdh0/",
        "score": 35,
        "subreddit": "investing",
        "created": 1611294092.0
    },
    {
        "author": "AromaticTry3341",
        "body": "Credit to Oracle on the $TRIP yahoo boards for the find (not sure if you’re reading this but you’re the man)",
        "created_utc": 1611236855,
        "id": "gk25xou",
        "permalink": "/r/shroomstocks/comments/l1yqxv/psyk_etf_launch_date_january_26th/gk25xou/",
        "score": 30,
        "subreddit": "shroomstocks",
        "created": 1611265655.0
    },
    {
        "author": "leonarth",
        "body": "1) Tether is a stable coin that was first launched in 2012.   \n\nAccording to the company, Tether is backed 1:1 with the U.S dollar, although this isn't actually the case.  \n\nBitfinex, and Tether have refused to show audits of their reserves, which is held in offshore bank accounts.\n\n2) In 2019, The United States District Court sued Bitfinex, Tether, and Poloniex for being involved in a massive price manipulation, and fraud scheme in the crypto markets.\n\nIn a court hearing, Tether's lawyer admitted the stable coin was only backed by 74% cash, and securities.\n\n3) On Jan 15th 2021, iFinex is supposed to submit documents requested by NYAG's investigation. \n\nThese documents will be consequential to the case: https://iapps.courts.state.ny.us/nyscef/ViewDocument?docIndex=2AsYgvjJAsSdalpfkInbHA==\n\n4) How the scam works: \n\nTether can print infinite amounts of (worthless) $USDT. \n\nThey then inject this into BTC, ETH, LTC, (and others) to cause prices to pump.\n\nNotice how during the months they stopped printing Tether, the market moves sideways or drops significantly.\n\nhttps://pbs.twimg.com/media/Eq5RKp6XIAM0OOf?format=jpg&amp;name=medium\n\n5) The majority of funds flowing into Bitcoin is from Tether.\n\nWhen Tether ultimately meets its fate, the market will see a major correction as the lawsuit highlights how BTC isn't actually worth the insanely high prices you're seeing now.\n\nhttps://pbs.twimg.com/media/Eq5RjddWMAIRJPk?format=jpg&amp;name=medium\n\nOnce Tether is gone, it will create a liquidity crisis. The money won't just flow to other stable coins, but rather destabilize the entire market. \n\n- Exchanges will stop withdrawals\n- Trading will be paused\n- Investors will panic\n- Prices will crash as people try to sell.\n\n10) At the end of the day, nobody knows how long this scam will go on for. It could be days, weeks, months, or even years before they are shut down.\n\nBut educating yourself on whats happening is vital. I'm a huge proponent of Bitcoin, but this isn't sustainable.\n\nCredit: Jacob Oracle (https://twitter.com/JacobOracle)",
        "created_utc": 1610122589,
        "id": "gijxe2r",
        "permalink": "/r/StockMarket/comments/kt0dr6/bitcoin_rockets_past_40k_to_fresh_alltime_highs/gijxe2r/",
        "score": 23,
        "subreddit": "StockMarket",
        "created": 1610151389.0
    },
    {
        "author": "idk88889",
        "body": "Honestly, props for recognizing it dude. I know some data dudes in my org are so buried in the sand they think they're untouchable. It always baffles me really because most data analysts give sub par product even in faang and other fortune 100. It's kinda jokes that the disruptors are now ripe for disruption....\n\n\nI think of these guys as what SAP Oracle did to accounting departments. Just why do anything else? Obviously on an even more complicated, but similar org level shift of the time",
        "created_utc": 1610501706,
        "id": "gj2e6g7",
        "permalink": "/r/wallstreetbets/comments/kw53zi/this_is_what_palantir_does_a_data_analysts_take/gj2e6g7/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1610530506.0
    },
    {
        "author": "knowyourdata",
        "body": "If you're a single user or very small enterprise who isn't data heavy, you could \"probably\" do some of the things that Palantir does using Access or even Excel. That is if you only have a few thousand records (rows of data) AND a LOT of time on your hands.\n\nIf you have a lot of data you could probably also do some of the stuff with SQL or NoSQL tethered to some BI tools. But you have to be careful when your data grows.\n\nHowever, if you're already dealing with massive (terabytes) amounts of data (think cancer research, flight data, supply chains, financial transactions), and you need something that remains robust as it scales, Palantir is probably a better solution.\n\nStill, it's built on Oracle so once graph databases go more mainstream, it will likely be overtaken by real graph based solutions.\n\nThat's going to take some time though. Competitors haven't figured out how to make the storytelling aspect of graphs (links and nodes) accessible to the common user yet. Palantir has.",
        "created_utc": 1611015735,
        "id": "gjry6p5",
        "permalink": "/r/stocks/comments/kzxdi4/can_anyone_who_has_used_palantir_let_us_know_your/gjry6p5/",
        "score": 21,
        "subreddit": "stocks",
        "created": 1611044535.0
    },
    {
        "author": "accumelator",
        "body": "Disclaimer : I am a Vito convert.\n\nFor me confirmation bias on $MT and other steel related tickers is visible on the all time chart, rather similar to the $GME 3 towers.\nI am also in a good position already as i have a 0$ base cost because i rolled up gains to March expirations along the rise of the foot of the $X mountain before our amazing steel oracle Vito shared his wisdom here",
        "created_utc": 1610821488,
        "id": "gjhkgzy",
        "permalink": "/r/wallstreetbets/comments/kyn7sf/steel_company_arcelormittal_mt_is_a_steal_hrc/gjhkgzy/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1610850288.0
    },
    {
        "author": "sunlisun",
        "body": "[CALL ME THE FUCKING ORACLE](https://www.reddit.com/r/wallstreetbets/comments/l7v9o8/gme_what_about_second_breakfast_club_megathread/gla6i1u/?utm_source=reddit&amp;utm_medium=web2x&amp;context=3)",
        "created_utc": 1611950903,
        "id": "gla722c",
        "permalink": "/r/wallstreetbets/comments/l7s631/gme_breakfast_club_megathread/gla722c/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1611979703.0
    },
    {
        "author": "I_had_corn",
        "body": "You are either an oracle or the luckiest son of a bitch alive. Either way, fuck you. Amazing job!",
        "created_utc": 1610171564,
        "id": "gimpdm1",
        "permalink": "/r/wallstreetbets/comments/ktl1y0/real_tsla_og_du11_18500/gimpdm1/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1610200364.0
    },
    {
        "author": "truemeliorist",
        "body": "Just piggybacking this - make sure you know what sort of things you want to overweight in the tech sector, and then compare that to the holdings against VGT.\n\nTech covers a lot of areas. What does \"tech\" mean to you? \n\nVGT is companies like Microsoft, Oracle, Apple, Visa, etc. All rock solid companies. But, they're almost all well established with large market caps.\n\nIf you are looking for disruptive small tech companies that haven't hit the hockey stick yet, VGT isn't what you are looking for. And you'd be dismayed to see a lot of those are also excluded from vanguard small cap funds like VB as well.\n\nIt helps to know what you are looking for and why.",
        "created_utc": 1611016241,
        "id": "gjrz42e",
        "permalink": "/r/investing/comments/l075vk/is_vgt_with_vti_redundant/gjrz42e/",
        "score": 19,
        "subreddit": "investing",
        "created": 1611045041.0
    },
    {
        "author": "MasterKongQiu",
        "body": "Post your returns then if you’re such an oracle.",
        "created_utc": 1611876936,
        "id": "gl5wyn3",
        "permalink": "/r/wallstreetbets/comments/l791gh/who_stopped_the_losses_for_the_millions_who_lost/gl5wyn3/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1611905736.0
    },
    {
        "author": "MewBlood",
        "body": "This is my view, too. This also means, and I hope you agree, looking to the short interest oracle [Ihor Dusaniwsky's daily GME bulletin on Twitter](https://twitter.com/ihors3) for authoritative confirmation as to whether and when the short sellers are indeed covering.",
        "created_utc": 1611802003,
        "id": "gl1f6xf",
        "permalink": "/r/wallstreetbets/comments/l6k7mw/in_case_the_sub_goes_quiet_just_hold/gl1f6xf/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1611830803.0
    },
    {
        "author": "BinaryIdiot",
        "body": "I've worked with them. They're closer to an Oracle, traditional tech company than a new, shiny, grow fast tech company IMO.\n\nTheir product let's the military, police departments, etc ingest lots of data then work out the relationships between disparate pieces of data to create basically a playground for any folks in analytics. For example you might pull a phone off someone in Iraq at a checkpoint, upload the data, find it has the phone number in the contact list for another phone that was used in a bombing.\n\nStuff like that. It's very useful and the government has tried to replace it _multiple times_ but their attempts are usually not as good and then their funding gets cut after paying hundreds of millions to government contractors. I would know, I was one of those contractors a long time ago lol.\n\nIt's a solid company. I think it'll moderately grow. I don't think it'll explode-y grow, though, because it has already heavily saturated its target market. But that's just like my opinion or something.",
        "created_utc": 1609634307,
        "id": "ghvquay",
        "permalink": "/r/wallstreetbets/comments/kp66wf/it_literally_cant_go_tits_up/ghvquay/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1609663107.0
    },
    {
        "author": "SeanPaytonTouchMePP",
        "body": "Made it to the final Oracle interview. I can smell the tendies boys",
        "created_utc": 1611377731,
        "id": "gkaqsp3",
        "permalink": "/r/wallstreetbets/comments/l2wx2p/weekend_discussion_thread_for_the_weekend_of/gkaqsp3/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1611406531.0
    },
    {
        "author": "dark_bravery",
        "body": "fucking oracle. $30.22\n\ni bow beneath you great retarded oracle. shower me with your blessings!",
        "created_utc": 1611340697,
        "id": "gk7vtsg",
        "permalink": "/r/wallstreetbets/comments/l2phbo/sold_all_my_tsla_for_pltr/gk7vtsg/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1611369497.0
    },
    {
        "author": "uraniumguy",
        "body": "I can't answer that for you because I'm not an oracle. Ask yourself why you bought in the first place, what kind of due diligence did you do on the stock and what has changed that would cause you to sell. For me Uranium is a long term hold so I'm not looking at selling any of my positions for at least 3-5 years. It sounds like you were hoping for a quick bump and nothing more so yes in that case maybe you should sell. However, if you believe in the Uranium thesis this morning's price for URG is not a bad entry point moving into the future.",
        "created_utc": 1610587579,
        "id": "gj6i13m",
        "permalink": "/r/pennystocks/comments/kwpx24/the_macro_business_case_for_uranium/gj6i13m/",
        "score": 14,
        "subreddit": "pennystocks",
        "created": 1610616379.0
    },
    {
        "author": "geomanis",
        "body": "It's like any outsourcing company really, they get stuck into a critical business unit and then keep finding ways to expand into additional areas of your organisation. The key difference is that it's easy to fire an entire outsourcing company and hire internally, it's hard to get this piece out when all your sensitive information are stored in it and middle management are completely sold on it. This is more Microsoft with Office, than Oracle. :)",
        "created_utc": 1611023931,
        "id": "gjsdicr",
        "permalink": "/r/wallstreetbets/comments/l07ly5/dd_pltr_foundry_explanation_from_reformed_data/gjsdicr/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1611052731.0
    },
    {
        "author": "razpotim",
        "body": "So shit trades within 30 cents for 4 months, and then pops, and after it pops you claim your oracle status on it? Yea fuck off ain't holding your bag on this one.",
        "created_utc": 1610478044,
        "id": "gj11e1h",
        "permalink": "/r/wallstreetbets/comments/kvuqog/from_the_guy_who_first_brought_you_pltr_i_now/gj11e1h/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1610506844.0
    },
    {
        "author": "SeanPaytonTouchMePP",
        "body": "Interview with Oracle tomorrow. Wish me luck so I can use my income to buy GME shares",
        "created_utc": 1611105948,
        "id": "gjwaed4",
        "permalink": "/r/wallstreetbets/comments/l0t44g/what_are_your_moves_tomorrow_january_20_2021/gjwaed4/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1611134748.0
    },
    {
        "author": "9tacos",
        "body": "They basically are the original SaaS cloud providers.  They really created the business model with their universally extensible schema design on Oracle.  Layered on top of their base CRM, their model based application development environment is very customizable, proprietary and ensures complete vendor lock-in.  Once enterprises are on boarded they are pretty much a guaranteed revenue stream for a long time.  Switching costs are huge. They have a great ecosystem, community and actively make good strategic acquisitions.  \n\nIt’s a very good business with a solid moat.",
        "created_utc": 1609725916,
        "id": "gi0ui7u",
        "permalink": "/r/stocks/comments/kpydlc/what_makes_salesforce_different_from_the_pack/gi0ui7u/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1609754716.0
    },
    {
        "author": "Funkymonkeyhead",
        "body": "Man if the Oracle of Omaha jumps into this (he won't lol), GME is gonna balloon to $1k in one trading day haha.",
        "created_utc": 1611437545,
        "id": "gkg6evr",
        "permalink": "/r/wallstreetbets/comments/l3fye9/how_fridays_gme_gamma_squeeze_may_trigger_a_short/gkg6evr/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1611466345.0
    },
    {
        "author": "downneck",
        "body": "Fuck Oracle.",
        "created_utc": 1610475024,
        "id": "gj0unes",
        "permalink": "/r/wallstreetbets/comments/kvvw1y/orcl_2021_moon_landing/gj0unes/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1610503824.0
    },
    {
        "author": "ChripyLloins",
        "body": "BOYS HELP ME-I WANT IN! I HAVE NO IDEA WHAT IM DOING! POINT ME TOWARDS AN ORACLE!!!",
        "created_utc": 1611932436,
        "id": "gl8qucl",
        "permalink": "/r/wallstreetbets/comments/l7ptxi/daily_discussion_thread_for_january_29_2021/gl8qucl/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1611961236.0
    },
    {
        "author": "SecretPeanutButter",
        "body": "PLTR feels like the Oracle of old (gets hooks in deep) and I fucking love it",
        "created_utc": 1611023202,
        "id": "gjsc42u",
        "permalink": "/r/wallstreetbets/comments/l07ly5/dd_pltr_foundry_explanation_from_reformed_data/gjsc42u/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1611052002.0
    },
    {
        "author": "ThrasherLA",
        "body": "AirBnb, Uber, Lyft, DoorDash, Google, Facebook, Pinterest etc...if they’re a big startup you can assume they’ve all got top notch workers. Then there are 100+ series A-D companies with 100-500 workers that are filled with ex-googlers and facebookers betting on themselves and the companies.\n\nIn the case of Palantir, they must have an awesome new grad program and pay them a ton, as I’m sure those Harvard grads are getting offers from Facebook but they end up going PLTR.\n\nSurprisingly, it’s the older giant tech companies like Cisco, Oracle, eBay and PayPal whose engineers aren’t as highly coveted. Older tech stacks, slower pace, compartmentalization or roles all play a part.",
        "created_utc": 1611012778,
        "id": "gjrsrcf",
        "permalink": "/r/stocks/comments/kzxdi4/can_anyone_who_has_used_palantir_let_us_know_your/gjrsrcf/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1611041578.0
    },
    {
        "author": "visionridge",
        "body": "Well, a month ago not everyone was saying \"glory be GHIV\". Some were pointing out the mortgage is approaching a cyclical top and that professional investors and long-term retails investors, being aware of that, were less enthusiastic and so less would be jumping into the SPAC pre-merger, no matter how much is was \"willed\" into going up. Writing seemed to always be on the wall. But my point isn't to start and argument about that one SPAC. my point is that even when there are legitimate headwinds that can stifle non-SPAC focused traders/investors to enter pre-merger, and is really a strong source of pre-merge push, those voices are drowned out and down-voted, and literally called clueless. \n\nSo yeah, for any given SPAC, most seem driven by the next shiny toy, as as I put it, the appearance of the next \"Squirrel\", which grabs everyone's attention as they chase trying to get in early and eventually leave at the top. This is great for bragging rights, or ego, or trying to back up their claim of being some oracle or whatever, but actually hurts profits. Focus on raw % gains, or net gain, on a single (or few) all-in moon shots doesn't maximum gains. It favors ego over profit. I'll focus on the latter personally.",
        "created_utc": 1610983215,
        "id": "gjq5lha",
        "permalink": "/r/SPACs/comments/kzw3k0/be_careful_of_chasing_the_next_shiny_toy/gjq5lha/",
        "score": 9,
        "subreddit": "SPACs",
        "created": 1611012015.0
    },
    {
        "author": "its_logan75",
        "body": "\\- The guy who drank his own piss\n\n\\- Gordon the gecko\n\n\\- The shrimp oracle\n\n\\- Tanker gang\n\n\\- The shitting dog\n\n\\- The mod coup",
        "created_utc": 1611956775,
        "id": "glanmf3",
        "permalink": "/r/wallstreetbets/comments/l84ner/for_those_who_have_been_around_for_a_while_what/glanmf3/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1611985575.0
    },
    {
        "author": "VoidBiscuit",
        "body": "But then she has you, it's our duty in tech to educate people, and instead of educating people we're saying \"you're so bad at tech\".\n\nSame as boomers going \"you're my son and you can't even check your engine oil levels, or check a washing machine filter\" AYE TEACH ME THEN YE ORACLE.",
        "created_utc": 1612108902,
        "id": "glhmzud",
        "permalink": "/r/stocks/comments/l98jee/gme_end_financial_culture_how_this_meme_is/glhmzud/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1612137702.0
    },
    {
        "author": "Power80770M",
        "body": "I was also there for it, having opened my first brokerage account in '98 or '99. Lost most of the college summer money I made buying high flyers like EMC.\n\nOne argument I hear from people nowadays it's that \"it's nothing like dotcom, the high flyers today are actually PROFITABLE!\" This argument implies two things:\n\n* The only high flyers back then were companies with no profits; and \n* There aren't many money-losing high flyers today\n\nBoth of those ideas are patently false. Back then, most profitable companies had insane valuations; and there were the \"Four Horsemen\" - Microsoft, Oracle, Cisco, Dell - that were hugely profitable AND had truly insane valuations. Also, there are a huge number of money losing companies nowadays. Look at any IPO of the past year - look at the entire SaaS industry - huge money losers all around. \n\nIt's not different this time. It will come crashing down.",
        "created_utc": 1610135815,
        "id": "gikrdu3",
        "permalink": "/r/wallstreetbets/comments/kt26ao/its_beginning_to_be_hard_to_argue_we_arent_in_a/gikrdu3/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1610164615.0
    },
    {
        "author": "thetagodfather",
        "body": "IBM isn't really a dinosaur, it's just their top line revenue keeps shrinking, and their marketing sucks, but they still make a crazy amount of money.\n\nThey are not a consumer facing company where all the eye candy lives, but are very entrenched in enterprise markets behind the scenes with lots of software, services, and hardware.\n\nThey also have a ridiculous amount of research going on all the time and are a patent churning machine.\n\nWith tech you really just need to look at companies you know and understand, and with IBM, they are so behind the scenes that they don't get much love, but are pretty steady.\n\nI looked at puts today and the premium even after the drop was terrible, that shows how steady they are.\n\nThat being said, they do need to work on their brand image and marketing and get people excited about them again. I put them up there with HP, Oracle, and SAP in terms of how boring they are. Some technology companies actually act like utilities in this day and age. Microsoft fell into this camp, but under Satya they have broken out and gotten exciting again.",
        "created_utc": 1611371700,
        "id": "gkac4n0",
        "permalink": "/r/stocks/comments/l300nh/experienced_investors_before_2010_how_to_identify/gkac4n0/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1611400500.0
    },
    {
        "author": "Hi_Im_Wall",
        "body": "I'VE CONSOLTED THE ORACLE AT DELPHI, AS ALL GREAT GREEK HEROS DO.\n\n&amp;#x200B;\n\nSHE SAID TO KEEP HOLDING YOU RETARD, WE'RE GONNA GO SEE ARTEMIS.",
        "created_utc": 1611759650,
        "id": "gkycuvf",
        "permalink": "/r/wallstreetbets/comments/l65p3u/the_gme_thread_part_2_for_january_27_2021/gkycuvf/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1611788450.0
    },
    {
        "author": "Highzenbrrg",
        "body": "I, too, have taken a gander at their numbers and am fully erect. But doth the oracle dare utter those sultry words that bankrupt gods and collapse stars, \"It's priced in.\"",
        "created_utc": 1610945831,
        "id": "gjovcxi",
        "permalink": "/r/wallstreetbets/comments/kzjyoy/a_plea_to_jeff_bezos_regarding_the_departure_of/gjovcxi/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1610974631.0
    },
    {
        "author": "DaRealMkKoy",
        "body": "Since you’re a fucking Oracle how much did you make?",
        "created_utc": 1611371080,
        "id": "gkaaxxs",
        "permalink": "/r/wallstreetbets/comments/l33fii/steak_and_lobster_tonight_brought_to_you_pltr/gkaaxxs/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1611399880.0
    },
    {
        "author": "Reluctant_Firestorm",
        "body": "I am not a financial person but a retard or maybe a drunkard who has been drinking riesling. But what you say here sounds rather risky. \n\nThe squeeze could take many many days. Consult your oracle. Sift through some goat innards. Goat innards are seldom wrong, in my opinion.",
        "created_utc": 1611887718,
        "id": "gl6l4ds",
        "permalink": "/r/wallstreetbets/comments/l7fw0x/i_used_to_work_merrill_heres_what_likely_happened/gl6l4ds/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1611916518.0
    },
    {
        "author": "Vepper",
        "body": "Same here, like Socrates and the Oracle of Delphi. I know when I know nothing and when I'm too retarded to do options. But WSB has shown me the way to working smarter with my money, rather then shoving it in a savings account, I'm up 25%.",
        "created_utc": 1611430498,
        "id": "gkfk95r",
        "permalink": "/r/wallstreetbets/comments/l30tps/boomer_old_money_has_bled_and_will_get_dirty/gkfk95r/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1611459298.0
    },
    {
        "author": "Humble_Luck",
        "body": "GOOD MORNING ORACLE!  👳‍♂️",
        "created_utc": 1612030677,
        "id": "gle3cd3",
        "permalink": "/r/wallstreetbets/comments/l8lxuy/if_your_friends_and_family_are_wondering_why/gle3cd3/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1612059477.0
    },
    {
        "author": "Misaiato",
        "body": "Kind of a big statement to unpack.  BB has released themselves of the burden of their cell phone line of business.  They can focus on their cloud platform for big data now.  They have some great partnerships in the works, and you might think of them as something like MS was to hardware in the 90s when it comes to big data and automotive.  \n\nOne example - if TSLA is like Apple - a company that wants to build their own hardware and software so that everything is tightly integrated, and if it's difficult for a hardware company to simply \"get good\" at software (it is), then it makes a lot of sense for a company like BB to step in and fill that void.\n\nhttps://www.blackberry.com/us/en/company/newsroom/press-releases/2019/blackberry-qnx-software-now-embedded-in-more-than-150-million-vehicles#:~:text=Automotive%20OEMs%20and%20tier%20ones,%2C%20KIA%2C%20Maserati%2C%20Mercedes%2D\n\n150 million cars have embedded the QNX platform now.  So if TSLA gets to self-driving by having a lot of their own cars on the road, imagine how much quicker these companies can get there using collective data mining from ALL the cars they're making.  \n\nRight now - they're making use of QNX for other purposes - but the software is already there.  The connectivity and interoperability and the _contracts_ are there.  For a company that's good at software, it's a simple thing to build more functionality to support new needs.  For a company that's good at hardware, you just keep making good hardware and win customers as you always have.\n\nRecall that MS rose to prominence because Gates and Co. saw a path to making great software that worked on any hardware - while these hardware companies were trying to make their own software suites to compete with each other.  Only Apple really survived in the PC space (you could argue Sun went the distance, perhaps you can argue it for IBM and Oracle, though I think they were players in hardware / software to different degrees).  \n\nThere are some big challenges that need solving in the next decade.  For the automotive space, TSLA isn't going to solve those challenges for all drivers.  Mercedes isn't going away.  Toyota isn't going away.  There are entire cities in Germany where I haven't seen anything else but BMWs.  So who is going to step in and augment those companies with software expertise?\n\nIt very well may be Blackberry.",
        "created_utc": 1611354065,
        "id": "gk91ad2",
        "permalink": "/r/wallstreetbets/comments/l2qxlz/bb_gang_check_in_bought_at_highs_like_true_retard/gk91ad2/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1611382865.0
    },
    {
        "author": "lIlIlIlIlIlII",
        "body": "I made $20 with $6000 in 10mins just now , that is .33% return , I'm better than the Oracle of Omaha",
        "created_utc": 1610412081,
        "id": "giy3u5e",
        "permalink": "/r/wallstreetbets/comments/kvbz8z/what_are_your_moves_tomorrow_january_12_2021/giy3u5e/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1610440881.0
    },
    {
        "author": "feedthebear",
        "body": "American Airlines\nCrocs\nFitbit\nKraft Heinz\nCoke\nNio\nOracle\nOtis\nPfizer\nTwitter\nCIG\nGoing to buy some PLTR.\n\nTo be honest, I admittedly know nothing about fundamentals so just went with brands I'm aware of to ease into it.",
        "created_utc": 1610986913,
        "id": "gjqcj99",
        "permalink": "/r/wallstreetbets/comments/kzvviv/siri_wondering_why_its_monday_and_i_havent_opened/gjqcj99/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1611015713.0
    },
    {
        "author": "rockhardrockcrawler",
        "body": "Hey algos:\n\n&amp;nbsp;\n\n\nSBUX\n\nUPS\n\nCRSR\n\nKO\n\n&amp;nbsp;\n\nMSFT\n\nYUM\n\n&amp;nbsp;\n\nCMG\n\nORCL\n\nCAT\n\nKSS",
        "created_utc": 1610040271,
        "id": "gig0c8y",
        "permalink": "/r/wallstreetbets/comments/ksb2ks/daily_discussion_thread_for_january_07_2021/gig0c8y/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1610069071.0
    },
    {
        "author": "FatCatBoomerBanker",
        "body": "No way Oracle, the most boomer of all tech companies, is gaining 50% market cap this year. They might end the year in the low 70s, but if you are banking on 90-100 to profit on leaps, then you cray-cray.\n\n65/70c or 65/75c Jan 2022 debit spreads are probably a safer bet if you are bullish on them.",
        "created_utc": 1610479789,
        "id": "gj158ar",
        "permalink": "/r/wallstreetbets/comments/kvvw1y/orcl_2021_moon_landing/gj158ar/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1610508589.0
    },
    {
        "author": "moblo231",
        "body": "I have consulted the oracle. Every autist here that needs a YOLO for open... Ford. 9 dollar 0dte. They trade at breakeven. I’ve never lost an F trade. \n\nTldr buy 1/8 Ford 9c at open\n\nFord",
        "created_utc": 1610095805,
        "id": "giivu3x",
        "permalink": "/r/wallstreetbets/comments/ksmmx6/what_are_your_moves_tomorrow_january_08_2021/giivu3x/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1610124605.0
    },
    {
        "author": "hammydwnjizzblanket",
        "body": "Look at the fancy oracle that was able to read an article and interpret its meaning",
        "created_utc": 1609728642,
        "id": "gi0zv9t",
        "permalink": "/r/wallstreetbets/comments/kpsy0b/what_are_your_moves_tomorrow_january_04_2021/gi0zv9t/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1609757442.0
    },
    {
        "author": "CrossFitBoi",
        "body": "Damn. That’s just a series of bad luck. You’ll be the wisened old oracle. They’ll trot you out at investor meetings to tell the dark side of risk.",
        "created_utc": 1611981788,
        "id": "glc3ow3",
        "permalink": "/r/investing/comments/l7zx7k/why_is_appl_stock_falling_after_a_blowout_quarter/glc3ow3/",
        "score": 5,
        "subreddit": "investing",
        "created": 1612010588.0
    },
    {
        "author": "LifeAfterHarambe",
        "body": "IHOR IS THE ORACLE - \"most if the GME shorts are NOT covering... In actuality, total net shares shorted hasn't moved all that much.\"",
        "created_utc": 1611953207,
        "id": "gladnyt",
        "permalink": "/r/wallstreetbets/comments/l81n15/gme_afternoon_pajama_party_megathread/gladnyt/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1611982007.0
    },
    {
        "author": "Jastook",
        "body": "\" **IBM**, **Cisco**, **TMobile**, **JPMorgan**, **Oracle**, and **ZipRecruiter**. Their parent company is [NBCUniversal](https://en.wikipedia.org/wiki/NBCUniversal), owned by **Comcast** and **GE**. \"  \n\n\nBoycott these companies.",
        "created_utc": 1611819332,
        "id": "gl296v3",
        "permalink": "/r/wallstreetbets/comments/l6omry/an_open_letter_to_melvin_capital_cnbc_boomers_and/gl296v3/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1611848132.0
    },
    {
        "author": "fordanguyen",
        "body": "I don’t understand where tf this PLTR perception of their talent came from. They are nowhere near FAANG/Microsoft or Airbnb type unicorn talent. Maybe capital one.\n\nI still think they’re a solid bet but their future is maybe the next oracle. This isn’t a commentary on their share value price but everyone who thinks they are the most desirable company is wrong. They’re a stepping stone to the next level and can’t hold any talent.",
        "created_utc": 1609695439,
        "id": "ghz1hyl",
        "permalink": "/r/wallstreetbets/comments/koiz6w/weekend_discussion_thread_for_the_weekend_of/ghz1hyl/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1609724239.0
    },
    {
        "author": "styledliving",
        "body": "tbf, they started working w/ ncmec since 2010 and signed a contract w/ ICE in 2014.  It wasn't until 2015 when they had a full implementation going.  I learned some of this stuff doing DD prior to the PLTR \\*DPO.\n\nICE actually has two completely separate divisions in what they do in terms of business function/responsibility/jackasses running it: \n\n* HSI, Homeland security investigations, they look for foreign criminals and criminal acts.\n* ERO, Enforcement and Removal Operations, they having nothing better to do than deport people who don't have citizenships.\n\nOriginally the contract was only to support HSI.  They were working on breaking up importation violations w/ CBP, Customs and Border Protection (under the DHS umbrella that ICE also exists under along w/ secret service, OIG, Coast Guard, TSA, FEMA, USCIS) and work w/ local LE to identify people in criminal rings in illegal importation of drugs, non-CARB legal Skyline GT-Rs, Silvias, AE86s, and other drift cars, gang/cartel activity including human trafficking.\n\nERO got a hard-on (erection/sexual arousal) when they found out about Palantir's capabilities and walked over to their HSI buddy cubicles and started shoulder surfing PLTR and eventually just taking over by using the platform for their own investigations.\n\nThis all began under the Obama administration.  So I mean, I get that the United States should be developing best in class stuff so we can keep up with foreign governments.  But it speaks volumes that our administration (bipartisan) would do this kind of BS.\n\nLike China has MiningLamp which is supposed to be a data analytics platform comparable to Palantir.  And now w/ the stolen F35 lightning plans, they have their own facsimile (look up the Shenyang J31).  So \"foreign adversaries\" aka \"foreign trade partners\" are on the same or similar level to us, blame foreign espionage, blame globalism, if humanity was equal in terms of tech and trade, there'd be no problem.\n\nIf we're really pissed off about the comings and goings of the United States' actions, we should dump the assholes in Congress, Senate, and Executive leadership to figure out a way that doesn't involve inciting revolution, installing shill gov'ts, and drone bombing people the opposition to keep a hold on oil.  \n\nData analysis platforms are just going to get more important as the years go by.  Data analysis has been the next gold rush for the past decade and a half with Facebook, Google, Amazon, Oracle, AdTech, Medical Research, and other companies using the data to streamline operations, manufacturing, production, research, and sales.  \n\n*Punishing Palantir for witchcraft is akin to fearing doctors because bloodletting used to be a thing.*\n\n**Palantir is going to the moon first** before everyone else cuz they were fucking *tits deep* in this stuff since 2004.  And they'll continue to be tits deep before anyone even gets balls deep.\n\nIt's like Tesla and electric vehicles.  \n\nOnly now is GM (Nikola lol), Ford (Rivian), and other manufacturers trying to get in.  But Tesla's bottom up approach, listening to consumers, is destroying all the other car manufacturers (because traditional big AF car companies do a top down approach by having marketing teams making assumptions of what consumers really care about).\n\nUltimately, we don't need to shill WSB to get people to invest, we're already doing that.  What is important is to help \"Main street\" understand the implications.  Palantir has a bipartisan pass.  AOC is raising concerns, but is doing it for clout.  If she was in a presidential position, she'd be riding the PLTR Train to the moon too.\n\nPLTR doesn't need rockets to get to the moon.  They built the fucking railroad to get there.\n\n\\--\n\n\\*because I keep calling it an IPO by accident when it was a direct listing",
        "created_utc": 1609549587,
        "id": "ghs3lus",
        "permalink": "/r/wallstreetbets/comments/komfm6/pltr_shill_post_fighting_child_exploitation/ghs3lus/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1609578387.0
    },
    {
        "author": "Trueslyforaniceguy",
        "body": "Look at it this way. They cut off almost every retail broker at some point today, and that was still only 30-50% of the buying pressure.  Tomorrow is going to roar.  I also heard short restriction is now in place, as per the dip.  If only there was some aged Oracle from Omaha who could provide some guidance on what to do during a dip?  Warren, what should one do during a dip?  Anyone?\n\n🚀",
        "created_utc": 1611876948,
        "id": "gl5wzm7",
        "permalink": "/r/wallstreetbets/comments/l7a5gd/hello_again_my_gme_bulls_while_we_have_some/gl5wzm7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1611905748.0
    },
    {
        "author": "wakka54",
        "body": "It's not just shorts they're squeezing. The short squeeze is over as far as WSB is concerned. They're in a gamma squeeze now, which refers not to shorters, but to call sellers and put buyers.\n\nAt this point they're scheduled to squeeze the options sellers who sold calls that expire friday at market close. The brokers legally must ensure those clients can hand over the shares by Saturday. This means the brokers are going to force liquidate their clients and buy GME at whatever the market price is no matter what. If things go as they seem to be going, the price will skyrocket in the afternoon and afterhours Friday, the folks with GME will sell their shares as astronomical prices, and by extended hours close the price will either crash to double-digits or be astronomical, then crash to double digits monday pre-trading hours. At least that's how I envision tomorrow is going to go. I'm no oracle.",
        "created_utc": 1611902430,
        "id": "gl7ensv",
        "permalink": "/r/options/comments/l7cqnq/mms_may_be_unable_to_write_new_contracts_tomorrow/gl7ensv/",
        "score": 5,
        "subreddit": "options",
        "created": 1611931230.0
    },
    {
        "author": "TenCity",
        "body": "THE FUCKING ORACLE",
        "created_utc": 1611950978,
        "id": "gla79yv",
        "permalink": "/r/wallstreetbets/comments/l7s631/gme_breakfast_club_megathread/gla79yv/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1611979778.0
    },
    {
        "author": "HippieCrackInStreet",
        "body": "After seeing the roadster and reading Elon’s blog I was sold on EV. No oracle needed, just a bit of vision and conviction to hold.",
        "created_utc": 1610176902,
        "id": "gimw8mh",
        "permalink": "/r/wallstreetbets/comments/ktl1y0/real_tsla_og_du11_18500/gimw8mh/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1610205702.0
    },
    {
        "author": "GodPebbz",
        "body": "imagine believing BABA media manipulation while oracle is still waiting for their TikTok acquisition LMAO",
        "created_utc": 1610005939,
        "id": "gielbdc",
        "permalink": "/r/wallstreetbets/comments/krx2od/what_are_your_moves_tomorrow_january_07_2021/gielbdc/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1610034739.0
    },
    {
        "author": "creusifer",
        "body": "We all do. Saxon is the Oracle",
        "created_utc": 1610218682,
        "id": "gioiqjy",
        "permalink": "/r/wallstreetbets/comments/ktbnq4/weekend_discussion_thread_for_the_weekend_of/gioiqjy/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1610247482.0
    },
    {
        "author": "kitty_skittles",
        "body": "yeah, there's a difference between a mechanism to record a transaction (the infrastructure) between two parties and the thing being transferred. it's like an oracle db or whatever isn't the value of all the transaction records stored inside it.",
        "created_utc": 1609807714,
        "id": "gi4mz8n",
        "permalink": "/r/investing/comments/kqljwk/us_treasury_occ_will_allow_us_banks_to_use_public/gi4mz8n/",
        "score": 4,
        "subreddit": "investing",
        "created": 1609836514.0
    },
    {
        "author": "ApolloFirstBestCAG",
        "body": "Someone asked me on Monday what I thought TSLA would be EOW\n\nI said $850.\n\nCall me the oracle",
        "created_utc": 1610679632,
        "id": "gjayggn",
        "permalink": "/r/wallstreetbets/comments/kxenqf/what_are_your_moves_tomorrow_january_15_2021/gjayggn/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1610708432.0
    },
    {
        "author": "bigkev2569",
        "body": "2020: Stimmy talks, vaccine talks, Tik Tok talks (Oracle, WMT, MSFT), trade talks.  What a year!!",
        "created_utc": 1611473168,
        "id": "gkib2rd",
        "permalink": "/r/wallstreetbets/comments/l2wx2p/weekend_discussion_thread_for_the_weekend_of/gkib2rd/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1611501968.0
    },
    {
        "author": "n0xx_is_irish",
        "body": "Add Oracle and it's FAGMOAN",
        "created_utc": 1611887879,
        "id": "gl6lh16",
        "permalink": "/r/wallstreetbets/comments/l7bh1m/not_sure_if_anyone_posted_this_here_but_yikes/gl6lh16/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1611916679.0
    },
    {
        "author": "Raptor851",
        "body": "I like how oracle was too evil for even them to touch.",
        "created_utc": 1612110232,
        "id": "glhpp8w",
        "permalink": "/r/wallstreetbets/comments/l9czx4/this_is_what_covering_their_ass_looks_like/glhpp8w/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1612139032.0
    },
    {
        "author": "Environmental_Ear403",
        "body": "It might be because the Chairman of ORCL, Larry Ellison, is a friend of Trump's.",
        "created_utc": 1612018527,
        "id": "glde78g",
        "permalink": "/r/wallstreetbets/comments/l80upw/daily_discussion_thread_for_january_29_2021_part/glde78g/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1612047327.0
    },
    {
        "author": "Danilieri",
        "body": "The story behind cassandra is really good. Basically she is an oracle that can tell the future, but sadly she is cursed to never be believed!",
        "created_utc": 1611802340,
        "id": "gl1fxpb",
        "permalink": "/r/wallstreetbets/comments/l6jhzr/thank_you_dr_burry/gl1fxpb/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1611831140.0
    },
    {
        "author": "naked_nano",
        "body": "Oracle is a dead company only running on customer's fear for an audit. Everyone hates Oracle.",
        "created_utc": 1610869865,
        "id": "gjk234h",
        "permalink": "/r/stocks/comments/kz0hc1/what_stocks_do_you_think_will_reach_a_1_trillion/gjk234h/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1610898665.0
    },
    {
        "author": "My_Papa_Is_Elon_Musk",
        "body": "I hope Trump makes twitter sell itself to oracle",
        "created_utc": 1610270472,
        "id": "giqzi2j",
        "permalink": "/r/wallstreetbets/comments/ktj3oa/temporary_politics_thread_youre_all_getting_on/giqzi2j/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1610299272.0
    },
    {
        "author": "eatingyourmomsass",
        "body": "Lol my man if anybody knew the answer to that definitively they’d be rich and called an oracle.",
        "created_utc": 1611965744,
        "id": "glb7ojr",
        "permalink": "/r/pennystocks/comments/l7jcxx/im_urging_you_to_read_if_you_own_amc/glb7ojr/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1611994544.0
    },
    {
        "author": "Jabadu",
        "body": "Plus boomer Oracle Will Meade (called GME to WSB) said it’s next lol long haul baby",
        "created_utc": 1611353226,
        "id": "gk8yygl",
        "permalink": "/r/wallstreetbets/comments/l2y2o9/expr/gk8yygl/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1611382026.0
    },
    {
        "author": "ubanuban",
        "body": "I use snowflake at work everyday and I can talk about the product. It is awesome, no other db comes close. It will get adopted very quickly and the growth rate will sustain. The competition from Microsoft (synapse) is old wine in a New bottle. Oracle tries to put wrappers around their old software to create new product, it is bloated to the core. Snowflake is replacing datawarehouse and data lake at our work. Most apache projects need lot of infra support understanding of things that make adoption and maintenance a nightmare. Snowflake is after growth so they are spending huge on sales and marketing. Additionally, check data sharing and data marketplace features of snowflake. Those allow data sharing between companies without etl. Marketplace allows companies to sell data to others using snowflake cloud. The revenue from this could be huge similar to app store.  I was surprised with the valuation at ipo but feel like it is still better than a lot of companies.",
        "created_utc": 1611372588,
        "id": "gkadr6h",
        "permalink": "/r/investing/comments/l2dy6k/most_overvalued_companies_and_why/gkadr6h/",
        "score": 3,
        "subreddit": "investing",
        "created": 1611401388.0
    },
    {
        "author": "RogueJello",
        "body": "That's probably one of the best bear cases I've seen against INTC, I'll keep your points in mind.\n\nFab costs- I don't see how INTC survives without a fab.  If they do go fabless like AMD, I'd expect them to go down pretty quick.  It's the reason why they're able to get such high margins, it's what their entire design process is built around, and it's likely what's allowing them to maintain market share while AMD and NVidia face supply shortages.  However, you do raise a good point about ongoing costs.\n\nFab Under-utilitization.  Seems like they've gotten a ton of product out of 14 nm, to the point that it's become a running joke.  I heard your point about them not selling space to other companies, but this seems to be partially because nobody wants that space.  TSMC is the fab everybody goes to because they're not producing their own products, Intel has no such claims.\n\nToxic Culture - I've also heard the rumors, but having worked for a number of big companies there always seems to be the same old rumors.  MSFT, Oracle, etc have all had the same things said about them, and they continue to be successful.  Steve Jobs is like the prototypical toxic boss, waking people up at 3 am when they're sleeping under their desks to tell them their shit sucks.  Truth is that in a large enough company there's always going to be disgruntled employees, toxic bosses, and drama.\n\nI missed their CES, but I'll give you this point and the server loss.  I've heard enough about mix ups, and apparent bad communication between marketing and engineering.\n\nI'll also agree with you that this idea of the \"Great Man\" fixing things seems to be pretty dumb.  I don't think CEOs have anywhere near the impact people thing they do, any more than I think Jim Keller was going to do something amazing for them, or Bob Swan was the origin of all their problems.  Just not possible to have a large impact in an organization of 100K employees.\n\nAny particular reason for the 25-50% prediction?  Seems like it's already priced in with people arguing that NVidia and AMD are fair value.  If INTC traded at those same valuations, they would be a $255 per share company.  Even just trading at 25x P/E like, say Texas Instruments would double their price.",
        "created_utc": 1611375338,
        "id": "gkajt7z",
        "permalink": "/r/SecurityAnalysis/comments/l2o21d/intel_taps_taiwans_tsmc_for_graphics_chips/gkajt7z/",
        "score": 3,
        "subreddit": "SecurityAnalysis",
        "created": 1611404138.0
    },
    {
        "author": "Important_Tourist22",
        "body": "Oracle controls and owns the flow of data",
        "created_utc": 1610870427,
        "id": "gjk2otl",
        "permalink": "/r/stocks/comments/kz0hc1/what_stocks_do_you_think_will_reach_a_1_trillion/gjk2otl/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1610899227.0
    },
    {
        "author": "WittyFault",
        "body": "Right!  \n\nThey are in the car business so we can take the market cap of the biggest car company (Toyota - $240B market cap, $275B revenue, $19B net income).  \n\nThey are in the energy business so we can take the market cap of the biggest energy company (Exxon - $206B market cap, $264B revenue, $20B income).\n\nThey are a software business so we can take the market cap of the second biggest independent software vendor (Oracle -  $184B market cap - $39B revenue, $14B income).\n\nSo, if we take the biggest market cap car company, energy company, and the second biggest software vendor we get a company worth $594B with $578B in yearly revenue and $53B in yearly income.\n\nAt $800B market cap with $30B in revenue and $2B in income... all Tesla has to do is 20x their revenue and 25x their income to only be 25% overvalued as a car, energy, and software company.  What do people not get about Telsa is in many different industries?",
        "created_utc": 1611152508,
        "id": "gjy2mc7",
        "permalink": "/r/stocks/comments/l183ld/is_tesla_a_bubble_or_not/gjy2mc7/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1611181308.0
    },
    {
        "author": "exchangetraded",
        "body": "This is going to get buried but here's something many don't realize. I'll preface it with my own uneducated opinion that they do things better than anyone on the market. But, let me follow up with insight from my buddy who's in \"the field\" in a manner of speaking. Palantir is doing two things that are untouched at the moment. First, he says that as a contracting agency is doing their own background research on their own needs, Palantir is at the table and listening and constantly sculpting their product to meet that demand. This means that when an RFP comes out that Palantir already has the product ready and tailored for the need. That's one great advantage. Second, Palantir is eliminating the need to hire a secondary \"integrator\". In layman's terms, their competitors like Salesforce and Oracle and so on only sell the client a license to use the software. This means that you need to hire an external consulting firm to integrate (tailor) the product to the contracting agency's demands. Palantir eliminates this middle man (integrator) entirely. He says that the product and service that Palantir offers is more expensive than their competitors, but there they offer the product at a much lower effort level than anyone else. These are two things you won't really find elsewhere in the forums.",
        "created_utc": 1609725255,
        "id": "gi0t7n1",
        "permalink": "/r/StockMarket/comments/kpozn9/why_are_people_so_high_on_palantir/gi0t7n1/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1609754055.0
    },
    {
        "author": "alectoisfurious0",
        "body": "ORCL",
        "created_utc": 1610887651,
        "id": "gjkuqdw",
        "permalink": "/r/stocks/comments/kz4tw8/looking_for_undervalued_tech_stocks/gjkuqdw/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1610916451.0
    },
    {
        "author": "wyrelltellick",
        "body": "Calls on ORCL if you get the job ;)",
        "created_utc": 1611106662,
        "id": "gjwbr82",
        "permalink": "/r/wallstreetbets/comments/l0t44g/what_are_your_moves_tomorrow_january_20_2021/gjwbr82/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1611135462.0
    },
    {
        "author": "kerrplunk26",
        "body": "Earlier when people were talking about DFV's story becoming a movie, some one posted along the lines of, \"Royal Tannenbaums style.\" And wouldn't you know how fucking right that person was. Another oracle on our hands",
        "created_utc": 1611950325,
        "id": "gla5f67",
        "permalink": "/r/wallstreetbets/comments/l81fgb/honor_to_diamond_hands/gla5f67/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1611979125.0
    },
    {
        "author": "Uncle-ulcer",
        "body": "The mascot of CNBC is Jim Cramer. That alone demolished their reputation for me. It’s a mainstream news network, it’s fine to pay attention, but don’t act like it’s an Oracle.",
        "created_utc": 1612112813,
        "id": "glhv475",
        "permalink": "/r/stocks/comments/l96kjr/has_your_opinion_of_cnbc_changed_after_their/glhv475/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1612141613.0
    },
    {
        "author": "ChicknNugBuds",
        "body": "AP.XT is also gonna be big once merger hits. 150mil revenue and no debt. Jeff epstein worked with twilio and oracle and both had their market caps blow up",
        "created_utc": 1610697586,
        "id": "gjbosb3",
        "permalink": "/r/wallstreetbets/comments/kxp50d/didnt_know_what_options_were_lots_of_missed/gjbosb3/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1610726386.0
    },
    {
        "author": "Equivalent-Story-532",
        "body": "Yes. About a decade ago, I was a government contractor working on the projects you read about. We invited dozens of companies ranging from Microsoft, Oracle and even large SIs like SAIC to pitch on our intelligence and law enforcement platform. \n\nOnly Palantir could pull off the complex multi-agency use cases we defined.  I knew about them for years and when the opportunity came up to acquire, I jumped in.",
        "created_utc": 1611767949,
        "id": "gkz0ssd",
        "permalink": "/r/wallstreetbets/comments/l68q1k/love_wsb_and_pltr_officially_over_500_predpo/gkz0ssd/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1611796749.0
    },
    {
        "author": "kunjinn",
        "body": "Oracle of our times",
        "created_utc": 1610420146,
        "id": "giyjtzi",
        "permalink": "/r/wallstreetbets/comments/kvhi9s/gme_kfc_chicken_tender_basket30_eow/giyjtzi/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1610448946.0
    },
    {
        "author": "dinosaurpuncher",
        "body": "Oracle sucks my company is moving off of it and onto snowflake.  It's by far the worst database I've worked with.\n\n\nAlso cloud is the future and they just don't have a strong foot in that world compared to other companies.",
        "created_utc": 1610480147,
        "id": "gj160uo",
        "permalink": "/r/wallstreetbets/comments/kvvw1y/orcl_2021_moon_landing/gj160uo/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1610508947.0
    },
    {
        "author": "daytraderftw",
        "body": "You will be our oracle for the day. If you block the toilet it’s profits for everybody, if you miss the toilet completely then it’s losses all round.",
        "created_utc": 1610707110,
        "id": "gjby9ri",
        "permalink": "/r/wallstreetbets/comments/kxenqf/what_are_your_moves_tomorrow_january_15_2021/gjby9ri/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1610735910.0
    },
    {
        "author": "MerganzerMunson",
        "body": "Heresy!  Gecko is the true oracle",
        "created_utc": 1611988005,
        "id": "glcdbp2",
        "permalink": "/r/wallstreetbets/comments/l8420s/weekend_discussion_thread_for_the_weekend_of/glcdbp2/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1612016805.0
    },
    {
        "author": "RetainedByLucifer",
        "body": "I'm no oracle I have the full retard. Set your limits at whatever price point you are comfortable with and enjoy your sleep.",
        "created_utc": 1611909682,
        "id": "gl7p5mt",
        "permalink": "/r/wallstreetbets/comments/l7ncio/robinhood_has_finally_released_amc_and_gme_shares/gl7p5mt/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1611938482.0
    },
    {
        "author": "true_happeniss",
        "body": "retard, here u go again with ur bullshit.  you missed ur prediction on PLTR and NIO 3 wks ago.  now, u’re mr oracle 🤣",
        "created_utc": 1611382958,
        "id": "gkb4bcm",
        "permalink": "/r/wallstreetbets/comments/l33fii/steak_and_lobster_tonight_brought_to_you_pltr/gkb4bcm/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1611411758.0
    },
    {
        "author": "TangerineFickle7083",
        "body": "Dear Oracle. What's your PT on PLTR.",
        "created_utc": 1610664068,
        "id": "gja4ka0",
        "permalink": "/r/wallstreetbets/comments/kxdout/i_am_the_gme_oracle/gja4ka0/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1610692868.0
    },
    {
        "author": "suur-siil",
        "body": "I am the Oracle of Otepää",
        "created_utc": 1609534741,
        "id": "ghrcfy5",
        "permalink": "/r/wallstreetbets/comments/k0v9of/3k_to_102k_in_2_weeks_all_weekly_calls_with_meme/ghrcfy5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1609563541.0
    },
    {
        "author": "russianoligarch56",
        "body": "Agreed! And the solution should have payment integrations and a bunch of features and functions. Remember as well that this company has an equity stake in airbeam which could be a major leader in 5G in a few years. They have the technology and team to do some amazing things in this space! Wayne LLoyd is an oracle haha",
        "created_utc": 1609875356,
        "id": "gi7nmn5",
        "permalink": "/r/CanadianInvestor/comments/kr3boq/tracesafe_scores_again_with_major_partnership/gi7nmn5/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1609904156.0
    },
    {
        "author": "snowboard_guy23",
        "body": "Good enough for the oracle of Omaha. \n\nAlso, I hate you now. *applies cold water to my burns*",
        "created_utc": 1610819104,
        "id": "gjhedu3",
        "permalink": "/r/wallstreetbets/comments/ky3qg6/weekend_discussion_thread_for_the_weekend_of/gjhedu3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1610847904.0
    },
    {
        "author": "Sittin_on_a_toilet",
        "body": "Brb let me ask the oracle. Yup she said price will be $420.69 by Wednesday.",
        "created_utc": 1610862862,
        "id": "gjjtfda",
        "permalink": "/r/wallstreetbets/comments/kyqwlk/gme_this_guy_was_selling_january_15th_20_naked/gjjtfda/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1610891662.0
    },
    {
        "author": "elvita12345",
        "body": "Why Verizon and Oracle? They’re growing rather slow (in the case of VZ, receding instead of growing) and I feel their business models and the industries they operate in will not grow stronger by 2030.",
        "created_utc": 1610863427,
        "id": "gjju7t9",
        "permalink": "/r/stocks/comments/kz0hc1/what_stocks_do_you_think_will_reach_a_1_trillion/gjju7t9/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1610892227.0
    },
    {
        "author": "telperiontree",
        "body": "Get a time machine and find out. Anyone answering that question is full of more shit than Shitron. \n\nOr high off their ass and asking their hallucinations for an answer like a good Oracle.",
        "created_utc": 1611809573,
        "id": "gl1ubfy",
        "permalink": "/r/wallstreetbets/comments/l6er79/the_gme_afterhours_thread_part_420_on_27_january/gl1ubfy/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611838373.0
    },
    {
        "author": "Nthorder",
        "body": "&gt; Couple that with the performance of the windows kernel vs the Linux kernel and you now know why most cloud providers exclusively offer Linux.\n\nWhat? AWS, GCP, Alibaba, IBM, Oracle cloud, and Azure all offer windows.  The only cloud service provider that I can think of that does not offer Windows is Linode and they are a tiny operation compared to the others.",
        "created_utc": 1611451753,
        "id": "gkh7j7f",
        "permalink": "/r/wallstreetbets/comments/l3bqeb/bb_most_secure_system_get_your_calls_ready/gkh7j7f/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611480553.0
    },
    {
        "author": "jhonkas",
        "body": "depends on the company, the govt could block the sale\n\nbut also th ecompany could defend itself from a hostile takeover, see peoplesoft vs oracle.",
        "created_utc": 1610081330,
        "id": "giid3ug",
        "permalink": "/r/wallstreetbets/comments/ksmmx6/what_are_your_moves_tomorrow_january_08_2021/giid3ug/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1610110130.0
    },
    {
        "author": "kunjinn",
        "body": "The oracle of our times",
        "created_utc": 1610384849,
        "id": "giwh5ml",
        "permalink": "/r/wallstreetbets/comments/kuhaca/theyll_have_to_prize_my_gme_shares_out_of_my_cold/giwh5ml/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1610413649.0
    },
    {
        "author": "swampassOG",
        "body": "My flatulence is the new SPY oracle...\n\nhttps://reddit.com/r/wallstreetbets/comments/krlpdb/daily_discussion_thread_for_january_06_2021/giazqlq",
        "created_utc": 1609981347,
        "id": "gidcrz6",
        "permalink": "/r/wallstreetbets/comments/krx2od/what_are_your_moves_tomorrow_january_07_2021/gidcrz6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1610010147.0
    },
    {
        "author": "1058pm",
        "body": "Some products that i think compete with them are IBM data stage, informatica, oracle warehouse, talend , alteryx and other ETL software tools. \n\nNot saying i work for any of the above, but this concept has been around for a while, not sure what pltr does differently...",
        "created_utc": 1611004742,
        "id": "gjrd08p",
        "permalink": "/r/stocks/comments/kzxdi4/can_anyone_who_has_used_palantir_let_us_know_your/gjrd08p/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1611033542.0
    }
]