[
    {
        "author": "Loodlekoodles",
        "body": "Apple genius car salesguy: \"You'll want to be sure to buy these keys to your new vehicle as well\"",
        "created_utc": 1637279461,
        "id": "hl6rwsu",
        "permalink": "/r/wallstreetbets/comments/qwvbr5/apple_ev/hl6rwsu/",
        "score": 246,
        "subreddit": "wallstreetbets",
        "created": 1637308261.0
    },
    {
        "author": "LetsSeeThatNow",
        "body": "So people quit taking their keys with them because they could use the app on their phone to start the car.\n\nthen the app quit working.",
        "created_utc": 1637415882,
        "id": "hldu86i",
        "permalink": "/r/wallstreetbets/comments/qy5u2q/tsla_puts_back_on_the_menu_monday_tesla_drivers/hldu86i/",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1637444682.0
    },
    {
        "author": "dedmanspartywastaken",
        "body": "Earned a quick $200 on a call then locked my keys in my car and had to pay $200 for a locksmith.\n\nThe universe giveth and taketh.",
        "created_utc": 1635969596,
        "id": "hj6x3mc",
        "permalink": "/r/wallstreetbets/comments/qlr721/daily_discussion_thread_for_november_03_2021/hj6x3mc/",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1635998396.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "There's only 4 ways you can get rich \n\n1) inherit it\n\n2) steal it\n\n3) work really really really hard\n\nWhat's the fourth way?\n\n4) suck a dick like you lost your car keys in it",
        "created_utc": 1636946645,
        "id": "hkocuxz",
        "permalink": "/r/wallstreetbets/comments/qtzc0g/what_are_your_moves_tomorrow_november_15_2021/hkocuxz/",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1636975445.0
    },
    {
        "author": "ZET_unown_",
        "body": "I have a model x, so not sure about model 3 or y, but to unlock the car using the phone, you need to be logged in on the phone app, which does require Tesla server, and when Tesla server last went down, the app also logged me out. If I didn’t have the physical keys, I can totally see myself not being able to get in.",
        "created_utc": 1637496590,
        "id": "hli28jj",
        "permalink": "/r/wallstreetbets/comments/qykw6v/tesla_over_the_weekend_when_i_dont_own_calls_vs/hli28jj/",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1637525390.0
    },
    {
        "author": "EventConflict",
        "body": "Lol. Holy shit. My favorite title so far is “Using an Ant Farm to generate encryption keys”",
        "created_utc": 1638134983,
        "id": "hmg79bi",
        "permalink": "/r/wallstreetbets/comments/r4ad1q/is_this_a_good_price_to_buy_in_at/hmg79bi/",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1638163783.0
    },
    {
        "author": "RTiger",
        "body": "Congrats on the fantastic results.\n\nIn the past you mentioned your cagr, and two other huge keys to your success. Lucking into a brilliant and patient mentor, and a monster savings rate are two big pieces not emphasized in this post.\n\nYou probably keep very good records so probably know exactly your cash deposits in the early years. I'm guessing $20k per year at a young age. Increasing as your earned income increased.\n\nMentioning your modest starting nest egg gets kind of misleading when you may have deposited $250k or more from wages and other non investment income.\n\nStill a fantastic achievement overall, no need to mislead the masses here. Especially as the sub has tilted heavily to the gamblers. Please don't encourage the casino crowd with dreams of turning $5k into $5 million in 14 years via the market.",
        "created_utc": 1635993112,
        "id": "hj8gpxr",
        "permalink": "/r/options/comments/qm7e7f/the_most_successful_options_strategy/hj8gpxr/",
        "score": 40,
        "subreddit": "options",
        "created": 1636021912.0
    },
    {
        "author": "remstardougie",
        "body": "You’re gonna get a bunch of Bitcoin hardos that will say “not your keys not your coin” but I don’t care for that cuz tax free gains are much better",
        "created_utc": 1636244363,
        "id": "hjm6x57",
        "permalink": "/r/CanadianInvestor/comments/qoc5j3/thoughts_on_bitcoin_etfs/hjm6x57/",
        "score": 27,
        "subreddit": "CanadianInvestor",
        "created": 1636273163.0
    },
    {
        "author": "zephyy",
        "body": "it could be worse, you could have gotten the coins in a wallet and then lost the wallet keys",
        "created_utc": 1637300767,
        "id": "hl8031h",
        "permalink": "/r/investing/comments/qx0aft/whats_the_biggest_loss_youve_taken/hl8031h/",
        "score": 22,
        "subreddit": "investing",
        "created": 1637329567.0
    },
    {
        "author": "JonathanL73",
        "body": "1.) High rate of accounts getting hacked, some even with 2FV enabled.\n\n2.) For the longest time they didn't even have a customer support phone number, they're difficult to get ahold of if a problem arises.\n\n3.) Unstable and unreliable app, RH became completely unusable, multiple times during the Covid March 2020 crash. When other brokers stayed operational\n\n4.) Payment for order flow. RH makes money buy selling your buy orders to high frequency trade hedge funds, who are then able to \"frontrun\" the stock, meaning they can buy the stock a milisecond before you do, thus raising the price your market orders get filled. So you're actually paying more for stocks on RH than if you used another broker.\n\n5.) Conflict of interest, RH primary customer, Citadel was caught illegally naked shorting meme stock. During the meme stock frenzy, RH users weren't allowed to buy shares of certain companies, whereas with other brokers you could.\n\n6.) RH has history of being fined by the SEC, and countless lawsuits regarding not having the best user's interest in mind.\n\n7.) Glitchy Options display. RH falsely displayed losses for a young options trader who was actually in the green. He ended up committing suicide because of it.\n\n8.) If you care about margin %, Interactive Brokers and M1 Finance both have cheaper margin %\n\n9.) Not good for buying Crypto. You don't have access to your wallet keys, and you're not allowed to transfer your crypto to anew wallet, so you're forced to liquidate it if you want to move it elsewhere, which creates a taxable event. Also questions have raised if RH really holds the crypto that you \"own\" on their app.\n\nAlso it's not 2019 anymore, it's 2021. Countless apps have clean simple UI. SoFi &amp; Fidelity Beta both have clean UI",
        "created_utc": 1636202763,
        "id": "hjjlpp6",
        "permalink": "/r/StockMarket/comments/qnruuf/finally_in_the_green_fellas_it_was_a_rough_start/hjjlpp6/",
        "score": 20,
        "subreddit": "StockMarket",
        "created": 1636231563.0
    },
    {
        "author": "crownpr1nce",
        "body": "I still don't understand what people think that NFT marketplace will be for. Do you have any suggestions?\n\nI've seen suggestions it's for used games, but that doesn't work unless GME launch their own platform like Steam. Even with NFT, steam, PS, Xbox, Nintendo, etc don't allow the transfer of keys. And if they wanted to allow it, they could easily create their own version of a used game marketplace without NFT or needing GME. Like Steam does for cards. NFT really isn't necessary for game licenses.\n\nCollectibles in game? Same problem. Unless the game is coded to allow NFT transfer of in game items, GME can't force it. And if games wanted to allow that, they could do a marketplace without NFT or giving a cut to GME. Like Diablo did originally.\n\nSo I'm not sure what NFT will be linked to. Yet to see a proper theory on this.",
        "created_utc": 1636161612,
        "id": "hjhtwy2",
        "permalink": "/r/CanadianInvestor/comments/qnkuks/is_there_a_legitimate_bull_case_for_gamestop_gme/hjhtwy2/",
        "score": 17,
        "subreddit": "CanadianInvestor",
        "created": 1636190412.0
    },
    {
        "author": "relationship_tom",
        "body": "I get it's different for you because you are so close to retirement and a fixed income (Or not, I don't know how you invest), but no crash will be as bad as you think. Not the 70's, not Calgary in the early 80's when keys were left on the doors and you walked away legally, not dot com, not 2009, not 2020. They were all bad to varying degrees, but not nearly as lasting as the bears predicted. \n\nBut if you're worried, follow the flow of big money, there are tools and sites that track these things. Whether they start becoming risk-off. When they start moving en masse into bonds and money markets and hedges like gold and yes possibly crypto, move with them (With the exception of crypto. It's here to stay but rug pulls happen often).   \n\nI know people online that have held 60% cash for two years, expecting the crash to happen, meanwhile they've missed massive gains. I grew up in Vancouver and in the mid 2000's people were waiting and waiting for the crash. It's been 17 years.",
        "created_utc": 1636237413,
        "id": "hjlrs5v",
        "permalink": "/r/CanadianInvestor/comments/qo78cb/not_a_meme_check/hjlrs5v/",
        "score": 15,
        "subreddit": "CanadianInvestor",
        "created": 1636266213.0
    },
    {
        "author": "linebreaker-bot",
        "body": "&gt;Quantum computing in the near future will usher in huge advances in technology and perhaps transform how we go about our daily lives for the better. The unfortunate part of our quantum future is that when quantum computing arrives, current encryption methods keeping all of our information safe, will fail. This is not a question of if, it is of when. The Global Risk Institute released a report titled \"Quantum Threat Timeline\" in 2019 which polled 22 leading data scientists on the forecasted timetable for a quantum computer to break current encryption standards. The consensus at the time was around 15 years, or 2034. Since that report was released, the quantum computing market has experienced a massive surge of investment with incredibly fast progress reported from companies around the globe, several, such as Google (GOOGL) (GOOG), IBM (IBM), Rigetti Computing and Honeywell (HON) already have broken past 100 qubits, with a rapid doubling of capability shown.\n\n&amp;nbsp;\n\n&gt;For reference, a recent article from Cornell University shows that PKI encryption (the current industry standard) may require as little as 2,000 logical qubits to break, making the timeline for current encryptions' obsolescence disturbingly close, likely in the 2025-2030 time frame, with governments such as the USA, UK, China and Russia likely well ahead of that date. A troubling trend noted recently by nation-state actors is to \"harvest now, decrypt later\" which is the term for stealing encrypted data from hardened sources today and then store the data to decrypt when the technology is available.\n\n&amp;nbsp;\n\n&gt;It has even been theorized that the entire blockchain that cryptocurrencies depend on may be at risk of total hijack or collapse once quantum computers reach maturity. This trend makes it critically important for nations to migrate away from PKI encryption as soon as possible to symmetric encryption keys. The biggest problem currently with symmetric key encryption is that you need to have a way to get the key to the other party with whom you are sharing the data. Arqit believes that it has a solution for this critical problem that is completely computationally secure, which means it cannot be broken by any current or future machine, along with a delivery system that cannot be intercepted via the quantum cloud. The key to this entire technology's eventual adoption is that the algorithm used is already the global standard (AES), meaning that it is operable with current systems, giving users no logical reason to not adopt the technology.\n\n&amp;nbsp;\n\n&gt;The technology Arqit invented is covered by over 1,400 patent claims making this company and its technology potentially protected from copycats looking to set up similar business models for some time to come. The commercial strategy also appears to be very well thought out, with the software downloaded by customers and used automatically. Billing events are created by usage via commercial customers with key creation events being metered. The brilliance of this strategy is the incredibly low capex Arqit has to expend once the core infrastructure is in place, as the software needed is basically zero touch.\n\n&amp;nbsp;\n\n&gt;With current systems operating on a compatible format, ultimately every connected device is a potential customer of Arqit without the need of the company building any further infrastructure as the 2 planned and paid for satellites used are able to generate two quadrillion unique keys per year. To get an idea of the explosive potential of this company, please keep in mind that the below pipeline and business development was accomplished all in 2021, with only 2 dedicated salespeople, one being the CEO [himself.To](https://himself.to/) land executed, recurring and framework contracts with the likes of the British Government, British Telecom (OTCPK:BTGOF), Sumitomo Corporation (OTCPK:SSUMF) ESA and Dentons in addition to an \"unnamed\" major payment network, Northrop Grumman (NOC), Iridium (IRDM), Verizon (VZ) and BP (BP) accomplished pre hard rollout is unbelievably impressive and gives credibility to the massive potential ahead for the company.\n\n&amp;nbsp;\n\n&gt;During recent analyst conferences before the de-SPAC event, the CEO has reported massively increased interest in the product well before any ramp up in sales and marketing efforts by the company. Generally I do not like to discuss financial projections generated from the SPAC process as many companies simply throw hopes and dreams into a blender to come up with these. However, given the solid and proven pipeline of customers Arqit has signed already and the fact that the service is already live give me enough confidence to share the company's 2025 projections.With Arqit, I really have to control my enthusiasm a bit, not only does the company appear to have a scalable solution to a massive problem affecting nearly every sector around the globe, but the company also has a way of doing it that is low capex and very high margin.\n\n&amp;nbsp;\n\n&gt;In addition, the company having expended basically zero sales effort to date, has secured $130 million in guaranteed revenues from A list customers with a high probability of closing a $1.1 billion backlog pipeline already. The CEO indicated in the recent investor day that in his 30 years of sales experience, he has never had any product like Arqit's and that his closing percentage is nearly 100%. If Arqit even comes close to the financial projections they have presented, which the CEO notes is a very conservative projection, then the company could be worth many multiples of the current $2.1\n\n&amp;nbsp;\n\n&gt;billion market cap. It also would appear, counter to many of the recent SPAC IPOs, that dilution should not be an issue going forward. In the SPAC transaction, the company has received $376 million in cash to the balance sheet, to which the CEO recently commented that the deal brought it \"twice the money that we need to fully fund our business\" and that \"We don't need to raise any more money, ever,\" he told CNBC. In late August I purchased a moderately sized speculative position in the SPAC. My only hesitancy in purchasing more is that generally, when a company seems to have a no-brainer, hugely profitable solution to a massive problem, red flags tend to appear.\n\n&amp;nbsp;\n\n&gt;So far, I have not found any true red flags with Arqit, but as I am not a cybersecurity expert, I will be keeping my position moderately sized until at least a few quarters have run off and I gain a greater comfortability with the progress of the technology and management. I am very excited to see how this company develops as it would appear they may have solved a truly massive problem that nearly all NATO countries have been losing sleep over for years, before it actually existed. If they are successful in the product roll out, shareholders are likely to be rewarded handsomely. I look forward to your comments and views of the company, thank you for reading and good luck!\n\n&amp;nbsp;\n\nHey /u/bdkendalll, it looks like you posted a wall of text. I have separated it into paragraphs for you!\n\n\n\n_Send a private message with title **'opt out'** to prevent this bot from seeing your posts in the future._\n\nr/SPACs has contributed 0.0% of all walls of text analyzed so far!",
        "created_utc": 1636475197,
        "id": "hjy9mks",
        "permalink": "/r/SPACs/comments/qq7a6p/arqq_arqit_quantum_massive_return_potential_by/hjy9mks/",
        "score": 14,
        "subreddit": "SPACs",
        "created": 1636503997.0
    },
    {
        "author": "itsalliefersure",
        "body": "I will once I get the keys to my crypto",
        "created_utc": 1635873795,
        "id": "hj19glp",
        "permalink": "/r/StockMarket/comments/ql6lpt/2_years_with_a_2k_investment/hj19glp/",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1635902595.0
    },
    {
        "author": "ImAnonymous135",
        "body": "So i just checked gourds guy history and holy fuck this guy has gone on an adventure. He went to uruguay to be a bee keeper then got in trouble because the bees were considered an invasive species so he had to go back to the US then he decided to buy an ant farm to create encryption keys with ants and sell them to companies and now he wants to transport the ants across the us (along with some gourds that he grew) this guy is a fucking legend",
        "created_utc": 1637676081,
        "id": "hlrnrch",
        "permalink": "/r/wallstreetbets/comments/r0asp7/daily_discussion_thread_for_november_23_2021/hlrnrch/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1637704881.0
    },
    {
        "author": "lordpine",
        "body": "maybe his doesn’t lock in until the keys are handed over and payments start",
        "created_utc": 1635978840,
        "id": "hj7kjib",
        "permalink": "/r/investing/comments/qm14v8/fed_to_start_tapering_bond_purchases_later_this/hj7kjib/",
        "score": 11,
        "subreddit": "investing",
        "created": 1636007640.0
    },
    {
        "author": "adjustablewrench",
        "body": "You need to do alot more research before you invest in Bitcoin.\n\nBitcoin is digital, a wallet is an application that stores the keys to your Bitcoin. Spend time researching this before you buy.\n\nBuying Bitcoin on wealthsimple is not ideal, but not a terrible place to start (that's where I started). You don't actually hold the keys to the Bitcoin when you use wealthsimple and alot of people say \"not your keys, not your coins\". Their fees are up there as well. Spend time researching Bitcoin before investing.\n\nTrying to enter the market at an all time high is FOMO at its finest. But who knows if it's going to go up or down. Spend time researching Bitcoin before you invest.\n\nFinally there is alot to know about the entire crypto marked, and millions are lost there every day. It is un regulated and full of scams, so spend alot of time researching before you invest.\n\nDue to the volatile nature of crypto do not invest more than you are willing to loose, and do your research before you invest.",
        "created_utc": 1636316852,
        "id": "hjpv535",
        "permalink": "/r/CanadianInvestor/comments/qowsj9/bitcoin_alltime_highs_responsible_investing/hjpv535/",
        "score": 11,
        "subreddit": "CanadianInvestor",
        "created": 1636345652.0
    },
    {
        "author": "44problems",
        "body": "They have a box you can drop your keys off at least if it's after hours",
        "created_utc": 1635855758,
        "id": "hj046qb",
        "permalink": "/r/stocks/comments/ql1oa6/musk_says_hertz_deal_isnt_signed_and_questions/hj046qb/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1635884558.0
    },
    {
        "author": "byramike",
        "body": "And give Trump the keys for 4 years and appoint lifetime judges that will fuck everyone over until 2050+?  Sometimes there is just a bigger picture to care about.",
        "created_utc": 1637003279,
        "id": "hkr5qde",
        "permalink": "/r/wallstreetbets/comments/quida5/just_sign_out_elon_pls/hkr5qde/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1637032079.0
    },
    {
        "author": "derpp_6870",
        "body": "You’re an idiot if you bought puts on NVDA around ER. And should probably learn how to suck a dick like your car keys in it",
        "created_utc": 1637185880,
        "id": "hl1icea",
        "permalink": "/r/wallstreetbets/comments/qw8udu/what_are_your_moves_tomorrow_november_18_2021/hl1icea/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1637214680.0
    },
    {
        "author": "986fan",
        "body": "if they have a computer one of their employees use even if it is a secondhand laptop with broken keys it is a \"growth tech company\"",
        "created_utc": 1635976797,
        "id": "hj7fmal",
        "permalink": "/r/wallstreetbets/comments/qm2tw3/what_are_your_moves_tomorrow_november_04_2021/hj7fmal/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1636005597.0
    },
    {
        "author": "AsleepTackle",
        "body": "QC is extremely well performing at combinatorial problems, I could imagine that the mining process would be accelerated to the point where the market is flooded with crypto. Also passwords, i. e. public keys could be cracked in milliseconds rendering the concept of the uncheatable blockchain useless. The cryptos that we know today won't exist in 5-10 years. You will need QC-resistant crypto...",
        "created_utc": 1637023049,
        "id": "hksi3pe",
        "permalink": "/r/StockMarket/comments/qut84x/quantum_computing_is_it_better_to_invest_in_a/hksi3pe/",
        "score": 9,
        "subreddit": "StockMarket",
        "created": 1637051849.0
    },
    {
        "author": "PrincPaco",
        "body": "WTF so TSLA drivers couldn't even start their car because the app went down. We can't live like this in the future. We need physical keys or some shit to make sure you can use your car.",
        "created_utc": 1637432906,
        "id": "hlevx9u",
        "permalink": "/r/wallstreetbets/comments/qxpg75/weekend_discussion_thread_for_the_weekend_of/hlevx9u/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1637461706.0
    },
    {
        "author": "ridecameraaction",
        "body": "New mantra: not your keys, not your crypto.",
        "created_utc": 1635791794,
        "id": "hiwx0am",
        "permalink": "/r/CanadianInvestor/comments/qkfj4m/gold_bar_investment/hiwx0am/",
        "score": 7,
        "subreddit": "CanadianInvestor",
        "created": 1635820594.0
    },
    {
        "author": "BluBirch",
        "body": "Let me introduce you the exciting world of proptech my mousey friend. There are currently hundreds of services that rely on entering people’s homes: dog walkers, housecleaning, maintenance, delivery, etc. All of this is coordinated via technology, yet it relies on a physical key for access. That’s absurd. You give a real key to your housekeeper, but what happens when your housekeeper loses the key? What happens when tenants turn over? Why on earth would we be paying to change physical bulky hardware every time a new resident takes possession?  Wouldn’t it be better to give your housekeeper a one time use code only valid for entry at the specified times?  Wouldn’t it be better to unlock your door with your phone instead of calling a locksmith when you lose your keys at in the Uber? \n\nOur connected digital world relies on a physical key and that just simply isn’t going to be the case in just a few short years.\n\nEventually, Amazon is going to announce a partnership with either Latch or SmartRent that allows AmazonFresh to deliver groceries directly into your fridge while you are at work. That WILL happen, and I know which side of the trade I want to be on when it does. \n\n3 out of every 10 newly built apartment buildings in the US are installing Latch. In the future, 9 out of 10 will use either Latch or SmartRent. \n\nBoth of these companies fully integrate with all of the common smart home applications, you can have Alexa unlock your door for the dog walker for example. \n\nBoth of these companies have 0% attrition. To date they have NEVER had a customer cancel their contract or fail to renew. That is absolutely remarkable. \n\nThe market simply doesn’t yet understand this industry and the inevitable shift into smart building management. \n\nThe words oldest subscription service (renting an apartment) is have its tech transformation moment. Get on board.",
        "created_utc": 1636495807,
        "id": "hjzpimg",
        "permalink": "/r/SPACs/comments/qpyw5n/announcements_x_daily_discussion_for_tuesday/hjzpimg/",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1636524607.0
    },
    {
        "author": "OrionJohnson",
        "body": "Lucid is clearly drunk, somebody take their keys",
        "created_utc": 1637017242,
        "id": "hks4v1b",
        "permalink": "/r/wallstreetbets/comments/quqac0/what_are_your_moves_tomorrow_november_16_2021/hks4v1b/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1637046042.0
    },
    {
        "author": "deoje299",
        "body": "It can be done on any standard keyboard actually, you just to press all the keys at random as fast as humanly possible. Louder keyboard clicks help as well.",
        "created_utc": 1636064456,
        "id": "hjcan2w",
        "permalink": "/r/wallstreetbets/comments/qmn4vd/its_the_way_it_goes/hjcan2w/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636093256.0
    },
    {
        "author": "PeteyMcPetey",
        "body": "Wait, wait! A GME post with charts and words and everything? \n\nIs it happening again????\n\nWhat keys do I press to make the magic happen on my screen again? It's been so long! Someone tell me, QUICK!",
        "created_utc": 1637131935,
        "id": "hkykrgf",
        "permalink": "/r/wallstreetbets/comments/qvbkwn/gme_net_cumulative_premiums_keep_increasing/hkykrgf/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1637160735.0
    },
    {
        "author": "h3nchman27",
        "body": "Word on the street is JPow gave Dr Fucci the keys to the printer for a test drive",
        "created_utc": 1638106380,
        "id": "hmecub7",
        "permalink": "/r/wallstreetbets/comments/r2t0k1/weekend_discussion_thread_for_the_weekend_of/hmecub7/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1638135180.0
    },
    {
        "author": "WinterHill",
        "body": "Retail has had a massive effect on stock prices over the past \\~1.5 years: [The Rising Influence of Retail Investors](https://www.bis.org/publ/qtrpdf/r_qt2103v.htm). Especially when you factor in leverage.\n\nStock price is set by marginal buyers, i.e. who is buying/selling the stock *right now,* not necessarily the party with the most money. Institutions sitting on shares for years don't affect stock price one bit, except by reducing the float.\n\nLike sure the market cap of Tesla is &gt; $1 trillion. But you don't need nearly that much money to move the stock price by quite a lot. You just need enough volume on a given day to move the needle.\n\nIMO this is one of the keys to understanding value investing, and why speculation is such a risky game. If you buy into a company whose fundamentals are far outpaced by its stock price, its massive market cap can evaporate into thin air overnight, just based on the opinions and whims of whoever is buying/selling it that day.",
        "created_utc": 1637248588,
        "id": "hl4n8kc",
        "permalink": "/r/ValueInvesting/comments/qwnwtx/who_really_moves_the_market/hl4n8kc/",
        "score": 6,
        "subreddit": "ValueInvesting",
        "created": 1637277388.0
    },
    {
        "author": "Dax420",
        "body": "30 keys? Shit I've probably sold more dope than that. Who wants to invest?",
        "created_utc": 1637623190,
        "id": "hlp8qjg",
        "permalink": "/r/weedstocks/comments/qztzxx/a_canadian_company_wins_the_tender_luxembourg/hlp8qjg/",
        "score": 6,
        "subreddit": "weedstocks",
        "created": 1637651990.0
    },
    {
        "author": "CalligrapherOneTwo3",
        "body": "Here are a few points which may or may not be helpful to you from my perspective regarding buying this alternative asset class, cold storage wallets, taxation, and the cheapest method of accumulating/procuring it in Canada:\r  \n\r  \n1. Personally, I only buy on the Newton app since they currently have the lowest purchasing fees out of all of the available exchanges in Canada. Newton's average spread varies from 0.50% to 0.60% which is 2-3 times cheaper than most of the other available exchanges that are available to us as Canadians. I also use the ShakePay app to earn free Bitcoin on a daily basis by physically shaking my phone once a day. Trust me, I know that sounds ridiculous, stupid, and suspicious, but ShakePay is a legitimate company based out of Montréal which is regulated by both FINTRAC and AMF while it is also legally licensed as a Money Service Business. I never actually buy from ShakePay because of their high purchasing spreads (which is approximately 1.75%) and I simply use them for the free daily accumulation of Bitcoin. Anyone who uses ShakePay can easily confirm their legitimacy and I have been stacking free Satoshis for a few years now.   \r  \n\r  \n2. Since I actually want to own the underlying asset, I withdraw my Bitcoin from both of those exchanges and I put my assets into a cold storage wallet. In Canada, this is currently the cheapest method of accumulating Bitcoin and truly owning the assets by storing them \"offline\" in a cold storage wallet. However, in order to unlock the ShakingSats feature in ShakePay to earn free Bitcoin, you will need to be referred as per their current terms and conditions. I can assist you with that in addition to answering any general questions that you may have regarding buying, selling, converting, and taxation-related issues if you want to message me directly as I am always willing to help educate others in this space with whatever knowledge and/or experience that I have gained over the years.\r  \n\r  \n3. If you want tax free capital gains, you can buy BTCX, ETHX or BTCC in your TFSA. With that said, you do not truly own crypto with any of those because they are a fund; and therefore, you own shares of the fund and not the asset itself. As the saying goes and as you may have heard if you have done your due diligence: \"not your keys, not your crypto\". As such, you run and operate with all of the associated risks of leaving your coins on an exchange which is why I choose to own the real thing and use a cold storage wallet. The products mentioned above are not completely insured. Big risk, but tax free/deferred in a TFSA/RRSP.\r  \n\r  \n4. You may have heard of a Canadian company named Quadriga. In short, many investors did not truly own their Bitcoin with them since Quadriga sold \"entitlements to receive crypto assets or fiat currency from Quadriga\" while Quadriga held the \"keys\" to the real Bitcoin and investors lost around 135 million dollars CAD, but up to 250 million dollars CAD according to Wikipedia. This is verifiable information, a famous story, and a perfect example of \"not your keys, not your crypto\" as well as a lack of insurance of clients. Also, as of April, 22, 2021, Thodex, an exchange with 400,000 users went offline while Interpol issued a red notice for its CEO who mysteriously disappeared. According to Fortune,  an international manhunt is currently underway to locate the CEO and secure $2 billion in digital tokens he allegedly embezzled from Thodex.\r  \n\r  \n5. Unfortunately, with BTCC, ETHX, and WealthSimple Crypto, you cannot take your Bitcoin off of their exchanges because, again, you do not truly own Bitcoin with them. Rather, you own shares of the fund whereas those organizations truly own the asset since they have the \"keys\". They are the ones who own the real asset (crypto) and simply run the fund with the crypto backing that fund as they make money through their ridiculously overpriced premiums and spread/fees (WealthSimple's spread is around 1.5-2.0% if not higher and BTCC's MER is about 1%).\r  \n\r  \n6. In regards to taxes, if you truly own the crypto-asset, it is subject to capital appreciation tax whenever you trigger a taxable event such as selling it, buying things with it, and/or converting crypto-to-crypto. As such, you need to be prudent in your bookkeeping behavior and calculate your adjusted cost base (ACB) for each transaction. There is no legal requirement forcing you to calculate your ACB for each transaction, but it just saves you a lot of headaches later on when you need to pay taxes. This is no different than investing in traditional equities in a taxable account after you have maxed out your TFSA, RRSP, RESP, etc.\r  \n\r  \n7. Before you invest in anything regardless of the asset class, make sure you understand what you are putting your money towards, understand your risk tolerance, understand the proper asset allocation percentages for your risk tolerance, and formulate a clear plan of what you want to achieve. For me, the biggest investment is not really crypto itself, but rather, it is in the application of blockchain technology which serves as a massive global public ledger as well as the decentralization of this digital store of value combined with its independence from overbearing governing bodies whereby the crypto-assets itself simply have a monetary value relative to fiat currency. Moreover, investing is simply risk management and from a risk-adjusted returns perspective, having some excellent crypto-projects is better than not having any at all while I personally see this as the 12th sector in the overall global market index.\r  \n\r  \nNow, here are some general points of interests to help you understand cold storage wallets:\r  \n\r  \n1. There is a big misconception that if you decide to operate as your own bank (i.e.truly own your Bitcoin) and use a cold storage wallet device (i.e. physical hardware connected via USB to your PC), that your assets (Bitcoin) will be transferred and stored onto that physical USB device. This is the part that confuses a lot of people. In short, Bitcoin is not stored on that device, it will never be stored there, and this is because Bitcoin can never leave its \"blockchain\".\r  \n\r  \n2. So, what does your cold storage device do? The device allows you to have a \"key\" to your asset (Bitcoin) on the blockchain. How is this \"key\" established? Without going too deep into the technical aspects, when you initially setup the hardware wallet device, you will be given a 24-word \"seed phrase\" and it is literally 24 words. From a computer science perspective, this 24-word \"seed phrase\" actually represents and is transcribed into a huge series/string of alphanumeric characters. This 24-word \"seed phrase\" is essentially your \"keys\" to your assets on the blockchain.\r  \n\r  \n3. Your 24-word \"seed phrase\" is what is most important if you decide to act as your own bank and truly own Bitcoin since this is what gives you access to it. It does not matter if you lose your physical device and it does not matter if your physical device was destroyed. Why? Again, your assets are on the blockchain and not on the physical device. So, if you lose your physical device, you can simply replace it with another one (and this can be one from a different manufacturer too), set it up with your original 24-word \"seed phrase\" and you will once again have access to your assets since they are on the blockchain. In essence, never lose your \"keys\" because then you will have truly lost your Bitcoin. \r  \n\r  \n4. As you can probably see now, your 24-word \"seed phrase\" is extremely important (and more important than the physical hardware device itself). Therefore, when you first take note of your 24-word \"seed phrase\" during the initial setup of your physical hardware device, make sure that no one is watching, there are no cameras around you (including your mobile phone), etc. Only you should know your \"keys\". Never type it out on any digital device, never e-mail it to yourself, never take a photo of it, never upload it to a cloud database such as Google Docs and never try to encrypt it and put it on a regular USB drive. You want this 24-word seed phrase as private as possible. So, if anyone/anything asks you for your \"keys\", never give it out. Period.\r  \n\r  \nDisclaimer: I am irresponsibly long Bitcoin/Ethereum and I sincerely hope that this has been helpful to you and good luck!",
        "created_utc": 1636050401,
        "id": "hjbb74c",
        "permalink": "/r/CanadianInvestor/comments/qmq1o4/looking_for_feedback_from_investors_with/hjbb74c/",
        "score": 5,
        "subreddit": "CanadianInvestor",
        "created": 1636079201.0
    },
    {
        "author": "Dangerous_Aspect_905",
        "body": "I’ve seen reports. The fact that people are seriously looking at jangling of keys to look the other way is insane. China is going dark people. And we are about to seriously find out just how much money is gone. This does not look good.",
        "created_utc": 1638206939,
        "id": "hmjxhln",
        "permalink": "/r/stocks/comments/r4z16b/covid_death_rate_not_rising_swap_restrictions_and/hmjxhln/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1638235739.0
    },
    {
        "author": "h3nchman27",
        "body": "I’m selling EV’s for the afterlife.  Treat your body like the sacred vessel it is and invest in your future. Heaven’s Electric Cars.  Multiple easy monthly lifelong payments shall be made to assure that your god hands you the keys to your dream ride when you ascend above the poors into the skies. Buy now, ride later, forever.",
        "created_utc": 1637140000,
        "id": "hkyux7z",
        "permalink": "/r/wallstreetbets/comments/qvhzaa/what_are_your_moves_tomorrow_november_17_2021/hkyux7z/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1637168800.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "#MADE A MILLION GON’ MAKE SOME MORE\n\n#GOT THEM KEYS NEED TO LOCK SOME DOORS",
        "created_utc": 1636736199,
        "id": "hkcojn3",
        "permalink": "/r/wallstreetbets/comments/qs8s63/daily_discussion_thread_for_november_12_2021/hkcojn3/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636764999.0
    },
    {
        "author": "ohreo1111",
        "body": "So, I worked at best buy for a little bit and most of the monetary loss (about $10,000-30,000) month if I remember right) seemed to be coming from employees. A lot of it was things like iPads. They started to crack down on the lower level employees, but the only ones with keys were supervisors and up or warehouse. I see to find those things stashed all over the store. Under shelves and behind large appliances and stuff where people would pick them up and walk out with them later. Security could do nothing but ask them to stop and report it anyway.",
        "created_utc": 1637757801,
        "id": "hlw7hn2",
        "permalink": "/r/stocks/comments/r0gdje/best_buy_is_sliding_after_earnings_with_organized/hlw7hn2/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1637786601.0
    },
    {
        "author": "LiterallyForThisGif",
        "body": "You can buy crypto on Paypal. No keys, but a nice place to keep your cash when you get payments, instead of moving it to the bank.",
        "created_utc": 1636520422,
        "id": "hk16yc5",
        "permalink": "/r/StockMarket/comments/qqhbra/buy_paypal_stock_now/hk16yc5/",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1636549222.0
    },
    {
        "author": "whammyyy",
        "body": "Bears handing over keys to the Wendy’s dumpster to Bulls in the changing of the tards",
        "created_utc": 1637919731,
        "id": "hm50mhr",
        "permalink": "/r/wallstreetbets/comments/r1u53o/daily_discussion_thread_for_november_25th_2021/hm50mhr/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1637948531.0
    },
    {
        "author": "walter1021",
        "body": "Was mostly joking but a lot of people are doing it. Dudes that are big online and have been in the space for years “accidentally gave away their keys” on stuff priced up between the same 4 wallets. It’s basically at home art gallery auctions for normal people. I’d do it if I wasn’t afraid of long term implications.",
        "created_utc": 1637798354,
        "id": "hlyvy0i",
        "permalink": "/r/wallstreetbets/comments/r1f2zm/what_are_your_recipes_tomorrow_november_25th_2021/hlyvy0i/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1637827154.0
    },
    {
        "author": "Powerhx3",
        "body": "My the value of my house has done nothing but go down since 2015. Even last month, it fell another 2%. My magic number is 100k. If I’m underwater that much, I’m mailing the keys to the bank and changing my phone number.",
        "created_utc": 1638133702,
        "id": "hmg43jw",
        "permalink": "/r/wallstreetbets/comments/r4e8p3/what_are_your_moves_tomorrow_november_29_2021/hmg43jw/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1638162502.0
    },
    {
        "author": "FullSendOrNullSend",
        "body": "That’s the case on some news but this isn’t a stock and it has actual use cases. Not saying it’s not possible but when gamestop is confirmed to be using this Ethereum Layer 2, likely a lot of other companies will follow and use Loopring to build other gaming marketplaces, etc. Also long term Loopring is one of the major keys to ethereum scalability. Ethereum has a market cap over 500billion, if Loopring is one of the major zkrollup L2s for Ethereum, it can easily reach a 20billion market cap",
        "created_utc": 1636934207,
        "id": "hknlz4v",
        "permalink": "/r/pennystocks/comments/qtzhvn/i_have_50000_to_blow_from_tesla_gains_tell_me/hknlz4v/",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1636963007.0
    },
    {
        "author": "IceWook",
        "body": "So the idea that you don’t hold your keys is no longer as correct. You can now move your crypto off of wealthsimple.",
        "created_utc": 1636320279,
        "id": "hjq3usi",
        "permalink": "/r/CanadianInvestor/comments/qowsj9/bitcoin_alltime_highs_responsible_investing/hjq3usi/",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1636349079.0
    },
    {
        "author": "CalligrapherOneTwo3",
        "body": "Investing is simply risk management and from a risk-adjusted returns perspective, having some excellent blue-chip crypto-projects is better than not having any at all while I personally see this as the 12th sector in the overall global market index. As you are new, here are a few points which may or may not be helpful to you from my perspective regarding buying this alternative asset class, cold storage wallets, taxation, and the cheapest method of accumulating/procuring it in Canada:\r  \n\r  \n1. Personally, I only buy on the Newton app since they currently have the lowest purchasing fees out of all of the available exchanges in Canada. Newton's average spread varies from 0.50% to 0.60% which is 2-3 times cheaper than most of the other available exchanges that are available to us as Canadians. I also use the ShakePay app to earn free Bitcoin on a daily basis by physically shaking my phone once a day. Trust me, I know that sounds ridiculous, stupid, and suspicious, but ShakePay is a legitimate company based out of Montréal which is regulated by both FINTRAC and AMF while it is also legally licensed as a Money Service Business. I never actually buy from ShakePay because of their high purchasing spreads (which is approximately 1.75%) and I simply use them for the free daily accumulation of Bitcoin. Anyone who uses ShakePay can easily confirm their legitimacy and I have been stacking free Satoshis for a few years now.   \r  \n\r  \n2. Since I actually want to own the underlying asset, I withdraw my Bitcoin from both of those exchanges and I put my assets into a cold storage wallet. In Canada, this is currently the cheapest method of accumulating Bitcoin and truly owning the assets by storing them \"offline\" in a cold storage wallet. However, in order to unlock the ShakingSats feature in ShakePay to earn free Bitcoin, you will need to be referred as per their current terms and conditions. I can assist you with that in addition to answering any general questions that you may have regarding buying, selling, converting, and taxation-related issues if you want to message me directly as I am always willing to help educate others in this space with whatever knowledge and/or experience that I have gained over the years.\r  \n\r  \n3. If you want tax free capital gains, you can buy BTCX, ETHX or BTCC in your TFSA. With that said, you do not truly own crypto with any of those because they are a fund; and therefore, you own shares of the fund and not the asset itself. As the saying goes and as you may have heard if you have done your due diligence: \"not your keys, not your crypto\". As such, you run and operate with all of the associated risks of leaving your coins on an exchange which is why I choose to own the real thing and use a cold storage wallet. The products mentioned above are not completely insured. Big risk, but tax free/deferred in a TFSA/RRSP.\r  \n\r  \n4. You may have heard of a Canadian company named Quadriga. In short, many investors did not truly own their Bitcoin with them since Quadriga sold \"entitlements to receive crypto assets or fiat currency from Quadriga\" while Quadriga held the \"keys\" to the real Bitcoin and investors lost around 135 million dollars CAD, but up to 250 million dollars CAD according to Wikipedia. This is verifiable information, a famous story, and a perfect example of \"not your keys, not your crypto\" as well as a lack of insurance of clients. Also, as of April, 22, 2021, Thodex, an exchange with 400,000 users went offline while Interpol issued a red notice for its CEO who mysteriously disappeared. According to Fortune,  an international manhunt is currently underway to locate the CEO and secure $2 billion in digital tokens he allegedly embezzled from Thodex.\r  \n\r  \n5. Unfortunately, with BTCC, ETHX, and WealthSimple Crypto, you cannot take your Bitcoin off of their exchanges because, again, you do not truly own Bitcoin with them. Rather, you own shares of the fund whereas those organizations truly own the asset since they have the \"keys\". They are the ones who own the real asset (crypto) and simply run the fund with the crypto backing that fund as they make money through their ridiculously overpriced premiums and spread/fees (WealthSimple's spread is around 1.5-2.0% if not higher and BTCC's MER is about 1%).\r  \n\r  \n6. In regards to taxes, if you truly own the crypto-asset, it is subject to capital appreciation tax whenever you trigger a taxable event such as selling it, buying things with it, and/or converting crypto-to-crypto. As such, you need to be prudent in your bookkeeping behavior and calculate your adjusted cost base (ACB) for each transaction. There is no legal requirement forcing you to calculate your ACB for each transaction, but it just saves you a lot of headaches later on when you need to pay taxes. This is no different than investing in traditional equities in a taxable account after you have maxed out your TFSA, RRSP, RESP, etc.\r  \n\r  \n7. Before you invest in anything regardless of the asset class, make sure you understand what you are putting your money towards, understand your risk tolerance, understand the proper asset allocation percentages for your risk tolerance, and formulate a clear plan of what you want to achieve. For me, the biggest investment is not really crypto itself, but rather, it is in the application of blockchain technology which serves as a massive global public ledger as well as the decentralization of this digital store of value combined with its independence from overbearing governing bodies whereby the crypto-assets itself simply have a monetary value relative to fiat currency. \r  \n\r  \nNow, here are some general points of interests to help you understand cold storage wallets:\r  \n\r  \n1. There is a big misconception that if you decide to operate as your own bank (i.e.truly own your Bitcoin) and use a cold storage wallet device (i.e. physical hardware connected via USB to your PC), that your assets (Bitcoin) will be transferred and stored onto that physical USB device. This is the part that confuses a lot of people. In short, Bitcoin is not stored on that device, it will never be stored there, and this is because Bitcoin can never leave its \"blockchain\".\r  \n\r  \n2. So, what does your cold storage device do? The device allows you to have a \"key\" to your asset (Bitcoin) on the blockchain. How is this \"key\" established? Without going too deep into the technical aspects, when you initially setup the hardware wallet device, you will be given a 24-word \"seed phrase\" and it is literally 24 words. From a computer science perspective, this 24-word \"seed phrase\" actually represents and is transcribed into a huge series/string of alphanumeric characters. This 24-word \"seed phrase\" is essentially your \"keys\" to your assets on the blockchain.\r  \n\r  \n3. Your 24-word \"seed phrase\" is what is most important if you decide to act as your own bank and truly own Bitcoin since this is what gives you access to it. It does not matter if you lose your physical device and it does not matter if your physical device was destroyed. Why? Again, your assets are on the blockchain and not on the physical device. So, if you lose your physical device, you can simply replace it with another one (and this can be one from a different manufacturer too), set it up with your original 24-word \"seed phrase\" and you will once again have access to your assets since they are on the blockchain. In essence, never lose your \"keys\" because then you will have truly lost your Bitcoin. \r  \n\r  \n4. As you can probably see now, your 24-word \"seed phrase\" is extremely important (and more important than the physical hardware device itself). Therefore, when you first take note of your 24-word \"seed phrase\" during the initial setup of your physical hardware device, make sure that no one is watching, there are no cameras around you (including your mobile phone), etc. Only you should know your \"keys\". Never type it out on any digital device, never e-mail it to yourself, never take a photo of it, never upload it to a cloud database such as Google Docs and never try to encrypt it and put it on a regular USB drive. You want this 24-word seed phrase as private as possible. So, if anyone/anything asks you for your \"keys\", never give it out. Period.\r  \n\r  \nDisclaimer: I am irresponsibly long Bitcoin/Ethereum and I sincerely hope that this has been helpful to you and good luck!",
        "created_utc": 1636000208,
        "id": "hj8txl8",
        "permalink": "/r/CanadianInvestor/comments/qmca3d/i_want_to_invest_into_crypto_but_idk_if_its_worth/hj8txl8/",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1636029008.0
    },
    {
        "author": "FortyTwoDonkeyBalls",
        "body": "I was subbed to /r/Bitcoin 12-13 odd years ago when it was selling for fractions of a cent and people tipped each other in bitcoin directly on the subreddit. I'm fairly certain I had bought 100 bucks worth but have long since lost the hard drive, after almost forgetting about it for a decade. If I still had that harddrive it would be worth millions. Now it's lost for eternity.\n\nI have another friend who had a cannabis delivery business back around 2014-2015 and the whole business ran on bitcoin. The business went under and she never cashed out the bitcoin. she forgot her passwords/keys for her wallet. She also lost millions in gains.\n\nThere's no sense in going back and looking at your past sells or losses. The chances that you, I, or anyone else would have hung on to those shares while they went up exponentially is so small that it's not even worth thinking about. The people who did have nerves of steal that may eventually cost them everything they've earned.",
        "created_utc": 1636024072,
        "id": "hj9neou",
        "permalink": "/r/StockMarket/comments/qma6bw/the_seeking_alpha_portfolio_i_sold_and_abandoned/hj9neou/",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1636052872.0
    },
    {
        "author": "OddLogicDotXYZ",
        "body": "Can anyone explain $ARQQ's actual technology? I haven't been able to find a good debrief of what makes issuing quantum keys from satellites more secure then other methods and worth the extra high valuation. Its good to see industry buy in already so that gives me a little bit of confidence in them, of course some thought Theranos was worth a damn too so you never know.",
        "created_utc": 1636478060,
        "id": "hjyguhy",
        "permalink": "/r/SPACs/comments/qq7a6p/arqq_arqit_quantum_massive_return_potential_by/hjyguhy/",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1636506860.0
    },
    {
        "author": "merlinsbeers",
        "body": "*Then we'll take they keys.*",
        "created_utc": 1635879592,
        "id": "hj1oayb",
        "permalink": "/r/stocks/comments/ql1oa6/musk_says_hertz_deal_isnt_signed_and_questions/hj1oayb/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635908392.0
    },
    {
        "author": "confused-caveman",
        "body": "Can't wait to use my Rivian Keychain for my Nissan keys.",
        "created_utc": 1637133392,
        "id": "hkymqhq",
        "permalink": "/r/wallstreetbets/comments/qvo2v1/you_people_make_me_sick_rivian_is_clearly/hkymqhq/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1637162192.0
    },
    {
        "author": "fortheloveoftendies",
        "body": "He did.  He even refused to return my key deposit and had his real estate agent harass me for the keys, it gave me great pleasure to tell him I don't know if this guy is new to email but he shouldn't have put literally everything in writing. I also did not return the keys.",
        "created_utc": 1637973181,
        "id": "hm7tmgn",
        "permalink": "/r/wallstreetbets/comments/r2t0k1/weekend_discussion_thread_for_the_weekend_of/hm7tmgn/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1638001981.0
    },
    {
        "author": "ApopheniaPays",
        "body": "TQQQD keys with volatility. Yes, if the underlying trade sideways Inn arrange for a year, then yes, at the end of the year a 3x leveraged ETF has lost value.",
        "created_utc": 1638064221,
        "id": "hmcjb2h",
        "permalink": "/r/stocks/comments/r3mvha/whats_your_opinion_on_tqqq/hmcjb2h/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1638093021.0
    },
    {
        "author": "whitebandit",
        "body": "ya know.. this would actually be ridiculously powerful if a thing... people getting evicted could maliciously create copies of keys, hidden points of entry (without breaking shit), passcodes for doors etc, posting and sharing in an app... crowdsource squatting and homelessness!",
        "created_utc": 1636499363,
        "id": "hjzy0z0",
        "permalink": "/r/wallstreetbets/comments/qq659t/best_way_to_profit_on_the_us_housing_situation/hjzy0z0/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636528163.0
    },
    {
        "author": "brett4242",
        "body": "I'm not a crypto guy, but I've looked into this before, and the best I found was this whitepaper: https://arqit-res.cloudinary.com/image/upload/v1621265326/WhitePapers/Facing_the_quantum_threat_v2_jy9cx2.pdf \n\nMy read is that there is some known kind of secure method of creating keys using satellites and quantum physics that has been studied, but the claim is that ARQQ can do the same thing without the satellites just over TCP/IP, then they don't give any details on how it works.  Also the key creation is peer-to-peer, but also requires involvement with a cloud service for some reason.",
        "created_utc": 1636483457,
        "id": "hjyuife",
        "permalink": "/r/SPACs/comments/qq7a6p/arqq_arqit_quantum_massive_return_potential_by/hjyuife/",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1636512257.0
    },
    {
        "author": "dao1103",
        "body": "$Keys",
        "created_utc": 1636791469,
        "id": "hkfqp7a",
        "permalink": "/r/stocks/comments/qsqnak/what_stock_not_discussed_here_often_do_you_have/hkfqp7a/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636820269.0
    },
    {
        "author": "MakingBigBank",
        "body": "Where is the alt + f4 keys on my iPhone",
        "created_utc": 1637539270,
        "id": "hlkqm75",
        "permalink": "/r/wallstreetbets/comments/qz4b1v/what_are_your_moves_tomorrow_november_22_2021/hlkqm75/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1637568070.0
    },
    {
        "author": "Long-Now-to-Forever",
        "body": "Agree with everything you’re saying, these are long term plays for me. Ketamine doesn’t get as much attention as the plant-based psychedelics, but as someone who was cured by ketamine of lifelong, treatment-resistant depression, I know the potential and that the door is just beginning to open. I like EHVVF’s technology (dashboard) and PHRRF’s patented micro needle patch as the keys to their growth in the next few years.",
        "created_utc": 1635896541,
        "id": "hj2vgys",
        "permalink": "/r/shroomstocks/comments/qlgcdl/ehvvf_phrrf_anyone_long_on_these_i_like_the/hj2vgys/",
        "score": 3,
        "subreddit": "shroomstocks",
        "created": 1635925341.0
    },
    {
        "author": "Gy7479",
        "body": "Well you create an account with them, then open a BTC or Eth wallet and send your crypto using the wallet adress (Bitcoin to Bitcoin, Eth to Eth). You have one free withdrawal per month, no length terms. Blockfi is only lending to institutions. Please take the time to read their whole website and FAQ, and take the time to read about sending and receiving cryptos, gas fees (transfer fees that you pay for every transaction), etc. I treat my cryptos like my stocks: long term hodler, passive income, aiming for 5% in cryptos for my portfolio. Mainly Btc and Eth, will add a few smaller coins eventually. \n\nAs usual, not your keys not your coins warning.",
        "created_utc": 1635775763,
        "id": "hivvreo",
        "permalink": "/r/CanadianInvestor/comments/qkeect/why_do_people_buy_crypto/hivvreo/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1635804563.0
    },
    {
        "author": "giovanny2214",
        "body": "Someone sounds impaired. Someone take this girl’s keys away from her",
        "created_utc": 1636162216,
        "id": "hjhv7wr",
        "permalink": "/r/wallstreetbets/comments/qnjay6/weekend_discussion_thread_for_the_weekend_of/hjhv7wr/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636191016.0
    },
    {
        "author": "Lunar_Horticulture",
        "body": "Could happen to any if us. Or the cheeto dust jams the keys.",
        "created_utc": 1636303577,
        "id": "hjox8ft",
        "permalink": "/r/wallstreetbets/comments/qooebv/elons_playing_4d_chess/hjox8ft/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636332377.0
    },
    {
        "author": "Captain-Whoopass",
        "body": "Controlling your emotions is one of the major keys to success. Most bullshit in peoples lives is preventable.",
        "created_utc": 1636345385,
        "id": "hjrmcyk",
        "permalink": "/r/wallstreetbets/comments/qoxpdh/what_are_your_moves_tomorrow_november_08_2021/hjrmcyk/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636374185.0
    },
    {
        "author": "silent_johnn",
        "body": "It's not a risk if you posses your own private keys. Literally nobody can steal your crypto unless you give up your private keys / seed phrase.\n\nThere is smart contract risk, but that's not what you're referring to",
        "created_utc": 1636836691,
        "id": "hki0d8v",
        "permalink": "/r/investing/comments/qt54cg/memecoins_dumber_than_you_think/hki0d8v/",
        "score": 3,
        "subreddit": "investing",
        "created": 1636865491.0
    },
    {
        "author": "gh0stFL",
        "body": "Who got the keys to mah muhfugndiehwnxixnsn",
        "created_utc": 1637164847,
        "id": "hl01d1d",
        "permalink": "/r/wallstreetbets/comments/qvizxf/250000_on_zim_pe_of_29/hl01d1d/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1637193647.0
    },
    {
        "author": "toydan",
        "body": "Came back from FL keys. \n\nWat do you mean on PLTR? I went heavier in it btw. \n\nAlso hi",
        "created_utc": 1636331057,
        "id": "hjqsxvw",
        "permalink": "/r/wallstreetbets/comments/qnjay6/weekend_discussion_thread_for_the_weekend_of/hjqsxvw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636359857.0
    },
    {
        "author": "uncfarmasea",
        "body": "Custom hot keys in TradingView \n\nHey all,\n\nFor those that use TradingView for charting/trading with a linked broker - is there a way to create custom hot keys to use during trading? They have a preset selection, but only 2 are about actual trading and they’re buy/sell at market price. I’d like to have a way to create hot keys around limit orders if able.\n\nFor example, Up + B is buy at market and Up + S is sell at market. I have my TradeStation acct linked to TradingView as I have limited monitor space at work. I can use the DOM but it hops around a lot and is sometimes difficult. I’m trying to figure out the fastest way possible\n\nAlso curious as to how many day/swing trade using VWAP and/or 9ema setups? How many trades do you typically take per day with these? Thanks!",
        "created_utc": 1636426468,
        "id": "hjw09uk",
        "permalink": "/r/investing/comments/qpagnt/daily_advice_thread_all_basic_help_or_advice/hjw09uk/",
        "score": 2,
        "subreddit": "investing",
        "created": 1636455268.0
    },
    {
        "author": "silent_johnn",
        "body": "1. You're changing the issue to make some sort of point. Before it was getting funds stolen, now it's losing your keys, what's next?\n\n2. You can recover your keys using smart contract wallets like argent.",
        "created_utc": 1636838413,
        "id": "hki4b6i",
        "permalink": "/r/investing/comments/qt54cg/memecoins_dumber_than_you_think/hki4b6i/",
        "score": 2,
        "subreddit": "investing",
        "created": 1636867213.0
    },
    {
        "author": "BreakinBETA",
        "body": "Shit…I can’t find my keys now….",
        "created_utc": 1636946828,
        "id": "hkod97n",
        "permalink": "/r/wallstreetbets/comments/qtzc0g/what_are_your_moves_tomorrow_november_15_2021/hkod97n/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636975628.0
    },
    {
        "author": "MoneyNinja23",
        "body": "Wendys fired me for using my janitorial keys to conduct a side hustle to pay for my stock losses… I just applied at Arby’s … more meat there anyways…",
        "created_utc": 1637944537,
        "id": "hm6456e",
        "permalink": "/r/wallstreetbets/comments/r1v4rc/inflation_isnt_real/hm6456e/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1637973337.0
    },
    {
        "author": "RandoStonian",
        "body": "Basically, yeah. A Bitcoin network address (and the private key that came with it) can act as an identifier, and can serve as a kind of extra-secure passkey. \n\nProperties of the Bitcoin network effectively grant every entity who has a Bitcoin address an encrypted communications system, where anyone can use the public address to encrypt a message that can only be decrypted by the address's private send-key. \n\nLikewise, the owner's private send-key can be used to encrypt messages that can be decrypted using the public receiving address, proving account ownership without revealing any secret keys to anyone.\n\nI would say that units of bitcoin are effectively a measure of how much data a given account/address would be allowed to write to the public ledger. In the right hands, a small amount of written data, secured this way can be *very* valuable to different types of services that might want to borrow security from an established system, rather than come up with a new security setup from scratch (and all the headaches that comes with).",
        "created_utc": 1638213027,
        "id": "hmkcqu4",
        "permalink": "/r/investing/comments/r3sqf5/the_dotcom_bubble_any_documentary_recommendations/hmkcqu4/",
        "score": 2,
        "subreddit": "investing",
        "created": 1638241827.0
    },
    {
        "author": "reddituserzerosix",
        "body": "Only he has keys to the toner cabinet",
        "created_utc": 1636480388,
        "id": "hjyms39",
        "permalink": "/r/wallstreetbets/comments/qq19w5/daily_discussion_thread_for_november_09_2021/hjyms39/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636509188.0
    },
    {
        "author": "rioferd888",
        "body": "Alexa play fallin' by Alicia Keys.",
        "created_utc": 1637764324,
        "id": "hlwjxel",
        "permalink": "/r/wallstreetbets/comments/r12ms8/daily_discussion_thread_for_november_24_2021/hlwjxel/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1637793124.0
    },
    {
        "author": "The_Colorman",
        "body": "The article obviously didn’t give you the correct information. That’s the problem with some Tesla coverage.  The app still worked, your phone key is a bluetooth connection from phone to car.  What was down was the remote server side controls.  So if I walked up to my car it still unlocked and worked.  If I was on the other side of the house and wanted to preheat my car it couldn’t connect to the car. It was the same affect if ATT cell service was down, or the car was in an underground garage.  \n\nThe only people it could have truly affected were people trying to re-pair their car keys (which you need the key card for) or the weird situation which you let someone borrow your car and your remote unlock/start for them (which is kinda sketchy to rely on the cell for). Other than that I can’t imagine a situation besides trying to summon/preheat/adjust charging time/etc that would be more than a minor inconvenience.  \n\nWhen my Volvo remote app was down for a day I never saw articles about it.",
        "created_utc": 1637510665,
        "id": "hlit774",
        "permalink": "/r/StockMarket/comments/qyd1y0/car_company_or_tech_company_tesla_drivers_left/hlit774/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1637539465.0
    },
    {
        "author": "ClumpOfCheese",
        "body": "You realize it was just people not being able connect to their car over the internet right? You don’t need to be connected to a server to get in or start the car, if that were the case Tesla owners would be stranded anywhere there’s no cell service. The keys use Bluetooth on the phone to connect when you’re within a few feet of the car.",
        "created_utc": 1637434909,
        "id": "hlf0nud",
        "permalink": "/r/wallstreetbets/comments/qy5u2q/tsla_puts_back_on_the_menu_monday_tesla_drivers/hlf0nud/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1637463709.0
    },
    {
        "author": "DarthBuzzard",
        "body": "Brick cellphones suck. They are impossible to use without looking silly.\n\nClunky PCs suck. They require a degree to use and are very slow.\n\nTouch interfaces suck. They aren't accurate enough and I prefer my tactile keys.",
        "created_utc": 1638150839,
        "id": "hmh80xq",
        "permalink": "/r/wallstreetbets/comments/r436ij/apples_vision_of_the_metaverse_does_not_include/hmh80xq/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638179639.0
    },
    {
        "author": "itsalliefersure",
        "body": "I want my crypto keys. I’m in NY and banned from Coinbase. I can’t buy on any other “exchange”",
        "created_utc": 1635874059,
        "id": "hj1a499",
        "permalink": "/r/StockMarket/comments/ql6lpt/2_years_with_a_2k_investment/hj1a499/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1635902859.0
    },
    {
        "author": "bananagramarama",
        "body": "I have not—I opened the account but haven’t funded it yet. Trying to learn the interface and hot keys with paper trading first. How do you like ToS? Do you feel like the better fills are worth the fees?\n\nNote that the latest version of Webull Desktop removes this 0dte warning—though I believe it’s still on mobile, and the 2:00pm restriction still stands regardless of platform.",
        "created_utc": 1635885969,
        "id": "hj24vyv",
        "permalink": "/r/options/comments/pz05hr/td_vs_webull/hj24vyv/",
        "score": 2,
        "subreddit": "options",
        "created": 1635914769.0
    },
    {
        "author": "Printer-Pam",
        "body": "A QC with 4000 qubits can crack the private keys and steal crypto from public addresses",
        "created_utc": 1637051156,
        "id": "hktxwa7",
        "permalink": "/r/StockMarket/comments/qut84x/quantum_computing_is_it_better_to_invest_in_a/hktxwa7/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1637079956.0
    },
    {
        "author": "WilliamSaintAndre",
        "body": "Where are you getting the data from? Do you have any issues scraping the data or sourcing it? I only ask because I remember someone mentioning a similar setup in another subreddit and they mentioned having to cheese some free access site with multiple API keys.",
        "created_utc": 1638237406,
        "id": "hmly25d",
        "permalink": "/r/pennystocks/comments/r55oii/swingbot_did_the_damn_thing_today/hmly25d/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1638266206.0
    },
    {
        "author": "trackrecord330",
        "body": "Buffett made Nancy squirt on the keys again",
        "created_utc": 1635806730,
        "id": "hixx5wv",
        "permalink": "/r/wallstreetbets/comments/qkmd3z/what_are_your_moves_tomorrow_november_02_2021/hixx5wv/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635835530.0
    },
    {
        "author": "mywifesBF69",
        "body": "Dude the dog, the gecko and the shrimp, where my keys toted land. I hate the apes",
        "created_utc": 1636303285,
        "id": "hjowhl5",
        "permalink": "/r/wallstreetbets/comments/qnjay6/weekend_discussion_thread_for_the_weekend_of/hjowhl5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636332085.0
    },
    {
        "author": "CrazyAsparagus",
        "body": "&gt; And without any of the protections afforded to traditional finance. You keep glossing over that. Oh, you transferred to the wrong address? Can't revert the blockchain. Your keys got hacked and lost your funds? Can't revert the blockchain.\n\nI actually didn't gloss over it - I didn't address it at all. There's a difference. \n\nI didn't address it because I didn't feel it was important to your point that BTC transactions were $75. \n\nThe concept you're talking about is immutability. You're framing it as a downside, but that is actually by design. Surely you can think of reasons people might see it as a positive. \n\n&gt; Based on actual crypto in the real world - this isn't true at all. \n\nOf course it's true, there's a sizable amount of transactions happening on altcoin chains. Bitcoin and ethereum market cap aren't directly proportional to transaction volume. For example, BCH has 25% trading volume relative to BTC and costs pennies per transaction. \n\nAnd again, both BTC and ETH are developing solutions to address the issue right now.",
        "created_utc": 1636855047,
        "id": "hkj6i8u",
        "permalink": "/r/investing/comments/qt54cg/memecoins_dumber_than_you_think/hkj6i8u/",
        "score": 2,
        "subreddit": "investing",
        "created": 1636883847.0
    },
    {
        "author": "ybnesman",
        "body": "Raleigh is my venue. Saw Dead and Co, Phish, the flaming lips open for the Black Keys, Widespread Panic, the Allman Brothers good vibes at that venue",
        "created_utc": 1638300751,
        "id": "hmp7sap",
        "permalink": "/r/wallstreetbets/comments/r5kuzn/daily_discussion_thread_for_november_30_2021/hmp7sap/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638329551.0
    },
    {
        "author": "OverweightRoshan",
        "body": "Bitcoin will become a deflationary asset because when there is no more Bitcoin added to the circulating supply then the only move from there is less Bitcoin available as people lose their keys.",
        "created_utc": 1638294004,
        "id": "hmoqqzh",
        "permalink": "/r/investing/comments/r5nanm/is_inflation_really_transitory_can_it_develop/hmoqqzh/",
        "score": 2,
        "subreddit": "investing",
        "created": 1638322804.0
    },
    {
        "author": "TheRootOfMostEvil",
        "body": "The keys to financial independence are meme stocks and cryptos. 🔑🔑",
        "created_utc": 1635785768,
        "id": "hiwidpk",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiwidpk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635814568.0
    },
    {
        "author": "VisualMod",
        "body": "&gt;\\*Keysight Technologies Says NEC Europe Selected It to Create an Advanced Radio Frequency Propagation Environment \n$KEYS\n\n^\\*Walter ^Bloomberg ^[@DeItaone](http://twitter.com/DeItaone) ^at ^2021-11-02 ^11:01:55 ^EDT-0400",
        "created_utc": 1635865329,
        "id": "hj0om1e",
        "permalink": "/r/wallstreetbets/comments/ql0v5g/daily_discussion_thread_for_november_02_2021/hj0om1e/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635894129.0
    },
    {
        "author": "LeDamien19",
        "body": "What is the intrinsic value there really ? I think it s hard to define. The value it currently has is defined by how many ppl believe in it. And for btc thats crazy really, seeing that it s by far not the best one. \n\nI have yet to be convinced of its advantages. I see potential for other areas but not currencies. That crazy argument that it s decentralized usually gets thrown around. Yea that technically true but 1) usually ppl store their keys at some entity, and that s a whole lot like a bank. It can get stolen and is what, oh wait centralized. And 2) there are whales or big players. And they can manipulate the market indirectly. So that sort of seems like something that should be avoided as well. Power to the masses yeah right. Besides the argument that there s almost no transaction fees.... That s also not true for pow coins. Someone does pay something. And that is computer power that could be better used to cure cancer instead.... Honestly, i dont see why it would be a valid alternative to real money. I dont think the monetary authorities have done such a bad job. \nOf course i m open to change my opinion. But so far most ppl are invested in it to play lottery and make a quick buck. And that i dont wanna support",
        "created_utc": 1635839479,
        "id": "hizjpzm",
        "permalink": "/r/ValueInvesting/comments/qkqhj1/what_do_you_guys_think_about_crypto_currency/hizjpzm/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1635868279.0
    },
    {
        "author": "zaphdingbatman",
        "body": "the keys are like right next to each other.",
        "created_utc": 1636084882,
        "id": "hjdjhvh",
        "permalink": "/r/wallstreetbets/comments/qmnmxk/elon_to_the_moon_confirmed_bezos_blue_origin/hjdjhvh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636113682.0
    },
    {
        "author": "SuienReizo",
        "body": "It is not a lack of drivers. It is a lack of those who meet the requirements now that California has the California Truck Ban that says all trucks must be 2011 or newer combined with a law called AB 5 which ended up being a boon for people who drive directly for a single employer like Uber or Safeway or who are independent contractors but the changes negatively impacted owner-operators which make up a not insignifcant amount of trucking logistics in the state.\n\nAB 5 establisheds the ABC test to determine employee or independent contractor.\n\n 1. Is the person hired given extensive freedom in how about they go accomplishing the   \n task?  \n\r  \n 2. Is the work performed done outside of the hiring company’s normal business   \n operations?  \n\r  \n 3. Is the person hired a member of an established business for the line of work they are   \n doing?\n\nIf one of the above fails, they are considered an employee.\n\nThe goal of AB 5 was to prevent worker abuse from Uber and Lyft, and unitentionally or intentionally it affects truckers as well due to the wording that affected companies like Landstar System which started moving out of California as a result of it due to it labeling them as a shipping/logisitics business and since the owner-operators are doing logisitics/shipping work, they must be employees despite the owner-operators not being forced to take any dispatches, they choose their own loads they want to do.\n\n If the owner-operator on his own authority hauls chairs on behalf of Costco from California to Texas and isn't given a specific route to take:\n\n 1. The driver has the freedom to determine how he will get the truckload to its destination.  \n\r  \n 2. Costco's primary business is wholesale/retail, not shipping products.  \n\r  \n 3. The owner-operator is a member of his own trucking business.\n\nWith all of those met, they are an independent contractor.\n\nNow, consider owner-operators taking dispatches through a company like Landstar System.\n\n1. The driver has the freedom to determine how he will get the truckload to its destination.\n\n2. Landstar System's primary job is shipping/logistics, the same as the owner-operator they got the dispatch from.\n\n3. The owner-operator is a member of his own trucking business.\n\nTaking a dispatch from Landstar System fails check 2, so now they are employees rather than independent contractors despite being owner-operators of their trucks.\n\nLong term truckers in the state aren't investing in new trucks because California has a law that makes those illegal in 2035, as the next requirement will be to purchase electric tricks which do not exist yet. So they are going to hold onto anything they already have that meets the requirements.\n\nThese problems are completely left out of discussion because no one wants to talk about how policies they passed built this shitstorm up. Anything coming out of California is affected by its state regulations.\n\nOn top of that, I can't imagine they are just going to let a 18-21 year old 88M who they can't trust to drive across a base alone to drive across -states- alone and then you run the matter of handing over the keys to vehicles they aren't trained on nor have any care for.",
        "created_utc": 1636639083,
        "id": "hk7as0u",
        "permalink": "/r/stocks/comments/qriwag/im_a_importer_in_my_point_of_view_the_true_cost/hk7as0u/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636667883.0
    },
    {
        "author": "A_KY_gardener",
        "body": "try transferring those coins after being handed the keys and signing the payment forms for squid token.\n\nbetter yet, just give em your wallet address, its their problem now.",
        "created_utc": 1636594909,
        "id": "hk5c48t",
        "permalink": "/r/wallstreetbets/comments/qr41y7/what_are_your_moves_tomorrow_november_11_2021/hk5c48t/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636623709.0
    },
    {
        "author": "silent_johnn",
        "body": "&gt;A simple Google search will return hundreds of incidents of Crypto being stolen via hacking\n\n...from people who do not have their private keys (coins held on central exchange), or give their keys to somebody (getting scammed, etc). By the way, many banks do not cover funds lost due to customer negligence either....\n\n&gt;This really just proves my point.\n\nYou didn't prove anything, other than your lack of knowledge about crypto.",
        "created_utc": 1636840023,
        "id": "hki81y1",
        "permalink": "/r/investing/comments/qt54cg/memecoins_dumber_than_you_think/hki81y1/",
        "score": 1,
        "subreddit": "investing",
        "created": 1636868823.0
    },
    {
        "author": "kkInkr",
        "body": "My solid picks, ZTS(sorry, not tech), SNPS, CDNS, TER, AXON. I like A (maybe not so tech). KEYS good too. Some mid cap to get, SYNA, LSCC, AMBA, LITE, INTT, ZUO, ACLS, find the related stocks of them under Yahoo Finance, you will find a bunch more. VUZI, $EMAN, $KOPN, $MVIS, $CETX and related stocks are pretty doped too, talking about potentials.",
        "created_utc": 1637430282,
        "id": "hleplel",
        "permalink": "/r/stocks/comments/qxyjzz/what_is_the_next_great_tech_stock/hleplel/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1637459082.0
    },
    {
        "author": "RecommendationNo6304",
        "body": "To piggyback on these suggestions..\n\n*A business owner drops off the keys and walks away from the lease obligation.* This happens more often than the public might realize.\n\nOften there's nothing for the lender to do but eat it. Can't squeeze blood from a stone.\n\nBeware of a bank with a significant portfolio of commercial lending. During a recession this cascade can break a bank with surprising speed.",
        "created_utc": 1637181806,
        "id": "hl18eu4",
        "permalink": "/r/ValueInvesting/comments/qulv7v/best_books_to_learn_about_banking_industry/hl18eu4/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1637210606.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Friday, the 19th of November\n\n\n\n## Upcoming events for Friday, November 19th\n\n - Expected earnings:\n\n  ADIL, AENZ, BKE, CCNC, CIG, CJJD, DUO, DXPE, ENIC, ENLV, FL, GOTU, LVRA, MOXC, PFSW, QNRX, RKTA, RLX, SFUN, SY, TKAT, TOUR, TPGS, UK, UNAM, WVFC, YI\n\n - Ex-div:\n\n  AATC, ADX, AEIS, AFT, AIF, ALSN, AOMR, ARDC, BGB, BGX, BSL, BWG, CDRE, CEM, CRD.A, CRD.B, CTR, DFP, DLX, DMO, DX, EHI, EMD, EMO, FFC, FHB, FLC, GDO, GHLD, GSL, HIO, HIX, HNI, HVT, HVT.A, HYI, IGI, JRSH, MMU, MSBI, NATH, NCMI, NKSH, NLOK, OGN, OWL, PAAS, PEO, PFD, PRI, R, RDN, SBI, SPB, TIPT, TKR, TSCO, UIHC, UPS, WDI, WEA, WIA, WIW, WPM\n\n - Economic events and announcements:\n\n    - Building Permits (previous: -7.8%)\n    - CFTC Aluminium speculative net positions (previous: 4.0K)\n    - CFTC Copper speculative net positions (previous: 22.8K)\n    - CFTC Corn speculative net positions (previous: 375.3K)\n    - CFTC Crude Oil speculative net positions (previous: 421.3K)\n    - CFTC Gold speculative net positions (previous: 250.2K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 16.2K)\n    - CFTC Natural Gas speculative net positions (previous: -142.2K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 97.6K)\n    - CFTC Silver speculative net positions (previous: 36.9K)\n    - CFTC Soybeans speculative net positions (previous: 27.6K)\n    - CFTC Wheat speculative net positions (previous: 19.2K)\n    - FOMC Member Clarida Speaks\n    - Fed Waller Speaks\n    - U.S. Baker Hughes Oil Rig Count (previous: 450)\n    - U.S. Baker Hughes Total Rig Count (previous: 550)\n\n## Upcoming events for Monday, November 22nd\n\n - Expected earnings:\n\n  A, ADMP, AEI, AFYA, AHPI, ANAT, ARWR, ATNF, AVAL, AVCO, AVYA, BBIG, BRTX, BSFC, CANG, CARV, CENT, CENTA, CHAA, COE, CREG, CRNC, CTIB, CUEN, DLPN, DSS, ELYS, ENTA, ENVB, FEDU, FFHL, FNA, FRD, FTFT, GAME, GNSS, GOBI, HEPA, IBEX, JAN, JP, KEYS, KFY, KMDA, LIZI, LMFA, LWLG, METX, MLVF, MPAC, MSN, MTR, MULN, NES, NIU, NM, NUZE, ONE, QIPT, SINT, SJ, SR, TNP, TUYA, TWST, UCL, URBN, UUU, VVPR, ZH, ZM\n\n - Ex-div:\n\n  B, BC, BGCP, EFR, EFT, EOI, EOS, EOT, ETB, ETG, ETJ, ETO, ETV, ETW, ETX, ETY, EURN, EVG, EVT, EXD, EXG, FGB, FLMN, FMN, GER, GPRK, HE, HEES, HFRO, HGLB, HIE, HP, IGT, ITUB, JNJ, MCO, MFD, NDP, NTG, NXDT, PHX, PIPR, PPT, PRU, STE, SWKS, TPZ, TS, TTP, TYG, VTRS, WLK, WMG, XYL\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.481%)\n    - 3-Month Bill Auction (previous: 0.045%)\n    - 5-Year Note Auction (previous: 1.157%)\n    - 6-Month Bill Auction (previous: 0.065%)\n    - Chicago Fed National Activity (previous: -0.13)\n    - Existing Home Sales (consensus: 6.20M, previous: 6.29M)\n    - Existing Home Sales (previous: 7.0%)\n\n^^^^2021-11-19",
        "created_utc": 1637319613,
        "id": "hl8ouyz",
        "permalink": "/r/RobinHood/comments/qxduxc/daily_discussion_thread_november_19th_2021/hl8ouyz/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1637348413.0
    },
    {
        "author": "lianna1040",
        "body": "A friend of mine is like that. He forgot his keys. Now there is one last chance left.",
        "created_utc": 1637317834,
        "id": "hl8mltt",
        "permalink": "/r/investing/comments/qx0aft/whats_the_biggest_loss_youve_taken/hl8mltt/",
        "score": 1,
        "subreddit": "investing",
        "created": 1637346634.0
    },
    {
        "author": "Specialist_Coffee709",
        "body": "Keys are sold separately, new model every year👍",
        "created_utc": 1637266343,
        "id": "hl5w70a",
        "permalink": "/r/wallstreetbets/comments/qwvbr5/apple_ev/hl5w70a/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637295143.0
    },
    {
        "author": "getsomemoney44",
        "body": "Wait what happened to $keys",
        "created_utc": 1637665315,
        "id": "hlr6ukw",
        "permalink": "/r/wallstreetbets/comments/r0asp7/daily_discussion_thread_for_november_23_2021/hlr6ukw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637694115.0
    },
    {
        "author": "bzboy",
        "body": "You didnt get the insurance? I know it's a  ripoff, but I always pay it so that I can drop the keys off and walk out if anything happens to the car.  \n In the very least, your own car insurance may cover it, or maybe even the credit card you used to rent it.",
        "created_utc": 1637879939,
        "id": "hm368tl",
        "permalink": "/r/wallstreetbets/comments/r1u53o/daily_discussion_thread_for_november_25th_2021/hm368tl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637908739.0
    },
    {
        "author": "TheAntagonist202",
        "body": "You should do some research. The only way to lose bitcoin that you self custody is by downloading malicious software or giving a program or someone access to your keys. Also, if you have a hardware wallet, it is impossible to hack at this point in time.",
        "created_utc": 1637947695,
        "id": "hm6bd7v",
        "permalink": "/r/CanadianInvestor/comments/r28l9c/could_someone_explain_digital_currencies_like_im/hm6bd7v/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1637976495.0
    },
    {
        "author": "PULSARSSS",
        "body": "Yeah I had movers take my large furniture and after I got the bill for that I basically was like fuck that Ill do the rest. However, Now that im 72 hours away from turning keys in im also kinda wanting to bite the bullet",
        "created_utc": 1638065444,
        "id": "hmclvs6",
        "permalink": "/r/wallstreetbets/comments/r2t0k1/weekend_discussion_thread_for_the_weekend_of/hmclvs6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638094244.0
    },
    {
        "author": "KRiNG100",
        "body": "The bear was like BRUH CHILL WTF, I WAS JUST CHECKING THE KEYS INSIDE.....",
        "created_utc": 1638170430,
        "id": "hmi8nmq",
        "permalink": "/r/wallstreetbets/comments/r4hd3s/when_spy_drops_2/hmi8nmq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638199230.0
    },
    {
        "author": "UbbeStarborn",
        "body": "~If you don't mind me asking what area do you live? (Europe, US, etc) ?~ \n\nThere are endless ways to buy eth. Apps/Websites, etc. Keep in mind if you buy with a traditional broker they will likely not actually let you own the keys to the Crypto address. Binance, Coinbase, Kraken, Gemini, Crypto.com are some excellent options to buy. Gemini and Crypto.com will let you buy and trade with 0 fees for 30 days. Coinbase is known for having a little higher fees. Hope this helps.",
        "created_utc": 1636244047,
        "id": "hjm68x1",
        "permalink": "/r/StockMarket/comments/qnw9ks/why_you_really_shouldnt_care_about_market/hjm68x1/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1636272847.0
    },
    {
        "author": "ElectricCD",
        "body": "It was the pianist.  He was really working them keys.  Little did the director know that the cast was smoking meth to get into character.",
        "created_utc": 1636210624,
        "id": "hjk2c87",
        "permalink": "/r/weedstocks/comments/qmj8l7/biden_can_alter_us_pot_policy_without_congress/hjk2c87/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1636239424.0
    },
    {
        "author": "HydrocodonesForAll",
        "body": "What dumbass leaves their keys in the car? Your fault",
        "created_utc": 1636236927,
        "id": "hjlqpek",
        "permalink": "/r/wallstreetbets/comments/qnjay6/weekend_discussion_thread_for_the_weekend_of/hjlqpek/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636265727.0
    },
    {
        "author": "kk7766",
        "body": "The fact that AAPL is worth more than TSLA is a JOKE!!!! TSLA should be worth more than AAPL + MSFT + AMZN + GOOGL COMBINED. TSLA is the FUTURE. Everyone is gonna own 5 Teslas each in the future!!!! No other cars will exist!!!! People won't even walk anymore just ride around it Teslas!!!!!",
        "created_utc": 1635781218,
        "id": "hiw7t1p",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw7t1p/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1635810018.0
    },
    {
        "author": "dbgtboi",
        "body": "TSLA isn't just a car company, they are a tech company and valued like one!\n\nAMZN - P/E of 66\n\nMSFT - P/E of 37\n\nAAPL - P/E of 27\n\nGOOG - P/E of 29\n\nTSLA - P/E of 360",
        "created_utc": 1635768959,
        "id": "hivj9lb",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivj9lb/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1635797759.0
    },
    {
        "author": "ybnesman",
        "body": "MSFT to $400 seems to be otw",
        "created_utc": 1635766811,
        "id": "hivg360",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivg360/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635795611.0
    },
    {
        "author": "tmoney_99",
        "body": "Someone poke MSFT with a stick",
        "created_utc": 1635776589,
        "id": "hivxivx",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivxivx/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635805389.0
    },
    {
        "author": "weaponized_teletubby",
        "body": "MSFT you dirty whore. You’re supposed to 🚀 not limp dick and flip like a dead fish.",
        "created_utc": 1635779067,
        "id": "hiw2zkc",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw2zkc/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635807867.0
    },
    {
        "author": "maz-o",
        "body": "1% down from ATH is not a sizeable dip.\n\nThat said MSFT is always a good buy.",
        "created_utc": 1635781857,
        "id": "hiw99kt",
        "permalink": "/r/stocks/comments/qkaa5b/rstocks_daily_discussion_monday_nov_01_2021/hiw99kt/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635810657.0
    },
    {
        "author": "captain_americano",
        "body": "Did MSFT, APPL and GOOG say a really bad swear?",
        "created_utc": 1635774715,
        "id": "hivtlwa",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivtlwa/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635803515.0
    },
    {
        "author": "ybnesman",
        "body": "MSFT 2-18 390 calls might be my move",
        "created_utc": 1635767589,
        "id": "hivh7ux",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivh7ux/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635796389.0
    },
    {
        "author": "tmoney_99",
        "body": "NVDA and MSFT with the fake dump get in now bozos",
        "created_utc": 1635773694,
        "id": "hivrkqv",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivrkqv/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635802494.0
    },
    {
        "author": "boom_boom_man954",
        "body": "buying TSLA now is like buying MSFT in 1999! it's a great investment, but won't pay off for 18 years!",
        "created_utc": 1635773905,
        "id": "hivrzj0",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivrzj0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635802705.0
    },
    {
        "author": "curiousprovisions",
        "body": "TSLA coming after MSFT",
        "created_utc": 1635778805,
        "id": "hiw2f1e",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw2f1e/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635807605.0
    },
    {
        "author": "boom_boom_man954",
        "body": "buying TSLA now is like buying MSFT in 1999? yay or nay?",
        "created_utc": 1635780069,
        "id": "hiw57ex",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw57ex/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635808869.0
    },
    {
        "author": "RH_Fucked_My_Account",
        "body": "Bought MSFT calls. \n\nEZ money",
        "created_utc": 1635780081,
        "id": "hiw58d7",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw58d7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635808881.0
    },
    {
        "author": "VisualMod",
        "body": "&gt;FANG+ Constituents:\n\\&gt;$AAPL 149.65 -0.1%\n$AMZN 3384.87 +0.19%\n$BABA 164.73 -0.1%\n$BIDU 161.51 -0.52%\n$FB 327.34 +1.18%\n$GOOG 2972.75 +0.27%\n$NFLX 692.5 +0.24%\n$NVDA 259.01 +1.31%\n$TSLA 1146.47 +2.91%\n$TWTR 54.24 +1.33%\n\\&gt;$MSFT 332.95 +0.42%\n\n^IGSquawk ^[@IGSquawk](http://twitter.com/IGSquawk) ^at ^2021-11-01 ^05:36:34 ^EDT-0400",
        "created_utc": 1635759402,
        "id": "hiv6yrf",
        "permalink": "/r/wallstreetbets/comments/qjxg0m/what_are_your_moves_tomorrow_november_01_2021/hiv6yrf/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635788202.0
    },
    {
        "author": "Motor_Somewhere7565",
        "body": "DIS and MSFT will also give you some good growth and dividends. I'd also throw IIPR in there as being a safe winner in a highly speculative sector that has so much more growth and a satisfying dividend.  \n\n\nI own shares in all three. They've just made me happy while I've carried bags for my spec growth picks.",
        "created_utc": 1635775519,
        "id": "hivv92a",
        "permalink": "/r/stocks/comments/qk4nht/safe_stocks_for_savings/hivv92a/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1635804319.0
    },
    {
        "author": "I_Ron_Butterfly",
        "body": "This is a simplified example, sophisticated investors aren’t actually mocking out takeover scenarios, they’re modelling buying a cash flow, which can be calculated on a per share basis. \n\nRegardless, Microsoft could buy Apple using just its own shares right now. Or a mix of shares and cash. Extremely extremely unlikely, but it is possible.",
        "created_utc": 1635767993,
        "id": "hivhsyq",
        "permalink": "/r/investing/comments/qk7r5b/why_do_stocks_have_any_value/hivhsyq/",
        "score": 4,
        "subreddit": "investing",
        "created": 1635796793.0
    },
    {
        "author": "Spiritual_Extreme_81",
        "body": "Imagine not buying that MSFT DIP 🤡",
        "created_utc": 1635780198,
        "id": "hiw5huv",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw5huv/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635808998.0
    },
    {
        "author": "Response_Legitimate",
        "body": "MSFT to 340?",
        "created_utc": 1635761119,
        "id": "hiv8ty4",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiv8ty4/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635789919.0
    },
    {
        "author": "1ngK",
        "body": "Averaged up on MSFT today, finally a sizeable dip.",
        "created_utc": 1635778506,
        "id": "hiw1rge",
        "permalink": "/r/stocks/comments/qkaa5b/rstocks_daily_discussion_monday_nov_01_2021/hiw1rge/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635807306.0
    },
    {
        "author": "ipreferconsole",
        "body": "MSFT ima need you to perk back up real quick",
        "created_utc": 1635772580,
        "id": "hivpggj",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivpggj/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635801380.0
    },
    {
        "author": "origami_asshole",
        "body": "Pete Najarian on Friday said msft calls 🤣 he’s even better to inverse than cramer",
        "created_utc": 1635778859,
        "id": "hiw2jb8",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw2jb8/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635807659.0
    },
    {
        "author": "Throwaway1021920087",
        "body": "MSFT shat the bed but TSLA is saving me",
        "created_utc": 1635781814,
        "id": "hiw963n",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw963n/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635810614.0
    },
    {
        "author": "The_SunBreaker",
        "body": "Younger investor (17) attempting to decide if my allocation is good.\nI'm currently split at 50% VTI , 20% VXUS, 25% in individual stock picks and the remaining 5% in BND and GBTC. \n\nVTI:  for its diversity in the US market and low expenses\nVXUS:    for its International exposure \nBND:    to learn about how bonds work and to see first hand how it works an asset.\nGRAYSCALE BITCOIN TRUST:   it tracks the movement of bitcoin. To give exposure into the crypto market until I understand enough to pick coins.\n\nMICROSOFT:   their dominance in the tech industry alsong with my personal opinion on the company's services, i feel they will last. \nTESLA:    their name recognition, headstart and market share  the Electric automotive industry. I feel the EVs market will explode in the coming years.\nAMAZON:  due to their absolute dominance over several different sectors, being a major player in logistics, retail, entertainment, web hosting and many other players. Amazon is a giant and im confident they will be around for some time.\nALBERTSONS: Went public rather recently owning multiple Grocery and pharmacy Chains in the Chicago land  They have a strong foothold in the area with potential to expand. Also my grocery of choice and place of employment. \n(These individual stocks are rough equal minus Albertsons which has about half as much Invested as the other postistions) \n\nI was wondering if this was an alright investment allocation for a someone younger that can withstand volatility for long-term gain?  I still have much to learn, im open to any advice.",
        "created_utc": 1635776075,
        "id": "hivwex4",
        "permalink": "/r/investing/comments/qk9x5t/daily_advice_thread_all_basic_help_or_advice/hivwex4/",
        "score": 3,
        "subreddit": "investing",
        "created": 1635804875.0
    },
    {
        "author": "DoIt4TheMayMays",
        "body": "Alright, mSfT wAs HoLdiNg SPY Friday..  \nWhat tf is keeping it afloat today?!",
        "created_utc": 1635782870,
        "id": "hiwbl6y",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiwbl6y/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635811670.0
    },
    {
        "author": "I_Ron_Butterfly",
        "body": "It is not physically impossible (even if unlikely). There’s no rule that only one single entity can buy another company. Apple and Google could agree to buy Microsoft and take it private. Or a consortium of say, 20 (40, 100, you get the idea) companies could do the same.",
        "created_utc": 1635768396,
        "id": "hivievs",
        "permalink": "/r/investing/comments/qk7r5b/why_do_stocks_have_any_value/hivievs/",
        "score": 2,
        "subreddit": "investing",
        "created": 1635797196.0
    },
    {
        "author": "bartturner",
        "body": "Would think the problem would be worse for the companies not named Google, Apple, Amazon, Facebook, Tesla or Microsoft.\n\nStill think the big guys are going to be able to attract the talent pretty easily.   I highly doubt Google is struggling to get resumes.\n\nBut the smaller tech companies it is going to get worse I suspect.  Specially if things economically start going bad.  That is what happened with the .Com bust.     Engineers gravitated more to safe jobs.   With more stable companies that they have heard of.  Like the big guys.",
        "created_utc": 1635758351,
        "id": "hiv5v98",
        "permalink": "/r/investing/comments/qjqasz/labor_shortage_is_the_biggest_concern_for_tech/hiv5v98/",
        "score": 2,
        "subreddit": "investing",
        "created": 1635787151.0
    },
    {
        "author": "lax_street",
        "body": "If you’re not buying msft then I’m not sorry for you I’m sorry for your parents at this point",
        "created_utc": 1635778038,
        "id": "hiw0qbz",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw0qbz/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635806838.0
    },
    {
        "author": "niftyifty",
        "body": "I’m going to say I did. It’s easy when you have conviction. I’m investing in companies, not playing market games.  Held Exxon since the 80’s. Though not only Valdez  but dropping 70% in two years recently. Not only did I hold, I added a little more (although not much to be honest. Mostly done adding to Exxon). \n\nAlso just to clarify those companies I listed were for a reason. Everyone pretends like it’s hard but I’m showing you it’s not. Pick any of the top ten companies in the country or world and you are likely to dominate the average. We have known for 50+ years that Exxon has its hands in government pockets. Easy pick. We’ve known for 30 years that Microsoft would rule the PC world. You could have waited 20 years “just to make sure” before increasing and you would destroy the S&amp;P. How about Walmart? Amazon? Apple? Disney? We always know that these companies control their sectors. You did not need to invest day one to make money. You just need to invest in good companies that make money consistently.",
        "created_utc": 1635782370,
        "id": "hiwagd9",
        "permalink": "/r/stocks/comments/qjqlh9/how_many_people_manage_to_beat_sp_500/hiwagd9/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635811170.0
    },
    {
        "author": "ipreferconsole",
        "body": "MSFT you have 5 days to make me not regret this FOMO cmon now shape up",
        "created_utc": 1635775313,
        "id": "hivutm9",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivutm9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635804113.0
    },
    {
        "author": "mathboom123",
        "body": "Just buy MSFT calls and be green EOD",
        "created_utc": 1635776307,
        "id": "hivwwuz",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivwwuz/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635805107.0
    },
    {
        "author": "SwetzAurus",
        "body": "amzn badly positioned for Q4, but irl retail in even worse position.\n\nhard to say if amzn moves up materially before the end of the year.\n\nGOOG &gt; FB &gt; MSFT &gt; AAPL &gt; AMZN &gt; NFLX, if I had to guess, total return from now until 1/1",
        "created_utc": 1635781826,
        "id": "hiw974j",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw974j/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635810626.0
    },
    {
        "author": "WestmontOG07",
        "body": "Exactly.\n\nEveryone is chasing “beating the S&amp;P” but, in the end, I’ll take a CAGR of 7-10%, on average, and be happy with it.\n\nSure, owning MSFT, NVDA, Monster Beverage would have been nice but the turtle always wins the race. \n\nInvesting comes down to patience and trusting empirical data, of which, there is plenty to prove slow and steady wins the race.",
        "created_utc": 1635782833,
        "id": "hiwbi55",
        "permalink": "/r/stocks/comments/qk978t/i_want_to_improve_my_knowledge_in_investing/hiwbi55/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635811633.0
    },
    {
        "author": "creemeeseason",
        "body": "I have a long position. It's my second largest holding after MSFT. I think as their biodiesel project comes online they will make lots of money. Also paying down debt from said project.  If they hit projections it'll be into the mid $90s and lots more growth as their new facilities open.",
        "created_utc": 1635760531,
        "id": "hiv86jj",
        "permalink": "/r/stocks/comments/qkaa5b/rstocks_daily_discussion_monday_nov_01_2021/hiv86jj/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635789331.0
    },
    {
        "author": "Woah_Slow_Down",
        "body": "&gt; Amazon continued to lead the worldwide IaaS market with $26.2 billion of revenue in 2020 and 41% market share (see Table 1). Amazon’s 28.7% growth was slightly slower than that of the market, with their sales growth primarily reflecting increased customer usage.\n\n\n\n&gt; Microsoft maintained the No. 2 position in Gartner’s IaaS market share with nearly 60% growth, reaching $12.7 billion in revenue in 2020\n\nThe pandemic heavily favored Microsoft. In terms of growth, Microsoft is the clear winner. Yes AWS wins due to sheer size in many metrics. Microsoft is gaining on em",
        "created_utc": 1635751175,
        "id": "hiuyitl",
        "permalink": "/r/wallstreetbets/comments/qjrtq1/the_only_things_that_are_certain_in_life_are/hiuyitl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635779975.0
    },
    {
        "author": "bartturner",
        "body": "Most definitely.     All five of the big tech guys (GOOG, AAPL, AMZN, MSFT and FB) all have room to grow.  But I would say Google has the most runway.  They just have more existing assets that have yet been fully monetized.\n\n\nIt is why Google is up over 4 times more than Apple so far this year (72% vs 16%) and Google should continue to out perform the other four.  But you want to own all five, IMHO.   I actually like Apple second to only Google.",
        "created_utc": 1635756949,
        "id": "hiv4gee",
        "permalink": "/r/stocks/comments/qjtshr/is_aapl_able_to_grow_much_more/hiv4gee/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635785749.0
    },
    {
        "author": "Serrot69",
        "body": "I’m beating it since I started investing in 2019. \n\nI basically hold companies in the S&amp;P but with different allocation. For example, 7% in Nvidia. \n\nMy portfolio sorted by allocation:\nMicrosoft,\nApple,\nGoogle,\nNvidia,\nJEPI,\nDatadog,\nAmazon,\nJP Morgan,\nTarget,\nDisney, \nVisa,\nSquare",
        "created_utc": 1635774716,
        "id": "hivtlzg",
        "permalink": "/r/stocks/comments/qjqlh9/how_many_people_manage_to_beat_sp_500/hivtlzg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635803516.0
    },
    {
        "author": "lescoobs",
        "body": "61 percent in VTSAX and VXUS\n\nIndividual stocks\n\nAAPL\n\nCOST\n\n CVS\n\n DIS\n\n IIPR\n\n JNJ\n\n JPM\n\nLUV\n\nMSFT \n\nNET\n\nNIKE\n\n O \n\nPEP\n\nPINS\n\nPLBY\n\nPLTR\n\nRTX\n\nSBUX\n\nTGT\n\nUUUU\n\nXOM\n\nConsidering adding NVDA and AMD but a bit worried I might be tech heavy and wondering if my overall portfolio is diversified enough.  Any feedback on portfolio would be appreciated.  Thank you",
        "created_utc": 1635780247,
        "id": "hiw5lsa",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hiw5lsa/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635809047.0
    },
    {
        "author": "Afrofreak1",
        "body": "We are talking multiple years here if not decades. Companies like Exxon. a.) They are in a dying industry and have been unsuccessful in pivoting away from fossil fuels to alternative sources of revenue. b.) They are a poorly run company that has had multiple CEOs in the past 10 years. c.) They have had declining revenue since 2014. d.) They are not reinvesting a lot of their profits back into the business because so much of it is released to shareholders as dividends. They know that that is one of the few reasons they are still in a lot of portfolios and ETFs. \"tHey pAy a HeAlThY dIvIdEnD.\" Yes, but as a result they are backed into a corner and their business plan is basically: Extract as much value from the business as possible while we still can. \n\nDoes that mean that you can't make money off Exxon stock? No, ofc not, and in fact it's one of the best performing stocks in the S&amp;P500 this year. However, a company that has peaked without any contingency plan to continued growth will never be able to match the returns of a company like Microsoft or Google that are growing 20+% Y-o-Y top and bottom line. I will happily pay a premium to companies that have an outstanding track record and ample room to grow and, more importantly, *the proven ability to seek out alternative sources of revenue*. That is not priced in because we don't even know where these companies are headed until they tell us. I am putting my faith in Nadella and Pichai to lead those companies to growth opportunities that investors hadn't even considered yet. \n\nMeanwhile back at Exxon they are just doing damage control to make sure that their dividend is paid at all costs. That is a terrible investment strategy and the difference in returns over the past decade show it. How likely is it do you think that Exxon will continue down this path and likewise for Microsoft and Google? I do not want companies that don't have a bright future ahead because the potential for sizeable returns is just so much smaller. Unfortunately, companies like Exxon still occupy a sizeable chunk in the S&amp;P500 because once-upon-a-time Exxon in particular was the largest company in the world by market cap. As a result, it drops the S&amp;P500s total return hence why I went with the NASDAQ-100. \n\nIt's not that I'm actively *picking* tech stocks, it's that I'm *removing* chronically underperforming companies like Exxon, Chevron, Wells Fargo, IBM, Ford, GM, etc. and the NASDAQ is the most similar to what an ideal portfolio would look like.",
        "created_utc": 1635773029,
        "id": "hivqasw",
        "permalink": "/r/investing/comments/qj1za5/how_hard_is_it_really_to_beat_the_sp/hivqasw/",
        "score": 1,
        "subreddit": "investing",
        "created": 1635801829.0
    },
    {
        "author": "jmad71",
        "body": "CM\nMSFT\nAAPL\nVUS\nPOW\nUSA",
        "created_utc": 1635775355,
        "id": "hivuwq1",
        "permalink": "/r/CanadianInvestor/comments/qkanim/rate_my_portfolio_megathread_for_november_2021/hivuwq1/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1635804155.0
    },
    {
        "author": "BullyBumble",
        "body": "If you’d bought MSFT calls instead of typing about them you’d be green rn.",
        "created_utc": 1635780537,
        "id": "hiw69af",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw69af/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635809337.0
    },
    {
        "author": "MustNotFapBruh",
        "body": "MSFT if u can only pick 1",
        "created_utc": 1635754002,
        "id": "hiv1gtg",
        "permalink": "/r/stocks/comments/qjtshr/is_aapl_able_to_grow_much_more/hiv1gtg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635782802.0
    },
    {
        "author": "MARCLOOP117",
        "body": "Early on in the year I was beating the S&amp;P from stocks like MSFT, ARKW, and BABA (plus a few others) but once BABA started tanking it took all my momentum away and now I'm back below it",
        "created_utc": 1635768942,
        "id": "hivj8n2",
        "permalink": "/r/stocks/comments/qjqlh9/how_many_people_manage_to_beat_sp_500/hivj8n2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635797742.0
    },
    {
        "author": "RumHam1",
        "body": "I agree with you on paypal, high expectations being priced in so theres a lot more fundamental downside.  Net and tsla also have super high valuations, but Microsoft doesnt really fit in with that crowd.  Even after this bump they're at 37 PE, so most of their growth has been earnings driven rather than hype.  \n\nPlus, they've got many segments that are insanely profitable plus growing quickly (something none of the others have).",
        "created_utc": 1635751549,
        "id": "hiuyxb8",
        "permalink": "/r/stocks/comments/qi8xzx/rstocks_daily_discussion_fundamentals_friday_oct/hiuyxb8/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635780349.0
    },
    {
        "author": "F1guy_5",
        "body": "Don't want to make a fucking post for this, but is MSFT still a good buy? Say it stays at current price level or drops a range 5 dollars or smth?",
        "created_utc": 1635752109,
        "id": "hiuzicy",
        "permalink": "/r/stocks/comments/qi8xzx/rstocks_daily_discussion_fundamentals_friday_oct/hiuzicy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635780909.0
    },
    {
        "author": "BrownMamba92",
        "body": "Thoughts on a MSFT stock spilt in the future?",
        "created_utc": 1635780318,
        "id": "hiw5rmx",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw5rmx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635809118.0
    },
    {
        "author": "Uttasarga",
        "body": "OP, MSFT (Microsoft) will move up by 10%.  \nYahoo Analysts have a good prediction on that.",
        "created_utc": 1635781953,
        "id": "hiw9hpe",
        "permalink": "/r/options/comments/qjwx6r/expected_moves_this_week_amc_roku_moderna/hiw9hpe/",
        "score": 1,
        "subreddit": "options",
        "created": 1635810753.0
    },
    {
        "author": "RedditMadeMeReddit",
        "body": "Microsoft Apple Netflix Google Amazon",
        "created_utc": 1635758485,
        "id": "hiv60c2",
        "permalink": "/r/wallstreetbets/comments/qj4aeu/its_maaam/hiv60c2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635787285.0
    },
    {
        "author": "shortyafter",
        "body": "They are conservative investors.  They fully admit that they could be wrong, but since there's no way of truly knowing if Microsoft will continue to aggressively grow for 5-10 years, they prefer to pass and focus elsewhere.",
        "created_utc": 1635767106,
        "id": "hivgie9",
        "permalink": "/r/stocks/comments/qi8xzx/rstocks_daily_discussion_fundamentals_friday_oct/hivgie9/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635795906.0
    },
    {
        "author": "VisualMod",
        "body": "&gt;FANG+ Constituents:\n\\&gt;$AAPL 148.63 -0.78%\n$AMZN 3335.43 -1.09%\n$BABA 170.36 +3.28%\n$BIDU 169.26 +4.33%\n$FB 330.19 +2.05%\n$GOOG 2913.42 -1.77%\n$NFLX 682.74 -1.1%\n$NVDA 256.57 +0.36%\n$TSLA 1155.1 +3.68%\n$TWTR 55.2 +3.1%\n\\&gt;$MSFT 327.09 -1.37%\n\n^IGSquawk ^[@IGSquawk](http://twitter.com/IGSquawk) ^at ^2021-11-01 ^11:15:11 ^EDT-0400",
        "created_utc": 1635779725,
        "id": "hiw4fjr",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hiw4fjr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635808525.0
    },
    {
        "author": "i_am_the_d_2",
        "body": "apple, google, facebook, amazon, microsoft, netflix hire probably close to a million engineers between them though. These are all people making at least 200k per year.",
        "created_utc": 1635781510,
        "id": "hiw8h7s",
        "permalink": "/r/investing/comments/qjqasz/labor_shortage_is_the_biggest_concern_for_tech/hiw8h7s/",
        "score": 1,
        "subreddit": "investing",
        "created": 1635810310.0
    },
    {
        "author": "whboer",
        "body": "All in on GOOGL and MSFT and don’t look back.",
        "created_utc": 1635766071,
        "id": "hivf1vr",
        "permalink": "/r/wallstreetbets/comments/qjwic5/next_best_opportunity/hivf1vr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635794871.0
    },
    {
        "author": "SwedishFish123",
        "body": "Shit I bought MSFT 11/19 calls because I thought there was a dip and now it’s dipping more",
        "created_utc": 1635776248,
        "id": "hivwsg2",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hivwsg2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635805048.0
    },
    {
        "author": "RumHam1",
        "body": "Good video, I've not seen them before but they've got a good tools there and seem very competent. \n\nI think for me, they're using data from too long ago to justify their opinions.  Using a 5-year average of price/earnings is ok, because it normalizes the value of the company to their earnings at the time, and shows where wall street is pricing the company over time.  Using 5-year averages on earnings, or revenue only is dumb unless you think the company is going to regress on it's revenue.  \n\nAt one point they're averaging FCF for the last 5 years and comparing that to current market cap.  That just simply doesn't work when FCF today is nearly double what it was 5 years ago, and it's not only still growing - but it's still accelerating.  The fact that MSFT had 34B in free cash flow in 2016 is completely irrelevant to the stock's price today, where they have 56B in FCF.   \n\nThe way these guys are coming up with their valuations are as if MSFT isn't growing any more - it's more useful when looking at mature dividend companies, but it's not really a good way to value a company that is going to aggressively grow for the next 5-10 years.",
        "created_utc": 1635765781,
        "id": "hivenqd",
        "permalink": "/r/stocks/comments/qi8xzx/rstocks_daily_discussion_fundamentals_friday_oct/hivenqd/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635794581.0
    },
    {
        "author": "LogicalResearch4330",
        "body": "I’m not disagreeing with you but when you look at a company like Microsoft with 7.5B outstanding shares.\nVanguard and Blackrock own a significant amount with just over 1B. \n\nWhen a company like Snapchat went public they issued shares that had no voting rights. The two owners control shares that have 10 votes per share. Investors are completely locked out of decisions in that company.",
        "created_utc": 1635781333,
        "id": "hiw82kd",
        "permalink": "/r/pennystocks/comments/qk7qwn/why_do_stocks_have_any_value/hiw82kd/",
        "score": 0,
        "subreddit": "pennystocks",
        "created": 1635810133.0
    },
    {
        "author": "GekkoPSG",
        "body": "Could pop.  I so trust Chinese Brokerage Firms, especially ones that provide online brokerage services these days more than anything.  Think I'll sell all my AAPL, MSFT, and TSLA shares and  calls and yolo it all on this and buying a Wendy's franchise. . .",
        "created_utc": 1635759864,
        "id": "hiv7gdf",
        "permalink": "/r/Wallstreetbetsnew/comments/qirmz8/why_up_fintech_has_the_potential_to_roar_to_the/hiv7gdf/",
        "score": 0,
        "subreddit": "Wallstreetbetsnew",
        "created": 1635788664.0
    },
    {
        "author": "simplysufficient88",
        "body": "To be entirely fair here, this whole thing’s based on a really bad article title. Everyone’s quoting the CNN article that makes it sound as though the WFP director was claiming all you’d need is $6 billion to solve all hunger. When the actual statement he made was that it would help to fix the growth in world hunger issues we’ve seen recently, not that it would solve hunger entirely. He very specifically mentions that this is a one time donation that would help 42 million people that need immediate aid, but that wouldn’t be a long term fix. Even the CNN article itself now has a correction at the very bottom acknowledging this was a misleading title. \n\nObviously this is all an over simplification of the issue and you can’t just throw money at it to fix it, but the point he was trying to make wasn’t that one donation from one billionaire would permanently solve all hunger but that a one time donation from MULTIPLE of the world’s wealthiest individuals would help save a lot of people in the short term. I think that’s a pretty massive difference.",
        "created_utc": 1635772963,
        "id": "hivq68e",
        "permalink": "/r/wallstreetbets/comments/qkcpmq/how_to_solve_world_hunger_just_plow_it_back_in/hivq68e/",
        "score": 3191,
        "subreddit": "wallstreetbets",
        "created": 1635801763.0
    },
    {
        "author": "wtf-am-I-doing-69",
        "body": "One more thing. He does it this year under a known 2021 tax code \n\nHe knows things may change for 2022 and it won't be for the better. \n\nSell now pay capital gains tax, exercise.options now pay tax under 2021 rules\n\nMuch better than waiting",
        "created_utc": 1636307447,
        "id": "hjp6z42",
        "permalink": "/r/wallstreetbets/comments/qorwlq/why_elon_musk_will_definitely_sell_10_of_his_stock/hjp6z42/",
        "score": 2239,
        "subreddit": "wallstreetbets",
        "created": 1636336247.0
    },
    {
        "author": "Prudent_Media_4067",
        "body": "They have over 7,000 homes they bought for over market value that they are now trying to dump on the market at a discount. They are bleeding money.",
        "created_utc": 1635962372,
        "id": "hj6ea0x",
        "permalink": "/r/stocks/comments/qm05h4/z_zillow_is_now_down_25_in_a_single_day_and_at/hj6ea0x/",
        "score": 2173,
        "subreddit": "stocks",
        "created": 1635991172.0
    },
    {
        "author": "ABuddingScientist",
        "body": "Okay, now what if I whipped it all out and I'm still last?",
        "created_utc": 1635830275,
        "id": "hiz8ohm",
        "permalink": "/r/wallstreetbets/comments/qkwu9l/rules_to_live_by/hiz8ohm/",
        "score": 1698,
        "subreddit": "wallstreetbets",
        "created": 1635859075.0
    },
    {
        "author": "Powerful_Stick_1449",
        "body": "MSFT.... their cloud growth is exponential, they have no anti-trust heat right now, and their gaming segment is making acquisition after acquisition.",
        "created_utc": 1635798955,
        "id": "hixeoo5",
        "permalink": "/r/stocks/comments/qkmmmq/if_you_could_put_3k_into_aapl_msft_or_fb_which/hixeoo5/",
        "score": 1285,
        "subreddit": "stocks",
        "created": 1635827755.0
    },
    {
        "author": "trapmitch",
        "body": "Then you also have consumer asset backed securities which is an entirely different beast. \n\nBasically Netflix can take loans out on their subscribers months/years in advance as projected revenues.  Because it’s only 10 dollars a month per person if one person stops subscribing not a big deal. However if everybody stopped subscribing well… \n\nI think the problem is going to be these subscriptions and buy now pay later services are really going to start adding up to the point average people are paying over a thousand dollars a month just in subscriptions. You have Netflix Hulu Spotify Apple Music peloton gym memberships etc etc it’s going to add up pretty quickly and we might see a mass exodus from these subscription based models causing whoever bought those securities about to get fucked in the ass",
        "created_utc": 1636559855,
        "id": "hk2xghy",
        "permalink": "/r/wallstreetbets/comments/qqw2pw/china_pulled_an_08_and_i_feel_we_are_fucked/hk2xghy/",
        "score": 1069,
        "subreddit": "wallstreetbets",
        "created": 1636588655.0
    },
    {
        "author": "Retartedinvesments",
        "body": "I will have kids in future , can I claim them as dependents now?",
        "created_utc": 1636312557,
        "id": "hjpk4rt",
        "permalink": "/r/wallstreetbets/comments/qova51/_/hjpk4rt/",
        "score": 1023,
        "subreddit": "wallstreetbets",
        "created": 1636341357.0
    },
    {
        "author": "AllNORNADA",
        "body": "Congratulations hopefully you Have a half milli in cash rt now",
        "created_utc": 1636082944,
        "id": "hjdfw3o",
        "permalink": "/r/wallstreetbets/comments/qn18wf/44k_yolo_to_720k_in_2_weeks/hjdfw3o/",
        "score": 884,
        "subreddit": "wallstreetbets",
        "created": 1636111744.0
    },
    {
        "author": "skilliard7",
        "body": "Now the fact that they stopped buying homes makes a lot of sense.",
        "created_utc": 1635887120,
        "id": "hj27xel",
        "permalink": "/r/stocks/comments/qldokl/zillow_fires_25_of_staff_takes_304_million_write/hj27xel/",
        "score": 812,
        "subreddit": "stocks",
        "created": 1635915920.0
    },
    {
        "author": "BlueWhaleValue",
        "body": "I believe my odds are substantially higher than the outcome of roulette. My strategy is simple, I strongly believe Tesla will have a sharp dip/drop. I don't know when, but it will. My odds of it happening increase on every pump giving the fact the next stock Tesla would overcome is actually Amazon, then Google. This is not a small market cap stock with unlimited upside, it's running out of room in my opinion. Although it is possible for Tesla to temporarily surpass these companies because of how irrational the market is. (True valuation clearly doesn't matter here) the point here is, its current price may be fair for Tesla but in the future. Not now, the bulls got too greedy too soon.  The argument that Tesla is should not be worth more than companies like Amazon and Google is strong, of course, those companies will grow in value as well where things fall back into a reasonable line.  But, it goes back to square one, too high, too fast, too soon. None of the bull's arguments defend Tesla during a harsh red week or month in the market, worse a crash. We all know based on history Tesla would be the first to go.   \n\n\nDon't get me wrong. I strongly believe Tesla deserves a high valuation. I am all for a $1 Trillion even upwards of a $3 trillion market cap, but all with given time. Too fast, too high, too soon. The cult-like following on Tesla is built of money craving impatient newbs, which a good amount of run away at first sight of a change or new hype. Panic, profit takers. During that time, when it comes, id like to have my turn in making a profit. I rather bet on a dip with such high numbers than bet on an even further run. Then again, even if it goes up we go back to square one, I increase my odds averaging up.  This is a shorter-term strategy, not a Perma bear case.",
        "created_utc": 1635808429,
        "id": "hiy11bt",
        "permalink": "/r/wallstreetbets/comments/qknynb/1_million_dollar_tesla_short_tsla_part_2_executed/hiy11bt/",
        "score": 803,
        "subreddit": "wallstreetbets",
        "created": 1635837229.0
    },
    {
        "author": "Illustrious-Ratio-41",
        "body": "The 500 million he claims America is on the hook for is the true funny part 😆\n\nIf China falls into an economic depression now, you’re gonna be worried about a lot more than that OP. Drop in the bucket.",
        "created_utc": 1636556082,
        "id": "hk2o6wr",
        "permalink": "/r/wallstreetbets/comments/qqw2pw/china_pulled_an_08_and_i_feel_we_are_fucked/hk2o6wr/",
        "score": 765,
        "subreddit": "wallstreetbets",
        "created": 1636584882.0
    },
    {
        "author": "playoutsideplay",
        "body": "I didn’t want you then, and I don’t want you now",
        "created_utc": 1635798533,
        "id": "hixdmif",
        "permalink": "/r/wallstreetbets/comments/qkmjzg/yoy_progress_2m_12_4m_10m_diversified_between/hixdmif/",
        "score": 732,
        "subreddit": "wallstreetbets",
        "created": 1635827333.0
    },
    {
        "author": "Parking-Secretary-87",
        "body": "How come they look older then, than now😅",
        "created_utc": 1636203632,
        "id": "hjjnbn2",
        "permalink": "/r/wallstreetbets/comments/qnygmr/back_in_2004/hjjnbn2/",
        "score": 692,
        "subreddit": "wallstreetbets",
        "created": 1636232432.0
    },
    {
        "author": "scleon7397",
        "body": "Now you can go buy one of their houses they are selling for a loss to really rub it in",
        "created_utc": 1635954413,
        "id": "hj5t3zw",
        "permalink": "/r/wallstreetbets/comments/qlv4d2/160k_zillow_gain/hj5t3zw/",
        "score": 683,
        "subreddit": "wallstreetbets",
        "created": 1635983213.0
    },
    {
        "author": "YoogleFoogle",
        "body": "I took a 15% pay cut to work remotely.  Now that’s looking like 20% less purchasing power.  Oof",
        "created_utc": 1636561107,
        "id": "hk30l9o",
        "permalink": "/r/wallstreetbets/comments/qqutgr/inflation_hit_30_year_high_in_october_of_62/hk30l9o/",
        "score": 641,
        "subreddit": "wallstreetbets",
        "created": 1636589907.0
    },
    {
        "author": "GrapeJuicex",
        "body": "Jack: Are you insane? Think about the jobs! The economy! This is GE!\n\nBanks: It's just G now, Jack. I sold the E. To Samsung. They're Samesung now.",
        "created_utc": 1636466630,
        "id": "hjxpqu1",
        "permalink": "/r/stocks/comments/qq2xvs/general_electric_to_split_itself_into_three/hjxpqu1/",
        "score": 620,
        "subreddit": "stocks",
        "created": 1636495430.0
    },
    {
        "author": "HolyTurd",
        "body": "Hey man, when we all can't afford rent anymore, we can just put on our Occulus and transform our makeshift tent into a mansion. That street pigeon that we roasted over a garbage fire? Well, now its a plate of duck confit.",
        "created_utc": 1636473620,
        "id": "hjy5qqk",
        "permalink": "/r/stocks/comments/qq5x3m/facebooks_pivot_to_meta_iswellcreepy_and/hjy5qqk/",
        "score": 558,
        "subreddit": "stocks",
        "created": 1636502420.0
    },
    {
        "author": "Adorable_Ad8515",
        "body": "Sex is nasty, girls are disgusting ewwwww .... try making 100k in a day and then go play some Xbox live, now that shit gets me hard.",
        "created_utc": 1635958538,
        "id": "hj643p0",
        "permalink": "/r/wallstreetbets/comments/qlwu20/spy_500_sex/hj643p0/",
        "score": 547,
        "subreddit": "wallstreetbets",
        "created": 1635987338.0
    },
    {
        "author": "theeberk",
        "body": "A few things to be aware of…\n1. They’ve been talking about this infrastructure bill for *many* months. Everybody that matters in the market knows what it is, and they all knew it was going to pass the house. Remember, it had strong support by both parties in the senate months ago when it was passed. People have mentioned buying related ETFs (I.e PAVE) and construction companies (like CAT) for that entire time for this reason. Basically, it’s priced in.\n\n2. Besides allowing for news,  speculation and possibly improved forward guidance (all priced in imo) this bill isn’t going to make these companies more valuable overnight. It will take a long time for them to get these projects/money, and even longer for them to report their financial improvements from this, which does have an impact on stock prices. Even then, this is probably priced in.\n\nI hesitate to say this is 100% priced in right now because there are probably retail traders buying in, but the term “sell the news” exists for a reason. In general, retail traders tend to buy the top and sell at the bottom, and this event will (probably not) be an exception.",
        "created_utc": 1636226710,
        "id": "hjl3qrc",
        "permalink": "/r/wallstreetbets/comments/qo6219/what_stocks_will_surge_with_the_passage_of_the/hjl3qrc/",
        "score": 537,
        "subreddit": "wallstreetbets",
        "created": 1636255510.0
    },
    {
        "author": "circdenomore",
        "body": "Where is that retard posing as a dentist now!?",
        "created_utc": 1636414165,
        "id": "hjv91tl",
        "permalink": "/r/wallstreetbets/comments/qppebv/ive_officially_become_a_bagholder/hjv91tl/",
        "score": 510,
        "subreddit": "wallstreetbets",
        "created": 1636442965.0
    },
    {
        "author": "neko1985",
        "body": "Now make it $12 again.",
        "created_utc": 1635801673,
        "id": "hixlal3",
        "permalink": "/r/wallstreetbets/comments/qkmjzg/yoy_progress_2m_12_4m_10m_diversified_between/hixlal3/",
        "score": 505,
        "subreddit": "wallstreetbets",
        "created": 1635830473.0
    },
    {
        "author": "ConradSchu",
        "body": "He gave out great advice when he was posting on here and engaged with the wsb community (back when it was very different from what it is now). He explained a lot of his controversies and some made sense. He gave honest insight on DD and tried to help people trade better.\n\nI won't defend his criminal actions at all. He deserved what he got. But from my own personal observations and interactions, he was a pretty decent guy here.\n\nPlus he personally triggered an actual infinity squeezes with KBIO. Went up over 10,000% in 5 days. Not that says shit about his character, I just think it's a neat fact.",
        "created_utc": 1636493301,
        "id": "hjzjazg",
        "permalink": "/r/wallstreetbets/comments/qq7cle/i_watched_all_martin_shkreli_videos_on_investing/hjzjazg/",
        "score": 502,
        "subreddit": "wallstreetbets",
        "created": 1636522101.0
    },
    {
        "author": "Dracklfaggot",
        "body": "When Jerome was started saying \"transitory\" 8 months ago, what he actually *meant* was that \"Inflation was going to transition right up your ass and fuck you, because I don't actually care, now watch me print some more money to artificially pump the bond market\"",
        "created_utc": 1636551530,
        "id": "hk2e74w",
        "permalink": "/r/stocks/comments/qqukg1/consumer_price_index_surges_62_in_october/hk2e74w/",
        "score": 501,
        "subreddit": "stocks",
        "created": 1636580330.0
    },
    {
        "author": "PaloLV",
        "body": "When the actual spending is analyzed 10 years from now it will be revealed that little or nothing was spent on internet infrastructure and all the money disappeared into the hands of executives and shareholders.",
        "created_utc": 1636193733,
        "id": "hjj83z6",
        "permalink": "/r/investing/comments/qnvzaw/congress_passes_12t_infrastructure_bill/hjj83z6/",
        "score": 494,
        "subreddit": "investing",
        "created": 1636222533.0
    },
    {
        "author": "crjlsm",
        "body": "This is quietly the biggest story in the stock market right now.",
        "created_utc": 1636008099,
        "id": "hj94qlv",
        "permalink": "/r/wallstreetbets/comments/qmccl8/gme_updates_rocket_looks_imminent_strap_in_boys/hj94qlv/",
        "score": 471,
        "subreddit": "wallstreetbets",
        "created": 1636036899.0
    },
    {
        "author": "thetrappster",
        "body": "I've sold and re-bought Tesla shares since 2013. If I had bigger balls and held on to the shares I'd bought in 2013, I'd nearly be a millionaire right now. \n\n\nI'm holding.",
        "created_utc": 1635803147,
        "id": "hixouql",
        "permalink": "/r/stocks/comments/qko4qu/tsla_owners_what_are_your_moves/hixouql/",
        "score": 457,
        "subreddit": "stocks",
        "created": 1635831947.0
    },
    {
        "author": "robbinhood69",
        "body": "I hope this is obvious to you but do not keep yolo'ing ur entire stack on weekly options\n\nIt's fine when ur doing it on amounts that you could conceivably make back working for a decade or whatever\n\nBut it is damn near impossible to build up 700k liquid working for income. \n\n&amp;#x200B;\n\nU fucking made it. Now scale this waaaaay back and put a lot of this into a diversified basket of shares\n\nAnd keep yolo'ing with liek 30k again or whatever.",
        "created_utc": 1636086902,
        "id": "hjdmvbg",
        "permalink": "/r/wallstreetbets/comments/qn18wf/44k_yolo_to_720k_in_2_weeks/hjdmvbg/",
        "score": 453,
        "subreddit": "wallstreetbets",
        "created": 1636115702.0
    },
    {
        "author": "carnewbie911",
        "body": "Bottom line, Elon did a very good PR move. Selling the stock was a must option, regardless of the Twitter vote.\n\nNow Elon has more zombie fan boys",
        "created_utc": 1636368647,
        "id": "hjsg520",
        "permalink": "/r/wallstreetbets/comments/qpb1t8/forget_elons_poll_the_tax_has_to_be_paid_on_tesla/hjsg520/",
        "score": 445,
        "subreddit": "wallstreetbets",
        "created": 1636397447.0
    },
    {
        "author": "DaShaka9",
        "body": "and if they were, they definitely aren’t now.",
        "created_utc": 1635896120,
        "id": "hj2ugee",
        "permalink": "/r/wallstreetbets/comments/qlaurk/my_car_short_into_earnings_life_savings_and_some/hj2ugee/",
        "score": 433,
        "subreddit": "wallstreetbets",
        "created": 1635924920.0
    },
    {
        "author": "xtrmist",
        "body": "It's a company that has lost its way and the quality of their games have been spiraling downwards for a long time. Every expansion for world of warcraft gets worse and people are starting to break their addiction of always returning. The lawsuit is a disaster and now they're removing stuff from the games instead of adding more to keep people around.\n\nWouldn't touch this.",
        "created_utc": 1635960214,
        "id": "hj68k38",
        "permalink": "/r/StockMarket/comments/qlvgc4/anybody_like_activision_right_now_its_down_about/hj68k38/",
        "score": 419,
        "subreddit": "StockMarket",
        "created": 1635989014.0
    },
    {
        "author": "Illuminati_gang",
        "body": "Next tweet: The deal is now signed guys!\n\nTesla stock: I'll fuckn do it again!",
        "created_utc": 1635854571,
        "id": "hj02675",
        "permalink": "/r/stocks/comments/ql1oa6/musk_says_hertz_deal_isnt_signed_and_questions/hj02675/",
        "score": 410,
        "subreddit": "stocks",
        "created": 1635883371.0
    },
    {
        "author": "Sweaty-Glove-718",
        "body": "It’s all public Information, there was a TikTok guy who tracked it for you and made videos on it. Right now Merck &amp; co and Nvidia have a lot of political money in them. Meaning they know something we don’t",
        "created_utc": 1636043330,
        "id": "hjaszr8",
        "permalink": "/r/wallstreetbets/comments/qmoduf/nvidia_options_are_paying_off_i_just_followed/hjaszr8/",
        "score": 406,
        "subreddit": "wallstreetbets",
        "created": 1636072130.0
    },
    {
        "author": "IAmInTheBasement",
        "body": "I'm going to tell you right now exactly what this is all about.\n\nRight now Elon has about 25 billion dollars worth of options that if he chooses to exercise will have to have taxes paid on them. And I don't mean the namby-pamby 20% capital gains tax, these are going to be paid as if they were earned income.\n\nSo to deal with that his choice is either to take out a huge loan for all of the tax value and the cost to exercise.\n\nOr sell some of his existing stock, pay the much smaller capital gains on it, and use the money freed up there to exercise the options and pay the income tax.\n\nBeyond those two likely options the only third option would be to not exercise the options and let them expire worthless.\n\nThis tweet is all about framing the decision for public perception. He's already made up his mind and run the numbers.",
        "created_utc": 1636236786,
        "id": "hjlqef0",
        "permalink": "/r/wallstreetbets/comments/qo8kyk/elon_musk_will_ditch_over_20_billion_dollars_of/hjlqef0/",
        "score": 406,
        "subreddit": "wallstreetbets",
        "created": 1636265586.0
    },
    {
        "author": "kyle_h2486",
        "body": "So I can short companies in two counties now with the same strategy. Interesting….",
        "created_utc": 1635949211,
        "id": "hj5fx61",
        "permalink": "/r/wallstreetbets/comments/qltwea/after_researching_chinese_companies_everything/hj5fx61/",
        "score": 405,
        "subreddit": "wallstreetbets",
        "created": 1635978011.0
    },
    {
        "author": "Stock_Candle",
        "body": "If losing 2months of gains scares you quit now before you hurt yourself",
        "created_utc": 1636119226,
        "id": "hjevjcw",
        "permalink": "/r/StockMarket/comments/qnamb0/im_about_to_lose_everything_i_have_gained_in_the/hjevjcw/",
        "score": 400,
        "subreddit": "StockMarket",
        "created": 1636148026.0
    },
    {
        "author": "WeLoveTheStonks",
        "body": "Ya see the amount of deleted comments?  Moderator is putting in work right now, lmao.",
        "created_utc": 1636123586,
        "id": "hjf5sdm",
        "permalink": "/r/investing/comments/qn9o7d/pfizer_says_its_covid_pill_with_hiv_drug_cuts_the/hjf5sdm/",
        "score": 382,
        "subreddit": "investing",
        "created": 1636152386.0
    },
    {
        "author": "atdharris",
        "body": "Shiller himself said you cannot look at this because it does not factor where interest rates are. Rates in 1999 were 4.5-5.5%. If they were at that level today, we'd be nowhere near where we are now.",
        "created_utc": 1636128768,
        "id": "hjfj1ge",
        "permalink": "/r/investing/comments/qnbd8x/shiller_pe_just_exceeded_40_for_the_first_time/hjfj1ge/",
        "score": 378,
        "subreddit": "investing",
        "created": 1636157568.0
    },
    {
        "author": "GhostOfAscalon",
        "body": "https://labornotes.org/2021/10/lets-put-wrench-things-now-deere-workers-strike-company-rakes-record-profits\n\nhttps://uaw.org/wp-content/uploads/2021/10/DEERE-Summary-Revised-Final-bug.pdf\n\n&gt; Deere claimed that workers typically make $60,000 a year, and that the new contract would bring workers up to almost $72,000 per year. But that figure assumes year-round full-time work—ignoring Deere’s common seasonal layoffs, which can range from weeks to months.\n\nSounds like a terrible place to work\n\n&gt; Members also got to hear the company’s initial offer, which contained a host of concessions, at strike authorization meetings in September. Deere proposed ending the plant closure moratorium, doing away with overtime pay after eight hours, eliminating seniority-based wage progressions, forcing workers to pay 20 percent of their health insurance premiums, and many other draconian concessions.\n\nFantastic idea with labor in the strongest position it's been in for decades",
        "created_utc": 1636002263,
        "id": "hj8x3pn",
        "permalink": "/r/stocks/comments/qm9ap5/deere_says_its_done_bargaining_after_striking/hj8x3pn/",
        "score": 367,
        "subreddit": "stocks",
        "created": 1636031063.0
    },
    {
        "author": "Holle444",
        "body": "Watch. It gets passed. Then it gets extended to everyone, not just the ultra rich. The ultra rich will lobby for a legal loophole. They will get out of paying the tax, while everyone else now pays for unrealized gains. Change my mind.",
        "created_utc": 1636094493,
        "id": "hjdxanf",
        "permalink": "/r/wallstreetbets/comments/qn0ohd/its_a_fugayzee_fugahzee_its_imaginary/hjdxanf/",
        "score": 351,
        "subreddit": "wallstreetbets",
        "created": 1636123293.0
    },
    {
        "author": "10111010001101011110",
        "body": "It’s about 50 people whose whole identity revolves around hating Musk. They are much more focused on SpaceX now that Tesla is profitable.",
        "created_utc": 1635944369,
        "id": "hj554jb",
        "permalink": "/r/wallstreetbets/comments/qls92p/tesla_sells_1_of_global_car_sales_and_is_worth/hj554jb/",
        "score": 326,
        "subreddit": "wallstreetbets",
        "created": 1635973169.0
    },
    {
        "author": "616sd",
        "body": "You have achieved the privilege to fuck your wife’s boyfriend now! You did it!",
        "created_utc": 1636509039,
        "id": "hk0jpts",
        "permalink": "/r/wallstreetbets/comments/qqiv8d/helluva_year_6k_to_23m_and_its_not_over_yet/hk0jpts/",
        "score": 325,
        "subreddit": "wallstreetbets",
        "created": 1636537839.0
    },
    {
        "author": "Hourglass420",
        "body": "Yeah, because hanging out with 23 yo annoys me now... I can't imagine how annoyed I would be at his age.",
        "created_utc": 1636393907,
        "id": "hjtvaj7",
        "permalink": "/r/wallstreetbets/comments/qpgdtr/personality_money_for_women_just_dont_be_a_poor/hjtvaj7/",
        "score": 311,
        "subreddit": "wallstreetbets",
        "created": 1636422707.0
    },
    {
        "author": "IAmInTheBasement",
        "body": "It's true. I was crazy pumped to hit six figures, which at the time was \\~3x growth from where I was \\~4 months before that point.\n\nNow I'm hovering at \\~700k. Hitting 7 digits is going to be nutz.",
        "created_utc": 1636391339,
        "id": "hjtoszl",
        "permalink": "/r/stocks/comments/qphjri/just_hit_100k_my_first_milestone/hjtoszl/",
        "score": 296,
        "subreddit": "stocks",
        "created": 1636420139.0
    },
    {
        "author": "Double_Instance_3227",
        "body": "NOW DO IT AGAIN WITH 100k and post your loss porn here :)",
        "created_utc": 1636065273,
        "id": "hjcclr1",
        "permalink": "/r/wallstreetbets/comments/qmtptf/i_did_it_10k_to_100k_ytd_brought_to_you_mostly_by/hjcclr1/",
        "score": 278,
        "subreddit": "wallstreetbets",
        "created": 1636094073.0
    },
    {
        "author": "PAPA_Emc2",
        "body": "For all the negativity I havent seen many 🏳️‍🌈🐻 positions being posted? \n\nI think its will GME explode the market, or will the market show the world that only big industry insiders are allowed to win? Both scenerios destroy the market… either way ill happily “hold these bags” \n\nRarely do you get a chance to invest in a new, debt free, dream team, market evolving company ahead of changing online commerce forever. Then again its also just a brick and mortar retail resale store and its gonna go bankrupt any day now.\n\n🙄",
        "created_utc": 1636249009,
        "id": "hjmgoht",
        "permalink": "/r/wallstreetbets/comments/qocmul/too_true/hjmgoht/",
        "score": 277,
        "subreddit": "wallstreetbets",
        "created": 1636277809.0
    },
    {
        "author": "NottaGoon",
        "body": "You have no idea what we are in for.\r  \n\r  \nI started a business distributing food products to schools nationally. We own some brands others we don't. It is the worst environment I've ever seen across the board.\r  \n\r  \nLabor is the biggest issue. There aren't enough food workers to run the food service programs. I've seen 2 employees feeding thousands of kids when there were 20 there pre pandemic. This means their buying habits have changed to prepackaged goods sometimes doubling their food cost.\r  \n\r  \nThe manufacturers can't keep up with the shift in demand as they are shortstaffed as well.\r  \n\r  \nFreight has gone up 3-4x since pandemic domestically because their aren't enough truck drivers. One of my competitors canceled 78 contracts to provide them food at the start of the school year. It is chaos.\r  \n\r  \nTheir aren't enough truck drivers to move things in a timely manner. I'm waiting 2 months at times for things at the port. My price per container has gone from $4400 pre pandemic to $27,500! A case of fruit has gone up 250%!\r  \n\r  \nMost of my cogs are close to doubling. I pass that along and now most are struggling to buy food for our most valuable resource, kids.\r  \n\r  \nUSDA is now offering free lunches to every kid but who is going to pay for that?\r  \n\r  \nIt's bad. I'm selling my company for what I can get for it. I see the writing on the wall.",
        "created_utc": 1636561828,
        "id": "hk32ewc",
        "permalink": "/r/wallstreetbets/comments/qqutgr/inflation_hit_30_year_high_in_october_of_62/hk32ewc/",
        "score": 267,
        "subreddit": "wallstreetbets",
        "created": 1636590628.0
    },
    {
        "author": "roox911",
        "body": "their AI buying algorithm was taking them to the cleaners.. i've been following properties they have been buying in Florida, and a lot of them are poorly kept, and require massive renos.  The craziest one i saw was a house last sold in late 2017 for $50,000 - zillow bought it 3 years later for $425,000... a 750% increase.  It's now been sitting for 4 months, in a place where the average sale time is around a week.",
        "created_utc": 1635891861,
        "id": "hj2k3rm",
        "permalink": "/r/stocks/comments/qldokl/zillow_fires_25_of_staff_takes_304_million_write/hj2k3rm/",
        "score": 256,
        "subreddit": "stocks",
        "created": 1635920661.0
    },
    {
        "author": "OptionLoserSupreme",
        "body": "There is literally no mathematical way for this to work. If you are starting at 10-20k, selling LEAPs or buying what ever will not result the amount you have now. \n\nBy doing 2 years out- all you have done is say that you did not make a single trade in between those years, meaning all your profit came from that CC and rising stock price- but your stock couldn’t have made you think much because then your premiums would be way too small. And your premiums couldn’t make this in 2 years since your gain on stock is too large. \n\nShow the covered calls- you should only have few sell records since you did LEAPS- so it shouldn’t be a problem. \n\n99% there is no way this is covered calls. Especially in 2 years- you do not get over 20000% in those. And that 1% are retarded that do 100 trades a day and got lucky on ALL of them.",
        "created_utc": 1636473601,
        "id": "hjy5p28",
        "permalink": "/r/wallstreetbets/comments/qq40qs/started_with_about_1012k_beginning_of_last_year/hjy5p28/",
        "score": 254,
        "subreddit": "wallstreetbets",
        "created": 1636502401.0
    },
    {
        "author": "thatissomeBS",
        "body": "You could give me $1b right now and I'd still be worth &lt;$1b.",
        "created_utc": 1636210626,
        "id": "hjk2cek",
        "permalink": "/r/wallstreetbets/comments/qnygmr/back_in_2004/hjk2cek/",
        "score": 250,
        "subreddit": "wallstreetbets",
        "created": 1636239426.0
    },
    {
        "author": "bobbymatthews84",
        "body": "Is G'merica now son.",
        "created_utc": 1636312275,
        "id": "hjpjet6",
        "permalink": "/r/wallstreetbets/comments/qouux4/whhooooooosshh/hjpjet6/",
        "score": 242,
        "subreddit": "wallstreetbets",
        "created": 1636341075.0
    },
    {
        "author": "thatguy425",
        "body": "The entire company is making acquisitions. If they can’t buy something they will throw enough engineers at it to make something better. Probably the best stock you could own right now for a long hold.",
        "created_utc": 1635804782,
        "id": "hixsp95",
        "permalink": "/r/stocks/comments/qkmmmq/if_you_could_put_3k_into_aapl_msft_or_fb_which/hixsp95/",
        "score": 235,
        "subreddit": "stocks",
        "created": 1635833582.0
    },
    {
        "author": "Berto_",
        "body": "Too big to fail. \nIt's now their problem.",
        "created_utc": 1635971095,
        "id": "hj7102r",
        "permalink": "/r/wallstreetbets/comments/qm30db/i_made_an_illegal_trade_and_tda_said_i_owe_26/hj7102r/",
        "score": 233,
        "subreddit": "wallstreetbets",
        "created": 1635999895.0
    },
    {
        "author": "CamelBest",
        "body": "FKK YEAHHH, I’m 19 as well and put 15k into GameStop at $30 and have been riding ever since, portfolios worth around 200k now!!! WERE IN THIS  FOR THE LONG RUN AND TO FK THE HEDGIES UPPP",
        "created_utc": 1635788650,
        "id": "hiwpd3y",
        "permalink": "/r/wallstreetbets/comments/qkj462/48k_gme_gains_at_19_years_old_been_holding_since/hiwpd3y/",
        "score": 225,
        "subreddit": "wallstreetbets",
        "created": 1635817450.0
    },
    {
        "author": "Phreeker27",
        "body": "PayPal somehow froze my account, I’ve used pay pal like 10 times in a decade I had it, I only used it when forced, now I have 75$ frozen for over a year with 0 customer support. So yes I agree if they can just steal money they will be able to post good profits",
        "created_utc": 1636506908,
        "id": "hk0ezrj",
        "permalink": "/r/StockMarket/comments/qqhbra/buy_paypal_stock_now/hk0ezrj/",
        "score": 218,
        "subreddit": "StockMarket",
        "created": 1636535708.0
    },
    {
        "author": "SexySPACsMan",
        "body": "Why exactly? They're the future of cars now, but before long they'll just be the present of cars and we can see how those are valued. Eventually profit matters\n\nThe EV bubble is the modern Dot Com bubble",
        "created_utc": 1635883390,
        "id": "hj1y3lv",
        "permalink": "/r/wallstreetbets/comments/qlb35d/yo_seriously_what_the_shit_would_tesla_even_need/hj1y3lv/",
        "score": 216,
        "subreddit": "wallstreetbets",
        "created": 1635912190.0
    },
    {
        "author": "overthetop7223",
        "body": "I guess I really need to watch this squid game now",
        "created_utc": 1636376754,
        "id": "hjsrz9g",
        "permalink": "/r/wallstreetbets/comments/qpbopa/red_light/hjsrz9g/",
        "score": 215,
        "subreddit": "wallstreetbets",
        "created": 1636405554.0
    },
    {
        "author": "Fletchiver",
        "body": "\nSo what im hearing is, if the result is\"Yes\" you're better off selling now and then rebuying once the price has finished dropping. However if the result is \"No\" we will still see the price dip slightly for a day or two, just due to the uncertainty that has been kicked up from the tweet.",
        "created_utc": 1636291911,
        "id": "hjo65ea",
        "permalink": "/r/StockMarket/comments/qoojdr/tsla_time_to_vote/hjo65ea/",
        "score": 205,
        "subreddit": "StockMarket",
        "created": 1636320711.0
    },
    {
        "author": "Im_A_MechanicalMan",
        "body": "The bigger question is:  Will retail traders cut and run when they see the price dip?\n\nor\n\nWill retail traders buy more because the share price is now very low!",
        "created_utc": 1636296137,
        "id": "hjoeyzd",
        "permalink": "/r/wallstreetbets/comments/qooebv/elons_playing_4d_chess/hjoeyzd/",
        "score": 202,
        "subreddit": "wallstreetbets",
        "created": 1636324937.0
    },
    {
        "author": "AleHaRotK",
        "body": "I live in a country with an annual inflation of over 50%.\n\nInflation does come with a delay, what the FED does now will not change the current inflation rate, there's usually a 12~18 months delay between inflation and the actual FED actions.\n\nPeople in the US are just not used to it, if I was you I wouldn't worry too much, inflation is actually moving very slowly and many prices are actually related to supply chain issues due to COVID among other things. I say you gotta wait a whole full year give or take starting from now to make up your mind.",
        "created_utc": 1636551698,
        "id": "hk2ejdo",
        "permalink": "/r/stocks/comments/qqukg1/consumer_price_index_surges_62_in_october/hk2ejdo/",
        "score": 198,
        "subreddit": "stocks",
        "created": 1636580498.0
    },
    {
        "author": "ScipioAtTheGate",
        "body": "[Props to whomever sold the puts and will now be living down on skid row after having to bankrupt themselves to buy those shares.](https://youtu.be/IqcRlyJhCb0?t=386)",
        "created_utc": 1636140573,
        "id": "hjgdwik",
        "permalink": "/r/wallstreetbets/comments/qnbbkc/278k_gain_on_peloton_puts/hjgdwik/",
        "score": 193,
        "subreddit": "wallstreetbets",
        "created": 1636169373.0
    },
    {
        "author": "mr_p2p",
        "body": "someone did suggest we put all the debt on someone and then kill him, i think it’s happening now.",
        "created_utc": 1635983096,
        "id": "hj7uc6f",
        "permalink": "/r/wallstreetbets/comments/qm30db/i_made_an_illegal_trade_and_tda_said_i_owe_26/hj7uc6f/",
        "score": 184,
        "subreddit": "wallstreetbets",
        "created": 1636011896.0
    },
    {
        "author": "snark_enterprises",
        "body": "Mr. Bezos has instructed me to advise all those that have made fun of him that your Prime accounts are now de-Activated. This can be remedied by issuing a public apology to him for hurting his feelers.",
        "created_utc": 1636394673,
        "id": "hjtx7qq",
        "permalink": "/r/wallstreetbets/comments/qpgdtr/personality_money_for_women_just_dont_be_a_poor/hjtx7qq/",
        "score": 182,
        "subreddit": "wallstreetbets",
        "created": 1636423473.0
    },
    {
        "author": "HarrisLam",
        "body": "they both look so much healthier now.  This photo looks like a meeting of the cancer survivor club wtf",
        "created_utc": 1636201830,
        "id": "hjjk2x4",
        "permalink": "/r/wallstreetbets/comments/qnygmr/back_in_2004/hjjk2x4/",
        "score": 180,
        "subreddit": "wallstreetbets",
        "created": 1636230630.0
    },
    {
        "author": "TheShaneHaley",
        "body": "First ones free. Now yolo those gains on something that will lead you to post a bigger loss porn!",
        "created_utc": 1636123067,
        "id": "hjf4hfv",
        "permalink": "/r/wallstreetbets/comments/qnci3t/my_first_time_ever_doin_options/hjf4hfv/",
        "score": 178,
        "subreddit": "wallstreetbets",
        "created": 1636151867.0
    },
    {
        "author": "freexe",
        "body": "I just hit my first 100k. It basically means that I now have 1/3 of a minimum wage employee earning me money every single day.",
        "created_utc": 1636394201,
        "id": "hjtw126",
        "permalink": "/r/stocks/comments/qphjri/just_hit_100k_my_first_milestone/hjtw126/",
        "score": 175,
        "subreddit": "stocks",
        "created": 1636423001.0
    },
    {
        "author": "InfamousJoker420",
        "body": "My 4 month old survived his kidney operation, I am so relieved, I have no friends so I’m just venting here. Now LFG gme",
        "created_utc": 1635954733,
        "id": "hj5tyxv",
        "permalink": "/r/wallstreetbets/comments/qlr721/daily_discussion_thread_for_november_03_2021/hj5tyxv/",
        "score": 174,
        "subreddit": "wallstreetbets",
        "created": 1635983533.0
    },
    {
        "author": "Hmpf84",
        "body": "I am your wife’s boyfriend now",
        "created_utc": 1636060379,
        "id": "hjc0lsq",
        "permalink": "/r/wallstreetbets/comments/qmulxy/pton_guhhh/hjc0lsq/",
        "score": 172,
        "subreddit": "wallstreetbets",
        "created": 1636089179.0
    },
    {
        "author": "ILikeMapleSyrup",
        "body": "Thank you. You're the only one who gave a serious answer.\n\nAnyways, now that my Tesla battery is fried, I can declare bankruptcy.",
        "created_utc": 1636073568,
        "id": "hjcvw1u",
        "permalink": "/r/wallstreetbets/comments/qmn4vd/its_the_way_it_goes/hjcvw1u/",
        "score": 169,
        "subreddit": "wallstreetbets",
        "created": 1636102368.0
    },
    {
        "author": "jimmydeansus",
        "body": "Looks like a call option. Look into call options and what they are and how they work. This option is open until Oct 2023. Very far out, your ITM (In the money) which is good. So you can sell it and take what the contract is worth right now. Or exercise it. Exercising means you'll be purchasing 100 shares at the strike price of which you bought the option for, you pay per share the strike price. So you bought .03 cent option strike price. You pay .03 cents for each share of 100. You then own 100 share of Said company, this is for going long on a company. There's much to option but it really isn't that hard to understand once you begin learning and understanding. Cause when you purchase a option contract your buying the \"rights\" to 100 shares of said company. Options are a tricky game but is a good game when played strongly. If you knew a stock was going up and you purchased many calls you can profit more for calls than buying said stock. Puts are like shorting, when you expect a stock to go down. Again man, I'm sure I'm making it confusing but YouTube it and read about it. Took me a minute to understand and then took me like months to understand completely across the whole options playing field",
        "created_utc": 1636356299,
        "id": "hjs28pk",
        "permalink": "/r/pennystocks/comments/qp856o/can_someone_please_explain_what_this_is_and_what/hjs28pk/",
        "score": 167,
        "subreddit": "pennystocks",
        "created": 1636385099.0
    },
    {
        "author": "CBH60",
        "body": "You have no concept of hot until you touch the stove and feel for yourself. \n\nThere are entire financial corporations full of financial gurus that still get it catastrophically wrong sometimes. It's a game of risk and best you can do is manage the risk. Learn how to fail and keep going. Fail forward. You can learn massive amounts and the only risk is money.\n\nFor those of us who are older the risk begins to include cars, home, feeding family, stable marriage etc. The smart of us work to isolate that risk to what we can afford to lose and still operate normally. Take your big risks now while it only has minor impact. It will give your pops opportunity to mentor you too.\n\nLots of words to say YOLO on young autist. There is much to learn.",
        "created_utc": 1636162779,
        "id": "hjhwffr",
        "permalink": "/r/wallstreetbets/comments/qnplhb/sometimes_i_wish_my_dad_didnt_work_finance/hjhwffr/",
        "score": 165,
        "subreddit": "wallstreetbets",
        "created": 1636191579.0
    },
    {
        "author": "BearsRfukd",
        "body": "#WE GGANBU NOW",
        "created_utc": 1636344505,
        "id": "hjrkr7e",
        "permalink": "/r/wallstreetbets/comments/qox80l/do_you_want_to_play_a_game/hjrkr7e/",
        "score": 165,
        "subreddit": "wallstreetbets",
        "created": 1636373305.0
    },
    {
        "author": "dtgeorge12",
        "body": "Is the Bryant fam officially in the billionaire club now?",
        "created_utc": 1635785276,
        "id": "hiwh6sq",
        "permalink": "/r/stocks/comments/qkdj6p/cocacola_buys_full_control_of_bodyarmor_for_56/hiwh6sq/",
        "score": 163,
        "subreddit": "stocks",
        "created": 1635814076.0
    },
    {
        "author": "wild_b_cat",
        "body": "Take a look at any chart of the market, and zoom waaaaaaay out to look at decades. You will see that over time the trend line is strongly upwards and short-term wobbles don't have a huge impact. If you're investing for decades away, you can afford to be patient.\n\nNow, if your timeline is shorter than that, then you're right to be cautious. What's your ultimate goal with this money, and when do you expect to need it?",
        "created_utc": 1635790809,
        "id": "hiwum4o",
        "permalink": "/r/investing/comments/qkk2nx/ive_saved_up_a_sizeable_sum_and_i_want_to_invest/hiwum4o/",
        "score": 162,
        "subreddit": "investing",
        "created": 1635819609.0
    },
    {
        "author": "odyssee14",
        "body": "I've been shorting Evergrande since June. It was one hell of a ride, now it's time to rest for a bit. My work is finished.",
        "created_utc": 1636560362,
        "id": "hk2yqcs",
        "permalink": "/r/wallstreetbets/comments/qqvo6g/evergrande_officially_defaulted/hk2yqcs/",
        "score": 162,
        "subreddit": "wallstreetbets",
        "created": 1636589162.0
    },
    {
        "author": "MktMover",
        "body": "Who the fuck is selling right now? All this wait and sell before the 🚀? Wtf.",
        "created_utc": 1635950679,
        "id": "hj5jjbb",
        "permalink": "/r/wallstreetbets/comments/qlviu5/gme_amc/hj5jjbb/",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1635979479.0
    },
    {
        "author": "10xwannabe",
        "body": "You make the same mistake all investors make thinking the markets in the short run (&lt;5-10 years) move based on any thing other then sentiment.  Just repeat the prescient mantra of the great Ben Graham, \"In the short run stock prices are a voting machine and in the long run are a weighing machine\".  He wrote that in his now famous book, \"Intelligent Investor\" in the 1930's and is more right now then probably was back then.",
        "created_utc": 1636035674,
        "id": "hja9hq6",
        "permalink": "/r/stocks/comments/qmlfn3/this_market_is_insane_why_is_the_stock_going_up/hja9hq6/",
        "score": 159,
        "subreddit": "stocks",
        "created": 1636064474.0
    },
    {
        "author": "CRobinsFly",
        "body": "Unfortunately some of what I lost is that - I sold two houses last month and now rent a room and live with the honey on the weekends.",
        "created_utc": 1635879709,
        "id": "hj1oluo",
        "permalink": "/r/wallstreetbets/comments/qlaurk/my_car_short_into_earnings_life_savings_and_some/hj1oluo/",
        "score": 156,
        "subreddit": "wallstreetbets",
        "created": 1635908509.0
    },
    {
        "author": "Roxaos",
        "body": "I swear I’d be a millionaire by now if I wasn’t such a bitch.",
        "created_utc": 1636067438,
        "id": "hjchr4w",
        "permalink": "/r/wallstreetbets/comments/qmt5z6/what_are_your_moves_tomorrow_november_05_2021/hjchr4w/",
        "score": 156,
        "subreddit": "wallstreetbets",
        "created": 1636096238.0
    },
    {
        "author": "LavenderAutist",
        "body": "Now can we see it from the WSB guys perspective?",
        "created_utc": 1636244479,
        "id": "hjm766f",
        "permalink": "/r/wallstreetbets/comments/qocmul/too_true/hjm766f/",
        "score": 155,
        "subreddit": "wallstreetbets",
        "created": 1636273279.0
    },
    {
        "author": "SeeThroughBanana",
        "body": "Wsb has become trash. It used to be about investment bets. Now its all about meming over stupid topics with the most outrageous takes with no relevance to actual investing.",
        "created_utc": 1635817614,
        "id": "hiylj0v",
        "permalink": "/r/wallstreetbets/comments/qkj5ot/monday/hiylj0v/",
        "score": 150,
        "subreddit": "wallstreetbets",
        "created": 1635846414.0
    },
    {
        "author": "skydiver19",
        "body": "I say this to myself all the time. Dam I should of held them 10BTC @ £200 each I would have £500k now. When in reality I would of prob sold them worth a 10th of that.",
        "created_utc": 1636118609,
        "id": "hjeu7zu",
        "permalink": "/r/options/comments/qn8y93/10000_gains/hjeu7zu/",
        "score": 149,
        "subreddit": "options",
        "created": 1636147409.0
    },
    {
        "author": "CRobinsFly",
        "body": "Nope. I have a negative net worth now.",
        "created_utc": 1635880199,
        "id": "hj1pvps",
        "permalink": "/r/wallstreetbets/comments/qlaurk/my_car_short_into_earnings_life_savings_and_some/hj1pvps/",
        "score": 147,
        "subreddit": "wallstreetbets",
        "created": 1635908999.0
    },
    {
        "author": "rgujijtdguibhyy",
        "body": "If you believed in daddy musk you'd already be retired by now",
        "created_utc": 1636314266,
        "id": "hjpoi39",
        "permalink": "/r/wallstreetbets/comments/qot1rj/its_not_about_money_its_about_sending_a_message/hjpoi39/",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1636343066.0
    },
    {
        "author": "Tip_Special",
        "body": "Should just buy fucking dividend stocks now",
        "created_utc": 1635892702,
        "id": "hj2m637",
        "permalink": "/r/wallstreetbets/comments/qlen8x/25k_to_2m_in_14_months_thanks_gme_and_nvax/hj2m637/",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1635921502.0
    },
    {
        "author": "Tersiv",
        "body": "Something called options. Now avoid them if you want to live a happy life.",
        "created_utc": 1635959614,
        "id": "hj66ykb",
        "permalink": "/r/wallstreetbets/comments/qlwhey/3k_73k_in_3_days_taking_your_wife_christmas/hj66ykb/",
        "score": 141,
        "subreddit": "wallstreetbets",
        "created": 1635988414.0
    },
    {
        "author": "AlmostGeorgeIV",
        "body": "&gt;Now turn it back into 10k",
        "created_utc": 1636091483,
        "id": "hjdtksg",
        "permalink": "/r/wallstreetbets/comments/qmtptf/i_did_it_10k_to_100k_ytd_brought_to_you_mostly_by/hjdtksg/",
        "score": 139,
        "subreddit": "wallstreetbets",
        "created": 1636120283.0
    },
    {
        "author": "hirme23",
        "body": "According to the valuation of all the startups next to Tesla, we will all own a couple of cars each. \n\nMore seriously, I think lots of EV startups will either fail or get acquired by current OEMs to solidify/accelerate their EV portfolio. \n\nI think legacy automakers have an edge for high volume quality assembly lines.\n\nEdit: ride sharing can only work in high density cities. People will still buy cars 10-20 years from now",
        "created_utc": 1636045495,
        "id": "hjaymyz",
        "permalink": "/r/investing/comments/qmokya/current_future_state_of_automakers/hjaymyz/",
        "score": 138,
        "subreddit": "investing",
        "created": 1636074295.0
    },
    {
        "author": "superepicunicornturd",
        "body": "Been a $Z holder for a few years now and singing its praises the entire time. However, I think I'll be closing my position out tomorrow. It's been a fun ride but the operational mishaps surrounding the iBuyer segment have been disappointing. Not to say that COVID hasn't dogged the model but the whole model was really predicated on executional excellence from the top down but that has clearly failed to come to fruition. And if the $Z can't do it then i'd venture to say that the other iBuyers are likely having a tough go of it as well, but only time will tell whether this is $Z specific or if the model fundamentally needs to be rethought.  \n\n\nIt's been a fun ride $Z, but i'm out. Hello more VTI shares",
        "created_utc": 1635913870,
        "id": "hj3yvgd",
        "permalink": "/r/investing/comments/qlmgq5/zillow_says_its_closing_homebuying_business/hj3yvgd/",
        "score": 137,
        "subreddit": "investing",
        "created": 1635942670.0
    },
    {
        "author": "CakeDayisaLie",
        "body": "After how they locked people out of GME and now this, why would anyone stick around?",
        "created_utc": 1636426369,
        "id": "hjw0218",
        "permalink": "/r/CanadianInvestor/comments/qpt1sf/robinhood_says_email_addresses_of_5_mln_customers/hjw0218/",
        "score": 137,
        "subreddit": "CanadianInvestor",
        "created": 1636455169.0
    },
    {
        "author": "CrayfishYAY2",
        "body": "Literally only 1 post about this 13 days ago, with only 21 upvotes now. This is so frustrating.",
        "created_utc": 1635871919,
        "id": "hj14qbr",
        "permalink": "/r/wallstreetbets/comments/ql5y30/how_is_no_one_talking_about_avis_at_all/hj14qbr/",
        "score": 136,
        "subreddit": "wallstreetbets",
        "created": 1635900719.0
    },
    {
        "author": "bkbikeberd",
        "body": "From what people in the real estate market told me is that they would overpay for homes in hopes of flipping it for a profit. If you sold your home above market it’s good for you but if you are buying a home you are now competing with a giant company with near endless money. My home went up in price from 680K to 850K in just about 8 months and that’s without Zillow buying up homes in my market. Imagine with them here making ridiculous cash offers way above market value.",
        "created_utc": 1635913651,
        "id": "hj3yhfw",
        "permalink": "/r/investing/comments/qlmgq5/zillow_says_its_closing_homebuying_business/hj3yhfw/",
        "score": 135,
        "subreddit": "investing",
        "created": 1635942451.0
    },
    {
        "author": "garym81",
        "body": "I bought some this morning. It's gone down due to a fall in the revenues from EBay, and they've lowered their guidance for revenue and earnings. \n\nHowever, I'm excited about their future. From what I understand, they're looking at starting a stock trading platform which should see revenues grow in the future. And, with their acceptance of cryptocurrencies, I imagine there might be deals being signed elsewhere for them to be a payment provider on more platforms. That's just my speculation though.\n\nI got in at $212. Will stop looking at the charts for now, and check back in a few months. For now, it's a long-term hold for me.",
        "created_utc": 1636472961,
        "id": "hjy44md",
        "permalink": "/r/stocks/comments/qq6ef5/pypl_taking_a_nose_dive_day_after_earnings/hjy44md/",
        "score": 135,
        "subreddit": "stocks",
        "created": 1636501761.0
    },
    {
        "author": "BrainSlurper",
        "body": "The worst part is that the \"when\" of this particular crash will be decided not by a random, panicked sell off or some sort of fund collapsing, but by the federal reserve announcing a policy change. Special people will know in advance, while the average person has no chance to time the market based on their own indicators.\n\nIt could be 2 years from now. Or 5. Or 7. But it will absolutely be deliberate, and almost certainly politically convenient.",
        "created_utc": 1636540032,
        "id": "hk1wc5y",
        "permalink": "/r/wallstreetbets/comments/qqkbbc/well_its_official_this_is_all_our_fault/hk1wc5y/",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1636568832.0
    },
    {
        "author": "nevermore1720",
        "body": "This post is too sensible for WSB. Let me make random counter point for entertainment purposes. Inflation is good for you just like unaffordable housing and homelessness. I feel better now.",
        "created_utc": 1636475525,
        "id": "hjyag7h",
        "permalink": "/r/wallstreetbets/comments/qq6qgt/wholesale_prices_rise_86_year_over_year_in/hjyag7h/",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1636504325.0
    },
    {
        "author": "JSGypsum",
        "body": "Would it be dumb to sell my American airlines stock right now",
        "created_utc": 1636121492,
        "id": "hjf0ne7",
        "permalink": "/r/stocks/comments/qnaff5/pfizers_new_covid_pill_cuts_death_and/hjf0ne7/",
        "score": 132,
        "subreddit": "stocks",
        "created": 1636150292.0
    },
    {
        "author": "FinndBors",
        "body": "Have antivirals been this effective for other viruses? As far as i knew as of a few years ago, most of them aren’t very effective. Tamiflu barely does anything to the flu. But now we have this drug and the Merck one was also pretty effective. What tech is behind these and are there certain companies in the forefront?",
        "created_utc": 1636126071,
        "id": "hjfc293",
        "permalink": "/r/investing/comments/qn9o7d/pfizer_says_its_covid_pill_with_hiv_drug_cuts_the/hjfc293/",
        "score": 131,
        "subreddit": "investing",
        "created": 1636154871.0
    },
    {
        "author": "Apha-apha",
        "body": "It soared unexpectedly.. I think it is wise to sell now and buy back later under 1000",
        "created_utc": 1636230700,
        "id": "hjlcst9",
        "permalink": "/r/wallstreetbets/comments/qo8ded/my_lifesavings_are_in_tsla_please_dont_elon/hjlcst9/",
        "score": 131,
        "subreddit": "wallstreetbets",
        "created": 1636259500.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "In the short term, possible, but it might wobble a bit.\n\nLong term, they're investing a lot in EV and I think it will pay off for them.\n\nThat said, I wouldn't hold auto companies, I'd only swing trade it, and the entry isn't good anymore for this round.\n\nIf I had paid $16 I'd be exiting right now and moving on to next trade.",
        "created_utc": 1636419836,
        "id": "hjvljki",
        "permalink": "/r/StockMarket/comments/qprenm/hello_my_fellow_investors_what_ya_think_on_ford/hjvljki/",
        "score": 131,
        "subreddit": "StockMarket",
        "created": 1636448636.0
    },
    {
        "author": "Azyan_invasion82",
        "body": "He was a 30 year old virgin that can now get all the strippers his heart desires",
        "created_utc": 1636392671,
        "id": "hjts69j",
        "permalink": "/r/wallstreetbets/comments/qpgdtr/personality_money_for_women_just_dont_be_a_poor/hjts69j/",
        "score": 130,
        "subreddit": "wallstreetbets",
        "created": 1636421471.0
    },
    {
        "author": "Manateeboi",
        "body": "Nice work. Now get off Robinhood.",
        "created_utc": 1636174208,
        "id": "hjiiokd",
        "permalink": "/r/StockMarket/comments/qnruuf/finally_in_the_green_fellas_it_was_a_rough_start/hjiiokd/",
        "score": 130,
        "subreddit": "StockMarket",
        "created": 1636203008.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  1st of November\n\n\n\n## Upcoming events for Monday, November  1st\n\n - Expected earnings:\n\n  ABIO, ADC, ADTN, ADUS, AKTS, ALX, AMC, AMG, AMRC, ANAT, ANET, APEN, APLS, AWR, BEN, BNL, BRKR, BRX, BWXT, CACC, CAR, CCLP, CEA, CHGG, CLDB, CLX, CNA, CORR, CPLP, CRNT, CRUS, CSR, CSWC, CURO, CVI, CWBC, DSPG, DSS, DZSI, EC, EEX, EGRX, ENBL, EPRT, EVER, FANG, FEDU, FGBI, FN, GAIA, GAME, GSS, GTE, GXO, HLIT, HNRG, HOLX, IPI, ISEE, IVAC, IVT, IX, JELD, KFRC, KLDO, KMT, KOF, L, LDI, LEG, LKCO, LTRN, LXU, MCK, MFIN, MGP, MNOV, MOS, MRBK, MVBF, NBIX, NERV, NRIM, NSP, NSSC, NTR, NXPI, O, OGS, OIS, ON, ONVO, OTTR, PCG, PDLB, PLOW, PSA, RHP, RIG, RMBS, RRX, RYAAY, SBAC, SBT, SKT, SMLR, SNDX, SOI, SPG, SUNW, SXC, TA, TKR, TRVG, TRVN, TTI, UAN, UNVR, VBIV, VNO, VNOM, VRNS, WBK, WLFC, WMB, WMK, WTRG, XENT, ZI\n\n - Ex-div:\n\n  AES, BANR, BKR, ETRN, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, HIHO, IGD, ITUB, LMRK, O, OMF, SHLX, SPH, SRCE, VER, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.055%)\n    - 6-Month Bill Auction (previous: 0.060%)\n    - Construction Spending (consensus: 0.4%, previous: 0.3%)\n    - ISM Manufacturing Employment (previous: 50.2)\n    - ISM Manufacturing New Orders Index (previous: 66.7)\n    - ISM Manufacturing PMI (consensus: 60.5, previous: 61.1)\n    - ISM Manufacturing Prices (consensus: 78.5, previous: 81.2)\n    - Investing.com Gold Index (actual: 59.9%, previous: 54.3%)\n    - Investing.com S&amp;P 500 Index (actual: 57.5%, previous: 47.2%)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 59.2, previous: 60.7)\n    - Total Vehicle Sales (previous: 9.66M)\n\n## Upcoming events for Tuesday, November  2nd\n\n - Expected earnings:\n\n  AAIC, ACH, ACOR, ACT, ADCT, ADXN, AFG, AGRX, AHH, AIZ, AKAM, AMCR, AME, AMED, AMGN, ANDE, APO, APPS, AQB, AQST, ARCB, ARGO, ARNC, AROC, ATVI, AVNS, AWK, AYX, BBGI, BCC, BFAM, BGFV, BHC, BKH, BLD, BLMN, BP, BRY, BSBR, BTG, BXC, CASA, CDK, CDLX, CEIX, CERS, CHCT, CHK, CIGI, CINR, CLNN, CLW, CMI, COP, COUR, CRK, CRSR, CRVL, CSLT, CTLT, CZR, DAR, DCO, DCP, DCPH, DD, DEA, DEI, DENN, DHT, DOX, DRRX, DS, DVN, EARN, EDU, EGHT, EIX, EKSO, EL, ELVT, ENLC, EOLS, EPD, ESPR, ETN, ETRN, EXAS, EXEL, EXLS, EXPD, EXTN, EXTR, FMC, FNF, FRG, FRSH, FSP, FSTR, GAIN, GIC, GLDD, GLT, GLYC, GNRC, GNW, GPN, GPOR, GRBK, HALO, HCC, HEES, HEP, HLF, HLNE, HRB, HSC, HSIC, HURN, HY, IAA, IART, ICD, ICFI, ICHR, IDXX, IEP, INCY, INFI, INGR, INSP, INTG, INVE, IOSP, IPGP, IT, JBGS, JRVR, KAI, KAMN, KAR, KKR, KOPN, KTCC, LCII, LDOS, LEA, LGIH, LILA, LILAK, LIND, LPI, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, MANT, MCY, MDLZ, MDXG, MEC, METC, MG, MGNX, MGY, MIME, MINM, MKL, MLM, MMP, MOD, MPC, MPLX, MRCC, MRCY, MTCH, MTRN, MYGN, NAUT, NCSM, NE, NETI, NMIH, NNN, NP, NR, NRC, NRZ, NSA, NXRT, NXST, NYMT, OCFT, OCN, OKE, OMCL, OMIC, ORTX, OSPN, OVV, PAA, PACB, PAGP, PAHC, PAYC, PEAK, PEG, PFE, PINC, PIRS, PKI, PKOH, PMTS, PRO, PRTS, PRU, PTRS, PUMP, QUAD, RACE, RAMP, RARE, RCKY, RCM, RDN, RGNX, RIGL, RL, RM, ROK, RRD, RRR, RYAM, RYTM, SABR, SAGE, SEB, SEDG, SEE, SEVN, SFST, SGRY, SHIP, SKY, SKYT, SMCI, SNCY, SPLP, SPT, SQNS, SRC, SRCL, SREV, SRG, SRT, STAR, STE, STRL, TCS, TECH, TMUS, TMX, TNC, TRC, TRI, TRNS, TRTX, TSLX, TSQ, TTM, TVTY, TX, UA, UAA, UBCP, UFPT, UIS, UNM, USAC, USDP, UTL, VAL, VECO, VMD, VOYA, VRSK, VRTX, WAT, WBT, WEC, WEYS, WFRD, WLK, WLKP, WTI, WTTR, WU, XHR, XPO, XYL, Z, ZBRA, ZG, ZYME\n\n - Ex-div:\n\n  ASML, BRO, CAPL, CBAN, DSX, HFWA, LUB, MCBS, MKTX, MTX, NTIC, SSBK, TACO, TRS, USDP, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.090%)\n    - API Weekly Crude Oil Stock (previous: 2.318M)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - Redbook (previous: 15.6%)\n\n## Upcoming events for Wednesday, November  3rd\n\n - Expected earnings:\n\n  AAWW, ACA, ACEL, ACLS, ACRE, ACRS, ADPT, AEE, AFIN, AGIO, ALB, ALL, ALTM, AMOT, AMRN, AMSC, ANAB, ANSS, ANVS, APA, ARAY, ARC, ARTL, ARTNA, ASC, ASTE, ASXC, ATEX, ATGE, ATH, ATRC, ATXI, ATY, AUPH, AUTL, AVA, AVNW, AXGN, BBSI, BCRX, BCSF, BDC, BDSI, BGCP, BGSF, BIP, BKCC, BKNG, BLKB, BLUE, BNFT, BR, BRSP, BVH, BWA, CAKE, CCRN, CCU, CDAY, CDEV, CDW, CDXC, CENX, CF, CFMS, CGBD, CHNG, CIA, CIM, CIO, CIX, CKPT, CLH, CLR, CLVS, CMLS, CMP, COHN, CORT, CPE, CPK, CPRI, CPS, CRL, CRTO, CSGS, CSTE, CSWI, CTRA, CTVA, CUTR, CVE, CVGI, CVS, CW, CWAN, CWH, CYTK, DFIN, DIOD, DISCA, DISCB, DISCK, DMAC, DNOW, DRTT, DXC, DXYN, EA, EAT, ECPG, EGY, ELA, ELF, EMR, EPR, EQH, EQIX, EQX, ES, ET, ETR, ETSY, EVA, EVH, EVOP, EVRG, EVRI, EXC, EXPI, EYPT, FDP, FLMN, FLT, FLXN, FNV, FOE, FORR, FOX, FOXA, FRGI, FRPH, FSLY, FSR, FUN, FYBR, GCP, GDDY, GDEN, GFL, GHC, GHL, GLBZ, GLRE, GMAB, GMRE, GNK, GRP.U, GTHX, H, HARP, HBB, HBIO, HBM, HBP, HDSN, HFC, HLMN, HMN, HOFV, HR, HRTX, HST, HUBS, HUM, HZNP, IAG, ICLR, ICPT, ICUI, IDN, IIPR, IMXI, INFN, INMB, INN, INSG, IO, IONS, IR, ITI, ITIC, ITT, ITUB, IVR, JLL, KE, KIDS, KL, KLTR, KNBE, KPTI, KRO, KTOS, KW, LAMR, LANC, LAND, LBTYA, LBTYB, LBTYK, LCI, LCTX, LEXX, LHCG, LIVN, LL, LNC, LPG, LUMN, LUMO, LYTS, MAC, MAR, MATX, MAXR, MCHX, MCS, MDU, MET, MFC, MGM, MGNI, MGPI, MGYR, MLNK, MLP, MLR, MNKD, MNRL, MPLN, MRO, MRTX, MTG, MTTR, MTW, NC, NCLH, NESR, NEXT, NFE, NHTC, NI, NL, NMFC, NODK, NRP, NUS, NVST, NYT, OAS, OCDX, ODP, OLP, OM, OMI, OMP, ONCT, ONEM, OPRT, ORA, ORCC, OSUR, OSW, OTIC, PARR, PBI, PBPB, PCRX, PEN, PETQ, PFIE, PING, PK, PLMR, PLTK, PLYA, PRAX, PRG, PRTA, PSN, PTC, PTGX, PTVE, PXD, QCOM, QGEN, QLYS, QMCO, QNST, QRVO, QTWO, QUOT, RADA, RC, RCII, RCKT, RDWR, REGI, RGLD, RGR, RMNI, RNWK, ROCC, ROKU, RPD, RPT, RTLR, RVI, RVLV, RVPH, RYI, RYN, SAFT, SANA, SAND, SBGI, SBOW, SBRA, SD, SENEA, SENEB, SGC, SGMO, SHOO, SITE, SITM, SJI, SKLZ, SLF, SLRC, SMG, SNSE, SPNS, SPNT, SPPI, SPR, SPWR, SPXC, SRDX, SRPT, SSRM, SSSS, STAA, STCN, STGW, STN, SUM, SUN, SUNS, SUP, SUPN, SWM, SWN, SYN, SYNH, TALO, TARS, TBPH, TCON, TCPC, TGB, TISI, TLK, TNDM, TPC, TPVG, TREC, TRMB, TRNO, TRUE, TRUP, TS, TSP, TT, TTGT, TTWO, TUP, TWNK, TXG, UBX, UE, UGP, UHAL, UMH, UPLD, VAPO, VEL, VGR, VIRT, VKTX, VMAR, VMEO, VNDA, VNTR, VRTV, VSH, VTOL, VVNT, VVV, WHD, WING, WK, WTS, YELL, ZD, ZY\n\n - Ex-div:\n\n  AWI, BBD, BBDO, BSMX, CATC, FELE, FMX, HESM, HOPE, NEP, STBA, WSFS\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 400K, previous: 568K)\n    - Crude Oil Imports (previous: 0.702M)\n    - Crude Oil Inventories (previous: 4.267M)\n    - Cushing Crude Oil Inventories (previous: -3.899M)\n    - Distillate Fuel Production (previous: 0.164M)\n    - Durables Excluding Defense (previous: -2.0%)\n    - EIA Refinery Crude Runs  (previous: 0.058M)\n    - EIA Weekly Distillates Stocks (consensus: -2.311M, previous: -0.432M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.3%, previous: 0.4%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Factory Orders (consensus: 0.1%, previous: 1.2%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Fed Interest Rate Decision (previous: 0.25%)\n    - Gasoline Inventories (previous: -1.994M)\n    - Gasoline Production (previous: 0.012M)\n    - Heating Oil Stockpiles (previous: -0.031M)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 62.3)\n    - ISM Non-Manufacturing Employment (previous: 53.0)\n    - ISM Non-Manufacturing New Orders (previous: 63.5)\n    - ISM Non-Manufacturing PMI (consensus: 62.1, previous: 61.9)\n    - ISM Non-Manufacturing Prices (previous: 77.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.30%)\n    - MBA Mortgage Applications (previous: 0.3%)\n    - MBA Purchase Index (previous: 275.6)\n    - Markit Composite PMI (consensus: 57.3, previous: 57.3)\n    - Mortgage Market Index (previous: 645.1)\n    - Mortgage Refinance Index (previous: 2,763.8)\n    - Services PMI (consensus: 58.2, previous: 58.2)\n    - Trade Balance (consensus: -80.30B, previous: -73.30B)\n\n^^^^2021-11-01",
        "created_utc": 1635760818,
        "id": "hiv8hui",
        "permalink": "/r/RobinHood/comments/qkan8y/daily_discussion_thread_november_1st_2021/hiv8hui/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635789618.0
    },
    {
        "author": "_grapevan",
        "body": "Anyone else playing NXPI earnings?",
        "created_utc": 1635795956,
        "id": "hix76ry",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hix76ry/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635824756.0
    },
    {
        "author": "SippieCup",
        "body": "&gt; Do you understand why they are forecasting a loss and increased expenses? \n\nI am talking about Revenue, not expenses.\n\n&gt;You idiots think too short term, you need to think long term and invest based on that. Thats why I am a multi millionaire with early bets on many of the strongest companies today.\n\nlol. You invested in Tesla, good job. So did the rest of us. You are still illiterate. \n\n&gt;Anyways go ahead and invest in AMD and forget Intel, we can only look back and see so who knows, maybe Intel just shrivels up and disintegrates and AMD becomes a trillion dollar company…\n\nHere's a secret. You can do both at the same time! Although at the moment I see no reason for purchasing additional Intel stock. Intel is the next IBM/Oracle, they won't go anywhere, but they really have limited growth in comparison to others in the market.",
        "created_utc": 1635779757,
        "id": "hiw4i5m",
        "permalink": "/r/investing/comments/qkaphs/amat_amd_instead_of_nio_qs_is_this_a_good_bet/hiw4i5m/",
        "score": 1,
        "subreddit": "investing",
        "created": 1635808557.0
    }
]