[
    {
        "author": "Rico_Stonks",
        "body": "Tech is actually a very broad term though. If a company isn't innovating and developing new technologies to better themselves then they're doomed to follow the dinosaurs (eventually).\n\nYou can and should be diverse within \"tech\" (e.g. chips=NVDA, industrial=RTX or TER, fintech=SQ, retail=AMZN, ads=GOOG, entertainment=NFLX, hospitality=ABNB, software, hardware, clean energy, health, etc...). But there will be risk because most of these are growth, and their valuations will look less enticing if there are macro changes in the economy.",
        "created_utc": 1617990762,
        "id": "gtyexgz",
        "permalink": "/r/stocks/comments/mn5gie/i_love_etfs_but_all_of_my_etf_choices_are_heavily/gtyexgz/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1618019562.0
    },
    {
        "author": "ffsudjat",
        "body": "I was thinking, no way, ter is 0.07%. However then, I stood corrected. IVV ter is 0.03% while the ucit is indeed 0.07%.",
        "created_utc": 1617738074,
        "id": "gtltrgr",
        "permalink": "/r/stocks/comments/mlgh31/blackrock_blk_holdings_look_similar_to_etfs_like/gtltrgr/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1617766874.0
    },
    {
        "author": "Spec-Chum",
        "body": "They're a competitor of TSM (not really, in practice; UMC are nowhere near as advanced, specialising in 28nm and above fab), so they won't benefit from this.\n\nTo look at companies that would, look at: TER, ASML and LRCX as well as AMAT and ASYS from the OP.",
        "created_utc": 1617319799,
        "id": "gt35x4o",
        "permalink": "/r/stocks/comments/mi1v5s/taiwan_semiconductors_investing_100_billion_to/gt35x4o/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1617348599.0
    },
    {
        "author": "johnsmart2",
        "body": "Critique my EFT strategy (UK-based beginner) please \n \nHorizon 10-15 years\n\n20K to begin with, topping at least 1K per month.\n \nI read a couple of books on investing over the weekend and came to the conclusion that with my (lack of) knowledge of the markets my best bet is to go for maximally diversified portfolio,  and put it all into shares for now, to (hopefully!) gain some momentum to begin with. I’d be also inclined to tilt it a little towards growth and tech for the coming year.\n \nSo I’m thinking:\n \n75%  Vanguard FTSE All-world (VWRP =  VT in the US) TER 0.25%\n\n15%  Nasdaq 100 (=QQQ) TER 0.30%\n\n10%  S&amp;P SmallCap 600 TER 0.375%\n \nI’m not sure what to think of the overlap between Nasdaq and All-World. It adds exposure to that sector of course, but it tech has done so well over the past 5 years…\n \nOne alternative would be to keep it super simple and just go for All-World. There’s also a cheaper All-World option on my platform, although it hasn’t done as well as the Vanguard one.\n \niShares Global Stocks at TER 0.175",
        "created_utc": 1617271729,
        "id": "gt0jwqf",
        "permalink": "/r/investing/comments/mhr8j1/daily_advice_thread_all_basic_help_or_advice/gt0jwqf/",
        "score": 1,
        "subreddit": "investing",
        "created": 1617300529.0
    },
    {
        "author": "that1celebrity",
        "body": "Cathie likes teradyne. Nobody watching that",
        "created_utc": 1617348020,
        "id": "gt4bumh",
        "permalink": "/r/stocks/comments/mi8p2x/pltr_is_a_low_bottom_company_and_has_become_too/gt4bumh/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617376820.0
    },
    {
        "author": "ScarletHark",
        "body": "A comment I was replying to was deleted, it was basically asking about different ways to play semis this summer on a budget, and mentioned they had done calls on SOXL and puts on SOXS so far. So I wanted to post the reply here anyway.\n\n\\---------------------------------------------------------------------------\n\nSOXL/counter-SOXS is a good way to play the semi expansion through all of its phases; I have long SOXL in my investment account for this reason. It's 3x levered already, so adding leverage through options takes nerves of steel, because that leverage swings both directions -- you will need to ride out the stomach-churning drops that can happen day-to-day. However, swing-trading or scalping options on SOXL/SOXS can work, because the semi industry only has tailwinds right now, and at 1,000 feet, I think SOX/SOXL/counter-SOXS trends upwards through this year.\n\nIt's possible to do the same with individual names, including some of the ones I mentioned. One of the issues will be figuring out whether the recent gap-ups in names like AMAT, ASML, LRCX and TER are fully pricing in PEG, because AMAT jumped from 24x TTM earnings to 30x; TER jumped from about the same level to 27x; LRCX to 28x. But that's all TTM earnings -- these companies are expecting additional earnings growth this year on the back of announcements by Intel and TSMC to spend upwards of at least $120B over the next three years ($100B announced by TSMC, $20B so far announced by Intel, with a hint of more to come later this year). In Feb 2021, [the AMAT earnings release had already painted a rosy picture for 2021](https://www.fool.com/earnings/call-transcripts/2021/02/19/applied-materials-amat-q1-2021-earnings-call-trans/); we'll possibly know more come the [AMAT Investor Day on April 6](https://ir.appliedmaterials.com/events/event-details/investor-meeting). Also know that AMAT supplies not just the CPU/GPU manufacturers, but also has good exposure to the memory semiconductor manufacturers, such as Micron (MU), who just had an incredible ER and gave impressive 2021 projections.\n\nI keep singling out AMAT because in terms of options, they are the most liquid, and therefore the most accessible; ASML and LRCX are great companies but their options chains tend to be less liquid than AMAT's; LRCX is a bit better than ASML's in this regard. These could be good LEAPS opportunities if you are willing to wait out IV before entering, and wait out buyers when you go to sell. TER only has monthlies, and have OK liquidity around the money, but you can still get decent action out to 0.04 delta above the money on TER calls. TER IVR is currently 11, but the options are still running in the 40s/50s for IV. \n\nI had previously done 113/114 put credit spreads on AMAT for Mar-5 and Mar-12 expirations, and those both held (Mar-5 closed at 113.45 IIRC, however). I later opened a PMCC on AMAT for Jan22\\[80c\\]/Mar-26\\[121c\\] and ended up chasing the short higher because AMAT jumped so fast (up to that point, AMAT had been trending steadily upwards, but not leaping like it has the past few days). I was able to get out of the short (which I had rolled to Apr-9 125) when AMAT retreated a bit, and then sold the LEAPS too because I figured the spike was done -- regretting that now. ;) I'm waiting a few more days to see if the churn is done (and for IV to come back down), and will probably open another LEAPS on it at some point. AMAT is still pretty volatile -- IVR 46 (which is unusual for them up to this point this year) and Apr-16 options are still in the 40s and 50s, favoring selling, rather than paying, premiums. \n\nI don't think we see a retreat in any of these names this summer; they've been able to withstand the rotation in and out of tech the past couple of weeks, which suggests that traders and investors are finally done painting everything that smells of tech with the same broad brush.",
        "created_utc": 1617330496,
        "id": "gt3oku4",
        "permalink": "/r/options/comments/mi9kxb/playing_the_semiconductor_shortage/gt3oku4/",
        "score": 1,
        "subreddit": "options",
        "created": 1617359296.0
    },
    {
        "author": "creemeeseason",
        "body": "MSFT 18.41%\n\nETSY 11.78%\n\nVOO 10.41%\n\nPYPL 9.34%\n\nDE 9.12%\n\nCVX 6.98%\n\nPRPL 5.92%\n\nCash 4.98%\n\nTER 4.86%\n\nMEDP 4.8%\n\nSTMP 3.85%\n\nIPOD 3.79%\n\nSDGR 3.7%\n\nTTCF 1.47%\n\nBFI  0.58%",
        "created_utc": 1617382837,
        "id": "gt5oucw",
        "permalink": "/r/stocks/comments/lv5dlb/rate_my_portfolio_rstocks_quarterly_thread_march/gt5oucw/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617411637.0
    },
    {
        "author": "MassHugeAtom",
        "body": "Cathie didn’t add too many speculative stocks. Though she bought 728k shares of tusimple for arkq, she sold google, ter, snps for it.",
        "created_utc": 1618552523,
        "id": "gup107d",
        "permalink": "/r/stocks/comments/mrb95v/rstocks_daily_discussion_options_trading_thursday/gup107d/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618581323.0
    },
    {
        "author": "snark42",
        "body": "And TER pulled up 2% more to close 11.38% up for the day while PLTH fell over and stayed at 9.45%.",
        "created_utc": 1617740171,
        "id": "gtlynpq",
        "permalink": "/r/weedstocks/comments/ml86b8/daily_discussion_thread_april_06_2021/gtlynpq/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1617768971.0
    },
    {
        "author": "ganbaro",
        "body": "Even if such a statement would be true, why would you invest in a stock of an asset manager/investment company whose trading strategy might change at any moment, just to save the extremely low TER of world ETFs?",
        "created_utc": 1617742080,
        "id": "gtm31sm",
        "permalink": "/r/stocks/comments/mlgh31/blackrock_blk_holdings_look_similar_to_etfs_like/gtm31sm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617770880.0
    },
    {
        "author": "seigy",
        "body": "I've been in this sector for a long time and it is my primary sector (~50% of my portfolio).  Based on my last cross screenings there are a lot of great plays here.  I am not going to specify any of my positions and recommend you independently investigate any stock further before investing.  With that said my most recent analysis kicked out.  \nSemi-eq: AMAT, LRCX, TER\nSemi-fab: TSM\nChips: AMD, NVDA, QRVO, &amp; SWKS\n\nThere are many other great names in the area and some that I want to buy myself however, I work primarily on a formulaic approach to removes my bias.",
        "created_utc": 1617589604,
        "id": "gteu49y",
        "permalink": "/r/stocks/comments/mk8qcl/semiconductor_related_stocks/gteu49y/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617618404.0
    },
    {
        "author": "kids_eat_drugs",
        "body": "It seemed to be in the same work focus for me. For instance, both AMD and TSM dropped. So did TER but it recovered lol",
        "created_utc": 1617631946,
        "id": "gtgehv6",
        "permalink": "/r/stocks/comments/mkgpbr/rstocks_daily_discussion_monday_apr_05_2021/gtgehv6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617660746.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "MasterCard \nBroadcom\nApple\nBerkshire Hathaway \nShopify\nVisa\nEnphase Energy\nNvidia\nTeradyne\nQORVO\nZebra \nEtsy\nAmazon \nGoogle\nCitigroup \nREGI \n\n\nNot in any particular order, MasterCard, Apple and Nvidia are the largest positions each around 10%",
        "created_utc": 1617769309,
        "id": "gtnjbpg",
        "permalink": "/r/stocks/comments/lv5dlb/rate_my_portfolio_rstocks_quarterly_thread_march/gtnjbpg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617798109.0
    },
    {
        "author": "luvens",
        "body": "Sold my April ter a lil early.",
        "created_utc": 1617633067,
        "id": "gtggpnq",
        "permalink": "/r/wallstreetbets/comments/mkh463/daily_discussion_thread_for_april_05_2021/gtggpnq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617661867.0
    },
    {
        "author": "wet_tree",
        "body": "TER has been disappointing ? Went on a great run. It’s consolidated with the sector but beautiful gains were had.",
        "created_utc": 1617745907,
        "id": "gtmbd7t",
        "permalink": "/r/weedstocks/comments/mlkbpn/after_hours_discussion_thread_april_06_2021/gtmbd7t/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1617774707.0
    },
    {
        "author": "2jzge",
        "body": "Also semiconductor testing equipment manufacturer Teradyne has crushed it lately",
        "created_utc": 1617660528,
        "id": "gti4g0c",
        "permalink": "/r/wallstreetbets/comments/mkljmv/amd_increasing_production_by_20_in_q2_buy_before/gti4g0c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617689328.0
    },
    {
        "author": "ScarletHark",
        "body": "I work in the semi industry and I've been in and out of AMAT positions the past couple of months. TSM, Samsung and INTC have near-term headwinds in terms of earnings based on semiconductor demand simply because it takes so long to expand capacity. The front-end winners in current semi production efforts are going to be those who supply the tools, products and services that go into these fabs that are planned for construction: AMAT, ASML, TER, LRCX, to name a few. Secondary effects on earnings from this will come 1-2-3 years down the line for the semi manufacturers themselves, depending on whether or not they are expanding/upgrading an existing facility, or building one from the ground up.\n\nThe end-users of these semiconductor products (GM, F, NVDA, AMD, etc.) will be the last ones to benefit from expanded chipmaking capacity, as easing the demand crunch allows them to resume normal sales levels. Note that for auto mfrs, this has a ripple effect on rental car companies, who sold all of their fleets in fire sales last year and now can't replace them because the auto mfrs can't make cars.\n\nAdditionally, TSMC is booked up for the foreseeable future; these bookings have prices agreed well in advance, and are almost certainly not subject to TSMC's recent statements that they plan to increase prices; that will happen with new bookings down the line.",
        "created_utc": 1617325086,
        "id": "gt3fbzb",
        "permalink": "/r/options/comments/mh99ky/anyone_have_any_options_on_tsm/gt3fbzb/",
        "score": 1,
        "subreddit": "options",
        "created": 1617353886.0
    },
    {
        "author": "Trisolaran_arbitrage",
        "body": "Why is TER hardly ever mentioned in relation to TSM? They will benefit enormously from this as well - TSM has been their largest customer the past few years.",
        "created_utc": 1617302978,
        "id": "gt27ad4",
        "permalink": "/r/stocks/comments/mi1v5s/taiwan_semiconductors_investing_100_billion_to/gt27ad4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617331778.0
    },
    {
        "author": "ffsudjat",
        "body": "It cost a fortune, say 1% ter compared to ETF of 0.07%. My ETF grew -15% in 5 years when SP500 +50%. From there I dont trust mutual fund and the one suhgestingbit, my bank financial advisor, anymore.",
        "created_utc": 1617340294,
        "id": "gt435cj",
        "permalink": "/r/StockMarket/comments/mianav/its_lame_but_its_pretty_safe_and_consistent/gt435cj/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617369094.0
    },
    {
        "author": "kkInkr",
        "body": "There are bunch of chip companies, why just focus on AMD, NVDA, INTC, TSM.\n\nADI, AMAT, ASML, ATEYY, AVGO, KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI, QCOM, QRVO, SIMO, SWKS, TER.\n\nThere's also some small ones: Pixelworks, Himax.\n\nThere's also the design part: CDNS, SNPS.",
        "created_utc": 1617547643,
        "id": "gtcnpap",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtcnpap/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617576443.0
    },
    {
        "author": "chasing_losses",
        "body": "TER making a strong run back up",
        "created_utc": 1617895713,
        "id": "gttjas4",
        "permalink": "/r/wallstreetbets/comments/mmog6c/daily_discussion_thread_for_april_08_2021/gttjas4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617924513.0
    },
    {
        "author": "okay_thatworks",
        "body": "It's an interesting question. TER, GTI and TRUL were the only *ones out of the top 5 to close green today.",
        "created_utc": 1618436124,
        "id": "gujatjn",
        "permalink": "/r/weedstocks/comments/mqyoxy/after_hours_discussion_thread_april_14_2021/gujatjn/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1618464924.0
    },
    {
        "author": "Kbarbs4421",
        "body": "Interestingly, of the three...CCHW is the company I have the least confidence in atm.  They're a frankenstein amalgamation with a terrible execution track record and no big players backing them.  But that's just gut feel.  I follow my core, top tier positions much more closely than these smaller players.  All three of these are modest positions held for near term trade purposes.  I believe US fed policy reform is going to trigger a sector wide melt up.  And that an m&amp;a phase will randomly amplify the upside (briefly) for some of the mid tiers. Which is why I've spread a few chips around that craps table on AYR, VRNO, CCHW and TER.  I'm not married to them. Won't hold long.  But I'll definitely take a multi-bagger on one or more.\n\nI'll probably regret this gambling approach long term.  But my penchant for low cost entries protects me well.  Usually.",
        "created_utc": 1617863826,
        "id": "gts55q1",
        "permalink": "/r/weedstocks/comments/mgcgb3/daily_discussion_thread_march_30_2021/gts55q1/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1617892626.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 19th of April\n\n\n\n## Upcoming events for Monday, April 19th\n\n - Stock splits:\n\n    - BBD @ **110:100** (Payable date: 04/27/2021)\n    - BBDO @ **110:100** (Payable date: 04/27/2021)\n    - ILCV @ **2:1** (Payable date: 04/16/2021)\n    - ILCB @ **4:1** (Payable date: 04/16/2021)\n    - ILCG @ **5:1** (Payable date: 04/16/2021)\n    - IMCB @ **4:1** (Payable date: 04/16/2021)\n    - IMCG @ **6:1** (Payable date: 04/16/2021)\n    - IMCV @ **3:1** (Payable date: 04/16/2021)\n    - ISCB @ **4:1** (Payable date: 04/16/2021)\n    - ISCG @ **6:1** (Payable date: 04/16/2021)\n    - ISCV @ **3:1** (Payable date: 04/16/2021)\n    - MONOY @ **2:1** (Payable date: 04/16/2021)\n\n - Expected earnings:\n\n  ACC, ACU, BMRC, BSRR, CCK, CCNE, DIT, EBF, ELS, FNB, GNTY, HMNF, HXL, IBM, KO, LCNB, MCB, MSB, MTB, ONB, PEBK, PLD, PNFP, SFBS, STLD, UAL, WTFC, ZION\n\n - Ex-div:\n\n  ATCO, CIVB, CMRE, DMB, HRZN, IGR, THQ, THW, VCIF\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.020%)\n    - 6-Month Bill Auction (previous: 0.040%)\n    - Investing.com Gold Index (actual: 48.9%, previous: 56.4%)\n    - Investing.com S&amp;P 500 Index (actual: 39.6%, previous: 40.2%)\n\n## Upcoming events for Tuesday, April 20th\n\n - Stock splits:\n\n    - VONG @ **4:1** (Payable date: 04/19/2021)\n    - VONV @ **2:1** (Payable date: 04/19/2021)\n    - VTWO @ **2:1** (Payable date: 04/19/2021)\n\n - Expected earnings:\n\n  ABT, AN, ASRV, BFIN, BMI, CIT, CMA, CSX, CTG, DOV, EBSB, EDU, EQBK, EW, FCBP, FITB, FMBI, FOR, FULT, GATX, GRFS, HNP, HOG, HTLD, HWC, IBKR, IRDM, ISRG, JNJ, KEY, LMT, LRN, MAN, MBWM, MLI, MNSB, NCBS, NFLX, NTRS, OMC, ORRF, PACW, PCAR, PEBO, PFBC, PFC, PG, PKBK, PM, PTSI, PZN, SFNC, SI, SMBK, SMIT, SNV, TER, TFII, THC, TRV, UCBI, WBS, WRB, XRX\n\n - Ex-div:\n\n  CL, CLX, CMTL, EGBN, GBX, LEN, LEN.B, LOW, PCF, RMBI, SUNS, WST, ZTS\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.070%)\n    - API Weekly Crude Oil Stock (previous: -3.608M)\n    - Redbook (previous: -17.2%)\n    - Redbook (previous: 13.2%)\n\n## Upcoming events for Wednesday, April 21st\n\n - Expected earnings:\n\n  ANTM, ASML, BANR, BDN, BEDU, BKR, BLX, BOKF, BXS, CACI, CATC, CCI, CHDN, CLB, CMG, CNS, CP, CPSS, CVBF, CVCY, DFS, EFX, EGBN, ERIC, FCFS, FHN, FR, GGG, GL, GSBC, HAL, HBMD, HCSG, INBK, KMI, KNX, LAD, LOB, LRCX, LSTR, LVS, MMLP, NDAQ, NEE, NEP, NEU, NTGR, NWE, OFG, PLBC, PLXS, RCI, REXR, RHI, RLI, RUSHA, RUSHB, SEIC, SLG, SLM, SNBR, STC, STL, STRM, STXB, TBK, TCBI, TEL, TRST, TSC, UBFO, UFPI, UMPQ, UNB, USAP, VMI, VZ, WASH, WHR, XM\n\n - Ex-div:\n\n  AGX, APA, BGH, CFBK, DX, FUL, LTC\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.920%)\n    - Crude Oil Imports (previous: 0.443M)\n    - Crude Oil Inventories (previous: -5.889M)\n    - Cushing Crude Oil Inventories (previous: 0.346M)\n    - Distillate Fuel Production (previous: 0.004M)\n    - EIA Refinery Crude Runs  (previous: 0.007M)\n    - EIA Weekly Distillates Stocks (previous: -2.083M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.4%, previous: 1.0%)\n    - Gasoline Inventories (previous: 0.309M)\n    - Gasoline Production (previous: 0.336M)\n    - Heating Oil Stockpiles (previous: -0.028M)\n    - MBA 30-Year Mortgage Rate (previous: 3.27%)\n    - MBA Mortgage Applications (previous: -3.7%)\n    - MBA Purchase Index (previous: 279.5)\n    - Mortgage Market Index (previous: 667.7)\n    - Mortgage Refinance Index (previous: 2,916.7)\n\n## Upcoming events for Thursday, April 22nd\n\n - Expected earnings:\n\n  AAL, ABCB, ACBI, AEP, AFI, ALK, ALLE, AMAL, AMNB, ARCH, ARD, ARI, ASB, ASR, AUB, BANC, BIIB, BJRI, BKU, BMTC, BOOM, BPRN, BX, CADE, CAJ, CAMP, CASS, CCBG, CE, CFB, CFFI, CLF, CLFD, CS, CSL, CSTR, CTS, CVLY, CYBE, DGX, DHI, DHR, DOW, EIG, EWBC, FAF, FBIZ, FBRX, FCX, FE, FFBC, FFIN, FRME, FVCB, GBCI, GFED, GPC, GRC, GTLS, HBAN, HCA, HFWA, HRI, HTBK, HTH, HZO, ICBK, IIIN, INDB, INDT, INTC, IQV, ISTR, KB, KN, LUV, LYTS, MAT, MBIN, MCBC, MKTX, MNOV, MSBI, MYFW, NBHC, NUE, NURO, NVR, NWFL, ODFL, OPBK, ORI, OZK, PBCT, PDS, PINE, PNR, POOL, PSTV, PWOD, RBCAA, RBNC, RNGR, RS, SAFE, SAM, SAP, SASR, SBCF, SBFG, SBNY, SCKT, SITC, SIVB, SKX, SNA, SNAP, SON, SRCE, STBA, STRT, STX, T, TAL, TPH, TRN, TSCO, TZOO, UNP, USX, UTMD, VICR, VLO, VLRS, VRSN, VVV, WNS, WSFS, WSO, WSO.B, WST, WWE\n\n - Ex-div:\n\n  ACP, AGD, AOD, ASGI, AWP, BGB, BGX, BSAC, BSL, BUSE, BWG, COKE, CVS, DEX, DFP, DMO, EFF, EFR, EFT, EHI, EMD, EOI, EOS, EOT, ETB, ETG, ETJ, ETO, ETV, ETW, ETX, ETY, EVG, EVT, EXD, EXG, FFC, FLC, FMN, GAIN, GDO, GLAD, GOOD, HFRO, HGLB, HIE, HIO, HIX, HYI, IGI, KALU, LAND, LKFN, MGU, MMU, NHF, NVT, PFD, PG, PNR, PPT, SBI, SCD, SM, TPZ, USA, WEA, WIA, WIW, WSM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.010%)\n    - 5-Year TIPS Auction (previous: -1.320%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Chicago Fed National Activity (previous: -1.09)\n    - Continuing Jobless Claims (consensus: 3,667K, previous: 3,731K)\n    - Existing Home Sales (consensus: 0.8%, previous: -6.6%)\n    - Existing Home Sales (consensus: 6.19M, previous: 6.22M)\n    - Initial Jobless Claims (consensus: 617K, previous: 576K)\n    - Jobless Claims 4-Week Avg. (previous: 683.00K)\n    - KC Fed Composite Index (previous: 26)\n    - KC Fed Manufacturing Index (previous: 23)\n    - Natural Gas Storage (previous: 61B)\n    - US Leading Index (consensus: 1.0%, previous: 0.2%)\n\n^^^^2021-04-19",
        "created_utc": 1618826420,
        "id": "gv2cdwb",
        "permalink": "/r/RobinHood/comments/mtxal5/daily_discussion_thread_april_19th_2021/gv2cdwb/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1618855220.0
    },
    {
        "author": "thatleeroy",
        "body": "Yup the entire industry should benefit from increased demand. This ETF also captures those that supply to the chip makers. \n\nIf I were to have to pick individual stocks, I'd go with Lam, ASML, or Teradyne over any chip maker.",
        "created_utc": 1617394375,
        "id": "gt6byif",
        "permalink": "/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/gt6byif/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617423175.0
    },
    {
        "author": "wet_tree",
        "body": "TER ?",
        "created_utc": 1617741155,
        "id": "gtm0xeq",
        "permalink": "/r/weedstocks/comments/mlkbpn/after_hours_discussion_thread_april_06_2021/gtm0xeq/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1617769955.0
    },
    {
        "author": "wet_tree",
        "body": "Cgc is literally lobbying in the us and has positions in acrg, ter, and possibly slang in the distant future.\n\nCanopy will benefit.",
        "created_utc": 1617813781,
        "id": "gtpf3s2",
        "permalink": "/r/weedstocks/comments/mlypzk/daily_discussion_thread_april_07_2021/gtpf3s2/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1617842581.0
    },
    {
        "author": "snark42",
        "body": "I have it with TerrAscend head to head going into the close, momentum suggests it will be TER by a nose.",
        "created_utc": 1617738937,
        "id": "gtlvthz",
        "permalink": "/r/weedstocks/comments/ml86b8/daily_discussion_thread_april_06_2021/gtlvthz/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1617767737.0
    },
    {
        "author": "pilkyboy1",
        "body": "Great picks. What's your thesis for Teradyne?",
        "created_utc": 1617995456,
        "id": "gtype1e",
        "permalink": "/r/stocks/comments/lv5dlb/rate_my_portfolio_rstocks_quarterly_thread_march/gtype1e/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618024256.0
    },
    {
        "author": "PocketAces93",
        "body": "TER with another random run",
        "created_utc": 1618430068,
        "id": "guix87z",
        "permalink": "/r/weedstocks/comments/mqndpk/daily_discussion_thread_april_14_2021/guix87z/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1618458868.0
    },
    {
        "author": "your_fav_ant",
        "body": "Why are stork market returns so low?\n\nThere are usually fewer than 10 funds at play\nand while the TER is 0, babies have a very high MER.",
        "created_utc": 1618807762,
        "id": "gv1qr28",
        "permalink": "/r/CanadianInvestor/comments/mtigkc/overnight_discussion_thread_to_kick_off_the_week/gv1qr28/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1618836562.0
    },
    {
        "author": "kkInkr",
        "body": "ZTS, CDNS, SNPS, ANSS, TER",
        "created_utc": 1618724286,
        "id": "guxwrsz",
        "permalink": "/r/stocks/comments/msqx2g/5_stock_picks_for_the_next_5_years/guxwrsz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618753086.0
    },
    {
        "author": "7Samat",
        "body": "I have had a good run lately with Teradyne (TER).",
        "created_utc": 1618656742,
        "id": "guty1tm",
        "permalink": "/r/stocks/comments/msl1js/alternative_semiconductor_stocks/guty1tm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618685542.0
    },
    {
        "author": "SnooObjections2665",
        "body": "Following the trend in the fourth industrial revolution:\n1. CrowdStrike (cyber security)\n2. Cloudflare (cloud computing)\n3. Palantir (big data / data analytics)\n4. Teradyne (advanced robotics / automation)\n5. Desktop Metal (3D printing)",
        "created_utc": 1618679709,
        "id": "guvjnt8",
        "permalink": "/r/stocks/comments/msqx2g/5_stock_picks_for_the_next_5_years/guvjnt8/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1618708509.0
    }
]