[
    {
        "author": "MasterCookSwag",
        "body": "There needs to be a strong differentiation between cost push inflation and monetary driven inflation.  You're seeing prices in very specific parts of the economy spike due to cost constraints - almost all of it tied to microchip shortages which will definitely subside.\n\nThis is where many commenters are missing the mark, the Fed conducts monetary policy based on the dollars in circulation being appropriate for the transactions of an economy - what that means is they'd tighten if they felt like there was broad inflation due to an over supply of dollars.  There's not, there's actually pretty muted inflation in most of the economy - if you back out used cars and account for base effects then inflation is actually still on a sustained sub 2% trend.  \n\nSo while you're correct that psychological impacts of price shifts can manifest in additional price shifts the actuality of the situation is that there simply isn't any real shift in prices across the board.  There's some very localized spiking in certain materials, which we're already seeing fall, and there's used cars throwing a massive wrench in to the CPI report, but outside of that the rolling 3 month average of almost every other part of the economy is well under target.  The YOY figures are only heightened due to the prior year's base effects.  \n\nBasically - when you see someone going on about inflation being an issue that's mostly just a sign that they didn't dive in to the CPI report beyond the headline figure.",
        "created_utc": 1623340441,
        "id": "h1ak65c",
        "score": 57,
        "subreddit": "investing",
        "created": 1623369241.0
    },
    {
        "author": "aquaticsardonic",
        "body": "Recently got a new job that doesn't require me to wear a mask cause I got the 5G Microchip shots and I gotta say after wearing the fuckin thing for a year and a half I feel naked every day I walk in without one. Reach up and scratch my bare nose and feel like my dick popped out or something.\n\nAlso BB 21 EOW.",
        "created_utc": 1622923547,
        "id": "h0pyw9e",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1622952347.0
    },
    {
        "author": "aqualatte",
        "body": "He’s got one hell of a PR team, the B&amp;M Gates foundation gives a boatload of money to media companies. Also there are people with brain worms who think he put a microchip in the vaccine, obfuscating the legit things to despise him for. They prob assumed u had brain worms",
        "created_utc": 1624914396,
        "id": "h3d6hqh",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1624943196.0
    },
    {
        "author": "yolosbeforehos",
        "body": "Did you get your 5g microchip vaccine yet? Or are you too afraid to leave your nuclear bunker without your tinfoil hat?",
        "created_utc": 1623988539,
        "id": "h267z6q",
        "score": 3,
        "subreddit": "stocks",
        "created": 1624017339.0
    },
    {
        "author": "KeithBucci",
        "body": "Being so close to Mexico is good for sourcing parts. Also, all the new microchip plants in AZ will draw in more engineering talent to the area.",
        "created_utc": 1622630197,
        "id": "h0ark2a",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1622658997.0
    },
    {
        "author": "IAmVeryStupid",
        "body": "Solar stocks aren't suffering because of anti-solar bills, they're eating shit because of the microchip shortage. We won't see any traction on that until 2022 minimum. If you want to buy calls, at least make them LEAPS",
        "created_utc": 1622860440,
        "id": "h0n60fn",
        "score": 2,
        "subreddit": "stocks",
        "created": 1622889240.0
    },
    {
        "author": "Ordinary-Broccoli-41",
        "body": "Apple has to deal with microchip shortage",
        "created_utc": 1623382043,
        "id": "h1d1wo7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623410843.0
    },
    {
        "author": "Ordinary-Broccoli-41",
        "body": "Market might. You've probably seen more and more people talking about the microchip shortage lately. Looking forward to seeing everyone pile in.",
        "created_utc": 1623333674,
        "id": "h1a450j",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623362474.0
    },
    {
        "author": "ShkTrp63",
        "body": "I’m in long on intel due to their foundries, American desire to improve infrastructure which includes our microchip factories, and their current work to build additional foundries in the US. Once those are finally priced in we will see some mad tendies\n\nAlso, I might be wrong but AMD doesn’t produce their own microchips. They’re produced in Taiwan.",
        "created_utc": 1624737996,
        "id": "h351og7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624766796.0
    },
    {
        "author": "pizzatacotruck69",
        "body": "Microchip and camera dude, why u think we have a chip shortage",
        "created_utc": 1622764092,
        "id": "h0i56yj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622792892.0
    },
    {
        "author": "Step-Serious",
        "body": "For that timeframe take a look at $F, which is undergoing a process of “rerating”. Basically the market is moving $F to a higher P/E multiple. Downside risks such as the microchip shortage are receding. $F is where I have my big bet right now (I don’t have the balls to do YOLO trades on the meme stocks).",
        "created_utc": 1623102451,
        "id": "h0ykexi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623131251.0
    },
    {
        "author": "Professor_Chaos42",
        "body": "So, there's some confusion around this. They didn't get the initial contract, this much is true. However, Oshkosh will only make 10% of the vehicles electric that are made for the contract which is against what the directives for the contract should have been and now that's being called into question, as well as USPS is trying to add additional contracts to electrify. So, panic, overreaction, and some good-ish news. Production hasn't been impressive, but they're picking up, they got hit by the microchip device shortage and being a small-ish company it was a bit hard, but that's picking back up too. So, I think the drop was probably an overreaction, that's when  I bought, I like overreaction plays, they tend to be more consistent, but looking at the volume and percentage of the float shorted... I'm hopeful.",
        "created_utc": 1623174681,
        "id": "h11yzaz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623203481.0
    },
    {
        "author": "McDuchess",
        "body": "WHSE back on the rise after yesterday’s dip. But honestly, I expect it to float around 15 till they get their capacity up to demand. (Come ON, microchip manufacturers!) Then to the MOOOON.",
        "created_utc": 1624024604,
        "id": "h27ksn7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624053404.0
    },
    {
        "author": "gintdm",
        "body": "CELH PLTR  AMZN DIS MCHP AMD",
        "created_utc": 1623675033,
        "id": "h1q4cnm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623703833.0
    },
    {
        "author": "aboutanythingyouwant",
        "body": "I'm watching fat girl and midget porn they wasted their microchip on me.",
        "created_utc": 1622868787,
        "id": "h0njyy6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622897587.0
    },
    {
        "author": "Freekeh",
        "body": "Ford’s microchip factory which is out of the country just went up in flames so I prob wouldn’t count on it",
        "created_utc": 1623339570,
        "id": "h1ai10g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623368370.0
    },
    {
        "author": "Professor_Chaos42",
        "body": "I mean, the whole directive was to electrify the fleet, so... that's not electrifying the fleet if only 10% are electric. And while the contract might not be overturned, there's talk of increasing USPS funding to add more electric. The challenge was covered a week ago by the Cleveland OH news, it's got a paywall on the article. But the hype, sell the news. And again, I think that it's important to mention that nobody really discussed the problem with manufacturing EV's during the microchip device shortage, that was a big point of attack, they have other contracts, but to not address it seems foolhardy to me. Auto manufacturers really struggled to meet demand, so we saw some interesting goings-on in the auto manufacturing sector, with bigger repercussions for EV makers. So, now that we're kind of getting around to sorting that bit out, using manufacturing data from this quarter to project future growth would be incorrect.",
        "created_utc": 1623269163,
        "id": "h171k0y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623297963.0
    },
    {
        "author": "McDuchess",
        "body": "Honestly, I don’t expect much movement one direction or another on WKHS until the microchip issue is behind us. All vehicle manufacturers are having challenges meeting their needs for them. \n\nThen. TTM! 🚀",
        "created_utc": 1624370704,
        "id": "h2niapr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624399504.0
    },
    {
        "author": "ShkTrp63",
        "body": "Yeah, immediately after posting that comment I watched a video from Bloomberg that goes into the details of the microchip industry and current shortage… intel is essentially the only company with foundries in the US.\nCurrently doing some personal DD to see if I’m gonna increase my position lol",
        "created_utc": 1624746673,
        "id": "h35i4v0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624775473.0
    },
    {
        "author": "AceBullApe",
        "body": "microchip dips are buys \n\nrotation to tech is now",
        "created_utc": 1623940978,
        "id": "h23ehui",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623969778.0
    },
    {
        "author": "Professor_Chaos42",
        "body": "Yes, it turns out 8 trucks in a quarter for an EV company in a microchip device shortage and a supply chain shortage is actually pretty decent. Remember, the market is anticipatory, so they’re looking at all the factory infrastructure that was built during the low production phase of this kind of company, not just one quarter of production in the middle of all that and a bag of potato chips.",
        "created_utc": 1625026547,
        "id": "h3iw4je",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625055347.0
    },
    {
        "author": "Paul_Ostert",
        "body": "I love technology and one technology I had been reading about and getting excited about was DNA enhancements using CRISPR.  I did some research and bought into BEAM, EDIT, and NTLA.  I thought those companies would give me enough exposure into that technology.  I have been dollar cost averaging the last 6 months and was delighted at the recent news. \n\nHowever,  I'm not selling. I bought into this for a 10 to 20 year play.  By that time this technology will be more mature and I hope that I bought into at least one company that would benefit. It's like being able to invest in TI and Intel right after the integrated circuit  microchip was invented.",
        "created_utc": 1625076375,
        "id": "h3l5hcw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625105175.0
    },
    {
        "author": "RavenousFox1985",
        "body": "I actually looked at LGND yesterday and it was one of the promising companies I found. I noticed alot of the PDUFAs on schedule are for pretty uncommon conditions. I can definitely see where the component product line of LGND makes it a good investment. Kind of like I had investments in UCTT which manufacturers products for the microchip industry instead of investing in INTC or NVDA, but after the whole chip shortage thing doesn't seem to be getting better for awhile. I decided that shifting my money into other sectors might be a good play. I had actually thought investing in UCTT would be a good idea since they would benefit from manufacturers needing to expand, but that didn't seem to be working out.",
        "created_utc": 1624725717,
        "id": "h34de8l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624754517.0
    },
    {
        "author": "Professor_Chaos42",
        "body": "That’s what the short report said, but they neglected to mention that Lois DeJoy’s choice to award the USPS contract to Oshkosh probably wasn’t on the up-and-up and forgot to include that a microchip device shortage might be problematic for, you know, an EV company.",
        "created_utc": 1623265744,
        "id": "h16t2jy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623294544.0
    },
    {
        "author": "Ordinary-Broccoli-41",
        "body": "Ford is great, if you like being edged out of the market because of the microchip shortage and watching them utterly fail in the EV market",
        "created_utc": 1623208949,
        "id": "h13zq0y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623237749.0
    },
    {
        "author": "SuperPwnerGuy",
        "body": "TIL a silicone microchip and copper shortage (that's getting worse) is bullish.",
        "created_utc": 1624268293,
        "id": "h2ir2rd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624297093.0
    },
    {
        "author": "McDuchess",
        "body": "Me, I’m good holding my whopping 150 shares. ETA: all vehicle manufacturers are feeling the microchip crunch.",
        "created_utc": 1624024793,
        "id": "h27l6s9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624053593.0
    },
    {
        "author": "TheBFG420",
        "body": "I'll bet you're unvaccinated because of the microchip",
        "created_utc": 1624663267,
        "id": "h31uha3",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1624692067.0
    },
    {
        "author": "oarabbus",
        "body": "Let me get this straight, you think a razor-thin margin industry like retail consumer hardware for gaming (we are not talking about an actual microchip moneymaker like CPUs/GPUs here........) is going to result in CRSR being valued **more** than the current $3.3 billion valuation? based on what? because they are selling PSUs and computer mice?\n\nCRSR isn't even the best play in the peripheral/accessory space, most gamers are casual gamers and Logitech owns that market anyway.",
        "created_utc": 1623802699,
        "id": "h1wu5eb",
        "score": -4,
        "subreddit": "stocks",
        "created": 1623831499.0
    }
]