[
    {
        "author": "_never_more",
        "body": "Usually companies I feel can be successful because I like the product they have and see huge growth opportunities. The Lynch approach to a certain extent. I knew Fortinet when they went public from personal experience and knew they had a superb product and a really good corporate structure. So I bought at IPO and hung on. \n\nCompanies like Amazon and Netflix I used personally and saw their potential for almost infinite growth. With companies like  that people are always scared by the valuation.  So buy a little and look to add if the price goes down. A lot of times it never does and just keeps going. The key is to find these companies early on when they have a lot of potential runway left.",
        "created_utc": 1618454174,
        "id": "guk9vc5",
        "permalink": "/r/ValueInvesting/comments/mr0w6s/exactly_how_far_above_intrinsic_value_are_you/guk9vc5/",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1618482974.0
    },
    {
        "author": "aka_michael_collins",
        "body": "Dark horse of the year...Fortinet (FTNT). Another beat and raise.",
        "created_utc": 1619731747,
        "id": "gwcjxyt",
        "permalink": "/r/wallstreetbets/comments/n1ct7r/what_are_your_moves_tomorrow_april_30_2021/gwcjxyt/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619760547.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the 29th of April\n\n\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARD, ARES, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLMN, BMRN, BMY, BPMC, BSIG, BSVN, BTU, BVN, BWB, BY, BZH, CACC, CAI, CARR, CASA, CAT, CBRE, CBZ, CCOI, CCXI, CFFN, CFR, CFX, CG, CGNT, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COR, COWN, CPLP, CPSH, CPT, CQP, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DRQ, DVA, DVD, DXCM, EBC, EBS, ECOL, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, EQNR, ERIE, ERII, ERJ, ETH, EVBN, EVLO, EVTC, EXLS, EXPO, FBHS, FBIZ, FBRX, FCN, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FTAI, FTNT, FTV, FWRD, GFF, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GOL, GPI, GRA, GSHD, GWB, HAYN, HGV, HP, HSY, HTGC, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INDT, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBPS, LEVL, LFVN, LH, LIND, LKQ, LLNW, LMAT, LPLA, LTC, LTRX, LYG, MA, MATW, MBIN, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MNOV, MO, MPW, MRK, MRLN, MSTR, MTLS, MTRN, MTSI, MVIS, NATI, NDLS, NEM, NEXA, NIO, NMM, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, NWG, OCFC, OFC, OMCL, ONEW, ONTO, OPI, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCG, PCSB, PEB, PH, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RCL, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SAND, SCX, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SNDR, SNP, SO, SPGI, SPSC, SRCL, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TOT, TPX, TREE, TROW, TRS, TRTN, TRUP, TUSK, TW, TWTR, TXRH, TXT, ULBI, ULH, USAK, USM, VC, VCRA, VICI, VIRC, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PLBC, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SLG, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - FOMC Member Quarles Speaks\n    - FOMC Member Williams Speaks\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 11B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 5.0%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n## Upcoming events for Friday, April 30th\n\n - Expected earnings:\n\n  ABBV, AON, AROC, ASIX, AVNT, AZN, B, BCPC, BCS, BRID, BSAC, CBOE, CCLP, CHTR, CL, CLX, CRI, CVEO, CVX, CWBC, DCOM, E, EEX, ESXB, FSBW, GT, GWW, HRC, HUN, IESC, IMO, IRMD, ITCB, ITW, JCI, JELD, LAZ, LFC, LHX, LSBK, LYB, MGP, MOG.A, MOG.B, NWHM, NWL, OFIX, OIIM, PBI, PFS, PIPR, PNM, POR, PSX, PSXP, QSR, SBFG, SHLX, SLCA, SPCB, TWIN, WETF, WPC, WY, XOM\n\n - Ex-div:\n\n  AON, ASRV, BX, C, CARR, CASY, CBAN, CLB, CMCO, CNBKA, CPLP, CZNC, DGICA, DGICB, DMLP, ELP, EVTC, EWBC, FAT, HAS, HEP, HESM, HFBL, KOF, KRP, LCUT, LYTS, MCI, NRG, NSEC, O, OHI, ORRF, PBCT, PEBO, PNW, SBNY, SBS, SGU, SPFI, SXT, SYF, TKC, TXN, WABC\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.4K)\n    - CFTC Copper speculative net positions (previous: 42.9K)\n    - CFTC Corn speculative net positions (previous: 522.7K)\n    - CFTC Crude Oil speculative net positions (previous: 500.0K)\n    - CFTC Gold speculative net positions (previous: 181.5K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.1K)\n    - CFTC Natural Gas speculative net positions (previous: -50.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -52.2K)\n    - CFTC Silver speculative net positions (previous: 41.7K)\n    - CFTC Soybeans speculative net positions (previous: 243.2K)\n    - CFTC Wheat speculative net positions (previous: 21.0K)\n    - Chicago PMI (consensus: 65.3, previous: 66.3)\n    - Core PCE Price Index (consensus: 0.3%, previous: 0.1%)\n    - Core PCE Price Index (consensus: 1.8%, previous: 1.4%)\n    - Dallas Fed PCE (previous: 1.80%)\n    - Employment Benefits (previous: 0.60%)\n    - Employment Cost Index (consensus: 0.7%, previous: 0.7%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.70%)\n    - Michigan Consumer Expectations (previous: 79.7)\n    - Michigan Consumer Sentiment (consensus: 87.4, previous: 86.5)\n    - Michigan Current Conditions (previous: 97.2)\n    - Michigan Inflation Expectations (previous: 3.7%)\n    - PCE Price index (previous: 1.6)\n    - PCE price index (previous: 0.2%)\n    - Personal Income (consensus: 20.3%, previous: -7.1%)\n    - Personal Spending (consensus: 4.1%, previous: -1.0%)\n    - Real Personal Consumption (previous: -1.2%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 344)\n    - U.S. Baker Hughes Total Rig Count (previous: 439)\n\n^^^^2021-04-29",
        "created_utc": 1619690422,
        "id": "gwa20lp",
        "permalink": "/r/RobinHood/comments/n11315/daily_discussion_thread_april_29th_2021/gwa20lp/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1619719222.0
    },
    {
        "author": "aka_michael_collins",
        "body": "QQQJ is going be an interesting one over the year. Regardless of your view on the future correlation being yields and tech/growth, QQQJ actually has a strong and increasing proportion (by market cap) of recovery stocks. With VIAC’s crash, ODFL is the fourth largest holding. GRMN and EXPE are up there too. Biggest risk is from ROKU, CRWD and TTD, but there’s an argument to made that FTNT, ZBRA and even ETSY are actually well positioned for recovery as far as tech stocks go. We will see, should be interesting!",
        "created_utc": 1617392240,
        "id": "gt67pxo",
        "permalink": "/r/stocks/comments/migse3/rstocks_daily_discussion_fundamentals_friday_apr/gt67pxo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617421040.0
    },
    {
        "author": "Good_Luck_Q_Q",
        "body": "APPL 4.5%\n\nAMD 1.8%\n\nAMZN 11.2%\n\nBLK 1.2%\n\nBRK 4.4%\n\nCOIN 0.7%\n\nCRM 1.1%\n\nCRSP 1.2%\n\nCRWD 0.9%\n\nCVAC 0.6%\n\nENPH 1.2%\n\nFTNT 2.1%\n\nHD 2.6%\n\nJPM 2.6%\n\nLEN 0.9%\n\nLGIH 1.8%\n\nLMND 0.6%\n\nMSFT 3.0%\n\nNEE 0.3%\n\nNVDA 1.3%\n\nNVTA 0.8%\n\nPACB 0.6%\n\nPG 1.1%\n\nPLTR 0.5%\n\nPTON 1.4%\n\nPYPL 1.2%\n\nRDFN 1.0%\n\nRIOT 1.2%\n\nSEDG 0.5%\n\nSQ 2.2%\n\nTDOC 1.6%\n\nTSLA 26.8%\n\nTSM 1.3%\n\nTTD 3.0%\n\nTWLO 1.7%\n\nUNH 3.1%\n\nW 1.3%\n\nWM 1.5%\n\nZ 0.9%",
        "created_utc": 1618804570,
        "id": "gv1m35r",
        "permalink": "/r/stocks/comments/lv5dlb/rate_my_portfolio_rstocks_quarterly_thread_march/gv1m35r/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618833370.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 27th of April\n\n\n\n## Upcoming events for Tuesday, April 27th\n\n - Stock splits:\n\n    - NSPR @ **1:15**\n\n - Expected earnings:\n\n  AAN, AAT, ABB, ABG, ACCO, ACGL, ACH, ADM, AHC, AJRD, AMD, AMGN, AMX, APAM, ARAY, ARVN, ATEN, ATNI, ATRC, AUDC, AWI, AWRE, BP, BSBR, BUSE, BXP, BYD, CAC, CALX, CASH, CB, CEQP, CHE, CHRW, CNC, COF, CROX, CRSP, CSGP, CYBE, CZWI, DTE, EBMT, ECL, EGP, EHC, EIX, ENPH, ENTG, EQR, ESBK, ESS, FBNC, FCBP, FCF, FCPT, FELE, FEYE, FFIC, FFIV, FFNW, FFWM, FIBK, FISV, FRST, FSV, FTI, GE, GLW, GOOD, GOOG, GOOGL, GPK, GRFS, HA, HAFC, HAS, HBCP, HEES, HFBL, HIW, HNP, HOPE, HRZN, HSBC, HUBB, HVT, HVT.A, IBA, IBCP, IEX, ILMN, IVZ, JBLU, JNPR, KNSA, KTCC, LBC, LBRT, LDL, LECO, LLY, MANH, MATX, MDLZ, MMC, MMM, MRC, MSCI, MSFT, MVBF, MXIM, NAVI, NCR, NOV, NVS, NXRT, ODT, OKE, OLN, OMAB, OPRA, OXSQ, PCAR, PFG, PHM, PII, PINS, PJT, PPBI, PPD, PROV, PSB, QCRH, QTS, RCKY, RNDB, RNST, ROIC, ROP, RRD, RTX, RXN, SAN, SBUX, SCL, SF, SFST, SHW, SPFI, SQNS, SSTK, ST, SYF, SYK, SYX, TENB, TER, TFII, TKC, TPB, TRMK, TRMT, TRU, TSBK, TX, TXN, UBS, UDR, UMBF, UPS, USNA, V, VALE, VBTX, VIST, WDR, WM, WNEB, WSBC, WSBF, YUMC\n\n - Ex-div:\n\n  AM, ATR, BK, CALM, ENTG, IFS, QADA, QADB, VSEC\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 1.300%)\n    - API Weekly Crude Oil Stock (previous: 0.436M)\n    - CB Consumer Confidence (consensus: 113.0, previous: 109.7)\n    - Dallas Fed Services Revenues (previous: 21.6)\n    - House Price Index (previous: 1.0%)\n    - House Price Index (previous: 12.0%)\n    - House Price Index (previous: 316.7)\n    - Redbook (previous: -17.2%)\n    - Redbook (previous: 13.5%)\n    - Richmond Manufacturing Index (previous: 17)\n    - Richmond Manufacturing Shipments (previous: 22)\n    - Richmond Services Index (previous: 16)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 11.7%, previous: 11.1%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.1%, previous: 1.2%)\n    - Texas Services Sector Outlook (previous: 28.9)\n\n## Upcoming events for Wednesday, April 28th\n\n - Expected earnings:\n\n  AAPL, ADP, AER, AFL, AGI, AKO.A, AKO.B, AKR, ALGN, ALIM, ALKS, ALRS, ALSN, ALTA, AM, AMED, APH, APLS, AR, ARCC, ASGN, ASH, ATOM, ATUS, AUY, AVB, AVT, AVTR, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BHE, BHLB, BLKB, BPOP, BRKL, BSMX, BSX, BXMT, CAKE, CAMT, CBTX, CCS, CDE, CHEF, CHX, CINF, CIT, CLR, CME, CMO, CNMD, CNO, CONE, CPF, CPSS, CREE, CSTM, CUBI, CYH, DAN, DISCA, DISCB, DISCK, DMRC, DRE, DRVN, DX, EAT, EBAY, ECHO, EQIX, ESI, ESRT, ETR, EVA, EVR, EXR, EXTR, F, FARO, FB, FCNCA, FISI, FIX, FORM, GD, GIB, GRMN, GRUB, GSK, GTY, HBNC, HELE, HES, HESM, HNI, HOLX, HT, HUM, IART, ICAD, ICLR, INOV, INVH, IPG, IR, IRT, ISBC, JAKK, JBSS, KALU, KNL, KRA, KRC, LC, LFUS, LIVN, LOGI, LXU, MAA, MAS, MC, MCO, MCRI, MDXG, MEOH, MGM, MGRC, MHH, MHO, MKL, MLCO, MLP, MN, MOH, MORN, MPX, MSA, MSC, MSVB, MTDR, MTH, MUSA, MXL, MYRG, NBR, NGVT, NLY, NOA, NOVA, NOW, NSC, NTB, NYCB, OBNK, OC, OI, OII, OIS, OPK, ORLY, ORN, OSK, OVV, PAG, PB, PDM, PEGA, PGRE, PI, PPC, PSA, PTC, QCOM, R, RBBN, RE, RES, RJF, RNR, ROK, ROL, RWT, SAIA, SC, SGC, SHOO, SHOP, SIGI, SIRI, SIX, SJW, SLAB, SLGN, SMED, SNY, SONY, SP, SPOK, SPOT, SRDX, SREV, SRI, SSB, SWK, SXC, TDOC, TDY, TECK, TEVA, TKR, TNL, TR, TROX, TTEK, TTMI, TWOU, TYL, UCTT, UFI, UMC, URI, UVE, UVSP, VET, VKTX, VNE, VRT, VRTS, VSEC, VVV, WCN, WELL, WERN, WH, WHG, WING, WNC, WRE, WWW, YNDX, YUM\n\n - Ex-div:\n\n  BPMP, BSRR, CFG, FRC, ITUB, KEN, KNOP, MAIN\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.416M)\n    - Crude Oil Inventories (consensus: 0.375M, previous: 0.594M)\n    - Cushing Crude Oil Inventories (previous: -1.318M)\n    - Distillate Fuel Production (previous: -0.088M)\n    - EIA Refinery Crude Runs  (previous: -0.286M)\n    - EIA Weekly Distillates Stocks (consensus: -0.163M, previous: -1.074M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 1.0%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision\n    - Gasoline Inventories (consensus: 0.425M, previous: 0.086M)\n    - Gasoline Production (previous: -0.229M)\n    - Goods Trade Balance (previous: -87.07B)\n    - Heating Oil Stockpiles (previous: 0.563M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 8.6%)\n    - MBA Purchase Index (previous: 295.5)\n    - Mortgage Market Index (previous: 724.8)\n    - Mortgage Refinance Index (previous: 3,219.9)\n    - Retail Inventories Ex Auto (previous: 1.2%)\n    - Wholesale Inventories (previous: 0.6%)\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARES, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLMN, BMRN, BMY, BPMC, BSIG, BSVN, BTU, BVN, BWB, BY, BZH, CARR, CASA, CAT, CBRE, CBZ, CCOI, CCXI, CFFN, CFR, CFX, CG, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COR, COWN, CPT, CQP, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CURO, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DRQ, DVA, DVD, DXCM, EBC, EBS, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, ERIE, ERII, ERJ, ETH, EVBN, EVLO, EVTC, EXLS, EXPO, FBC, FBHS, FCN, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FSP, FTAI, FTNT, FTV, FWRD, GEO, GFF, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GPI, GRA, GSHD, GWB, HAYN, HGV, HP, HSY, HTGC, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INDT, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBAI, LBPS, LEVL, LFVN, LH, LIND, LKQ, LLNW, LMAT, LPLA, LTC, LTRX, LYG, MA, MATW, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MO, MPW, MRK, MRLN, MSTR, MTLS, MTRN, MTSI, MVIS, NATI, NDLS, NEM, NIO, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, OCFC, OFC, OMCL, ONEW, ONTO, OPI, OPOF, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCG, PCSB, PEB, PFPT, PH, PMBC, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RCL, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SAND, SCX, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SNDR, SNP, SO, SPGI, SPSC, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TPX, TREE, TROW, TRS, TRTN, TRUP, TW, TWTR, TXRH, TXT, ULBI, ULH, USAK, USM, VC, VCRA, VICI, VIRC, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PLBC, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SLG, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 49B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 4.7%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n^^^^2021-04-27",
        "created_utc": 1619517616,
        "id": "gw17s1h",
        "permalink": "/r/RobinHood/comments/mzl03y/daily_discussion_thread_april_27th_2021/gw17s1h/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619546416.0
    },
    {
        "author": "Scratchelor",
        "body": "My long plays are CAT MSFT QS FTNT COST PINS. Would recommend all of them because I'm in them!",
        "created_utc": 1617537890,
        "id": "gtc8vv2",
        "permalink": "/r/stocks/comments/mjrul6/long_term_stocks/gtc8vv2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617566690.0
    },
    {
        "author": "RoaringRocketKat",
        "body": "I have used AutoCAD in the 90s and it's still used in construction.\n\nThe world is larger than the US, in most countries the choice is between AutoCAD and some locally produced legacy CAD software like made by the catholic school network.\n\nThere isn't much room for expansion and the competition tries to get a slice of that.\n\nThey only have to look at Cisco for inspiration: training courses and certifications.\n\nCisco network devices used to be the standard choice and nowadays there are plenty well established competitors. Their firewalls were ditched because of a NSA backdoor and Fortinet is nowadays the popular choice. No one uses Cisco WiFi, don't choose a course on that.\n\nIf you wonder how Cisco is still relevant, it's because everyone is still using/recognizing their training courses and certifications.\n\nThe education solution isn't just a way to expand, it can be the most important thing for long term survival.",
        "created_utc": 1617579540,
        "id": "gtechnj",
        "permalink": "/r/wallstreetbets/comments/mjcpfw/understanding_the_infrastructure_bill_the_federal/gtechnj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617608340.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 28th of April\n\n\n\n## Upcoming events for Wednesday, April 28th\n\n - Expected earnings:\n\n  AAPL, ADP, AER, AFL, AGI, AKO.A, AKO.B, AKR, ALGN, ALIM, ALKS, ALRS, ALSN, ALTA, AM, AMED, APH, APLS, AR, ARCC, ASGN, ASH, ATOM, ATUS, AUY, AVB, AVT, AVTR, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BHE, BHLB, BLKB, BPOP, BRKL, BSMX, BSX, BXMT, CAKE, CAMT, CBTX, CCS, CDE, CHEF, CHX, CINF, CIT, CLR, CME, CMO, CNMD, CNO, CONE, CPF, CPSS, CREE, CSTM, CUBI, CYH, DAN, DISCA, DISCB, DISCK, DMRC, DRE, DRVN, DX, EAT, EBAY, ECHO, EQIX, ESI, ESRT, ETR, EVA, EVR, EXR, EXTR, F, FARO, FB, FCNCA, FISI, FIX, FORM, GD, GIB, GRMN, GRUB, GSK, GTY, HBNC, HELE, HES, HESM, HNI, HOLX, HT, HUM, IART, ICAD, ICLR, INOV, INVH, IPG, IR, IRT, ISBC, JAKK, JBSS, JOE, KALU, KNL, KRA, KRC, LC, LFUS, LIVN, LOGI, LXU, MAA, MAS, MC, MCO, MCRI, MDXG, MEOH, MGM, MGRC, MHH, MHO, MKL, MLCO, MLP, MN, MOH, MORN, MPX, MSA, MSC, MTDR, MTH, MUSA, MXL, MYRG, NBR, NGVT, NLY, NOA, NOVA, NOW, NSC, NTB, OBNK, OC, OI, OII, OIS, OPK, ORLY, ORN, OSK, OVV, PAG, PB, PDM, PEGA, PGRE, PI, PPC, PSA, PTC, QCOM, R, RBBN, RE, RES, RJF, RNR, ROK, ROL, RWT, SAIA, SC, SGC, SHOO, SHOP, SIGI, SIRI, SIX, SJW, SLAB, SLGN, SMED, SNY, SONY, SP, SPOK, SPOT, SRDX, SREV, SRI, SSB, SWK, SXC, TDOC, TDY, TECK, TEVA, TKR, TNL, TR, TROX, TTEK, TTMI, TWOU, TYL, UCTT, UFI, UMC, URI, UVE, UVSP, VET, VKTX, VNE, VRT, VRTS, VSEC, VVV, WCN, WELL, WERN, WH, WHG, WING, WNC, WRE, WWW, YNDX, YUM\n\n - Ex-div:\n\n  BPMP, BSRR, CFG, FRC, ITUB, KEN, KNOP, MAIN\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.416M)\n    - Crude Oil Inventories (consensus: 0.659M, previous: 0.594M)\n    - Cushing Crude Oil Inventories (previous: -1.318M)\n    - Distillate Fuel Production (previous: -0.088M)\n    - EIA Refinery Crude Runs  (previous: -0.286M)\n    - EIA Weekly Distillates Stocks (consensus: -0.648M, previous: -1.074M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 1.0%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - Gasoline Inventories (consensus: 0.508M, previous: 0.086M)\n    - Gasoline Production (previous: -0.229M)\n    - Goods Trade Balance (previous: -87.07B)\n    - Heating Oil Stockpiles (previous: 0.563M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 8.6%)\n    - MBA Purchase Index (previous: 295.5)\n    - Mortgage Market Index (previous: 724.8)\n    - Mortgage Refinance Index (previous: 3,219.9)\n    - Retail Inventories Ex Auto (previous: 1.2%)\n    - U.S. President Biden Speaks\n    - Wholesale Inventories (previous: 0.6%)\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARD, ARES, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLMN, BMRN, BMY, BPMC, BSIG, BSVN, BTU, BVN, BWB, BY, BZH, CACC, CARR, CASA, CAT, CBRE, CBZ, CCBG, CCOI, CCXI, CFFN, CFR, CFX, CG, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COR, COWN, CPLP, CPT, CQP, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CURO, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DRQ, DVA, DVD, DXCM, EBC, EBS, ECOL, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, ERIE, ERII, ERJ, ETH, EVBN, EVLO, EVTC, EXLS, EXPO, FBHS, FBIZ, FBRX, FCN, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FSP, FTAI, FTNT, FTV, FWRD, GEO, GFF, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GOL, GPI, GRA, GSHD, GWB, HAYN, HGV, HP, HSY, HTGC, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INDT, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBAI, LBPS, LEVL, LFVN, LH, LIND, LKQ, LLNW, LMAT, LPLA, LTC, LTRX, LYG, MA, MATW, MBIN, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MNOV, MO, MPW, MRK, MRLN, MSTR, MTLS, MTRN, MTSI, MVIS, NATI, NDLS, NEM, NIO, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, OCFC, OFC, OMCL, ONEW, ONTO, OPI, OPOF, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCG, PCSB, PEB, PH, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RCL, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SAND, SCX, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SNDR, SNP, SO, SPGI, SPSC, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TPX, TREE, TROW, TRS, TRTN, TRUP, TUSK, TW, TWTR, TXRH, TXT, ULBI, ULH, USAK, USM, VC, VCRA, VICI, VIRC, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PLBC, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SLG, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 49B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 5.0%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n## Upcoming events for Friday, April 30th\n\n - Expected earnings:\n\n  ABBV, AON, AROC, AROW, ASIX, AVNT, AZN, B, BCPC, BRID, BSAC, CBOE, CCLP, CHTR, CL, CLX, CRI, CVEO, CVX, CWBC, DCOM, E, EEX, ESXB, FSBW, GT, GWW, HRC, HUN, IMO, IRMD, ITCB, ITW, JCI, JELD, LAZ, LFC, LHX, LSBK, LYB, MGP, MOG.A, MOG.B, NWHM, NWL, OFIX, OIIM, PBI, PFS, PIPR, PNM, POR, PSX, PSXP, QSR, SBFG, SHLX, SLCA, SPCB, WETF, WPC, WY, XOM\n\n - Ex-div:\n\n  AON, ASRV, BX, C, CARR, CASY, CBAN, CLB, CMCO, CNBKA, CZNC, DGICA, DGICB, DMLP, ELP, EVTC, EWBC, FAT, HAS, HEP, HESM, HFBL, KOF, KRP, LCUT, LYTS, MCI, NRG, NSEC, O, OHI, ORRF, PBCT, PEBO, PNW, SBNY, SBS, SGU, SPFI, SXT, SYF, TKC, TXN, WABC\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.4K)\n    - CFTC Copper speculative net positions (previous: 42.9K)\n    - CFTC Corn speculative net positions (previous: 522.7K)\n    - CFTC Crude Oil speculative net positions (previous: 500.0K)\n    - CFTC Gold speculative net positions (previous: 181.5K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.1K)\n    - CFTC Natural Gas speculative net positions (previous: -50.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -52.2K)\n    - CFTC Silver speculative net positions (previous: 41.7K)\n    - CFTC Soybeans speculative net positions (previous: 243.2K)\n    - CFTC Wheat speculative net positions (previous: 21.0K)\n    - Chicago PMI (consensus: 65.3, previous: 66.3)\n    - Core PCE Price Index (consensus: 0.3%, previous: 0.1%)\n    - Core PCE Price Index (consensus: 1.8%, previous: 1.4%)\n    - Dallas Fed PCE (previous: 1.80%)\n    - Employment Benefits (previous: 0.60%)\n    - Employment Cost Index (consensus: 0.7%, previous: 0.7%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.70%)\n    - Michigan Consumer Expectations (previous: 79.7)\n    - Michigan Consumer Sentiment (consensus: 87.4, previous: 86.5)\n    - Michigan Current Conditions (previous: 97.2)\n    - Michigan Inflation Expectations (previous: 3.7%)\n    - PCE Price index (previous: 1.6)\n    - PCE price index (previous: 0.2%)\n    - Personal Income (consensus: 20.3%, previous: -7.1%)\n    - Personal Spending (consensus: 4.1%, previous: -1.0%)\n    - Real Personal Consumption (previous: -1.2%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 344)\n    - U.S. Baker Hughes Total Rig Count (previous: 439)\n\n^^^^2021-04-28",
        "created_utc": 1619604015,
        "id": "gw5lmui",
        "permalink": "/r/RobinHood/comments/n0bei1/daily_discussion_thread_april_28th_2021/gw5lmui/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619632815.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 26th of April\n\n\n\n## Upcoming events for Monday, April 26th\n\n - Expected earnings:\n\n  ACI, AGNC, AIN, AMG, AMKR, AMP, ARE, ARLP, AXTA, BCLI, BOH, BRO, CATY, CBU, CCB, CDNS, CHKP, CNI, CVLG, DGICA, DGICB, DHIL, DORM, EBTC, EFSC, FBK, FBP, FCAP, FIX, FLXS, FNCB, FRAF, FRBA, HBT, HLX, HMST, HONE, HSII, HSTM, HTLF, IBTX, ILPT, JBT, JJSF, KOF, KREF, LII, LKFN, LXFR, LXRX, MASI, MEDP, MEDS, MKSI, MPB, MRBK, MSB, NBTB, NRIM, NTP, NWBI, NXPI, OMF, OTIS, OVBC, PCH, PEBK, PHG, PKG, PKX, PRK, PW, RBB, RMBI, RRC, SANM, SBAC, SCCO, SEB, SFBC, SSBI, SSD, SSNC, SUI, SVBI, TBI, TCF, TNET, TOWN, TSLA, TV, UHS, UHT, WIRE, WRI\n\n - Ex-div:\n\n  AZZ, CVLY, QIWI, SPNS\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.152%)\n    - 3-Month Bill Auction (previous: 0.025%)\n    - 5-Year Note Auction (previous: 0.850%)\n    - 6-Month Bill Auction (previous: 0.040%)\n    - Core Durable Goods Orders (consensus: 1.6%, previous: -0.9%)\n    - Dallas Fed Mfg Business Index (previous: 28.9)\n    - Durable Goods Orders (consensus: 2.5%, previous: -1.2%)\n    - Durables Excluding Defense (previous: -0.8%)\n    - Goods Orders Non Defense Ex Air (consensus: 1.5%, previous: -0.9%)\n    - Investing.com Gold Index (actual: 52.0%, previous: 48.9%)\n    - Investing.com S&amp;P 500 Index (actual: 33.1%, previous: 39.6%)\n\n## Upcoming events for Tuesday, April 27th\n\n - Stock splits:\n\n    - NSPR @ **1:15**\n\n - Expected earnings:\n\n  AAN, AAT, ABB, ABG, ACCO, ACGL, ACH, ADM, AHC, AJRD, AKO.A, AKO.B, AMD, AMGN, AMX, APAM, ARAY, ARVN, ATEN, ATNI, ATRC, AUDC, AWI, AWRE, BFST, BP, BSBR, BUSE, BXP, BYD, CAC, CALX, CASH, CB, CEQP, CHE, CHRW, CNC, COF, CROX, CRSP, CSGP, CYBE, CZWI, DTE, EBMT, ECL, EGP, EHC, EIX, ENPH, ENTG, EQR, ESBK, ESS, FBNC, FCF, FCPT, FELE, FEYE, FFIC, FFIV, FFNW, FFWM, FIBK, FISV, FRST, FSV, FTI, GE, GFF, GLW, GOOD, GOOG, GOOGL, GPK, HA, HAFC, HAS, HBCP, HEES, HFBL, HIW, HOPE, HRZN, HSBC, HUBB, HVT, HVT.A, IBA, IBCP, IEX, ILMN, IRBT, IVZ, JBLU, JNPR, KNSA, KTCC, LBC, LBRT, LDL, LECO, LLY, MANH, MATX, MDLZ, MKL, MMC, MMM, MRC, MSCI, MSFT, MSTR, MVBF, MXIM, NAVI, NCR, NOV, NVS, NXRT, ODT, OKE, OLN, OMAB, OPRA, OXSQ, PCAR, PFG, PHM, PII, PINS, PJT, PPBI, PPD, PROV, PSB, PTSI, QCRH, QTS, RCKY, RNDB, RNST, ROIC, ROP, RRD, RTX, RXN, SAN, SBUX, SCL, SFST, SHW, SMIT, SPFI, SQNS, SSTK, ST, SYF, SYK, SYX, TENB, TER, TFII, TKC, TPB, TRMK, TRMT, TRU, TSBK, TX, TXN, UBS, UDR, UMBF, UPS, USNA, V, VALE, VBTX, VET, VIST, WDR, WM, WNEB, WSBC, WSBF, WW, YUMC\n\n - Ex-div:\n\n  AM, ATR, BK, CALM, ENTG, IFS, QADA, QADB, VSEC\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 1.300%)\n    - API Weekly Crude Oil Stock (previous: 0.436M)\n    - CB Consumer Confidence (consensus: 113.0, previous: 109.7)\n    - Dallas Fed Services Revenues (previous: 21.6)\n    - House Price Index (previous: 1.0%)\n    - House Price Index (previous: 12.0%)\n    - House Price Index (previous: 316.7)\n    - Redbook (previous: -17.2%)\n    - Redbook (previous: 13.5%)\n    - Richmond Manufacturing Index (previous: 17)\n    - Richmond Manufacturing Shipments (previous: 22)\n    - Richmond Services Index (previous: 16)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 11.7%, previous: 11.1%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.1%, previous: 1.2%)\n    - Texas Services Sector Outlook (previous: 28.9)\n\n## Upcoming events for Wednesday, April 28th\n\n - Expected earnings:\n\n  AAPL, ADP, AER, AFL, AGI, AKR, ALGN, ALRS, ALSN, ALTA, AM, AMED, APH, AR, ARCC, ASGN, ATOM, ATUS, AUY, AVB, AVT, AVTR, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BHLB, BLKB, BPOP, BRKL, BSMX, BSX, BXMT, CAKE, CAMT, CBTX, CCS, CDE, CHEF, CHX, CINF, CIT, CLR, CME, CMO, CNMD, CNO, CONE, CPF, CSTM, CUBI, CYH, DAN, DISCA, DISCB, DISCK, DMRC, DRE, DX, EBAY, ECHO, EQIX, ESI, ESRT, ETR, EVA, EVR, EXR, EXTR, F, FARO, FB, FCNCA, FISI, FNF, FORM, GD, GIB, GRMN, GRUB, GSK, GTY, HBNC, HELE, HES, HESM, HNI, HOLX, HT, HUM, IART, ICAD, ICLR, INOV, INVH, IPG, IRT, ISBC, JAKK, KALU, KNL, KRA, KRC, LC, LFUS, LIVN, LOGI, LXU, MAA, MAS, MC, MCO, MCRI, MEOH, MGM, MGRC, MHH, MHO, MLP, MN, MOH, MORN, MPX, MSVB, MTDR, MTH, MUSA, MXL, NBR, NGVT, NLY, NOA, NOVA, NOW, NSC, NTB, NYCB, OBNK, OC, OI, OII, OIS, ORLY, ORN, OSK, OVLY, OVV, PAG, PB, PDM, PEGA, PGRE, PI, PPC, PSA, PTC, QCOM, R, RBBN, RE, RES, RJF, RNR, ROK, ROL, RWT, SAIA, SC, SGC, SHOO, SHOP, SIGI, SIRI, SIX, SJW, SLAB, SLGN, SMED, SNY, SONY, SP, SPOT, SRDX, SREV, SRI, SSB, SWK, SXC, TDOC, TDY, TECK, TEVA, TKR, TNL, TR, TROX, TTEK, TTMI, TWOU, TYL, UCTT, UFI, UMC, URI, UVE, UVSP, VNE, VRT, VRTS, VSEC, VVV, WCN, WELL, WERN, WH, WING, WNC, WRE, WWW, YNDX, YUM\n\n - Ex-div:\n\n  BPMP, BSRR, CFG, FRC, ITUB, KEN, KNOP, MAIN\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.416M)\n    - Crude Oil Inventories (previous: 0.594M)\n    - Cushing Crude Oil Inventories (previous: -1.318M)\n    - Distillate Fuel Production (previous: -0.088M)\n    - EIA Refinery Crude Runs  (previous: -0.286M)\n    - EIA Weekly Distillates Stocks (consensus: -0.956M, previous: -1.074M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.7%, previous: 1.0%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision\n    - Gasoline Inventories (consensus: 0.464M, previous: 0.086M)\n    - Gasoline Production (previous: -0.229M)\n    - Goods Trade Balance (previous: -87.07B)\n    - Heating Oil Stockpiles (previous: 0.563M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 8.6%)\n    - MBA Purchase Index (previous: 295.5)\n    - Mortgage Market Index (previous: 724.8)\n    - Mortgage Refinance Index (previous: 3,219.9)\n    - Retail Inventories Ex Auto (previous: 1.2%)\n    - Wholesale Inventories (previous: 0.6%)\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALGT, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARES, ARW, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLDR, BLMN, BMRN, BMY, BSIG, BSVN, BVN, BWB, BY, BZH, CARR, CASA, CAT, CBNK, CBRE, CBZ, CCOI, CDNA, CENX, CFR, CFX, CG, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COP, COR, COWN, CPT, CQP, CRAI, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CURO, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DVD, DXCM, EBC, EBS, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, ERIE, ERII, ERJ, ETH, EVBN, EVTC, EXLS, EXPO, FBC, FBHS, FCN, FDUS, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FSP, FTAI, FTNT, FTV, FWRD, GEO, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GPI, GRA, GSHD, GT, GWB, HAYN, HGV, HIG, HP, HSY, HTGC, HUBG, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INSM, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBAI, LBPS, LEVL, LFVN, LH, LKQ, LLNW, LMAT, LOCO, LPLA, LTC, LTRX, LYG, MA, MATW, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MO, MRK, MRLN, MTLS, MTRN, MTSI, MTZ, NATI, NDLS, NEM, NIO, NLSN, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, OCFC, OFC, OMCL, ONEW, ONTO, OPI, OPOF, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCB, PCG, PCSB, PEB, PFPT, PH, PMBC, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SCX, SF, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SMMF, SNDR, SNP, SO, SPGI, SPSC, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TPL, TPR, TPX, TREE, TROW, TRS, TRTN, TRUP, TW, TWTR, TXRH, TXT, UBSI, ULBI, ULH, USAK, USM, UTL, VC, VCRA, VICI, VIRC, VKTX, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 49B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 4.7%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n^^^^2021-04-26",
        "created_utc": 1619431217,
        "id": "gvww79d",
        "permalink": "/r/RobinHood/comments/myu6ia/daily_discussion_thread_april_26th_2021/gvww79d/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619460017.0
    },
    {
        "author": "sa1622",
        "body": "Ahhh lol no worries thought u were a newbie so i threw u some newbie advice and tickers. Take a look at MSTR, FTNT, LMND, VUZI, GMBL, XL",
        "created_utc": 1617267306,
        "id": "gt0e6tm",
        "permalink": "/r/wallstreetbets/comments/mhecu3/what_are_your_moves_tomorrow_april_01_2021/gt0e6tm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617296106.0
    },
    {
        "author": "QCX_Stressed_Me",
        "body": " He told me that he will have another big player in the cyber security in the next update. I am almost certain it will be FTNT. He has mentioned this in past updates but I am not sure why he didn't include it in this update. But he did say that he will have 10 stocks. 1 more in the cyber security, 2 in automaker, 2 in infrastructure and 2 in commodity. Out of the 8 I can only guess 1, FTNT, other 7 have to wait and see.",
        "created_utc": 1618516323,
        "id": "gun516r",
        "permalink": "/r/options/comments/mriikd/next_market_catalyst_the_millionaire_maker_stock/gun516r/",
        "score": 1,
        "subreddit": "options",
        "created": 1618545123.0
    },
    {
        "author": "RevolutionaryArt4271",
        "body": "EPAM, FTNT",
        "created_utc": 1617736581,
        "id": "gtlq9le",
        "permalink": "/r/SPACs/comments/mhdyp9/the_best_time_for_spac_investing_is_now/gtlq9le/",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1617765381.0
    },
    {
        "author": "Triflesaurus",
        "body": "FTNT - Fortinet is a network security leader in the magic quadrant for 11 years in a row. Biden’s infrastructure plan greatly helps this company. \n\nStock was only 70 bucks 2 years ago and now is over 200. I believe this company is still undervalued as it owns over 40 security products, and over 700 patents.",
        "created_utc": 1618845390,
        "id": "gv38vcg",
        "permalink": "/r/stocks/comments/mts4ne/what_under_the_radar_stock_have_you_been_buying/gv38vcg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618874190.0
    },
    {
        "author": "HeinzKetchup5775",
        "body": "Can be I recommend the ETF BUG. It contains FireEye.\nMore importantly, it has in the top 10 the best cyber security companies.\nCrowd Strike, Palo Alto, Fortinet, Z-Scaler, Okta\n\nThese companies are all winners, and cyber security is going to be the next type of warfare.\n\nJust take a look at the MS hacks which are alleged to have originated from China.\n\nI just wish I had money to invest in those companies directly.\nAnd I don't have access to fractional shares, or I'd do that.",
        "created_utc": 1618459707,
        "id": "gukjc1x",
        "permalink": "/r/stocks/comments/mqs6wq/looking_at_feye_today/gukjc1x/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618488507.0
    }
]