[
    {
        "author": "LuckyStrike55",
        "body": "Long: PLTR AAPL SWKS APTV TLRY CGC SNDL CRSP SFT SCO DAN\n\nShort: UCO OXY MRO",
        "created_utc": 1614704667,
        "id": "gpflo5d",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614733467.0
    },
    {
        "author": "wstcstbro",
        "body": "Swks?",
        "created_utc": 1615249592,
        "id": "gq9vui4",
        "score": 2,
        "subreddit": "stocks",
        "created": 1615278392.0
    },
    {
        "author": "fuckthedebt",
        "body": "Yeah, I agree.  I thought there would be more resistence today at the 50 SMA, seeing as we have come so far so quick, but it passed that and is headed towards the 10 day.  I think we should expect some days of consolidation but expect now the bottom was in and, while not firmly over the 50 day, support around the 20SMA at circa 13100 or 13000 intraday on down day should hold.  I doubt we are going straight to brand news highs with a few weeks of bouncing around, albeit in a higher range.  I still don't know if end of quarter rebalancing is being done or will come later in the month.  That still could see some rotation and a little pull back but correction appears over, which is what is important.  \nOver the past year, the market has always seemed to tank when the fed talks, so I would watch the FOMC results.  Things are looking good technically.  I am really only in IBM, QCOM, SWKS and FB for teck, with the rest of my portfolio in energy and cyclical reopening's.",
        "created_utc": 1615481092,
        "id": "gql8490",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1615509892.0
    },
    {
        "author": "Arctic_107",
        "body": "Skyworks Solutions (SWKS) looks to be good. It looks like it could shave off another 10% but is a big player in 5G. It's also a supplier of chips for Apple products.",
        "created_utc": 1614898687,
        "id": "gppkg9v",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614927487.0
    },
    {
        "author": "heyheymustbethemoney",
        "body": "I see value in it. Fabless chip stocks are the ones affected by the shortage. Qualcomm and Marvell don’t have enough chips... meanwhile Skyworks and Broadcom are posting record quarters because they fabricate their own chips.",
        "created_utc": 1615260251,
        "id": "gqaf8pd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615289051.0
    },
    {
        "author": "fuckthedebt",
        "body": "well, the Nasdaq closed just below the 100 SMA and that adds another negative to the bearish technicals. Doing this it broke throgh last thursdays low and made a complete engulfing reversal of Friday's gains.\n\nSo, charts would say watch out but I have some gut feelings: Although we did close lower than thursdays low, we are just below the 100 SMA and there is still a possibility that the index can demonstrate that this was a short term bottom, if it holds and bounces off somewhat.  \n\nOptimists would say yesterday could be establishing a second ST bottom test, even though we went through thursday's close but we did spend almost the entire day above.  I think we need to see a jump above thursdays close and hold or, at most, retest yesterdays close intraday, to get past this week.  \n\nWe did reach a full 10% correction on close but we actually touched 13% on Mondays low of 12397 and we bounced strongly off that. If I look at the intraday low monday and tuesday, they improved, inspite of the close.  \n\nIts amazing to see the Nasdaq crumble when the rest of the maket flies. I think this is the largest correction on record while the rest of the market has stabilized and gone higher.  A little pay back for outpacing the rest of the market last year. Still, growth is becoming realtively well priced to value and that rotation trade can easily rotate back in a moment. If you are a stock picker, I think you can begin to average in names that previously got away, like Qcom or SWKS or AAPL. They will look cheap based on next reported earnings and guidance which, finally, should become very optomistic based on the reopening. \n\nConclusion: Inconclusive, we need to see the index close above last thursdays low as a first step to recovery and not go back to the intraday lows of monday and yesterday before we get risk on.    13000 and 13200 now look like resistence so, if the index has put in a bottom, look for volatility to remain.  Wildcard remains rates stabilizing.  The index has probably absorebed rates of 1.5-1.6 but, if we get to 1.65 or 1.7 quickly, all bets are off. \n\nI am actually long the ndx at a loss, so I am in the wishful thinking camp that we have bottomed but, if I was not long, I would only trade it on an intraday basis until we get back quarter end or some of the technicals strengthen.  Bonds are oversold so a short term rally there would translate well for the Nasdaq.\n\nSo much depends on AAPL, GOOG, FB, AMZN.   Many Semi stocks and some fangs have seen 20% corrections\nWe are overdue for a few days relief rally before going back to test the bottom again.",
        "created_utc": 1615279482,
        "id": "gqb4uxw",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1615308282.0
    },
    {
        "author": "fuckthedebt",
        "body": "Agree.   It's messy but many tech names now look like value plays did 3 months ago. Economic growth is good for Ford but it's going to be good for QCOM as well and SWKS and those companies have monster margins. And that is not considering the still coming 5G cycle and Semi chips going into everything.  The shortage is good for semi companies margins where they have a production pipeline.   \n\nExample: SWKS earned 3.36 last quarter.  With semi shortage and seeing as they are the only company that produces their own chips, they are selling out at prices set by them.  If, if SKWS maintains that earnings momentum and pulls out 12-14$ in 2021, the stock is selling for 12-15 earnings.  That does not look bad with their growth numbers in a supercycle economic boom compared to Banks at 12x earnings  \n\nSWKS is just an example but you get the picture.  If value keeps outpacing Tech, we will be looking at value fully valued and tech, with still higher growth, undervalued. \n\nFirst quarter earnings report could bring suprises and, finally, good guidance.  If things get cheaper or even bottom here, that sets up for a major rally post earnings, sometime in April.  \n\nStrat your shopping list now and average in, that my couch potato advice. \n\ndisclosure: I am long SWKS, QCOM and IBM and Apple Calls in TEch.",
        "created_utc": 1615280578,
        "id": "gqb5y7x",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1615309378.0
    },
    {
        "author": "Boomtown626",
        "body": "Yes, and they also increase the importance of timing the market a bit, which is also more gamble-y. Otherwise, with a 2-year time horizon, you don't time the market, you just get in and hold. I changed all my shares for leaps on Monday afternoon, so my timing worked out nicely. One of them is NXPI, which just got added to the S&amp;P since then. Lots of luck involved, but at the same time, when I bought the leaps, the premiums were ~25% of the share price, meaning I needed large and growing chipmakers to grow by 25% in 22 months to cover my premium. With the right timing (a gamble-y qualifier), that can be a serious no-brainer. \n\nNXPI: 20 Jan 2023 170c at 42.40 premium, and it hit 195 in AH following the S&amp;P announcement. \n\nMRVL: 20 Jan 2023 40c at 10.47 premium, and it's already back up over 47. \n\nSimilar, but not quite as awesome numbers for AMD, QRVO, SOXX, SWKS. My timing was good/lucky, but using the \"be greedy when others are fearful\" approach, with Monday's bloodbath following an already-brutal two weeks for tech, converting shares to leaps felt like the way to go, and it's going to pay off much more handsomely than had I just held.",
        "created_utc": 1615739744,
        "id": "gqwrup9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615768544.0
    },
    {
        "author": "IfItsBrokenFixIt",
        "body": "Going to Grab me some 4/16 Calls on Monday, I only have 1k so doing $1 Options\n\nMSOS - $62/ IV: 81%/ $0.90\n\nSWKS - $210/ IV: 41%/ $0.62\n\nCOST - $370/ IV: 25%/ $1.03\n\nARKK - $156/ IV: 51%/ $1.00\n\nTSLA - $1,300/ IV: 89%/ $0.96\n\nDIS - $230/ IV: 38%/ $1.08\n\nFB - $315/ IV: 33%/ $0.81\n\nF - $13/ IV: 50%/ $1.01\n\n&amp;#x200B;\n\nObviously these are the numbers right now. If anyone is making these plays I high suggest waiting to snag at open or wait until the 10AM dip. Also Ford might really shit itself due to the airbag situation and COST Might take off a bit at the start due to Financial institutions talking about it so much. Just keep an eye out!\n\n&amp;#x200B;\n\nNot Financial advice, I ate my dogs jerky on accident today.... Worse thing is I didn't notice until 6 pieces in, shit was delicious",
        "created_utc": 1615655912,
        "id": "gqtcufn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615684712.0
    },
    {
        "author": "Apex_Starshine",
        "body": "Depends on what you're doing.  Sounds like a lot of stocks to be going long on, but hey if you have a plan for each of them, who am I to say?    \n\n\nI just looked and I'm holding 31 right now, but I day trade.  So that number jumps around quite a bit.  Of those, there's 5 or 6 that I plan on holding long term.  (outside of the ones I'm just bag holding on...  hahaha  meh...  pennystocks...  it's a racket... ) :D  \n\n\nI'm long on F, NVDA, SWKS, TSM, and ORC.  The rest are a good green day away from pure liquid.",
        "created_utc": 1615697267,
        "id": "gqvd77m",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615726067.0
    },
    {
        "author": "toydan",
        "body": "Haven’t seen $AVGO and $SWKS  on Reddit much. I like them and have been growing them. Keep them and $QCOM in my dividend account. Want to get to 100 shares of $SWKS and sell CCs over THEM AND $QCOM. \n\nI have LEAPs on $AMD and $MU. that I would to start printing at any time. Will get back into $SOXL again here soon too.",
        "created_utc": 1615730631,
        "id": "gqwc4tc",
        "score": 1,
        "subreddit": "options",
        "created": 1615759431.0
    },
    {
        "author": "athriren",
        "body": "going to ask again—what is your position and cost basis? i am long SWKS synthetically through semi ETF calls so just curious for your thesis here as well.",
        "created_utc": 1615562487,
        "id": "gqp4hla",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615591287.0
    },
    {
        "author": "mr_blockchain_",
        "body": "this is the 3rd time I see you spam this garbage.\n\nlet me guess - you don't know what teh fuck you are doing and you are bagholding $162.5 swks puts for 3/19",
        "created_utc": 1615565354,
        "id": "gqpathf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615594154.0
    },
    {
        "author": "mikey-likes_it",
        "body": "5G stuff might be worth looking into skyworks, qcom, etc.",
        "created_utc": 1617213867,
        "id": "gsxunu0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617242667.0
    },
    {
        "author": "chedrich446",
        "body": "Any other SWKS bag holders here? Should I just dump this turd?",
        "created_utc": 1614869076,
        "id": "gpnnwvz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614897876.0
    },
    {
        "author": "fuckthedebt",
        "body": "I like SWKS, best semi play and only one producing it's own chips.  Also, IBM may have turned a quarter.  The street really wants to love this and is waiting for confirmation of the turnaround.  This year they are set to spin off operations and concentrate on cloud.  Good, dividend, previous value play trying to reconquer it's growth status.\n\nI like AMT, CVS-(MIssing WBA here, which should be considered) FB, BMY, (Gild looks well priced as well in healthcare).\n\nFor more boring reopen plays, still alot of mid cap energy names with room to run, european airlines and Europe in general, which is way behind the U.S.",
        "created_utc": 1615281214,
        "id": "gqb6kdc",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1615310014.0
    },
    {
        "author": "johnnywideopen",
        "body": "SWKS is just over 10% down in the last month. Is it on sale or is it not going back up? May the odds ever be in your favor.",
        "created_utc": 1615681252,
        "id": "gqunaq2",
        "score": 1,
        "subreddit": "options",
        "created": 1615710052.0
    },
    {
        "author": "Spectacle_Maker",
        "body": "I’m loving semis here. ON is my favorite, but I am also long NVDA, AVGO, SWKS, MCHP, and ACEV.",
        "created_utc": 1615691309,
        "id": "gqv468i",
        "score": 1,
        "subreddit": "options",
        "created": 1615720109.0
    },
    {
        "author": "fuckthedebt",
        "body": "I use to follow TSM closely many years ago.  They are the largest semi conductor producer in the world and have a lot shine because they are suppliers to Apple for phones, i Pad's etc. They also supply, via contract, almost every other smartphone maker, so they should benefit from the 5G cycle, so the that cycle should sustain and propel them to new highs in the next 18 months.  Short term: \nThey are sitting just above the 100 SMA and probably will follow the momentum in the rest of the market short term-could go either way!  Just to diversify, i would consider spreading out your investment between them and the Semi ETF-SMH, which has TSM along with others in it and consider QCOM or SWKS  \nLike  33% TSM or 50, 33% SMH and 33% Qcom or SWKS \n\nofcourse I like SWKS.  Also, Qcom and Swks has much larger call premiums so you could buy the stock here and sell a call for a sizable premium on these names expiring in July or August. \n\nYou could also sell a naked put at 115 for TSM expiring in June at 9$.  That means, if the stock decreases form here, you get it for 106$ and if it remains where it is or goes up, you keep the premium. \n\nSome trade ideas..",
        "created_utc": 1615307305,
        "id": "gqce4lf",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1615336105.0
    },
    {
        "author": "miscsubs",
        "body": "This list is worse than just posting the components of SOXX.\n\nLike who in their right minds (fab or no fab) talks about MSFT in the semi space? Or even Apple? They don't sell any of their chips. Nobody buys AAPL for their chip revenue. And LOL, having IBM in there, who had to *pay* GF to take their fabs off their hands.\n\nThere's Broadcom but no Qualcomm. There's Skyworks but no Qorvo. The list is so bad I kind of feel like it's a troll post. But probably not.",
        "created_utc": 1615221552,
        "id": "gq85nwp",
        "score": 1,
        "subreddit": "investing",
        "created": 1615250352.0
    },
    {
        "author": "athriren",
        "body": "what is your position and cost basis? i am long SWKS synthetically through semi ETF calls so just curious for your thesis here as well",
        "created_utc": 1615562293,
        "id": "gqp42tf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615591093.0
    },
    {
        "author": "happierdayz4me2",
        "body": "how did I just miss this skyworks free money dip??",
        "created_utc": 1615989320,
        "id": "gr8jklb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1616018120.0
    },
    {
        "author": "IfItsBrokenFixIt",
        "body": "My Moved this morning - All 4/16 Calls within the $1 bracket\n\nMSFT\n\nF\n\nFB\n\nDIS\n\nTSLA\n\nARKK\n\nCOST\n\nMissed the Op on SWKS and MSOS, but they're looking pretty hot also!",
        "created_utc": 1615816194,
        "id": "gr0fq0m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615844994.0
    },
    {
        "author": "Wealthofwallst1",
        "body": " this is a good put option = **SWKS $162.5 Put = 3/19**",
        "created_utc": 1615564867,
        "id": "gqp9q40",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1615593667.0
    },
    {
        "author": "Wealthofwallst1",
        "body": " i'm going to say it again = this / these are TWO great a good put options =\n\n# SNAP $52 Put = 3/19\n\n# SWKS $162.5 Put = 3/19",
        "created_utc": 1615563036,
        "id": "gqp5nsu",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1615591836.0
    },
    {
        "author": "Spectacle_Maker",
        "body": "I just added AMD to my portfolio. They are really taking INTC to the woodshed, and are selling every chip they can produce. I’d expect to see some margin improvement with the crazy high demand. \n\nI am very overweight chips right now. I have AMD, ACEV, AVGO, MCHP, NVDA, ON, and SWKS\n\nMy favorite is ON, though ACEV has come down to within 5% of NAV so I’m looking at picking up more.",
        "created_utc": 1615915297,
        "id": "gr56cju",
        "score": -1,
        "subreddit": "ValueInvesting",
        "created": 1615944097.0
    },
    {
        "author": "Wealthofwallst1",
        "body": "here's a way to earn some coin = you're welcome\n\n**SWKS $162.5 Put = 3/19**\n\n&amp;  this is a good put option = **SWKS $162.5 Put = 3/19**",
        "created_utc": 1615563496,
        "id": "gqp6o03",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1615592296.0
    },
    {
        "author": "livingmargaritaville",
        "body": "Texas instruments is probably a good bet not micro though.",
        "created_utc": 1614824108,
        "id": "gplvesm",
        "score": 9,
        "subreddit": "stocks",
        "created": 1614852908.0
    },
    {
        "author": "OlDurtMcGurt",
        "body": "By freind you mean your wife's boyfriend?\n\n&amp;#x200B;\n\nIt's a good move IMO as well as the rest of the companies you listed. I'm waiting on UMC to blast off and have been buying every time it dips more. What Im looking at is when Biden decides to try to ramp up semiconductor production in the USA to compete against China, who is going to get government grants and huge tax breaks? TXN? MU? AVGO? For the Automotive industry, who is the most important US company producing the specific semiconductors the car manufactures need?",
        "created_utc": 1614897107,
        "id": "gpph4s9",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614925907.0
    },
    {
        "author": "Odinhawk",
        "body": "Thank you wallstreetbets. The moderators, the OG members, the high profile members (DFV), the new members who are as clueless as me, the new members who can only post emojis and have a vocab of five words, the bots, and even the hedge fund infiltrators... if there is such a thing.  \n\nThis is the ultimate game. Do your own research, listen to smart people, and get rid of any MSM opinions. You will do great.\n\nNo one cares, but my favorite game of all time is Drug Wars on my good ole TI-85 Texas Instruments calculator (fucking nerd). The basics of that game is the exact same as the stock market. Buy low, sell high, fuck the loan shark. Difference - you will lose real money, you might get arrested, and you could probably get mugged? \n\nI was always scared to jump in to the big leagues but after the first GME squeeze I decided why not throw fun money into stocks instead of busch light and other useless crap. So I started throwing money into stocks and busch light.\n\nJokes aside, I did quit drinking every night. Started working out. Got a damn haircut. Almost bought a bidet... but I'm an american who needs to see my waste on paper. I'm one line of stripper salt and a convertible Pontiac fiero away from doing this full time. Because of this great community.\n\nI've learned a lot over the last month or two. Not from the GME experts and emoji people, but from the OG's who have been to battle. GME will not last forever but that does not mean the money will dry up. Soak the useful info in. This is the difference between dying alone in your recliner while watching 'the office' reruns or dying at the ripe age of 85 in a horrific, power grid altering accident that involves your diamond encrusted lambo wrapped around a telephone pole. \n\nI fucking love you people. To Valhalla!\n\nTLDR: read first 6 paragraphs and then skip to the last line.",
        "created_utc": 1614831458,
        "id": "gpm9j60",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614860258.0
    },
    {
        "author": "soonseen",
        "body": "Texas instruments has the sexist graph ever. Change my mind.",
        "created_utc": 1614823986,
        "id": "gplv5ub",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614852786.0
    },
    {
        "author": "Oases-dragon",
        "body": "Yeah, the best I could find was Silicon Labs. It has a P/E of 535, with 6.64B market cap.  I have a feeling Texas Instruments is going to be facing a lot of future competition, pretty soon.",
        "created_utc": 1614826342,
        "id": "gplzyst",
        "score": 4,
        "subreddit": "stocks",
        "created": 1614855142.0
    },
    {
        "author": "AdNo7052",
        "body": "My stonx:\n\nGME up\nGIS up\nGOOGL up\nMSFT down\nTMO down\nHVT down\nDHR down\nDECK down\nQRVO down\nTXN down\nHVO down \nAMAT down\nKLAC down\nFTEC down\n\nHate red... ;(",
        "created_utc": 1614887831,
        "id": "gpovq5c",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614916631.0
    },
    {
        "author": "DeathbyToast",
        "body": "Why not $TXN? Lines up with most of your DD (they also have their own fabs, including US based ones). And P/E is a more comfortable 29 right now. \n\nDo you think the whole industry will bump over the next few years?",
        "created_utc": 1614756426,
        "id": "gpifa2p",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614785226.0
    },
    {
        "author": "PorcoRossoPerot",
        "body": "Is anyone else seeing this weird glitch in the matrix where like a bunch of major S&amp;P stocks that dumped today suddenly skyrocketed back to exactly 0.0% right at close and then fell again in AH? Or is this just some weird thing I'm not understanding.\n\nSeeing it on Amazon, Google, Netflix, Adobe, Broadcom, Texas Instruments, Pepsi. Am I having a stroke?",
        "created_utc": 1615243693,
        "id": "gq9kmfe",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1615272493.0
    },
    {
        "author": "krunkpunk",
        "body": "Can Texas Instrument TXN continue this year-long run? Or is it time for puts?",
        "created_utc": 1614829310,
        "id": "gpm5p6t",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614858110.0
    },
    {
        "author": "soonseen",
        "body": "Aye, that Texas instruments chart is so nice though.",
        "created_utc": 1614823940,
        "id": "gplv2go",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614852740.0
    },
    {
        "author": "SeorgeGoros",
        "body": "I'm also curious as to what that's about. I see it a lot where it spikes to previous days close. Something to do with some kind of IOU or options? It's not just a Robinhood thing; I see it on Google as well looking at TXN for example",
        "created_utc": 1615246545,
        "id": "gq9q3ky",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1615275345.0
    },
    {
        "author": "milimiri",
        "body": "You might want to remove STX, AVGO, AAPL and etc. from the list, and add ASML, LRCX, MU and etc. to the list. \n\n\nI am working in semiconductor industry but not in fabrication. Basically the most fabs have been out of game for advanced technology nodes. For example, TXN has some fabs, but they are old technology (still a descent market especially for analog chips). MU has fabs but mainly for memory (memory and logic CMOS are different in manufacting). There are also markets for power semiconductor, optical sensors and etc. For advanced SoC chips, only major players left right now are TSM and INTC. Samsung is still in the game and SMIC is trying to catch up. But basically TSM takes the majority of the market. \n\nDisclosure: I have been holding TSM for a couple of years. I personally prefer fab+fabless and I am a little bearish on US-based fab. But I am not an expert in the field.",
        "created_utc": 1615222721,
        "id": "gq88ilq",
        "score": 2,
        "subreddit": "investing",
        "created": 1615251521.0
    },
    {
        "author": "SantasButhole",
        "body": "Txn is the better buy. They don’t have a shortage of semiconductors because they have furnaces in house. Source: family works at their biggest fab",
        "created_utc": 1614793609,
        "id": "gpk2ikt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614822409.0
    },
    {
        "author": "Selivard",
        "body": "I personally stay out of crypto, probably to my own detriment at this point, but the volatility makes my skin crawl, and the threat of government regulation causing a huge swing is enough to scare me away. I invest like a boomer. Can't seem to post a picture so here's some of my dividend picks for the year:(My Dividend Daddys Watchlist) MSFT, TXN, DIS, AGNC, PG, MRK, VIG, PG, JNJ, LMT, EDP, PEP, DPZ, KO, O, T, VYM, TRP, ATO, SPYD, MMM, CLX, CAP, BP, XOM, BK, MCD, BAC, WFC, ET. \n\nI am by no means a professional, but that's where I am currently adding long term positions. I've also grabbed some APPL while it's been down. I can't be any help on commodities, but raw materials should see a boost this year as things turn on, but a lot of them seem pretty front loaded for the recovery. I may look for a materials ETF to take a position in myself.",
        "created_utc": 1615417053,
        "id": "gqi6r5v",
        "score": 2,
        "subreddit": "investing",
        "created": 1615445853.0
    },
    {
        "author": "hi-imBen",
        "body": "A)  They are trying to say the semiconductor shortage could be manufactured (intentionally shutting down factories/restricting supply to increase the price they can charge).  While this isn't an insane theory, it is not what is happening now.\n\n\nB)  Doesn't look like they are talking about any one stock specifically, but the semiconductor industry.\n\n\nC)  Please buy all the semiconductor stocks/ETFs I'm holding :)   ADI, MXIM, MCHP, TXN, SITM, MPWR, ON, NXPI, MRVL, QCOM, XLNX, SOXX, PSI, SMH",
        "created_utc": 1614809529,
        "id": "gpl38tb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614838329.0
    },
    {
        "author": "LastDelivery5",
        "body": "TXN does not have as much of an operational improvement story. ON is going through fab rationalization.",
        "created_utc": 1614794344,
        "id": "gpk48o3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614823144.0
    }
]