[
    {
        "author": "DementedUnicorn",
        "body": "[Among other notable accomplishments such as](https://twitter.com/LittleMusky/status/1351544855684497414/photo/1):\n\n* shorting PTON at 20 with price target of 5 (now at 150)\n* shorting NIO at 45 with price target of 25 (now at 58)\n* shorting TSLA at 180 (now at 840)\n* shorting NVDA at 150 with price target of 130 (now at 520)\n* shorting W at 85 with price target of 45 (now at 295)\n* bullish on BB at 11 with price target of 20, three and a half years ago (now at 11)\n\nAndrew Left should be a mod on this sub",
        "created_utc": 1611070766,
        "id": "gju7slc",
        "score": 2854,
        "subreddit": "wallstreetbets",
        "created": 1611099566.0
    },
    {
        "author": "prettygurl_xoxo_luv",
        "body": "REMEMBER: Once you buy shares, you can hold them forever, for free. Shorts have to continuously pay lots of interest to keep their shares short sold.🍋🍋🍋🍋🍋🍋\n\nThere is literally no way for shorts to exit their costly positions without paying us, as long as we HOLD.💎💎💎💎💎💎🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼\n\nWhether it happens today in a giant spike, or in small steps over the next couple months, the shorts WILL pay out.🚀🚀🚀💎💎💎🚀🚀🌕🌕🌕🚀🚀🍋🍋\n\n#The amount of hatred I have for Citron is unhealthy. They have done this bullshit manipulation on almost everything I've invested. Shopify, Nvidia, NIO, PLTR, and now GME. Fuck these assholes and their blatant manipulative bullshit tactics and fuck those paper handed bitches that listen to a tweet from some group who have been wrong almost every time they opened their mouth.\n\n#Fuck you shitron I hope you shove that lemon so far up your ass that it gets stuck in your small intestine and shit literally start pouring from your mouth because you're so plugged from shoving lemons in your ass to tickle your prostate that the shit has nowhere else to go but up, just like GME 🚀 🚀 🚀",
        "created_utc": 1611251268,
        "id": "gk30547",
        "score": 337,
        "subreddit": "wallstreetbets",
        "created": 1611280068.0
    },
    {
        "author": "88crypto",
        "body": "This ANALyst screw my NVDA calls few years ago.  Still  wonder,  why he has such influence,  when he's almost never right",
        "created_utc": 1611301606,
        "id": "gk5lve8",
        "score": 260,
        "subreddit": "wallstreetbets",
        "created": 1611330406.0
    },
    {
        "author": "SockeyeSTI",
        "body": "Exactly. I was skeptical getting AMD at 11. NVDA at 208, but then it dipped to 156. I want to dump it, but instead bought more. Sometimes you just get lucky, other times you get confident and buy HYLN at ipo.",
        "created_utc": 1610358880,
        "id": "giv10w0",
        "score": 239,
        "subreddit": "wallstreetbets",
        "created": 1610387680.0
    },
    {
        "author": "darthabler",
        "body": "And right after I sold my fucking NVDA...",
        "created_utc": 1610206717,
        "id": "ginv770",
        "score": 204,
        "subreddit": "stocks",
        "created": 1610235517.0
    },
    {
        "author": "CIB",
        "body": "Yeah I wasn't willing to gamble all my money on this, until WSB got DDoS'd and the stock collapsed at the same time. That's when I sold my entire Apple and Nvidia stock and put it all in GME.",
        "created_utc": 1611858032,
        "id": "gl4jrhj",
        "score": 184,
        "subreddit": "wallstreetbets",
        "created": 1611886832.0
    },
    {
        "author": "RckZilla123",
        "body": "Just so people know this guy also shorted NVIDIA\n\nHE SHORTED FUCKING NVIDIA\n\n[https://www.youtube.com/watch?v=lh0sDL937f4](https://www.youtube.com/watch?v=lh0sDL937f4)",
        "created_utc": 1611273027,
        "id": "gk4b2wn",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1611301827.0
    },
    {
        "author": "eclectictaste1",
        "body": "$NFLX in 2014 for $32,000. Now worth $410,000\n\n$AAPL in 2010 for $9500.  Now worth $120,000\n\n$AMZN, starting in 2011, various purchases, total cost basis $87,000. Now worth $424,000\n\n$PYPL 2002 ($3000) &amp; 2008 ($2000). Current worth, $146,000.\n\nMany other smaller holdings (relatively speaking) as well, like Google, Nvidia, Tesla, Facebook, Twitter, etc.  Moral of the story: Buy high quality companies with great growth prospects and hold on.",
        "created_utc": 1611202305,
        "id": "gk0zqre",
        "score": 152,
        "subreddit": "stocks",
        "created": 1611231105.0
    },
    {
        "author": "_skala_",
        "body": "I dont think this small news will not even move nvidia stock. This is small thing for nvidia, bigger news for NiO.",
        "created_utc": 1610212815,
        "id": "gio6ts2",
        "score": 147,
        "subreddit": "stocks",
        "created": 1610241615.0
    },
    {
        "author": "reelish",
        "body": "Should probably check out Nvidia too since they're being used for the supercomputer...",
        "created_utc": 1610195252,
        "id": "gineund",
        "score": 136,
        "subreddit": "wallstreetbets",
        "created": 1610224052.0
    },
    {
        "author": "NWheelspin",
        "body": "I don’t see this deal benefiting Nvidia long term; it’s a setup so NIO can steal their IP.",
        "created_utc": 1610204765,
        "id": "ginrtze",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1610233565.0
    },
    {
        "author": "westerhong",
        "body": "AAPL\n\nI bought a bunch of AAPL in 2010 when Steve Jobs passed. It’s grown to be over 50% of my portfolio even as I keep buying other stocks. It just keeps going up. Every time I rebalance or try to diversify I regret it. \n\nTheir recent innovation with their silicon is off the charts and should make holders of intel, AMD, and NVDA very worried. The growth in their services revenue is such an impressive pivot. Amazing brand value, huge margins and stockpiles of cash. And they’ve proven that they have a company DNA that extends beyond any one figure or product.\n\nThere will always be an apple hating crowd, and the company is a bit too full of itself. But it’s a company I feel good investing in unlike Facebook.",
        "created_utc": 1611044417,
        "id": "gjt83kw",
        "score": 87,
        "subreddit": "investing",
        "created": 1611073217.0
    },
    {
        "author": "Sensei071",
        "body": "Still no new factory / vertical integration nor updates on expansion to Europe. Solid state battery isn’t product ready until the end of 2022 at the earliest. And they won’t have control over the production pipeline since they are adopting someone else’s solid state battery (either CATL or Prologium). New self driving development via partnership with Nvidia is great but not groundbreaking. A lot of auto manufacturers are already using Nvidia’s platform to develop self driving like Xpeng and Li. ET7 is promising but won’t be delivered until Q1, 2022 at the earliest. It’s also an ultra premium sedan that competes w/ model S which really hasn’t been the moneymaker of all EV models.  Perhaps they will release a more affordable sedan next. I think Nio will be successful as long as they could execute the long term initiatives. But let’s not kid ourselves that there were no flaws in the Nio Day’s presentation. I own a good amount of Nio shares myself but also gotta be realistic as an investor here.",
        "created_utc": 1610276711,
        "id": "gir5m4b",
        "score": 85,
        "subreddit": "wallstreetbets",
        "created": 1610305511.0
    },
    {
        "author": "stevenconrad",
        "body": "A lot, actually. WSB is usually right, but timing can be way off. I've seen TSLA, GME, PLTR, BB, BBBY, MT, NVDA, AMD, MSFT, F, GE, etc. All with gains and losses,  but mostly through options. Miss time it, and you're fkd. Buy shares an you'll usually win, but with options you'll fly or fall.",
        "created_utc": 1610854798,
        "id": "gjjg80l",
        "score": 79,
        "subreddit": "wallstreetbets",
        "created": 1610883598.0
    },
    {
        "author": "lowrankcluster",
        "body": "Nvidia makes the best chips for neural network computation. Good to see that they are not stopping to innovate in both hardware and software support despite no competition.",
        "created_utc": 1610202296,
        "id": "ginnwqj",
        "score": 73,
        "subreddit": "stocks",
        "created": 1610231096.0
    },
    {
        "author": "Leon91",
        "body": "And precisely because they can't compete NOW, intel is undervalued. But they're sitting on a mad stack of cash, have a ton of engineers, are looking to outsource to TSMC as well and they will always get back. Maybe you haven't noticed, but Intel/AMD and before ATi/NVidia is very cyclical.",
        "created_utc": 1611064151,
        "id": "gjtv56c",
        "score": 68,
        "subreddit": "investing",
        "created": 1611092951.0
    },
    {
        "author": "LiveLaughLibor",
        "body": "I was holding NVDA from 2017 onwards. The sell off in late 2018 and early 2019 was extremely painful and mentally scaring/conditioning when it comes to my investing philosophy. Watching your shares tank 40% in value is an experience I honestly hope every investor goes through once and only one time. After you go through it you stop caring so much about the intraday swings. This new cohort of investors who have made their money in 2020 need to experience a bear market to teach them some lessons on investing.",
        "created_utc": 1610673466,
        "id": "gjamv6g",
        "score": 67,
        "subreddit": "investing",
        "created": 1610702266.0
    },
    {
        "author": "Shawnj2",
        "body": "When he was doing the “Fuck Nvidia” stream in the first 30 minutes while he was reading the email they sent Hardware Unboxed, it said in the email that cards are expensive and they can’t give them out for free or some BS like that, Linus’s response was “fuck you, in the time since I started this stream, I have made enough money to buy 10 RTX 3090’s.”",
        "created_utc": 1611995116,
        "id": "glclxbc",
        "score": 62,
        "subreddit": "wallstreetbets",
        "created": 1612023916.0
    },
    {
        "author": "prettygurl_xoxo_luv",
        "body": "REMEMBER: Once you buy shares, you can hold them forever, for free. Shorts have to continuously pay lots of interest to keep their shares short sold.🍋🍋🍋🍋🍋🍋\n\nThere is literally no way for shorts to exit their costly positions without paying us, as long as we HOLD.💎💎💎💎💎💎🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼\n\nWhether it happens today in a giant spike, or in small steps over the next couple months, the shorts WILL pay out.🚀🚀🚀💎💎💎🚀🚀🌕🌕🌕🚀🚀🍋🍋\n\n#The amount of hatred I have for Citron is unhealthy. They have done this bullshit manipulation on almost everything I've invested. Shopify, Nvidia, NIO, PLTR, and now GME. Fuck these assholes and their blatant manipulative bullshit tactics and fuck those paper handed bitches that listen to a tweet from some group who have been wrong almost every time they opened their mouth.\n\n#Fuck you shitron I hope you shove that lemon so far up your ass that it gets stuck in your small intestine and shit literally start pouring from your mouth because you're so plugged from shoving lemons in your ass to tickle your prostate that the shit has nowhere else to go but up, just like GME 🚀 🚀 🚀",
        "created_utc": 1611170930,
        "id": "gjz7497",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1611199730.0
    },
    {
        "author": "VictorDanville",
        "body": "Does NVIDIA get to go up as well? Would be nice to see tech stocks finally break out of 4 months of flatness...",
        "created_utc": 1610204362,
        "id": "ginr64x",
        "score": 57,
        "subreddit": "wallstreetbets",
        "created": 1610233162.0
    },
    {
        "author": "MadMarq64",
        "body": "I've had conversations with people where I accidentally convinced them to buy a particular stock. \n\nOne time it was Nvidia (NVDA). However, the person I was talking to was not at all a tech person. They couldn't even tell you which operating system they use on THEIR OWN COMPUTER. \n\nI pleaded with them to not buy something they didn't understand, but they did it anyway. Of course, they bought when it was at an ATH a few months ago. Now they are upset with me for convincing them to buy a dud.",
        "created_utc": 1610810993,
        "id": "gjgupf6",
        "score": 57,
        "subreddit": "stocks",
        "created": 1610839793.0
    },
    {
        "author": "Corrode1024",
        "body": "Questionable?\n\nHe shorted Nvidia, Tesla, Shopify, and more.\n\nIf you I versed him last year, you'd be up over 300% on average.",
        "created_utc": 1611281345,
        "id": "gk4qiy0",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1611310145.0
    },
    {
        "author": "prettygurl_xoxo_luv",
        "body": "The amount of hatred I have for Citron is unhealthy. They have done this bullshit manipulation on almost everything I've invested in in my short time doing this. Shopify, Nvidia, NIO, PLTR, and now GME. Fuck these assholes and their blatant manipulative bullshit tactics and fuck those paper handed bitches that listen to a tweet from some group who have been wrong almost every time they opened their mouth.\n\nEdit: Fuck you shitron I hope you shove that lemon so far up your ass that it gets stuck in your small intestine and shit literally start pouring from your mouth because you're so plugged from shoving lemons in your ass to tickle your prostate that the shit has nowhere else to go but up, just like GME 🚀 🚀 🚀",
        "created_utc": 1611089989,
        "id": "gjve2b6",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1611118789.0
    },
    {
        "author": "dancinadventures",
        "body": "Turn Intel into a company that can compete against nVidia / AMD / Taiwan semi again ? Nope. \n\n\nRaise money with SPACs and print those PromoteTendies? Hell yeah.",
        "created_utc": 1611031286,
        "id": "gjsqwlm",
        "score": 51,
        "subreddit": "SPACs",
        "created": 1611060086.0
    },
    {
        "author": "mamagaye",
        "body": "TSLA put their own neural chip in because NVIDIA isn’t specialized enough...that should tell you all you need to know\n\nedit: And they did it a year ago, here’s the [article](https://www.theverge.com/2019/4/22/18511594/tesla-new-self-driving-chip-is-here-and-this-is-your-best-look-yet)",
        "created_utc": 1610224501,
        "id": "giouvll",
        "score": 47,
        "subreddit": "StockMarket",
        "created": 1610253301.0
    },
    {
        "author": "elmohasagun13",
        "body": "The last ex employee I let talk me out of investing worked for nvidia",
        "created_utc": 1610851963,
        "id": "gjjaxkk",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1610880763.0
    },
    {
        "author": "Ngin3",
        "body": "NVIDIA GANG",
        "created_utc": 1610232481,
        "id": "gipb5b2",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1610261281.0
    },
    {
        "author": "Dawgstradamus",
        "body": "Decided yesterday, after some considerable DD &amp; 9 drinks, to do the same on Tuesday.\n\n\nSelling all my Ark F&amp;G, NVDA, MSFT, etc.\n\nIt’s all going in BB.\n\nI’m done being in stocks that are trading at 40+ times earnings.\n\nBB is at 4.5 x earnings. It has the power of the meme. It has a real competitive advantage &amp; a value prop.\n\nIt’s already made me + 50% in my first 750 shares.\n\nLong live Cathy, long live Chen.\n\nRebalancing to 100% BB &amp; deleting my TD Ameritrade app.\n\nSee ya in a few years!🚀🚀🚀🚀",
        "created_utc": 1610938576,
        "id": "gjojcae",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1610967376.0
    },
    {
        "author": "galactojack",
        "body": "I go for the tech, renewable, cybersecurity, cloud, and a bit of pot stocks- this decade should be great for those\n\nFor less risk, I go with NEE, BEP, Nvidia, and Disney. Next Era Energy and Brookfield Renewable - they're already the kings of the U.S. renewable utility market, and pay dividends. Dividends + growth = booya. Nvidia for obvious reasons and their new AI tech, and Disney because they've been slowly taking over the digital entertainment market (i.e. ESPN and all the new streaming hits) and once their parks are doing well again it'll probably accelerate really quickly.\n\nCybersecurity is only just getting going too with nearly infinite room for growth, Zscaler and Crowdstrike are doing extraordinarily well.\n\nFor more risk, my renewable riskies (but are still leaders in their industry) are BLDP, SEDG, LAZR, and QS. BLDP and SEDG are reliable, the others fairly speculative but with strong futures if all goes well. I'm looking forward to Lion going public soon, as Amazon backs them. I have some in Fisker as well, I think they've got potential and they seem to have their ducks in a row this time around with a manufacturing partnership already lined up.\n\nAnd then some of the pot stocks, Aphria has good numbers and IIPR deals in buying properties for new dispensaries instead of dealing with the trickiness of making pot profitable. Should be a really great stock to have as legalization continues to expand\n\nAnd of course, my SPCE Virgin Galactic has had consistent growth with some exciting swells, but will only moon once they actually start giving space flight tours to the 600+ wealthy elite who've already reserved their tickets. But as it dips after every surge, it's a great time to get in.\n\n&amp;#x200B;\n\nClearly I'm very diversified but with a decent amount of risk",
        "created_utc": 1610936117,
        "id": "gjoejt9",
        "score": 43,
        "subreddit": "stocks",
        "created": 1610964917.0
    },
    {
        "author": "AdministrativeRub235",
        "body": "CITRON'S RECORD:\n\nSHORT:\n-NVDA\n-TSLA\n-UI\n-PTON\n\nLONG:\n-LK",
        "created_utc": 1611142630,
        "id": "gjxodyo",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1611171430.0
    },
    {
        "author": "sufcitybbq",
        "body": "I am a fucking idiot. I almost bought when it was around $17 but thought you retards were crazy. Just sold my positions in boomer Nvidia shares and got on the GME train at $31 bid. But to the moon right? 🚀🚀🚀",
        "created_utc": 1610554700,
        "id": "gj4ibqb",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1610583500.0
    },
    {
        "author": "GeneEnvironmental925",
        "body": "I feel like last week's run was based on the December delivery numbers...And they just killed it with NIO Day.  Was anybody expecting a partnership with Nvidia?!\n\nIn my amateur opinion, we're more likely to see $70 before $50.",
        "created_utc": 1610241305,
        "id": "gips60k",
        "score": 41,
        "subreddit": "stocks",
        "created": 1610270105.0
    },
    {
        "author": "brbcripwalking",
        "body": "Since market insider is a piece of shit and it crashed,\n\nI don’t know how pricing translates but here is Europe right meow. Keep in mind some of these could have changed while I was typing.\n\nTSLA is up 1.07%\n\nNVDA is up 0.71%\n\nAMD is up 0.46%\n\nAAPL is up 0.60%\n\nAMZN is up 0.68%\n\nGME is up 14.10%\n\nPYPL is up 0.35%\n\nRIOT is down 0.18%\n\nGM is up 0.24%\n\nNFLX is up 0.48%\n\nFB is up 1.86%\n\nMSFT is up 0.99%\n\nGOOG is up 0.51%\n\nNIO is up 0.62%\n\nBears are looking fuk",
        "created_utc": 1611041807,
        "id": "gjt55pa",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1611070607.0
    },
    {
        "author": "Scamazzed",
        "body": "Damn, I didn't know the Capitol was the location of the headquarters of NFLX, AAPL, and NVDA",
        "created_utc": 1609972315,
        "id": "gicsybb",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1610001115.0
    },
    {
        "author": "ActualWolverine",
        "body": "I just sold $3000 of my nvidia shares to buy 10 GME.",
        "created_utc": 1611954347,
        "id": "glahad5",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1611983147.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "Bough the fucking tech dip EOD. Nothing *too* short term given 3 day rule and all...\n\n* AMZN OTM Sep calls\n* NVDA March calls\n* AAPL leaps\n* FSLY leaps + March calls \n* BABA leaps\n\nI know financials and small caps are killing it but I just can't stop buying tech. Will probably add more to CRWD if I can get it under $200 again.",
        "created_utc": 1609979140,
        "id": "gid81do",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1610007940.0
    },
    {
        "author": "prettygurl_xoxo_luv",
        "body": "REMEMBER: Once you buy shares, you can hold them forever, for free. Shorts have to continuously pay lots of interest to keep their shares short sold.🍋🍋🍋🍋🍋🍋\n\nThere is literally no way for shorts to exit their costly positions without paying us, as long as we HOLD.💎💎💎💎💎💎🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼\n\nWhether it happens today in a giant spike, or in small steps over the next couple months, the shorts WILL pay out.🚀🚀🚀💎💎💎🚀🚀🌕🌕🌕🚀🚀🍋🍋\n\n#The amount of hatred I have for Citron is unhealthy. They have done this bullshit manipulation on almost everything I've invested. Shopify, Nvidia, NIO, PLTR, and now GME. Fuck these assholes and their blatant manipulative bullshit tactics and fuck those paper handed bitches that listen to a tweet from some group who have been wrong almost every time they opened their mouth.\n\n#Fuck you shitron I hope you shove that lemon so far up your ass that it gets stuck in your small intestine and shit literally start pouring from your mouth because you're so plugged from shoving lemons in your ass to tickle your prostate that the shit has nowhere else to go but up, just like GME 🚀 🚀 🚀",
        "created_utc": 1611248893,
        "id": "gk2upa4",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1611277693.0
    },
    {
        "author": "Turtlesaur",
        "body": "The year is 2030, you're shopping on Amazon to buy a new RTX 15080 graphics card from Nvidia. You go to cart. The total is .078 \n  \nYou realize it's priced in TSLA shares as the default currency.",
        "created_utc": 1610369006,
        "id": "givhizb",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1610397806.0
    },
    {
        "author": "dsyncd",
        "body": "AMD and Nvidia should have good earnings considered you can't buy any of their CPUs and GPUs since they are sold out.",
        "created_utc": 1611174299,
        "id": "gjzettl",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1611203099.0
    },
    {
        "author": "BigAlTrading",
        "body": "Yknow really starting to think pltr can be my ticket out of the bullshit after i did my very best to ignore appl, msft, googl, nflx, amzn, and nvda.\n\nAt least when I get rich now I will never forget how much better it is to be rich than to have some asshole 40 iq points below you tell you you're doing a bad job because he literally can't understand what you're doing.",
        "created_utc": 1609889932,
        "id": "gi8poat",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1609918732.0
    },
    {
        "author": "prettygurl_xoxo_luv",
        "body": "#MAKE THE SHORTS COVER. MAKE THEM GET MARGIN CALLED. MAKE THEM PAY US\n\nREMEMBER: Once you buy shares, you can hold them forever, for free. Shorts have to continuously pay lots of interest to keep their shares short sold.🍋🍋🍋🍋🍋🍋\n\nThere is literally no way for shorts to exit their costly positions without paying us, as long as we HOLD.💎💎💎💎💎💎🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼\n\nWhether it happens today in a giant spike, or in small steps over the next couple months, the shorts WILL pay out.🚀🚀🚀💎💎💎🚀🚀🌕🌕🌕🚀🚀🍋🍋\n\n#The amount of hatred I have for Citron is unhealthy. They have done this bullshit manipulation on almost everything I've invested. Shopify, Nvidia, NIO, PLTR, and now GME. Fuck these assholes and their blatant manipulative bullshit tactics and fuck those paper handed bitches that listen to a tweet from some group who have been wrong almost every time they opened their mouth.\n\n#Fuck you shitron I hope you shove that lemon so far up your ass that it gets stuck in your small intestine and shit literally start pouring from your mouth because you're so plugged from shoving lemons in your ass to tickle your prostate that the shit has nowhere else to go but up, just like GME 🚀 🚀 🚀",
        "created_utc": 1611335135,
        "id": "gk7cf3j",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1611363935.0
    },
    {
        "author": "JENINTECH",
        "body": "NVDA is also over $500 a share and options costing $1,000-5,000+ for one contract. Foh, most of us work Wendy’s sir",
        "created_utc": 1609530348,
        "id": "ghr39gp",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1609559148.0
    },
    {
        "author": "alcatrazcgp",
        "body": "Nvidia has been doing Self driving AI for years, and they are really good at it too. They simply don't have cars to do it on, and Partnering with NIO is pretty huge, since Nvidia will now have their software on actual driving cars because TESLA has millions of cars on the road constantly feeding to their DATA.\n\n\nNvidia gets data From NIO cars, and they both improved.\n\n\ntl;dr Nio to the moon",
        "created_utc": 1610210061,
        "id": "gio1gmh",
        "score": 30,
        "subreddit": "stocks",
        "created": 1610238861.0
    },
    {
        "author": "TheLooza",
        "body": "And is also building with Amazon the App Store for cars across manufacturers that is going to become a multi billion dollar business in just a few short years. This is AMD at two and Nvidia at 10",
        "created_utc": 1610787313,
        "id": "gjfr8rp",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1610816113.0
    },
    {
        "author": "Turtlesaur",
        "body": "This will be the death of the sub, brigading every idea that isn't inline with there own and suppressing new ideas.   \n  \nThe way this sub is today, this current GME craze would have never seen the light of day, snuffed out under AMD, NVDA, TSLA, PLTR spam.   \n  \nI'm 4 years+ on this sub and own GME and am holding it. I also own SLV because I have enough money to diversify. Going all in on 1 basket is something a single, middle to lower age 20s would do. Some of us have families. If I went all in on GME and something happened, I would likely get a divorce, lose my kids, be outcast by my family and have ruined my children's lovely hoods.  \n  \n  \nTl;dr this is a sub for ideas, and not everyone is you, in your immediate position.   \n  \n(50 GME at $212)",
        "created_utc": 1612103604,
        "id": "glhdguv",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1612132404.0
    },
    {
        "author": "prettygurl_xoxo_luv",
        "body": "#MAKE THE SHORTS COVER. MAKE THEM GET MARGIN CALLED. MAKE THEM PAY US\n\nREMEMBER: Once you buy shares, you can hold them forever, for free. Shorts have to continuously pay lots of interest to keep their shares short sold.🍋🍋🍋🍋🍋🍋\n\nThere is literally no way for shorts to exit their costly positions without paying us, as long as we HOLD.💎💎💎💎💎💎🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼\n\nWhether it happens today in a giant spike, or in small steps over the next couple months, the shorts WILL pay out.🚀🚀🚀💎💎💎🚀🚀🌕🌕🌕🚀🚀🍋🍋\n\n#The amount of hatred I have for Citron is unhealthy. They have done this bullshit manipulation on almost everything I've invested. Shopify, Nvidia, NIO, PLTR, and now GME. Fuck these assholes and their blatant manipulative bullshit tactics and fuck those paper handed bitches that listen to a tweet from some group who have been wrong almost every time they opened their mouth.\n\n#Fuck you shitron I hope you shove that lemon so far up your ass that it gets stuck in your small intestine and shit literally start pouring from your mouth because you're so plugged from shoving lemons in your ass to tickle your prostate that the shit has nowhere else to go but up, just like GME 🚀 🚀 🚀",
        "created_utc": 1611334092,
        "id": "gk78stb",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1611362892.0
    },
    {
        "author": "similiarintrests",
        "body": "I bought shop, AMD, Nvidia, paypal, tesla in 2015 because of Reddit.\n\nLife-changing sub",
        "created_utc": 1610179166,
        "id": "gimyq9a",
        "score": 29,
        "subreddit": "stocks",
        "created": 1610207966.0
    },
    {
        "author": "dadwhomstfucks12",
        "body": "Didn’t NIO just team up with NVDA for what seems like pretty much the same thing or am I losing my mind?",
        "created_utc": 1610261212,
        "id": "giqphna",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1610290012.0
    },
    {
        "author": "Darkside_Hero",
        "body": "This all happened because Nvidia and AMD didn't produce enough GPUs.",
        "created_utc": 1611949270,
        "id": "gla2dv8",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1611978070.0
    },
    {
        "author": "eblock10",
        "body": "Caring about actual share price is a novice move. It does not tell you anything about the actual company. Just because NVDA has a share price 4x that of AAPl doesn’t mean it’s actually worth more. Don’t worry about price and look at market cap that’ll give you a better picture.",
        "created_utc": 1610853929,
        "id": "gjjei3b",
        "score": 27,
        "subreddit": "investing",
        "created": 1610882729.0
    },
    {
        "author": "bodmonstyle",
        "body": "Citron tried this shit with Shopify and Nvidia — manipulate for short term and then they both 🚀 afterwards...",
        "created_utc": 1611069800,
        "id": "gju5sdt",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1611098600.0
    },
    {
        "author": "75DeepBlue",
        "body": "Does this mean my NVDA put will print Monday?",
        "created_utc": 1610207285,
        "id": "ginw8cd",
        "score": 27,
        "subreddit": "StockMarket",
        "created": 1610236085.0
    },
    {
        "author": "gorays21",
        "body": "Tough to pick only 5 but these stocks have high return potential with some risk involved:\n\n* Square\n* Cloudflare\n* AMD\n* NVIDIA \n* Sea limited\n* Fastly\n* Nio\n* Palantir\n* ICLN\n* Draftkings",
        "created_utc": 1609735343,
        "id": "gi1cecj",
        "score": 27,
        "subreddit": "stocks",
        "created": 1609764143.0
    },
    {
        "author": "Jujugatame",
        "body": "Nio is the only one to have Battery as a Service.\n\nAlso the nvidia partnership just announced.",
        "created_utc": 1610458553,
        "id": "gizxmje",
        "score": 26,
        "subreddit": "investing",
        "created": 1610487353.0
    },
    {
        "author": "prettygurl_xoxo_luv",
        "body": "#MAKE THE SHORTS COVER. MAKE THEM GET MARGIN CALLED. MAKE THEM PAY US\n\nREMEMBER: Once you buy shares, you can hold them forever, for free. Shorts have to continuously pay lots of interest to keep their shares short sold.🍋🍋🍋🍋🍋🍋\n\nThere is literally no way for shorts to exit their costly positions without paying us, as long as we HOLD.💎💎💎💎💎💎🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼\n\nWhether it happens today in a giant spike, or in small steps over the next couple months, the shorts WILL pay out.🚀🚀🚀💎💎💎🚀🚀🌕🌕🌕🚀🚀🍋🍋\n\n#The amount of hatred I have for Citron is unhealthy. They have done this bullshit manipulation on almost everything I've invested. Shopify, Nvidia, NIO, PLTR, and now GME. Fuck these assholes and their blatant manipulative bullshit tactics and fuck those paper handed bitches that listen to a tweet from some group who have been wrong almost every time they opened their mouth.\n\n#Fuck you shitron I hope you shove that lemon so far up your ass that it gets stuck in your small intestine and shit literally start pouring from your mouth because you're so plugged from shoving lemons in your ass to tickle your prostate that the shit has nowhere else to go but up, just like GME 🚀 🚀 🚀",
        "created_utc": 1611337813,
        "id": "gk7ln8p",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1611366613.0
    },
    {
        "author": "HornedHiddenOne",
        "body": "NVDA",
        "created_utc": 1611033683,
        "id": "gjsum1q",
        "score": 25,
        "subreddit": "investing",
        "created": 1611062483.0
    },
    {
        "author": "prettygurl_xoxo_luv",
        "body": "I'll post this again.\n\nThe amount of hatred I have for Citron is unhealthy. They have done this bullshit manipulation on almost everything I've invested. Shopify, Nvidia, NIO, PLTR, and now GME. Fuck these assholes and their blatant manipulative bullshit tactics and fuck those paper handed bitches that listen to a tweet from some group who have been wrong almost every time they opened their mouth.\n\nFuck you shitron I hope you shove that lemon so far up your ass that it gets stuck in your small intestine and shit literally start pouring from your mouth because you're so plugged from shoving lemons in your ass to tickle your prostate that the shit has nowhere else to go but up, just like GME 🚀 🚀 🚀",
        "created_utc": 1611094333,
        "id": "gjvnoro",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1611123133.0
    },
    {
        "author": "ra246",
        "body": "This is essentially what every reply said to Citron’s tweet regarding GME yesterday. There were quite a few more similar examples(Nvidia being one) they shorted around $120? I think. Then Nvidia is now up at $521",
        "created_utc": 1611141514,
        "id": "gjxn5aa",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1611170314.0
    },
    {
        "author": "nerd_moonkey",
        "body": "And now Shitron is pumping BB saying it’s the next Nvidia WTF",
        "created_utc": 1611215370,
        "id": "gk1hlzr",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1611244170.0
    },
    {
        "author": "prettygurl_xoxo_luv",
        "body": "#MAKE THE SHORTS COVER. MAKE THEM GET MARGIN CALLED. MAKE THEM PAY US\n\nREMEMBER: Once you buy shares, you can hold them forever, for free. Shorts have to continuously pay lots of interest to keep their shares short sold.🍋🍋🍋🍋🍋🍋\n\nThere is literally no way for shorts to exit their costly positions without paying us, as long as we HOLD.💎💎💎💎💎💎🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼\n\nWhether it happens today in a giant spike, or in small steps over the next couple months, the shorts WILL pay out.🚀🚀🚀💎💎💎🚀🚀🌕🌕🌕🚀🚀🍋🍋\n\n#The amount of hatred I have for Citron is unhealthy. They have done this bullshit manipulation on almost everything I've invested. Shopify, Nvidia, NIO, PLTR, and now GME. Fuck these assholes and their blatant manipulative bullshit tactics and fuck those paper handed bitches that listen to a tweet from some group who have been wrong almost every time they opened their mouth.\n\n#Fuck you shitron I hope you shove that lemon so far up your ass that it gets stuck in your small intestine and shit literally start pouring from your mouth because you're so plugged from shoving lemons in your ass to tickle your prostate that the shit has nowhere else to go but up, just like GME 🚀 🚀 🚀",
        "created_utc": 1611334017,
        "id": "gk78mo9",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1611362817.0
    },
    {
        "author": "racks_on_giants",
        "body": "Of course IV is low for these boomer companies (exceptions: ARKW, NVDA)",
        "created_utc": 1610481225,
        "id": "gj18e3n",
        "score": 23,
        "subreddit": "smallstreetbets",
        "created": 1610510025.0
    },
    {
        "author": "NOTORIOUS187",
        "body": "The article OP posted states that NIO will be using their in-house driving algorithms on the NVIDIA processors, so not sure it really matters that NVIDIA’s own self driving development is behind",
        "created_utc": 1610211126,
        "id": "gio3j8g",
        "score": 23,
        "subreddit": "stocks",
        "created": 1610239926.0
    },
    {
        "author": "beckpiece",
        "body": "Sold my Nvidia and Microsoft to buy 44 more shares just now. Holy fuck I can’t believe I’m playing with my money like this.",
        "created_utc": 1611079769,
        "id": "gjurifs",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1611108569.0
    },
    {
        "author": "consygiere",
        "body": "Shitron is a fuckin loser. Imagine all your predictions were wrong 💀 this mf called NVIDIA “a casino” at $149. It’s at $517 now.",
        "created_utc": 1611070786,
        "id": "gju7u4h",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1611099586.0
    },
    {
        "author": "lowrankcluster",
        "body": "Nvidia is killin it. A lot of laptops are also coming with amd 5900 instead of Intel.",
        "created_utc": 1610566627,
        "id": "gj5981y",
        "score": 21,
        "subreddit": "stocks",
        "created": 1610595427.0
    },
    {
        "author": "Critical_Support9016",
        "body": "They just had NIO Day today, they released a new Sedan that looks amazing, a new battery, they have a battery lease plan, new battery changing stations and using NVDA chips for driver assist. If you plan to buy Monday better do it fast. Looking forward to Monday.",
        "created_utc": 1610228354,
        "id": "gip2vvw",
        "score": 21,
        "subreddit": "StockMarket",
        "created": 1610257154.0
    },
    {
        "author": "Coat_Dry",
        "body": "“Nobody drives anymore, there’s too much traffic”\n\nAMD shipped damn near 10Million PS5/Xbox chips, and they shipped as much GPU volume as NVidia while also eating into Intel’s market share.\n\nI heard they were TSMC’s biggest customer by volume(TSM is running at 120% capacity FYI). The world wasn’t prepared for COVID so supply lines are tight, but that means the 🚀🚀🚀isn’t going to be as big as it could be, not that it won’t happen at all.",
        "created_utc": 1611186330,
        "id": "gk04q35",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1611215130.0
    },
    {
        "author": "GradExMachina",
        "body": "Doubt.\n\n1. As long as x86 is the main platform for pcs, AMD needs Intel and Intel needs AMD because these two and only these two hold x86-84 and x86 licenses. (There's a chinese company that has x86-64 but it's irrelevant). Without one another, either will be treated as monopoly. The only scenario where this doesn't hold is when arm gets a proper footprint, but so far only NVDA and Amazon can be a challenge for x86 unless AAPL starts selling CPUs.\n2. The US govt will never let Intel sink, simply because they will keep contracts. They can not risk internal information leaking to other countries, especially regarding ring -1 (and even lower). That would open them to vulnerabilities.  \n3. Intel really loves backwards compatibility and so do governments.",
        "created_utc": 1610958729,
        "id": "gjpbvgp",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1610987529.0
    },
    {
        "author": "banditcleaner2",
        "body": "NVIDIA has still been on a tear this year. Yeah, their gains are no match for tesla, square, roku or crispr, but doubling in value amid a pandemic is still good. And nvidia is actually likely to hold their current valuation tbh",
        "created_utc": 1610207712,
        "id": "ginx0e2",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1610236512.0
    },
    {
        "author": "brbcripwalking",
        "body": "Do extensive DD, read charts, draw lines, look at institutional volume, check for dark pool activity, calculate options premium, check online retailers for stock and sales, look up hiring volume for and after the holidays, pull up short interest, research unusual options or whale activity, practical uses and customer base analysis, read tax and sec filings, triple check customer relations page, subscribe to RSS news feed, check for marketing costs, look out for price target changes, look at resume for C level executives, follow new product development cycles.\n\nNVDA call -$6336 (-19%)\n\n______\n\nSaw some fucking memes or something.\n\nGME call +$11600 (+311%)",
        "created_utc": 1610727401,
        "id": "gjctj6n",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1610756201.0
    },
    {
        "author": "mgm50",
        "body": "This is going to be biased because I work tech-side for the semiconductor design industry, so keep that in mind, but the sector is currently facing immense demand and is bound to grow even more in the next years.\n\nPart of the reason is that every single sector you mentioned is consolidating a reliance on customized chip building, to the point that even IBM, NVidia, Sony, etc. (all of the big players and most medium ones) now have contracts with companies whose sole purpose is to put a dozen of top researchers inside a room and come up with new designs and devices they can sell to the big players to fabricate. \n\nThe second part of it is that R&amp;D on fundamental electronics is speeding up as Moore's law comes to saturation, rather than slowing down. Spintronics, Photonics, Phononics are all words you'll soon be reading on the mainstream news as people develop neuromorphic computers to act as machine learning ASICs (application-specific integrated circuits), circuits that integrate with living tissue, electronic clothing, and so on. The pressure in our little corner of the industry is building up quite fast and we're having to train Phds on the fly to keep up with demand growth.",
        "created_utc": 1612093151,
        "id": "glgzycd",
        "score": 19,
        "subreddit": "investing",
        "created": 1612121951.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "AMZN 3700c and 4000c\n\nNVDA 540c \n\nAAPL 122 to 127.5c (this way i can sell weeklies against them if I have to)\n\nFSLY 100c and some 80-90c for March (just playing for a bounce on these)\n\nBABA 230c\n\nhonestly a cheaper play is probably ICLN/HASI monthlies which are cheaper but may keep pumping given market sentiment and all\n\ni took my ICLN gains intraday cuz i bought them in the AM, and reloaded Feb 32c x 10 before power hour. modest position all things considered. looking at AH I probably should have added more...",
        "created_utc": 1609980713,
        "id": "gidbenq",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1610009513.0
    },
    {
        "author": "hockeyfan1990",
        "body": "Thats huge for NVDA",
        "created_utc": 1610208778,
        "id": "ginyzyy",
        "score": 19,
        "subreddit": "stocks",
        "created": 1610237578.0
    },
    {
        "author": "cuki321",
        "body": "Nvda supplies autonomous driving platform; Qcom supplies 5G platform.",
        "created_utc": 1610264690,
        "id": "giqtj34",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1610293490.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "Every freaking dip bought this week worked out. Took gains yesterday from plays opened on [Tues EOD drill](https://www.reddit.com/r/wallstreetbets/comments/ks13de/reeeeeeeeecap_of_todays_market_driving_news_jan_6/gid81do/).\n\n* ~~AMZN OTM Sep calls~~\n* ~~NVDA March calls~~\n* ~~AAPL leaps~~\n* ~~AI Dec calls~~\n* ~~FSLY leaps + March calls~~\n* BABA leaps\n\nkept a few BABA leaps cuz the delisting crap is out of the way. Looking to bail at 250+ if it can ever close the gap.\n\nsold AI calls way too early yesterday at like +9% and +10% but it shot up to more than 20% during intraday high and continued the climb today. left like 3+k on the table but it is what it is.\n\nmarket may be back in EZ mode as its just non stop mooning every day. i'm sitting on more cash than ever though in my trading accounts beyond some plays still waiting for catalyst (GME/MT etc) and its getting harder to load up on some stuff given valuation.",
        "created_utc": 1610141263,
        "id": "gil3ls7",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1610170063.0
    },
    {
        "author": "Unemployed_Barnacle",
        "body": "Don't be scared of Shitron. He's a fat business ham that makes money manipulating the market with his bullshit. Remember - this is the idiot who took shits on Shopify and Nvidia.",
        "created_utc": 1611068845,
        "id": "gju3ube",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1611097645.0
    },
    {
        "author": "0toHeroInvesting",
        "body": "**AVGO** , TSM, **NVDA**, **AMD**, MU, **QCOM**\n\nI own the bolded out ones right now\n\nSOXX is a good ETF though",
        "created_utc": 1610547154,
        "id": "gj436av",
        "score": 18,
        "subreddit": "StockMarket",
        "created": 1610575954.0
    },
    {
        "author": "foonte",
        "body": "NIO w/ NVIDIA... what are your thoughts regarding this? Do you experts or seasoned traders think, price will go pretty high in coming months?",
        "created_utc": 1610367706,
        "id": "givf07h",
        "score": 17,
        "subreddit": "stocks",
        "created": 1610396506.0
    },
    {
        "author": "Mad_Pinckerton",
        "body": "Finally, he's out. This will improve things hopefully. Intel is still a struggling stock. Mobileye is their only upside at the moment. So far behind Amd that in 3 months I can see stock drop dramatically. They may beat earnings this quarter, due to AMD supply shortages, but after that with all new AMD laptops, consoles, Apple &amp; Microsoft designing own chips, Nvidia taking over enterprise. Sales &amp; revenue will decline for sure. Headed back down to $45-$46. I trimmed in December waiting for 2nd half of 2021 to revisit intel. I see SOXX etf the best chipmaker play of 2020 &amp; 21.",
        "created_utc": 1610553816,
        "id": "gj4gf7s",
        "score": 17,
        "subreddit": "stocks",
        "created": 1610582616.0
    },
    {
        "author": "llllllllllllllll12",
        "body": "\n\n5 years ago I had about $20k saved and decided it was time to start investing. I moved it into my E*Trade account and bought FANNG It worked well... but one stock in particular crushed it... $NVDA [in @$63] From that point forward I was chasing the fast money.\n\nI then decided to get approved for options, and  like most most of you, I wasn’t a retard (yet). I played it safe and bought LEAPs on $SQ [in @ $24] expiring 2 years out. Satisfied with this decision and it’s initial momentum I started studying up on options... when I came across /WallStreetBets.\n\nThe hype stock at the time was AMD... several others came and went. I saw so many people YOLOing on weeklies I thought it was hilarious and said I’d never do that.\n\nI did however become riskier with my trades... I got approved for margin and maxed out on FANG, bought more LEAPs and decided to put 10% of my portfolio on an $ADBE earnings with OTM calls... they printed... +700% or $15k in like 48 hours. It was my very first weekly... I was officially a retard.\n\nNow at this time, the Trump rally was like 18 months strong and every small dip recovered within a week... so I was sure at the next dip, \nI’d capitalize. At the time $AMZN was just on fire so at that next dip I bought $2000 OTM Calls expiring one month out... the EV on this was EXPENSIVE. So I was really pushing the limit.\n\nThen came the dip. (Summer 2018) Only this time, it didn’t recover, the market just sucked ass for like a week... I got margin called and had to sell all my stocks at a loss, but held on to all my options. The $AMZN call evaporated instantly. And by then I had lost like 2 years of gains $130k in about three days.\n\nAt that point I was terrified that the whole market was going to collapse... that there was something I was not privy to. Like the housing bubble of 2008... so I sold everything I had left, and stopped investing for a year.\n\nThe recovery came and went, the summer of 2018 just looked like a speed bump in hindsight. So I told myself I’d wait for the next dip... I was patient. \n\nWaited over a year and boy did that dip come. COVID-19... up 320% since COVID. Never had the courage to tell anyone about my shitty summer of 2018 until now... It’s a lesson I had to learn otherwise I’d still be trading like a lunatic until I hit a land mine. So those of you posting losses feeling like it’s the end of the world... 🍻cheers to getting your cherry 🍒 popped and welcome to /WallStreetBets\n\n\n** green line shows E*TRADE balance before it was merged into Robinhood.\n\n**TLDR - crazy gains 2 years ago trading like junior varsity retard, lost 80% in three days. Now making it back trading like a Varsity retard",
        "created_utc": 1611289214,
        "id": "gk54pl6",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1611318014.0
    },
    {
        "author": "prettyboyv",
        "body": "Actually shitron already posted a piece about BB and they are very bullish. Think BB could be the new Nvidia. Actually that is the only thing that gets me worried about my BB holdings😂😂. Nevertheless we going to 🚀🚀",
        "created_utc": 1611115115,
        "id": "gjwr43w",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1611143915.0
    },
    {
        "author": "get_MEAN_yall",
        "body": "Nvidia RTX ❌SOLD OUT  \n\nIntel 📉💀  FAKE CEO PUMP ❌\n\nAMD 🚀🚀🚀",
        "created_utc": 1611103785,
        "id": "gjw6cst",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1611132585.0
    },
    {
        "author": "xpriceaction",
        "body": "NIO PARTNERS WITH NVIDIA TO DEVELOP A NEW GENERATION OF AUTOMATED DRIVING ELECTRIC VEHICLES$NIO $NVDA",
        "created_utc": 1610202921,
        "id": "ginov20",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1610231721.0
    },
    {
        "author": "PanicAtTheFishIsle",
        "body": "Gunna need that Nvidia RTX3090 for fast response time, ray traced graphs aren’t going to draw themselves.",
        "created_utc": 1610444950,
        "id": "gizi1ux",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1610473750.0
    },
    {
        "author": "iawsaiatm",
        "body": "Holding NVDA is the smart choice right now correct?",
        "created_utc": 1610816619,
        "id": "gjh85gl",
        "score": 16,
        "subreddit": "stocks",
        "created": 1610845419.0
    },
    {
        "author": "sassyover123",
        "body": "Amazon multi year contract. Recently signed Sony partner/ Nvidia partner. Won against Facebook. I see this hitting high as $25 EOW and $40 EOM. As more people are realizing how valuable this\nCompany will become.",
        "created_utc": 1611473657,
        "id": "gkicaby",
        "score": 16,
        "subreddit": "stocks",
        "created": 1611502457.0
    },
    {
        "author": "Bonhomme7h",
        "body": "AMD dip? NVDA dip? ARKK dip? ***TSLA dip?!?*** \n\nI'm checking my old beloved tickers, look like I missed A LOT this week. They were... distractions.",
        "created_utc": 1612014800,
        "id": "gld82ul",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1612043600.0
    },
    {
        "author": "the_dean_list",
        "body": " \n\nSo for the past year or so I’ve become more knowledgeable and invested in the stock market. Through reading and watching YouTube videos online, I’ve taught myself technical analysis and the ability to distinguish well-run companies from bad ones. One company in particular that I’ve been following has been AMD.\n\nAMD is a company that is close to my heart and many of you as well because we use their products. Whether you’re PC Master Race or a console player, AMD has had a significant impact on your gaming life. With the release of their new Ryzen Zen 3 CPUs and 6 series graphics cards, they have completely turned the Computer &amp; Graphics industry on its head and are siphoning a growing percentage of market share from industry leaders such as Intel and Nvidia.\n\nThis became very evident when they announced their Q4 earnings report this past Tuesday. To put it simply, they CRUSHED IT. AMD’s revenue was up 45% in 2020, led by the growth of the companies server CPU and game console CPU segments which increased by 176% year over year.\n\nOn the earnings call, AMD’s CEO, Lisa Su, gave great guidance and announced AMD expects 37% revenue growth in 2021 despite supply issue concerns due to the pandemic.\n\nSo why am I writing all of this? Since AMD announced its earnings on Tuesday, the stock has plummeted almost 10 percent due to market manipulation. It’s no secret that large hedge funds are trying to cover the losses they’ve endured in stocks like $GME and $AMC by shorting well-performing stocks that retail investors are heavily invested in. And yesterday Robinhood facilitated this transfer of wealth by preventing retail investors from buying more than one share of $AMD at a time.\n\nHerein lies the problem. We are told in this country to pick ourselves up by our own bootstraps. To put in the effort and the work and you’ll be rewarded. But the events of the past week have made it evidently clear that the “American Dream” only applies to a select segment of the population. Because whenever the working class beats the rich at their own rules, they immediately change the rules to punish us. It’s honestly sickening.\n\nSo what can we do to combat this? Essentially, what the large hedge funds are doing right now is a high stakes game of rob Peter to pay Paul. They have lost billions in $GME and $AMC so now they are attacking (shorting) larger market cap stocks to make up the difference. WE CANNOT ALLOW THEM TO DO THIS. If we do not fight back, we will allow them to continue the status quo of changing the rules for their benefit.\n\nI am not a financial advisor, but we need to do what we can to protect companies such as $AMD and any of the other companies Robinhood has targeted over the past couple of days. If we’re able to beat these hedge funds at their own games, maybe our government can finally intervene, which could lead to policy reform/regulation that supports the retail investor. Maybe I’m being overly optimistic, but who knows. I think we really have a revolution on our hands here if this becomes a full fledged grassroots movement.",
        "created_utc": 1612048582,
        "id": "glf4tcw",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1612077382.0
    },
    {
        "author": "Koppdiesel",
        "body": "I have orders in standby for GME, AMC, BB, and NOK. Going to HOLD. Still hanging onto my AAPL and TSLA as well. NVDA needs to turn the corner!",
        "created_utc": 1611808667,
        "id": "gl1snjx",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1611837467.0
    },
    {
        "author": "billwaters",
        "body": "Can't believe I recovered my 86k loss  in the span of &lt;2 months. (still need to wait till next week to close it out but it's pretty much there).  Exclusively did NVDA put credit spreads like $20 otm every 2 weeks with all my capital. Can't wait to post some gain porn next week. The front page needs some more diversity in gain porn posts than just GM E\n\nNo meme stocks. No hype trains. Just a $40k deposit, an autist, a plan, and a dream.",
        "created_utc": 1611398589,
        "id": "gkcc48c",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1611427389.0
    },
    {
        "author": "codex_cz",
        "body": "Nio is now a partner of nvidia, many info’s were given during nio day about their innovative tech. \nThose calls are going to print next week target is 65 $ dollars up to 75$ within a month. Money printer goes ratatattatattatata",
        "created_utc": 1610204016,
        "id": "ginqlxs",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1610232816.0
    },
    {
        "author": "jasper_qc",
        "body": "Might not be to bad for NVDA holders, as they acquired ARM which I expect to benefit from Apple's move towards ARM based processors, and quite probably more companies who will follow.",
        "created_utc": 1611053479,
        "id": "gjthd3t",
        "score": 15,
        "subreddit": "investing",
        "created": 1611082279.0
    },
    {
        "author": "lethalentity",
        "body": "For 2021, I would focus on EVs (NIO has potential), solar energy sector ( try TAN the ETF), genomics (ARKG), and semiconductor (AMD, NVDA).\n\nThe blue wave would push for more clean energy and EVs. Semiconductors are good because of gaming and crypto mining, and genomics because it’s has so much disruptive innovation coming and cost cutting.\n\nI would do 5 stocks at most for your account size. Once you grow your account , you can slowly add, but I wouldn’t have more than 10 unless you hit 6 figures. I own some Of these tickers you mentioned. Good luck!",
        "created_utc": 1611233795,
        "id": "gk218zh",
        "score": 15,
        "subreddit": "stocks",
        "created": 1611262595.0
    },
    {
        "author": "BaseRape",
        "body": "Damn stock keeps dropping/flat.  Wake up nvda!",
        "created_utc": 1611038016,
        "id": "gjt0km9",
        "score": 15,
        "subreddit": "investing",
        "created": 1611066816.0
    },
    {
        "author": "bully_worm",
        "body": "I'm theta gangbanging NVDA right now and this is the confirmation bias I need 🫂",
        "created_utc": 1610322326,
        "id": "gitc9xg",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1610351126.0
    },
    {
        "author": "bestsparkyalive",
        "body": "You would not have held that to completion of your million dollar profit targets.   You would not.  If you constantly spend emotional capital reminiscent on what could have been, I don't think you would have had the mental fortitude to hold that long at the time. \n\nWe all suffer from this.  It's not only you it's human.  Growth from this place of mental suffering will come.  Just use this energy for something good.  Do some research.   Find the next big thing.  How is the current economic landscape about to shift?\n\nHow is the new administration and its policies going to affect things going forward?\n\nSo many questions... So many profitable answers to be had.  You got this.  Move on.  Tesla, NIO, PLUG, CVRS, STXS, AMD, NVDA, IVN, CRSP, SPWR, ENPH, and so much more comprise a list of stocks I either lost money on or sold for small profits like you did.  These stocks would have netted me incredible profits.\n\nBut thats ok.  We should be grateful we have the intelligence and the ability to find plays that will pay out down the road.  That we live lifestyles that let us spend money and multiply it.  There's so many people in the world who would kill for a chance to just get to study the market in your spare time as a hobby... \n\nLet's be grateful.  Don't be bitter.  Be grateful.  Sorry for the spew of words, I can just relate.",
        "created_utc": 1610240702,
        "id": "gipr0ng",
        "score": 14,
        "subreddit": "options",
        "created": 1610269502.0
    },
    {
        "author": "_sillycibin_",
        "body": "Tesla, it's not a car company!  It's cars PLUS AI/self driving, software as a service, and battery technology/supply.\n\nTesla is now worth more than Ford, GM, Honda, BMW, NVIDIA, AMD, Waymo, LG, and Panasonic combined.",
        "created_utc": 1610067041,
        "id": "gihmezn",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1610095841.0
    },
    {
        "author": "KaleidoscopeDan",
        "body": "I think getting too involved right off the bat is bad. I was checking prices dozens of times a day. I bought Nvidia for $160 a share and had 5 or 10 of them. Sold around 170 because I wanted to buy more Disney. Sold Disney at 140 because wife was nervous with the election. Had 100 AMD shares that dropped from 34 to 30 dollars in one day so I sold. Had 40 enphase I Purchased around $20 a share. Sold around 30. \n\nI’m an idiot.",
        "created_utc": 1610826788,
        "id": "gjhwbuf",
        "score": 14,
        "subreddit": "stocks",
        "created": 1610855588.0
    },
    {
        "author": "necrophrenic",
        "body": "Reposting these numbers for visibility. If Citron is bearish on a ticker, ignore that sad dumbass. He's actually really bad at this and him being bearish on something is bullish AF. A lot of them go to the fucking moon.\n\n\nHe tweeted to short:\n\n * PTON at 20 with price target of 5\n\n * NIO at 45 with price target of 25\n\n * TSLA at 180\n\n * NVDA at 150 with price target of 130\n\n * W at 85 with price target of 45\n\n * PLUG at $11 with price target of $7\n\n* SHOP at around $100-110 with price target of $60",
        "created_utc": 1611203202,
        "id": "gk11bd3",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1611232002.0
    },
    {
        "author": "kemar7856",
        "body": "when nvda got to 540 today I felt like eveything was going to be okay in life then instantly taken away from me",
        "created_utc": 1609812935,
        "id": "gi4x82n",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1609841735.0
    },
    {
        "author": "ganbaro",
        "body": "26 FTSE All World ETF. Single stocks: NXP,TSMC",
        "created_utc": 1609726896,
        "id": "gi0wgjo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609755696.0
    },
    {
        "author": "ganbaro",
        "body": "My FTSE All World ETF. Always has been, always will be. Wait I am lying, in the beginning it was a MSCI World ETF.\n\nFor single stocks: NXP,TSMC,Volkswagen",
        "created_utc": 1609726046,
        "id": "gi0urmd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609754846.0
    },
    {
        "author": "fetch_me_a_block",
        "body": "I LOVE TSM and it keeps inching higher.\n\nI’m gonna look at going into NXPI, AMAT, KLAC, and LRCX though.",
        "created_utc": 1609709448,
        "id": "ghzwcys",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609738248.0
    },
    {
        "author": "fetch_me_a_block",
        "body": "No doubt. NXPI, LRCX, and KLAC provide tools used in the foundry process. AMAT is a competitor.",
        "created_utc": 1609709701,
        "id": "ghzwwgj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609738501.0
    }
]