[
    {
        "author": "simplysufficient88",
        "body": "To be entirely fair here, this whole thing’s based on a really bad article title. Everyone’s quoting the CNN article that makes it sound as though the WFP director was claiming all you’d need is $6 billion to solve all hunger. When the actual statement he made was that it would help to fix the growth in world hunger issues we’ve seen recently, not that it would solve hunger entirely. He very specifically mentions that this is a one time donation that would help 42 million people that need immediate aid, but that wouldn’t be a long term fix. Even the CNN article itself now has a correction at the very bottom acknowledging this was a misleading title. \n\nObviously this is all an over simplification of the issue and you can’t just throw money at it to fix it, but the point he was trying to make wasn’t that one donation from one billionaire would permanently solve all hunger but that a one time donation from MULTIPLE of the world’s wealthiest individuals would help save a lot of people in the short term. I think that’s a pretty massive difference.",
        "created_utc": 1635772963,
        "id": "hivq68e",
        "score": 3191,
        "subreddit": "wallstreetbets",
        "created": 1635801763.0
    },
    {
        "author": "Radiant-Experience21",
        "body": "I need to learn how to read complicated texts. Simply88 is my teacher now.\n\nAnd besides, we all know that secretly there are quite a few bright cookies on this sub pretending to be degenerates ;-)",
        "created_utc": 1635775483,
        "id": "hivv6cp",
        "score": 95,
        "subreddit": "wallstreetbets",
        "created": 1635804283.0
    },
    {
        "author": "Naked_Apples",
        "body": "Right now someone is typing how the next crash is inevitable after blowing their account on tesla puts.",
        "created_utc": 1635773286,
        "id": "hivqsef",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1635802086.0
    },
    {
        "author": "Funktastic34",
        "body": "You guess first. If your guess is more than one penny off we audit you and now own your family",
        "created_utc": 1635770022,
        "id": "hivkykn",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1635798822.0
    },
    {
        "author": "jerseyse410",
        "body": "$7.6MM is probably going to be the estimated loss right now, but by the time they get done paying all the expenses associated with the transactions to offload the homes, the total loss will be the $9.xMM.",
        "created_utc": 1635771356,
        "id": "hivn91i",
        "score": 50,
        "subreddit": "StockMarket",
        "created": 1635800156.0
    },
    {
        "author": "flanflan5",
        "body": "Back in July 2020, my account was worth around 350k of TSLA but I lost 70k in one day from gambling. So I sold $700 Covered Calls expiring March 2022 for about $60k. \n\nI kept fucking up after that too and rolled my calls forward (sometimes at the same strike price) to make up for my gambling.\n\nI used to have 1500 shares at one point too. But now I'm down to 1200",
        "created_utc": 1635784440,
        "id": "hiwf7x2",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1635813240.0
    },
    {
        "author": "CodyPomeray_",
        "body": "ugh, I thought it was Certified Robinhood Accountant. Now I gotta re-read whole convo",
        "created_utc": 1635782746,
        "id": "hiwbb17",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1635811546.0
    },
    {
        "author": "DannyDirtStar",
        "body": "Back from yet another ban, turns out taunting the more fragile autists during the DWAC run up was unacceptable. I'll now begin my walk of atonement.\n\n*SHAME* 🔔\n\n*SHAME* 🔔\n\n*SHAME* 🔔",
        "created_utc": 1635761639,
        "id": "hiv9ffh",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1635790439.0
    },
    {
        "author": "chrisbe2e9",
        "body": "Because there are other coins that you can grab early. And if they ramp up a few thousand percent, that buy in price is worth it. \n\nRemember, this isn't investing. It's a casino. \n\nCheck out MANA (decenterland) for example. I bought in at a buck. It went up to 4.50 a few days later. Sold, made some money. Now i'm looking for the next one to swing. \n\nBut again, this isn't investing. So if that's more your thing. I would avoid crypto.",
        "created_utc": 1635775695,
        "id": "hivvmc4",
        "score": 32,
        "subreddit": "CanadianInvestor",
        "created": 1635804495.0
    },
    {
        "author": "SquirrelyInvestor",
        "body": "Kinda sad that 95% of spac talk is now just “which pump and dump should we all join next.”\n\nEven sadder is that it’s probably working out better than the “extensive DD” everyone used to post/talk/trade off of.\n\nHappy Monday everyone.",
        "created_utc": 1635772489,
        "id": "hivpaht",
        "score": 32,
        "subreddit": "SPACs",
        "created": 1635801289.0
    },
    {
        "author": "kstorm88",
        "body": "Holy shit I think people actually went out dressed up in wsb costumes... Fuck this place sucks now.",
        "created_utc": 1635761372,
        "id": "hiv94ff",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1635790172.0
    },
    {
        "author": "Minimum_Contributor",
        "body": "I too YOLO’d on a ton of chairs. The garage is full of chairs now but I haven’t seen a 1000% gain. Did I do it wrong?",
        "created_utc": 1635779787,
        "id": "hiw4kkb",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1635808587.0
    },
    {
        "author": "Humber221",
        "body": "Dont do anything.. study some.. you bought nio almost at an ath and now you want to sale at the lows. I don’t think it’s been 6 months since the ath… . just hold and average down. Nio is a good company..",
        "created_utc": 1635772753,
        "id": "hivprzd",
        "score": 28,
        "subreddit": "investing",
        "created": 1635801553.0
    },
    {
        "author": "quantomian",
        "body": "are you saying $100 now or\nin 2040?",
        "created_utc": 1635774339,
        "id": "hivsuq1",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1635803139.0
    },
    {
        "author": "HighPriestofShiloh",
        "body": "I still haven’t even seen an episode yet lol.  I guess it’s old now lol.",
        "created_utc": 1635774931,
        "id": "hivu1nh",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1635803731.0
    },
    {
        "author": "chrisg42",
        "body": "Give it time. I felt like they bought homes at their peak summer prices and now the prices are falling",
        "created_utc": 1635769990,
        "id": "hivkwon",
        "score": 23,
        "subreddit": "StockMarket",
        "created": 1635798790.0
    },
    {
        "author": "rioferd888",
        "body": "Who the fuck is buying all this TSLA...\n\nLike seriously..\n\nI love it but its just ridiculous now lol",
        "created_utc": 1635785147,
        "id": "hiwgvzt",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1635813947.0
    },
    {
        "author": "stumblios",
        "body": "Coke bought 15% of Bodyarmor in 2018, so they've had access to Coke's distribution network for a few years now. With this, they just bought the remaining 85%.",
        "created_utc": 1635780327,
        "id": "hiw5scq",
        "score": 21,
        "subreddit": "stocks",
        "created": 1635809127.0
    },
    {
        "author": "happy_facts",
        "body": "Yeah, now we just pay property taxes on top of income taxes, nothing like that right.",
        "created_utc": 1635778393,
        "id": "hiw1icv",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1635807193.0
    },
    {
        "author": "PhaseFull6026",
        "body": "people thought we'd have flying cars and shit in 2020. Now everyone thinks they're going to be living forever.",
        "created_utc": 1635760392,
        "id": "hiv80z8",
        "score": 20,
        "subreddit": "stocks",
        "created": 1635789192.0
    },
    {
        "author": "FallingSky1",
        "body": "I've been thinking SPY needs a pullback for weeks now and have avoided short term calls but it doesn't seem to be budging at all.",
        "created_utc": 1635771501,
        "id": "hivni3o",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1635800301.0
    },
    {
        "author": "AromaticWealth412",
        "body": "I’m almost a year in now (24) and I have learned a lot with just the experience. I’m still very new but as time goes on you start to pick up on things. Focus on a couple stock and just look them up. See when the earnings is and how the numbers are! I put about 10-15 hours of research in before pulling the trigger on LCID about a month ago and it feels good seeing returns based on a good company and not meme stocks",
        "created_utc": 1635763800,
        "id": "hivc266",
        "score": 17,
        "subreddit": "stocks",
        "created": 1635792600.0
    },
    {
        "author": "SavorySkills_",
        "body": "Tesla now accepting $TSLA as payment. 📈📈📈",
        "created_utc": 1635781809,
        "id": "hiw95pi",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1635810609.0
    },
    {
        "author": "Tfarecnim",
        "body": "Yeah no, there's way too many accounts trying to push this crap stock right before a share unlock.  Stop it.\n\nAsk yourself a question, if it is really such a great company, then why did 80% of shareholders turn in their shares for $10 rather than hold on to them?  There's a reason they are so high, and it's not because it's a great company at a low price.\n\nThis play isn't new and has been seen by many previously low float deSPACs such as OPAD, SPIR and IRNT.\n\nAs for my play?  I don't know when the unlock will happen, but I suspect it will be sometime between now and December, so in about a week or so, I will be picking up 15P and waiting for the inevitable drop that's implied by the warrant-common gap.\n\nRemember that the PIPE has a $10 cost basis and unlike dumb Redditors, they will take a guaranteed 80% return on an investment and won't diamond hand it to 0.  And relative to the current float, the PIPE is huge so the drop will be very big, possibly even below 10.\n\nSeriously, after GME everyone is always looking for the next \"squeeze\", but chances are, if you've just heard of it it's too late.\n\n\nWe are not here to carry your bags for you, stop gambling on garbage hoping for an unrealistic return and pick a solid company like SOFI.  Seriously, 2023 25c LEAPs on SOFI will print better than 90% of these shitty squeeze plays.  Sure it might not be the 500% returns in 2 weeks that people seem to be hoping for, but at least you won't be -70% after a month bagholding something that someone told you would go higher.",
        "created_utc": 1635769770,
        "id": "hivkjul",
        "score": 17,
        "subreddit": "SPACs",
        "created": 1635798570.0
    },
    {
        "author": "maejsh",
        "body": "Long NIO, they are growing, expanding, building and innovating, they and you got caught up in the hype, but now it should be a more healthy grow, they are still hurting from chinas regulations and from the anti china-pro us sentiment a lot of places, reddit most of all. \nHeard them named as a good play just this morning on a big investment podcast/live show here. Made me even more bullish.",
        "created_utc": 1635779498,
        "id": "hiw3xhu",
        "score": 16,
        "subreddit": "investing",
        "created": 1635808298.0
    },
    {
        "author": "lambo630",
        "body": "Oh no, TSLA dropped $20 and now is only UP $15 in pre-market. See how stupid y’all sound?",
        "created_utc": 1635770766,
        "id": "hivm8a6",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1635799566.0
    },
    {
        "author": "Mike82BE",
        "body": "Too dangerously close now to S1 and subsequent pipe dump. Better plays out there",
        "created_utc": 1635765646,
        "id": "hiveh34",
        "score": 15,
        "subreddit": "SPACs",
        "created": 1635794446.0
    },
    {
        "author": "RiverFrogs",
        "body": "Those are all under yum brands now but I could be missing something about if yum was just a spin-off or something",
        "created_utc": 1635784757,
        "id": "hiwfys6",
        "score": 14,
        "subreddit": "stocks",
        "created": 1635813557.0
    },
    {
        "author": "skyplt29",
        "body": "So...let me get this straight; during the last three months while TLRY and the sector were declining Cantor held their 18USD forecast.  Now TLRY is in the 10s and they revise to the 11s.  Methinks Pablo is not doing his job very well.  Or perhaps more realistic, some paying clients want to accumulate?  Free analyst advice is worth exactly what you pay for it...nothing.",
        "created_utc": 1635776099,
        "id": "hivwgno",
        "score": 14,
        "subreddit": "weedstocks",
        "created": 1635804899.0
    },
    {
        "author": "AboveAll2017",
        "body": "Tesla right now: “listen.. listen.. I am the market now”",
        "created_utc": 1635769115,
        "id": "hivjibh",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1635797915.0
    },
    {
        "author": "OSRSkarma",
        "body": "I would sell now while you are ahead my guy\n\nFirst one is free",
        "created_utc": 1635765962,
        "id": "hivewlt",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635794762.0
    },
    {
        "author": "kk7766",
        "body": "Elon Musk offers to sell Tesla stock 'right now' if UN can show how $6 billion would solve world hunger\n\nYou know he could actually do this lol",
        "created_utc": 1635781533,
        "id": "hiw8j4q",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635810333.0
    },
    {
        "author": "dbgtboi",
        "body": "bruh that was its PE this morning, its at 380 now, get with the times",
        "created_utc": 1635783067,
        "id": "hiwc1dc",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635811867.0
    },
    {
        "author": "WhyDude420",
        "body": "Who knew that a virus that would end up killing 740k+ Americans in under 2 years would be the best thing to ever happen to the stock market. Classic. Can’t wait for the documentaries years from now.",
        "created_utc": 1635785141,
        "id": "hiwgvh3",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635813941.0
    },
    {
        "author": "Deeperfuckinvalue",
        "body": "Well with IV off the roof , i doubt its a good time to buy now",
        "created_utc": 1635783279,
        "id": "hiwcizi",
        "score": 12,
        "subreddit": "options",
        "created": 1635812079.0
    },
    {
        "author": "Agirre8",
        "body": "OCGN is the move now.",
        "created_utc": 1635783642,
        "id": "hiwdcsa",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1635812442.0
    },
    {
        "author": "AnxiousScientistDude",
        "body": "Small cap is now considered $1.5B market cap, when it used to be $1.0B. Inflation's a bitch.",
        "created_utc": 1635751394,
        "id": "hiuyrc1",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1635780194.0
    },
    {
        "author": "chedrich446",
        "body": "Bro fuck AAL. I flew them last weekend and like always my flight got delayed 5 hours it ruined my weekend. Happens every single time I fly American. Delta or United only from now on.",
        "created_utc": 1635782621,
        "id": "hiwb0ta",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1635811421.0
    },
    {
        "author": "SmallHandsMallMindS",
        "body": "There are 3 ways to make money in the markets: Be smarter, Be Earlier, and cheat. Now you arent smarter, and you dont know how to cheat, so next time be early\n\nTLDR: Buy GME when its at 4$ instead of 400$, and youll be fine",
        "created_utc": 1635781496,
        "id": "hiw8g1u",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1635810296.0
    },
    {
        "author": "Far_Bass_7284",
        "body": "I see you now, works_best_alone.",
        "created_utc": 1635762136,
        "id": "hiva0e4",
        "score": 10,
        "subreddit": "StockMarket",
        "created": 1635790936.0
    },
    {
        "author": "Danlovestofly",
        "body": "Now we are talking!!",
        "created_utc": 1635781836,
        "id": "hiw97yg",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1635810636.0
    },
    {
        "author": "Deesco5",
        "body": "You missed the fact that Elon solved world hunger and TSLA shares are now the reserve currency for earth AND Mars",
        "created_utc": 1635784222,
        "id": "hiwepf8",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1635813022.0
    },
    {
        "author": "fugov",
        "body": "&gt;It seems like information is never free and it feels like everyone has a secret they want to sell you.\n\nThis is exactly the case. These people were at some point in time in the same place as you are now. They have put in a lot of work and probably lost a lot of money to get where they are now. Now they know a \"shortcut\" that they can teach you about, well not directly, just enough to keep you intrigued.\n\nProblem is, even if you buy their stuff, you will never be as good as them because what is missing is the foundation that they have build and the exposure to the topic that they got. It pays off to work and learn for yourself, even tho it is painful and dagerous and tedious af.\n\nYou will never become a great musician, artist, programmer or investor by watching videos. What will get you there is reading books and grinding. Grinding, grinding, grinding.\n\nAnd most people are not willing to do that. So doing that already will bring you in the top 1% of people who COULD be successful.",
        "created_utc": 1635766076,
        "id": "hivf25g",
        "score": 9,
        "subreddit": "stocks",
        "created": 1635794876.0
    },
    {
        "author": "msg582",
        "body": "Look at me Mods. This is the daily thread now.",
        "created_utc": 1635757219,
        "id": "hiv4q8r",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635786019.0
    },
    {
        "author": "bonejohnson8",
        "body": "Now I drive a Tesla and can't find oxys anymore.",
        "created_utc": 1635771243,
        "id": "hivn1uu",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635800043.0
    },
    {
        "author": "giggy13",
        "body": "Good day for renewables (ZCLN/HCLN) &amp; NOU.   \n\n\nVOYG did a 100% in a few days, now at 20$+ ps",
        "created_utc": 1635775185,
        "id": "hivuk6y",
        "score": 9,
        "subreddit": "CanadianInvestor",
        "created": 1635803985.0
    },
    {
        "author": "AlE833",
        "body": "You’ll probably start getting DMs/spam from people telling you they can find shares for you, like I am now",
        "created_utc": 1635778470,
        "id": "hiw1oj5",
        "score": 9,
        "subreddit": "stocks",
        "created": 1635807270.0
    },
    {
        "author": "SpacedSlayer",
        "body": "His point?\n\nSome big shot said: 2% of Elon's net worth would solve world hunger.\n\nElon said: show us all the math openly and I'll give the 2%.\n\nYou don't have to agree with someone to agree with their point. The guy talking about Elon's net worth needs to prove his point. Openly where everyone can judge it. That's the move right now.",
        "created_utc": 1635773415,
        "id": "hivr1dl",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635802215.0
    },
    {
        "author": "kk7766",
        "body": "When Tesla's market cap was the same as Walmart I thought it was over-valued. Now it's 3x as much as Walmart",
        "created_utc": 1635783534,
        "id": "hiwd3ts",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635812334.0
    },
    {
        "author": "Crowleyer",
        "body": "+$60 was reached due to hype, where Nio was portrayed as \"Chinese Tesla\". \nNow the narrative is different, because there are other competitors to bet on. It's a growing company, so I believe that stock has a potential for $50 EOY or in the next few months. For now, it will probably consolidate between $35-$45 for a while. \n\nI can be wrong tho.",
        "created_utc": 1635768266,
        "id": "hivi7r4",
        "score": 8,
        "subreddit": "investing",
        "created": 1635797066.0
    },
    {
        "author": "supergnawer",
        "body": "I left my career of 20+ years in IT (including FAANG companies) and now I draw web comics. I had a burnout, took an year off, then applied to another company. Worked for 2 months, saw all the same bullshit, couldn't handle it anymore. Thankfully I have savings and I am fine with no income for now.",
        "created_utc": 1635755068,
        "id": "hiv2ju4",
        "score": 8,
        "subreddit": "investing",
        "created": 1635783868.0
    },
    {
        "author": "The-Night-Raven",
        "body": "Well I suck at the casino market, so went to the real casino this past weekend made $4 grand and now dumping in the casino market this morning...what a vicious cycle.",
        "created_utc": 1635772758,
        "id": "hivpsb4",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635801558.0
    },
    {
        "author": "Clambucket1",
        "body": "Got some TSLA 11/12 1475c. So now it will tank",
        "created_utc": 1635775053,
        "id": "hivuahk",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635803853.0
    },
    {
        "author": "bifburger",
        "body": "Gonna be one of those LARGE times...\nGot LCID, MTTR, PLUG and MQ.\n\nNow open the Casino!",
        "created_utc": 1635768359,
        "id": "hivicrj",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635797159.0
    },
    {
        "author": "Leon2274",
        "body": "I forgot and had a wank this morning. I start now lol",
        "created_utc": 1635772187,
        "id": "hivoqf6",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635800987.0
    },
    {
        "author": "antelope591",
        "body": "Sold my Chinese stocks at the top last week then went all in a SPAC that's up 60% right now pre-market....wtf is this feeling? I usually just lose money.",
        "created_utc": 1635762411,
        "id": "hivaccd",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635791211.0
    },
    {
        "author": "420Secured",
        "body": "Man I changed my username when 420 was just a pipe dream and Elon got investigated by the SEC for it. Now look, my little TSLA is all grown up!",
        "created_utc": 1635770676,
        "id": "hivm2mr",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635799476.0
    },
    {
        "author": "maz-o",
        "body": "now of all times?",
        "created_utc": 1635781700,
        "id": "hiw8wog",
        "score": 8,
        "subreddit": "stocks",
        "created": 1635810500.0
    },
    {
        "author": "GeorgeWashingtonTFP",
        "body": "Lol no daily thread. Top confirmed, mods were paid to not post daily thread so now no one knows what's going on. ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)",
        "created_utc": 1635757196,
        "id": "hiv4pdg",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635785996.0
    },
    {
        "author": "mousepop321",
        "body": "https://www.reddit.com/r/wallstreetbets/comments/qjxg0m/what_are_your_moves_tomorrow_november_01_2021/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf looks like I’m mod now 🥸",
        "created_utc": 1635757829,
        "id": "hiv5c8i",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635786629.0
    },
    {
        "author": "productivitydev",
        "body": "Do you think company as a whole has value? If not would you give any company away for free? And if the company has value, why wouldn't small piece of that have value?\n\nBut of course... I understand why you are asking this question. Because if you just buy a stock and you let it stay there, unless the company gives dividends you will receive nothing in return. So you agree that a company that gives dividends does have value? Let's say a company that gives 10% of dividends each year, will make you back that money in 10 years and from there everything else is a bonus.\n\nNow. What is the reason why every company doesn't give dividends? The reason is growth. They and their shareholders both think it's better to invest the potential dividends back into growing the company. \n\nBut the company always will have \"potential\" to give out dividends, once they decide they don't need to grow anymore - they could start giving out dividends, but meanwhile you can think of dividends as constantly being automatically invested back into the company, however due to company growing the potential also increases an you can still cash out the \"dividends\" by selling the stock at higher price due to potential of dividends having been grown.\n\nDoes that make sense?",
        "created_utc": 1635753072,
        "id": "hiv0idn",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635781872.0
    },
    {
        "author": "sherhil",
        "body": "Ok now I’m starting to not understand Tesla 🤔",
        "created_utc": 1635785362,
        "id": "hiwhe56",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635814162.0
    },
    {
        "author": "ShnyMnstr",
        "body": "Welp glad to see my SPY 460c that expired friday are good now 👍",
        "created_utc": 1635773848,
        "id": "hivrvhl",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635802648.0
    },
    {
        "author": "treebarkcharlie",
        "body": "Sold FUBO on Thursday and it's now up 11%. You're welcome to those who still own it",
        "created_utc": 1635780744,
        "id": "hiw6q2k",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635809544.0
    },
    {
        "author": "DovahkiinAF",
        "body": "Any commons with solid risk/reward left? DCRC and the crypto SPACs near $10 were great but they’re all at or over $11 now. I’ve scooped DMYQ as a similar play but I’m blanking on others.",
        "created_utc": 1635764136,
        "id": "hivchjs",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1635792936.0
    },
    {
        "author": "Investnew",
        "body": "What they list it for doesn’t matter right now. Every house in the neighborhoods I’m looking for are going well over ask like 20% or more.  \n\nThis article probably is a non story.  If the are listing houses 50k less than they paid and they end up going for 200k more than they list, it’s a win.",
        "created_utc": 1635758024,
        "id": "hiv5jai",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635786824.0
    },
    {
        "author": "CalyShadezz",
        "body": "LCID is people looking for TSLA 2.0.\n\nI think most here understand that TSLA does a lot beyond their EV production and the market is pricing in a very optimistic future versus their other ventures (as well as increased auto sales).\n\nLCID is a luxury EV supplier. They have some positives in their tech but overall they're just an EV company. They're somewhere in the ballpark of 10k preorders.\n\nNow compare them to a company like Ford who has a similar market cap at the moment. Ford does about 4m in New vehicle sales per year. \n\nThink about that. The market is very irrational right now but nothing justifies LCID's current valuation besides \"Bro EV is the future, get the next TSLA before you miss out.\"\n\nI expect LCID will keep running tho...the market seems to love high valuations with zero justification.",
        "created_utc": 1635770846,
        "id": "hivmd65",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635799646.0
    },
    {
        "author": "sloanemonroe",
        "body": "How do these two statements make sense?  1. All these cnbc people have said for 1.5 years is that due to QE of $120b per month the market will keep going up. And now, they all say tapering down of QE won’t make a difference. My dumb mind can’t see how both can be true.",
        "created_utc": 1635783602,
        "id": "hiwd9gr",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635812402.0
    },
    {
        "author": "slammerbar",
        "body": "Good Morning!!!\n\nMcDonald’s is now selling a McRib NFT. https://wordpress.futurism.com/mcdonalds-mcrib-nft",
        "created_utc": 1635750255,
        "id": "hiuxjo7",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1635779055.0
    },
    {
        "author": "wafflepiezz",
        "body": "Of course, after I lost $20k on Microvast $MVST, now it seems that things are starting to pick up.\n\nI hope my $3k in March 2022 calls can make it all back lol",
        "created_utc": 1635766202,
        "id": "hivf8cl",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635795002.0
    },
    {
        "author": "SwetzAurus",
        "body": "do you have a structured settlement, but need cash now???",
        "created_utc": 1635776847,
        "id": "hivy3is",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635805647.0
    },
    {
        "author": "Olgrateful-IW",
        "body": "Your entire make believe scenario belies the fact that every other first world free nation pays better and closer to (and above) a living wage and the world didn’t end as a result. Every little business didn’t shut down. \n\nIt turns out when people have actual purchasing power instead of barely affording the means to live (or not affording it) despite working full time that they are then able to support the very businesses they can’t afford to shop at now. The small ones.\n\nWhat doesn’t track is the American attitude that “this is the best it could work” that you seem to have when other places are literally doing it all better. Better wages, economies for the middle class, healthcare, and overall financial security.\n\nThe irony of what you are worried about is currently happening under the system we have now. But due to a total lack of regulation. Giant companies crushing start ups. Giant companies treating their employees poorly. Monopolies and to big to fail due to lack of regulations and mergers being allowed that shouldn’t. \n\nUnregulated capitalism is causing all the things you FEAR fair wages would create. \n\nIsn’t that funny? But I’m out as this obviously not going anywhere productive.",
        "created_utc": 1635780645,
        "id": "hiw6hys",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635809445.0
    },
    {
        "author": "Zenstugus",
        "body": "If the market burst now what's the fed going to do? Dump even more money into the economy or let the country stagnate for the next decade?",
        "created_utc": 1635781304,
        "id": "hiw8069",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635810104.0
    },
    {
        "author": "Haratara1",
        "body": "Ocgn is exploding. This idiot has been telling you to buy for a week now.",
        "created_utc": 1635773547,
        "id": "hivraje",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635802347.0
    },
    {
        "author": "SugarMapleSawFly",
        "body": "Everyone get in the ocean right now. Everyone. Now. If you’re alive after 48 hours, you can come back on land for the feast with the other champions.",
        "created_utc": 1635781903,
        "id": "hiw9dii",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635810703.0
    },
    {
        "author": "diamondhands95",
        "body": "**Get in OCGN now**",
        "created_utc": 1635782394,
        "id": "hiwaif3",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635811194.0
    },
    {
        "author": "TurielD",
        "body": "Yup, gpt burned on that kind of pullback last year. Take profits now and re-buy, there *will* be opportunity",
        "created_utc": 1635761082,
        "id": "hiv8sej",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635789882.0
    },
    {
        "author": "Semperfi74",
        "body": "PLUG/VLTA/CHPT/TSLA - and you still asking how to make money or go green today ??? C\\`mon ,tards,grab those now",
        "created_utc": 1635764958,
        "id": "hivdjpd",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635793758.0
    },
    {
        "author": "OogdayAyday",
        "body": "Bakkt is quite the weird one. It started off dumping and now it's halted at $43.06 after some sudden massive buy.\n\nThe price action on this one has been nothing short of stunning.",
        "created_utc": 1635774628,
        "id": "hivtff8",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1635803428.0
    },
    {
        "author": "AboveAll2017",
        "body": "How I have not been assigned my $970 CC by now is beyond me",
        "created_utc": 1635781386,
        "id": "hiw86tb",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635810186.0
    },
    {
        "author": "sockalicious",
        "body": "That chart of market caps as red and green squares is interesting to stare at for a minute.\n\nTSLA is now as large as all other automakers put together.\n\nThe world's second largest automaker is NIO.\n\nMeanwhile, these long dated Ford calls I've been holding are quietly printing a little every week.  Ford is somewhere on this chart but its square is almost too small to see.\n\nI do go outside sometimes.  When I do, I see Toyotas and Hondas.  I see lots of Fords.",
        "created_utc": 1635780816,
        "id": "hiw6vsp",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635809616.0
    },
    {
        "author": "Scatamarano89",
        "body": "Now i don't know jack about this company etc but i know that gambling is something you should always invest on, on par with guns and Becky",
        "created_utc": 1635759552,
        "id": "hiv74fh",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635788352.0
    },
    {
        "author": "SarcasticTrumpet",
        "body": "I want to believe in SPY right now but I have an itch I'm going to actually listen to this time, for better or worse",
        "created_utc": 1635778983,
        "id": "hiw2sww",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635807783.0
    },
    {
        "author": "LastPotato1214",
        "body": "I think people waited fearing a pipe dump, and now are fomoing in.\n\nWarrants haven't been called, some pipes still locked up, and insider's have actually just added.  (Nea)",
        "created_utc": 1635763156,
        "id": "hivb919",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1635791956.0
    },
    {
        "author": "upbeat_controller",
        "body": "Dead money, like almost all pre-DAs right now",
        "created_utc": 1635771632,
        "id": "hivnqbf",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1635800432.0
    },
    {
        "author": "startsmall_getbig",
        "body": "Any good LEAP to get right now to get started?",
        "created_utc": 1635773056,
        "id": "hivqcmo",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635801856.0
    },
    {
        "author": "eireks",
        "body": "it has been accepted, DCRCW will now moon 50% from here",
        "created_utc": 1635770264,
        "id": "hivld6o",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1635799064.0
    },
    {
        "author": "A-SPAC_Rocky",
        "body": "Now we go up?",
        "created_utc": 1635779268,
        "id": "hiw3f8w",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635808068.0
    },
    {
        "author": "GenghisFrog",
        "body": "I hate having money sitting not invested right now when the market is running wild. Busy at work and don’t have time to research anything. Arghhh.",
        "created_utc": 1635784207,
        "id": "hiweo2k",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635813007.0
    },
    {
        "author": "SamDeutschRich",
        "body": "just to mention that Cathie is unloading her position since two weeks now.",
        "created_utc": 1635781558,
        "id": "hiw8l6z",
        "score": 6,
        "subreddit": "options",
        "created": 1635810358.0
    },
    {
        "author": "Artistic_Data7887",
        "body": "That’s one thing that I feel a lot of people still haven’t fully realized. The fact that everyone has the ability to trade/invest at their finger tips now. Pairing that with low/no fees, and information being available almost instantly, should result in the roaring 20s 2.0…followed by…",
        "created_utc": 1635782092,
        "id": "hiw9tcq",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635810892.0
    },
    {
        "author": "SeanSeanSean94",
        "body": "Is that what they’re telling themselves now?",
        "created_utc": 1635779834,
        "id": "hiw4oec",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635808634.0
    },
    {
        "author": "CHAiN76",
        "body": "Well done holding. Hasn't always been easy. \n\n$1145 now in pre-market. $1250 this week?",
        "created_utc": 1635759427,
        "id": "hiv6zp2",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635788227.0
    },
    {
        "author": "Mike82BE",
        "body": "yes but I also feel too many people are trying to pump it now\n\nso someone wants to make a massive dump ;-) not only the shorts",
        "created_utc": 1635767806,
        "id": "hivhj7f",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1635796606.0
    },
    {
        "author": "Narradisall",
        "body": "Why did I make that 950 banbet against Tesla? Now I feel like a poor Michael Burry",
        "created_utc": 1635778770,
        "id": "hiw2cax",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635807570.0
    },
    {
        "author": "Itsnotjustadream",
        "body": "This is EXACTLY whats happening at my fortune 100 except last year they cut benefits and bonus effectively reducing our total comp by about 13-15 percent (the benefits were stellar.. WERE).  This year they were all SHOCKED that attrition in highly skilled areas hit 15-18% so to combat it they took their sweet ass time and decided pay raises were in order.  The CEO sent out a company wide email basically saying expect a conversation with your manager as we're making changes.\n\nThey touched only the areas with the highest attrition (about 60% of workforce) and the starting salary.  We now have folks who have been here 1-5 years who are going to make the same as a new hire.  We now have folks who have been here 10 years who are going to be making $1-$5 more than a new hire.  We now have specialized technical experts getting paid the same as a college hire.  Good luck if the bonus this year sucks because the folks I hang out with who were absolutely dedicated to making this a place we retired from are all tooling up and looking.",
        "created_utc": 1635775551,
        "id": "hivvbfu",
        "score": 6,
        "subreddit": "investing",
        "created": 1635804351.0
    },
    {
        "author": "Life_is_Truff",
        "body": "Wait, girls have brains now? Thanks article, this is very insightful hahaha",
        "created_utc": 1635776849,
        "id": "hivy3lr",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1635805649.0
    },
    {
        "author": "cnelson711",
        "body": "I'm all for house prices raising at or near the inflation rate.  But if my home value went up $100k because of the local market, it'd be bittersweet.  Yes, I picked the right market and am now a beneficiary of that market's appreciated prices.  But it also means my kids would have harder times affording a house.  It means if I wanted to move to a bigger house in the same area I'd have to pay a lot more.  It means more property taxes soon.",
        "created_utc": 1635771598,
        "id": "hivno78",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635800398.0
    },
    {
        "author": "Thanathos52",
        "body": "Why's the dialy thread hidden now or am I retarded?",
        "created_utc": 1635750077,
        "id": "hiuxcq7",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635778877.0
    },
    {
        "author": "Phrankespo",
        "body": "Its maang now, lmao!",
        "created_utc": 1635774930,
        "id": "hivu1lx",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635803730.0
    },
    {
        "author": "wildup",
        "body": "Snps, asml, amd, NVDA",
        "created_utc": 1635799562,
        "id": "hixg6t9",
        "score": 2,
        "subreddit": "investing",
        "created": 1635828362.0
    },
    {
        "author": "Bigman554",
        "body": "So when you’re SNPS tanks 20% in a period of a month. Are you buying more or waiting till it goes back up to buy?",
        "created_utc": 1636724576,
        "id": "hkbxle6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636753376.0
    },
    {
        "author": "bearcat2202",
        "body": "TWLO, they’re changing the way communications works. \nSNPS, their software helps chip makers innovate",
        "created_utc": 1636031278,
        "id": "hj9ztcz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636060078.0
    },
    {
        "author": "bearcat2202",
        "body": "What about $50B market cap with continued growth or earnings growth like TWLO or SNPS?",
        "created_utc": 1635854405,
        "id": "hj01wlr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635883205.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  2nd of November\n\n\n\n## Upcoming events for Tuesday, November  2nd\n\n - Expected earnings:\n\n  AAIC, ACH, ACOR, ACT, ADCT, ADXN, AFG, AGRX, AHH, AIZ, AKAM, AMCR, AME, AMED, AMGN, ANDE, APO, APPS, AQB, AQST, ARCB, ARGO, ARNC, AROC, ATVI, AVNS, AWK, AYX, BBGI, BCC, BFAM, BGFV, BHC, BKH, BLD, BLMN, BP, BRY, BSBR, BTG, BXC, CASA, CDK, CDLX, CEIX, CERS, CHCT, CHK, CIGI, CINR, CLNN, CLW, CMI, COP, COUR, CRK, CRSR, CRVL, CSLT, CTLT, CZR, DAR, DCO, DCP, DCPH, DD, DEA, DEI, DENN, DHT, DOX, DRRX, DS, DVN, EARN, EDU, EGHT, EIX, EKSO, EL, ELVT, ENLC, EOLS, EPD, ES, ESPR, ETN, ETRN, EXAS, EXEL, EXLS, EXPD, EXTN, EXTR, FMC, FNF, FRG, FRSH, FSTR, GAIN, GIC, GLDD, GLT, GLYC, GNRC, GNW, GPN, GPOR, GRBK, HALO, HCC, HEES, HEP, HLF, HLNE, HRB, HSC, HSIC, HURN, HY, IAA, IART, ICD, ICFI, ICHR, IDXX, IEP, INCY, INFI, INGR, INSP, INTG, INVE, IOSP, IPGP, IT, JBGS, JRVR, KAI, KAMN, KAR, KKR, KOPN, KTCC, LCII, LDOS, LEA, LGIH, LILA, LILAK, LIND, LPI, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, MANT, MCY, MDLZ, MDXG, MEC, METC, MG, MGNX, MGY, MIME, MINM, MKL, MLM, MMP, MOD, MPC, MPLX, MRCC, MRCY, MTCH, MTRN, MYGN, NAUT, NCSM, NE, NETI, NMIH, NNN, NP, NR, NRC, NRZ, NSA, NXRT, NXST, NYMT, OCN, OKE, OMCL, ORTX, OSPN, OVV, PAA, PACB, PAGP, PAHC, PAYC, PEAK, PEG, PFE, PINC, PIRS, PKI, PKOH, PMTS, PRO, PRTS, PRU, PTRS, PUMP, QUAD, RACE, RAMP, RARE, RCKY, RCM, RDN, RGNX, RIGL, RL, RM, ROK, RRR, RYAM, RYTM, SABR, SAGE, SEB, SEDG, SEE, SEVN, SFST, SGRY, SHIP, SKY, SKYT, SMCI, SNCY, SPLP, SPT, SQNS, SRC, SRCL, SREV, SRG, SRT, STAR, STE, STRL, TCS, TECH, TMUS, TMX, TNC, TRC, TRI, TRNS, TRTX, TSLX, TSQ, TTM, TVTY, TX, UA, UAA, UBCP, UFPT, UIS, UNM, USAC, USDP, UTL, VAL, VECO, VMD, VOYA, VRSK, VRTX, WAT, WBT, WEC, WEYS, WFRD, WLK, WLKP, WTI, WTTR, WU, XHR, XPO, XYL, Z, ZBRA, ZG, ZYME\n\n - Ex-div:\n\n  ASML, BRO, CAPL, CBAN, DSX, HFWA, LUB, MCBS, MKTX, MTX, NTIC, SSBK, TACO, TRS, USDP, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.090%)\n    - API Weekly Crude Oil Stock (previous: 2.318M)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - Redbook (previous: 15.6%)\n    - Total Vehicle Sales (previous: 9.66M)\n\n## Upcoming events for Wednesday, November  3rd\n\n - Expected earnings:\n\n  AAWW, ACA, ACEL, ACLS, ACNB, ACRE, ACRS, ADPT, AEE, AEMD, AFIN, AGIO, ALB, ALG, ALL, ALTM, AMOT, AMRN, AMSC, ANAB, ANSS, ANVS, APA, ARAY, ARC, ARTL, ARTNA, ASC, ASTE, ASXC, ATEX, ATGE, ATH, ATRC, ATXI, ATY, AUPH, AUTL, AVA, AVNW, AXGN, BBSI, BCRX, BCSF, BDC, BDSI, BGCP, BGSF, BIP, BKCC, BKNG, BLKB, BLUE, BNFT, BR, BRSP, BVH, BWA, CAKE, CBD, CCRN, CCU, CDAY, CDEV, CDW, CDXC, CENX, CF, CFMS, CGBD, CHNG, CIA, CIM, CIO, CIX, CKPT, CLH, CLR, CLVS, CMLS, CMP, COHN, CORT, CPE, CPK, CPRI, CPS, CRL, CRSP, CRTO, CSGS, CSTE, CSWI, CTRA, CTVA, CUTR, CVE, CVGI, CVS, CW, CWAN, CWH, CYTK, DFIN, DIOD, DISCA, DISCB, DISCK, DMAC, DNOW, DRTT, DXC, DXYN, EA, EAT, ECPG, EGY, ELA, ELF, EMR, EPR, EQH, EQIX, EQX, ET, ETR, ETSY, EVA, EVH, EVOP, EVRG, EVRI, EXC, EXPI, EYPT, FBRT, FDP, FLMN, FLT, FLXN, FNV, FOE, FORR, FOX, FOXA, FPH, FRGI, FRPH, FSLY, FSR, FUN, FYBR, GCP, GDDY, GDEN, GFL, GHC, GHL, GLBZ, GLRE, GMAB, GMRE, GNK, GRP.U, GTHX, H, HARP, HBB, HBIO, HBM, HBP, HDSN, HFC, HLMN, HMN, HR, HRTX, HST, HUBS, HUM, HZNP, IAG, ICLR, ICPT, ICUI, IIPR, IMXI, INFN, INMB, INN, INOV, INSG, IO, IONS, IR, ITI, ITIC, ITT, ITUB, IVR, JLL, JMP, KE, KIDS, KL, KLTR, KNBE, KPTI, KRO, KTOS, KW, LAMR, LANC, LAND, LBTYA, LBTYB, LBTYK, LCI, LCTX, LEXX, LHCG, LIVN, LL, LNC, LPG, LUMN, LUMO, LXRX, LYTS, MAC, MAR, MATX, MAXR, MCHX, MCS, MDU, MET, MFC, MGM, MGNI, MGPI, MGYR, MLNK, MLP, MLR, MNKD, MNRL, MPLN, MRO, MRTX, MTG, MTTR, MTW, NC, NCLH, NESR, NEXT, NFE, NHTC, NI, NL, NMFC, NODK, NRP, NSR, NUS, NVST, NYT, OAS, OCDX, ODP, ODT, OLP, OM, OMI, OMP, ONCS, ONCT, ONEM, OPRT, ORA, ORCC, OSUR, OSW, OTIC, PARR, PBI, PBPB, PCRX, PEN, PETQ, PFIE, PING, PK, PLMR, PLTK, PLYA, PRAX, PRG, PSN, PTC, PTGX, PTVE, PW, PXD, QCOM, QGEN, QLYS, QMCO, QNST, QRVO, QTWO, QUOT, RADA, RCII, RCKT, RDWR, REGI, RGLD, RGR, RMNI, RNWK, ROCC, ROKU, RPD, RPT, RRD, RTLR, RVI, RVLV, RVPH, RYI, RYN, SAFT, SANA, SAND, SB, SBGI, SBOW, SBRA, SD, SENEA, SENEB, SGC, SHOO, SITE, SITM, SJI, SKLZ, SLF, SLRC, SMG, SNSE, SPNS, SPNT, SPOK, SPPI, SPR, SPWR, SPXC, SRDX, SRPT, SSRM, SSSS, STAA, STGW, STLA, STN, SUM, SUN, SUNS, SUP, SUPN, SWM, SWN, SYN, SYNH, TALO, TARS, TBPH, TCON, TCPC, TGB, TISI, TLK, TNDM, TPC, TPVG, TREC, TRMB, TRNO, TRUE, TRUP, TS, TSP, TT, TTGT, TTWO, TUP, TWNK, TXG, UBX, UE, UEC, UGP, UHAL, UMH, UPLD, UTHR, UVV, VAPO, VEL, VGR, VIRT, VKTX, VMAR, VMEO, VNDA, VNTR, VRTV, VSH, VTOL, VVNT, VVV, WHD, WING, WK, WTS, YELL, ZD, ZY\n\n - Ex-div:\n\n  AWI, BBD, BBDO, BSMX, CATC, FELE, FMX, HESM, HOPE, NEP, STBA, WSFS\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 400K, previous: 568K)\n    - Crude Oil Imports (previous: 0.702M)\n    - Crude Oil Inventories (consensus: 1.567M, previous: 4.267M)\n    - Cushing Crude Oil Inventories (previous: -3.899M)\n    - Distillate Fuel Production (previous: 0.164M)\n    - Durables Excluding Defense (previous: -2.0%)\n    - EIA Refinery Crude Runs  (previous: 0.058M)\n    - EIA Weekly Distillates Stocks (consensus: -1.533M, previous: -0.432M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 0.4%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Factory Orders (consensus: 0.1%, previous: 1.2%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Fed Interest Rate Decision (previous: 0.25%)\n    - Gasoline Inventories (consensus: -1.200M, previous: -1.994M)\n    - Gasoline Production (previous: 0.012M)\n    - Heating Oil Stockpiles (previous: -0.031M)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 62.3)\n    - ISM Non-Manufacturing Employment (previous: 53.0)\n    - ISM Non-Manufacturing New Orders (previous: 63.5)\n    - ISM Non-Manufacturing PMI (consensus: 62.0, previous: 61.9)\n    - ISM Non-Manufacturing Prices (previous: 77.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.30%)\n    - MBA Mortgage Applications (previous: 0.3%)\n    - MBA Purchase Index (previous: 275.6)\n    - Markit Composite PMI (consensus: 57.3, previous: 57.3)\n    - Mortgage Market Index (previous: 645.1)\n    - Mortgage Refinance Index (previous: 2,763.8)\n    - Services PMI (consensus: 58.2, previous: 58.2)\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n\n^^^^2021-11-02",
        "created_utc": 1635847213,
        "id": "hizs3wm",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635876013.0
    }
]