[
    {
        "author": "NrdRage",
        "body": "If you're wondering why SPY is green but you're blood red, look at the SPY components.  \n\n  \nIf you're holding DISH Network, Facebook, Molson Coors, Generac, DXC, Kraft or Cincinnati Financial Corp with a little Comcast on the side, you're doing great because they're carrying the whole index.\n\n&amp;#x200B;\n\nWith the exception of FB, how many of those companies have you EVER invested in?  \n\n\nThat's why.",
        "created_utc": 1619724428,
        "id": "gwc1y6u",
        "permalink": "/r/wallstreetbets/comments/n11379/daily_discussion_thread_for_april_29_2021/gwc1y6u/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1619753228.0
    },
    {
        "author": "lenotme",
        "body": "what do we think about DXC future",
        "created_utc": 1619801095,
        "id": "gwfzhoy",
        "permalink": "/r/wallstreetbets/comments/n1qned/daily_discussion_thread_for_april_30_2021/gwfzhoy/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1619829895.0
    },
    {
        "author": "SmokinJoker46290",
        "body": "Holding GME and AMC has always been my move of everyday. But i also picked up calls for HPE today so we will see",
        "created_utc": 1618548229,
        "id": "guovce3",
        "permalink": "/r/wallstreetbets/comments/mrms60/what_are_your_moves_tomorrow_april_16_2021/guovce3/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1618577029.0
    },
    {
        "author": "The_Number_12",
        "body": "HPE - got it end of Jan and up now 32%  (bought at $12, it's at $15.87 now - cheap ass stock)\n\njust bought more because:\n\n1) It's on a fuckin' tear brah\n\n2) Dividend payment (why not, I'll take it)\n\n3) Compooters go boop. boop. People always like boop boop.",
        "created_utc": 1617818693,
        "id": "gtpqkog",
        "permalink": "/r/stocks/comments/mm5buv/rstocks_discuss_overlooked_stocks_wednesday_apr/gtpqkog/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1617847493.0
    },
    {
        "author": "ShadowSlave",
        "body": "LOOK ALIVE HPE fans! Here we go again! Let's break 16.10-16.14",
        "created_utc": 1619104217,
        "id": "gvga89g",
        "permalink": "/r/wallstreetbets/comments/mw1ekp/daily_discussion_thread_for_april_22_2021/gvga89g/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619133017.0
    },
    {
        "author": "chud69",
        "body": "MSFT $250c 4/9\n\nF $13.50c 4/9\n\nHPE $16c 4/9\n\n&amp;#x200B;\n\nTRVG $5p 4/16\n\nCS $11p 4/16\n\nAPTO $5p 4/16\n\n&amp;#x200B;\n\nRIP",
        "created_utc": 1617801585,
        "id": "gtoo3kb",
        "permalink": "/r/wallstreetbets/comments/mlyq20/daily_discussion_thread_for_april_07_2021/gtoo3kb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617830385.0
    },
    {
        "author": "Ironleg01",
        "body": "There are still reasonably valued equities. Mostly your usual value names, some older tech companies and there are few currently hated companies. \nValue ones are some defence names like GD or RTX, I think they are still cheap, there are others too. Then old tech companies (but not necessarily bad ones) are HPE, JNPR, CSCO and few others. Finally hated names (I love buying hated but good companies for cheap) are INTC, GM and few others. There are some special situations too (like VRSK still hasn't fully recovered) and internationally there are interesting equities as well priced cheap. Popular names are expensive but they are popular so... But if you look outside of what people talk about on Reddit you can find some value.",
        "created_utc": 1617914082,
        "id": "gtuqc5x",
        "permalink": "/r/stocks/comments/mmt6jd/what_stocks_are_actually_well_priced_or_even/gtuqc5x/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617942882.0
    },
    {
        "author": "Adlai8",
        "body": "HPE has been edging $16 for a month",
        "created_utc": 1618503323,
        "id": "gumb1zd",
        "permalink": "/r/wallstreetbets/comments/mrbmfj/daily_discussion_thread_for_april_15_2021/gumb1zd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618532123.0
    },
    {
        "author": "dr3amboy3657",
        "body": "Great list and some nice plays.  I got GD when it was 120, I don’t have it anymore. It made a nice gain on it.  Had and sold some HPE leap calls, made some profit but didn’t hold it long for more gains.",
        "created_utc": 1618910446,
        "id": "gv6lu03",
        "permalink": "/r/stocks/comments/mts4ne/what_under_the_radar_stock_have_you_been_buying/gv6lu03/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618939246.0
    },
    {
        "author": "kaybee513",
        "body": "As of 3/31 source data, BlackRock’s top 10 additions were CX, ISBC, HPE, EQT, FHN, SHLS, FECAX, HTH, CLNY, DCOM. Top 10 reductions were JNK, AMSIY, API, EXTN, PLYM, GIL, HEWJ, H, ACWV, EPI. They completely sold off their stakes in EWN, IBDU, XVV, IBHE",
        "created_utc": 1618842566,
        "id": "gv32gl8",
        "permalink": "/r/wallstreetbets/comments/mtk7tt/what_are_your_moves_tomorrow_april_19_2021/gv32gl8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618871366.0
    },
    {
        "author": "ShadowSlave",
        "body": "who else in HPE 🤑🤑🤑🤑",
        "created_utc": 1619020964,
        "id": "gvc50qb",
        "permalink": "/r/wallstreetbets/comments/mvcct1/daily_discussion_thread_for_april_21_2021/gvc50qb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619049764.0
    },
    {
        "author": "Ironleg01",
        "body": "I'm a contraction by nature so I really detest Reddits popular picks and try to find beatup and hated companies. Of course, the point is that the company is best up PLUS there is change happening. That's crucial. Another great things about those type of companies is that they are cheap. And it's really great, I love the hunt, I love the cheapness, I love the dividend, I love big margin of safety. Anyway, my few pics that worked out very well:\n\n**HPE.** People think that this is dying PC and printer company. It is not, that's HPQ. HPE makes hybrid cloud infra and freaking supercomputers. It was scary but I loaded up majorly at $9 a share. Can't complain.\n\n**GM.** You honestly could not mention GM here without being downvoted. You fool, it's all about Tesla, all that. Ok, that peaked my interest. I looked into it. Profitable business, amazing CEO, hard transition to EV only by 2030 and they announced that before it was trendy, making their own batteries, owns leading autonomous driving company, P/E ratio of 5. I mean, I was seriously thinking big I was insane or it everyone else. Been doing great so far.\n\n**HAS.** It's toys company, it's all about video games, it's stupid Boomer toys, yada yada. What I say was portfolio of amazing and loved IP, 3% dividend and P/E ratio of 15 (back then). Plus they own D&amp;D IP which is really hot right, licensing their IP to make video games and bought films studio to produce shows based on their IP. I'm very excited about Hasbro future and top up every time I they pay dividend.\n\n**GD.** Ok nobody said anything bad about GD. Well, nobody gave a shit about GD here ever. I've noticed it when share price was $130 and could not pass that kind of opportunity.\n\nAlright, I'll stop now. To be honest picks above have already played out by now so I'm just bragging at this point. I have a long list of other hated but profitable companies that I'm slowly building position in and I hope they will work out as well as the ones above.",
        "created_utc": 1618869993,
        "id": "gv4u70u",
        "permalink": "/r/stocks/comments/mts4ne/what_under_the_radar_stock_have_you_been_buying/gv4u70u/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618898793.0
    },
    {
        "author": "Adlai8",
        "body": "HPE finally punched thru 16 &amp; appears to be holding... MSFT feeling the pain though.",
        "created_utc": 1619120725,
        "id": "gvhdlgl",
        "permalink": "/r/wallstreetbets/comments/mw1ekp/daily_discussion_thread_for_april_22_2021/gvhdlgl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619149525.0
    },
    {
        "author": "felipunkerito",
        "body": "NVDA\nAMZN\nAAPL\nINTC\nTM\nGLW\nGOOG\nPHG\nDIS\nQCOM\nADBE\nHPE",
        "created_utc": 1618680533,
        "id": "guvlafc",
        "permalink": "/r/stocks/comments/msqx2g/5_stock_picks_for_the_next_5_years/guvlafc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618709333.0
    },
    {
        "author": "funinthesun1515",
        "body": "Friends, HPE was a short time ago upgraded by JPM, BAC, MA AND JEF.  Please read the facts on why it is a great stock on the HPE stock forum.",
        "created_utc": 1619264628,
        "id": "gvog26s",
        "permalink": "/r/wallstreetbets/comments/mxhrhs/most_anticipated_earnings_releases_for_the_week/gvog26s/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619293428.0
    },
    {
        "author": "Ironleg01",
        "body": "I've noticed you mentioned HPE. They are doing some really cool stuff for sure. On top of that they are profitable, pay dividend and trade really cheap at least now. I'm hoping that my HPE shares will do Microsoft-like comeback someday. In 5 years time I will either look very smart or very stupid. We will see.",
        "created_utc": 1617492464,
        "id": "gtamk3s",
        "permalink": "/r/stocks/comments/migc3s/anybody_else_betting_large_on_midcap_tech/gtamk3s/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617521264.0
    },
    {
        "author": "VikingzTV",
        "body": "$HPE, my tried and true money printer 🚀",
        "created_utc": 1617803357,
        "id": "gtorp7x",
        "permalink": "/r/wallstreetbets/comments/mlyq20/daily_discussion_thread_for_april_07_2021/gtorp7x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617832157.0
    },
    {
        "author": "VikingzTV",
        "body": "$HPE is my tried and true money printer with 14c weeklies 😂🚀",
        "created_utc": 1617632585,
        "id": "gtgfqzj",
        "permalink": "/r/wallstreetbets/comments/mkh463/daily_discussion_thread_for_april_05_2021/gtgfqzj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617661385.0
    },
    {
        "author": "funinthesun1515",
        "body": "HPE was recently upgraded by BAC MS JPM AND JEFFRIES",
        "created_utc": 1619271538,
        "id": "gvp3fd4",
        "permalink": "/r/wallstreetbets/comments/mxk1b9/east_side_distillery_and_their_recent_sec_filing/gvp3fd4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619300338.0
    },
    {
        "author": "AMediocreWhiteGuy",
        "body": "BASA\nFCEL\nGE\nGTE\nGOEV\nFSR\nHPE\nNAKD\nNOK\nPLUG\nRAND\nSPWR\nADMA\nFNCTF\nBE\nBLDP",
        "created_utc": 1618850378,
        "id": "gv3kppm",
        "permalink": "/r/stocks/comments/mts4ne/what_under_the_radar_stock_have_you_been_buying/gv3kppm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618879178.0
    },
    {
        "author": "suphater",
        "body": "I'm focusing on all of tech, but primarily companies I know. Even if Powell raises federal interest rates early and we have another setback, which he has said over and over he won't so I believe him, interest rates are going to be very low for a few years. \n\nFirst let me summarized why I believed the cycle was already on the verge of turning back to tech, posted earlier in the week in an Ark thread.\n\nDisclaimer, assume I have a position on every stock in this topic, even the retails.\n\nApple and Amazon started falling from their ATH quite awhile ago actually, before the rest of the tech correction. They bottomed out around 118 and 3000, both dipping below those marks even but not for long. Then they started to show resistance and basically trade sideways around 120 and 3050 while the rest of tech continued to sink, and finally early this week they were even rising and beating the market. This all showed a bottom out to me.\n\nDisney was my reopening stock, crushing it and breaking ATH. The news and this sub was all about DIS and other reopenings/retail/cyclicals. But then they started to fall back on positive earnings. They got a one hour bump from positive park news, the next time they got zero bump from positive park news, and they fell a good 10% from their ATH.\n\nBy the time Roku hit 300, Etsy below 200, SQ at 200, it was time to put all money possible in. Even if they keep going down, at that point I don't believe they can go too much farther, as they were at their prices from last Fall, much like Apple and Amazon had bottomed out there. These stocks are going to fall to summer prices while TGT soars indefinitely past its ATH high?  Fine I'll keep buying down, but I don't think so. Now we have lulu being shorted as soon as they beat earnings and there's nothing but positive news, the same thing that was happening to the companies like Apple a couple months ago.\n\nThe bond yields should climb some more and stabilize closer to 2, maybe even in the near future, so there might be some more choppiness ahead. I wouldn't be surprised if it's not even that bad and we already got most of that priced in though.\n\nFAANG of course is recommended, although I did think it was interesting Biden called out Amazon twice in the infrastructure speech and there may be bipartisan agreement against some of these companies. It's not like I see any major problems here, but I think their cash reserves will matter more in a year or so, so they're just buy as you can per usual.\n\nMy favorites are the household names or dependable tech stocks that are still way below their ATHs. I'm deep and long on Roku, just search the sub for the excellent DD about Roku if you don't really know what they're about. Their industry is mid-game, so room to grow, but also at a point where Roku has spent the money to secure their position, with an agreement with every major streaming service, pretty much every non-first or discount tier smart TV brand, and now their own advertisement company which is where their money flow will come, as they both help the streaming services make money while getting a cut. They crushed earnings and gave a better than expected outlook but fell $180, all I could post was to buy at point. They are not a gimmick, they are over 70% institutionally owned.\n\nSquare, PayPal, Zoom, Tesla, Etsy, Pinterest, pick your poison, there's more than I can think off the top of my head. I'm picking as many of these household tech stocks that have been around for years and will be around for years to come. I don't see a reason to get safer investments while these stocks are 50-75% from ATHs if you can ride it out long enough for them to climb again. I'll even throw out an Uber mention despite their bump in UK, because this is a household name product.  I hate apps, but I'm not deleting by Uber app anytime soon. Longevity and % of dip is what I'm focused on when it comes to taking on perceived risk.\n\nThen you can look at stocks I don't even like such as LMND and FSLY. Fastly is still almost 50% from its ATH, sure I'll take a small position there. A short time of rising with the rest of the market and one positive news story and they'll be back to at least $85 or $90, surely.\n\nPeople are over the semiconductor shortage by now after MU yesterday, right? Surely semiconductors, ev charging, clean energy, uranium, etc has room to climb even if they can't boom as fast as they did previously? \n\nSoftware companies? Sure. HPE was unaffected lately.check that chart. I guess it's because they pay dividends, all I know is they're working on every futuristic cloud and software idea. I won't even talk someone out of PLTR, we know it's going to continue being pumped daily on Reddit lol, but it's also by far the lowest Institutionally owned stock in this post I'm sure. MDB should be a good one again although it already got 8.5% since Thursday opening,it's 75% from its ATH and the company is going to be around for awhile.\n\nI don't know your companies, and I like to focus on what I know, but I will look into them too. I don't think this tech storm lasts too much longer, and regardless of how long it lasts I'm riding it out if I believe the company will be a well known name five years down the road.\n\nHappy day off everyone, hopefully the next quarter is good to you all. Just get SPY or something if you want to safely grow your money, I think that route will be very good to you this year and beyond as well.",
        "created_utc": 1617366410,
        "id": "gt4un4w",
        "permalink": "/r/stocks/comments/migc3s/anybody_else_betting_large_on_midcap_tech/gt4un4w/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617395210.0
    },
    {
        "author": "spac-master",
        "body": "SCLE?\n\n350M\nAndrew Shapiro (Founder/MP, Broadscale; Founder, GreenOrder; Fmr Director, Blink Charging), Betsy Cohen (Founder/Fmr CEO Bancorp; Director, FinTech Acquisition I, II, III), Raymond Lane (Fmr COO, Oracle; MP, GreatPoint Ventures; Director, Beyond Meat and Hewlett Packard Enterprise)",
        "created_utc": 1617958479,
        "id": "gtwsl9i",
        "permalink": "/r/SPACs/comments/mmyttr/impossible_foods_explores_spac_or_ipo/gtwsl9i/",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1617987279.0
    },
    {
        "author": "funinthesun1515",
        "body": "HPE WAS UPGRADED BY BAC, JPM, MS AND JEF, RECENTLY",
        "created_utc": 1619281081,
        "id": "gvq11ga",
        "permalink": "/r/wallstreetbets/comments/mxhrhs/most_anticipated_earnings_releases_for_the_week/gvq11ga/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619309881.0
    },
    {
        "author": "supershinythings",
        "body": "Full Disclosure:  Holding HPE, have been for over a year.  I have an interest in it going up.  There.  I said it.\n\nIronically, by not being greedy, you made more than if you had been greedy.\n\nYou're long-term greedy, not short-term greedy.\n\nI bought HPE near last year' bottom.  So far it's bounced back nicely - but each time I consider selling I think, \"Hey, I'm making 5.5% dividends on this, PLUS it keeps going up! If I sell I lose those dividends AND any additional gains!\"  So I hold.\n\nLong-term Greedy is Best Greedy.",
        "created_utc": 1619458974,
        "id": "gvycrv7",
        "permalink": "/r/stocks/comments/myvz3u/should_i_sell_at_a_loss_if_it_means_i_can_rebuy/gvycrv7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619487774.0
    },
    {
        "author": "funinthesun1515",
        "body": "A short time ago, HPE was upgraded by bac, ms, jef and jpm. Bac and JEF upgraded it to 20",
        "created_utc": 1619258251,
        "id": "gvnzejz",
        "permalink": "/r/wallstreetbets/comments/mxe7dz/why_am_i_still_holding_im_an_apeman/gvnzejz/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1619287051.0
    },
    {
        "author": "ShadowSlave",
        "body": "buckle up retards $HPE to the moon! ![gif](emote|free_emotes_pack|upvote)",
        "created_utc": 1619108933,
        "id": "gvglhl1",
        "permalink": "/r/wallstreetbets/comments/mw1ekp/daily_discussion_thread_for_april_22_2021/gvglhl1/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1619137733.0
    },
    {
        "author": "Abu-alassad",
        "body": "Hewlett-Packard",
        "created_utc": 1617288084,
        "id": "gt1acws",
        "permalink": "/r/wallstreetbets/comments/mhu8tg/gme_megathread_for_april_01_2021/gt1acws/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1617316884.0
    },
    {
        "author": "Present_Jello_3637",
        "body": "I'm balls deep in HPE. Tiblio play with bullish action. Taking my 105 contracts after I make profit tomorrow and go into GME!!",
        "created_utc": 1618520881,
        "id": "gunfkv8",
        "permalink": "/r/wallstreetbets/comments/mrms60/what_are_your_moves_tomorrow_april_16_2021/gunfkv8/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1618549681.0
    },
    {
        "author": "funinthesun1515",
        "body": "Friends, HPE was upgraded a short time ago by Bac, MS,  JPM, JEF and more.  BAC and JEF both raised it to 20.",
        "created_utc": 1619258038,
        "id": "gvnz243",
        "permalink": "/r/wallstreetbets/comments/mx1672/mindmed_to_be_listed_on_nasdaq_time_for_a_trip_to/gvnz243/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1619286838.0
    },
    {
        "author": "funinthesun1515",
        "body": "Friends, a  short time ago, bac, Jef, ms and jpm all upgraded hpe and raised its price target. Read about the facts on the hpe stock forum",
        "created_utc": 1619260251,
        "id": "gvo3rv4",
        "permalink": "/r/wallstreetbets/comments/mx3qzw/weekend_discussion_thread_for_the_weekend_of/gvo3rv4/",
        "score": -12,
        "subreddit": "wallstreetbets",
        "created": 1619289051.0
    },
    {
        "author": "Present_Jello_3637",
        "body": "I'm balls deep in HPE. Tiblio play with bullish action. Taking my 105 contracts after I make profit and go into GME!!",
        "created_utc": 1618520792,
        "id": "gunfdto",
        "permalink": "/r/wallstreetbets/comments/mrcp5k/gme_megathread_for_april_15_2021/gunfdto/",
        "score": -15,
        "subreddit": "wallstreetbets",
        "created": 1618549592.0
    }
]