[
    {
        "author": "SpoojUO",
        "body": "First of all, if this is your first valuation, that's really impressive. Are you a student? I love that you picked a sub 1 BN market cap, beaten up company in an obscure industry with hair on it. I have a few questions/problems regarding the analysis.\n\n\n&amp;nbsp;\n\n\n**Questions**\n\n\n1) This company has a long public history. You can pull financials back ~20 years. Why was this not included in your analysis? History is important and should always be a part of due dilligence.\n\n\n\n2) What happened to revenues from 2010-2012?\n\n\n\n3) In 2004, the company was doing 360m of operating cash flow. 17 years later they are doing half the number. Stock performance has been abysmal. It certainly hasn't been a compounder. If you are betting on this stock, you are betting on a change in the status quo. How has/will this business change going forward *for the better*? Has their revenue source changed? Change of management/strategy? Did legislation change/there are different opportunities now? Why is operating cash flow not going to be half of 150m 17 years from now?\n\n\n\n4) In 2004, book value was ~1B. Now it's 800m. Even if you could get confidence in a growing cash flow number, how does capital get allocated going forward? It appears the company predominantly did buybacks when it was a cash cow - which is just about the best thing it could have done in my opinion. Basically, if the best thing management can do with excess capital is return it to shareholders, that's not exactly an attractive attribute, and only offers room to screw things up. \n\n\n\n5) What is the TAM (total addressable market)? What are the competitive dynamics in the industry? How about the growth rate of the industry and penetration of PRDO? These are important questions to answer in order to get a handle on how they grow (shrink) over the next 5 years. \n\n\n&amp;nbsp;\n\n\n\n**Advice/Problems with Thesis**\n\n\n\n**You provide essentially no catalyst and conservatively project declining/stagnant margins/revenue.** However, your DCF shows upside. What your thesis posits is that market participants will decide to run a similar DCF on the company and the stock will re-rate. That isn't exactly compelling. Are you or are you not betting on the near term acceleration in free cash flow persisting? To me, understanding that is core to this thesis.\n\n\n\n**Your upside is 20-50%.** Again, how/why would this thing re-rate 50% upwards given all the hair on this business and revenue/cash flow is stagnant/declining? Even if it miraculously happens, you get a ~20% CAGR over 2 years on a business that could be a 0 if the government flicks a switch. Do I want to put my neck out and take that risk or buy a modestly-priced bonified wealth compounder with an established track record instead, for a similar CAGR?\n\n\n\n**You stumbled upon this company by running a quantitative value screen.** It is helpful to be cognizant of the significant drawbacks of sourcing your ideas with this method. Especially using 52 week lows/high ROIC/low valuation multiple... you are going to be left with a list of companies which investment managers threw out for deliberate *qualitative* reasons. But the companies look good *quantiatively*. For the stock to be a buy, you need to refute the negative qualitative perception, not emphasize the obvious quantiative attributes. You hit on the 90-10 regulation - but after spending an hour with this business I believe there are other significant factors (which I have alluded to elsewhere). \n\n\n\n**On the \"once it's fairly priced, I'm out\" mentality.** I feel that you gloss over a major problem being a short-term focused investor, buying a business like this. It is the line of reasoning which enables one to rationalize buying a business with a skeptical value add, dubious long term growth prospects, and unethical practices. It is a dangerous mentality for a value investor, in my opinion. **If the market decides to hate this company more and it sells off 50%, what are you going to do then?** If I am focused on the long-term potential of the stock, I can confidently hold and let compounding do its magic, maybe even buying more on a pullback. But if I know the truth is the long term picture is gloomy, then in the back of my mind, I know I am holding onto a melting ice cube... So will you buy more if it falls 50% or take a permenant capital loss?\n\n\n\n**Knowingly buying into an unethical business**. These businesses result in a type of self-selection bias in which lower-quality, unethical individuals tend to associate with it. That includes employees, management, suppliers - even customers and *investors*. Again - reiterating how significant that drawback is.\n\n\n\n**On margin of safety.** Margin of safety can be thought of quantiatively. I believe it is more prudent when thought of qualitatively. I'd be happy buying a company trading at 10x revenue and 100x net income if I am 99% confident in management's execution, TAM, product, growth prospects, and economics of an industry. However, I wouldn't touch a business trading at .5x book and 20% cash flow yield if management is shady, growth prospects/capital allocation isn't there, and the company is in the business of screwing over its customers. In my opinion - qualitative attributes is where you get true margin of safety.\n\n&amp;nbsp;\n\n\nAgain - great work. Thank you for the contribution, these are my favorite posts on this sub. Please note that regardless of my pushback the stock could do great. It's not compelling enough for me, however, and I believe this is a classic value trap. But I also note, with humility, that [I told the famous gamestop guy (DFV/RoaringKitty) that gamestop was a value trap in 2020.] (https://www.reddit.com/r/SecurityAnalysis/comments/i3m1pd/i_just_published_my_analysis_on_gamestop_gme_401/)",
        "created_utc": 1633623037,
        "id": "hfqrvtj",
        "permalink": "/r/SecurityAnalysis/comments/q39u0q/prdo_an_extremely_compelling_opportunity/hfqrvtj/",
        "score": 25,
        "subreddit": "SecurityAnalysis",
        "created": 1633651837.0
    },
    {
        "author": "10xwannabe",
        "body": "Here I will give you the keys to the kingdom for free (no costs).  Below is what I have learned matters to being rich.  Nothing more and nothing less.  \n\n1.  Get a good education in a high paying job you like so you can save to invest as much as you can.\n2. Asset Allocation is king and should be the major focus when investing\n3. Active management is a loser's game (picking stocks and market timing)\n4. Be cognizant of investing costs (loads/ 12b-1 fees, expense ratios), taxes, and inflation as they cut into long term returns.\n5. Stay the course, i.e. don't bail out when the bad times are sure to come.",
        "created_utc": 1635695405,
        "id": "hirxfbi",
        "permalink": "/r/investing/comments/qjrlv4/are_tradinginvesting_classes_worth_it/hirxfbi/",
        "score": 25,
        "subreddit": "investing",
        "created": 1635724205.0
    },
    {
        "author": "fufm",
        "body": "My god what an incredibly homosexual day. Thank god I have been too hungover to be cognizant most of the day",
        "created_utc": 1633983311,
        "id": "hg9q52b",
        "permalink": "/r/wallstreetbets/comments/q64csq/what_are_your_moves_tomorrow_october_12_2021/hg9q52b/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1634012111.0
    },
    {
        "author": "VisualMod",
        "body": "Ban Bet Created\n---\n**/u/meta-cognizant** bet **SPY** goes to **441.14395** in **2 days**",
        "created_utc": 1633838971,
        "id": "hg2dr4i",
        "permalink": "/r/wallstreetbets/comments/q45jst/weekend_discussion_thread_for_the_weekend_of/hg2dr4i/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633867771.0
    },
    {
        "author": "moYouKnow",
        "body": "Forward p/e based on 2022 estimated earnings was like 80 something before the most recent run up so now like 120.  Expensive yes but not totally nuts for the growth rate.\n\nI lived through the 2001 bubble and my dad always talked about the 1988 crash growing up so I’m cognizant of the possibility but regardless of the wider market conditions I think Tesla is the biggest company in the world in 5-10 years.  \n\nSure though if you’re planning to only hold this stock for a short term play you could easily get burned.",
        "created_utc": 1635556004,
        "id": "hil671l",
        "permalink": "/r/wallstreetbets/comments/qimdl4/tesla_will_be_the_worlds_biggest_company_sooner/hil671l/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635584804.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet\n---\n\n/u/meta-cognizant made a bet that SPY would go to 439.0 when it was 437.86 and it did, congrats retard.",
        "created_utc": 1633961342,
        "id": "hg8ady2",
        "permalink": "/r/wallstreetbets/comments/q5sih9/daily_discussion_thread_for_october_11_2021/hg8ady2/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1633990142.0
    },
    {
        "author": "ajenn22",
        "body": "Bonds have been tough past 10 years or so with Near zero interest rate policy since 08’ financial crisis. I have an all equity’s portfolio because of the lack consistent yields but I understand everyone’s risk tolerance and age makes that less ideal. Vangaurd offers some good total bond ETFs that range in type and risk. Generally lower credit rating will have higher yields as well as longer dated bonds. Be cognizant if those two factors when you restructure.",
        "created_utc": 1635713451,
        "id": "hit44nd",
        "permalink": "/r/stocks/comments/qjy8mc/bonds_distribution_in_401k/hit44nd/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635742251.0
    },
    {
        "author": "VisualMod",
        "body": "Ban Bet Created\n---\n**/u/meta-cognizant** bet **SPY** goes to **439.0** in **1 day**",
        "created_utc": 1633908474,
        "id": "hg5ydfe",
        "permalink": "/r/wallstreetbets/comments/q5fi8a/what_are_your_moves_tomorrow_october_11_2021/hg5ydfe/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633937274.0
    },
    {
        "author": "RedditSucksDickNow",
        "body": "&gt; rapid detection kit for bodily fluids &amp; any pathogen \n\nyeah, so when the last person spruiking this thing about a year ago caught my attention, they were talking about the development of a saliva covid test and possibly a blood prick covid antibody test.  This got me super hyped because I was really looking forward to having a cheap, easy test that anyone could administer that would allow people to be filtered in real time (and would have avoided the vaccination stigma mess that we're currently suffering through).  Unfortunately, this never materialized and, like so much of the above hope and promise, much of what is being sold to you in this post will never materialize.  Good luck to everyone and remember to always be cognizant of when you're being sold a story to part you from your money.",
        "created_utc": 1633693319,
        "id": "hfucxap",
        "permalink": "/r/investing/comments/q3jzi5/strongest_graphene_stock_for_2022_beyond_zen/hfucxap/",
        "score": 3,
        "subreddit": "investing",
        "created": 1633722119.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 26th of October\n\n\n\n## Upcoming events for Tuesday, October 26th\n\n - Expected earnings:\n\n  AAN, AAT, ABG, ACCO, ACH, ACU, ADM, AGR, AGYS, AHT, AKO.A, AKO.B, AKR, AMD, AMP, APAM, ARCC, ARCH, AUDC, AWI, AWRE, BEN, BGFV, BSBR, BUSE, BXP, BYD, CAC, CAJ, CB, CCB, CCBG, CCNE, CEQP, CHRW, CIT, CMRE, CNC, COF, CSGP, CVLT, CZOO, CZWI, DALN, DAN, DBVT, DHIL, DLR, EBMT, ECL, EDU, EGP, ENPH, ENTG, EQR, ESS, FBHS, FCBC, FCF, FCPT, FELE, FFIC, FFIV, FFNW, FFWM, FIBK, FRAF, FRBA, FRME, FSV, GBX, GE, GIC, GLW, GOOG, GOOGL, GPK, HA, HAFC, HAS, HBCP, HFBL, HIW, HNP, HONE, HOOD, HPP, HRZN, HSBC, HT, HUBB, HZO, IBCP, IEX, INMD, IVZ, JBLU, JNPR, KAI, LBAI, LBC, LBRT, LFUS, LLY, LMT, MANH, MASI, MKL, MMM, MMYT, MSCI, MSFT, MTDR, MYOV, NAVI, NBR, NBTB, NCR, NETI, NOV, NVS, OMAB, OVBC, OXSQ, PCAR, PCB, PEBO, PERI, PFG, PHM, PII, PJT, PNR, PROV, QS, QURE, RARE, RCKY, RNDB, ROIC, RRC, RRD, RTX, SBSI, SEB, SFBC, SFNC, SFST, SHW, SPFI, SPGI, SSTK, ST, TECK, TENB, TER, TPB, TRMK, TRTN, TRU, TTM, TWOU, TWTR, TXN, UBCP, UBS, UDR, UMBF, UPS, USNA, UTMD, V, VBTX, VNE, WIRE, WM, WNEB, WRLD, WSBC, WSR, XRX, ZWS\n\n - Ex-div:\n\n  AM, ATR, CLX, CMC, DNUT, ENTG, INFY, PSEC\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.310%)\n    - API Weekly Crude Oil Stock (previous: 3.294M)\n    - CB Consumer Confidence (consensus: 108.3, previous: 109.3)\n    - Dallas Fed Services Revenues (previous: 14.5)\n    - House Price Index (previous: 1.4%)\n    - House Price Index (previous: 19.2%)\n    - House Price Index (previous: 348.4)\n    - New Home Sales (consensus: 760K, previous: 740K)\n    - New Home Sales (previous: 1.5%)\n    - Redbook (previous: 15.4%)\n    - Richmond Manufacturing Index (previous: -3)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -3)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 1.5%, previous: 1.5%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 20.0%, previous: 19.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.5%, previous: 1.5%)\n    - Texas Services Sector Outlook (previous: 8.3)\n\n## Upcoming events for Wednesday, October 27th\n\n - Expected earnings:\n\n  ACBI, ACGL, ACNB, ADP, AEM, AEMD, AFI, AFL, AGI, AINC, AIT, ALG, ALGN, ALGT, ALKS, ALRS, ALSN, AM, AMSF, APH, AR, ARES, AROW, ARR, ASGN, ATNI, AVB, AVID, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BFIN, BG, BHE, BHR, BMRN, BMY, BOOT, BRKL, BSM, BSX, BWFG, BXMT, CACI, CADE, CAMT, CASH, CBD, CBTX, CCS, CDE, CHDN, CHEF, CHX, CINF, CIVB, CLB, CME, CMPR, CNMD, CNO, COFS, CONE, CPF, CPSH, CRSP, CSTM, CSV, CTS, CTSH, CUBI, CX, CYBE, CYH, DB, DGICA, DGICB, DMRC, DRE, DRVN, DT, DTE, DX, E, EAT, EBAY, ECHO, EHC, ENSG, EQC, EQT, ESI, ESRT, ETD, EVR, EVTC, EW, EXR, F, FARO, FBC, FCNCA, FDBC, FDP, FISV, FIX, FLEX, FLOW, FLS, FMNB, FNWB, FORM, FRBK, FRTA, FWRD, GD, GGB, GHM, GLOP, GM, GORO, GRMN, GSHD, GSK, GTY, HAYW, HBNC, HEES, HES, HESM, HLT, HOG, HVT, HVT.A, HWKN, IBA, ICLR, ILPT, INOV, INVA, INVH, IP, IRBT, IRT, ISBC, IVC, JAKK, JBT, JMP, JOE, KHC, KLAC, KN, KO, KRA, KRC, KRNY, LARK, LC, LEXX, LOB, MAA, MAS, MBIN, MC, MCD, MEOH, MHH, MHO, MKSI, MN, MNRO, MOH, MORN, MPX, MSA, MTH, MUSA, MXL, MYRG, NDLS, NFBK, NGVT, NLY, NMR, NOA, NOVA, NOW, NSC, NSR, NTB, NTGR, NYCB, OBNK, OC, ODFL, ODT, OII, ONCS, ORLY, ORN, PAG, PAYA, PB, PDM, PEGA, PGC, PGRE, PI, PINS, PLXS, PPC, PPD, PW, QCRH, R, RBBN, RDY, RE, RES, RIBT, RJF, ROCK, ROL, RVPH, RWT, SAVE, SC, SCI, SF, SIGI, SIM, SIMO, SIX, SLAB, SLGN, SMED, SMP, SNBR, SONY, SP, SPOK, SPOT, SREV, SRI, SSB, SSBI, STC, STCN, STLA, STXB, SU, SYBT, TDOC, TDY, TEL, TESS, TEVA, THFF, THG, TMHC, TMO, TNL, TROX, TTMI, TWLO, TYL, UCTT, UEC, UMC, UPWK, URI, USLM, UTHR, UVE, UVSP, VALE, VGZ, VICI, VIST, VKTX, VMAR, VNDA, VRT, VRTS, VSEC, WAB, WCN, WFG, WH, WHG, WOLF, XLNX, YNDX, YUMC, ZDGE, ZVO\n\n - Ex-div:\n\n  BPMP, COP, FRC, KNOP\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.990%)\n    - Core Durable Goods Orders (consensus: 0.4%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.715M)\n    - Crude Oil Inventories (consensus: 1.650M, previous: -0.431M)\n    - Cushing Crude Oil Inventories (previous: -2.320M)\n    - Distillate Fuel Production (previous: -0.289M)\n    - Durable Goods Orders (consensus: -1.1%, previous: 1.8%)\n    - Durables Excluding Defense (previous: 2.4%)\n    - EIA Refinery Crude Runs  (previous: -0.071M)\n    - EIA Weekly Distillates Stocks (consensus: -2.350M, previous: -3.913M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.1%, previous: -2.0%)\n    - Gasoline Inventories (consensus: -1.850M, previous: -5.368M)\n    - Gasoline Production (previous: 0.455M)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 0.6%)\n    - Goods Trade Balance (previous: -88.16B)\n    - Heating Oil Stockpiles (previous: 0.037M)\n    - MBA 30-Year Mortgage Rate (previous: 3.23%)\n    - MBA Mortgage Applications (previous: -6.3%)\n    - MBA Purchase Index (previous: 266.2)\n    - Mortgage Market Index (previous: 643.0)\n    - Mortgage Refinance Index (previous: 2,807.9)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Wholesale Inventories (previous: 1.2%)\n\n## Upcoming events for Thursday, October 28th\n\n - Stock splits:\n\n    - SSBI @ **110:100** (Payable date: 11/04/2021)\n\n - Expected earnings:\n\n  AAPL, AB, ABCB, ABMD, ABTX, ACHC, ADS, AEP, AGCO, AGL, AIRC, AJG, ALDX, ALGM, ALIM, ALNY, AMAL, AMT, AMZN, AOS, AQMS, ARGX, ASPN, ATEN, ATI, ATOM, ATR, AUY, AVNT, AVT, AVTR, AX, BAX, BC, BCLI, BIO, BIO.B, BPMC, BSIG, BSMX, BTU, BVN, BWMX, BY, CARR, CAT, CBRE, CBZ, CDNA, CFFN, CFR, CG, CHE, CHKP, CLVT, CMCO, CMCSA, CMS, CNOB, CNSL, CNX, CODI, COHU, COLB, COLM, COOP, COR, CPG, CPT, CRS, CTO, CUZ, CVEO, CVLY, CWST, CWT, DAIO, DBD, DECK, DQ, DRQ, DVA, DVD, DXCM, EB, EBC, EGO, EIG, EME, EMN, ENVA, ERIE, EVBN, EVLO, EXP, EXPO, FBIZ, FCN, FE, FHI, FISI, FLWS, FMX, FRST, FTAI, FTDR, FTV, FVCB, GILD, GLPI, GNCA, GPI, GSIT, GTX, GVA, HBAN, HIG, HLI, HSY, HTBK, HTGC, HTH, HUBG, HVT, HVT.A, ICE, IDA, IMAX, INSM, INT, ITGR, ITW, JHG, KBR, KDP, KEX, KMPR, KNSL, KRG, LADR, LAWS, LECO, LH, LIN, LKQ, LMAT, LOPE, LPLA, LTC, LTH, LVO, MA, MAYS, MCBC, MCO, MD, MDC, MDP, MERC, MGRC, MHK, MIXT, MMSI, MO, MPW, MPWR, MRK, MSBI, MSTR, MTLS, MVIS, NATI, NEM, NKSH, NLSN, NOC, NOK, NTST, NVCR, NVT, NXGN, OCFC, OFC, OPBK, OPI, OPK, OPRA, ORC, ORI, OSIS, OSK, OSTK, PACK, PATK, PBF, PBFX, PEB, PFC, PFHD, POLY, POWI, PRFT, PRLB, PSB, PTCT, PTEN, PVBC, QUMU, RDS.A, RDS.B, RGEN, RILY, RLGY, RMD, RNST, RS, RSG, SAH, SAIA, SBCF, SBFG, SBUX, SCM, SGEN, SHBI, SHEN, SHOP, SID, SILC, SIRI, SJW, SKX, SKYW, SM, SMMF, SNDR, SNY, SPNE, SPSC, SSNC, STAG, STM, SVBI, SWI, SWK, SYK, TAL, TAP, TAP.A, TARO, TBBK, TEAM, TEX, TFII, TFX, THRM, TIGO, TOWN, TPX, TREE, TRS, TVTX, TW, TXRH, TXT, ULBI, ULH, USAK, USCB, VC, VCRA, VLY, VRSN, WDC, WERN, WEX, WLTW, WNS, WRAP, WRE, WST, WTBA, X, XEL, YUM, ZEN\n\n - Ex-div:\n\n  AA, ACI, ADC, AGNC, AOS, ARC, BRMK, BSRR, CARR, CFG, CIT, COST, CRT, CSWI, DCP, DNP, DSX, EARN, EFC, EPD, EPR, FERG, FT, GEL, GRP.U, HMLP, KFFB, LEVI, LND, MAIN, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PRT, PSXP, PVL, PZN, RBNC, SBNY, SCHL, SCM, SIG, SJT, SKT, SLG, STAG, TRGP, UNB, UNM, VRTS, WHF, ZTS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 7-Year Note Auction (previous: 1.332%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 2,415K, previous: 2,481K)\n    - Core PCE Prices (consensus: 4.50%, previous: 6.10%)\n    - GDP (consensus: 2.7%, previous: 6.7%)\n    - GDP Price Index (consensus: 5.5%, previous: 6.2%)\n    - GDP Sales (previous: 8.1%)\n    - Initial Jobless Claims (consensus: 290K, previous: 290K)\n    - Jobless Claims 4-Week Avg. (previous: 319.75K)\n    - KC Fed Composite Index (previous: 22)\n    - KC Fed Manufacturing Index (previous: 10)\n    - Natural Gas Storage (consensus: 90B, previous: 92B)\n    - PCE Prices (previous: 6.5%)\n    - Pending Home Sales (consensus: 0.5%, previous: 8.1%)\n    - Pending Home Sales Index (previous: 119.5)\n    - Real Consumer Spending (previous: 12.0%)\n\n^^^^2021-10-26",
        "created_utc": 1635242415,
        "id": "hi3h3xm",
        "permalink": "/r/RobinHood/comments/qg314a/daily_discussion_thread_october_26th_2021/hi3h3xm/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635271215.0
    },
    {
        "author": "AxemanFromMA",
        "body": "u/AmeriMan2\n\n1.Build Back Better/Infastructure progress (not priced in). Dems will pump $ into economy. Remember when debt ceiling was passed and SPY didn’t react much? But when there was news that the public was non cognizant about, SPY popped an adderall IR 50 MG.\n\n2. Earnings and especially TSLA earnings. The public doesn’t take in account how much $ TSLA is saving and reinvest with no income tax in TX (not priced in). If you don’t believe me look at the chart, shit will break ATH EOW most likely.\n\n3. TA of SPY says we will be $460+ EOW. Did you see the joke of a dip near close and the 3.12 million buy order on SPY yesterday?\n\n4. No debt ceiling or reduction in interest rates\n\n5. Fed still thinks COVID is an issue, probably will be for 4 years IMO. When 9/11 occured, the after affects were ubiquitous for five years.\n\n6. Don’t bet against 🇺🇸. It’s been too long since we broke ATH = higher probability of breaking ATH.",
        "created_utc": 1634696539,
        "id": "hhbb6eo",
        "permalink": "/r/wallstreetbets/comments/qbjku7/what_are_your_moves_tomorrow_october_20_2021/hhbb6eo/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634725339.0
    },
    {
        "author": "odikhmantievich",
        "body": "I agree with you for once. Not about this stock in particular (I know nothing about it), but that a 10x gamble is inherently a long-shot. People want to believe in their bets but need to be cognizant of the risk they're taking on.\n\nTldr anyone trading stocks should [watch for the signs of compulsive gambling](https://www.investopedia.com/articles/investing/071713/downward-spiral-trading-addiction.asp)",
        "created_utc": 1634714059,
        "id": "hhc2xzg",
        "permalink": "/r/StockMarket/comments/qbkvxm/hmm_really_10x_thanks_for_the_tip/hhc2xzg/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1634742859.0
    },
    {
        "author": "User_Simulator",
        "body": "Things are not a big fan of her sticking with her thesis.\n\n ~ meta-cognizant\n\n-----\n\n[^^Info](https://github.com/trambelus/UserSim) ^^| [^^Subreddit](/r/User_Simulator)",
        "created_utc": 1634181768,
        "id": "hgkif2w",
        "permalink": "/r/wallstreetbets/comments/q7jcpj/what_are_your_moves_tomorrow_october_14_2021/hgkif2w/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634210568.0
    },
    {
        "author": "Jeff__Skilling",
        "body": "Correct - you could make it easier on yourself and just regress Chicago prompt month basis future of your choosing against HH and that should work.\n\nJust be careful with what source you're getting historical prompt month basis gas differentials from. Some are more liquid than others, and illiquid diffs are going to give you weird numbers.\n\nI'd also caution to be cognizant of what pipes they're coming off of (e.g. REX) and who the owner/operator is, since there might be weird nuances involved if you're not familiar with the operators 10-k (underwater hedge book, midstream pipeline subsidiary that's owned by a refiner like HFC/HEP, DK/DKL, MPC/MPLX, PSX/PSXP, etc).",
        "created_utc": 1633733757,
        "id": "hfww702",
        "permalink": "/r/investing/comments/q44z34/need_help_calculating_portfolio_variance_of/hfww702/",
        "score": 1,
        "subreddit": "investing",
        "created": 1633762557.0
    },
    {
        "author": "User_Simulator",
        "body": "Anyways, I'm just mentioning this to illustrate that it's not a bag you're holding if there's nothing left in it I wasn't talking about the market drop on 9/17 happened during the COVID crash I've forgotten how that felt. -3.8% was a month ago Asking for a lot of places for lengthy periods of time.\n\n ~ meta-cognizant\n\n-----\n\n[^^Info](https://github.com/trambelus/UserSim) ^^| [^^Subreddit](/r/User_Simulator)",
        "created_utc": 1634182055,
        "id": "hgkiydk",
        "permalink": "/r/wallstreetbets/comments/q7jcpj/what_are_your_moves_tomorrow_october_14_2021/hgkiydk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634210855.0
    },
    {
        "author": "AxemanFromMA",
        "body": "Why you should buy $460C tomorrow \n\n1.Build Back Better/Infastructure progress (not priced in). Dems will pump $ into economy. Remember when debt ceiling was passed and SPY didn’t react much? But when there was news that the public was non cognizant about, SPY popped an adderall IR 50 MG.\n\n2. Earnings and especially TSLA earnings. The public doesn’t take in account how much $ TSLA is saving and reinvest with no income tax in TX (not priced in). If you don’t believe me look at the chart, shit will break ATH EOW most likely.\n\n3. TA of SPY says we will be $460+ EOW. Did you see the joke of a dip near close and the 3.12 million buy order on SPY yesterday?\n\n4. No debt ceiling or reduction in interest rates\n\n5. Fed still thinks COVID is an issue, probably will be for 4 years IMO. When 9/11 occured, the after affects were ubiquitous for five years.\n\n6. Don’t bet against 🇺🇸. It’s been too long since we broke ATH = higher probability of breaking ATH.",
        "created_utc": 1634696736,
        "id": "hhbbkyg",
        "permalink": "/r/wallstreetbets/comments/qbjku7/what_are_your_moves_tomorrow_october_20_2021/hhbbkyg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634725536.0
    },
    {
        "author": "SunDevils321",
        "body": "My mindset. ESPP is my hard earned money. 15% gain on 10% of my salary right Away. Loan to the company essentially. Company I work for is stable F500. On the flip side, any RSU, grants, etc I consider house money. I plan to let these ride next decade. +. If company starts going, it’s not my money I’ve risked. I’m cognizant if stock and company but this has been my mindset. Doing it wrong?",
        "created_utc": 1633214067,
        "id": "hf5ilxp",
        "permalink": "/r/investing/comments/pzu9e0/is_it_wise_to_cycle_an_espp/hf5ilxp/",
        "score": 1,
        "subreddit": "investing",
        "created": 1633242867.0
    },
    {
        "author": "User_Simulator",
        "body": "Pigs are as smart and sweet as dogs if you expect delisting is a straight short UDN calls?\n\n ~ meta-cognizant\n\n-----\n\n[^^Info](https://github.com/trambelus/UserSim) ^^| [^^Subreddit](/r/User_Simulator)",
        "created_utc": 1634181879,
        "id": "hgkimlp",
        "permalink": "/r/wallstreetbets/comments/q7jcpj/what_are_your_moves_tomorrow_october_14_2021/hgkimlp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634210679.0
    },
    {
        "author": "codeth1s",
        "body": "The market as a whole is generally a lot smarter than any of us are individually. I believe that rate hikes are a given in 2022. The unknowns are how many increases and how quickly those increases will arrive. I think the powers that be are cognizant of the fact that too much too soon could result in many households becoming insolvent and result in a deterioration of consumer confidence and spending which would erode equity prices in the near term. I normally don't keep a lot of cash in reserve. However, this year I have been picking and choosing my entry points. The last month has been a great opportunity for buying on sale. There is nothing wrong with maintaining your monthly investment strategy during these volatile and uncertain times.",
        "created_utc": 1634882241,
        "id": "hhl6yuc",
        "permalink": "/r/CanadianInvestor/comments/qcy6x7/impact_of_rate_hikes_on_overall_markets/hhl6yuc/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1634911041.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 27th of October\n\n\n\n## Upcoming events for Wednesday, October 27th\n\n - Expected earnings:\n\n  ACBI, ACGL, ACNB, ADP, AEM, AEMD, AFI, AFL, AGI, AINC, AIT, AKO.A, AKO.B, ALG, ALGN, ALGT, ALKS, ALRS, ALSN, AM, AMSF, APH, AR, ARES, AROW, ARR, ASGN, ATNI, AVB, AVID, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BFIN, BG, BHE, BHR, BMRN, BMY, BOOT, BRKL, BSM, BSX, BWFG, BXMT, CACI, CAMT, CASH, CBD, CBTX, CCS, CDE, CHDN, CHEF, CHX, CINF, CIVB, CLB, CME, CMPR, CMRE, CNMD, CNO, COFS, CONE, CPF, CPSH, CRSP, CSTM, CSV, CTS, CTSH, CUBI, CX, CYBE, CYH, DB, DGICA, DGICB, DMRC, DRE, DRVN, DT, DTE, DX, E, EAT, EBAY, ECHO, EHC, ENSG, EQC, EQT, ESI, ESRT, ETD, EVR, EVTC, EW, EXR, F, FARO, FBC, FCNCA, FDBC, FDP, FIBK, FISV, FIX, FLEX, FLOW, FLS, FMNB, FNWB, FORM, FPI, FRBK, FRTA, FWRD, GD, GGB, GHM, GLOP, GM, GORO, GRMN, GSHD, GSK, GTY, HAYW, HBNC, HEES, HES, HESM, HLT, HOG, HWKN, ICLR, ILPT, INOV, INVA, INVH, IP, IRBT, IRT, ISBC, IVC, JAKK, JBT, JMP, JOE, KHC, KLAC, KN, KO, KRA, KRC, KRNY, LARK, LC, LEXX, LOB, MAA, MAS, MBIN, MC, MCD, MEOH, MHH, MHO, MKSI, MN, MNRO, MOH, MORN, MPX, MSA, MTH, MUSA, MXL, MYRG, NBN, NDLS, NFBK, NGVT, NLY, NMR, NOA, NOVA, NOW, NSC, NSR, NTB, NTGR, NYCB, OBNK, OC, ODFL, ODT, OII, ONCS, ORLY, ORN, PAG, PB, PDM, PEGA, PGC, PGRE, PI, PLXS, PPC, PPD, PW, QCRH, R, RBBN, RDY, RE, RES, RIBT, RJF, ROCK, ROL, RVPH, RWT, SAVE, SC, SCI, SF, SIGI, SIM, SIMO, SIX, SLAB, SLGN, SMED, SMP, SNBR, SONY, SP, SPOK, SPOT, SREV, SRI, SSB, SSBI, STC, STCN, STLA, STXB, SU, SYBT, TDOC, TDY, TEL, TESS, TEVA, THFF, THG, TMHC, TMO, TNL, TROX, TTMI, TWLO, TYL, UCTT, UEC, UMC, UPWK, URI, USLM, UTHR, UVE, UVSP, VALE, VGZ, VICI, VIST, VKTX, VMAR, VNDA, VRT, VRTS, VSEC, WAB, WCN, WFG, WH, WHG, WOLF, XLNX, YNDX, YUMC, ZDGE, ZVO\n\n - Ex-div:\n\n  BPMP, COP, FRC, KNOP\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.990%)\n    - Core Durable Goods Orders (consensus: 0.4%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.715M)\n    - Crude Oil Inventories (consensus: 1.914M, previous: -0.431M)\n    - Cushing Crude Oil Inventories (previous: -2.320M)\n    - Distillate Fuel Production (previous: -0.289M)\n    - Durable Goods Orders (consensus: -1.1%, previous: 1.8%)\n    - Durables Excluding Defense (previous: 2.4%)\n    - EIA Refinery Crude Runs  (previous: -0.071M)\n    - EIA Weekly Distillates Stocks (consensus: -2.311M, previous: -3.913M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.3%, previous: -2.0%)\n    - Gasoline Inventories (consensus: -1.862M, previous: -5.368M)\n    - Gasoline Production (previous: 0.455M)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 0.6%)\n    - Goods Trade Balance (previous: -88.16B)\n    - Heating Oil Stockpiles (previous: 0.037M)\n    - MBA 30-Year Mortgage Rate (previous: 3.23%)\n    - MBA Mortgage Applications (previous: -6.3%)\n    - MBA Purchase Index (previous: 266.2)\n    - Mortgage Market Index (previous: 643.0)\n    - Mortgage Refinance Index (previous: 2,807.9)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Wholesale Inventories (previous: 1.2%)\n\n## Upcoming events for Thursday, October 28th\n\n - Stock splits:\n\n    - SSBI @ **110:100** (Payable date: 11/04/2021)\n\n - Expected earnings:\n\n  AAPL, AB, ABCB, ABMD, ABTX, ACHC, ADS, AEP, AGCO, AGL, AIRC, AJG, ALDX, ALGM, ALIM, ALNY, AMAL, AMT, AMZN, AOS, AQMS, ARGX, ASPN, ATEN, ATI, ATOM, ATR, AUY, AVNT, AVT, AVTR, AX, BAX, BC, BCLI, BIO, BIO.B, BPMC, BSIG, BSMX, BTU, BVN, BWMX, BY, CARR, CAT, CBRE, CBZ, CDNA, CFFN, CFR, CG, CHE, CHKP, CLVT, CMCO, CMCSA, CMS, CNOB, CNSL, CNX, CODI, COHU, COLB, COLM, COOP, COR, CPG, CPT, CRS, CTO, CUZ, CVEO, CVLY, CWST, CWT, DAIO, DBD, DECK, DQ, DRQ, DVA, DVD, DXCM, EB, EBC, EGO, EIG, EME, EMN, ENVA, ERIE, EVBN, EVLO, EXP, EXPO, FBIZ, FCN, FE, FHI, FISI, FLWS, FMX, FRST, FTAI, FTDR, FTV, FVCB, GILD, GLPI, GNCA, GPI, GSIT, GTX, GVA, HBAN, HIG, HLI, HSY, HTBK, HTGC, HTH, HUBG, HVT, HVT.A, ICE, IDA, IMAX, INSM, INT, ITGR, ITW, JHG, KBR, KDP, KEX, KMPR, KNSL, KRG, LADR, LAWS, LECO, LH, LIN, LKQ, LMAT, LOPE, LPLA, LTC, LTH, LVO, MA, MAYS, MCBC, MCO, MD, MDC, MDP, MERC, MGRC, MHK, MIXT, MMSI, MO, MPW, MPWR, MRK, MSBI, MSTR, MTLS, MVIS, NATI, NEM, NKSH, NLSN, NOC, NOK, NTST, NVCR, NVT, NXGN, OCFC, OFC, OPBK, OPI, OPK, OPRA, ORC, ORI, OSIS, OSK, OSTK, PACK, PATK, PBF, PBFX, PEB, PFC, PFHD, POLY, POWI, PRFT, PRLB, PSB, PTCT, PTEN, PVBC, QUMU, RDS.A, RDS.B, RGEN, RILY, RLGY, RMD, RNST, RS, RSG, SAH, SAIA, SBCF, SBFG, SBUX, SCM, SGEN, SHBI, SHEN, SHOP, SID, SILC, SIRI, SJW, SKX, SKYW, SM, SMMF, SNDR, SNY, SPNE, SPSC, SSNC, STAG, STM, SVBI, SWI, SWK, SYK, TAL, TAP, TAP.A, TARO, TBBK, TEAM, TEX, TFII, TFX, THRM, TIGO, TOWN, TPX, TREE, TRS, TVTX, TW, TXRH, TXT, ULBI, ULH, USAK, USCB, VC, VCRA, VLY, VRSN, WDC, WERN, WEX, WLTW, WNS, WRAP, WRE, WST, WTBA, X, XEL, YUM, ZEN\n\n - Ex-div:\n\n  AA, ACI, ADC, AGNC, AOS, ARC, BRMK, BSRR, CARR, CFG, CIT, COST, CRT, CSWI, DCP, DNP, DSX, EARN, EFC, EPD, EPR, FERG, FT, GEL, GRP.U, HMLP, KFFB, LEVI, LND, MAIN, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PRT, PSXP, PVL, PZN, RBNC, SBNY, SCHL, SCM, SIG, SJT, SKT, SLG, STAG, TRGP, UNB, UNM, VRTS, WHF, ZTS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 7-Year Note Auction (previous: 1.332%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 2,415K, previous: 2,481K)\n    - Core PCE Prices (consensus: 4.50%, previous: 6.10%)\n    - GDP (consensus: 2.7%, previous: 6.7%)\n    - GDP Price Index (consensus: 5.5%, previous: 6.2%)\n    - GDP Sales (previous: 8.1%)\n    - Initial Jobless Claims (consensus: 290K, previous: 290K)\n    - Jobless Claims 4-Week Avg. (previous: 319.75K)\n    - KC Fed Composite Index (previous: 22)\n    - KC Fed Manufacturing Index (previous: 10)\n    - Natural Gas Storage (consensus: 90B, previous: 92B)\n    - PCE Prices (previous: 6.5%)\n    - Pending Home Sales (consensus: 0.5%, previous: 8.1%)\n    - Pending Home Sales Index (previous: 119.5)\n    - Real Consumer Spending (previous: 12.0%)\n\n## Upcoming events for Friday, October 29th\n\n - Expected earnings:\n\n  ABBV, ABR, AENZ, AON, AREC, ASIX, ASX, ATNM, ATRO, B, BAH, BBVA, BCH, BCPC, BELFA, BELFB, BLX, BSAC, CBOE, CCJ, CERN, CHD, CHT, CHTR, CL, COWN, CRI, CVX, DCOM, ECVT, ENIC, ENLV, ESXB, FNCB, FSFG, FTS, FUSB, GIGM, GRC, GWW, HUN, HWBK, IMGN, IMO, IRMD, IROQ, ITCB, JCS, LAZ, LEVL, LGND, LHX, LYB, MGI, MSEX, NECB, NICK, NOVN, NPK, NTP, NVO, NWFL, NWG, NWL, OIIM, OXLC, PEG, PFS, PHVS, PIPR, PLPC, PNM, POR, PSX, PSXP, RCL, ROLL, RUTH, SHLX, SIFY, SJR, SLCA, SNP, TTE, TWIN, TZOO, UBOH, UBSI, URG, UUUU, WETF, WPC, WY, XOM, ZNH\n\n - Ex-div:\n\n  ALLY, AON, ATLO, AVAL, BCBP, BK, BMO, BMTC, BX, C, CAG, CASY, CE, CZNC, DGICA, DGICB, DMLP, ENLC, EVTC, EWBC, HAS, HEP, HFBL, HIFS, KMI, KOF, KRP, LCUT, LNT, NRG, NVEC, OKE, ORRF, PAYX, PBCT, PLBC, PNM, PPBI, RBB, RVI, SAN, SGU, SPFI, STL, SXT, SYF, TKC, TXN, VALU, VOC, WES\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.6K)\n    - CFTC Copper speculative net positions (previous: 40.6K)\n    - CFTC Corn speculative net positions (previous: 277.0K)\n    - CFTC Crude Oil speculative net positions (previous: 429.6K)\n    - CFTC Gold speculative net positions (previous: 193.3K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.1K)\n    - CFTC Natural Gas speculative net positions (previous: -131.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 67.6K)\n    - CFTC Silver speculative net positions (previous: 30.4K)\n    - CFTC Soybeans speculative net positions (previous: 43.5K)\n    - CFTC Wheat speculative net positions (previous: -8.6K)\n    - Chicago PMI (consensus: 63.5, previous: 64.7)\n    - Core PCE Price Index (consensus: 0.2%, previous: 0.3%)\n    - Core PCE Price Index (consensus: 3.7%, previous: 3.6%)\n    - Dallas Fed PCE (previous: 2.80%)\n    - Dallas Fed Services Revenues (previous: 14.0)\n    - Employment Benefits (previous: 0.40%)\n    - Employment Cost Index (consensus: 0.9%, previous: 0.7%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.80%)\n    - Michigan Consumer Expectations (previous: 67.2)\n    - Michigan Consumer Sentiment (consensus: 71.4, previous: 71.4)\n    - Michigan Current Conditions (previous: 77.9)\n    - Michigan Inflation Expectations (previous: 4.8%)\n    - PCE Price index (previous: 4.3)\n    - PCE price index (previous: 0.4%)\n    - Personal Income (consensus: -0.2%, previous: 0.2%)\n    - Personal Spending (consensus: 0.5%, previous: 0.8%)\n    - Real Personal Consumption (previous: 0.4%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.6%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 3.9%)\n    - Texas Services Sector Outlook (previous: 11.5)\n    - U.S. Baker Hughes Oil Rig Count (previous: 445)\n    - U.S. Baker Hughes Total Rig Count (previous: 543)\n\n^^^^2021-10-27",
        "created_utc": 1635328812,
        "id": "hi895vq",
        "permalink": "/r/RobinHood/comments/qgt5ma/daily_discussion_thread_october_27th_2021/hi895vq/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1635357612.0
    },
    {
        "author": "gspencer370",
        "body": "You can't claim a capital loss if you re-buy the stock within 30 days of the sale. Just be cognizant of that.",
        "created_utc": 1633585066,
        "id": "hfp4h60",
        "permalink": "/r/CanadianInvestor/comments/q2nvzk/frequent_buyingselling_vs_holding/hfp4h60/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1633613866.0
    },
    {
        "author": "drchris6000",
        "body": "I actually am very cognizant of it.  Maybe because investing is not a primary income for me.  \n\nI won't buy any dirty energy, things like Nestlé, or things like that new Trump garbage.\n\nThere are plenty of more neutral stocks to buy so I just stick with those.",
        "created_utc": 1634979124,
        "id": "hhq22n6",
        "permalink": "/r/stocks/comments/qdk5ay/do_you_consider_how_ethical_your_investments_are/hhq22n6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635007924.0
    },
    {
        "author": "10xwannabe",
        "body": "Agreed.  It wasn't meant to be an automatic.  It is a point about the effect of compounding and how it is exponential.  \n\nI agree you can't control returns.  What can you control then?  You can control:  Savings, LBYM, getting a good education in a good paying career, asset allocation, keeping investment costs low, be cognizant of taxes (asset location), and staying the course.  \n\nSo there are PLENTY of stuff you can control.  That may be a great another topic to post about when I feel up to it. :)",
        "created_utc": 1635030855,
        "id": "hhsos3k",
        "permalink": "/r/investing/comments/qe6pnp/delayed_gratification_with_investing/hhsos3k/",
        "score": 1,
        "subreddit": "investing",
        "created": 1635059655.0
    },
    {
        "author": "meta-cognizant",
        "body": "+u/user_simulator u/meta-cognizant",
        "created_utc": 1634182021,
        "id": "hgkiw29",
        "permalink": "/r/wallstreetbets/comments/q7jcpj/what_are_your_moves_tomorrow_october_14_2021/hgkiw29/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634210821.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 25th of October\n\n\n\n## Upcoming events for Monday, October 25th\n\n - Stock splits:\n\n    - DPST @ **5:1** (Payable date: 10/22/2021)\n    - RETL @ **5:1** (Payable date: 10/22/2021)\n    - TECS @ **1:10**\n    - DRV @ **1:10**\n\n - Expected earnings:\n\n  ACC, AGNC, AIN, AJRD, AMG, AMKR, ARE, ARI, ARLP, AUB, AXTA, BDN, BMRC, BOH, BRO, BSRR, BXS, CAJ, CALX, CATY, CBNK, CBU, CCK, CDNS, CFBK, CIZN, CLDB, CPSS, CR, CWBC, DORM, DSS, EC, EFSC, FB, FBMS, FBNC, FBP, FEDU, FLXS, FSBC, FSBW, GABC, GAME, HBT, HMST, HNI, HOPE, HSII, HSTM, HTLF, IBTX, JBSS, KMB, KOF, KREF, LII, LKFN, LOGI, LSBK, LXFR, MEDP, MEDS, MNOV, MRBK, MSVB, NEU, NRIM, NWBI, OI, ONVO, OPOF, OTIS, PCH, PEBK, PETS, PKG, PRK, PWOD, QSR, RBB, RNR, SAN, SCCO, SITC, SLP, SMBC, SSD, SUI, TBI, TCBK, TGB, TIMB, TNET, TZOO, UFI, UHS, WASH\n\n - Ex-div:\n\n  APOG, CRS, CVLY, FAST, RY\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.055%)\n    - 6-Month Bill Auction (previous: 0.060%)\n    - Chicago Fed National Activity (previous: 0.29)\n    - Dallas Fed Mfg Business Index (previous: 4.6)\n    - Investing.com Gold Index (actual: 54.3%, previous: 58.4%)\n    - Investing.com S&amp;P 500 Index (actual: 47.2%, previous: 62.3%)\n\n## Upcoming events for Tuesday, October 26th\n\n - Expected earnings:\n\n  AAN, AAT, ABG, ACCO, ACH, ACU, ADM, AGR, AGYS, AHT, AKO.A, AKO.B, AKR, AMD, AMP, APAM, ARCC, ARCH, AUDC, AWI, AWRE, BEN, BGFV, BSBR, BUSE, BXP, BYD, CAC, CB, CCB, CCBG, CCNE, CEQP, CHRW, CIT, CLS, CMRE, CNC, COF, CSGP, CVLT, CZOO, CZWI, DALN, DAN, DHIL, DLR, EBMT, ECL, EDU, EGP, ENPH, ENTG, EQR, ESS, FBHS, FCBC, FCF, FCPT, FELE, FFIC, FFIV, FFNW, FFWM, FIBK, FRAF, FRBA, FRME, FSV, GBX, GE, GIC, GLW, GOOG, GOOGL, GPK, HA, HAFC, HAS, HBCP, HFBL, HIW, HNP, HONE, HOOD, HPP, HRZN, HSBC, HT, HUBB, HZO, IBCP, IEX, INMD, IVZ, JBLU, JNPR, KAI, LBAI, LBC, LBRT, LFUS, LLY, LMT, MANH, MASI, MKL, MMM, MMYT, MSCI, MSFT, MTDR, MYOV, NAVI, NBR, NBTB, NCR, NETI, NOV, NVS, OMAB, OVBC, OXSQ, PCAR, PCB, PEBO, PERI, PFG, PHM, PII, PJT, PNR, PROV, QS, QURE, RARE, RCKY, RNDB, ROIC, RRC, RRD, RTX, SBSI, SEB, SFBC, SFNC, SFST, SHW, SPFI, SPGI, SSTK, ST, TECK, TENB, TER, TPB, TRMK, TRTN, TRU, TTM, TWOU, TWTR, TXN, UBCP, UBS, UDR, UMBF, UPS, USNA, UTMD, V, VBTX, WIRE, WM, WNEB, WRLD, WSBC, WSR, XRX, ZWS\n\n - Ex-div:\n\n  AM, ATR, CLX, CMC, DNUT, ENTG, INFY, PSEC\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.310%)\n    - API Weekly Crude Oil Stock (previous: 3.294M)\n    - CB Consumer Confidence (consensus: 108.8, previous: 109.3)\n    - Dallas Fed Services Revenues (previous: 14.5)\n    - House Price Index (previous: 1.4%)\n    - House Price Index (previous: 19.2%)\n    - House Price Index (previous: 348.4)\n    - New Home Sales (consensus: 755K, previous: 740K)\n    - New Home Sales (previous: 1.5%)\n    - Redbook (previous: 15.4%)\n    - Richmond Manufacturing Index (previous: -3)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -3)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 1.5%, previous: 1.5%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 20.1%, previous: 19.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.4%, previous: 1.5%)\n    - Texas Services Sector Outlook (previous: 8.3)\n\n## Upcoming events for Wednesday, October 27th\n\n - Expected earnings:\n\n  ACBI, ACGL, ACNB, ADP, AEM, AEMD, AFL, AGI, AINC, AIT, ALG, ALGN, ALGT, ALKS, ALRS, ALSN, AM, AMSF, APH, AR, ARES, ASGN, ATNI, AVB, AVID, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BFIN, BG, BHE, BHR, BMRN, BMY, BOOT, BRKL, BSM, BSX, BWFG, BXMT, CACI, CAMT, CASH, CBD, CCS, CDE, CHDN, CHEF, CHX, CINF, CIVB, CLB, CME, CMPR, CNMD, CNO, COFS, CONE, CPF, CPSH, CRSP, CSTM, CSV, CTS, CTSH, CUBI, CX, CYBE, CYH, DB, DGICA, DGICB, DMRC, DRE, DRVN, DT, DTE, DX, E, EAT, EBAY, ECHO, EHC, ENSG, EQC, EQT, ESI, ESRT, ETD, EVR, EVTC, EW, EXR, F, FARO, FCNCA, FDBC, FDP, FISV, FIX, FLEX, FLOW, FLS, FMNB, FNWB, FORM, FRBK, FRTA, FWRD, GD, GGB, GHM, GLOP, GM, GORO, GRMN, GSHD, GSK, GTY, HAYW, HBNC, HEES, HES, HESM, HLT, HOG, HVT, HVT.A, HWKN, IBA, ILPT, INOV, INVA, INVH, IP, IRBT, IRT, ISBC, IVC, JAKK, JBT, JMP, JOE, KHC, KLAC, KN, KO, KRA, KRC, KRNY, LARK, LC, LEXX, LOB, MAA, MAS, MBIN, MC, MCD, MEOH, MHH, MHO, MKSI, MN, MNRO, MOH, MORN, MPX, MSA, MTH, MUSA, MYRG, NDLS, NFBK, NGVT, NLY, NMR, NOA, NOVA, NOW, NSC, NSR, NTB, NTGR, NYCB, OBNK, OC, ODFL, ODT, OII, ONCS, ORLY, ORN, PAG, PAYA, PB, PDM, PEGA, PGC, PGRE, PI, PINS, PLXS, PPC, PPD, PW, QCRH, R, RBBN, RDY, RE, RES, RIBT, RJF, ROCK, ROL, RVPH, RWT, SAVE, SC, SCI, SF, SIGI, SIM, SIMO, SIX, SLAB, SLGN, SMED, SMP, SNBR, SONY, SP, SPOK, SPOT, SREV, SRI, SSB, SSBI, STC, STCN, STLA, STXB, SU, SYBT, TDOC, TDY, TEL, TESS, TEVA, THFF, THG, TMHC, TMO, TNL, TROX, TTMI, TWLO, TYL, UCTT, UEC, UMC, UPWK, URI, USLM, UTHR, UVE, UVSP, VALE, VGZ, VICI, VIST, VKTX, VMAR, VNDA, VRT, VRTS, VSEC, WAB, WCN, WFG, WH, WHG, WOLF, XLNX, YNDX, YUMC, ZDGE, ZVO\n\n - Ex-div:\n\n  BPMP, COP, FRC, KNOP\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.990%)\n    - Core Durable Goods Orders (consensus: 0.4%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.715M)\n    - Crude Oil Inventories (consensus: 1.857M, previous: -0.431M)\n    - Cushing Crude Oil Inventories (previous: -2.320M)\n    - Distillate Fuel Production (previous: -0.289M)\n    - Durable Goods Orders (consensus: -1.0%, previous: 1.8%)\n    - Durables Excluding Defense (previous: 2.4%)\n    - EIA Refinery Crude Runs  (previous: -0.071M)\n    - EIA Weekly Distillates Stocks (consensus: -0.700M, previous: -3.913M)\n    - EIA Weekly Refinery Utilization Rates (previous: -2.0%)\n    - Gasoline Inventories (previous: -5.368M)\n    - Gasoline Production (previous: 0.455M)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 0.6%)\n    - Goods Trade Balance (previous: -88.16B)\n    - Heating Oil Stockpiles (previous: 0.037M)\n    - MBA 30-Year Mortgage Rate (previous: 3.23%)\n    - MBA Mortgage Applications (previous: -6.3%)\n    - MBA Purchase Index (previous: 266.2)\n    - Mortgage Market Index (previous: 643.0)\n    - Mortgage Refinance Index (previous: 2,807.9)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Wholesale Inventories (previous: 1.2%)\n\n## Upcoming events for Thursday, October 28th\n\n - Stock splits:\n\n    - SSBI @ **110:100** (Payable date: 11/04/2021)\n\n - Expected earnings:\n\n  AAPL, AB, ABCB, ABMD, ABTX, ACHC, ADS, AEP, AGCO, AGL, AIRC, AJG, ALDX, ALGM, ALIM, ALNY, AMAL, AMT, AMZN, AOS, AQMS, ARGX, ASPN, ASR, ATEN, ATI, ATOM, ATR, AUY, AVNT, AVT, AVTR, AX, BAX, BC, BIO, BIO.B, BPMC, BSIG, BSMX, BTU, BVN, BWMX, BY, CARR, CAT, CBRE, CBTX, CBZ, CDNA, CFFN, CFR, CG, CHE, CHKP, CLVT, CMCO, CMCSA, CMS, CNOB, CNSL, CNX, CODI, COHU, COLB, COLM, COOP, COR, CPG, CPT, CRS, CTO, CUZ, CVEO, CVLY, CWST, CWT, DAIO, DBD, DECK, DQ, DRQ, DVA, DVD, DXCM, EB, EBC, EGO, EIG, EME, EMN, ENVA, ERIE, EVBN, EVLO, EXP, EXPO, FBIZ, FCN, FE, FHI, FISI, FLWS, FMX, FRST, FTAI, FTDR, FTV, FVCB, GILD, GLPI, GNCA, GPI, GSIT, GTX, GVA, GWB, HBAN, HIG, HLI, HSY, HTBK, HTGC, HTH, HUBG, ICE, IDA, IMAX, INSM, INT, ITGR, ITW, JHG, KBR, KDP, KEX, KMPR, KNSL, KRG, LADR, LAWS, LECO, LH, LIN, LKQ, LMAT, LOPE, LPLA, LTC, LTH, MA, MAYS, MCBC, MCO, MD, MDC, MDP, MERC, MGRC, MHK, MIXT, MMSI, MO, MPW, MPWR, MRK, MSBI, MSTR, MTLS, MVIS, NATI, NEM, NKSH, NLSN, NOC, NTST, NVCR, NVT, NXGN, OCFC, OFC, OPBK, OPI, OPRA, ORC, ORI, OSIS, OSK, OSTK, PACK, PATK, PBF, PBFX, PEB, PFC, PFHD, POLY, POWI, PRFT, PRLB, PSB, PTCT, PTEN, PVBC, QUMU, RDS.A, RDS.B, RGEN, RLGY, RMD, RNGR, RNST, RS, RSG, SAH, SAIA, SBCF, SBFG, SBUX, SCM, SGEN, SHBI, SHEN, SHOP, SILC, SIRI, SJW, SKX, SKYW, SM, SMMF, SNDR, SNY, SPNE, SPSC, SSNC, STAG, STM, SVBI, SWI, SWK, SYK, TAL, TAP, TAP.A, TARO, TBBK, TEAM, TEX, TFII, TFX, THRM, TIGO, TOWN, TPX, TREE, TRS, TV, TVTX, TW, TXRH, TXT, ULBI, ULH, USAK, USCB, VC, VCRA, VLY, VRSN, WDC, WERN, WEX, WLTW, WNS, WRAP, WRE, WST, WTBA, X, XEL, YUM, ZEN\n\n - Ex-div:\n\n  AA, ACI, ADC, AGNC, AOS, ARC, BRMK, CARR, CFG, CIT, COST, CRT, CSWI, DCP, DNP, DSX, EARN, EFC, EPD, EPR, FERG, FT, GEL, GRP.U, HMLP, KFFB, LEVI, LND, MAIN, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PRT, PSXP, PVL, PZN, RBNC, SBNY, SCHL, SCM, SIG, SJT, SKT, STAG, TRGP, UNB, UNM, VRTS, WHF, ZTS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 7-Year Note Auction (previous: 1.332%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 2,445K, previous: 2,481K)\n    - Core PCE Prices (consensus: 4.50%, previous: 6.10%)\n    - GDP (consensus: 2.8%, previous: 6.7%)\n    - GDP Price Index (consensus: 5.4%, previous: 6.2%)\n    - GDP Sales (previous: 8.1%)\n    - Initial Jobless Claims (consensus: 292K, previous: 290K)\n    - Jobless Claims 4-Week Avg. (previous: 319.75K)\n    - KC Fed Composite Index (previous: 22)\n    - KC Fed Manufacturing Index (previous: 10)\n    - Natural Gas Storage (consensus: 90B, previous: 92B)\n    - PCE Prices (previous: 6.5%)\n    - Pending Home Sales (consensus: 0.5%, previous: 8.1%)\n    - Pending Home Sales Index (previous: 119.5)\n    - Real Consumer Spending (previous: 12.0%)\n\n^^^^2021-10-25",
        "created_utc": 1635156012,
        "id": "hhyvgab",
        "permalink": "/r/RobinHood/comments/qfdbs2/daily_discussion_thread_october_25th_2021/hhyvgab/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1635184812.0
    },
    {
        "author": "Trick_Ad3016",
        "body": "PRC is very similar to Imperial Germany, yes, but I wouldn't say the situation is worse now. Today, we have the benefit of:\n\n(1) mutually assured destruction, knocking common sense and extreme risk aversion into the minds of policymakers,\n\n(2) knowing about the outcome of the two world wars. Except for America, all the major combatants, even the eventual victors, suffered terribly, so much so that the war was completely not worth it.\n\nChinese leaders would have to be really thick to not be cognizant of these two points.",
        "created_utc": 1634866332,
        "id": "hhkeinc",
        "permalink": "/r/SecurityAnalysis/comments/q90rmt/jim_chanos_chinas_leveraged_prosperity_model_is/hhkeinc/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1634895132.0
    },
    {
        "author": "VisualMod",
        "body": "**Ban Bet Created:** **/u/meta-cognizant** bet **CRSR** goes from **24.5** to **23.27** before **2021-11-07 09:36:08.952346-04:00**",
        "created_utc": 1635687373,
        "id": "hirgeai",
        "permalink": "/r/wallstreetbets/comments/qil34t/weekend_discussion_thread_for_the_weekend_of/hirgeai/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635716173.0
    },
    {
        "author": "waavvves",
        "body": "I mean the massive increases in revenue can mostly be attributed to the pandemic causing people to become a lot more digitally active and cognizant. If that makes sense. Not that they wouldn't have had probably 12-17% growth regardless, but the past Year's numbers are not the numbers that are going to be seen next year. And I'm going to guess that they're gross will slowly begin declining almost every quarter moving forward before it drops precipitously into the red as, ideally, they are broken up into three companies (FB, IG, WhatsApp) and some decentralized social media platform begins to take regular FBs market share rapidly. But that's probably 3 to 5 years away",
        "created_utc": 1635292984,
        "id": "hi6mcv9",
        "permalink": "/r/stocks/comments/qgb20n/facebook_fb_temporary_fud_or_the_beginning_of_the/hi6mcv9/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1635321784.0
    },
    {
        "author": "Rang_Dipkin",
        "body": "In the ER after I tried to catch Citrix CTXS knife",
        "created_utc": 1634046975,
        "id": "hgcru7n",
        "permalink": "/r/wallstreetbets/comments/q6iqma/daily_discussion_thread_for_october_12_2021/hgcru7n/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634075775.0
    }
]