[
    {
        "author": "Kellzbellz8888",
        "body": "Your correct. We don’t know if it’s graphical actually. Just that it’s a simulation. I think it’s from ANSYS. But if you take a look at MVIS videos of their consumer Lidar point cloud. Ol even that looks better than Tesla point cloud. And the LRL is gen 5 version of that",
        "created_utc": 1626185134,
        "id": "h51deu7",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1626213934.0
    },
    {
        "author": "Sacrificed",
        "body": "Piggy backing on the duration argument -- I think the market is correctly pricing in that switching cost moats = worse economics, but lower terminal value risk; while network effect moats = better economics, but more terminal value risk.\n\nJust look at the multiples on any of the vertical SaaS companies (ADBE, ADSK, ANSS, TYL, etc), with Microsoft Office being the king of \"our whole business runs on Excel, so we aren't going to risk changing that\". It's a great launching point for an Azure upsell, further entrenching their stickyness in workflows.",
        "created_utc": 1627656448,
        "id": "h736xw8",
        "score": 1,
        "subreddit": "investing",
        "created": 1627685248.0
    },
    {
        "author": "OTS_",
        "body": "Yeah! It takes a real genius to leverage your parents IBM contacts to pilfer your stolen code while strongarming your competition with litigation 💪🏼",
        "created_utc": 1626539126,
        "id": "h5j2w3s",
        "score": 61,
        "subreddit": "wallstreetbets",
        "created": 1626567926.0
    },
    {
        "author": "kenaraczz",
        "body": "people in 1990s I am gonna hold forever Xerox, Dell, IBM, GE, and ...America online!",
        "created_utc": 1625470768,
        "id": "h43w097",
        "score": 46,
        "subreddit": "stocks",
        "created": 1625499568.0
    },
    {
        "author": "dragoaus",
        "body": "In personal opinion, one of the major drawbacks is, that management can \"juice\" its salary and bonus by doing repurchases, since by doing repurchases, they increase the stock price (usually metric on which their Bonus is calculated).\n\nSecond major issue is that repurchases of stock robs company of valuable capital, that could have been invested in upgrading production process and R&amp;D. This specially hurts manufacturing and R&amp;D heavy companies. \nFor example from 1995 through 2019 IBM spent $201 billion buying back its own stock. \nAt one point, management of IBM was bragging, how R&amp;D expenditure of IBM has been reduced, so he could have more profits and returns to shareholders (dividends and repurchases). This worked great in short run, but results are clearly visible now, IBM is shadow of itself, company that was leading Innovation for decades is now a service company. \nManagement got its bonuses, shareholders enjoyed short-term gains, but in the end where left with shell of company.\nThis was not only reason for IBM issues, but contributed significantly.\nFor more recent example, check Boing and Intel, both wasted fortunes on buybacks. Both were cheered by Wall Street for it, but in reality, both companies underinvested in their future.\nI am not against buybacks, only it needs to clear, there is no free lunch, especially not in R&amp;D heavy Industries.",
        "created_utc": 1626222047,
        "id": "h53l888",
        "score": 27,
        "subreddit": "investing",
        "created": 1626250847.0
    },
    {
        "author": "Noovy766",
        "body": "I noticed that too, AND also the fact that he is being disingenuous by suggesting that because “X” company went up therefore WISH will go up… \n\nIt’s like saying because Apple sells computer related products and went up, therefore dead companies like AOL, Compaq, IBM or HP should also be the next Apples…",
        "created_utc": 1626357858,
        "id": "h59yjei",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1626386658.0
    },
    {
        "author": "Helpful-Win-5110",
        "body": "If you are a dividend investor, consider MO, MMM, ABBV, and IBM.  These are all long plays.",
        "created_utc": 1625290775,
        "id": "h3w5tt0",
        "score": 16,
        "subreddit": "stocks",
        "created": 1625319575.0
    },
    {
        "author": "falconne",
        "body": "If a big energy company was able to drive the cost of renewables down so much it crashes the green tech companies, then they wouldn't need to buy them out, discount or not, since that implies the big company has leapfrogged them in tech.\n\nThing is, innovation and engineering is hard. You can't solve every problem by throwing money at it. If you're coming in to a field 10 or 20 years behind in research, just being big doesn't mean you're going to catch up in tech just like that. Look at what happened to IBM in the face of upstarts like Microsoft, Google, Amazon, etc.\n\nEven if big companies can fund their own research later, that will put them a decade or more behind. Meanwhile, another big energy competitor could buy up several successful startups and quickly become the dominant player. So like with tech startups, the big players won't be looking for discounts, they'll just wait to see who makes the best proven breakthroughs and then compete with each other to acquire the best tech first.",
        "created_utc": 1626470584,
        "id": "h5g1ccl",
        "score": 16,
        "subreddit": "investing",
        "created": 1626499384.0
    },
    {
        "author": "TradingDaze",
        "body": "Sears used to sell house kits. They were most certainly into every aspect of your life.  People marked on their calendars when the new catalog would come.  The old would then be used for toilet paper. Like most of the mighty companies there was a change and they didn’t adapt. The internet should have turn them into Amazon but instead crushed them to nothing.   Digital photos killed a photo company that began with K.  The list goes on.  The point is good companies can stay good until some change rocks the business’ foundation and they adapt or die.   What will be the change for apple who knows but the fall of mighty tech companies happens (think IBM) but it’s usually a long slow decline.",
        "created_utc": 1627224249,
        "id": "h6h80gn",
        "score": 13,
        "subreddit": "stocks",
        "created": 1627253049.0
    },
    {
        "author": "BrutalHunny",
        "body": "IBM popped on earnings. Institutions itching to spend the money they withdrew today. Spy 430 tomorrow.",
        "created_utc": 1626727057,
        "id": "h5sndrj",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1626755857.0
    },
    {
        "author": "dragoaus",
        "body": "This is true for some companies like (Coca Cola, McDonald's, Banks and similar service oriented companies), which dont have large R&amp;D expenditures, while having enormous positive cash flows and have enough money to support buybacks.\n\nOn the other hand, IBM is best example of company that completely underinvested, it missed Cloud (now dominated by Microsoft and Amazon), so clearly there was enough place to grow. Plenty of other areas in IT that were growing like crazy, that IBM completely ignored.\n\nGE is another good example, Jack Welch gutted the company, turned it from manufacturing giant to financial company, and effectively run the company to the ground (Wall street was happy with dividends and buybacks). At same time Danaher (once called mini GE), was able to grow like crazy in same industries that GE discarded. Today Danaher is larger than GE.",
        "created_utc": 1626225128,
        "id": "h53r5n6",
        "score": 12,
        "subreddit": "investing",
        "created": 1626253928.0
    },
    {
        "author": "FiddleFacked",
        "body": "Say. That IBM is quite the bargain at $4.44. $25 commission here I come! 😎",
        "created_utc": 1625358066,
        "id": "h3z2ixy",
        "score": 12,
        "subreddit": "pennystocks",
        "created": 1625386866.0
    },
    {
        "author": "someonesaymoney",
        "body": "Jesus I wish people would stop with this shitty company.  Constantly overpromising and underdelivering.  Yes it looks good on paper, but they have a long way to go before the new CEO can enact any meaningful change.  They are going the way of IBM.",
        "created_utc": 1625321276,
        "id": "h3x6kj8",
        "score": 11,
        "subreddit": "ValueInvesting",
        "created": 1625350076.0
    },
    {
        "author": "TheBarnacle63",
        "body": "$IBM",
        "created_utc": 1625927729,
        "id": "h4pe3xq",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625956529.0
    },
    {
        "author": "Investing8675309",
        "body": "Feel like people who don’t work in the industry or study the industry closely don’t understand this. Was one of my scary investing moments a few years ago since they look great on paper and I know this industry well and all the spooky stuff doesn’t show up in the financials. Now I’m paranoid for other industries I invest in that I don’t know well that I’m making bone-headed moves.\n\nBig mistake on the Pandora box you opened on IBM, a relic of tech’s Stone Age. Get ready for the “but they pay a great dividend” hordes.",
        "created_utc": 1625325075,
        "id": "h3xdk4i",
        "score": 11,
        "subreddit": "ValueInvesting",
        "created": 1625353875.0
    },
    {
        "author": "exe_virus",
        "body": "Big tech will be regulated to hell. Maybe not now, not in 5 years. But it will be anti monopoly regulated until a new crop emerges and overtakes. \n\nHappened with AT&amp;T bell in the 60's which led to IBM, AMD, Texas instruments, etc.\n\nThen in the 80's/90's, antitrust threats is what led these large hardware companies to outsource their software OS to Microsoft and apple and Unix. \n\nThen in the 2000's we had Microsoft Monopoly broken up and the dot com crash, which led to Google, myspace, etc. Then in '08 google and Qualcomm and all these technologies came together to form what allowed today's JavaScript web based companies like Facebook, YouTube (google), linkedin (Microsoft) you get the idea. \n\nWhat has allowed big tech to stay on top is *acquisitions*. When that power is taken away, you will see big tech's investment thesis fall apart. And lo and behold that's the kind of anti monopoly regulations we are starting to see.",
        "created_utc": 1626739602,
        "id": "h5tecii",
        "score": 10,
        "subreddit": "investing",
        "created": 1626768402.0
    },
    {
        "author": "ThePiglett",
        "body": "I have a Buddy that his grand father worked at IBM from 1937-1985. Lived in Highland NY. When he died in 2013 each relative got $1.3m. 18  He never sold a share of his IBM he was given during that time. All the splits and dividends all invested. Just middle mgt his entire career.",
        "created_utc": 1625360191,
        "id": "h3z5z37",
        "score": 10,
        "subreddit": "pennystocks",
        "created": 1625388991.0
    },
    {
        "author": "frankbuffer",
        "body": "Your stocks are on the TSX but are they also listed in the US?\n\nIf so it’s a common issue for brokers who use IBM (like TD) on the day after a holiday on just 1 market. Tomorrow it’ll be fine.",
        "created_utc": 1625233034,
        "id": "h3sx6s9",
        "score": 10,
        "subreddit": "CanadianInvestor",
        "created": 1625261834.0
    },
    {
        "author": "slickshoes_",
        "body": "I wouldn't say it's necessarily a dying a company but it feels like it's heading in the same way that IBM, Cisco &amp; Oracle are currently.\n\nMore stagnant than dying, but they are in an industry that is expected to grow long term, so it gives they impression that they are dying compared to the projected growth of their competition.",
        "created_utc": 1627295711,
        "id": "h6km4z8",
        "score": 10,
        "subreddit": "stocks",
        "created": 1627324511.0
    },
    {
        "author": "GatorsILike",
        "body": "“Nobody ever got fired for buying IBM”",
        "created_utc": 1626277699,
        "id": "h55zcsi",
        "score": 9,
        "subreddit": "SPACs",
        "created": 1626306499.0
    },
    {
        "author": "Goldonthehorizon",
        "body": "The beating wasn’t as bad as I expected today.  No circuit breakers. Even IBM is up after hours.  Fuck Delta that shit is getting old.",
        "created_utc": 1626726446,
        "id": "h5sly8v",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1626755246.0
    },
    {
        "author": "lostinspace509",
        "body": "Hi\n\nI was thinking back at AAPL stock in the 1990s when they were struggling to survive after Microsoft and IBM got the personal PC out.  AAPL would have been almost a full checklist on your list, but they got one product out there (the i-pod), home run.  Then they got another one out there (the i-phone), then wow, they took over the world and the second golden age is here.\n\nI agree, with most of it.  I just think that we simply need to add that some companies may be down but not out.  We need to do all that work you suggested (Kudos, this shows my age), but we also need to realize that companies can re-invent themselves and come back.  If so, I would like like such a \"fool\" by passing on it, would I not?\n\nI think if I could say something definitive is, you are right most of the time and then sometimes there is that one..... and damn, we missed it.. lol",
        "created_utc": 1625611700,
        "id": "h4ahu2z",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625640500.0
    },
    {
        "author": "rebeltrillionaire",
        "body": "IBM has been listed for 110 years. I don’t know if your argument is that great.",
        "created_utc": 1625546674,
        "id": "h47e5js",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625575474.0
    },
    {
        "author": "GreedyHermit",
        "body": "Yeah but **IBM** beat. If it can do it, calls on everything",
        "created_utc": 1626735107,
        "id": "h5t54d1",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1626763907.0
    },
    {
        "author": "justanahoel",
        "body": "I added 10k warrants this week because [10-Q](https://sec.report/Document/0001213900-21-035565/) after hours last Friday showed an increase of roughly 960k in accrued expenses. Also here's my cliff notes from my spreadsheet:\n\n\\- SPAC play: $720m Consumer Tech\n\n\\- IPO: 09/08/2021 with 1/3 warrant\n\n\\- Gary Cohn:\n\n1. Vice-Chairman IBM\n2. Was Trump's Chief Economic Advisor (as a democrat)\n3. 30 Year COO for Goldman Sachs\n\n\\- Clifton Robbins: 40+ years of investment management experience",
        "created_utc": 1625846688,
        "id": "h4lrg34",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1625875488.0
    },
    {
        "author": "OrangeDutchy",
        "body": "The private space sector is just getting started. It's such a young company ,14years so it doesn't even have a driver's license. Speaking of which consider Ford going public in '56, look at all those decades of building up before going public. Or IBM over 100 years ago. \n\nSo profitability, being so young its all about scaling up and expanding their facilities. Any money is being used to make them more competitive. They believe they can do that by building a larger rocket which will broaden their capabilities. They will be receiving a 750million dollar cash injection. 200 of which will be going to designing and building the next rocket [Neutron ](https://youtu.be/agqxJw5ISdk). Give them room to screw up and lets put it at 250. The rest of the money could go to a number of things. Building a launch pad in New Zealand for Neutron, they have a deal to use the existing launch pad in Wallops, Virginia. They could build three more Neutron rockets, you could have a fleet. Cycling one out and brining in a new improved model throughout the years. They also have their own unique satellite bus built in-house, [Photon](https://youtu.be/LAUj-TQpn-A). First it delivers the payload of other satellites, but it's also open to configuration. I hope they have plans on scaling that up for the Neutron.  They are currently generating revenue, but no they are not cash flow positive, they hope to reach  that in a couple years.\n\nSustainable, as a private company they made it through the global recession of 08(I know that's a weak point). Their still acquiring more partners as they continue to develop their product. For instance BlackSky started by launching their prototype with another launch provider, but now they have multiple launches contracted with Rocketlab. \nThis is still a young industry, if the speculation about mining in space comes true, I believe they will be well positioned for that market. In the mean time it's all about satellites. I think we're at a crossroads, the infrastructure on a large scale could be changed. Do we continue laying and maintaining ground lines to connect everyone on the network? Or do we launch a bunch of satellites and change so everyone goes back to putting a dish on their roof? Or Winnebago, and have internet in the middle of nowhere?\n\nScaleable, I've already hinted towards scalability with a fleet of larger rockets. Possibly larger satellite busses. But it's space, so I want you to use your imagination and think if it's scalable.",
        "created_utc": 1626936479,
        "id": "h63m9g6",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1626965279.0
    },
    {
        "author": "willfightforbeer",
        "body": "Yeah, Watson in particular is a brand, not a tangible computer/model. It's all just marketing from IBM.",
        "created_utc": 1626644303,
        "id": "h5ohboy",
        "score": 7,
        "subreddit": "investing",
        "created": 1626673103.0
    },
    {
        "author": "Laakhesis",
        "body": "If Reddit exists in the 1990s, this question would rephrase to “Are IBM, Exxon, General Electric, Shell, WalMart and Coca-Cola  a hold forever stocks unless you need the cash? Will you be happy with the results 30 years from now?\n\nWinners rotate. The next big company is probably doesn’t exist at the moment..",
        "created_utc": 1626248437,
        "id": "h54q81o",
        "score": 7,
        "subreddit": "stocks",
        "created": 1626277237.0
    },
    {
        "author": "intentionally_blank_",
        "body": "People thought IBM looked promising 10 years ago.",
        "created_utc": 1627342671,
        "id": "h6na5bf",
        "score": 7,
        "subreddit": "stocks",
        "created": 1627371471.0
    },
    {
        "author": "SirGlass",
        "body": "Yes historically I could see a reason to collect dividends trading fees were high, some brokerages charged extra fees for odd lots some only sold lots of 100 at a time.\n\nSo if you had stashed away 100k in IBM stock in the 1990s collecting $500 in dividends every quarter was free. You could get a check mailed to you. Selling $500 of stock every quarter would cost you $35-60 in trading fees what is like 10% fees. Collecting a dividend was a free way to sell and bi-pass trading fees.\n\nNow the fees are so low or almost nonexistent the benefit of selling is you have the choice when/how much to sell. A dividend is a forced taxable event",
        "created_utc": 1625504954,
        "id": "h459koz",
        "score": 6,
        "subreddit": "investing",
        "created": 1625533754.0
    },
    {
        "author": "HaHawk",
        "body": "\"Dow Futures 160 Pts Higher as IBM Posts Strong Results\"\n\nwtf is this 1995 or something? where is my 1,000 point rally? jpow slacking",
        "created_utc": 1626782675,
        "id": "h5v6ezp",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1626811475.0
    },
    {
        "author": "Always_Excited",
        "body": "IBM guided up on cloud on their earning. Expect all cloud names to either run up or rip earnings. $AMZN, $MSFT, $TWLO, $SNOW, $GOOGL\n\nSnap and twitter guided up on ads on their earning. Expect all ad names to either run up or rip on earnings. $TTD, $PINS, $GOOGL, $FB, $ROKU, $AMZN\n\nIntc sucks ass but they guided up on chips. $AMD, $NVDA, $ASML, $LRCX\n\nIt's goddamn impossible to not fomo after seeing CMG, DPZ, and SNAP rip 14~20% on earning surprise. Those numbers are goddamn 20Xs on weeklies. Literally 1k to 20k.\n\nLiterally shaking in my boots to fomo into calls right now.",
        "created_utc": 1627001656,
        "id": "h6709zg",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1627030456.0
    },
    {
        "author": "pornograficionado",
        "body": "More like an early IBM.",
        "created_utc": 1626807319,
        "id": "h5wozqs",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1626836119.0
    },
    {
        "author": "xilb51x",
        "body": "Risk with any tech company is someone coming in and doing it better and cheaper.\n\n$S is a great tool in this space however they only carry a small lineup vs CRWD VMWARE IBM DELL etc look at gartner magic quadrant for competitors they are the lowest in the “top right” I’m in the IT industry and I know sales pushes a lot of $S but $CRWD is a better overall product because of the other services you can get.",
        "created_utc": 1625219994,
        "id": "h3sd9l7",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625248794.0
    },
    {
        "author": "TheMadBeaker",
        "body": "Thanks as always. I somehow managed to luck out and sold my $IBM literally 2 days before it took that nose dive back on July 1st I think it was. Doesn't matter if it's positive or negative news Monday, I'm almost certain it's going to take another hit as has happened to most tech stocks after their earnings, even if they smashed expectations. Thinking about buying back in if the price is good enough. It's slow growth and the dividends are good.\n\nWas also thinking of jumping on V, MA, and AXP but am also going to wait until after Friday's news.",
        "created_utc": 1626639125,
        "id": "h5o5nph",
        "score": 5,
        "subreddit": "options",
        "created": 1626667925.0
    },
    {
        "author": "FaTb0i8u",
        "body": "Ibm. Boomer stock saved me after hours",
        "created_utc": 1626733630,
        "id": "h5t20bd",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1626762430.0
    },
    {
        "author": "FrostyEgg2877",
        "body": "So…you’re in Riot or IBM?  This post confuses me",
        "created_utc": 1625259458,
        "id": "h3un9vw",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625288258.0
    },
    {
        "author": "drosophilus01",
        "body": "IBM is not doing shabby.  Ertsinly friday dropped a lot. With MGMT &amp; technology, IBM  will continue a stable future.",
        "created_utc": 1625323760,
        "id": "h3xb3x4",
        "score": 4,
        "subreddit": "ValueInvesting",
        "created": 1625352560.0
    },
    {
        "author": "Rodgerwilco",
        "body": "TSMC supplies Apple, NVDA, Intel, AMD, Samsung, Qualcomm, IBM, Microsoft, Sony etcetcetcetc. They are responsible for over 70% of the words chips. Sure, we're investing in US production of chips but TSMC is strategic by keeping their most important/advanced nodes on mainland Taiwan.  \n\nChina wants Taiwan. USA and allies will back Taiwan because it's a matter of national security and it's in our best interest to not get fucked by China.  \n\nYou're right, TSMC the company is not monetarily 'worth' 5 Trillion right now. But what's the price tag of a country that 70% of the worlds chips rely on? What are the collective value of lives that will be lost over that war? It's worth more than 5T in my books.",
        "created_utc": 1625959418,
        "id": "h4r3etl",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625988218.0
    },
    {
        "author": "FinndBors",
        "body": "&gt; This ain’t like 2000\n\nIn a ton of valuation metrics they are worse than any other time in history other than 2000. And when people think of 2000, they think of pets.com being ridiculous. Those shit companies were not in any index and pets.com was 300-400 million market cap at its peak (which it held for a very short time). You can equate pets.com to companies like NKLA which make gravity powered trucks. NKLA was ~ 30B market cap at its peak -- and it's still worth 5B+. Pets.com actually had a business / revenue, tons of SPACs are little more than post series A companies, all of them worth well over a billion.\n\nThe \"real\" megacap tech companies of 2000 were hewlett packard, microsoft, ibm, csco, intel, sun, compaq, etc. Their P/E ratios are much closer to the FAANGs of today. And most of the peak P/E ratios happened after a series of bad earnings.\n\nThe only thing that is legitimately different now than before is low interest rates. Which is why inflation / fed reaction is a genuine serious fear.",
        "created_utc": 1626571480,
        "id": "h5kueqq",
        "score": 4,
        "subreddit": "stocks",
        "created": 1626600280.0
    },
    {
        "author": "Mr_Dude12",
        "body": "I’m predicting that Tesla may be in for haircut once the everyone else starts to roll out their own electric cars. I cannot dismiss the ingenuity they have used to make a golf cart a true luxury car. Their weakness is business model, repairability is a nightmare, selling cars without key features then making by them subscription items? They are not cars, they are hardware with software licenses that are only profitable if you count the pollution credits sold.  Established carmakers won’t play these games, will have local service departments and build them to be a hat they are: cars. They have been doing it for a century. The chip shortages have made them focus on high end models, I kinda doubt they will start the base model production given the profitable high end models will bring. I see the brands that you know selling higher end, and coach built super high end cars. Once the patents begins to expire, we will see Chinese cars flood the low end with of the shelf tech. I am in on Nio and researching the Chinese makes that are actually producing and selling cars today. I liken it to the IBM computer “clones” of the ‘80’s. We will see compatible plug and play parts. Anyone research the scooter market? China has super factories that you can order any number of scooters, at any price point based on the quality of the parts specified, then slap your model name in them. ( check out AliBaba.com, buy a shipment, print your labels and poof, you are a scooter manufacturer). Trademarks? Pfft. We will see a flood of odd names sold over the internet just like you buy your Dell or off brand computers. Money will be in batteries, mining for rare earth metals, etc.",
        "created_utc": 1627020073,
        "id": "h67wlno",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1627048873.0
    },
    {
        "author": "lattercat42",
        "body": "Bitcoin is likely here to stay and will be like investing in gold. There are other cryptos out there that will serve as the backend of practical day-to-day transaction stuff. I’m think amp, matic, cardano and because of their household names maybe even meme coins like Shiba Inu or Safemoon or Dogecoin if they can get their act together and get some legit financial organization behind them. Stellar lumens also have interesting potential. I think there is (or was) IBM involvement in that. \n\nBit issue with all these cryptos are stability relative to fiat currencies.  I can’t have a container of milk cost me $3 when I take it from the cooler and $6 by the time I get to the checkout and then $1.50 by the time I get to my car. Not good for the consumer or the supplier.",
        "created_utc": 1627302645,
        "id": "h6kvn1r",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1627331445.0
    },
    {
        "author": "Rattlessnakes",
        "body": "Amazon, IBM apparently disagree with you enough to partner with palantir to gain access to their software",
        "created_utc": 1627023381,
        "id": "h680q3s",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1627052181.0
    },
    {
        "author": "OperationCommon9239",
        "body": "IBM with solid numbers. AAPL was a buying opportunity today.",
        "created_utc": 1626736565,
        "id": "h5t853k",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1626765365.0
    },
    {
        "author": "T3ndies4Days",
        "body": "50% ASTSW, 5% ADBE, 15% IBM, 20% IFP, 10% MO",
        "created_utc": 1625419615,
        "id": "h41js7e",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625448415.0
    },
    {
        "author": "feelthebern5G",
        "body": "They bought redhat and have a 4% yield. I am aware of bear case on IBM",
        "created_utc": 1625261799,
        "id": "h3usbau",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625290599.0
    },
    {
        "author": "badgebruce",
        "body": "In today's analysis Zacks now rates IBM a BUY. [https://finance.yahoo.com/news/zacks-industry-outlook-highlights-international-115311170.html](https://finance.yahoo.com/news/zacks-industry-outlook-highlights-international-115311170.html)",
        "created_utc": 1625582037,
        "id": "h48ousv",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625610837.0
    },
    {
        "author": "ElectronicGuitar7834",
        "body": "I think you should stop trading with options the way you are trading.\n\nI think you should consider selling CSP to start with and don't go for meme stocks. You can collect the premium and if you get assigned then you go for Covered Calls.\n\nFord, X, IBM, GM, CRSR, MGM, BAC, AA are some shares you should look at to start.\n\nAAPL is a good investment if you consider a long time return.  Are you on a profitt with your LEAP?\n\nAre you using PMCC on AAPL you holding to get some premium?",
        "created_utc": 1626262704,
        "id": "h556jnz",
        "score": 4,
        "subreddit": "options",
        "created": 1626291504.0
    },
    {
        "author": "12MonthsinEstonian",
        "body": "this one is in a private splinter sub. recent comments include MSFT, BA, DIS, XOM, IBM, APPS, NVDA, JNJ, UVXY...\n\nso, they're cool.",
        "created_utc": 1625352845,
        "id": "h3yttv8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625381645.0
    },
    {
        "author": "AhsokaFan0",
        "body": "Or you could have bought IBM or yahoo or GE or Nokia …. It’s always obvious in retrospect, but it wasn’t obvious in 2012.",
        "created_utc": 1625807200,
        "id": "h4k5kfj",
        "score": 3,
        "subreddit": "investing",
        "created": 1625836000.0
    },
    {
        "author": "airelfacil",
        "body": "Really a wait-and-see moment for Intel.\n\nOn one hand, they could go the way of AMD and see a comeback (better management, innovation).\n\nOn the other hand, they could go the way of IBM (fewer product sales, confusing majority market share with customer loyalty).\n\nIt should be noted that IBM is still a successful company. They still hold the majority market share for mainframe computers and credit card transaction machines (you may have noticed the IBM logos on those beige old-looking cash register machines, [example](https://i.ebayimg.com/images/i/140790671093-0-1/s-l1000.jpg)). However, this has not been helpful in growing their stock price (instead they have a very good dividend).",
        "created_utc": 1627323461,
        "id": "h6m43lp",
        "score": 3,
        "subreddit": "stocks",
        "created": 1627352261.0
    },
    {
        "author": "MustacheEmperor",
        "body": "I see how this is a reasonable take but can’t help but see the parallels to people arguing for IBM over Microsoft and Apple in the early 80s.",
        "created_utc": 1627164821,
        "id": "h6etmwx",
        "score": 3,
        "subreddit": "investing",
        "created": 1627193621.0
    },
    {
        "author": "okLetsgo311",
        "body": "RIP IBM.",
        "created_utc": 1626725326,
        "id": "h5sjbqq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626754126.0
    },
    {
        "author": "patmccock86",
        "body": "“How about Funk, 82 year old going into space?” -Faber\n\n“How about IBM?” -Cramer\n\nNever change Jimmy Chill",
        "created_utc": 1626786591,
        "id": "h5vd4tv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626815391.0
    },
    {
        "author": "PhloWers",
        "body": "You might want to read this: [https://www.nytimes.com/2021/07/16/technology/what-happened-ibm-watson.html](https://www.nytimes.com/2021/07/16/technology/what-happened-ibm-watson.html)  \n\n\nAs a quant, I can tell you this ETF is full of shit.",
        "created_utc": 1626648436,
        "id": "h5oqeud",
        "score": 3,
        "subreddit": "investing",
        "created": 1626677236.0
    },
    {
        "author": "girl_with_huge_boobs",
        "body": "about half the time, a stock kills earnings and still tanks for other reasons (usually future guidance not being as optimistic as investors would like). But also, markets are fickle and theres always economic data, jpow speeches, etc to throw a monkey wrench in things. And even if a stock does shoot up big after a killer earnings (like IBM did last week) they tend to give up those gains really fast too. IBM went from like 138 -&gt; 145 from good earnings but by the afternoon was back down to 140.25 or something",
        "created_utc": 1627132027,
        "id": "h6d172e",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1627160827.0
    },
    {
        "author": "girl_with_huge_boobs",
        "body": "all my stocks are pretty green right now so you are probably right. Loaded up on msft and ibm calls off the dip so hoping we have a nice tech day again.",
        "created_utc": 1625660831,
        "id": "h4chmzu",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625689631.0
    },
    {
        "author": "Vast_Cricket",
        "body": "You do what you want with your money. It is not like holding on to IBM stock with fairly predicable trend that you can sustain long.",
        "created_utc": 1625634297,
        "id": "h4bmvqh",
        "score": 3,
        "subreddit": "options",
        "created": 1625663097.0
    },
    {
        "author": "girl_with_huge_boobs",
        "body": "completely amazed that I thought I picked the 2 shittiest earnings plays (ibm and ge) and both ended up being winners seeing how all the others are faring.",
        "created_utc": 1627418952,
        "id": "h6r1cv2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1627447752.0
    },
    {
        "author": "thewimsey",
        "body": "&gt;overly laden with cash-sucking and useless middle management \n\nAny time people mention \"middle management\" like this, I know that they are making things up. \n\nThe problem with IBM, Nokia, GM, etc. wasn't \"middle management\".  \"Middle management\" is just a meaningless pejorative term, like \"government bureaucrat\".",
        "created_utc": 1627145944,
        "id": "h6ds3nl",
        "score": 3,
        "subreddit": "investing",
        "created": 1627174744.0
    },
    {
        "author": "badgebruce",
        "body": "IBM acquires Bluetab to extend its portfolio of data and hybrid cloud consulting services.\n\n[https://newsroom.ibm.com/2021-07-15-IBM-to-Acquire-Bluetab-to-Expand-Data-and-Hybrid-Cloud-Consulting-Services-in-Europe-and-Latin-America](https://newsroom.ibm.com/2021-07-15-IBM-to-Acquire-Bluetab-to-Expand-Data-and-Hybrid-Cloud-Consulting-Services-in-Europe-and-Latin-America)",
        "created_utc": 1626397496,
        "id": "h5cdzwo",
        "score": 3,
        "subreddit": "stocks",
        "created": 1626426296.0
    },
    {
        "author": "willfightforbeer",
        "body": "But that's the point, Watson is just IBM's AI cloud services brand, not some meta-model. And matching the performance of the off-the-shelf ML packages from AWS/GCP isn't an accomplishment, it's just table stakes for offering that particular cloud service. All of those are the standard AI tasks that all the big cloud providers offer as pre-trained services, since they're easy to build out. \n\nDon't think of Watson as a model or computer, think of it as a division in IBM that builds AI products and has a mixed track record.",
        "created_utc": 1626668064,
        "id": "h5psg53",
        "score": 3,
        "subreddit": "investing",
        "created": 1626696864.0
    },
    {
        "author": "Right-Lemon-8748",
        "body": "Watson was also little more than a mimic that couldn't pass a second grade English class, also IBM killed the whole Watson thing a few years ago so I don't know how you got your information but its wrong.",
        "created_utc": 1626692284,
        "id": "h5qmb8f",
        "score": 3,
        "subreddit": "investing",
        "created": 1626721084.0
    },
    {
        "author": "AndyM134",
        "body": "What if IBM earnings beat is the sign that we’re fuk",
        "created_utc": 1626735514,
        "id": "h5t5z40",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626764314.0
    },
    {
        "author": "bungholio99",
        "body": "IBM is the hope for a turnaround and Quantumcomputing...valuable assets were sold to Lenovo which is trading low and playing 4x Dividend.\n\nIBM doesn’t fit in this list, the only pay dividend from large cash reserves but aren’t running well.",
        "created_utc": 1625299996,
        "id": "h3wg99f",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625328796.0
    },
    {
        "author": "Tagalettandi",
        "body": "IBM is next to implode",
        "created_utc": 1625686492,
        "id": "h4e0sgf",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1625715292.0
    },
    {
        "author": "badgebruce",
        "body": "\"We are excited to announce that IBM has signed a definitive agreement to acquire BoxBoat Technologies! We can’t wait to join forces with IBM’s Hybrid Cloud Services division within GBS to help organizations achieve Digital Transformation!\" [https://finance.yahoo.com/news/ibm-acquire-hybrid-cloud-consulting-151619300.html](https://finance.yahoo.com/news/ibm-acquire-hybrid-cloud-consulting-151619300.html)",
        "created_utc": 1625772136,
        "id": "h4iaei7",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625800936.0
    },
    {
        "author": "86dathoe",
        "body": "IBM",
        "created_utc": 1626763722,
        "id": "h5ujprm",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626792522.0
    },
    {
        "author": "manofculture003",
        "body": "IBM remembered it ain't the 80s anymore",
        "created_utc": 1626804648,
        "id": "h5wioa5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626833448.0
    },
    {
        "author": "GreenLeafWest",
        "body": "FWIW, I am looking to begin dollar averaging into WBA starting Tuesday for its yield. Being a conservative investor, I am surprised to find  a stock I'm considering mentioned on this subreddit although I do see my CLF mentioned here occassionally.\n\nAnd since my post will undoubtedly incur the wrath of my fellow denizens here, I'll suggest taking a look at PFE for its yield and a Delta play.\n\nAnd, I concur with the other posters who cautioned against IBM. \n\nGood luck!",
        "created_utc": 1625276987,
        "id": "h3vkx5f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625305787.0
    },
    {
        "author": "Summebride",
        "body": "Jim Whitehurst leaving.  I'm not an IBM fan, but the selloff seems overdone.",
        "created_utc": 1625243848,
        "id": "h3tmsxx",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625272648.0
    },
    {
        "author": "Stubtronics101",
        "body": "That's a good question. Really our phones are a quite powerful personal computer. But I was referring to the more traditional desktop and even laptop. Doesn't really matter the point I failed to articulate is Intel is branching out from being just a cpu maker, which is the right move or else they will end up like IBM.",
        "created_utc": 1625527658,
        "id": "h46hfnm",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625556458.0
    },
    {
        "author": "fish60",
        "body": "I would say the IBM comparison is relatively fair, but comparing the highest of high tech companies, that is, potentially, one tech breakthrough from cornering the chip market for ANOTHER several decades, to Exxon doesn't seem fair. It isn't like INTC is seeing world wide protests demanding the destruction of their industry.",
        "created_utc": 1625515139,
        "id": "h45tn1v",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625543939.0
    },
    {
        "author": "Fit-Mycologist-6951",
        "body": "Grab a job at IBM and make 6 figures.\n\nBasically the same as FAANG",
        "created_utc": 1626202998,
        "id": "h52hd5x",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626231798.0
    },
    {
        "author": "renatomello",
        "body": "Not really a consideration at the moment, to be honest. At this point I'm considering either staying at academia or working on companies more focused on the software integration part. Not necessarily in that order.\n\nAt the moment I see a handful of companies ahead of them in terms of both software and hardware e.g. one can actually access IonQ's hardware using IBM's (open) software Qiskit on top of accessing IBM's harware. Also IBM is at least a couple of years ahead in its hardware scaling. Moreover I consider not a controversial statement to say that IBM's (and others') hardware platform  (superconducting qubits)  is inherently less difficult to scale than ion traps, making the playing field tilted away from ion traps (and photonics tbh).\n\n&amp;#x200B;\n\nI hope they prove me wrong because that would mean extraordinary success to everybody involved in the field, but the odds are stacked against them.",
        "created_utc": 1626529146,
        "id": "h5ija17",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1626557946.0
    },
    {
        "author": "kfuzion",
        "body": "Short answer, yes that would work. But chasing stocks with high dividend yield is usually a bad idea. It can work sometimes, of course. But I'd strongly suggest looking at the holdings; oil companies, AT&amp;T, IBM, lots of riffraff has high dividends but they could easily have low/negative real return over the next 10+ years.\n\nSkimming the top 10 holdings of each - I'd go with VDADX over VHYAX. Dividend appreciation, dividend aristocrats, usually good choices. Even taking a stock like AAPL for example - if you bought it in 2013, you'd have a 5% dividend yield on your original investment ($13/share back then, $0.60 dividend now). If you bought XOM in 2013 in the $80s, you'd only be making about 4% on your original investment. In terms of total return, again you'd be better off with AAPL by a long shot. So going for quality matters.",
        "created_utc": 1626724318,
        "id": "h5sgzl3",
        "score": 2,
        "subreddit": "investing",
        "created": 1626753118.0
    },
    {
        "author": "zerobrain75",
        "body": "Holding IBM and TSLA calls which means I’ll get a solid 8 hours of sleep",
        "created_utc": 1626757878,
        "id": "h5uc3zw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626786678.0
    },
    {
        "author": "UrBoySergio",
        "body": "May as well invest in IBM",
        "created_utc": 1626909736,
        "id": "h62b6tr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626938536.0
    },
    {
        "author": "LambdaLambo",
        "body": "&gt; Those shit companies were not in any index and pets.com was 300-400 million market cap at its peak (which it held for a very short time). You can equate pets.com to companies like NKLA which make gravity powered trucks. NKLA was ~ 30B market cap at its peak -- and it's still worth 5B+\n\nThat kinda helps my point though. NKLA tanked but it has no correlation to the overall stock market, and the whole stock market went up in fact. Same with the entire SPAC bubble. Yes it was a bubble, but it popped and the market moved on its way without missing a beat. \n\n&gt; The \"real\" megacap tech companies of 2000 were hewlett packard, microsoft, ibm, csco, intel, sun, compaq, etc. Their P/E ratios are much closer to the FAANGs of today. And most of the peak P/E ratios happened after a series of bad earnings.\n\nEven then the PE ratios are not the same. MSFT in it's peak in 1999 had a PE ratio of ~82, it now has a PE ratio of ~35. \n\nI'm not gonna say that *every* company today is fine. Many are not (including NKLA). But the 2000 was endemic throughout the market (i.e. say \"internet\" and stock 10x'd at ipo). Today the market is much more varied and plenty of companies trading at high multiples do so because they're growth is very real.\n\nSorta unrelated but I personally believe tech got an insane boost from covid which is/will be driving huge digitalization efforts and  accelerate growth for many saas/cloud centric companies.",
        "created_utc": 1626578182,
        "id": "h5l7hzl",
        "score": 2,
        "subreddit": "stocks",
        "created": 1626606982.0
    },
    {
        "author": "De_Elevator",
        "body": "IBM Watson is the marketing brand name IBM uses to sell a bunch of machine learning (AI) software services. The systems other people build for specific problems using those services, like this one for the stock market, may or may not be useful. \n\nI’m sure that custom built machine for TV with the same name was shut down long ago.",
        "created_utc": 1626663931,
        "id": "h5plf5w",
        "score": 2,
        "subreddit": "investing",
        "created": 1626692731.0
    },
    {
        "author": "JTtheBearcub",
        "body": "Ctxr, tell, wish, Tgt, IBM, APPL",
        "created_utc": 1627056724,
        "id": "h69hlh7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627085524.0
    },
    {
        "author": "WestTexasCrude",
        "body": "AMEX\n\nIBM\n\nWFC\n\nBABA",
        "created_utc": 1627101060,
        "id": "h6bzhic",
        "score": 2,
        "subreddit": "stocks",
        "created": 1627129860.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "$IBM desperately needs a Gen X/Millennial as their next president. \n\nBoomers are taking the company with them - to the grave",
        "created_utc": 1625235905,
        "id": "h3t3euh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625264705.0
    },
    {
        "author": "aBushelofApples",
        "body": "I've invested in some companies for years before dumping them. I think I was in IBM for almost 4 years. I've since moved a larger portion to s&amp;p index funds. Less to stress over.",
        "created_utc": 1625757844,
        "id": "h4hdp2r",
        "score": 2,
        "subreddit": "investing",
        "created": 1625786644.0
    },
    {
        "author": "girl_with_huge_boobs",
        "body": "hopefully can make a move on IBM tomorrow, they tanked hard on friday hoping I can scoop up some calls.",
        "created_utc": 1625539941,
        "id": "h473jyg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625568741.0
    },
    {
        "author": "KnightCPA",
        "body": "Coke. IBM. That’s all I got.",
        "created_utc": 1625932185,
        "id": "h4pn6l5",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625960985.0
    },
    {
        "author": "toy-love-xo",
        "body": "If you want something stable and good: I can recommend the t-series from Lenovo (old famous ibm-Series).",
        "created_utc": 1625948787,
        "id": "h4qjoqr",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625977587.0
    },
    {
        "author": "az226",
        "body": "IBM is still around. IBM is a $120B company. That’s just half of its peak $240B.\n\nAlso Microsoft has shown the ability to reinvent itself and pivot. And Azure is much more sticky than operating systems.",
        "created_utc": 1625941831,
        "id": "h4q6tsj",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625970631.0
    },
    {
        "author": "WolfPackWSB",
        "body": "This Weeks SPECIAL is on IBM.. $144-$149 calls loving the return just since 230p on Friday drop down to a .05 back up to .15",
        "created_utc": 1625519867,
        "id": "h462uqu",
        "score": 2,
        "subreddit": "options",
        "created": 1625548667.0
    },
    {
        "author": "Onion_jam",
        "body": "Maybe they won't kill off Intel altogether but AMD has a pretty clear path to replacing Intel as the dominant chip for PCs and servers. And I would argue that in the long run this is the smartest strategy. Taking a page from Amazon's book. \n\n\nA lot of large companies try to throw a ton of money at R&amp;D without any real strategy and then get outmaneuvered by smaller and savvier competitors. Ford, IBM, and GE are a few really good examples. They may be undervalued based on traditional metrics but if they're viewed as weak relative to their competitors the market isn't going to give a fuck.",
        "created_utc": 1627243305,
        "id": "h6iazaz",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1627272105.0
    },
    {
        "author": "AmplifiedS",
        "body": "@cclagator (OP)\n\nAll those links are wrong. For example, TSLA links to IBM, etc. You can see in the link name as well.",
        "created_utc": 1627251440,
        "id": "h6irbw9",
        "score": 2,
        "subreddit": "options",
        "created": 1627280240.0
    },
    {
        "author": "unkownsourcecode",
        "body": "stuck between IBM or Walgreen. Thoughts?",
        "created_utc": 1627406547,
        "id": "h6q919m",
        "score": 2,
        "subreddit": "stocks",
        "created": 1627435347.0
    },
    {
        "author": "fine_lit",
        "body": "Polaroid might not be the best comparison but IBM is a great example, although they had the financial and arguably technical capability to adopt new technologies such as cloud computing and artificial intelligence they were fairly late to the party and lost their advantage as one of the big tech firms fairly quickly so I would argue it’s not as much about who can afford to invest in future technologies it’s more about who’s willing to take the risk to forgo profit on their current business to possibly stay relevant in the future.",
        "created_utc": 1626536585,
        "id": "h5ixidc",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1626565385.0
    },
    {
        "author": "xxx69harambe69xxx",
        "body": "Where do data scientists go when they fail their jane street interviews \n\n-&gt; google brain\n\nwhere do data scientists go when they fail their google brain interviews\n\n\n-&gt; ibm watson\n\n\nno thanks on that tech my dude",
        "created_utc": 1626664066,
        "id": "h5plnrx",
        "score": 2,
        "subreddit": "investing",
        "created": 1626692866.0
    },
    {
        "author": "matrixnsight",
        "body": "Sort of. Anyone can make an android device. Only apple can make iOS devices. We saw how this played out in the PC space already - anyone could make a windows computer. 75% of the market now is Android. Apple is regaining small market share but it's just a cyclical oscillation that occurs due to all the other platforms dropping to zero in the last couple years. E.g. if 5% of Android users decide to give iPhone a try and 10% of iPhone users decide to switch to Android, iPhone still gains market share when it's far enough behind (so you get the feedback effect we see now).\n\nThe problem with closed platforms is they will eventually find themselves behind. There are just too many competitors - it's Apple vs. the world. Wearables, automotive, VR, AI capabilities... there are tons of ways the landscape is going to change in the next 10 years and it's highly likely Apple finds itself behind. Camera upgrades and poo emojis can only get you so far - eventually people don't need your new product.\n\nApple also charges a fee to develop apps. It's free on Android. On Android you can bypass the app store easily and download any app, even from a web address, on iOS it is a massive pain (we see this with fortnite).\n\nAlso we are at peak phones now - I only see downward pressure on margins due to the competition. Apple cannot get away with such high margins anymore - the only reason we don't see that (their margin is only slightly falling) is because they've added all these other high margin business to offset it (i.e. their services they've expanded in the last couple years). The reality is they're losing margin on their phones and they won't be able to hide that in their numbers forever (they certainly tried when they changed their reporting two years ago).\n\nSo those are my concerns with Apple. I always felt their original PE ratio was correct. Once Buffet got in on them they experienced PE expansion which is irrational IMO and I predict will correct itself at some point.\n\nThat's my opinion anyway. I think the market is really messed up right now based on bad speculation.\n\nFor reference, I'd say IBM, INTC, AAPL, and MSFT should be way closer in terms of PE than they actually are. Something more in line with reality would be IBM -&gt; 10, INTC -&gt; 14, AAPL -&gt; 18, MSFT -&gt; 22. MSFT and especially AAPL sitting at 30+ is just ridiculous, as is IBM hovering around 25. I don't think INTC is priced that unreasonably but it is compared to everything else right now.\n\n&gt; I have used both android and other OS's and I have found Apple to be the most easy for my work and personal life\n\nThis was true years ago. Not true anymore.",
        "created_utc": 1627169952,
        "id": "h6f36ro",
        "score": 2,
        "subreddit": "stocks",
        "created": 1627198752.0
    },
    {
        "author": "lilmitchie1221",
        "body": "I am a 20 year old dividend investor who puts $350 dollars biweekly into my dividend account during the summer (whenever I work and am not in school). My main holdings are KO, IBM, EPD, O, VZ, and T. On top of those main investments, I have sprinkled some money into some higher yield stocks that are considered more riskier dividend investments but have played out well over the past two years. Do any of you have some good dividend/growth stocks that I should look into? I am looking for at least a 3% dividend yield but am open to advice!",
        "created_utc": 1625145570,
        "id": "h3oh8h8",
        "score": 2,
        "subreddit": "investing",
        "created": 1625174370.0
    },
    {
        "author": "Radians",
        "body": "IBM, Black berry, Ford, Lehman brothers, bear stearns, Intel, GE.... Just to name a few.\n\nSome may be making a comeback if they still exist but just look at their charts.\n\nJust look at the top 20 companies in the s&amp;p every year going as far back as you can. Do you think you can pick the winners every year for 30 years straight? Great then do what you suggest you want to do in your post. If not(most likely scenario) then you pick an ETF that tracks a benchmark instead of the companies the make-up the benchmark.",
        "created_utc": 1625200521,
        "id": "h3roeyy",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625229321.0
    },
    {
        "author": "Outrageous-Win-9449",
        "body": "Are we in the range of considering IBM value?  Great earnings, great yield, and not sure what you all think of 25 P/E for tech, but I think once quantum comes around the stock is an absolute steal.",
        "created_utc": 1625332691,
        "id": "h3xs8kn",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1625361491.0
    },
    {
        "author": "Waking_Bear",
        "body": "I see I'm not the only one who looked for IBM.",
        "created_utc": 1625423849,
        "id": "h41sg2m",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1625452649.0
    },
    {
        "author": "mamadidntraiseabitch",
        "body": "Bought dip on IBM lmao",
        "created_utc": 1625239503,
        "id": "h3tbtup",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625268303.0
    },
    {
        "author": "atdharris",
        "body": "Buffett has sold plenty of losers in the past. Airlines, banks, IBM. Doubling down on your losers is not always wise. Not sure how the OP is losing money in this market though.",
        "created_utc": 1625852827,
        "id": "h4m527z",
        "score": 2,
        "subreddit": "investing",
        "created": 1625881627.0
    },
    {
        "author": "south153",
        "body": "IBM, they cannot keep up with Amazon and Microsoft and their revenue has been steadily decreasing. Legacy support is keeping them alive.",
        "created_utc": 1625932407,
        "id": "h4pnnrw",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625961207.0
    },
    {
        "author": "KingCuerv0",
        "body": "Nothing too technical or a complex trading strategy but I have been working in Finance for over 15 years so I have a bit of experience.\n\nEssentially I follow 20-30 stocks like a hawk, adding and removing stocks from this list. I know these companies in and out. Then I wait for a dislocation in the stock and or a sell off in the market. Once this happens I buy call LEAPs at least one to two years out, waiting for mean reversion and or whatever catalyst I believe takes place. Most importantly, I trim gains along the way up by setting specific targets. Thus at 20% gain I sell X amount of position, 50% x amount of position etc etc. This protects my gains even though does limit a bit of my upside but found this to be important in locking in gains before they all erode. Especially in options. IE earlier this year CEO of VWM left for INTC, VMW was crushed by over 15% for a stock that barely moves. That was an easy play knowing there was a dislocation and the stock soldoff based on their CEO leaving which really didn't matter since the company is essentially controlled by Dell. Then I bought calls on VMW, stock went back to previous levels and I trimmed at 40% and 70% initially then let the rest ride. Ended up closing my position a few weeks later for a bit over 60% gain in about 3 months by using target goals I set myself for each position and play.\n\nDoesn't mean I am always invested all the time, I patiently wait for the right opportunities but do sit in higher cash position than most before striking. Currently 40% cash as markets are a bit frothy.\n\nHave had excellent returns with this approach but it took time to develop and learn through my experiences.",
        "created_utc": 1625535852,
        "id": "h46wcz3",
        "score": 244,
        "subreddit": "stocks",
        "created": 1625564652.0
    },
    {
        "author": "totally_possible",
        "body": "The best way to make money off INTC is to sell and buy AMD/NVDA",
        "created_utc": 1625867635,
        "id": "h4n0180",
        "score": 83,
        "subreddit": "stocks",
        "created": 1625896435.0
    },
    {
        "author": "RecklessWiener",
        "body": "SMH - semiconductors \n\nTop holdings:\n\nTSM\n\nNVDA \n\nASML \n\nINTC\n\nLRCX",
        "created_utc": 1625235808,
        "id": "h3t36xp",
        "score": 41,
        "subreddit": "investing",
        "created": 1625264608.0
    },
    {
        "author": "iJurassicSlaps",
        "body": "I am also a AMD Stan, did a ton of research on it while building myself a computer and fell in love with the company. Still bought an NVDA GPU but AMD is absolutely killing it in both sectors. They’re better than Intel and NVDA in price:performance, it’s only a matter of time before people realize just how good of a company this is.",
        "created_utc": 1625526018,
        "id": "h46eg5v",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1625554818.0
    },
    {
        "author": "CoDxxjokerxx49",
        "body": "AMD still has a lot of room to grow as long as Intel continues to fall behind in improvements. AMD has a LOT of market share to take from Intel even with the growth they have already had.",
        "created_utc": 1625439216,
        "id": "h42m3gd",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1625468016.0
    },
    {
        "author": "da7mi",
        "body": "Thanks for the quality write up. Questions is, why would you buy in a company that is and will keep losing market share to a stronger competitor in the next 3-5 years? You can jump ship once they get back in the lead. For now, it doesn't make sense to me to buy Intel when AMD is gaining ok them massively.\n\nI think with a good discount, Intel might be worth it, considering they are also trying to get into the gpu segment.",
        "created_utc": 1625319195,
        "id": "h3x2x1x",
        "score": 17,
        "subreddit": "ValueInvesting",
        "created": 1625347995.0
    },
    {
        "author": "QuestionablySensible",
        "body": "The AMD GPUs are heritage ATI and are not at the same level as NVidia. Yet. Also their drivers have been desperate for a long time. While NVidia sometimes puts their boot up their asshole wrt drivers, they generally just tickle the ring whereas AMD started with the booth firmly ensconced in the lower intestine and have been struggling to remove it. They have improved, but are still a ways behind.\n\nTheir CPUs are really good right now and Intel are floundering. That said they are still hampered because most current software isn't very good at multi threading so single core performance is important, especially for gaming, and Intel are competitive there. They are eating Intel in data centers though.\n\nThe big thing for me is that AMD have a runway - theyre still behind but have better CPUs and the data centre uptake is very bullish. Supply could become an issue here, because the big data centre players won't want to wait or to overpay. But assuming adequate supply there should be noticeable growth in the data center side, and of course GPU supply constraints mean that they will continue to sell as many as they make.",
        "created_utc": 1625528375,
        "id": "h46iqjh",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1625557175.0
    },
    {
        "author": "mn_sunny",
        "body": "&gt;Worked at Intel for over five years as a manufacturing engineer.\n\nHa so that's why you actually know what you're talking about. Thanks for saving me from having to be the one to make the cautionary/dissuading comment.\n\n(large AMD investor since 2016 who constantly sees value guys with essentially no semi/x86/litho knowledge being very bullish on INTC solely because of their past financials).",
        "created_utc": 1625334136,
        "id": "h3xv2ar",
        "score": 16,
        "subreddit": "ValueInvesting",
        "created": 1625362936.0
    },
    {
        "author": "Dannimaru",
        "body": "I think think you're forgetting about a little company named Intel.",
        "created_utc": 1625524467,
        "id": "h46bklr",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1625553267.0
    },
    {
        "author": "Zednot123",
        "body": "You realize Intel has been using TSMC for a long while right? They were a larger customer than AMD in terms of wafer starts until recently (might still be). It's just that it was mostly other products than main product line CPUs and not necessarily leading edge.\n\nThem moving even more products to TSMC while they try to solve their node issues would hardly be surprising.",
        "created_utc": 1625233961,
        "id": "h3sz4dr",
        "score": 14,
        "subreddit": "investing",
        "created": 1625262761.0
    },
    {
        "author": "JonStowe1",
        "body": "i wish i had inside intel too",
        "created_utc": 1625829115,
        "id": "h4kuvnk",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1625857915.0
    },
    {
        "author": "PIethora",
        "body": "By referencing INTC you suggest you have not understood OPs post. The concerns over INTC are over technology and competitiveness. The business continues to nake money, pay a reasonable dividend, and cash flow continue to increase.",
        "created_utc": 1625613146,
        "id": "h4akpkt",
        "score": 14,
        "subreddit": "stocks",
        "created": 1625641946.0
    },
    {
        "author": "AverageRedditorNum69",
        "body": "As a long time AMD fanboy who bought inferior AMD  products simply because I believed in them - I can say that im now very Bullish on INTC. \n\nAMD is killing it in the PC gaming ring, and that's great. INTC still dominates for servers (~95% share) and laptop/work device sales. And for gaming they, while inferior, are still able to remain relevant on 14nm nontheless. Most importantly - they print money -  wayy more than AMD.\n\nTheyve hooked up with TSM (super bullish) to hop on 5nm. \n\nTheir pe is like 13. The fact that theyve been a dumpster fire for the last few years is priced in. Nobody is betting against them (like 2% short to AMD's 10%) theyre not going anywhere at all - uncle sam would never let them go under.\n\nAs a value investment they're a great deal. Mass hate of a company be it GM3, GM, F has this year at least equaled stocks up.\n\nIntc is going to recover faster than expected. TSM foundries will make them relevant in gaming and high-end creation markets again. 14nm will print cheap chips for the rest of the worlds craptops. The recovery is coming. \n\nAMD still hasnt passed their 2006 peak market share. While i like lisa su, her products, and the underdog story better, i also like money, so ill sit in INTC and wait.",
        "created_utc": 1625875703,
        "id": "h4ne8xu",
        "score": 14,
        "subreddit": "stocks",
        "created": 1625904503.0
    },
    {
        "author": "CentralFLSubyBoy",
        "body": "While it is true that Intel probably remains the top dog when it comes to chip production, their chips are just not competitive enough now days with AMD. AMD is coming out with Processors that are years ahead of anything Intel is putting out for both gaming and Server Set ups. If they don’t do something innovative soon, AMD will steal their crown.",
        "created_utc": 1625505197,
        "id": "h45a1ok",
        "score": 14,
        "subreddit": "stocks",
        "created": 1625533997.0
    },
    {
        "author": "iamnewnewnew",
        "body": "Im not saying they dont....\n\nU buy amd because its smacking intel and the cpu market share... . Not because they are doing better than nvda.\n\nNo offense but do u not follow the chip manufacturers businesses..?",
        "created_utc": 1625355871,
        "id": "h3yyy8z",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625384671.0
    },
    {
        "author": "Paul_Ostert",
        "body": "I think INTC would be a good dividend play for a few years.  The stock price is low (due to company having problems executing). But right now it's a cash cow.  Just milk it until it succeed or dies.",
        "created_utc": 1625244494,
        "id": "h3tod7a",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625273294.0
    },
    {
        "author": "zxc123zxc123",
        "body": "Hi. I'm from the Intel side! I think AMD side shouldn't worry too much about INTC. It's a big old ship that's getting bombarded from all sides. The fact that it's a big ship means it's changes will take time. I'm giving Gelsinger a chance to right the ship, but it will take a long while to undo BSwan's bad moves, get the right people, develop the chips, and catch up to AMD. \n\nA plus side for everyone is that the semi-space is a growing area with electronification, digitization, and \"5G-cloudification\" of everything along with the increasing importance of AI &amp; tech in business and government. Semis are so important in fact, that at this point US Gov should really be looking at INTC/NVD/TI more like they did Ford/GM 100 years ago: as a strategic industrial/military resource. \n\nReal threat to AMD isn't INTC. INTC was the big market share holder in the past and isn't likely gaining any ground any time soon. What AMD and all the trad chip manufacturers should fear is FAAAM &amp; BAT. Apple has started designing it's own chips. They aren't going back to using outsourced chips. If history says anything it's that Apple will continue to cut others out as they continue to in-house their chips for their entire lineup while improving their chips just like how they kept improving their computers, just like how the iphone kept improving until NOK/MOT were beat, just like how a good chunk of the watch market is Apple watches, just like how Ipads have taken away from of the laptop space, just like how Apple TV keeps chipping away at cable, just like how the app store and Apple's eco system keeps growing, etcetcetc. There is nothing AMD/NVD/INTC can do to stop Apple. And Apple is just the first. MSFT also doing the same. Google, Facebook, and Amazon might follow suit. China's Tencent and Alibaba will likely copy what the US companies do as soon as Pooh Bear gets done man handling them.",
        "created_utc": 1625258081,
        "id": "h3uk775",
        "score": 13,
        "subreddit": "investing",
        "created": 1625286881.0
    },
    {
        "author": "roald_1911",
        "body": "Maybe my prospects are longer term, or just wrong. But it seems to me that the x86 technology got itself into a corner and it would be very difficult to get out of there. AAPL proved that one can make a better processor starting from scratch, and if Windows will support ARM better, then the x86 market is toast. The RISC architecture has advantages over CISC architecture which we are observing right now and/or will observe in the near future. And these can't be undone, worked over, or something else. Every x86/x64 processor developed today can run programs written 30-40 years ago, while a company like Apple can come and say screw that, we start from scratch. This and other issues in the x86 architecture make it an (apparent at least) dead end. AMD is also offering a big competition to Intel, and in the server space there is also big competition. Most of us use phones or tablets with Arm processors. I would rather wait to see how the market progresses.",
        "created_utc": 1625320913,
        "id": "h3x5wk0",
        "score": 12,
        "subreddit": "ValueInvesting",
        "created": 1625349713.0
    },
    {
        "author": "GuiBz123",
        "body": "Intel",
        "created_utc": 1625685937,
        "id": "h4dzhx9",
        "score": 12,
        "subreddit": "stocks",
        "created": 1625714737.0
    },
    {
        "author": "fish60",
        "body": "Puts on INTC are cheap. Put your money where your mouth is and post your positions.",
        "created_utc": 1625509308,
        "id": "h45i4nh",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625538108.0
    },
    {
        "author": "WillyBoynka",
        "body": "Their competitors have around 30 P/E while Intel is at 10. So I say that them losing market shares is already priced in.",
        "created_utc": 1625327305,
        "id": "h3xhs24",
        "score": 11,
        "subreddit": "ValueInvesting",
        "created": 1625356105.0
    },
    {
        "author": "nevetando",
        "body": "Reddit will punish you for this, but I have to agree. \n\nReally because they can actually get chips to market. AMD has better performing chips, sure, but they can't actually get them out there for use, and NVIDIA seems to still be the dominate GPU (despite me owning a complete AMD system right now)\n\nIn the last Steam hardware survey, it showed Intel gaining significant market share. \n\nIt isn't about what chip is \"best\" it is about what you can get right now. Intel makes their own chips. AMD is waiting in line with 100 other companies with TSM.",
        "created_utc": 1625690880,
        "id": "h4eatx4",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625719680.0
    },
    {
        "author": "thatgeekinit",
        "body": "I got one good free tip from them for AMD but I knew enough about how good their chips had gotten in this generation vs Intel that I could validate it on my own.",
        "created_utc": 1625433953,
        "id": "h42cetp",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625462753.0
    },
    {
        "author": "Ehralur",
        "body": "Intel is not getting their company culture back on rails any time soon. They're gonna be getting shit on by AMD for at least another few years.",
        "created_utc": 1625520376,
        "id": "h463u56",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625549176.0
    },
    {
        "author": "wontonforevuh",
        "body": "Lol it's gonna take Intel 5-10 years to recover if at all. They are so far behind TSM.",
        "created_utc": 1625506706,
        "id": "h45d0o8",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625535506.0
    },
    {
        "author": "mistermc90",
        "body": "Altria, BTI, Imperial Brands, Intel, Vertex Pharmaceuticals.\n\nMarket is quite expensive ATM. Quite hard to find large caps at a reasonable discount with strong CF-generation.",
        "created_utc": 1625486944,
        "id": "h44dt1f",
        "score": 9,
        "subreddit": "stocks",
        "created": 1625515744.0
    },
    {
        "author": "IMIRZA0",
        "body": "INTC +19%?\n\nI highly doubt that will Happen",
        "created_utc": 1625603539,
        "id": "h4a0l1b",
        "score": 9,
        "subreddit": "StockMarket",
        "created": 1625632339.0
    },
    {
        "author": "Onion_jam",
        "body": "AMD is going to absolutely murder INTC in the server space over the next decade.",
        "created_utc": 1625882171,
        "id": "h4npf82",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625910971.0
    },
    {
        "author": "SlowRyder",
        "body": "Oh wow, great intel on point one! I did not know that and that explains the rapid growth of the EFI segment. I could see that it has been exploding but couldn’t tell why.\n\nGreat point on the second point as well! I agree that their marketing is extremely on-point all around. They have a chart in their presentation that shows the significant growth of their festival circuit, including the addition of new festivals. They’re doing a great job cultivating a community.\n\nI think that their digital marketing is increasingly on-point as well. I’ve looked at their site over the years on Archive.org and it’s evident that they really got that right just within the last few years. Additionally, their increasing investment in content marketing is very well executed and is going to be huge for SEO and product education.",
        "created_utc": 1625620398,
        "id": "h4aydyl",
        "score": 8,
        "subreddit": "SPACs",
        "created": 1625649198.0
    },
    {
        "author": "agentpurplek1",
        "body": "That stock is going to moon. Intel had a fuck up with manufacturing. Amd bout to eat a lot of market share also starting to see a lot of talk on WSB about it.",
        "created_utc": 1625127783,
        "id": "h3nt6t7",
        "score": 8,
        "subreddit": "options",
        "created": 1625156583.0
    },
    {
        "author": "Investing8675309",
        "body": "TSM put out 5nm last year and is ramping this year. Intel 10nm won’t be out until mid-fall. After that they’ll go to 7nm. \n\nTo be fair this isn’t a nm-to-nm comparison, some have argued, rightfully so, that an Intel 7nm is comparative to a TSM 5nm. I believe AMD’s are still on 7nm (I’m not going to check this but going off memory). Intel has done a great job of improving their chips over the last few years without the nm shrinkage. That said, AMD has caught up.\n\nThere have been some interesting reports of Intel partnering on 3nm with TSM, not sure if that will go anywhere.\n\nKeep in mind this isn’t just an Intel vs AMD/TSM. TSM supplies Apple, Qualcomm, and, really, just about everyone else.",
        "created_utc": 1625326048,
        "id": "h3xfebw",
        "score": 8,
        "subreddit": "ValueInvesting",
        "created": 1625354848.0
    },
    {
        "author": "holdingtankers",
        "body": "AAPL, FB, HD, INTC because America",
        "created_utc": 1625225152,
        "id": "h3sjsif",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1625253952.0
    },
    {
        "author": "Trisolaran_arbitrage",
        "body": "TER has been one of my long-term favorites - I like the CEO a lot (he has worked there his whole career), and they are growing revenues like crazy. They manufacturer Semiconductor test systems as well as wireless test systems. \n\nGood strong balance sheet and they are one of the favorite suppliers to TSMC - should see good sales growth the next few years as TSMC and Intel put their Capex plans in place. Also, they are pivoting to industrial automation - have bought robotics companies that past few years. The CEO wants automation revenue to become the largest source of revenue for the company so they can move beyond the boom-bust cycles in Semi's.",
        "created_utc": 1625684858,
        "id": "h4dx32g",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625713658.0
    },
    {
        "author": "JRshoe1997",
        "body": "Right now my portfolio consists of AAPL, INTC, LMT, JNJ, PEP, O, PLTR, PLHNF, WMT, and VOO. Right now I am only buying INTC and LMT because they are the only stocks right now that are selling cheap in terms if valuation. Everything else is pretty expensive right now imo.",
        "created_utc": 1625245394,
        "id": "h3tqigv",
        "score": 7,
        "subreddit": "stocks",
        "created": 1625274194.0
    },
    {
        "author": "ohThisUsername",
        "body": "&gt;It isn't about what chip is \"best\" it is about what you can get right now.\n\nActually it sort of is in datacenters. Every % improvement of performance per watt makes a huge difference when you have millions of machines. After Intels problems with performance and vulnerabilities, datacenters / cloud platforms learned that they need to diversify a bit and have rapidly introducing AMD based servers. \n\nWhile I do think Intel will fix their issues and is still valuable, in terms of pure growth, it seems like AMD has more potential as datacenters are diversifying to use more AMD. I guess the main risk is if AMD can keep up with demand.\n\nWhat I'm more interested in is Intels venture into ARM based chips.",
        "created_utc": 1625706336,
        "id": "h4f7lb6",
        "score": 7,
        "subreddit": "stocks",
        "created": 1625735136.0
    },
    {
        "author": "TheMagicHorsey",
        "body": "I’m an Intel alumni too. But I worked with Gelsinger before he left Intel. Gelsinger is a way better CEO than anyone the company had between Grove and now. Intel has needed an engineering leader for a while and they’ve only had finance and sales guys.\n\nYou are counting out Intel based on their record of past failures over the last decade. However, my belief is that their execution and product line are going to improve drastically over the next couple years.\n\nThere’s room in the market for both TSM and Intel on the fab side. There’s a massive shortage in semiconductor capacity. Everything is going to need high performance chips in ten years. Current investments by TSM and Intel are just a drop in the ocean compared to what is needed to create capacity to meet future demand. So it’s not a zero sum market between TSM and Intel.\n\nAMD vs Intel vs ARM is a bigger threat … however, people underestimate what Intel’s server group has cooking. Here also I think x86 with Intel cores will reign supreme for some high value work loads. Having said that, I think it’s unavoidable that ARM based VMs are going to swallow a lot of low end cloud compute. We tested AWS ARM VMs for many work loads and they were an absolute win on a cost adjusted basis. Intel will have to do some serious work to stop that drift.\n\nAlso, having my dev machine as an ARM Mac instead of an x86 MAc this year for the first time, means I’m actually running ARM server binaries natively and x86 binaries under emulation, instead of vice versa which was the case in previous years.",
        "created_utc": 1625364172,
        "id": "h3zcb94",
        "score": 6,
        "subreddit": "ValueInvesting",
        "created": 1625392972.0
    },
    {
        "author": "Runningflame570",
        "body": "Their competitive position is getting better with every Intel delay and increase in available capacity at TSMC. No real price target here, but they're well worth buying still.\n\nAbout the only thing that could realistically prevent further appreciation over the next year or two is if China blocks the Xilinx merger.",
        "created_utc": 1625185143,
        "id": "h3qwetf",
        "score": 6,
        "subreddit": "stocks",
        "created": 1625213943.0
    },
    {
        "author": "Paraflaxis",
        "body": "Intel is severely underrated has low pe decent div and pretty much can only go up from here they will take longer to catch up but the opportunity cost is so much better than the others",
        "created_utc": 1625689597,
        "id": "h4e7y1i",
        "score": 6,
        "subreddit": "stocks",
        "created": 1625718397.0
    },
    {
        "author": "imposter22",
        "body": "Intel is spending $3billion on fab facilities in Arizona.\n\nIntel has a new workstation GPU coming late2021 early2022.\n\nIntel has a 3nm, 5nm, 7nm and 12nm and their 11th gen 14nm. And lots of new ICX coming 2022.\n\nIntel has a new automotive computer to sell to car manufacturers.\n\nIntel Sapphire Rapids has a new instruction set for AI compute which is supposed to be pretty dramatic for AI workloads\n\nExpect their new fab to be done in 2025.\n\nExpect their GPU to be a success in the corporate environment.\n\nExpect their huge growth in ICX.\n\nExpect massive sales for their automotive computers.\n\n\nIntel isn’t going anywhere. Its going to be hard for AMD to stay on top.",
        "created_utc": 1625235809,
        "id": "h3t373j",
        "score": 6,
        "subreddit": "investing",
        "created": 1625264609.0
    },
    {
        "author": "Goodenough4Alex69",
        "body": "Yes, I think AMD is a good buy, I believe they have overtaken intel in price and performance on CPU side and I do believe eventually they'll overtake Nvidia in the same way. \n\nThere are better buys.\n\nI was in on some good ass DD with BB back in oct 2020. I sold my BB to buy GME at $40 the morning of the run-up in Jan. Best decision I've ever made. \n\nJust because I think AMD will be a good performer doesn't mean I think it has the same potential as GME. Decades ago some people invested in FORD (low risk low reward) while others invested in Apple(high risk high reward). I don't even think (opinion) GME is high risk, just high reward. Infinite money glitch, come get your cash hombre.",
        "created_utc": 1625458503,
        "id": "h43gbff",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625487303.0
    },
    {
        "author": "aurora4000",
        "body": "I'm bearish on Intel. June 30 Intel announced that it is delaying production of one of its newest chips to early 2022 to improve performance, after previously saying it would be ready late this year. \nhttps://on.wsj.com/3jpnsHd\n\nI own NVDA,AMD,and MRVL instead.",
        "created_utc": 1625524197,
        "id": "h46b2my",
        "score": 6,
        "subreddit": "stocks",
        "created": 1625552997.0
    },
    {
        "author": "BorisYeltzen",
        "body": "I nominate SPCE + BABA + INTC for the worst stocks to ever list",
        "created_utc": 1625148563,
        "id": "h3ondae",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625177363.0
    },
    {
        "author": "IIxNullxII",
        "body": "Good write up. As a previous die-hard Intel fanboy (since early 90s) my next build, and all future builds, will be AMD. I do believe AMD will eventually eclipse Intel's market share. Perhaps within the next half-decade.",
        "created_utc": 1625539871,
        "id": "h473fkh",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625568671.0
    },
    {
        "author": "MoneyForThePeople",
        "body": "What do you think about my portfolio?  \nABNB\t10%\r  \nCLF\t\t5%\r  \n\rINTC\t9%\r  \n\rITUB\t5%\r  \nLMND\t5%\r  \nNIO\t\t11%\r  \nPRNT\t5%\t\t\r  \nQS\t\t5%\r  \nSPCE\t5%\t\r  \nSPY\t\t30%\r  \nTSLA\t10%",
        "created_utc": 1625495253,
        "id": "h44qnbw",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625524053.0
    },
    {
        "author": "Protoculture_11",
        "body": "the shortage issues massively massively hurt AMD. Without it, it would have shown higher YoY growth and faster marketshare growth in datacentre/HPC. Its fucked AMD a lot. We could have been 105 now instead of 95. TSMC expansion in the US along with Intels drive to expand into foundry leaves a lot of possibilities for AMD. Its not super clear that its a slam dunk win for AMD. Its more moving parts in the future whereas we prefer less moving parts with current competitive advantage.\n\nNVDA is kicking AMD's ass inside out on GPU and hardware acceleration in datacentre/AI. We just have to accept it as it is. NVDA is something you should also look to get into when the price isnt so stupid. AMD is not NVDA though. Dont expect those price levels. NVDA has a fucking stranglehold in market sectors that AMD does not have.\n\nAMD is however takings Intel's lunchmoney on x86 and its mainly because Intel fucked up on EUV. Intel's comments on \"chiplets glued together\"? Well those chiplets glued together are what allow AMD to make much better yields on smaller die sizes. When a wafer has an issue, you lose a lower portion of the wafer if you have smaller dies, or chiplets. So now AMD has several years lead on making chiplet designs talk to eachother faster or more efficiently.\n\nIntel is however throwing in the towel and going to pay for EUV by TSMC in 2023. AMD has advance plans for 2023 with TSMC anyway and think they are second customer behind Apple so should be on a more even playing field moving forward in 2023, with the advantage of maybe 5 years with infinity fabric and chiplet design instead of monolithic dies. However if EUV pellicles come good by then, monolithic dies may be better - cant tell.\n\nTrying to figure out short term moves with AMD is nuts. Just buy stock or leaps.",
        "created_utc": 1625535064,
        "id": "h46uxq8",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625563864.0
    },
    {
        "author": "d_howe2",
        "body": "To follow on your point about nm-to-nm comparisons. Is the process node (length?) really the most important metric? \n\nIt seems like the intel i9 11900k (14nm) is comparable to the Ryzen 9 (7nm) - Except for power consumption! Which is quite bad at the moment!",
        "created_utc": 1625327495,
        "id": "h3xi54r",
        "score": 5,
        "subreddit": "ValueInvesting",
        "created": 1625356295.0
    },
    {
        "author": "marcuscontagius",
        "body": "Everybody talking about designs…INTC ain’t behind in cpu or GPU design, they are behind in manufacturing capability and Fab expertise at the moment because they got skimpy on technical positions while financier bob was running the show at a vertically integrated company. Once they get as deep into EUV as tsmc and Samsung have been they’re vertical advantage will again become relevant. \n\nOnce the fabs are a up and running they will take the market share back because tech innovation moves fast and amd can’t take advantage of Rsic-v or vertical integration the same way intel is right now..\n\nY’all are acting like intel and amd play on the same level lol, amd makes cpus and take margin cuts to prioritize their products at tsmc. This was their only advantage along with their underdog narrative . Unfortunately this element of the business model has been taken from beneath them by intel after news broke recently that intel will be the first customer of tsmc 3nm process next year!! \n\nYes amd will continue to make good chips and their will be demand for second fastest chips (that’s amd for you…second fastest) but they won’t take intels lunch for longer then the next 12 months at most…then they’ve got to keep those 5% market share gains you’re all foaming over. \n\nI like amd, I like their products, I have a 3700x sitting in my girls work rig, but I won’t fool myself into thinking they won’t get crushed by a company much larger with much more capital to throw around now that they are willing to do so…the run up for amd was the past two years not the next two imho…maybe I’m wrong \n\nhttps://www.google.com/amp/s/www.tomshardware.com/amp/news/apple-intel-set-to-use-tsmc-3nm-node-for-2023-products-report",
        "created_utc": 1625527342,
        "id": "h46gv1q",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625556142.0
    },
    {
        "author": "fish60",
        "body": "TSM is subject to a lot of geopolitical risk. I am thinking the US government is going to want to subsidize INTC. They are a national security asset at this point.",
        "created_utc": 1625508961,
        "id": "h45hg6k",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625537761.0
    },
    {
        "author": "HillarysPornAccount",
        "body": "In a margin account, buy an ATM LEAP call and sell an ATM LEAP put (same strikes). You can do this on the INTC Jan23 $55 for a small net credit. This results in tracking gains and losses as if you own 100 shares but you received a credit to set it up, just uses a little margin. If your thesis doesn’t play out in time for expiration, you can often roll into new LEAPs for free or possibly another credit. Great for when you’re expecting an INTC turnaround and they delay their new chips by yet another quarter :)\n\nIf you’ve got time to kill before the catalysts truly start pumping the stock you can still sell shorter term calls against it just like you would a covered call. Now you’ve got a synthetic covered call, which sounds incredibly fancy at your next party.",
        "created_utc": 1625207874,
        "id": "h3ryx4w",
        "score": 5,
        "subreddit": "options",
        "created": 1625236674.0
    },
    {
        "author": "Pdicky69",
        "body": "\\*$INTC has entered the chat\\*  \n\n\nI know an idiot thats too much of an idiot to realize that Macy's is a value trap and is a terminal $0 stock. \"But the real estate value isn't marked to market\" The reality is that these companies even if they trade at a discount to book value, will cannibalize itself until its all gone.",
        "created_utc": 1625612169,
        "id": "h4aisix",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625640969.0
    },
    {
        "author": "Bouvill",
        "body": "Okay sure, but you invest to see growth, you expect the value to go up. Do you expect intel to go up?",
        "created_utc": 1625232207,
        "id": "h3sviov",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625261007.0
    },
    {
        "author": "ClaxtonGanja",
        "body": "A shrewd investor I see. I thought this was a crispy chip company like Intel but it is a games company. Games equals poker chips equals big casino money. \n\nCayman has no McDonald's restaurants.",
        "created_utc": 1625324996,
        "id": "h3xdeqj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625353796.0
    },
    {
        "author": "XWarriorYZ",
        "body": "NIO is partnered with MobilEye (Intel) to develop autonomous driving tech and has an agreement to supply the actual taxis once it’s ready for deployment.",
        "created_utc": 1625185731,
        "id": "h3qxirl",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625214531.0
    },
    {
        "author": "kai_n7",
        "body": "Whose dick até you sucking to get the Intel to make this play OP?",
        "created_utc": 1625866691,
        "id": "h4my5c9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625895491.0
    },
    {
        "author": "Impressive-Row1235",
        "body": "I think AMD would be a better buy rn. Because of their recent acquisition. Su is one of the best ceos of the past decade. And they have constantly been capturing market share from Intel. Just my opinion",
        "created_utc": 1625164533,
        "id": "h3pnics",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625193333.0
    },
    {
        "author": "Stoli1387",
        "body": "Lol wasn't expecting to see this one but was hopeful... everyone writing them off while revenue and FCF just keeps going up and up...price/fcf of like 6 lmao....Intel all day",
        "created_utc": 1625689016,
        "id": "h4e6muy",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625717816.0
    },
    {
        "author": "GSCToMadeira",
        "body": "&gt;If Intel doesnt do something in next 1 year then AMD will just eat it up raw..\n\nIntel has cash to last a longer than 1 year. A new CEO turning it around in just 6 months was never going to happen. Personally don't own any INTC as i think it's a bit of a gamble if they will be able to comeback or not but it's way too early to tell.\n\nAs someone not from the US, a detail a lot of people don't realise is Intel still dominates a lot of foreign markets. Where i live AMD is way overpriced and Intel is still the more competitive choice by far.\n\nI'd say they easily have 5-8 years to make a comeback, question is will they?",
        "created_utc": 1625518242,
        "id": "h45zqio",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625547042.0
    },
    {
        "author": "Apcorp78",
        "body": "I’ve had my eye on Intel. Looks like it may be a good buy right now. Any thoughts? Seems like it’s at a discount",
        "created_utc": 1625166012,
        "id": "h3pqy9r",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1625194812.0
    },
    {
        "author": "sharist_DIY_bio",
        "body": "I was really curious about the Intel board advisement on this play, by Omar Ishrak, who obviously led the way for Medtronics implantables. So, my thinking back two warrant flips ago on this one, was to think about Intel and what they are doing that is related. This is what I came up with as pure speculation: https://www.intel.com/content/www/us/en/newsroom/news/sandia-national-labs-neuromorphic-computing.html#gs.5d0opq So, the best thing Intel has going for it now is chip on chip neuromorphic computation. The best thing Mr. Ishrak did was bring the pacemakers to market. So, let's say I want a personalized AI, that learns from me and continuously recalibrates for my unique body in real time. I'm gonna need Intel level computational support to run my implantable, like a pacemaker. The big problem Mr. Ishrak ran into in his life was that the pacemakers got hacked. So, bear with me, if I'm a theoretical whale, I can afford a badassed implant. 1) I'm wise enough to know I want it to be AI &amp; computationally gifted, super smart, and personalized. 2) I need that implant to be autonomous and never talk to the cloud for security reasons, as if my health data goes public or gets hacked, it can be used to tank my stonk, or kill me, or in the case of a world leader, bring political turmoil. I'd like to see CPUH go visionary and make a chip on chip neuromorphic device that is implantable. But I don't know of any such company in the OPs ecosystem, so elegantly outlined.My question ?? who is doing this, ...and even if they are, they might be in stealth mode. ;D Fun, to speculate. I like this ticker.",
        "created_utc": 1625239770,
        "id": "h3tcguw",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1625268570.0
    },
    {
        "author": "roald_1911",
        "body": "To me, the apple story is more important in that it shows ARM based processors can beat intel processors. Apple builds laptops that don’t need fans. And they also have good performance. And let’s face it, they are in the business of building processors for less then 10 years.",
        "created_utc": 1625374608,
        "id": "h3zs3uy",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1625403408.0
    },
    {
        "author": "Jordibato",
        "body": "Their low powered gpu's are already being shipped but they're far from jawdropping, and by the time they launch the 3070 competitor amd and nv will already have launched a new gen of gpu's.\nWhilst intel's 10nm is denser that tsmc's 7, tsmc's is a 2018 node and  hasn't been their best for close to a year whilst intel still has to prove that they can produce big dies on 10nm, and to say nothing of the delays their 7nm is rumored to be suffering. \nOn the other hand intel is still the largest us based semiconductor manufacturer, and the most advanced so IFS could boom sooner than expected but even on the best case that won't be until 2023. In the meanwhile i only see pain for intel \nTLDR: i'd gladly sell intel 01/2023 60c",
        "created_utc": 1625520751,
        "id": "h464k3o",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625549551.0
    },
    {
        "author": "jin0004",
        "body": "Are you sure Intel has the fastest single core speed? As far as I'm aware, ryzen 5 completely dominates both single thread and muti thread performance compared to 11 gen",
        "created_utc": 1625530215,
        "id": "h46m1rf",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625559015.0
    },
    {
        "author": "TiltMastery",
        "body": "With all the analytics, you people are ignoring the fact that their products are getting worst by the second + AMD and NVIDIA are both creating masterpieces both in CPU and GPU. They are eating INTEL like it's nothing. I would avoid INTEL at all cost.",
        "created_utc": 1625514231,
        "id": "h45rugd",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625543031.0
    },
    {
        "author": "NeelAsman",
        "body": "Just give tsmc some time, intc will be forced to turn over to them",
        "created_utc": 1625541615,
        "id": "h476g30",
        "score": 3,
        "subreddit": "investing",
        "created": 1625570415.0
    },
    {
        "author": "ThePandaRider",
        "body": "TSMC is years ahead of Intel but Intel has also booked a chunk of TSMC's 3nm capacity and I wouldn't be surprised if Intel takes AMD's approach to their fabrication problems by outsourcing fabrication of their chips to TSMC and Samsung.",
        "created_utc": 1625518525,
        "id": "h460a66",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625547325.0
    },
    {
        "author": "Hugh_Mongous_Richard",
        "body": "Intel IMO is a great company and will be one of the core companies for the future of the US. Domestic semiconductor fabrication, design, and production are pretty important.",
        "created_utc": 1625621842,
        "id": "h4b140a",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625650642.0
    },
    {
        "author": "HillarysPornAccount",
        "body": "LEAPs are a specific type of option (Long-Term Equity Anticipation) that expire more than 1 year out. Right now most LEAPs are for January 2023, and I think we'll see some January 2024s coming out in the next few months.\n\nWith the synthetic long, you should aim for as far out into the future as possible. This allows ample time for your investment thesis to play out (somewhat moot because you can roll indefinitely), and more importantly helps with taxes if you make gains on the long call (assuming USA here). No need to worry about the greeks in this strategy because the long call and short put offset the greeks on each other, but important to know your delta will come out to 1 after you buy the call and sell the put. Opening 1 of these positions with a delta of 1 means you are tracking the gains and losses of 100 shares. That's what gives this strategy the leverage it has, because you get a delta of 1 while sometimes getting paid to open the position.\n\nBuying a call does not take care of the collateral for the written put and this strategy will use some of your available margin. Most securities will require 30ish% collateral for the short put, and higher for more volatile securities. So in this instance, entering at the 55 strikes for INTC will require $1,650 of margin, but you'll receive $.10 credit with yesterday's prices. Compare that to the cost to buy 100 shares, which is about $5,600 today, so this is where the leverage shows.",
        "created_utc": 1625213504,
        "id": "h3s5uhj",
        "score": 3,
        "subreddit": "options",
        "created": 1625242304.0
    },
    {
        "author": "Apcorp78",
        "body": "Intel looks like a better buy right now, to me. Qualcomm looks like it’s been on bit of a run",
        "created_utc": 1625165719,
        "id": "h3pq9l3",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625194519.0
    },
    {
        "author": "IllmaticaL1",
        "body": "That’s not accurate, they do have FCF and are more innovative than INTC.  In fact they recently announced buy back and I never said I would buy at this level. I would hold at my cost basis at $60 per share.",
        "created_utc": 1625354201,
        "id": "h3yw4w3",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1625383001.0
    },
    {
        "author": "LeoFireGod",
        "body": "Amd NVDA and somewhat intel are in a weird cluster fuck of yo-yo land.   Buying calls on dips and selling the first green day is the way for amd rn.",
        "created_utc": 1625688982,
        "id": "h4e6k3m",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625717782.0
    },
    {
        "author": "Responsible_Paint_24",
        "body": "I look for familiar, household names, like Intel, GE, Chevron, Kohl's, Conagra, Kroger, Fox, etc.  I check out the PE first.  I then look at 1 week, 1 month, 3 month performance to see if now appears to be a low entry point.  I check debt to be sure the company doesn't appear to be on the ropes (but I am not as careful about that).  I then look for the recent headlines to see if there is a reason it's down.  If not, and if it pays good premium per #3, I'll bet on it.",
        "created_utc": 1625593253,
        "id": "h49di82",
        "score": 3,
        "subreddit": "options",
        "created": 1625622053.0
    },
    {
        "author": "SorryLifeguard7",
        "body": "This.\n\nMy first job (fuck it was a decade ago) was fixing and building computers (mainly towers), I saw then how Corsair and AMD  could have had an uphand over Intel in the gaming sector. Never did I think this much. Gotta admit that Lisa is a great manager and Intel did some rookie (albeit) mistakes.\n\nLong AMD, but also buy when everyone is fearful of INTC.",
        "created_utc": 1625503482,
        "id": "h456n23",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625532282.0
    },
    {
        "author": "Jordibato",
        "body": "Yes intel is trying to turn arround by r&amp;d  but the earliest i'd expect them to bare results is 2024 and even then it's not even assured, they are facing heavy competition from within the x86 space, and from outside, (ARM risc-v, apple silicon), their gpu's are still in their infancy and both amd and nv are firing on all cilinders and IFS, their just launched foundry service seem to be closer to SMIC, GloFo than TSMC or samsung. Probalby if they manage to rise again it will be in the 4-6 years horizon and by then the price may have fallen further. Any noney they might get from the govt should go to fund the az fabs",
        "created_utc": 1625519292,
        "id": "h461rby",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625548092.0
    },
    {
        "author": "madeinph1la",
        "body": "I’m definitely bullish, but as others have said, it’s a long term horizon. Intel is an excellent major chipmaker, in a world in which chipmakers are only increasing in importance.",
        "created_utc": 1625520223,
        "id": "h463jl8",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625549023.0
    },
    {
        "author": "flobbley",
        "body": "Seconding Intel, yes they're not doing great right now but it wasn't that long ago that you only bought from AMD if you couldn't afford Intel. They got complacent and fell behind, but I'm sure that's kicked them into gear. Of course there is risk there but that's the case with all undervalued stocks, they're undervalued for a reason.\n\nI hold Autodesk currently but I dont think it's undervalued, probably just about where it should be tbh.",
        "created_utc": 1625486992,
        "id": "h44dva1",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625515792.0
    },
    {
        "author": "stevejam89",
        "body": "Why would they subsidize Intel but not TSMC when TSMC is investing billions more than Intel into fabs located in the US?",
        "created_utc": 1625522820,
        "id": "h468ib2",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625551620.0
    },
    {
        "author": "RhinoMan2112",
        "body": "You're sort of assuming/implying Intel is done as a company which is a bit extreme, good companies can go through rough patches.",
        "created_utc": 1625438173,
        "id": "h42k91y",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625466973.0
    },
    {
        "author": "BobandSteve",
        "body": "I literally have 0 intel position. I had a small one for a couple months and sold it at literally a $4 loss. if ur gonna read through my comment history, at least actually READ it",
        "created_utc": 1625419345,
        "id": "h41j8ag",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625448145.0
    },
    {
        "author": "_Floriduh_",
        "body": "I don’t mean to say it isn’t a risk, but for me personally I think TSM would be very careful about how they interact with one of their largest competitors..\n\nIf I’m TSM I’d have anxiety every step of the way working with Intel who would love to sniff out a trade secret or two that they could use to supercharge their fab processes.",
        "created_utc": 1625255449,
        "id": "h3ue80k",
        "score": 3,
        "subreddit": "investing",
        "created": 1625284249.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Intel gained back market share on steam survey, su bae says supply chain issues are still really gay",
        "created_utc": 1625688930,
        "id": "h4e6g12",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625717730.0
    },
    {
        "author": "SomewhatAmbiguous",
        "body": "I'm really not sure how something as aggressively priced as NVDA could possibly be considered a \"safe haven\".  It could drop 80% and it would still be trading at 20X earnings (a fairly normal amount) if Intel and AMD did the same they'd be at 2.5X and 4X respectively, which is effectively impossible.\n\nObviously there's a lot of potential for upside with NVDA but there's massive risk to balance that, hence not a safe haven.",
        "created_utc": 1625752044,
        "id": "h4h176g",
        "score": 3,
        "subreddit": "investing",
        "created": 1625780844.0
    },
    {
        "author": "hahdbdidndkdi",
        "body": "Did it apply to Cisco and intel and unysis in 1999?",
        "created_utc": 1625496979,
        "id": "h44tvav",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625525779.0
    },
    {
        "author": "Responsible_Paint_24",
        "body": "Intel is good even when assigned.  I would sell $57 expiring 7/9 for even better premium.  While 29/29 sounds good, you're leaving money on the table.  Too safe, especially with a stock which doesn't require much caution.",
        "created_utc": 1625528983,
        "id": "h46jttk",
        "score": 3,
        "subreddit": "options",
        "created": 1625557783.0
    },
    {
        "author": "ShortPutAndPMCC",
        "body": "I have the same bullish views on INTC for short puts and JD",
        "created_utc": 1625564065,
        "id": "h47ygee",
        "score": 3,
        "subreddit": "options",
        "created": 1625592865.0
    },
    {
        "author": "stevoacp1",
        "body": "i love $AMD, however comparing them to NVDA is not the right move. NVDA is a different beast in that they have the growth of AMD while having the stellar gross margins. Investors are willing to pay a premium for NVDA because of how stellar they are in printing cash and profits. That being said, AMD deserves to be priced closer to NVDA than Intel. I do not believe AMD and Su Bae are focused on catching NVDA, and are more concerned with taking market share from and crushing Intel. All the DDs written on here continue to ignore how important the Xilinx merger is. It was hated on by many, but Su Bae is no moron, she is strongly positioning AMD to dominate the CPU and Semi-Custom solutions. AMD will continue to make progress in the GPU and gaming market but the growth and tendies will come from expanding further into and dominating the server industry and building strong relationships that will establish profits for years, as well as expansion into 5g, aerospace and defense, and AI.",
        "created_utc": 1625575783,
        "id": "h48d31e",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625604583.0
    },
    {
        "author": "littlered1984",
        "body": "Intel is a customer of TSMC and is more than just a foundry.",
        "created_utc": 1625512798,
        "id": "h45p1fa",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625541598.0
    },
    {
        "author": "HillarysPornAccount",
        "body": "I’ve been running a synthetic long on INTC and selling some calls against it while this new CEO hopefully turns the ship around",
        "created_utc": 1625205743,
        "id": "h3rw23w",
        "score": 2,
        "subreddit": "options",
        "created": 1625234543.0
    },
    {
        "author": "Whiteasian56",
        "body": "Happened on SKLZ, PRPL, RKT, FDX, QCOM, DIS, SBUX, BABA, GE, UBER, LYFT, NKE, V, WMT, INTC, TGT, KO, DAL, CCL, UAL, LUV, PYPL, NCHL, and RCL as well. Very weird",
        "created_utc": 1625192652,
        "id": "h3raojg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625221452.0
    },
    {
        "author": "sharist_DIY_bio",
        "body": "Yup! totally into [Loihi](https://www.intc.com/news-events/press-releases/detail/1420/intel-and-sandia-national-labs-collaborate-on-neuromorphic) and [DNA as data for that reason.](https://www.twistbioscience.com/themes/custom/twist_theme/assets/DNA_digital_data_storage_whitepaper_2017.pdf) It sucks when I wake up naturally at 4 am. I get it. I often say to myself: calm the fuck down! Nobody likes this shit! LMFAO! Gonna go hassle my brother now. I've hassled all you y'all for too long this lively Saturday morning. The reading thing has been a problem for me in the past. It is a problem I'm willing to live with. But I hear you. Working on it. Actually make my living at at it. ;D Just not on Reddit.",
        "created_utc": 1625323362,
        "id": "h3xadtm",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1625352162.0
    },
    {
        "author": "redtexture",
        "body": "Your worst case scenario is if INTC drops in value 25%.",
        "created_utc": 1625265508,
        "id": "h3uzvgz",
        "score": 2,
        "subreddit": "options",
        "created": 1625294308.0
    },
    {
        "author": "anonyymi",
        "body": "Agreed that Intel is the slow moving boomer here.",
        "created_utc": 1625178497,
        "id": "h3qj7wk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625207297.0
    },
    {
        "author": "ck3po-a",
        "body": "Intel has been working well for me. Just been selling weekly's near the money.",
        "created_utc": 1625523696,
        "id": "h46a5ba",
        "score": 2,
        "subreddit": "options",
        "created": 1625552496.0
    },
    {
        "author": "marcuscontagius",
        "body": "Not as far as you’d think, their 14nm is equivalent to what tsmc and others market as 10nm…same with INTC 10nm = tsmc 7nm which is amd’s latest technology. Intel still has faster single core speeds which is the majority of cpu workloads. Don’t be fooled into thinking they are far behind in anything these companies you’ve mentioned actually do. They are design firms, they’re advantage doesn’t come from design but from fab yields which they actually don’t have any part in! That’s about as temporary as an advantage can get. Especially if intel understands this…",
        "created_utc": 1625527683,
        "id": "h46hhap",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625556483.0
    },
    {
        "author": "Stubtronics101",
        "body": "That's a good question. Really our phones are a quite powerful personal computer. But I was referring to the more traditional desktop and even laptop. Doesn't really matter the point I failed to articulate is Intel is branching out from being just a cpu maker, which is the right move or else they will end up like IBM.",
        "created_utc": 1625527658,
        "id": "h46hfnm",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625556458.0
    },
    {
        "author": "fish60",
        "body": "I would say the IBM comparison is relatively fair, but comparing the highest of high tech companies, that is, potentially, one tech breakthrough from cornering the chip market for ANOTHER several decades, to Exxon doesn't seem fair. It isn't like INTC is seeing world wide protests demanding the destruction of their industry.",
        "created_utc": 1625515139,
        "id": "h45tn1v",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625543939.0
    },
    {
        "author": "fish60",
        "body": "You are getting downvoted, but I tend to agree that, raw performance aside, AMD leaves something to be desired in the customer support, and, IMHO, software stability. Their GPUs have had quite a few pretty serious driver issues that went on for years. The firmware for some of their mobo chipsets have been buggy. I feel like you aren't always getting a fully fleshed out product.\n\nIntel, on the other hand, while notorious for changing chipsets, locking speeds, and other nasty behavior, has extremely high quality drivers and a long, long history of stability and reliability at scales that AMD is only beginning to dream of.",
        "created_utc": 1625514960,
        "id": "h45taa6",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625543760.0
    },
    {
        "author": "MotivatingElectrons",
        "body": "Just buy AMD, Avago, Intel, Nvidia, Micron, and call it good. (Maybe marvel and xilinx as well, but xilinx is soon to become AMD).\n\nThe shortages will persist for awhile, but they will recover. I am long semiconductor sector. Chips are everywhere now from computers to cars to microwave ovens and IoT devices. They are not going anywhere soon...",
        "created_utc": 1625788325,
        "id": "h4j86kn",
        "score": 2,
        "subreddit": "investing",
        "created": 1625817125.0
    },
    {
        "author": "tampow",
        "body": "Unless they pull a intel",
        "created_utc": 1625791836,
        "id": "h4jep7j",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625820636.0
    },
    {
        "author": "filtervw",
        "body": "There is one more aspect, this bull market can't run forever and it's already very extended. It's better to think of cost of opportunity while you stay on the bench waiting for Intel to come back. Intel will see revenues shrink for at least three years, I would better put my money in the SP500 and collect a decent 10% than 2% with Intel. If stock turns around and the leadership will execute don't expect Intel to rocket like NVDA.",
        "created_utc": 1625928578,
        "id": "h4pfrwg",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625957378.0
    },
    {
        "author": "gainbabygain",
        "body": "Here's something to get you wet. The once mighty INTC is now purchasing all of TSMC's 3nm production capacity\n\nhttps://www.asiantechpress.com/sources-intel-to-buy-full-tsmc-3nm-production-capacity.html",
        "created_utc": 1625830385,
        "id": "h4kwjdp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625859185.0
    },
    {
        "author": "zdonowitz",
        "body": "Sell the profit so you are back to your initial investment. Do whatever u want with the profits. But i have to say, there’s really no reason to sell Apple or Microsoft ever",
        "created_utc": 1625526060,
        "id": "h46eiwq",
        "score": 743,
        "subreddit": "stocks",
        "created": 1625554860.0
    },
    {
        "author": "Philanthropy-",
        "body": "I’m so close to giving up and just putting everything (with the exception of amazon and Microsoft) into an S&amp;P 500 index fund bc I have come to the conclusion that there is no way I can beat the market",
        "created_utc": 1625543377,
        "id": "h4799a0",
        "score": 195,
        "subreddit": "stocks",
        "created": 1625572177.0
    },
    {
        "author": "Machiavelli127",
        "body": "My version of MAGA: MSFT, AMZN, GOOG, AAPL",
        "created_utc": 1625441999,
        "id": "h42qx94",
        "score": 183,
        "subreddit": "stocks",
        "created": 1625470799.0
    },
    {
        "author": "amg-rx7",
        "body": "Apple Amazon Microsoft Nvidia PayPal Square Costco Walmart plus a few good EFTs",
        "created_utc": 1625437049,
        "id": "h42i7nt",
        "score": 172,
        "subreddit": "stocks",
        "created": 1625465849.0
    },
    {
        "author": "Yo_IDK_Dude",
        "body": "Without putting any thought into this at all… Microsoft",
        "created_utc": 1625265002,
        "id": "h3uyved",
        "score": 145,
        "subreddit": "stocks",
        "created": 1625293802.0
    },
    {
        "author": "Isunova",
        "body": "$MSFT is a stock a hold forever.",
        "created_utc": 1625431503,
        "id": "h427m94",
        "score": 138,
        "subreddit": "stocks",
        "created": 1625460303.0
    },
    {
        "author": "BrandedStrategy",
        "body": "I am not disagreeing with you but I would like to ask when do we consider a stock ethical? Here are a few examples...\n\nNike, Mars, Kraft, Apple, Google, Microsoft and Tesla (just to name a few) have all been accused and used child labour to keep operating costs low and profits high.\n\nTesla was accused of instigating a coup in Bolvia for their lithium.\n\nThe US government + energy companies invade countries, mine the oceans and frack the country to keep oil prices low.\n\nBig Pharma (in the US) monopolize life-saving drugs i.e. insulin, inhalers preventing many people from being able to afford healthcare. \n\nMcdonalds + Big sugar investing in studies to convince people that their products are not bad for you. Obesity is a huge problem, heart disease is one of the biggest killers.",
        "created_utc": 1625485732,
        "id": "h44caz7",
        "score": 115,
        "subreddit": "stocks",
        "created": 1625514532.0
    },
    {
        "author": "AyyyyyyyLemao",
        "body": "Pentagon plans to divide the work between Amazon and Microsoft per Bloomberg",
        "created_utc": 1625592687,
        "id": "h49c8n1",
        "score": 105,
        "subreddit": "stocks",
        "created": 1625621487.0
    },
    {
        "author": "discovery999",
        "body": "VUG, VOO, AAPL, GOOGL, MA, IEP, MSFT, AMZN, FB",
        "created_utc": 1625432475,
        "id": "h429j4f",
        "score": 90,
        "subreddit": "stocks",
        "created": 1625461275.0
    },
    {
        "author": "Oraclequest",
        "body": "$MSFT is great investment, great dividend, better returns.\n\nIt's a long term bet for sure.",
        "created_utc": 1625432396,
        "id": "h429dmd",
        "score": 89,
        "subreddit": "stocks",
        "created": 1625461196.0
    },
    {
        "author": "gupbiee",
        "body": "Make it free is my general policy. But with stocks like AAPL and MSFT I'd just hold cuz at the moment they're kinda too big to fail (or tank for the immediate future)",
        "created_utc": 1625537450,
        "id": "h46z84g",
        "score": 87,
        "subreddit": "stocks",
        "created": 1625566250.0
    },
    {
        "author": "FlameoHotman-_-",
        "body": "This has to be an unpopular opinion...and for the record, I distrust the CCP as much as the next person, but these crackdowns may not be entirely bad. Let's look at some examples:\n\n\\- So in this case, Didi's operation got suspended because \"Didi had illegally collected users' personal data.\"\n\n\\- Alibaba got fined because of monopolistic practices.\n\n\\- Ant Group's IPO got slashed because the CCP wanted to regulate Ant Group like an actual bank.\n\nTo be honest, these sound pretty reasonable to me. Facebook was in trouble for collecting data without content too. Remember the whole Cambridge Analytica scandal? But now everyone is hot for FB stocks.\n\nMicrosoft has been fined millions by the EU for monopolistic practices as well. But everyone loves Microsoft stocks nonetheless. \n\nAnd as to Ant Group, they are a massive financial service company that can offer customers credit. How come they don't get to be regulated like a bank? My point is that these actions make sense and good regulations is beneficial for investors too in the long run.",
        "created_utc": 1625412759,
        "id": "h415r1e",
        "score": 76,
        "subreddit": "investing",
        "created": 1625441559.0
    },
    {
        "author": "FaatmanSlim",
        "body": "Been holding MSFT For a while now. While it goes through periods like last week, where the stock pops 1-2% a day, this stock is a bit more of a slow burn. If you look back at the past 4-5 years, it as beaten other FAANG stocks at how fast it has grown, but at times, its growth can seem downright glacial.\n\nThis is not a \"get rich quick\" stock, but I feel it's definitely a long-term growth stock if you look out a few years into the future.",
        "created_utc": 1625432788,
        "id": "h42a4ii",
        "score": 65,
        "subreddit": "stocks",
        "created": 1625461588.0
    },
    {
        "author": "quickclickz",
        "body": "That was public information in March and then in May...\n\nhttps://www.bloomberg.com/news/articles/2021-03-05/microsoft-s-10-billion-pentagon-deal-at-risk-amid-amazon-fight\n\nhttps://www.fool.com/investing/2021/05/10/pentagon-considers-dropping-microsoft-jedi-effort/\n\nshe made her purchase in May.... when the information was already public.",
        "created_utc": 1625597132,
        "id": "h49m3tb",
        "score": 64,
        "subreddit": "options",
        "created": 1625625932.0
    },
    {
        "author": "Jr4044",
        "body": "Surprised MSFT takes so much scrolling to find",
        "created_utc": 1625442974,
        "id": "h42sk27",
        "score": 63,
        "subreddit": "stocks",
        "created": 1625471774.0
    },
    {
        "author": "BGoode348",
        "body": "Msft for sure.",
        "created_utc": 1625274503,
        "id": "h3vgk3w",
        "score": 59,
        "subreddit": "stocks",
        "created": 1625303303.0
    },
    {
        "author": "one8e4",
        "body": "Lawyers will win. \n\nTime to see if the law firms Amazon and Microsoft use are listed",
        "created_utc": 1625591358,
        "id": "h4999pr",
        "score": 55,
        "subreddit": "stocks",
        "created": 1625620158.0
    },
    {
        "author": "Dav1d13",
        "body": "AAPL/MSFT/GOOGL/AMZN and go back to my daily life, knowing that I am in good shape!",
        "created_utc": 1625160913,
        "id": "h3pf3j1",
        "score": 51,
        "subreddit": "stocks",
        "created": 1625189713.0
    },
    {
        "author": "360NoScopeDropShot69",
        "body": "The legend of Joco the shrimp man, Bry drinks his piss if Spy closes green, Chinese dam puts, Microsoft 200, Tesla battery day \n\nThere's a ton",
        "created_utc": 1625441327,
        "id": "h42pseo",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1625470127.0
    },
    {
        "author": "BornAcanthocephala10",
        "body": "Microsoft",
        "created_utc": 1625279465,
        "id": "h3vp4dw",
        "score": 45,
        "subreddit": "stocks",
        "created": 1625308265.0
    },
    {
        "author": "warrior5715",
        "body": "Yes, msft is enron.... “Bingo”",
        "created_utc": 1625448901,
        "id": "h432072",
        "score": 39,
        "subreddit": "stocks",
        "created": 1625477701.0
    },
    {
        "author": "Spork_Warrior",
        "body": "Just because they are advertising for a job that leverages Microsoft doesn't mean that's the only platform they use.\n\nCompanies like Palantir tend to have agreements with all major cloud providers and they have expertise in multiple platforms.",
        "created_utc": 1625251198,
        "id": "h3u4e34",
        "score": 39,
        "subreddit": "stocks",
        "created": 1625279998.0
    },
    {
        "author": "Dgarciarieckhof23",
        "body": "MSFT no doubt",
        "created_utc": 1625280295,
        "id": "h3vqhn6",
        "score": 38,
        "subreddit": "stocks",
        "created": 1625309095.0
    },
    {
        "author": "KyivComrade",
        "body": "DAAMN has been treating me well so far. \n\n\n\nDisney, Apple, Amazon, Microsoft and Netflix.",
        "created_utc": 1625562586,
        "id": "h47wy88",
        "score": 38,
        "subreddit": "stocks",
        "created": 1625591386.0
    },
    {
        "author": "Podcastsandpot",
        "body": "Apple, Tesla, Nvidia, Amazon, Microsoft, Square",
        "created_utc": 1625436337,
        "id": "h42gwdm",
        "score": 37,
        "subreddit": "stocks",
        "created": 1625465137.0
    },
    {
        "author": "The0Walrus",
        "body": "NVDA, DIS, MSFT",
        "created_utc": 1625442442,
        "id": "h42robt",
        "score": 37,
        "subreddit": "stocks",
        "created": 1625471242.0
    },
    {
        "author": "JaegerBrick",
        "body": "She sits on relevant committees that affect choosing vendors for various government contracts. There is no law punishing insider trading for US government officials. She likely did nothing criminal under the current law. She also made a ton on $MSFT a few months ago. We can say her husband made the trades, but at the end of the day she is the one on the relevant budget committees and her name is on the trades.",
        "created_utc": 1625591570,
        "id": "h499qm8",
        "score": 37,
        "subreddit": "options",
        "created": 1625620370.0
    },
    {
        "author": "cen0812",
        "body": "AAPL, MSFT, and VOO.",
        "created_utc": 1625438093,
        "id": "h42k3xl",
        "score": 36,
        "subreddit": "stocks",
        "created": 1625466893.0
    },
    {
        "author": "Sik-Kunt",
        "body": "She bought before the split was announced and before the government cancelled the MSFT Jedi contract. As if she already knew. Because she did.",
        "created_utc": 1625599335,
        "id": "h49qz6s",
        "score": 34,
        "subreddit": "options",
        "created": 1625628135.0
    },
    {
        "author": "financiallyanal",
        "body": "Gates has argued tech companies deserve a lower multiple due to obsolescence risk. People price some of these things like they’ll all have the durability of Coca Cola and margins of Microsoft. Very few discuss the reality of businesses not lasting forever, but I agree it’s critical.",
        "created_utc": 1625512633,
        "id": "h45oply",
        "score": 33,
        "subreddit": "SecurityAnalysis",
        "created": 1625541433.0
    },
    {
        "author": "Burgerb",
        "body": "I have that dilemma: I bought things like TTD, SHOP, NVDA, MSFT and others.  Stocks have multiplied and I want to take gains and put them in an Index fund.  However, I'm worried about the Tax implications when I sell.  What should I do?",
        "created_utc": 1625171016,
        "id": "h3q2jdm",
        "score": 33,
        "subreddit": "investing",
        "created": 1625199816.0
    },
    {
        "author": "seattletechy",
        "body": "I am surprised it didn’t take off after the Xbox/Microsoft integration last week.  Just to give you a perspective it takes almost 2-3 years to convince a company of Microsoft’s size to agree for an integration such as this one.  They have 100s of millions users.  While Paysafe is starting with the Xbox team Microsoft’s payments stacks serves the entire company including  Azure, office, windows and Teams.  Now imagine the size of the customer base Paysafe has.",
        "created_utc": 1625361862,
        "id": "h3z8ngq",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1625390662.0
    },
    {
        "author": "baskinginthesunbear",
        "body": "Paysafe is fucking useless to deal with from a merchant standpoint. Incredibly poor processes and controls. Constant fuck-ups. Zero accountability. Honestly surprised a company as big as Microsoft wants to deal with them.",
        "created_utc": 1625408936,
        "id": "h40y7aa",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1625437736.0
    },
    {
        "author": "bagelwhore_x0",
        "body": "Killing it! I’m at like 20% profit all time and I’m ready to just stick with trading blue chip stocks and msft is my favorite. It’s the most predictable imo. I missed out on it tho this week chasing some other stocks and now I learned my lesson not to stray from my bestie Microsoft",
        "created_utc": 1625252893,
        "id": "h3u8ct0",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1625281693.0
    },
    {
        "author": "averagebensimmons",
        "body": "I see so many mentions of AMD and APPL and I'm like hey you know there is MSFT?",
        "created_utc": 1625444726,
        "id": "h42vgpk",
        "score": 28,
        "subreddit": "stocks",
        "created": 1625473526.0
    },
    {
        "author": "lilaznjocky",
        "body": "Anything that is well diversified tbh. MSFT Amazon. They have their hands in everything, and they can’t have everything fail. Just wait to get 100 shares and sell covered calls on the way up.",
        "created_utc": 1625431497,
        "id": "h427lun",
        "score": 27,
        "subreddit": "stocks",
        "created": 1625460297.0
    },
    {
        "author": "Captain_Yolo_",
        "body": "Told my parents I'm finally taking the position at Microsoft. I'm tired of not making a difference.\n\n\nAs third shift janitor I promise to make sure those urinals are licked clean and the floors polished to a mirror finish 👌",
        "created_utc": 1625272323,
        "id": "h3vcn3n",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1625301123.0
    },
    {
        "author": "MyParanoidEyes",
        "body": "MSFT, GOOGL, VISA, Amazon, the big guns",
        "created_utc": 1625424318,
        "id": "h41tdwk",
        "score": 26,
        "subreddit": "stocks",
        "created": 1625453118.0
    },
    {
        "author": "Rclarkttu07",
        "body": "Doing the same with $25 each week split into apple Amazon and Tesla. Also buy 1 msft a month and one VTI. Hoping to sell my AMC shares to spread out if it ever takes off again.",
        "created_utc": 1625603775,
        "id": "h4a14ty",
        "score": 23,
        "subreddit": "investing",
        "created": 1625632575.0
    },
    {
        "author": "coolcomfort123",
        "body": "msft is on fire, it just keep going up.",
        "created_utc": 1625233776,
        "id": "h3syq7d",
        "score": 22,
        "subreddit": "stocks",
        "created": 1625262576.0
    },
    {
        "author": "WolfPackWSB",
        "body": "Yup that was me in October 2020 buying GME @ $11 and averaged all the way down to $7.87 after Microsoft said they would give GME a % of every digital sale on the Xbox console!! Put every penny I could $13,700 then another $138/week after that.. Made my 2 year old daughter a Millionaire",
        "created_utc": 1625663518,
        "id": "h4cm300",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1625692318.0
    },
    {
        "author": "Pdicky69",
        "body": "$NET is on a fundamental basis is over valued. They expect rev to be $500M+ this year but they trade at $33B. It’s been on of my biggest picked winners. \n\nHere is a quick breakdown of what the popular services they offer, highly scaleable and a HUGE TAM.\n\nhttps://www.freelancer.com/articles/web-development/cloudflare\n\nHowever I sold off at $75, $85 levels due to price action getting ahead of the fundamental business. I’ve exited about 50% of my position. I still have 200 shares because I believe, it could do some long term stuff well and be a $100B company. But I can’t allocate so much of my portfolio in this company vs a FB/AMZN/GOOG (where I get growth, balance sheet safety, and moat)\n\nFrom here, if you want to get in on the action. You have to believe they do a few things…\n1) surprise HEAVILY on revenue growth and forward guidance\n2) grow more into their cyber security suite of tools beyond just basic stuff like their widely used DDOS prevention (a ton of websites use them for this) and firewall \n3) Content delivery network investment trend continues and profit margins aren’t competed away with bigger boys entering the game (ie GOOG, MSFT, AMZN)\n4) website speeds overwhelmingly determine ranking on google and mobile searches\n\nCloudflare and Fastly are the two more popular services for websites and apps to use as they offer ease of use to speed up website access for users and support to prevent website downtime. Folks have frequently complimented on how easy cloudflare is to use.",
        "created_utc": 1625514830,
        "id": "h45t0z8",
        "score": 22,
        "subreddit": "stocks",
        "created": 1625543630.0
    },
    {
        "author": "Shadow23z",
        "body": "Msft",
        "created_utc": 1625160818,
        "id": "h3peviw",
        "score": 21,
        "subreddit": "stocks",
        "created": 1625189618.0
    },
    {
        "author": "defenstrate5731",
        "body": "Investing in ETFs, specifically the S&amp;P ones you’re going to come out in top. That’s why actively trading/day trading/swing trading people hate on is because you typically won’t be the market. \n\nPersonally, I have about 30% in VOO and rest in individual stocks, but big names like MSFT, FB,DIS, JPM, etc.  \n\nIf you’re lazy and don’t really want to do the research, stick to ETFs like VOO, VTI, VTSAX, etc.",
        "created_utc": 1625249575,
        "id": "h3u0irf",
        "score": 20,
        "subreddit": "investing",
        "created": 1625278375.0
    },
    {
        "author": "teslas_love_pigeon",
        "body": "Don't disturb the retards with your facts please.\n\nNext think you're going to tell me is that Palantir doesn't have deals with Facebook, Google, Microsoft, and Amazon and they are just listing react, vscode, and aws in job ad.",
        "created_utc": 1625255630,
        "id": "h3uenb0",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1625284430.0
    },
    {
        "author": "RunningJay",
        "body": "Let's take MSFT at 20%. Let's say you put $5000 in and you're now at $6000.  I always like to keep the capital invested and take only profit so I'd sell 4x MSFT, or if I was more confident only 3x @ \\~$832.95.\n\nNow technically you're not taking profits exactly, you're just taking cash off the table.\n\nWith AAPL, same theory, if you invested $1000, you're currently at $1500, so sell $500 worth to return to your original capital investement.\n\n&amp;#x200B;\n\nWhatever you do with that $ better out-perform MSFT or AAPL, otherwise, just leave it there.",
        "created_utc": 1625536498,
        "id": "h46xj51",
        "score": 20,
        "subreddit": "stocks",
        "created": 1625565298.0
    },
    {
        "author": "doggy_lovers",
        "body": "Microsoft in the 1990s was the most valuable company in the world switching spots with GE, it is currently the only company that was in the top 10 list in 1990 and is currently still top 10 right now (at #2 spot behind apple). It was the #1 company by marketcap in 2019 and march 2020.\n\nMoreover, It has never fallen out of the top 10 list for more than 20+ years even with failure of Ballmer, tech bubble crash, Nokia, etc. Now with the new ceo, I dont see it going out of the top 10 especially since it is so far ahead from #10 spot which is Alibaba at 600 billion market cap. (Microsoft is worth 2.1 trillion).\n\nBack in the 1990s #1 spot had 200 billion valuation compared to 100 billion for #10 spot. So now the Top 5 companies are much more valuable compared to the bottom 5 of the list. Unlike the 1990s the top companies were not investing to the future and focus on short term profits.\n\nMicrosoft continues to invest in the future with the cloud technology, ai, vr/ar tech as well as is extremely diversified with equal 33% weight in 3 different classified segments.(the other trillion companies aren't as diversified). Finally, it is one of two companies (other being JNJ) with triple AAA credit rating, higher than the US government. It faces less regulatory risk than tech giants competitors allowing for easy acquisitions thanks to its stellar balance sheet.\n\nSource: https://en.wikipedia.org/wiki/List_of_public_corporations_by_market_capitalization#2012",
        "created_utc": 1625340104,
        "id": "h3y6e91",
        "score": 19,
        "subreddit": "stocks",
        "created": 1625368904.0
    },
    {
        "author": "FlyersTime",
        "body": "Amazon \nNvidia\nMicrosoft \nApple \n\nThat’s all you fucking need",
        "created_utc": 1625662084,
        "id": "h4cjmmm",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1625690884.0
    },
    {
        "author": "harrison_wintergreen",
        "body": "ELI5: \n\n- Burry believes (as he wrote): \"passive investing has removed price discovery from the equity markets\". https://www.bloomberg.com/news/articles/2019-09-04/michael-burry-explains-why-index-funds-are-like-subprime-cdos\n\n- price discovery is the process of estimating a reasonable fair value for a stock. \n\n- because relatively few people are buying/selling stocks based on their fair value, prices for stocks are often being determined mainly by cash-flows. see Tesla or dogecoin for examples. Tesla sells under 1% all vehicles worldwide but is somehow worth *more than all the other carmakers combined* because lots of people were buying Tesla stock and not because of any financial status of Tesla. dogecoin started LITERALLY as a joke but somehow was more valuable than companies like Ford Motors only because a ton of cash flowed into Dogecoin. this is all sheer insanity by traditional stock valuation guidelines. asset bubbles are nothing new, but Burry believes it's being exacerbated by passive investing. \n\n- Burry believes this situation of prices being based on cash flows is similar to what happened in the housing bubble, when multi-zillion Collateralized Debt Obligations (CDOs) were being priced not by a reasonable estimate of their fair value but by cash-flows. \n\n- when flows reverse and lots of people want out of index funds, it will get ugly because so many stocks are linked/benchmarked to major stock indexes *including lower volume stocks*. consider VTI: the top holdings (Apple, Microsoft, Johnson &amp; Johnson) might have a billion shares in total and hundreds of millions of dollars trading each day. but the smallest company stocks might have only a few million shares and a few million dollars trading each day. if too many people want to sell all at the same time, it will drive prices down sharply because these stocks are so often sold as a bundle/unit. as Burry puts it: \"The theater keeps getting more crowded, but the exit door is the same as it always was\"\n\n&gt;since the guy predicted 2007-2008 crash.\n\nhe also predicted the dot-com bubble.",
        "created_utc": 1625611801,
        "id": "h4ai1k1",
        "score": 19,
        "subreddit": "stocks",
        "created": 1625640601.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "seriously ppl.\n\njust buy big tech calls.\n\n if 2020 hasnt taught you this... or the bounce from Feb/March correction, or May pull back... not sure what will.\n\nyeah you can buy meme shit and pray that this week is when it decides to do meme shit vs pump &amp; dump by ppl\n\nor you can buy AAPL, MSFT, GOOGL, AMZN, FB, and NVDA calls and make actual fucking money and be able to sleep at night.\n\n* poor? do AAPL/MSFT/FB monthlies + leaps on dips.\n\n* got $ to blow? GOOGL and NVDA calls apparently doesnt know when to stop mooning\n\n* adventurous ppl can do AMZN monthlies and try to time AMZN's year-long channel of low 3000s to 3500s.",
        "created_utc": 1625257131,
        "id": "h3ui223",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1625285931.0
    },
    {
        "author": "StonksInvesteur",
        "body": "MSFT 300 calls, anyone?",
        "created_utc": 1625571987,
        "id": "h487i74",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1625600787.0
    },
    {
        "author": "gcko",
        "body": "Almost same. \n\nHolding AAPL, MSFT, DIS, VCR all the way to retirement unless something major happens to these companies. \n\nOh and at least a couple shares of GME I bought at $69 which I will eventually transfer into my children’s college fund. It’ll make a good story.",
        "created_utc": 1625441988,
        "id": "h42qwkq",
        "score": 18,
        "subreddit": "stocks",
        "created": 1625470788.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Like MSFT?",
        "created_utc": 1625422990,
        "id": "h41qp81",
        "score": 18,
        "subreddit": "stocks",
        "created": 1625451790.0
    },
    {
        "author": "hardtoexplainnnnn",
        "body": "MSFT was going up like this back in january-february. same with the other tech stocks. all tech stocks seem to be rising a lot again lately too. i think the tech bull run is back.",
        "created_utc": 1625432779,
        "id": "h42a3tw",
        "score": 17,
        "subreddit": "stocks",
        "created": 1625461579.0
    },
    {
        "author": "TheFilterJustLeaves",
        "body": "Probably fucked. MSFT doesn’t pump. It is the blob slowly eating everything in its path.",
        "created_utc": 1625345803,
        "id": "h3yh6y5",
        "score": 16,
        "subreddit": "options",
        "created": 1625374603.0
    },
    {
        "author": "NigelRL",
        "body": "I bought MSFT puts so it will go higher 🚀",
        "created_utc": 1625609358,
        "id": "h4ad1hv",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1625638158.0
    },
    {
        "author": "CountTheForDown",
        "body": "Tech has fooled me a couple of times over the past couple of weeks. The most recent indicator  of the mega tech is msft. There's about a 15 buck difference between one peak to the next. It just hit the next 15 on friday.\n\nFrom what I saw in mid fed, no matter how great an earnings was it was a blood bath. No reason to expect different now.",
        "created_utc": 1625451161,
        "id": "h435dnr",
        "score": 16,
        "subreddit": "options",
        "created": 1625479961.0
    },
    {
        "author": "justsomescrub",
        "body": "Not so much diversifying as just straight up killing it. Operating income rose 189% from 2019 to 2020 with eps up 604%. Q1 2021 operating income is up 266% and eps is up 232% from Q1 2020 and it isn't *just* higher margins; Total revenue in 2020 was up 45% from 2019 and Q1 2021 total rev Is up 92% compared to Q1 2020. Oh and the XLNX acquisition or whatever pending china approval.\n\n  \nAND there are some tasty insider whispers IF TRUE insinuating next gen GPU performance above and beyond what they expect from Nvidia. FULL STOP. Not at bargain price points, or for certain niche applications just straight up expecting to have the best GPUs on the market next gen. Nvidia having something spicy up their sleeve non-withstanding; you never know with Nvidia.   \n\n  Add in plans to buy back 4 billion worth of shares over the next 4(?) Years with cash on hand and plans for 3nm production by 2024 and everything I hear about AMD makes me think up up up. They have new deals with Samsung for their phones and google/amazon for servers, to add to the pile of deals like making chips for Sony and Microsoft consoles. The future looks bright.\n\nI put 90% of my account in AMD last month when they were hovering around 80$ without a single worry and I haven't unwound my position yet. Hoping for 2021 guidance to be adjusted from 50% to 75% growth to set this thing off again. Or merger approval, whatever comes first.",
        "created_utc": 1625268525,
        "id": "h3v5p9o",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1625297325.0
    },
    {
        "author": "Jdog43349",
        "body": "Yeah cause Android isnt just as big as Apple, right? And Google doesnt own YouTube, right? \n\nDont listen to this guy, buy Google AND Microsoft.",
        "created_utc": 1625342689,
        "id": "h3ybbv1",
        "score": 15,
        "subreddit": "stocks",
        "created": 1625371489.0
    },
    {
        "author": "Mesmeryze",
        "body": "microsoft just been solid as a rock through the hard times sincr 2 years ago my god",
        "created_utc": 1625242013,
        "id": "h3ti1bl",
        "score": 15,
        "subreddit": "stocks",
        "created": 1625270813.0
    },
    {
        "author": "Guy_Who_Made_Money",
        "body": "Amazon may split, Ford may do a reverse split, Microsoft may merge with Apple, Disney is going to sell off the Mickey Mouse Family IP to focus on Marvel, EA is merging with Take Two, Nokia may actually make money.          \nNow buy those rumors I made up.",
        "created_utc": 1625363069,
        "id": "h3zak3h",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1625391869.0
    },
    {
        "author": "half0tempo",
        "body": "My 5 shares of MSFT are so solid, I transitioned to a lazy portfolio VOO and VXUS. But kept my 5 MSFT shares I bought during the heat of the pandemic. Never will let go.",
        "created_utc": 1625252960,
        "id": "h3u8ibm",
        "score": 15,
        "subreddit": "stocks",
        "created": 1625281760.0
    },
    {
        "author": "brbcripwalking",
        "body": "Imagine being a boomer\n\nCasually fucking buy MSFT at $0.10, AMZN at $1.73, and buy AAPL at $0.80 on some Forrest Gump shit.\n\nPull yourself up by the bootstraps youngin what do you mean you can't afford a home?",
        "created_utc": 1625186528,
        "id": "h3qz1jm",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1625215328.0
    },
    {
        "author": "Boomtown626",
        "body": "I haven’t sold a share of MSFT or aapl. Not have a sold a share of my yolo plays. What I’m selling are my reopening plays, my clean energy plays that don’t appear to be keeping up with the sector, and my long shot penny stocks. \n\nThe kicker: I’m only selling when I find something better - either a new position or building weight in the positions I’m most confident in.",
        "created_utc": 1625535521,
        "id": "h46vrg2",
        "score": 14,
        "subreddit": "stocks",
        "created": 1625564321.0
    },
    {
        "author": "creemeeseason",
        "body": "I've owned Microsoft since 2018. If I had a 20% stop loss it would have triggered in March of 2020, among other times (at $160 or so). Instead, I just held and it always came back up and is at $277 today. \n\nJust hold, especially with solid companies.",
        "created_utc": 1625332382,
        "id": "h3xrn7l",
        "score": 14,
        "subreddit": "stocks",
        "created": 1625361182.0
    },
    {
        "author": "Icommandyou",
        "body": "SPY and MSFT doing great. Memes down.\n\nNature is healing itself.",
        "created_utc": 1625256108,
        "id": "h3ufr4u",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1625284908.0
    },
    {
        "author": "FalconsBlewA283Lead",
        "body": "MSFT is such a machine",
        "created_utc": 1625254708,
        "id": "h3uci55",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625283508.0
    },
    {
        "author": "apooroldinvestor",
        "body": "20% of my portfolio is MSFT AAPL.  Am I ok?",
        "created_utc": 1625548835,
        "id": "h47h2yz",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625577635.0
    },
    {
        "author": "zxc123zxc123",
        "body": "Hi. I'm from the Intel side! I think AMD side shouldn't worry too much about INTC. It's a big old ship that's getting bombarded from all sides. The fact that it's a big ship means it's changes will take time. I'm giving Gelsinger a chance to right the ship, but it will take a long while to undo BSwan's bad moves, get the right people, develop the chips, and catch up to AMD. \n\nA plus side for everyone is that the semi-space is a growing area with electronification, digitization, and \"5G-cloudification\" of everything along with the increasing importance of AI &amp; tech in business and government. Semis are so important in fact, that at this point US Gov should really be looking at INTC/NVD/TI more like they did Ford/GM 100 years ago: as a strategic industrial/military resource. \n\nReal threat to AMD isn't INTC. INTC was the big market share holder in the past and isn't likely gaining any ground any time soon. What AMD and all the trad chip manufacturers should fear is FAAAM &amp; BAT. Apple has started designing it's own chips. They aren't going back to using outsourced chips. If history says anything it's that Apple will continue to cut others out as they continue to in-house their chips for their entire lineup while improving their chips just like how they kept improving their computers, just like how the iphone kept improving until NOK/MOT were beat, just like how a good chunk of the watch market is Apple watches, just like how Ipads have taken away from of the laptop space, just like how Apple TV keeps chipping away at cable, just like how the app store and Apple's eco system keeps growing, etcetcetc. There is nothing AMD/NVD/INTC can do to stop Apple. And Apple is just the first. MSFT also doing the same. Google, Facebook, and Amazon might follow suit. China's Tencent and Alibaba will likely copy what the US companies do as soon as Pooh Bear gets done man handling them.",
        "created_utc": 1625258081,
        "id": "h3uk775",
        "score": 13,
        "subreddit": "investing",
        "created": 1625286881.0
    },
    {
        "author": "ACELUCKY23",
        "body": "$MSFT, $AAPL AND $NVDA. I like $AMD, but I don’t plan to hold that as “forever” at the moment. \n\nPlease avoid meme stocks if possible, those are not meant to be long term investments.",
        "created_utc": 1625442592,
        "id": "h42rx5g",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625471392.0
    },
    {
        "author": "Sweaty-Bumblebee4055",
        "body": "All in on that AMD run before it turns into NVDA and gonna throw it all in on MSFT",
        "created_utc": 1625538228,
        "id": "h470kgk",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1625567028.0
    },
    {
        "author": "iceberg_crumble",
        "body": "Hey man hopefully you’re using other DD than this job post. I work in the SI and SaaS space - super common to have an alliance manager that runs the cloud relationship, especially given they both (MSFT and PLTR) have big gov contracts. \n\nI doubt the role is new - prob turnover or titling change.  Just google this title and you’ll see all major SaaS companies have this role or something similar if it can be integrated/sold with O365.",
        "created_utc": 1625574665,
        "id": "h48bc8w",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1625603465.0
    },
    {
        "author": "Perdix_Icarus",
        "body": "AMZN, MSFT and GOOGL are at ATH and looks like AAPL would also join them there soon.",
        "created_utc": 1625581920,
        "id": "h48om67",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625610720.0
    },
    {
        "author": "manofculture003",
        "body": "If you invested $1000 in Microsoft back in Dec 1999, in Oct 2016 you would have had $1000",
        "created_utc": 1625590254,
        "id": "h496s19",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1625619054.0
    },
    {
        "author": "heatd",
        "body": "MSFT and AAPL are 11% of SPY and 20% of QQQ",
        "created_utc": 1625549600,
        "id": "h47i36q",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625578400.0
    },
    {
        "author": "maz-o",
        "body": "Nope this is called timing the market and you know how the saying goes. \n\nI’m never selling my MSFT.",
        "created_utc": 1625156419,
        "id": "h3p4fun",
        "score": 12,
        "subreddit": "stocks",
        "created": 1625185219.0
    },
    {
        "author": "left_turn_signal",
        "body": "\"The bulk of the Pelosis' money comes from investments in stocks and real estate. Operating through Financial Leasing Services, his San Francisco investment firm, Paul Pelosi owns stock in companies including Microsoft, AT&amp;T, Cisco Systems, Disney, Johnson &amp; Johnson and a variety of tech stocks.\nReal estate investments include a four-story office building at 45 Belden St. in the Financial District, office buildings on Battery and Sansome streets near the Embarcadero, a building housing a Walgreens drugstore near Ocean Beach and other commercial property in San Anselmo.\nOther investments include a St. Helena vineyard worth between $5 million and $25 million, a $1 million-plus townhome in Norden (Nevada County), and minority interests in the Auberge du Soleil resort hotel in Rutherford, the CordeValle Golf Club in San Martin, and the Piatti Italian restaurant chain.\"\n\nLook at the date of that article 2007. \n\n(https://www.sfgate.com/politics/article/Pelosi-s-husband-prefers-a-low-profile-2660253.php)",
        "created_utc": 1625593216,
        "id": "h49df75",
        "score": 12,
        "subreddit": "options",
        "created": 1625622016.0
    },
    {
        "author": "6151rellim",
        "body": "That is scary to think. If I had a large sum to invest tomorrow I’d be right on the fence between Microsoft or Amazon.",
        "created_utc": 1625297154,
        "id": "h3wd7xz",
        "score": 12,
        "subreddit": "stocks",
        "created": 1625325954.0
    },
    {
        "author": "Marquis77",
        "body": "Nope. VMware does well with on prem virtualization but they are leagues behind AMZN/MSFT in terms of cloud capabilities.",
        "created_utc": 1625593358,
        "id": "h49dqjq",
        "score": 12,
        "subreddit": "stocks",
        "created": 1625622158.0
    },
    {
        "author": "_igg",
        "body": "Been in a coma for a year, did MSFT hit 200 yet?",
        "created_utc": 1625191614,
        "id": "h3r8q2u",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1625220414.0
    },
    {
        "author": "GoldDecision7",
        "body": "Good job MSFT, AMD, and AAPL. I might actually financially recover from joining this place.",
        "created_utc": 1625247693,
        "id": "h3tw1c9",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1625276493.0
    },
    {
        "author": "Shacrone",
        "body": "sir I don't know why you think pltr can be compared to msft",
        "created_utc": 1625334683,
        "id": "h3xw3yo",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625363483.0
    },
    {
        "author": "klumpbin",
        "body": "Yes. Amazon, Microsoft and google are all on the verge of bankruptcy, so you’ve essentially missed the boat /s",
        "created_utc": 1625548742,
        "id": "h47gyhr",
        "score": 11,
        "subreddit": "StockMarket",
        "created": 1625577542.0
    },
    {
        "author": "1foxyboi",
        "body": "SPY pays one, so does QQQ. \n\nAAPL MSFT too\n\nI would say not having a single dividend in a portfolio is the strategy outside the norm",
        "created_utc": 1625440295,
        "id": "h42nztf",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625469095.0
    },
    {
        "author": "DoesntUnderstandJoke",
        "body": "I’m amazing at selling covered calls. Msft 265c for $1.16. Now At $13. \n\nNice negative 10 bagger 📈😣🔫",
        "created_utc": 1625253307,
        "id": "h3u9apz",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1625282107.0
    },
    {
        "author": "throwitup1124",
        "body": "Go look at the top ten companies 10, 20, 30 years ago and see where they’re at today. In order to outperform the index, you’re suggesting that these companies will continue to outperform over the long term. MSFT, AAPL, FB, GOOGL, V market caps are already at mega levels and it’s a big assumption that they will continue to get bigger. While I do think they will continue to grow in the short/mid-term, I’d be cautious on just owning the top ten.",
        "created_utc": 1625173751,
        "id": "h3q8ts1",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625202551.0
    },
    {
        "author": "schittluck",
        "body": "MSFT all the way",
        "created_utc": 1625268165,
        "id": "h3v50zu",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625296965.0
    },
    {
        "author": "ShortPutAndPMCC",
        "body": "But have you seen the returns of just “blindly” investing in solid stocks like Microsoft, Google, Amazon, NVDA, AMD, SEA, TSMC, etc? They beat my returns easily and I’ve been following their price for 13 months. Makes me wonder why I followed them so long and didn’t buy, but learnt options for only 5 months and decided to go into it just because I thought I could make it work.",
        "created_utc": 1625563738,
        "id": "h47y4eh",
        "score": 11,
        "subreddit": "options",
        "created": 1625592538.0
    },
    {
        "author": "BobandSteve",
        "body": "I'm just gonna say, if fucking covid couldn't cause the crash of all crashes idk if its just gonna spontaneously happen.\n\nWhy would there be a correction to tech? What would make Apple or Microsoft lose 20% of market cap when they bring in a shit ton of cash. It can happen but I dont really buy inflation as the reason",
        "created_utc": 1625435036,
        "id": "h42eheb",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625463836.0
    },
    {
        "author": "uselessadjective",
        "body": "Sorry dont agree, PE ratio of AMD is still 20  It used to be 70-80 till last year.\nCompartively nVidia's PE ratio is 80. AMZN and GOOGLE also in 50s.\n\nOut of all Tech stocks only AMD is undervalued right now. \n\nHave been holding all below stocks from last 4 years\n\nMSFT\nFB\nAMD\nNVIDIA\nTWTR\nAMZN\n\nAMD is gonna fly very soon.",
        "created_utc": 1625346445,
        "id": "h3yidwv",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625375245.0
    },
    {
        "author": "ACELUCKY23",
        "body": "I feel like $MSFT is a stock everyone should have some money invested in at the moment. It’s been very impressive as of late and I don’t see things changing for some time.",
        "created_utc": 1625243749,
        "id": "h3tmk4g",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625272549.0
    },
    {
        "author": "TotheMoongirl21",
        "body": "I bought the shares when Microsoft was $231 and still holding. This is my long term not selling stock.",
        "created_utc": 1625258646,
        "id": "h3ulgpa",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625287446.0
    },
    {
        "author": "Qarantyl",
        "body": "Why is apple super expensive and msft only fair value, MSFT is trading at higher multiples than AAPL right now. I would say msft's 45x free cash flow is actually very overvalued. Its a great company but everyone seems to have such a hard on for it right now around here.",
        "created_utc": 1625638261,
        "id": "h4bs4lx",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625667061.0
    },
    {
        "author": "ImmySnommis",
        "body": "About half is wrapped up in MSFT, GOOG, AAPL and COST. Another quarter or so is in DE, PSTH and TSM. The test is a smattering of speculative stuff that's kinda just for fun - stuff like SPCE, NIO, MYRG, and some SPACs.",
        "created_utc": 1625422968,
        "id": "h41qnnw",
        "score": 10,
        "subreddit": "investing",
        "created": 1625451768.0
    },
    {
        "author": "Sheeple81",
        "body": "Does this mean Microsoft is a meme stock?",
        "created_utc": 1625251595,
        "id": "h3u5c5o",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625280395.0
    },
    {
        "author": "CokeRapThisGlamorous",
        "body": "This thread is likely due to the JEDI contract news that broke today, announcing that MSFT will not be the Pentagon's sole cloud provider. AMZN and MSFT have risen/dropped as a result. I imagine Pelosi's position would make her privy to this news in advance of the general public. Could be a reach that this is the reasoning for the move though.",
        "created_utc": 1625600624,
        "id": "h49tuct",
        "score": 10,
        "subreddit": "options",
        "created": 1625629424.0
    },
    {
        "author": "Sweaty-Bumblebee4055",
        "body": "AMD MSFT WISH let’s GO",
        "created_utc": 1625576659,
        "id": "h48el9w",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625605459.0
    },
    {
        "author": "Overall-Jaguar-445",
        "body": "ARKK-10.96%\n\nNVDA-35.68%\n\nQQQ-31.08%\n\nMSFT-22.28%",
        "created_utc": 1625598462,
        "id": "h49p0xw",
        "score": 9,
        "subreddit": "stocks",
        "created": 1625627262.0
    },
    {
        "author": "YourInnate",
        "body": "It's a matter of perspective and big picture stuff. If you bough a SPY leap the day before the market crashed last year from covid, and bought 100 shares the day before the crash in covid, the LEAP would be worth more today.\n\n2-5% a month seems super low, but options are a grind. When in doubt, zoom out. 2-5% a month is 25-60% a year. Consider the indexes historically return 10%, doubling that on your bad years and quintupling it on your good years seems like a good trade.\n\nAnother note, this past year has been a historic bull run/recovery for most of the stock market. You can't compare throwing money into microsoft or google and watching it appreciate vs selling options on the same underlying. Likewise, if you had been selling RIOT/MARA puts the first 4 months of the year, you could've been making 10% a week. \n\nEverything in the market is perspective. If you think 2-5% a month is too slow/boring... You might consider roulette.",
        "created_utc": 1625587456,
        "id": "h490gmj",
        "score": 9,
        "subreddit": "options",
        "created": 1625616256.0
    },
    {
        "author": "BigBrianBrand",
        "body": "Alibaba is the best Buy and Hold example that fits your question. \n\nIt has perceived government regulation risk. Similar to what Facebook has been through these last 3 years. As long as the financials continue to grow, the stock will eventually skyrocket. \n\nEtsy, VRTX, nVidia, Apple, Facebook, Amazon, Google, Tesla, and Microsoft are also moderate risk picks in terms of their current price",
        "created_utc": 1625176385,
        "id": "h3qeph1",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625205185.0
    },
    {
        "author": "Any_Relationship5605",
        "body": "whoever said buy MU calls for earnings can go fuck off in a corner",
        "created_utc": 1625141233,
        "id": "h3o9mbl",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1625170033.0
    },
    {
        "author": "Fayde",
        "body": "If you or someone you know got fucked by MU, just know that you're not alone. At Wendy's, we're all about serving up fresh loss porn, even if it means taking it up the ass.",
        "created_utc": 1625130861,
        "id": "h3nwhws",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1625159661.0
    },
    {
        "author": "DarkMatter917",
        "body": "Well MU just Thanos snapped $1200 from my balance",
        "created_utc": 1625146394,
        "id": "h3oiuu2",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1625175194.0
    },
    {
        "author": "Stocomx",
        "body": "Me: laying on couch sobbing almost uncontrollably \n\nSocial worker:  “ please show me on the doll where MU touched you “\n\nMe:  points to dolls prolapsed asshole.",
        "created_utc": 1625138735,
        "id": "h3o5wpa",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1625167535.0
    },
    {
        "author": "Stocomx",
        "body": "Praying “buy the dip” is a real thing for MU",
        "created_utc": 1625134539,
        "id": "h3o0mb2",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1625163339.0
    },
    {
        "author": "NrdRage",
        "body": "You are not a long time wsb'er.\n\nIf you were, you'd have a decade of experience being lured into an alley by a dolled up $MU only to get violently raped by its earnings hobo gang",
        "created_utc": 1625147334,
        "id": "h3okrpd",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1625176134.0
    },
    {
        "author": "_FriendlyFire",
        "body": "Earnings good, virtually every analysis and person that watches a chart for more than 10 seconds says at least 100 , MU has a fat cushion for the pushin  , lets make lots of money",
        "created_utc": 1625142383,
        "id": "h3obhpc",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1625171183.0
    },
    {
        "author": "Johnny_Menace",
        "body": "Whose down 99% on their MU calls raise 🤚",
        "created_utc": 1625148209,
        "id": "h3omm9g",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1625177009.0
    },
    {
        "author": "tallpaulpaultall",
        "body": "MU gets a price upgrade before earnings. Smashes earning. And then dumps. The circle of go fuck yourself",
        "created_utc": 1625136033,
        "id": "h3o2enk",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1625164833.0
    },
    {
        "author": "BidExotic6271",
        "body": "🚨🆘 MU, CLNE, BNGO All in!!!! 🆘🚨",
        "created_utc": 1625140975,
        "id": "h3o97um",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625169775.0
    },
    {
        "author": "eternalrefuge86",
        "body": "I have a pipe dream that MU will fly today",
        "created_utc": 1625134043,
        "id": "h3o01ai",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625162843.0
    },
    {
        "author": "iCancel69",
        "body": "I pray for all of us MU holders",
        "created_utc": 1625136338,
        "id": "h3o2s0o",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625165138.0
    },
    {
        "author": "The-big-vitamin-D",
        "body": "$MU being dumb",
        "created_utc": 1625144376,
        "id": "h3oezc9",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625173176.0
    },
    {
        "author": "Professor_Z1204",
        "body": "How the hell did we manage to actually lose money on MU???",
        "created_utc": 1625146778,
        "id": "h3ojmmc",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625175578.0
    },
    {
        "author": "fluffycalf65",
        "body": "Can't wait to watch my MU calls eviscerate at open",
        "created_utc": 1625145507,
        "id": "h3oh429",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1625174307.0
    },
    {
        "author": "DayMack8006",
        "body": "Didnt know investors hated MU so much",
        "created_utc": 1625146518,
        "id": "h3oj3vj",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1625175318.0
    },
    {
        "author": "LostLifeSavingsOnGME",
        "body": "Oh my god my MU calls lol",
        "created_utc": 1625146260,
        "id": "h3oil9x",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1625175060.0
    },
    {
        "author": "pasteypasty",
        "body": "The dump is fake and gay, MU will be green EOD",
        "created_utc": 1625136806,
        "id": "h3o3dai",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1625165606.0
    },
    {
        "author": "TheJpow",
        "body": "I need hugs from my fellow micron bulls. Feels terrible man",
        "created_utc": 1625146454,
        "id": "h3oiz4k",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1625175254.0
    },
    {
        "author": "Houghs",
        "body": "I was told to buy MU calls, I need to speak with customer service",
        "created_utc": 1625140838,
        "id": "h3o905c",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1625169638.0
    },
    {
        "author": "cantadmittoposting",
        "body": "4 minutes until MU FDs all Sudoku in unison",
        "created_utc": 1625146002,
        "id": "h3oi2tb",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1625174802.0
    },
    {
        "author": "oleh_____",
        "body": "Sold my draft kings shares to buy MU calls. Down 5k 🤡🤡🤡🤡🤡🤡🤡🤡",
        "created_utc": 1625148701,
        "id": "h3onnm7",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1625177501.0
    },
    {
        "author": "Stocomx",
        "body": "Haha MU. Jokes on you. My brother is letting me hide my car behind his house   I didn’t lose it all.  Hahaha.",
        "created_utc": 1625150322,
        "id": "h3or7ey",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1625179122.0
    },
    {
        "author": "TexasPickEm",
        "body": "MU destroyed earnings and the stock barely reacted. Wtf.",
        "created_utc": 1625137919,
        "id": "h3o4som",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1625166719.0
    },
    {
        "author": "Stocomx",
        "body": "Thanks MU.  Now I can’t afford to buy DNUT….  not the stock I mean can’t afford an actual doughnut",
        "created_utc": 1625140129,
        "id": "h3o7x32",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1625168929.0
    },
    {
        "author": "fwoot_fwies",
        "body": "MU shittiest stock in the history of the market",
        "created_utc": 1625146318,
        "id": "h3oipgq",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1625175118.0
    },
    {
        "author": "The-big-vitamin-D",
        "body": "MU will come back I mean you really think a chip company won’t make money?",
        "created_utc": 1625146413,
        "id": "h3oiw7m",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1625175213.0
    },
    {
        "author": "aapolitical",
        "body": "Who also bough MU right before close yesterday for $85? Need a high five here.",
        "created_utc": 1625146547,
        "id": "h3oj5y8",
        "score": 7,
        "subreddit": "stocks",
        "created": 1625175347.0
    },
    {
        "author": "69PutsOnYourPuts69",
        "body": "Hey MU gang, I've got something you need to hear\n\n#IT'S OK, WE STILL LOVE YOU",
        "created_utc": 1625136634,
        "id": "h3o35e0",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1625165434.0
    },
    {
        "author": "_Stino",
        "body": "I was confident with MU then it bent me over this morning",
        "created_utc": 1625147283,
        "id": "h3oknr3",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1625176083.0
    },
    {
        "author": "BurritoBurglar9000",
        "body": "Look I don't believe in a lot of things, but for the love of Santa I believe in MU to 90.  \n\nI say this with absolutely no copium.",
        "created_utc": 1625127075,
        "id": "h3nsf4f",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1625155875.0
    },
    {
        "author": "Sorry-Business-1152",
        "body": "If MU hits 85-86 today there’s no stopping it",
        "created_utc": 1625138602,
        "id": "h3o5q4t",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1625167402.0
    },
    {
        "author": "stonksupnoob",
        "body": "Alright MU. I have faith in you.",
        "created_utc": 1625140769,
        "id": "h3o8w8b",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1625169569.0
    },
    {
        "author": "garlicnoodle18",
        "body": "MU giving people ptsd. I hope it turns green yall",
        "created_utc": 1625142178,
        "id": "h3ob5gb",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1625170978.0
    },
    {
        "author": "abdul10000",
        "body": "What happening to Micron stock (MU) it dropped -5% just in the fist minute.",
        "created_utc": 1625146397,
        "id": "h3oiv3g",
        "score": 6,
        "subreddit": "stocks",
        "created": 1625175197.0
    },
    {
        "author": "C_DoGG_",
        "body": "This right? We feeling MU?",
        "created_utc": 1625136449,
        "id": "h3o2wxs",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625165249.0
    },
    {
        "author": "DadGang",
        "body": "Who tf told me to play MU earnings",
        "created_utc": 1625147252,
        "id": "h3okles",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625176052.0
    },
    {
        "author": "TheGhostofBillHwang",
        "body": "Those $MU puts did, in fact, print. Thanks for the donation, WSB",
        "created_utc": 1625150161,
        "id": "h3oqui2",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625178961.0
    },
    {
        "author": "atthegates421",
        "body": "Why the fuck did i listen to you people about MU",
        "created_utc": 1625146941,
        "id": "h3ojymm",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625175741.0
    },
    {
        "author": "Captain_Yolo_",
        "body": "STOP SAYING MU WILL COME BACK YOURE TANKING IT FURTHER",
        "created_utc": 1625146377,
        "id": "h3oitlx",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625175177.0
    },
    {
        "author": "chrotlee",
        "body": "Holy shit MU got fucked LOL",
        "created_utc": 1625147146,
        "id": "h3okdft",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625175946.0
    },
    {
        "author": "maddhy",
        "body": "MU gang feeling alright?",
        "created_utc": 1625149941,
        "id": "h3oqcrd",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625178741.0
    },
    {
        "author": "LostLifeSavingsOnGME",
        "body": "We’ll my MU calls are 100% fukt. Wonder how much they’ll be worth",
        "created_utc": 1625146215,
        "id": "h3oii0i",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625175015.0
    },
    {
        "author": "LQMango",
        "body": "bruh can 9am come already I need to see if MU fucked me over or not",
        "created_utc": 1625142272,
        "id": "h3obb4j",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625171072.0
    },
    {
        "author": "f0ster91",
        "body": "what the actual fucking fuck MU?\n\n\"best earnings ever\" - jumps straight off a fucking cliff at -6% 10 minutes into open  \n\n\nfuck my life and my fuck my unbelieveably unreal luck, what a fucking joke",
        "created_utc": 1625146894,
        "id": "h3ojv5g",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625175694.0
    },
    {
        "author": "Stonky69McStonkface",
        "body": "Lmao yall just couldn’t stay away from MU 90C",
        "created_utc": 1625140285,
        "id": "h3o85lb",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625169085.0
    },
    {
        "author": "stonksupnoob",
        "body": "UBS with a buy PT on MU. ITS COMIN BACK BABY",
        "created_utc": 1625142172,
        "id": "h3ob52r",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625170972.0
    },
    {
        "author": "bahetrick1",
        "body": "double down on 8/6 90C's for MU.  Market has grossly misinterpreted their ER.  It will correct as the market turns from a voting machine to a weighing machine",
        "created_utc": 1625149123,
        "id": "h3ookan",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625177923.0
    },
    {
        "author": "fluffycalf65",
        "body": "MU hurt me",
        "created_utc": 1625146322,
        "id": "h3oipqi",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625175122.0
    },
    {
        "author": "TheJpow",
        "body": "Mu will rise. I believe!",
        "created_utc": 1625135043,
        "id": "h3o17w3",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625163843.0
    },
    {
        "author": "NaNaNaNaNaNaNaNaNa65",
        "body": "My MU position stepped on my balls",
        "created_utc": 1625150744,
        "id": "h3os5in",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625179544.0
    },
    {
        "author": "therealcosmicl",
        "body": "Mu gonna gap my asshole at open 🥺",
        "created_utc": 1625140157,
        "id": "h3o7yky",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625168957.0
    },
    {
        "author": "Montgomery4461",
        "body": "Micron ceo gonna be on CNBC in an hour. Maybe we get a bump up!",
        "created_utc": 1625148251,
        "id": "h3omphi",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625177051.0
    },
    {
        "author": "Incendras",
        "body": "Seriously bears? Your argument against MU is \"BuT cHiNa?\" At least fucking try to come up with a reason to be retarded.",
        "created_utc": 1625149687,
        "id": "h3opsp5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625178487.0
    },
    {
        "author": "Pristine_Quality_747",
        "body": "i projected Micron to pop 90 before earnings release. quite sad premarket is down despite beating earnings and projected Q4 is good. hopefully trading hours later on will rise.",
        "created_utc": 1625132606,
        "id": "h3nye3k",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625161406.0
    },
    {
        "author": "finanicallyruined",
        "body": "MU already down 5%",
        "created_utc": 1625146737,
        "id": "h3ojjpl",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625175537.0
    },
    {
        "author": "drizzleV",
        "body": "I have been hurt enough to learn never buy before earning.\n\nBut I still have 30 MU from the last earning. Should have sold yesterday.",
        "created_utc": 1625147897,
        "id": "h3olygv",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625176697.0
    },
    {
        "author": "Flatcat83",
        "body": "Buying much more MU  bitches whos coming with me",
        "created_utc": 1625146308,
        "id": "h3oioqy",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625175108.0
    },
    {
        "author": "saw-it",
        "body": "AMD ignore MU today",
        "created_utc": 1625140171,
        "id": "h3o7zdy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625168971.0
    },
    {
        "author": "LostLifeSavingsOnGME",
        "body": " What’s the chances that my MU calls recover",
        "created_utc": 1625138388,
        "id": "h3o5fhc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625167188.0
    },
    {
        "author": "LostLifeSavingsOnGME",
        "body": "Just loaded up 100 contracts of MU 90C next werk",
        "created_utc": 1625146471,
        "id": "h3oj0dk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625175271.0
    },
    {
        "author": "JaketheBooth",
        "body": "If it’s green market wide like it looks like it could be, I think MU will run",
        "created_utc": 1625127529,
        "id": "h3nswrd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625156329.0
    },
    {
        "author": "Donastre",
        "body": "Wil $MU recover on open? \n\nI'm thinking yes, all expectations were beat.",
        "created_utc": 1625133695,
        "id": "h3nzmle",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625162495.0
    },
    {
        "author": "DMotorBoater",
        "body": "SWBI is saving me from MU, still running like a beast.",
        "created_utc": 1625146582,
        "id": "h3oj8ha",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625175382.0
    },
    {
        "author": "ITM_ENRON_CALLS",
        "body": "You're at the bargaining stage of MU bag holding.  Give it time, you will get to the acceptance stage of MU bag holding 🙂",
        "created_utc": 1625147532,
        "id": "h3ol6ps",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625176332.0
    },
    {
        "author": "Okchaz",
        "body": "is MU a good buy for a swing till end of year?",
        "created_utc": 1625149351,
        "id": "h3op27h",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625178151.0
    },
    {
        "author": "Incendras",
        "body": "FD calls on MU is the play for the day.",
        "created_utc": 1625148131,
        "id": "h3omgdt",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625176931.0
    },
    {
        "author": "seacago1",
        "body": "MU leaps- buyem",
        "created_utc": 1625148359,
        "id": "h3omxqm",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625177159.0
    },
    {
        "author": "finanicallyruined",
        "body": "MU below 80 today",
        "created_utc": 1625147243,
        "id": "h3okkq3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625176043.0
    },
    {
        "author": "arbmare",
        "body": "MU please No No Nooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo",
        "created_utc": 1625146531,
        "id": "h3oj4sn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625175331.0
    },
    {
        "author": "WhiskerTwister",
        "body": "The real OGs remember losing money on MU 90 already.",
        "created_utc": 1625126461,
        "id": "h3nrqmp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625155261.0
    },
    {
        "author": "apronstrings07",
        "body": "Lmfao are we really gonna go with “increased capex expenses” as a reasoning for this mu dip? I’m seriously considering buying more. Honestly ya know fuck em how dare they invest into themselves for the future!",
        "created_utc": 1625140247,
        "id": "h3o83it",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625169047.0
    },
    {
        "author": "patgamble",
        "body": "Is MU a lost cause?",
        "created_utc": 1625140246,
        "id": "h3o83gi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625169046.0
    },
    {
        "author": "LostLifeSavingsOnGME",
        "body": "My boy micron stop it 😫😫😫😫",
        "created_utc": 1625150840,
        "id": "h3osdbz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625179640.0
    },
    {
        "author": "Colombian-fullRetard",
        "body": "MU can’t literally go tits up except it’s literally going tits up.",
        "created_utc": 1625146965,
        "id": "h3ok0f0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625175765.0
    },
    {
        "author": "gkrangers",
        "body": "Did anyone buy puts on MU or did we all get hosed on our calls?",
        "created_utc": 1625134408,
        "id": "h3o0gjq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625163208.0
    },
    {
        "author": "Oktay23",
        "body": "Is there a hotline I can call for MU ? I’m screwed",
        "created_utc": 1625140712,
        "id": "h3o8t35",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625169512.0
    },
    {
        "author": "NaNaNaNaNaNaNaNaNa65",
        "body": "Micron went for blood lmao",
        "created_utc": 1625147072,
        "id": "h3ok86u",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625175872.0
    },
    {
        "author": "midwestia",
        "body": "MU about to have a 10% day 🤡",
        "created_utc": 1625149055,
        "id": "h3ooex1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625177855.0
    },
    {
        "author": "ismyusernameoriginal",
        "body": "Micron doing me dirty despite busting through earnings. Rip FDs",
        "created_utc": 1625147285,
        "id": "h3oknvq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625176085.0
    },
    {
        "author": "Thick-Acanthaceae-59",
        "body": "Can't believe MU calls are Fucked, really dropped 80% right on open",
        "created_utc": 1625148193,
        "id": "h3oml1h",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625176993.0
    },
    {
        "author": "360NoScopeDropShot69",
        "body": "Tossed a couple bucks at bombraider, at least it's canceling my MU losses",
        "created_utc": 1625150141,
        "id": "h3oqsvm",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625178941.0
    },
    {
        "author": "The-big-vitamin-D",
        "body": "Gee thanks MU",
        "created_utc": 1625130563,
        "id": "h3nw6cp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625159363.0
    },
    {
        "author": "LawbringerX",
        "body": "A question I’d beg to know myself. It beat its earnings and revenue and raised guidance as hard as Nike did, but where Nike saw a 15% share jump, MU has seen a 5% share decrease. I’ve definitely learned not to play earnings. It’s not worth the casino. It’s a total random bet basically.",
        "created_utc": 1625150087,
        "id": "h3oqoiq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625178887.0
    },
    {
        "author": "toydan",
        "body": "Damn all of you for what you have done to my $PLTR $MU and $WBA 🤬 \n\nI am just going to crawl over that corner and 😭 while my $NIO embraces me \n\n^also ^buying ^more ^of ^all ^3",
        "created_utc": 1625147286,
        "id": "h3oknz8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625176086.0
    },
    {
        "author": "Incendras",
        "body": "MU after an earnings crush, looks like the fires out.",
        "created_utc": 1625148322,
        "id": "h3omuwj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625177122.0
    },
    {
        "author": "Grundle_Monster",
        "body": "Me too I’m looking at a 1k loss right off the bat from MU calls so that’s fun!",
        "created_utc": 1625144996,
        "id": "h3og58v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625173796.0
    },
    {
        "author": "jeffadventure",
        "body": "I think MU could certainly reverse up today. The report was great and it didn't go down much after hours",
        "created_utc": 1625127381,
        "id": "h3nsr1y",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625156181.0
    },
    {
        "author": "StonksInvesteur",
        "body": "I want to see $MU calls loss porn",
        "created_utc": 1625137228,
        "id": "h3o3wb5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625166028.0
    },
    {
        "author": "Champion8082",
        "body": "Is MU going up sideways or down??",
        "created_utc": 1625149627,
        "id": "h3opnyr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625178427.0
    },
    {
        "author": "Grundle_Monster",
        "body": "NVDA bout to save me from MU.",
        "created_utc": 1625145872,
        "id": "h3ohtq6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625174672.0
    },
    {
        "author": "midwestia",
        "body": "Mu gonna have crazy volume today",
        "created_utc": 1625146987,
        "id": "h3ok21r",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625175787.0
    },
    {
        "author": "Hodl_God_Damn_You",
        "body": "You must be new here.  MU under performs = Stock goes down, MU fucking crushes it = Stock tanks.  MU climbs slowly between reports, tanks after they come out, every time, regardless of the report.",
        "created_utc": 1625149116,
        "id": "h3oojpe",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625177916.0
    },
    {
        "author": "Fit419",
        "body": "Why yes, I will take some more MU calls.",
        "created_utc": 1625149616,
        "id": "h3opn4s",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625178416.0
    },
    {
        "author": "Champion8082",
        "body": "lets see some loss porn on those MU calls",
        "created_utc": 1625147272,
        "id": "h3okmvn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625176072.0
    },
    {
        "author": "LukaDeezNutz",
        "body": "MU is the stock thats really getting manipulated smh",
        "created_utc": 1625146122,
        "id": "h3oibfi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625174922.0
    },
    {
        "author": "Stocomx",
        "body": "Suffering.  I remember the good ol days when mine suffered.  Thanks to MU mines out of its misery",
        "created_utc": 1625149970,
        "id": "h3oqf1l",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625178770.0
    },
    {
        "author": "dreamthekeytoreality",
        "body": "Razer sell entire laptops! \n\nAll Corsair do is buy micron (and other) ram sticks and put their heatsink on it. \n\nThey own a huge market share of the pc case industry... I have a 400R myself.",
        "created_utc": 1625150930,
        "id": "h3oskhc",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1625179730.0
    },
    {
        "author": "Conker_Da_Beast",
        "body": "We getting loss porn on the MU FD's?",
        "created_utc": 1625146171,
        "id": "h3oietd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625174971.0
    },
    {
        "author": "MUPleasFlyAgain",
        "body": "Real OGs remember company powerball infinite money glitch, getting destroyed by MU 90c is nothing.",
        "created_utc": 1625126671,
        "id": "h3nrz14",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625155471.0
    },
    {
        "author": "WhiskerTwister",
        "body": "The real OGs remember losing money on MU 90 already.",
        "created_utc": 1625126461,
        "id": "h3nrqmp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625155261.0
    },
    {
        "author": "duosharp",
        "body": "I have a modest position in Infineon (listed in Germany). I also like Micron, but this is for the broader industry rather than automobiles. Don't see these two names mentioned in the sub often.",
        "created_utc": 1625126619,
        "id": "h3nrwx4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625155419.0
    },
    {
        "author": "chilledcamo",
        "body": "Somehow I get the feeling that my 88 MU FDs are not going to print🤡",
        "created_utc": 1625126098,
        "id": "h3nrc0s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625154898.0
    },
    {
        "author": "BurritoBurglar9000",
        "body": "Shits gunna hit 4350 today w/ good data. That would completely offset my MU losses!",
        "created_utc": 1625125220,
        "id": "h3nqcht",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625154020.0
    }
]