[
    {
        "author": "bearcat2202",
        "body": "Never too late to get into $SNPS",
        "created_utc": 1626799647,
        "id": "h5w6p9z",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1626828447.0
    },
    {
        "author": "bankburn10",
        "body": "Right I don’t get it. I hold both SNPS and TEAM. SNPS is an earnings growth engine but somehow is underperforming compared to TEAM",
        "created_utc": 1627671264,
        "id": "h7464u0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627700064.0
    },
    {
        "author": "hendrix_srv",
        "body": "Do I get this right?  SNPS creates software for designing chips, right?  TEAM creates general collaboration software, yes?\n\nAside from the fact that TEAMs revenue growth is half again as fast as SNPS MRQ and it's long term revenue growth is far higher, TEAM's product has much larger market potential and thus can scale much faster.  Also TEAMs smoked revenue estimates and guided above street for it's coming quarter.",
        "created_utc": 1627708064,
        "id": "h766oo7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627736864.0
    },
    {
        "author": "PhysicsAndFinance",
        "body": "I was gonna say that I can’t believe you idiots are still up and commenting. But I don’t recognize any usernames. Is it possible that I stayed up so late I’ve stumbled upon a different groups of peeps. Like 3rd shift working late and running into 1st shift peeps 🥱🤔🤔",
        "created_utc": 1627813169,
        "id": "h7asd3g",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627841969.0
    },
    {
        "author": "JaketheBooth",
        "body": "Got $50k ready to send it this week 😈",
        "created_utc": 1627805002,
        "id": "h7ajbtw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627833802.0
    },
    {
        "author": "hardcore_softie",
        "body": "It's not about mortality rates, it's about strain on healthcare systems and the potential for this virus to fuck up production, supply, distribution, and retail spending ability, particularly if median income declines while inflation rises.\n\nNot trying to be doom and gloom here, but those are the real major concerns with this virus on a macroeconomic level, not death counts.\n\nYou can't start rebuilding a town decimated by a forest fire until all embers are completely extinguished. Also, retail fear could lead to a significant selloff, whether or not it's really warranted. The American and global economies are also fairly heavily dependent on production in foreign markets, which covid could adversely affect, even if America doesn't see a spike in cases, which it already seems to be seeing.\n\nEveryone keeps saying how the markets are irrational, saying it'll keep going up, but they forget that it can work both ways. Investors can and have panic sold en masse based solely on fear rather than fundamentals.\n\nLots of other concerning indicators right now, but there are always concerns at any given time throughout history. An article about GOOGL facing potentially bearish headwinds due to anti-trust probes published in 2011 is practically verbatim the same as an article posted two weeks ago.\n\nTL;DR: Deaths from covid and Delta might not be up, but that is hardly the only factor here. It's really anyone's guess right now about how reality plays out and how the market reacts to it.",
        "created_utc": 1627803142,
        "id": "h7ah6xq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627831942.0
    },
    {
        "author": "Lloydy12341",
        "body": "“I’d just prefer to not lose it” …I feel that.",
        "created_utc": 1627803066,
        "id": "h7ah3rd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627831866.0
    },
    {
        "author": "Several_Situation887",
        "body": "To me, it depends on when that 50/75% happens.\n\nIf it happens 1 or 2 days into a 45 day contract, then yes, by all means, take the profit, and position yourself to sell it again when the premium is back up. You might even be able to catch the same expiration date for another good premium.\n\nIf that threshold doesn't happen until just a few days before expiration, I'd hold out for my 100%.",
        "created_utc": 1627809006,
        "id": "h7ansdv",
        "score": 1,
        "subreddit": "options",
        "created": 1627837806.0
    },
    {
        "author": "AutoModerator",
        "body": "Your submission was automatically removed because it looks like your post is better served as a comment in daily discussion thread which can be found [here](https://www.reddit.com/r/investing/about/sticky). Please also take a moment to review the [r/investing rules](https://www.reddit.com/r/investing/wiki/index/rules) if you have not yet done so. I am a bot and sometimes not the smartest so if you feel your comment was removed in error please message the moderators.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
        "created_utc": 1627806652,
        "id": "h7al5rf",
        "score": 1,
        "subreddit": "investing",
        "created": 1627835452.0
    },
    {
        "author": "UsingYourWifi",
        "body": "But if it goes the other way you'll make a shit ton. Not a great idea.",
        "created_utc": 1627806587,
        "id": "h7al35r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627835387.0
    },
    {
        "author": "Cleangreenprofit",
        "body": "The upper bound is an extreme anchor that does not represent a reasonable range for the fill price. If your using a Canadian broker, They can factor in your buying power when considering assignment risk. If they know you have to sell it to realize the gain and there is no other buyers at over 15, the exempt broker dealer than knows your risk thresholds won’t allow you to exercise. The credit risk associated with holding junk bonds vs calls on a junk bond ETF is entirely different and prices accordingly to the counterparty credit risk.",
        "created_utc": 1627806578,
        "id": "h7al2sc",
        "score": 1,
        "subreddit": "options",
        "created": 1627835378.0
    },
    {
        "author": "TJMBeav",
        "body": "It drops to 84% in 8 months based on a small non peer reviewed study. 84% is better than the J n J vaccine at the start.\n\nBut everyone on the telly is freaking so it could impact the market. All I'm worried about. Not the VID.",
        "created_utc": 1627813187,
        "id": "h7asdv7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627841987.0
    },
    {
        "author": "tomambrose0501",
        "body": "Freetrade is a great app for investing, I use it myself super simple and easy to understand",
        "created_utc": 1627814616,
        "id": "h7atzyn",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1627843416.0
    },
    {
        "author": "nerfyies",
        "body": "I also work in software. People are not that aware of the cloud lock in. If you are using aws you will most likely keep using it forever (or run out of money) . Unless you develop your own private cloud you're hooked , but only a handful of large companies can do that.",
        "created_utc": 1627814597,
        "id": "h7atz6g",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627843397.0
    },
    {
        "author": "Many-Coach6987",
        "body": "This is a very loaded question and you cant do justice with writing a post. There are levels of unethical deeds but also variations. I don’t think that Goldman is more evil than Nestle, or Raytheon than big Pharma. They all cheat, corrupt and dismantle society in one way or another. Restrict water, sell war, dismantle society through anxiety and tribalism...whatever it is. Our world is driven by money and actors who seek gains for themselves, may it be power or money. If you want to live a moral life, move to a forest, live self sufficient. Anything else is just supporting unethical deeds in various degree. If I had to pick the worst: Big Tech. The power they have is worrisome. Over individuals. The markets. Society. With money, data and censoring.",
        "created_utc": 1627813411,
        "id": "h7asn7t",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627842211.0
    },
    {
        "author": "decisions4me",
        "body": "Criticizing people for using tools at their disposal and staking their claim is not wrong because (some of us) would not have done the same. \n\nWe don’t have a meritocracy. Smart people making policy decisions and being the ones to direct 40% of the resources in society would lead to MORE resources for all. Smart people would have a higher percentage of wealth and at a higher rate of acquisition, but also, there would be more resources for everyone else, AND there would be more resources in total. \n\nYes, we live in a world of cause and effect. Society is an illusion of contractual obligations but the fundamental force is violence. Ever action is just a probabilistic equilibrium of various forces.  \n\nWhy would anyone give up any control? What interest is there in abandoning power? \n\nThose who abandon power will probabilistically at some point let go of too much and cease to have power. This you disappear. The only ones who are left, are those tho don’t let go. Once you have power, you do everything to keep and maintain and generate more. (Even if you happen to be a mentally ill stupid parasite) why? Because the challenge to your power could be an illusion that the environment is more intelligent than you are, and that challenge might be not true, and just an illusion. Probabilistically, it’s best to avoid loss of power. That’s how you keep the power. \n\nI see what you mean. It’s all game theory (rational choice theory) \n\nIt’s all about cost-benefit analysis for option determination and application of mathematical analysis for strategic interaction in a competitive environments. \n\nwith competitive situations where the outcome of a participant's choice of action depends critically on the actions of other participants. \n\nBut no. I would not do the same. Eternal intelligence must be equated with eternal power.  That is the equilibrium. Everything else is just worthy of sacrifice. \n\nEventually, a bad decision will cause a loss of power. And these bad decisions are more likely with a lack of intelligence. But with eternal intelligence in a place of power (control over environment), these events are infinitely less likely than before. \n\nMental illness and power being together is an inefficiency in the system. And any friction or resistance to intelligence carries eternal harm. Of course this goes into ontology and epistemology. (Study of being and study of knowledge) \n\nBasically, people are localized (since a persons awareness and thoughts aren’t everywhere at once) - I.e. disabling one persons neurons doesn’t effect another ones consciousness. \n\nEssentially we are discussing Individualized, Localized, Sentient, sapient, conscious, autonomous(self-ruled) units. These units impart changes into the environment, or vice versa. \n\nAre all units the same? \n\nI would say no. Fundamentally, conscious choices define a “consciousness” and not all choices are capable of being made by every consciousness. \n\nAnd taking this into account, some “consciousness” will contribute tonight the inefficiency or a system more than other consciousness. \n\nAnd because of that, this warrants any applied judgement as valid, since a judgement is simply a recognition of an in efficiency that should not be there and only contributes to eternal harm. \n\nConsciousness tries to avoid eternal suffering, harm, and death. And there are conscious forces out there  that are eternally more aligned with inefficiencies. \n\nSo while rationally it might not be wise to ever “let go” of power and control over an environment, such actions so reveal the alignment to fundamental inefficiency. And such inefficiencies carry an eternal cost to existence. A cost that some existence would rather not pay. And thus, the legitimacy of a judgement is created.",
        "created_utc": 1627803262,
        "id": "h7ahbzt",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1627832062.0
    },
    {
        "author": "A_Grey_Dragon",
        "body": "Yo answer your question; yes, as a Rule Utilitarian, I do prefer to avoid certain companies and sectors entirely. I think the human species needs to collectively invest in things that improve the world, not the contrary. To discern what improves the world is no small feat, and this substantially limits diversity in my portfolio, but I think it is worthwhile.\n\nThe most difficult aspect in making a utilitarian moral calculation is wrapping one's head around Game Theory, making an informed decision, and sticking with it despite potentially tremendous pressure to yield. This also means understanding Kant's Categorical Imperative:\n\n&gt;Act only according to that maxim whereby you can, at the same time, will that it should become a universal law.\n\nOnce that's understood, the question is much more simple. Which maxims, when applied universally, will probably produce the most good? To answer that, I research ecology, biology, and anthropology for a sense of what has occurred, then I study contemporary issues (from macro to micro) in order to infer what is presently erroneous/detrimental, what functions, what is likely, and what is ideal.\n\nAt this point, I avoid doing anything within reason that (in my approximation) produces too many detrimental latent dysfunctions in exchange for (what amounts to) a meager reward. If the disparity between what's intended to benefit the world -- \"the world,\" defined as an ideal abstraction, an apparatus which best secures the fate of healthy organisms through the organic virtues of diversity, abundance, and equilibrium -- and what inadvertently causes the world harm is irreconcilable, I avoid the (in)activity.\n\nTL;DR\nYes, I avoid certain stocks on strictly moral grounds.",
        "created_utc": 1627802815,
        "id": "h7agt5k",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627831615.0
    },
    {
        "author": "bungholio99",
        "body": "Wallstreet week made it a focus Topic \n\nhttps://youtu.be/tANqvHIGYlA\n\nIt’s not that bad most things were already known and just put in place now, as it’s the best moment.\nThe chinese Gov want’s equitiy to grew for all people, this will hurt stock prices, so do it on a high to have less collateral damage.\n\nAll moves are good for the longterm developpment of the economy in China.\n\nIf you are unsure you can always use the time shift and check hang seng futures before US Market open and also the stock price at HK exchange.",
        "created_utc": 1627805681,
        "id": "h7ak2r2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627834481.0
    },
    {
        "author": "u2020vw69",
        "body": "I’m gonna guess he’s one of the guys on the Nikola sub acting like it’s no big deal. Saying it doesn’t affect the company since only Milton was indicted. Like everyone else there wasn’t in on the scam.",
        "created_utc": 1627802481,
        "id": "h7agf2u",
        "score": 1,
        "subreddit": "investing",
        "created": 1627831281.0
    },
    {
        "author": "cookingboy",
        "body": "Even the 3 months out Puts back then had a high enough premium that made me almost not wanna buy it (why would it? *Everyone* thought the stock must be going to zero right?). The longer dated puts just didn't make sense back then.",
        "created_utc": 1627802169,
        "id": "h7ag1qr",
        "score": 1,
        "subreddit": "investing",
        "created": 1627830969.0
    },
    {
        "author": "GoodCanadianKid_",
        "body": "They are actually making good money because a crash every decade or so is inevitable. This leads to an inevitable rally in bond prices in expectation of cuts to zero. It's insurance that's pays you to hold it.",
        "created_utc": 1627802294,
        "id": "h7ag702",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627831094.0
    },
    {
        "author": "Several_Situation887",
        "body": "To the title: the obligatory: *Oh, my!* \n\nNo, when you buy a call option, you are buying the right to purchase at that price before the option expiration. You are not obligated to buy.\n\nBrush up on your terminology for the acts of buying (or selling) calls and puts. It matters when you are asking for advice. Your second paragraph makes no sense as it is written.",
        "created_utc": 1627802416,
        "id": "h7agccp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627831216.0
    },
    {
        "author": "Elefantenjohn",
        "body": "I always found that reasoning fascinating.\n\nIt would be interesting if it actually happens. And yet, I'd be even more interested to see how the community reacts if Hood just keep crumbling.\n\nTo be fair, the 'DD' was almost kinda far-fetched",
        "created_utc": 1627802368,
        "id": "h7aga8p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627831168.0
    },
    {
        "author": "spoobydoo",
        "body": "You've got it backwards chief.\n\nTheta decay starts getting exponential at 3-4 weeks, so option buyers want a longer horizon. Theta gang *lives* in the 3-4 week range because that is where most of the theta returns come in. \n\nWhy do you think FD's are such a meme around here? 99% of them are just donations to theta gang.",
        "created_utc": 1627802938,
        "id": "h7agyai",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627831738.0
    },
    {
        "author": "Kurotan",
        "body": "To be fair at least in the US. We never did a full lock down. Many still had to go to work and out and stuff. And even then many just ignored it. We never had a full lockdown where we werent allowed to go out and that's the only thing that would have worked and ended this long ago. Couple that with the anti masters and anti vaxers and well, we are at something like 65% vaccinated and might as well just call it good and let the anti vaxers just die off. It's fine, they'll be replaced by immigrants willing to work and be decent contributors to society. As it is, I have seen a handful of people still even wearing masks. Hurry up and get the children vaccinated. Stop protecting the anti vaxers and just go back to normal.",
        "created_utc": 1627805183,
        "id": "h7ajj88",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627833983.0
    },
    {
        "author": "Han-ChewieSexyFanfic",
        "body": "Using Facebook and not investing in it is preferable to using Facebook and investing in it. Viewing ethics as all-or-nothing is a fallacy.",
        "created_utc": 1627803868,
        "id": "h7ai13u",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627832668.0
    },
    {
        "author": "Bamstradamus",
        "body": "You aint wrong, but the real issue is Blizzard as a whole, I feel like with the lack of Blizzard titles coming, no OW2 updates, what they did to Hots and how they are bleeding players from WoW and Hearthstone, plus them shedding talent and names over the last few years are all going to be brought into focus by the media as articles come out to shit on the company while its fresh.\n\n\nWould not be surprised if Activision pulls and Activision and kills the studio, rolls their IP's into another one and we get an Activision games launcher.  CoD or not if the 2nd half of your companies name has as much negative sentiment as they do it is gonna affect share price.\n\nOr not, this market is fucking weird.  All I know is I bought more puts with the profit I made off my short put last week so either I make money or a once great game studio gets restructured and they make actually entertaining games again, I call either a win.\n\nK gotta go my DPS queue for OW finally popped, only took 17 minutes.",
        "created_utc": 1627803359,
        "id": "h7ahg5g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627832159.0
    },
    {
        "author": "Phynaes",
        "body": "My father would constantly complain to my (unemployed) mother about all of the money she was spending, and one time she turned to him straight-faced and said: Why don't you just earn more money?\n\nNot saying anything about your spouse, just made me remember that with a chuckle. Couldn't believe it at the time, really opened my eyes to how some people view money.",
        "created_utc": 1627803564,
        "id": "h7ahoem",
        "score": 1,
        "subreddit": "investing",
        "created": 1627832364.0
    },
    {
        "author": "koka82",
        "body": "Same.  Spent 5 years and don't regret a single bit of it.  Literally set up for life by doing something I always wanted to do.  Ended up getting service related care as well and walked away with a decent TSP.",
        "created_utc": 1627804671,
        "id": "h7aiydm",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1627833471.0
    },
    {
        "author": "The_Buttaman",
        "body": "The later point you made, it’s typical growth speculation. They feel they’re getting into the company on the ground floor then when production hits, they make money and the stock skyrockets. Sometimes it works, most of the time it doesn’t.",
        "created_utc": 1627805783,
        "id": "h7ak6qp",
        "score": 1,
        "subreddit": "investing",
        "created": 1627834583.0
    },
    {
        "author": "shawnz",
        "body": "A reinvested dividend is essentially the same as no dividend at all. You are simply taking some money from the company and then immediately giving it back.",
        "created_utc": 1627804813,
        "id": "h7aj41b",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1627833613.0
    },
    {
        "author": "Arkansasmyundies",
        "body": "Yeah. I think it is racist that Natalie Portman played the black swan. Should have been a real Japanese man, Tom Cruise.",
        "created_utc": 1627804773,
        "id": "h7aj2fg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627833573.0
    },
    {
        "author": "dancode",
        "body": "It's not the market freaking out or overreacting, at least not as I see it. Most trading is done by machines and is basically not emotional. \n\nBig capital moves the market and a large portion of that capital is other peoples money and can also be highly leveraged (margin, etc.).\n\nSo the funds with other peoples money claim risk levels to their investors that they tolerate and are obligated to maintain, or they have high leverage that creates more risk on bigger moves. So when risk gets created, they are compelled to sell off to de-risk even if the price they are selling is undervalued or low. \n\nThis creates abnormally large dips in prices in the short term since a lot of money is adjusting at the same time. It is a buy opportunity for retail who doesn't care and have same obligations.",
        "created_utc": 1627804907,
        "id": "h7aj7xx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627833707.0
    },
    {
        "author": "userturbo2020",
        "body": "Ccp does leave loop holes. \n\nThat’s exactly why we’re able to play Chinese names in the first place. \n\nCayman island setup is a loop hole ( which admittedly ccp can close at any moment which is why they don’t mind it for now, they still hold the power)",
        "created_utc": 1627805304,
        "id": "h7ajnyu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627834104.0
    },
    {
        "author": "TheGreaterGuy",
        "body": "Considering the fact that they wait for the stock to hit a very common high target that it then declines from, I'd go with puts",
        "created_utc": 1627805226,
        "id": "h7ajkw1",
        "score": 1,
        "subreddit": "options",
        "created": 1627834026.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because was too short. Please make it a comment if it's not worth expounding on.",
        "created_utc": 1627804476,
        "id": "h7aiqeu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627833276.0
    },
    {
        "author": "wrex619",
        "body": "Stop rubbing it against your dog",
        "created_utc": 1627805606,
        "id": "h7ajzrh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627834406.0
    },
    {
        "author": "mousepop321",
        "body": "I’m so pissed.... been watching Friends every night on Nickelodeon, and after about 100 episodes I just discovered they are cutting the endings to every episode!!! You know that 40 seconds scene that shows do after the final ad, well Nick doesn’t show it! So now I have to find them on some other channel and rewatch the endings to everyone!!!!! 🤬",
        "created_utc": 1627804415,
        "id": "h7ainy8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627833215.0
    },
    {
        "author": "ITgman",
        "body": "Who knew basic financial information was lacking on reddit. There is absolutely no reason not to use a roth IRA. You can withdraw your contributions with the only caveat of only having a contribution limit for the fiscal year so you can't put it back in if it exceeds the limit. It's the biggest no brain investing move you can ever make in life.",
        "created_utc": 1627804634,
        "id": "h7aiwxm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627833434.0
    },
    {
        "author": "Firm-Candidate-6700",
        "body": "Get it on your own\n\nfailure to deliver to ya",
        "created_utc": 1627804515,
        "id": "h7ais1b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627833315.0
    },
    {
        "author": "retrorays",
        "body": "so do we all think Novonix is going somewhere? Read an article about it recently, somewhat compelling. Synthetic graphite, 100x charge, ... and competition for battery supply vs. China. So not only a tech/energy bet, but a strategic one.",
        "created_utc": 1627801671,
        "id": "h7afh67",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627830471.0
    },
    {
        "author": "CedBS",
        "body": "I am kinda new to options trading, I was thinking about starting the wheel strategy, but I see a lot of people on this sub saying, the wheel have not a lot of return. I am interested in the strategy you are saying, but I don't really understand how it works, I have about 7000$ to invest / trade, where can I learn more about your strategy and I would like to know what you advise me to do.\n\nThanks",
        "created_utc": 1627801617,
        "id": "h7afevz",
        "score": 1,
        "subreddit": "options",
        "created": 1627830417.0
    },
    {
        "author": "FreyBentos",
        "body": "You must be a true autist then cause you obviously don't understand what sarcasm is or how to execute it.",
        "created_utc": 1627801491,
        "id": "h7af9oz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627830291.0
    },
    {
        "author": "trumpismodest",
        "body": "It doesn't even say if it is a call or put.",
        "created_utc": 1627801486,
        "id": "h7af9g2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627830286.0
    },
    {
        "author": "69PutsOnYourPuts69",
        "body": "It would be fun to see how a few rounds of my main black/green v your black white would play out. My main deck is focused on Lifesteal/Mana Farming and then wrapping up by using green powerhouses with graveyard synergy to overwhelm when there's barely any points left. I run 4 Dark rituals 👀 must have for black or black/x",
        "created_utc": 1627801410,
        "id": "h7af662",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627830210.0
    },
    {
        "author": "MY_FUCKING_USERNAME",
        "body": "It doesn't take a rocket scientist to realize that the trucks must be powered by external sources if they are unable to power themselves.",
        "created_utc": 1627801498,
        "id": "h7af9yv",
        "score": 1,
        "subreddit": "investing",
        "created": 1627830298.0
    },
    {
        "author": "the_GuelahPapyrus",
        "body": "Once sleep became my favorite thing in the world, I lost it",
        "created_utc": 1627802026,
        "id": "h7afvva",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627830826.0
    },
    {
        "author": "zookeepkookie",
        "body": "anything can happen, you can’t trust communist china, for exam their statements were that they’ll make it hard for new ipos, but the next days they go after companies that were already listed for a long time, they’ll use and do anything to stay in power.",
        "created_utc": 1627805525,
        "id": "h7ajwk9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627834325.0
    },
    {
        "author": "cookingboy",
        "body": "If anything I learned from this past year it is the infinite collective power of groups to come together and reject objective reality and create brand new ones to suit their own belief.",
        "created_utc": 1627802065,
        "id": "h7afxft",
        "score": 1,
        "subreddit": "investing",
        "created": 1627830865.0
    },
    {
        "author": "Dat_Speed",
        "body": "selling any ITM call with less than $0.05 extrinsic value typically gets assigned that night, especially if there is 1%+ hard to borrow fee. HYG currently has 2.6% hard to borrow fee, so ya basically this isn't going to work.\n\nThe sept puts have tremendous open interest tho, interesting. If you hit the bids and asks all day you could probably get quite a few $0.05 put spreads for $4-5. 100x potential payout, go for it!",
        "created_utc": 1627809207,
        "id": "h7ao0de",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627838007.0
    },
    {
        "author": "jayce504",
        "body": "Where do you all go for investing information? I've considered they typical options like finance magazines (Forbes etc.) and newspapers (WSJ), but it seems like the industry has already acted on the information before it ever hits the press. Where can I find the same info outlets the pros use, or if that's proprietary (and I recognize that it probably is), the most up to date investing info for amateurs?",
        "created_utc": 1627810775,
        "id": "h7apph0",
        "score": 1,
        "subreddit": "investing",
        "created": 1627839575.0
    },
    {
        "author": "autistorartist",
        "body": "Can you feel it Mr. Krabs?",
        "created_utc": 1627815323,
        "id": "h7autey",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627844123.0
    },
    {
        "author": "putridstench",
        "body": "I pay attention to the ESG, and I consider it, but it doesn't stop me from buying companies I expect will increase my funds. \n\nTo each his own.",
        "created_utc": 1627809394,
        "id": "h7ao7j3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627838194.0
    },
    {
        "author": "nocapitalgain",
        "body": "Well, in reality there are multiple parties in China is just that is not known and just one has power. The CCP has base consensus and thus they can remain in power with that. If popular consensus is not as high it will change the course of the Chinese history the same way it has brought the CCP into power in the first place (the last Chinese dynasty has \"sold\" China to the Japanese during WWII, China lost 30 million people and they were definitely angry with the establishment and this is what led to the communist revolution and thus Mao taking power)\n\nChinese leaders in the CCP are elected at any level of the chain (city, province and state) by other party members and even before being part of the party you've to be elected (in university, state company, association etc) to be part of the party you've to be the top notch in your field etc. Is just a different system, you can't say they are not elected because they don't leave the random Joe to go out on a Monday afternoon to put a cross into a square every 4 years.",
        "created_utc": 1627808209,
        "id": "h7amwkl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627837009.0
    },
    {
        "author": "boffum",
        "body": "yeah the ESG filter will get better over time hopefully, but it is still a major improvement over the vanilla index.",
        "created_utc": 1627808444,
        "id": "h7an63c",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627837244.0
    },
    {
        "author": "hemeny123",
        "body": "I appreciate it but I really don’t care about any Reddit rewards. Not trying to be a dick just saying. Thank you though",
        "created_utc": 1627815434,
        "id": "h7auy01",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627844234.0
    },
    {
        "author": "OrangeTrader44",
        "body": "Read about PAVM on my profile, closed at $6.87 on Friday, $2.12 on Dec 31, 2020, $1.20 on Dec 31, 2019. It can be the Best Stock of the Decade but do your own DD. I have been long the warrants that I bought on Dec 24, 2019 at 0.33. They closed at $5.44 on Friday.",
        "created_utc": 1627814449,
        "id": "h7att6h",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1627843249.0
    },
    {
        "author": "Adante_stonk",
        "body": "Dig it, man. Sprit has to go somewhere.\n\nBut while on earth. Monkey wants banana &amp; Lambo!!",
        "created_utc": 1627814446,
        "id": "h7att1r",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1627843246.0
    },
    {
        "author": "gimmeurdollar",
        "body": "It is illegal for the market to go down now accd to JPOW.",
        "created_utc": 1627811679,
        "id": "h7aqpej",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627840479.0
    },
    {
        "author": "Wirecard_trading",
        "body": "I can laugh about it now actually. Your cmt wasn’t funny tho",
        "created_utc": 1627812153,
        "id": "h7ar85o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627840953.0
    },
    {
        "author": "Summebride",
        "body": "Not exactly.  That flawed assumption implies there's only a fixed amount of lithium dollars in the world, which isn't true.  It also wrongly assumes there is zero rise in demand and zero rise in consumption.",
        "created_utc": 1627814133,
        "id": "h7atgeg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627842933.0
    },
    {
        "author": "Donkeycow15",
        "body": "What if it drove over you - that would be worse",
        "created_utc": 1627812345,
        "id": "h7arg06",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627841145.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. You submitted an image I've already seen before.                        If you're submitting a position screenshot use Gain/Loss/YOLO flair or it'll be duplicate checked.\n                        If you submitted something and then immediatley deleted it... don't do that next time.\n\nhttps://www.reddit.com/gallery/ovpfzt",
        "created_utc": 1627812807,
        "id": "h7aryfj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627841607.0
    },
    {
        "author": "Dazzling_Pride1",
        "body": "With the delta variant I would say there will be need for a long time for booster shots.\nAlso, both Biontech and Moderna added more on their pipelines. I think these mRNA vaccines opened the doors to new medical breakthrough, such as a vaccine anti-cancer( not sure for which type though) and one against Ebola.\nI have no idea how much more it can gain, but I think these 2 stocks are good to have in the portfolio at least for the next year.",
        "created_utc": 1627808569,
        "id": "h7anb40",
        "score": 1,
        "subreddit": "investing",
        "created": 1627837369.0
    },
    {
        "author": "HairZealous",
        "body": "it's cool, everyone will pretend to forget and not-so-secretly remember it for literally ever. have a good day.",
        "created_utc": 1627808559,
        "id": "h7anapq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627837359.0
    },
    {
        "author": "Domgrath42",
        "body": "I agree except for FB. They still have a less diversified business model than the other big guys. Even AR hasn't really taken off as much as they want it to.",
        "created_utc": 1627808467,
        "id": "h7an716",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627837267.0
    },
    {
        "author": "JoeFinance44",
        "body": "Yes! You nailed it! A few weeks ago I listened to Episode 382 of The Investor’s Podcast - We Study Billionaires (skip to 20min) where Marin breaks down the macro outlook and I’ve been bullish on carbon credits since. I subscribed to his newsletter and he’s been teasing a $10mill investment for awhile. I had my suspicions it was this company but you’ve confirmed my hunch with his 10% stake of the $100mill offering. Im sure r/carboncredits would appreciate this analysis as well! I’d cross post but you deserve the all important Reddit karma haha.",
        "created_utc": 1627807707,
        "id": "h7amciy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627836507.0
    },
    {
        "author": "caitsu",
        "body": "Greedy westerners don't understand China because China's political system is not run by money. It's run by fear of losing control.\n\nYou would think China also wouldn't murder millions of their citizens due to their ethnicity, or wage pointless pseudo-wars in the South China sea, Hong Kong, Taiwan and the Indian border. Those things don't help them get money either.\n\nYou'll be surprised what China will do if it keeps getting emboldened by greedy western money. People with morals might even feel bad for supporting what is essentially the nazi empire of our generation.",
        "created_utc": 1627807072,
        "id": "h7almzr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627835872.0
    },
    {
        "author": "Professional-Bear543",
        "body": "Getting rich by being frugal and waiting 20-30 years is the dumbest motherfucking idea. It doesn't even make sense as a way to leave money to your survivors, because you can just take out a life insurance policy.\n\nI wonder how many people try that and then die right before they make their first 401k withdrawal.",
        "created_utc": 1627806918,
        "id": "h7algoa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627835718.0
    },
    {
        "author": "mcfc_4eva",
        "body": "I’m not reading that! Summarise it in 3 words",
        "created_utc": 1627806734,
        "id": "h7al94c",
        "score": 1,
        "subreddit": "investing",
        "created": 1627835534.0
    },
    {
        "author": "deSeingalt",
        "body": "less than 24 hours later and you can already type?  \nIf it was dope it should take you longer than that to get home &amp; work out how the fuck to turn the computer on \n\n\\- if it was dope it should take you longer than that when you finally understand you're awake to work out where the fuck you ARE  \n\\- if it's dope then where you are is .. totally lost.. like shit what COUNTRY is this? Do I own a car?\n\nexistential",
        "created_utc": 1627811093,
        "id": "h7aq21o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627839893.0
    },
    {
        "author": "Financial_Machine533",
        "body": "Hi, check out my post I made recently. It will slighty profit if SPY goes up, and I will \"dramaticly\" profit (~200%) if SPY goes to ~$420. Max loss ~$600 if SPY trades sideways (+/- 1%) till august 16.\n\n https://www.reddit.com/r/options/comments/ouavxv/do_you_play_options_like_this/?utm_medium=android_app&amp;utm_source=share",
        "created_utc": 1627814026,
        "id": "h7atbx5",
        "score": 1,
        "subreddit": "options",
        "created": 1627842826.0
    },
    {
        "author": "iLL-Egal",
        "body": "Maybe transfer out of Robinhood months ago?? It is your own fault.",
        "created_utc": 1627813877,
        "id": "h7at5rp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627842677.0
    },
    {
        "author": "HairZealous",
        "body": "I wish I could talk to Lauryn  \nI mean, excuse me Ms. Hill, and let her know how me we love her, it's real  \nThe industry was beating her up  \nThen them demons started eating her up  \nShe needed a savior that would bleed in a cup  \nYup, we used to kick it in the salad days?  \nBut she look at me like she don't know me when she see me nowadays  \nI nod, she nod back, that's how it stay,",
        "created_utc": 1627808810,
        "id": "h7anksq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627837610.0
    },
    {
        "author": "onlyfacts_nofans",
        "body": "All jokes aside buying an instrument at all-time highs is not a good statistical bet. Since I'm young, I would rather sit on my hands and wait for the next crash then put my money in and pray to God that it doesn't happen to where I have to wait 10-20 years to get above water again. \n\nAlso the mid-cap indexes has have been stuck in a range for weeks. And the S&amp;P is mostly carried by a few stocks. Not really good reps.",
        "created_utc": 1627810953,
        "id": "h7apwje",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627839753.0
    },
    {
        "author": "less_unique_username",
        "body": "&gt;but it underperformed from 2008 to present\n\nWhile during the 2008 and 2020 crises it overperformed. Isn’t this the definition of a hedge? The strategy isn’t to hold both positions indefinitely, but rather to close the short position right after a crash.",
        "created_utc": 1627810880,
        "id": "h7aptof",
        "score": 1,
        "subreddit": "investing",
        "created": 1627839680.0
    },
    {
        "author": "EPMD_",
        "body": "I don't see anyone asking when you are going to use this money. That's important. If you plan on buying your own home within the next five years, you shouldn't just dump all of your savings into XEQT. You should instead invest a chunk of it into something less volatile to ensure a market crash doesn't impede your plan to purchase something of your own.\n\nYou should also consider the difference between TFSA, RRSP, and taxable accounts. Generally speaking, you should exhaust your TFSA and then RRSP limits before considering a taxable account.\n\nYou don't have to do a lot of research, but a few hours reading about TFSA vs. RRSP vs. taxable accounts and which Canadian ETFs are right for your investment timeline will do wonders.",
        "created_utc": 1627804520,
        "id": "h7ais9g",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1627833320.0
    },
    {
        "author": "justcool393",
        "body": "TSLA split would crater the price because of how it moves. I don't think people here realize how stock splits work.",
        "created_utc": 1627806182,
        "id": "h7akmyn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627834982.0
    },
    {
        "author": "diffcalculus",
        "body": "For the pro-plague morons, it could have been a once in a lifetime thing.\n\nCause it won't happen again....for some of them.",
        "created_utc": 1627804989,
        "id": "h7ajb9p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627833789.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because was too short. Please make it a comment if it's not worth expounding on.",
        "created_utc": 1627808473,
        "id": "h7an79v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627837273.0
    },
    {
        "author": "BigBrianBrand",
        "body": "Strongly disagree. It was obvious when I was in elementary school in 2005 that Yahoo was garbage, and that Google was way better. Until I see that fundamentally changing as a consumer of Google products I'll remain bullish.",
        "created_utc": 1627808258,
        "id": "h7amyji",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627837058.0
    },
    {
        "author": "TrirdKing",
        "body": "this may be a dumb question, but why do you sell the 35Cs on top of buying the 27.5Cs? from your DD it seems you are very sure of the stock not dropping below the 27.5 mark and probably rising above 30, so why not just buy more calls? \n\nmy guess would be  that its advantageus risk management but I'd like to know if that is indeed the case",
        "created_utc": 1627810663,
        "id": "h7apl2o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627839463.0
    },
    {
        "author": "Tiinpa",
        "body": "My one IPO at literal open and it's carrying my portfolio now. My only issue is if I ever take the profits or keep letting it ride.",
        "created_utc": 1627810617,
        "id": "h7apjby",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627839417.0
    },
    {
        "author": "nocapitalgain",
        "body": "Just go and read the article, I won't reply you to your nonsense anymore.\n\nChina is not a dictatorship like North Korea, so yes people do have opinions and they can express them even against their government. It happens that most of them like the government as the survey are testifying. \n\nComparing China to North Korea is just nonsense and does tell a lot about your cultural level.",
        "created_utc": 1627810606,
        "id": "h7apivc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627839406.0
    },
    {
        "author": "Cytozen",
        "body": "Xilinx will push it a significant bit higher. But you need to understand, technical analysis is not the end all anymore. It’s not a hedge fund or market maker game anymore. It’s about how everyone feels about it. Look at AMC and GME. You’re gonna laugh now because it’s not gonna make sense, but the reality is that there’s a Lot of companies that are overvalued right now, but as a technology company AMD is moving. The movement down was purely to do with the lack of resources, the bullish price is based on the company’s potential, not just on current revenue.\n\nIt’s your money… if you feel bearish, then take the gamble and call the puts, but it’s because of those puts that other companies are overvalued, and has maintained those high values.",
        "created_utc": 1627806789,
        "id": "h7alb8w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627835589.0
    },
    {
        "author": "Stockkoo",
        "body": "It’s not a scam until it’s a scam. Very sad and troubling that it went on for that long.",
        "created_utc": 1627806746,
        "id": "h7al9kv",
        "score": 1,
        "subreddit": "investing",
        "created": 1627835546.0
    },
    {
        "author": "AutoModerator",
        "body": "Hi Redditor, it would seem you have strayed too far from WSB, there are emojis detected. Try making a comment with no emoji at all.  Have a great day! \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
        "created_utc": 1627806721,
        "id": "h7al8ln",
        "score": 1,
        "subreddit": "investing",
        "created": 1627835521.0
    },
    {
        "author": "onlyonebread",
        "body": "If that's \"suffering\" then the average American is a wimp. Yeah you gotta work hard to have any semblance of a good life, but that's our reality. I have no power to change the system that I exist in, only my will to work as hard as I can in it to gain as much leverage over other people that don't want to work as hard. \n\nSaying how things should be better or different is irrelevant and does nothing to help. You have to eat beans every day, no entertainment, have a crappy or no car, and work 40 hours a week minimum to get a nice emergency fund going, but that's reality, and whining about how things shouldn't be that way isn't going to make the emergency fund magically appear.",
        "created_utc": 1627806516,
        "id": "h7al095",
        "score": 1,
        "subreddit": "investing",
        "created": 1627835316.0
    },
    {
        "author": "LePootPootJames",
        "body": "Somebody already fked that pussy if it looks like that. You're going in for sloppy seconds.",
        "created_utc": 1627806496,
        "id": "h7akzgx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627835296.0
    },
    {
        "author": "Adante_stonk",
        "body": "You just took it to another level. Consciousness and the greater we, the spiritual we….. but sadly, we do not live in that world (as much as I wish we did)\n\nWe live in mine. Full of monkeys, trying to screw the next monkey for a banana.",
        "created_utc": 1627806631,
        "id": "h7al4vr",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1627835431.0
    },
    {
        "author": "illusionst",
        "body": "So their first name is the name of the Covid variant and the last name is Airlines (meaning no business if there's a national wide lockdown).\nAnd I thought, Corona Beer had it bad.",
        "created_utc": 1627807882,
        "id": "h7amjpo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627836682.0
    },
    {
        "author": "robertito42",
        "body": "How long did it take for the feds to taper off after 2009?",
        "created_utc": 1627807827,
        "id": "h7amhhw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627836627.0
    },
    {
        "author": "HairZealous",
        "body": "if you can identify it beforehand, it is by definition not a black swan",
        "created_utc": 1627807194,
        "id": "h7alru9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627835994.0
    },
    {
        "author": "insomniaxs",
        "body": "Monopolies are a political threat, not a danger to workers within those companies. Monopoly profits come from overcharging customers, not from exploiting workers per se. Basic microeconomics.\nIf China really cared about working conditions, it would have different priorities",
        "created_utc": 1627807008,
        "id": "h7alkdi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627835808.0
    },
    {
        "author": "Ashony13",
        "body": "I personally love the sell off.. A huge opportunity to get it before it’s too late. I bought up a lot of EDU stock. Huge potential when everyone is selling. The delta variant is going to make EDU and other online education company thrive. EDu has been around, is reputable and has tons of room to run in the coming year. It might take some patience but EDU and TAL are the major players that are going to come out winners.\nBuy into the fear. It might take some time but in the end these company will recover and everyone is going to wish they bought in. Let’s gooooo",
        "created_utc": 1627810830,
        "id": "h7aprny",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1627839630.0
    },
    {
        "author": "FatherOfGold",
        "body": "If you don't know what you're doing, put it in an index fund.\n\n\n\nIf you want to be riskier put it in a set of companies whose product you use or genuinely believe in.\n\n\n\nIf you want to be even riskier put it all on 10% OTM SPY puts expiring tomorrow. You'll more than likely lose it all but there's a one in ten trillion chance you'll walk away a billionaire.",
        "created_utc": 1627807936,
        "id": "h7amlvc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627836736.0
    },
    {
        "author": "jakewalle",
        "body": "Big funds selling = stock price goes down due to lack of demand. I dont try to think of it more then that because good company that does well Doesnt mean the stock price will move much",
        "created_utc": 1627807571,
        "id": "h7am6yj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627836371.0
    },
    {
        "author": "jakewalle",
        "body": "Well it did surge to 300 one time. From about 4 bucks a bit more then a year ago..",
        "created_utc": 1627807730,
        "id": "h7amdgv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627836530.0
    },
    {
        "author": "DeliciousDave4321",
        "body": "I like green dildo. It goes brrrrrr",
        "created_utc": 1627809888,
        "id": "h7aoqv4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627838688.0
    },
    {
        "author": "dttinyhands",
        "body": "Like seriously, outside of it being laced, with, in 2021 let's go with the generic thing that kills, fentanyl, it's pretty difficult to overdose and die from cocaine. He died from whatever impurity was in it, if that's even the real story.",
        "created_utc": 1627811320,
        "id": "h7aqb5z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627840120.0
    },
    {
        "author": "PapaJrer",
        "body": "'I just prefer to not lose it and I don’t mind holding for a longggggggg time.'\n\nIf you can stick to this, you should do very well. \n\nStick to companies you understand and be prepared for surprises.",
        "created_utc": 1627810533,
        "id": "h7apg27",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627839333.0
    },
    {
        "author": "Lucky_Ad9875",
        "body": "And won't get taxed until he pulls it out.",
        "created_utc": 1627810514,
        "id": "h7apfaj",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1627839314.0
    },
    {
        "author": "Skychansky",
        "body": "How it feels like to hear that your crush has a boyfriend?",
        "created_utc": 1627810025,
        "id": "h7aow6t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627838825.0
    }
]