[
    {
        "author": "rusbus720",
        "body": "Quick Cathie, sell off all your liquid positions and buy 30% of the Trimble daily volume  again to stop the bleeding in 4 of your funds",
        "created_utc": 1617812978,
        "id": "gtpd8ni",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617841778.0
    },
    {
        "author": "GardenCat1551",
        "body": "Any thoughts on PLUG?  There is some unusual call activity...\n\nAny comments on BBBY, NUAN, TRMB would be appreciated!  TY",
        "created_utc": 1619734625,
        "id": "gwcqhk3",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619763425.0
    },
    {
        "author": "willyumn",
        "body": "where can i get good research on trimble? im very interested in this company as i pass it almost every time i hop on the road.",
        "created_utc": 1617333154,
        "id": "gt3syvj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617361954.0
    },
    {
        "author": "DiligentResident9208",
        "body": "Any inclusion of TRMB Trimble stock",
        "created_utc": 1617662710,
        "id": "gti8scr",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617691510.0
    },
    {
        "author": "G_roundC_offee",
        "body": "I was originally looking at it for reopening and probably selling in the fall. But I literally just now writing this realized a better day to sell would be the morning after the Super Bowl. I’m not a financial advisor and have been trading more on trends. Like movie theaters, resorts, etc. will go up organically as people start to get out. Gas prices rise in the summer, construction companies not running TRMB equipment will NOT be able to compete in the industry much longer(I use it at work and am up 20% in a year), things like that. But if this thing squeezes I’m definitely selling on the backside of the peak.",
        "created_utc": 1617560770,
        "id": "gtdd5tp",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1617589570.0
    },
    {
        "author": "Im_Drake",
        "body": "TRMB bullish af",
        "created_utc": 1617712802,
        "id": "gtka0k2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617741602.0
    },
    {
        "author": "0zOvOx0",
        "body": "Trimble looks interesting",
        "created_utc": 1617683498,
        "id": "gtjbgk1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617712298.0
    },
    {
        "author": "StonkDoctor1000",
        "body": "TRMB the TSLA of ARKX, hmmmmm.",
        "created_utc": 1617503630,
        "id": "gtb50n6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617532430.0
    },
    {
        "author": "bagtf3",
        "body": "Etf trimble even do",
        "created_utc": 1617503692,
        "id": "gtb54d8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617532492.0
    },
    {
        "author": "DiligentResident9208",
        "body": "Didn’t you yourself already say you held % of your portfolio in Trimble??\n\nhttps://www.trimble.com/Corporate/About_at_Glance.aspx\n\nhttps://www.trimble.com/home-2021-v1\n\nI earnestly consider you to put a majority of your money in Trimble, Tesla too was once at a glance an 80 range stock. The market is closed but perhaps on Monday early afternoon pick up shares in bulk you will not be dissatisfied nor disappointed I’m sure.",
        "created_utc": 1617336386,
        "id": "gt3xu67",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617365186.0
    },
    {
        "author": "DiligentResident9208",
        "body": "Has the Trimble hype ran its course and maxed out? This has high potential to reach 100 dollar range",
        "created_utc": 1617365109,
        "id": "gt4swah",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617393909.0
    },
    {
        "author": "oneuponwallstreetz",
        "body": "So I work for McLane Foodservice here in Houston, Tx and we were suppose to pick up Jack in the Box this summer. Due to us closing a deal with Whataburger, those JIB plans have been scrapped temporarily. What we were planning to do was send a empty trailer from Houston to Dallas and have a full load of JIB shuttled back to be distributed around the Houston area. We have done this in the past with companies such as Arby's and Panda Express. Multiple trailers go up empty while swapping trailers and coming back with 40k lbs of food product to be delivered. \n\n&amp;#x200B;\n\nOk, so now that I got that out of the way. McLane Foodservice is one of Berkishire Hathaways holdings. Been around since the year 1906, family owned until Sam Walton bought it and the old owner bought the Astros. (not important) Sam Walton eventually sold after Pepsi, AmeriServ, PFS, and Finally Berkshire. (might not be 100% accurate on timeline of ownership)\n\nRecently, McLane invested in Orange EV yard trucks (bobtails that move trailers around the parking lot and docked into building doors to be loaded) at some of their locations. As of January/February I was having a discussion with our director of operations and he said that we would not be hiring any extra drivers when we take on JIB this summer and trailers would be shuttled using the driverless technology in these trucks by AEVA. \n\nNow, it was cool to hear that but at the same time it was hard to believe that we would be incorporating a technology that hasn't even been figured out in mainstream automobiles to be 100% safe and we are expecting this company to have figured it out in Semi-Trucks. The technology would drive the truck from the Distribution Center in Dallas to the Distribution Center in Houston all the way to the entrance gate before a driver on location takes over. \n\nSince we have scrapped the JIB plans for now, I don't know much more about what is happening with this technology but it all started from what is going on with our DC is Arizona. I was told they are or have been using this in Phoenix with this driverless technology. I could attempt to find out more information but the company right now is not worth much. I think that once phones are mandatory, and everyone has internet as well as road ratings (driverless % ratings of auto-piolet disablement) with quick updates to construction through city contracts and policys, this will still not be 100%. Highway use may be a different story but like what just happened not to far from where I live in The Woodlands, Texas, that Tesla Car Crash is a concern because the technology didn't respond. \n\n&amp;#x200B;\n\nPublic (Stock) Companies we also use daily are Trimble, VMWare, Zebra, Volvo Trucks, Freightliner trucks. We service Yum Foods (Taco Bell, KFC, Pizza Hut), Chilies, Applebee's, IHOP, Whataburger, Buffalo Wild Wings, Chick Fil-A, Golden Coral, and others. Our grocery division has contracts with Walgreens as well. We are nation wide and that's what landed us the distribution contract with Whataburger. We make 65-100k+ a year and we are always hiring. 4 day work weeks but you can work more if you want more $. If you or anyone you know that has a CDL, is mentally tough, and has a good attitude but kinda edgy, please make them aware as job openings are ramping up and we want to help employ people that want to work at McLane. \n\nSummary; I gave you the inside scoop on our companies use of OP mentioned company and an potential job opportunity for you or someone you know",
        "created_utc": 1618823316,
        "id": "gv290nk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618852116.0
    },
    {
        "author": "DiligentResident9208",
        "body": "TRIMBLE \nHas tremendous upside could be the equivalent of “getting in on” Tesla when it was at its earlier development in the double digits and not triple it is today. It’s an infrastructure play very strong within the US developing needs. It’s a strong stock and knowing that Ark has it invested in the same vein as their fanboy love of Tesla it could really be injected and have tremendous numbers and value growth by next year. Yes there are haters yes there are naysayers and people parading around screaming all the negative hysteria’s in the world. But in my eyes this stock has very very good numbers come May. Injecting 10k on TRIMBLE now, holding for a year?? Forget about it your gonna be mega rich in the Tesla numbers only you’d have been lucky to buy Tesla before it was over 80$ Tesla is now pushing 650-700 range nowadays",
        "created_utc": 1617331812,
        "id": "gt3qskg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617360612.0
    },
    {
        "author": "Moe_Greene_",
        "body": "bae Cathie Wood bought a shit ton of $TRMB today. Looking very bullish.",
        "created_utc": 1617752309,
        "id": "gtmo4y4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617781109.0
    },
    {
        "author": "Head_Paleontologist",
        "body": "AWK 4/16 155c\n\nTRMB 4/16 90c",
        "created_utc": 1617777084,
        "id": "gtntcii",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617805884.0
    },
    {
        "author": "always_plan_in_advan",
        "body": "Infrastructure software companies, Autodesk, Trimble, Bentley systems",
        "created_utc": 1617988664,
        "id": "gtya4yk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618017464.0
    },
    {
        "author": "mrfinnlee",
        "body": "My TRMB calls are printing",
        "created_utc": 1617632363,
        "id": "gtgfbac",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617661163.0
    },
    {
        "author": "bkbrown30",
        "body": "Trimble calls here, Trimble calls. get em while they’re hot.",
        "created_utc": 1617633416,
        "id": "gtghf3p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617662216.0
    },
    {
        "author": "whoseyourdatadaddy",
        "body": "Okay why is no one talking about or doing DD on \n\n$TRMB ?\n\nI mean it’s astonishing wsb hasn’t blown this up . I mean I would but to lazy to start it .\nSo I vent here hahah",
        "created_utc": 1617490808,
        "id": "gtajram",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617519608.0
    },
    {
        "author": "StonkDoctor1000",
        "body": "Trimble Inc provides location-based solutions that are used in global positioning system (GPS), laser, optical and inertial technologies. Its products portfolio includes 3D laser scanning, flow and application control systems, monitoring systems, water management, and navigation infrastructure. It also manufactures laser and optics-based products, and GPS products. The company serves various industries which include agriculture, architecture, civil engineering, survey and land administration, construction, geospatial among others. The company operates in four reportable segments namely, Buildings and Infrastructure, Geospatial, Resources and Utilities, and Transportation. It derives most of its revenues from the US and Europe with the rest coming from the Asia Pacific and other markets.",
        "created_utc": 1617503849,
        "id": "gtb5dij",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617532649.0
    }
]