[
    {
        "author": "MattieShoes",
        "body": "I think perhaps you're going greedier when the market is greedy.  \"Boring\" companies are leading the charge.  \n\nIn  the last month:\n\nMSFT +10%  \nAAPL +7.5%  \nCDW +14.7%  \nTGT +16.9%  \nBRK +8%  \nFDX +8.2%",
        "created_utc": 1618775258,
        "id": "gv02t8u",
        "permalink": "/r/stocks/comments/mtcntf/is_now_the_time_to_be_fearful/gv02t8u/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618804058.0
    },
    {
        "author": "MattieShoes",
        "body": "CDW  \nMSFT  \nTGT  \nOMF  \nAnd I don't know, AMAT?\n\nFWIW, I own some of the first four.",
        "created_utc": 1618693314,
        "id": "guwfv8p",
        "permalink": "/r/stocks/comments/msqx2g/5_stock_picks_for_the_next_5_years/guwfv8p/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618722114.0
    },
    {
        "author": "UR_Face",
        "body": "Ok - so here's what this may mean for PLTR stock.\n\nWhen a company announces they partner with AWS, it means 1 of 2 things:\n\n1 - they are going to host their product on AWS. Contractually this means that they are signing up multi year contract to spend x number of $$$ for a period of time on the platform, typically called an EDP (enterprise discount program). These EDPs can be very custom, and can include free consulting, credits to offset their eventual bill, and other offers along with a certain negotiated discount off of any aws service monthly. Depending on the size of the contract this discount could well be into 20% or more off. I've seen credits easily mid 7 figures before. This contract essentially says - you will spend this much money and at the end of the term or at annual periods in the contract if you have not spent, you get a bill for the difference. And also depending on accounting rules - this contract could be considered Capex.\n\nMinimum eligible spend to be able to get an EDP? 500k a year (used to be $1M until recently). Think about how many companies use AWS and would hit this threshold....alot. aws reps also get paid on signing EDPs, so they love them too.\n\n2 - they are going to sell their product on the aws marketplace. The marketplace and having ISVs (which PLTR would be in this case) is relatively new, like within the last 2 years. Only recently (last few months) aws has allowed professional services - not specifically tied to a product offering on the marketplace, to also be sold. The sale process for items on the marketplace can happen several different ways: user finds it and clicks buy, ISV directs customers who come through other sales channels to buy on  AWS (I've seen some offer discounts to do so), or Marketplace specific ISV reps go and specifically sell the product to aws customers and partners (these reps make no money unless someone buys the product). Aws essentially is turning into a software and services disti (comparable distis include SHI, techdata, arrow, cdw).\n\n\nNow - based on the 5 seconds I used ducksduckgo (fuck google) before I started typing this post up, my hunch is the article is referencing PLTR going the way of my #2 meaning. They would be dumb if they were also not under an EDP too though.\n\n\nHow are #1 and #2 related?\n\nLet's say I'm a company who has an EDP, and I didn't know what I was doing when I made the initial commitment and I'm projecting to come up short at the end of my next EDP term. There are a couple ways to fill the gap without spinning up EC2 instances for fun - one of them is spending money on the marketplace (product, professional services). 50% of the value of these spends count against the commitment of an EDP. So, if you are projecting a 50k shortfall on your EDP term - you could spend 100k on the marketplace to cover it and avoid the 50k bill from aws (for nothing). \n\nThat said - companies are moving alot of their transactions to the aws marketplace because of this EDP benefit. Ideally you don't suck and take into account marketplace spend in your analysis for your EDP spend, but alot of companies dont.\n\n\nWhat does this all mean for PLTR stock?\n\nNothing yet. However there are some future indicators to look out for:\n\nJob postings for Marketplace ISV positions, specifically in the ERP space.\n\nPLTR showing up at an aws event in the future (summits or specifically reInvent)\n\nAnnouncements of large companies entering agreements to buy/use PLTR who also use AWS\n\nPLTR Announcing professional services/consulting \n\nPLTR professional services/consulting offers on the marketplace\n\n\nIf one or more of the above happen, it should increase the share value of the stock.\n\nI write this long post as someone who pretty much doesn't own stock (fidelity just puts my money places), doesn't hold any PLTR, and used to negotiate EDPs and was employed by an early adopter of the aws marketplace.\n\nBTW- contino is far from what I'd consider reputable in the sense of using it for any DD. Lol",
        "created_utc": 1617400006,
        "id": "gt6mv8m",
        "permalink": "/r/wallstreetbets/comments/mionc6/pltr_and_aws/gt6mv8m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617428806.0
    },
    {
        "author": "IcyWang",
        "body": "CDW has a massive acquisition in the works. Can’t go into details, but look at the growth over the past year. Plus a recent partnership with Palo Alto. Big player in the network security field.",
        "created_utc": 1618765100,
        "id": "guzhq5g",
        "permalink": "/r/wallstreetbets/comments/msb6mb/weekend_discussion_thread_for_the_weekend_of/guzhq5g/",
        "score": -4,
        "subreddit": "wallstreetbets",
        "created": 1618793900.0
    },
    {
        "author": "IcyWang",
        "body": "Everyone sleeps on $CDW",
        "created_utc": 1618764811,
        "id": "guzh4i7",
        "permalink": "/r/wallstreetbets/comments/msb6mb/weekend_discussion_thread_for_the_weekend_of/guzh4i7/",
        "score": -5,
        "subreddit": "wallstreetbets",
        "created": 1618793611.0
    },
    {
        "author": "SoapHorse69",
        "body": "Aircraft autopilot is different though, there’s a lot less aircraft in the sky than cars.  The average pilot has more training than the average driver, and (hopefully) none of them are intoxicated.\n\nI think autonomous driving is a serious technology.  It seems crazy now but I think only because it’s not widely adopted.  The more autonomous cars there are on the road, the better autonomous driving becomes.  More human drivers = more variables and unpredictability for computer to take into account.  If all or most cars are autonomous and talking to each other in real-time though, it’s a lot easier to react to road conditions and adapt accordingly.\n\nI’m not saying that cars nowadays are analog, but the perception is that they are.  The first iPhone technically didn’t do anything technologically revolutionary, but it did bundle all these existing digital technologies into one UI (tablets, MP3 players, GPS, etc), and off of that Apple was able to leverage their software capabilities.  I think saying Tesla = Ford = GM is like saying Apple = Nokia = Motorola.  No technology is new and we all stand on the shoulders of giants, but we need to look at how these existing technologies are being utilized or sold in new ways.",
        "created_utc": 1617468394,
        "id": "gt9d2e5",
        "permalink": "/r/stocks/comments/miq93w/tesla_advice/gt9d2e5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617497194.0
    },
    {
        "author": "mr_blockchain_",
        "body": "Yahoo “finance” (more yahoo than finance, if you ask me) just put a hit piece on MicroVision\n\nLuckily, I’ve been DD’ing the fuck out of this stock, and can tell you that the timing of this article is more than troubling\n\nMVIS is on a verge of a breakthrough announcement in not one, not two, but three different verticals:\n1. LiDAR + EV cooperation with either MSFT/AAPL/or WVAGY\n2. Giant, and I mean giant, patent moat that they are sitting on, as it’s gaining value, in billions (think Motorola being bought by Google for their patent moat)\n3. The $22 billion dollar (just the initial leg of this contract, probably hundreds of billions when all said and done, once other branches and UN follows suit, like they’ve done in the past) with MSFT for the IVAS (augmented reality unmanned drone control goggles, or simply - remote digits vision goggles)\n\nThe last point happened just two days ago, and will be officially confirmed only next week, while the other 2 points are having announcements in Mid April.\n\nSo why a hit piece based on “historical averages”? Why now?\n\nThis is a 5x bagger if you play straight stocks, and possible breakout 500x bagger if you know what you are doing with debit call spreads.\n\nPrice now is $15\nPrice target is $75 (with buyout announcement possibly taking it to $150-$200)\n\nRead the hit piece\nInverse the hit piece",
        "created_utc": 1617462134,
        "id": "gt919d2",
        "permalink": "/r/wallstreetbets/comments/mi3t1v/weekend_discussion_thread_for_the_weekend_of/gt919d2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617490934.0
    },
    {
        "author": "AlexMile",
        "body": "  Iron making ape salutes you. We also utilize horse, pig and dog sounds (but ape is most popular), especially if someone is not so quick to respond on motorola when his name is called.",
        "created_utc": 1617276203,
        "id": "gt0q76q",
        "permalink": "/r/wallstreetbets/comments/mhqrf1/when_ape_calls_apes_respond/gt0q76q/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617305003.0
    },
    {
        "author": "mr_blockchain_",
        "body": "It's not about revenue, it's about patent value and acquisition price. Think Google buying Motorola for the patent moat.",
        "created_utc": 1617490899,
        "id": "gtajwwu",
        "permalink": "/r/wallstreetbets/comments/mi3t1v/weekend_discussion_thread_for_the_weekend_of/gtajwwu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617519699.0
    }
]