[
    {
        "author": "BaronJomini",
        "body": "The most infuriating thing is that he thinks he's morally and intellectually superior to us. \n\n\"In February 2000, the year in which Cramer claimed to have produced a 36% return, Cramer claimed that there were only 10 stocks he wanted to own and he was buying them every day. These stocks were 724 Solutions, Ariba, Digital Island, Exodus Communications, InfoSpace, Inktomi, Mercury Interactive, Sonera, VeriSign, and Veritas Software. He also dismissed the investing strategy of Benjamin Graham and David Dodd and claimed that price–earnings ratios did not matter.[41] All 10 of these stock picks fell in value significantly during 2000 as the dot-com bubble burst, making the 36% reported return during that year questionable.\"",
        "created_utc": 1614743045,
        "id": "gphvq63",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614771845.0
    },
    {
        "author": "i_vix",
        "body": "PayPal on dips, this will be my answer through earnings :)\n\nhunting for swings on tech exposure that are established or complimentary structure (Ie: Verisign, Cloudflare) \n\nOr hybrids with yield (Iron Mountain)\n\nAlways watch V, MC, EU banks for swings — think there’s still some opportunity, but worried it’s too slow\n\nAvoiding China, distractions  atm\n\nChunk of stuff is paying off longer than expected because of oil play a bit back;",
        "created_utc": 1616887280,
        "id": "gsiulrj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1616916080.0
    },
    {
        "author": "bpiraeus",
        "body": "Wow, a real internet detective there .... oh wait, no, it's just something throwing nonsense around and trying to make themselves look smart. There's absolutely nothing sketchy about a single domain here, but even more importantly I can't even really tell what it is you're complaining about.\n\nIs it that the SOA records point to [verisign-grs.com](https://verisign-grs.com)? Uhh.. learn how SOA records work maybe? Or is it that they all point back to [worldwildlifefun.com](https://worldwildlifefun.com)? This is pretty standard stuff for anyone who's ever managed domains. Maybe the WWF itself is a bit sketch at times, but at least go do some real homework before you start spreading nonsense anyone who's spent 20 minutes learning DNS or has run multiple websites could debunk before coffee.",
        "created_utc": 1615732420,
        "id": "gqweqpy",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1615761220.0
    }
]