[
    {
        "author": "_never_more",
        "body": "Fortinet is a really well run company and has gone crazy since ipo. They’re consistently near the top in quality of product and have grown like crazy. Didn’t work there but I’ve known people in the company for as like as they’ve been around.",
        "created_utc": 1619981442,
        "id": "gwp3pxm",
        "score": 8,
        "subreddit": "ValueInvesting",
        "created": 1620010242.0
    },
    {
        "author": "AlwaysBlamesCanada",
        "body": "Cyber security companies going to jizz in their pants at open - FEYE, FTNT, ZS, CRWD.\n\nYou’re welcome",
        "created_utc": 1620627500,
        "id": "gxkwn3q",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620656300.0
    },
    {
        "author": "munchsquadjr",
        "body": "FTNT",
        "created_utc": 1620742899,
        "id": "gxqczan",
        "score": 8,
        "subreddit": "investing",
        "created": 1620771699.0
    },
    {
        "author": "brownhotdogwater",
        "body": "Fortinet, Paloalto, crowdstrike, cloudflare",
        "created_utc": 1620741516,
        "id": "gxq9vt2",
        "score": 4,
        "subreddit": "investing",
        "created": 1620770316.0
    },
    {
        "author": "Cache_Flow",
        "body": "FTNT",
        "created_utc": 1619853887,
        "id": "gwiomsh",
        "score": 4,
        "subreddit": "stocks",
        "created": 1619882687.0
    },
    {
        "author": "fino_nyc",
        "body": "Fortinet is the best cyber security play",
        "created_utc": 1621089512,
        "id": "gy7vrkk",
        "score": 3,
        "subreddit": "investing",
        "created": 1621118312.0
    },
    {
        "author": "brownhotdogwater",
        "body": "Fortinet",
        "created_utc": 1620741421,
        "id": "gxq9o1p",
        "score": 2,
        "subreddit": "investing",
        "created": 1620770221.0
    },
    {
        "author": "stillyoinkgasp",
        "body": "Cisco, Fortinet, Palo Alto, Crowdstrike, Cambium Networks, OKTA",
        "created_utc": 1621117524,
        "id": "gy9g7xq",
        "score": 1,
        "subreddit": "investing",
        "created": 1621146324.0
    },
    {
        "author": "ChillMeerkat",
        "body": "I was only interested in FTNT but since it ran up 100% in a year I decided to wait for a dip. Weird nobody mentioned it here, once I read somewhere they have the best product currently. However I bought the dip on solarwinds at $16. They beat their earning estimates and they have one of the best pe if not the best in the industry. The hack may deter some customers but I think in the long run its a good buy as well.",
        "created_utc": 1619900436,
        "id": "gwkxtek",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619929236.0
    },
    {
        "author": "BossRida",
        "body": "FTNT was fairly priced at 115$ when I bought. At 206$ I would say its way overpriced, there is no way to justify buying now. Great company tho.",
        "created_utc": 1620758028,
        "id": "gxrdbt1",
        "score": 1,
        "subreddit": "investing",
        "created": 1620786828.0
    },
    {
        "author": "slickshoes_",
        "body": "No one like Fortinet? It's the only one in the space that's currently making a decent profit.",
        "created_utc": 1619961698,
        "id": "gwnqeyq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619990498.0
    },
    {
        "author": "calichejoe",
        "body": "I like fortinet defined went under the radar for most. If your interested in crypto I Gould look at FPAC if your looking into spacs like CCIV. Thomas Farley is the CEO or director and has crypto specifically mentioned in the S-1 filings. And at this price 9.70 a share you’ll could redeem but I’m planning on buying FPAC warrants shares won’t move much on an announcement but warrants will at least like 40%",
        "created_utc": 1621610869,
        "id": "gyybeoh",
        "score": 1,
        "subreddit": "investing",
        "created": 1621639669.0
    },
    {
        "author": "pumpthatjazz",
        "body": "Fortinet was founded in the year 2000",
        "created_utc": 1621610767,
        "id": "gyyb6ff",
        "score": 1,
        "subreddit": "investing",
        "created": 1621639567.0
    },
    {
        "author": "ColonelLongernuts",
        "body": "I lost my keys when I had $14 worth. The year was 2010. Reeeeeeeporting for duty",
        "created_utc": 1619903224,
        "id": "gwl4gvi",
        "score": 26,
        "subreddit": "StockMarket",
        "created": 1619932024.0
    },
    {
        "author": "AuroraItsNotTheTime",
        "body": "Like the dumbasses who bought bitcoins early on and then... forgot their keys? Like this ain’t your stockbroker account with a password you can recover if you answer 3 out of 4 security questions dude 😂",
        "created_utc": 1619897927,
        "id": "gwksb1o",
        "score": 21,
        "subreddit": "StockMarket",
        "created": 1619926727.0
    },
    {
        "author": "Auquaholic",
        "body": "Hand keys to valet. Walk past pretty fountain and through the glass doors. Scans room. About midway, sees slot machine with a huge rocket on top. Yes, this is the best one in this whole casino. I'm playing.",
        "created_utc": 1620183144,
        "id": "gwze18s",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1620211944.0
    },
    {
        "author": "f1_manu",
        "body": "You clearly didn't understand my post. I specifically mentioned risk management as one of the keys of investing.  Nowhere do I say \"stocks only go up\" or talk about investing tech/growth. I don't know man, stop trying to be picky about everything and grasp the general idea behind what I said",
        "created_utc": 1620314839,
        "id": "gx5rsd2",
        "score": 13,
        "subreddit": "stocks",
        "created": 1620343639.0
    },
    {
        "author": "Pikachu87",
        "body": "Hello, its me, time traveller from the future. Today I time travelled to 8 May, 2022. PLTR announces that all their software will now be free-to-use. However, users will need to watch unskippable ads every 30mins, or pay 100$ each time to skip. Their Gotham and Foundry software will also be throttled and can only be sped up via 'speed boost' tokens, costing 200$ for a set for 5 tokens. Additionally, users can buy keys to open loot boxes that contain customizable skins for their software. If they are lucky, they can even win speed boost tokens.\n\nPLTR stock rises 200%.",
        "created_utc": 1620462689,
        "id": "gxdafkq",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1620491489.0
    },
    {
        "author": "EJ3CTO_SEATO_CUZ",
        "body": "Bots are off, dad took away the car keys",
        "created_utc": 1620271033,
        "id": "gx3yhvp",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1620299833.0
    },
    {
        "author": "BSDC",
        "body": "I think that's an emergency stop mechanism/kill switch. You fasten the non-plastic end to your wrist, so if the plastic gets pulled from the machine, it shuts down. Jet skis have these, too. It technically has a \"key\" sort of function, in that it can enable or disable the machine, but I never thought of them as \"keys.\"",
        "created_utc": 1620255057,
        "id": "gx32alk",
        "score": 9,
        "subreddit": "investing",
        "created": 1620283857.0
    },
    {
        "author": "Ragnaroktogon",
        "body": "Y’all is it worth dipping into my meme stock winnings and paying double rent for three months because I’ve began to resent my roommate (and former best friend) immensely\n\nHe has an extensive DVD collection (cool!) and we also have HBO Max. He wants to watch Ocean’s 11. He has it on DVD, so he has decided to watch it with our friend in 480p and dvd quality rather than just hitting two keys on the remote and watching it in full 4K with surround sound\n\nAlso there are other things but this for me crosses the fucking line",
        "created_utc": 1620189475,
        "id": "gwzp4sa",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620218275.0
    },
    {
        "author": "Peshhhh",
        "body": "Just another reason among many that you should **stop day trading** and **start investing**. The only things that disruptors like Robinhood accomplished by eliminating trade commissions was give the little guys the keys to enter the lions' den and get absolutely wrecked.",
        "created_utc": 1620423442,
        "id": "gxbkyfc",
        "score": 8,
        "subreddit": "stocks",
        "created": 1620452242.0
    },
    {
        "author": "lazerdudes",
        "body": "They keep not allowing people to sell when Doge rises. From my understanding it’s because they are heavily invested and don’t want people to sell. It’s not the stock market so remember nobody is really regulating shady stuff. I’m in crypto and remember this “not your keys not your wallet”. If Doge moons more RH will turn it off until it comes back down I bet.",
        "created_utc": 1620163746,
        "id": "gwy90i5",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1620192546.0
    },
    {
        "author": "rjgnal",
        "body": "They just stole some activation keys from bill gates’s 5G microchips and are trying to market it for themselves.",
        "created_utc": 1620032129,
        "id": "gwrf2nz",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620060929.0
    },
    {
        "author": "CalligrapherOneTwo3",
        "body": "Here are a few points which may or may not be helpful to you from my perspective regarding buying this alternative asset class, cold storage, taxation, and the cheapest method of accumulating/procuring it in Canada:\n\n1. Personally, I only buy on the Newton app since they currently have the lowest purchasing fees out of all of the available exchanges in Canada. Newton's average spread varies from 0.50% to 0.60% which is 2-3 times cheaper than most of the other available exchanges that are available to us as Canadians. I also use the ShakePay app to earn free Bitcoin on a daily basis by physically shaking my phone once a day. Trust me, I know that sounds ridiculous, stupid, and suspicious, but ShakePay is a legitimate company based out of Montréal which is regulated by both FINTRAC and AMF while it is also legally licensed as a Money Service Business. I never actually buy from ShakePay because of their high purchasing spreads (which is approximately 1.75%) and I simply use them for the free daily accumulation of Bitcoin. Anyone who uses ShakePay can attest to this and easily confirm their legitimacy. \n\n2. Since I actually want to own the underlying asset, I withdraw my Bitcoin from both of those exchanges and I put my assets into a cold storage wallet. In Canada, this is currently the cheapest method of accumulating Bitcoin and truly owning the assets by storing them \"offline\" in a cold storage wallet. However, in order to unlock the ShakingSats feature in ShakePay to earn free Bitcoin, you will need to be referred as per their current terms and conditions. I can assist you with that in addition to answering any general questions that you may have regarding buying, selling, converting, and taxation-related issues if you want to message me directly as I am always willing to help educate others in this space with whatever knowledge and/or experience that I have gained over the years.\n\n3. If you want tax free capital gains, you can buy QBTC, BTCX or BTCC in your TFSA. For QBTC, it is certainly expensive in terms of its historical premiums (5%-20%) and MER (1.95%); however, if you are long/bullish in Bitcoin as an alternative asset class, then perhaps it does not really matter. With that said, you do not truly own Bitcoin with any of those because they are a fund; and therefore, you own shares of the fund and not Bitcoin itself. As the saying goes and as you may have heard if you have done your due diligence: \"not your keys, not your Bitcoin\". As such, you run and operate with all of the associated risks of leaving your coins on an exchange which is why I choose to own the real thing and use a cold storage wallet. The products mentioned above are not insured. Big risk, but tax free in a TFSA.\n\n4. You may have heard of a Canadian company named Quadriga. In short, many investors did not truly own their Bitcoin with them since Quadriga sold \"entitlements to receive crypto assets or fiat currency from Quadriga\" while Quadriga held the \"keys\" to the real Bitcoin and investors lost around 135 million dollars CAD, but up to 250 million dollars CAD according to Wikipedia. This is verifiable information, a famous story, and a perfect example of \"not your keys, not your Bitcoin\" as well as a lack of insurance of clients. Also, as of April, 22, 2021, Thodex, an exchange with 400,000 users went offline while Interpol issued a red notice for its CEO who mysteriously disappeared. According to Fortune,  an international manhunt is currently underway to locate the CEO and secure $2 billion in digital tokens he allegedly embezzled from Thodex.\n\n5. Unfortunately, with BTCC, QBTC and WealthSimple Crypto, you cannot take your Bitcoin off of their exchanges because, again, you do not truly own Bitcoin with them. Rather, you own shares of the fund whereas those organizations truly own the asset since they have the \"keys\". They are the ones who own the real asset (Bitcoin) and simply run the fund with the Bitcoin backing that fund as they make money through their ridiculously overpriced premiums and spread/fees (WealthSimple's spread is around 1.5-2.0% if not higher and BTCC's MER is about 1%).\n\n6. In regards to taxes, if you truly own the asset (Bitcoin), it is subject to capital appreciation tax whenever you trigger a taxable event such as selling it, buying things with it, and/or converting crypto-to-crypto. As such, you need to be prudent in your bookkeeping behavior and calculate your \"adjusted cost base\" for each transaction. There is no legal requirement forcing you to calculate your \"adjusted cost base\" for each transaction, but it just saves you a lot of headaches later on when you need to pay taxes. This is no different than investing in traditional equities in a taxable account after you have maxed out your TFSA, RRSP, RESP, etc.\n\n7. Before you invest in anything regardless of the asset class, make sure you understand what you are putting your money towards, understand your risk tolerance, understand the proper asset allocation percentages for your risk tolerance, and formulate a clear plan of what you want to achieve. For me, the biggest investment is not really the Bitcoin itself, but rather, it is in the underlying technology and innovation of the blockchain infrastructure which serves as a massive global public ledger leading to the decentralization of this digital currency as well as its invincibility and independence from overbearing governing bodies whereby the Bitcoin unit itself simply has a monetary value relative to fiat currency. Disclaimer: I am super long Bitcoin.\n\nNow, here are some general points of interests to help you understand cold storage wallets:\n\n1. There is a big misconception that if you decide to operate as your own bank (i.e.truly own your Bitcoin) and use a cold storage wallet device (i.e. physical hardware connected via USB to your PC), that your assets (Bitcoin) will be transferred and stored onto that physical USB device. This is the part that confuses a lot of people. In short, Bitcoin is not stored on that device, it will never be stored there, and this is because Bitcoin can never leave its \"blockchain\".\n\n2. So, what does your cold storage device do? The device allows you to have a \"key\" to your asset (Bitcoin) on the blockchain. How is this \"key\" established? Without going too deep into the technical aspects, when you initially setup the hardware wallet device, you will be given a 24-word \"seed phrase\" and it is literally 24 words. From a computer science perspective, this 24-word \"seed phrase\" actually represents and is transcribed into a huge series/string of alphanumeric characters. This 24-word \"seed phrase\" is essentially your \"keys\" to your assets on the blockchain.\n\n3. Your 24-word \"seed phrase\" is what is most important if you decide to act as your own bank and truly own Bitcoin since this is what gives you access to it. It does not matter if you lose your physical device and it does not matter if your physical device was destroyed. Why? Again, your assets are on the blockchain and not on the physical device. So, if you lose your physical device, you can simply replace it with another one (and this can be one from a different manufacturer too), set it up with your original 24-word \"seed phrase\" and you will once again have access to your assets since they are on the blockchain. In essence, never lose your \"keys\" because then you will have truly lost your Bitcoin. \n\n4. As you can probably see now, your 24-word \"seed phrase\" is extremely important (and more important than the physical hardware device itself). Therefore, when you first take note of your 24-word \"seed phrase\" during the initial setup of your physical hardware device, make sure that no one is watching, there are no cameras around you (including your mobile phone), etc. Only you should know your \"keys\". Never type it out on any digital device, never e-mail it to yourself, never take a photo of it, never upload it to a cloud database such as Google Docs and never try to encrypt it and put it on a regular USB drive. You want this 24-word seed phrase as private as possible. So, if anyone/anything asks you for your \"keys\", never give it out. Period.\n\n5. What is a blockchain? It is a transparent, public, and append-only ledger. Basically, you can add data to this transparent, open, and public ledger, but you can never edit/delete previously established data within it. This is executed by a mechanism of consensus creation between geographically scattered parties (i.e. computers) that do not need to trust each other. The parties only need to trust the consensus mechanism itself. Blockchain infrastructure relies on some form of challenge such that no single party on the network can consistently and systematically solve this challenge more than everyone else on the network. This randomizes the consensus mechanism of confirming transactions and ensures that no single party can force the blockchain ledger to accept a particular entry onto the ledger that others disagree with. This is a peer-to-peer network that can maintain updates to the ledger and verify those updates in such a way that it is impossible to defraud and impossible to alter an entry after it has been confirmed via consensus.\n\nI sincerely hope that this has been helpful to you and good luck!",
        "created_utc": 1620013345,
        "id": "gwqsbe4",
        "score": 6,
        "subreddit": "CanadianInvestor",
        "created": 1620042145.0
    },
    {
        "author": "capn_of_outerspace",
        "body": "If you don’t have your private keys, you don’t own your crypto",
        "created_utc": 1619896755,
        "id": "gwkpq3q",
        "score": 6,
        "subreddit": "stocks",
        "created": 1619925555.0
    },
    {
        "author": "sharkyjackson",
        "body": "Whaaaa surely not someone with “stocks” in their user name? I saw underscore stocks and was ready to DM my wallet keys. You can’t trust anyone these days smh",
        "created_utc": 1620098635,
        "id": "gwv6j7j",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620127435.0
    },
    {
        "author": "Inquisitor1",
        "body": "I remember RKT. Some good info but you could see the hype, get warned about the cramer effect so after the one day profit opportunity it snapped back and people were discussing that before and after. Now it's just a ton of submissions about buy mvis today, next day it loses all price gains, crickets, but hey look at this mushroom company that doesn't have distrubtion expertise or anything noteworthy, buy this one today, and tomorrow crickets.\n\nEven the gme cultist subreddits have stopped with the \"you did a thing, any thing? I'm raising my floor one million brazillion\".\n\nIn February wsb was full of people saying \"we're not talking about silver for fucks sake\". Today? They are the ones pushing silver. Or whatever the next set of sparkly jangly keys are. Shake shake, jangle jangle.",
        "created_utc": 1620302808,
        "id": "gx52zne",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620331608.0
    },
    {
        "author": "rufus2785",
        "body": "No but kids can easily, find the keys to the room, plug it in, or get past a plug lock by finding the key.  Kids are way craftier than people without kids think.  They’re like little geniuses who have no fear or concept of danger.",
        "created_utc": 1620232906,
        "id": "gx1m9h4",
        "score": 4,
        "subreddit": "stocks",
        "created": 1620261706.0
    },
    {
        "author": "getaway18",
        "body": "Most other treadmills are lower to the ground(6 inches) and use a continuous belt for motion. The Peloton tread uses a slat belt which can catch things in between and is 12 inches off the ground. Other treadmills are also lighter(220lbs) and usually have a mechanism to fold upwards so if something gets under it will lift up, the pton tread is 450lbs. Other treadmills also have emergency shut off keys and locks, the tread just has a touchscreen and no emergency shut off.\n\nFor perspective, the pton treadmill caught a 6yr old kid under it and killed them, not like a small dog or infant.",
        "created_utc": 1620256885,
        "id": "gx366tt",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620285685.0
    },
    {
        "author": "the_snook",
        "body": "&gt; Why would international investors put their money on a database controlled by the US government\n\nBecause they trust the US government more than they trust the distributed network to be resilient to 51% and other attacks from adversarial states.\n\nAdditionally, they may have no choice if they want to continue to invest in US government instruments. The US could move all government bond settlements to a blockchain. Why would they do that? It's cheaper. You authorize half a dozen large banks to participate in the quorum and turn down all the government-run infrastructure except the bit that signs the keys of the participants.",
        "created_utc": 1620114397,
        "id": "gwvrxem",
        "score": 3,
        "subreddit": "investing",
        "created": 1620143197.0
    },
    {
        "author": "mouldyrumble",
        "body": "Alright boys, full disclosure: I’m a little saucy. \n\nNoticed a cbr with the keys in it about 200 feet from my apartment... think he’d know if I took it for a spin?",
        "created_utc": 1620444079,
        "id": "gxcn5cl",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620472879.0
    },
    {
        "author": "lornafear",
        "body": "Ex-roomie's friend in China worked at Foxconn. They made everyone live in gender-specific barracks. House \"Dad\" was a creep who had master keys regularly had his way with whomever whenever.",
        "created_utc": 1620087320,
        "id": "gwuk0s5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620116120.0
    },
    {
        "author": "Msg_me_ur_boobz",
        "body": "Not your keys, not your crypto.\nNot your registration, not your stock. \n\nSame principle. That's why your post is wrong because you can take hold of shares but not robinhood crypto.",
        "created_utc": 1620107989,
        "id": "gwvklmo",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1620136789.0
    },
    {
        "author": "naptik187",
        "body": "&gt;  “not your keys not your wallet”.\n\nthat is very true but it is also hard to sell if your keys aren't in an exchange",
        "created_utc": 1620164045,
        "id": "gwy9pkv",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1620192845.0
    },
    {
        "author": "never_noob",
        "body": "\\&gt; How it works (the source) is less what I'm thinking off than stuff like  insider trading limitations, annual reporting requirements, and  financial auditing for brokerages or other services.\n\nMost of this information is visible to literally everyone and some is not relevant at all since it doesn't exist with Crypto, so I'm not sure what you mean.  BTC has instant reporting and auditing, and it's all public: [https://www.blockchain.com/explorer](https://www.blockchain.com/explorer)\n\n\\&gt; The cryptocurrency ecosystem is poorly understood\n\nPoorly understood to people who haven't taken the time to understand it.  Just because many people are ignorant about it doesn't make it inherently opaque.\n\n\\&gt; makes it easy for unscrupulous people to make money if they know what they are doing.\n\nNo one else's scruples impact crypto holdings if you either control your own keys or have a contract with recourse for ownership.  I'm really not sure what you mean here.",
        "created_utc": 1620213108,
        "id": "gx0hieb",
        "score": 2,
        "subreddit": "investing",
        "created": 1620241908.0
    },
    {
        "author": "dorflinuse",
        "body": "You have to distinguish between exchanges and wallets. Some exchanges actually provide you with the coins, other just provide you with exposure to it and give you some kind of object tied to the price action but never the actual transferable coin.\n\nFor exchanges that allow you to buy the coins, just look at [https://coinmarketcap.com/currencies/bitcoin/markets/](https://coinmarketcap.com/currencies/bitcoin/markets/) \n\nEtoro, Robinhood and a few others just allow you some exposure.\n\nFurthermore, exchanges give you acces to the coins, but they are never yours, they still can exert influence on them such as freezing the account and you will not be able to transfer or trade. The second part is much more relevant. These exchanges can be hacked and your coins can be transferred without your consent. In crypto we say, not your keys, not your coins. \n\nWallets are a bit tougher to explain, it's your personal bank account which is accessible through software.  I'll try to explain it buy using Cardano. \n\nA Cardano wallet is accessible through Yoroi and Daedalus and those two allow you to make transactions on the network (sending / staking). So your adress is where it is stored, but the software allows you to mutate the contents. \n\nNow.. if you are still reading :)\n\nWhichever is good for you depends on what you want. First you have to realise the fees.. \n\nEach exchange has fees, trading fees and transfer fees as well as minimum transfer amounts, this scheme varies. Depending on which coins you are interested in, you will find a subset of exchanges with their own set of values for this. \n\nSecond, some coins allow for staking (you can roughly translate this as a short term fixed deposit which gives you a return on investment). This can be done on some exchanges (Bittrex, Binance, Coinbase, Kraken), but again, they facilitate, they take. There are some cases where it is preferable though, i.e. when you don't have the minimum required amount to stake.\n\nWell that's all for now :) If you want more info, send a DM or visit us at the cryptocurrency sub.",
        "created_utc": 1620227406,
        "id": "gx18snr",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1620256206.0
    },
    {
        "author": "Squamsk",
        "body": "I think it will take a bite out of the florida keys. ::***puts up a crumpled $5 bill***::",
        "created_utc": 1620451859,
        "id": "gxcyhpz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620480659.0
    },
    {
        "author": "Snoo21282",
        "body": "🎵🎵🔥🔥 my portfolio is on fire 🔥🔥🎵🎵\n\n\nSung to Alicia Keys \"This Girl is on Fire\"",
        "created_utc": 1620326222,
        "id": "gx6j776",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620355022.0
    },
    {
        "author": "pwh012",
        "body": "There is an actual key that has to be attached for the thing to turn on...if you leave your keys in the ignition and your kid takes your car for a joy ride, we don't recall the car - seems like maybe parents should just not let their kids play with heavy machinery?",
        "created_utc": 1620230170,
        "id": "gx1fjrx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620258970.0
    },
    {
        "author": "kuraitengai",
        "body": "Same. I went back and \"replayed\" all my losses or my panic sells. That's what got me to trust the process.\n\nI opened a  3915/3940/4065/4090 Iron Condor the Thursday before Easter. Thought the long weekend would help me with theta. Didn't pay attention to the jobs report coming out that Friday. Monday comes and SPX spikes. Rolled up my puts to 4025/4050 for more premium and to try to mitigate losses. Should have bailed earlier in the day at a $2k loss, but waited it out, ended up taking a $3.8k loss. Made it all back through the week and ended up +$300 by that Friday. But that is the only time I would have lost. But only because I didn't pay attention to upcoming market events.\n\nOpened a 0DTE 4100/4120 on 4/14. Was still stinging from the $4k loss a week before. Watched it dropping. Literally spend 2 hours in a gaming setup with fingers on the up/down keys and hand on the mouse adjusting my limits. Rode it from a $4k loss to $60 gain to $2k loss, roller coaster. Closed at a $159 loss with 45 seconds left in the trading day. Closed at 4124, so I would have been fine. But had $20k collateral riding on it and couldn't risk that for a $550 premium.\n\nThen monday, opened a 0DTE  4165/4175 spread. Panicked and sold at a $700 loss. Recovered right after I sold and closed at 4191. So would have been fine. That's what changed my thinking to letting it play out and trusting the deltas.\n\nsince 3/22, I've run 31 credit spreads and 16 iron condors. only had the 3 total losses above and 2 of them would have been gains if i had trusted the process. Even with the losses, I'm still up $8,800 in a month and a half.",
        "created_utc": 1620319529,
        "id": "gx62yep",
        "score": 2,
        "subreddit": "options",
        "created": 1620348329.0
    },
    {
        "author": "IIIBryGuyIII",
        "body": "That’s where your confused. You don’t “own” anything in regards to crypto until the crypto is backed behind your private keys.\n\nRobinhood and PayPal don’t even EVER give YOU actual access to the actual crypto.  Coinbase doesn’t relinquish this access until you send it your personal wallet that is backed up by your personal seed phrase.\n\nEdit: I might fall asleep. If your actually interested in learning the intricacy of it from me....and my knowledge is probably minimal in all reality... keep responding and I’ll happily reply at some point.",
        "created_utc": 1619918840,
        "id": "gwlzvg3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619947640.0
    },
    {
        "author": "djb25",
        "body": "Now I can tell myself that my unimaginative name is cool because it’s 5 characters. \n\nIs a lonely swinger a swinger who never gets picked? I thought the fishbowl of keys was designed to prevent that from happening?",
        "created_utc": 1620063330,
        "id": "gwt22q5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620092130.0
    },
    {
        "author": "gatvoedioos",
        "body": "Translation :  \n\n\nWife: OMG I am sorry for the delay\n\nWife's Boyfriend : ok, Can we go now ?  \nHusband :  Oh , you guys are going already ?  \nWife : Oh yes,  sorry babe meet Berrington, the guy I am going on a date with, Berrington meet my boyfriend.  \nHusband : Oh let me find something for you guys(not clear), see just have everything...  \nHusband : you guys are trekking ?  \nWife's Boyfriend : no actually we are using uber\n\nHusband : take my car keys",
        "created_utc": 1620112051,
        "id": "gwvpddm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620140851.0
    },
    {
        "author": "CaptainCaveSam",
        "body": "Just take the tax hit, you’re still gonna have profit. If you’re not shorter term trading keep your keys in an offline wallet. \n\nA wallet only you own. An account there’s a 3rd party, in RH’s case they’ll block selling and not let you send your keys to a wallet. \n\nFuck their promises, other exchanges will treat you better by CEX standards. Or use a DEX like bisq so you don’t have to use your personal information",
        "created_utc": 1620114251,
        "id": "gwvrrta",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1620143051.0
    },
    {
        "author": "ihavetotinkle",
        "body": "That is corrext. Idk the facts, kinda learned about this \"not my keys, not my crypto\" recently. But robinhood isnt a crypto wallet, so you dont own the crypto. So, sell all the crypto you wish to sell, recognize your profits in USD and transfer that to your bank, and start over on a new crypto wallet.",
        "created_utc": 1620150362,
        "id": "gwxlg4i",
        "score": 1,
        "subreddit": "investing",
        "created": 1620179162.0
    },
    {
        "author": "xQuizate87",
        "body": "that's why you turn the car off and take the keys with you whenever you leave the car.",
        "created_utc": 1620057786,
        "id": "gwsoy3l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620086586.0
    },
    {
        "author": "scotty6chips",
        "body": "The keys to unencrypted iMessage are stored privately on the device, in a separate closed chipset. Apple doesn’t have access to the key at all.",
        "created_utc": 1620521485,
        "id": "gxg3t05",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620550285.0
    },
    {
        "author": "Razakel",
        "body": "And you were free to sell your Dogecoin to anyone you wanted to... except you never actually owned it so you couldn't.\n\nIf you don't have the private keys, it's not yours. End of. Caveat emptor.",
        "created_utc": 1620595317,
        "id": "gxjf836",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1620624117.0
    },
    {
        "author": "drewbltz",
        "body": "Robbing hood gives you ious for crypto, not actual crypto. You can’t withdraw it from Robin Hood, you don’t own the keys to it like you do with other exchanges, and so you just have to sell your ious when the time comes.",
        "created_utc": 1620285146,
        "id": "gx4iaa9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620313946.0
    },
    {
        "author": "itsirregardless",
        "body": "Yep. Even on WS. But funny you mention it, cause I actually just sold my BTCC.B. I loved having some exposure to crypto in my TFSA but I think I decided to amass a larger holding in crypto directly and avoid the tax problem by never selling. I may put another ETF in there at some point though.\n\nJust ordered a hardware wallet but if anyone doesn't want to bother with cold storage and managing keys, these ETFs in a TFSA would be a great option.",
        "created_utc": 1620244988,
        "id": "gx2f4y8",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1620273788.0
    },
    {
        "author": "justaRndy",
        "body": "Oh wait another thing. Are they going to convince Sony, Valve, Microsoft etc. to let people sell their digitally owned games / keys back via some Gamestop service, thus removing them from their accounts? Is Gamestop going to open up their own client for digital games and have a full community integration there, expecting people to shift there, leaving everything previously bought behind? \nWill this be integrated to the new consoles, do you think Sony and Microsoft will team up with Gamestop on that?\nBecause there is no buying digital games without an account that is linked to these games. Downloading / streaming games is clearly taking over.",
        "created_utc": 1619910742,
        "id": "gwll6gl",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1619939542.0
    },
    {
        "author": "haight6716",
        "body": "If I had a reason to, I would. Lmk when I can buy car insurance or tickets or whatever. I'm not interested in gambling on the price of nfts and I don't want to expose my keys to a 3rd party.\n\nMaybe one day we can really kill ticketmaster. That would be cool.",
        "created_utc": 1620005139,
        "id": "gwqe1xz",
        "score": 1,
        "subreddit": "investing",
        "created": 1620033939.0
    },
    {
        "author": "TheFrugalMonk",
        "body": "Just buy more blow... hide the handcuff keys",
        "created_utc": 1620504657,
        "id": "gxf7mw8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620533457.0
    },
    {
        "author": "52F1",
        "body": "Yes it was, and in a very generic response I can tell you the CEO has made public statements to the effect of the bad finacials decisons made early on in the company. However I think some futher more detailed clatification is in order.\nAnd lieu of me piecing together the info I have been i touch with Steve Rheinarz the CEO and made a request for these details so you can hear it accurately and right from the source.\nToday they are at a gathering, a grand opening of sorts for the new factory, which is actually more ceremonial passing of the keys to the company and a site tour. So more than likely I wont hear back from him today, but he has usually gotten back to me in a day or two with the few email exchanges we have had.\nWhen I get those details I will post the info to help everyone better understand the companies history.",
        "created_utc": 1619877664,
        "id": "gwjhfq8",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1619906464.0
    },
    {
        "author": "artgarfunkadelic",
        "body": "You bought tlry at 27$?!?! \n\nYep. You retarded. Give him the keys, boys.",
        "created_utc": 1620093562,
        "id": "gwuwvl8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620122362.0
    },
    {
        "author": "toogaloog",
        "body": "You might want to start with finding your car keys 👀👀",
        "created_utc": 1620054810,
        "id": "gwsht27",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1620083610.0
    },
    {
        "author": "Wheeler_Dealer1",
        "body": "look up MtGOX that's where \"Not your keys, not your Crypto” bullcrap started. hell people in turkey just lost all there money because the exchange(*Thodex*) they used CEO stole the crypto that was left on the exchange and disappeared.",
        "created_utc": 1620111185,
        "id": "gwvodwn",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1620139985.0
    },
    {
        "author": "getrichtb",
        "body": "Vista is smashing it.  Last March this thing was a dead horse at 6 bucks then all hell broke loose .\n\n...multiple factors contributed to the greatest run on ammo as long as I have been in the industry ..8 years now. ..national emergency with Covid, Civil Unrest, Police Brutality..looting in Santa Monica, CA of all places, Massive influx of new buyers..the list goes on. \n\nObama was no match for this.  \n\nIt started March 12th 2020 and has been outrageous sales EVERY SINGLE day 417 days in a row!!!!!. Can't keep anyting in stock. Vista has a massive market share(Federal, Blazer, CCI, Speer, American Eagle and now Remington) This is THE ammo stock. They also hold the keys to primer manufacturing which is the reason we are in this mess. The primer shortage caused a backlog and then 10 million new gun buyers wanted to feed their new toys. \n\nSuper Demand City and no Supply easy math. As far as timing..this thing still has some juice left in it I believe and that's because they've had some price increases and recently stated they are behind a billion dollars in orders.\n\nPrice Targets range from 35-49. A consensus buy across the board on most outlets.  I believe all time high was 52 and change..it has a serious shot at beating that.  I have personally spent a year watching and running with this stock.  Seriously hours daily researching this for over a year.\n\nThe negative is there is low volume to move this thing. It's insane. It has taken a big jump, but over 14 months.\n\nThe earnings probably hit 575 million in this report and might break earnings record. It was at 38 not too long ago.  I've owned this since last March at an average of 7.80. I have taken profits twice so far. I now have stock and 35 dollar calls to hit May 21st which are green and also some 40 dollar hail mary calls as well. Those could be dreamers, but I work in this field and it never ends. Phones ringing off the hook..lines all day long.  I can't and won't give you advice on what to do with your hard earned money, but I do believe this company has a serious positive short term outlook.\n\nBest of luck Champ",
        "created_utc": 1620109971,
        "id": "gwvmzl9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620138771.0
    },
    {
        "author": "BhinoTL",
        "body": "Financial education gots the keys my man he's only been wrong once in the years I've been subscribed to him",
        "created_utc": 1620442679,
        "id": "gxcksmv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620471479.0
    },
    {
        "author": "Pe1per",
        "body": "&gt;60% of the hashrate is in China, so China can just take over BTC or turn it off, if it wants.\n\nNot true anymore, hashrate in china recently got below 50% because the US and other places are starting to step up their game. This will only continue as more and more serious institutions start to get it and don't want china to control them. \n\n&gt;The ecological impact of running computers to support BTC is insane and currently unsustainable.\n\nEnergy consumption of Bitcoin is lower then our current monetary system (banks, visa etc) in relative terms. There's also a clear trend to sustainable energy usage since mining is location independent and is a way to profit off of otherwise unusable land and wasted energy (deserts/surplus of the power grid etc.)\n\n&gt;Nobody knows the exact origin of BTC, so nobody really knows if there is a back door to hack\n\nKnowing who Satoshi is is irrelevant in terms of hacking. The entire code of the protocol is public since it started. Bitcoin is an open source project and anyone can look at the code if they want to. There are no backdoors and there's no way to build one unless you want the whole world to see it. \n\n&gt;there are a number of early early adopters that hold a huge amount and can tank the market anytime they decide to sell their billions of dollars worth of BTC\n\nOnly point that's fair imo. Although there's something to be said that the market can tank it by now and it won't be the end of Bitcoin. Also I doubt these individuals would voluntarily trigger a market crash by selling billions at once. They obviously believe in Bitcoin's future or lost their keys otherwise they wouldn't have stayed committed to their holdings for this long. \n\n&gt;I think blockchain is a tech that is here to stay, but current versions are basically beta tests.\n\nSmart contract platforms and everything build on them are still in beta/early adopter territory but Bitcoin isn't. Banks and the biggest financial institutions don't adopt technologies that are in \"beta\" Bitcoin is a trillion dollar asset and on it's way to cross the chasm to the early majority.",
        "created_utc": 1620229771,
        "id": "gx1ek7u",
        "score": 1,
        "subreddit": "investing",
        "created": 1620258571.0
    },
    {
        "author": "JonathanL73",
        "body": "At this point Robinhood users are like that one person who keeps getting back into the same abusive relationship expecting things to be different.\n\nGuys just switch brokers, you have options. The biggest punishment RH can face is loosing customers due to screwing customers. If you stay with RH, you are giving them the greenlight to keep getting away with that. Stop supporting bad brokers, just get the ACATS transfer done.\n\nEdit: You guys should never have bought crypto on RH on the first place, use an exchange that gives you access to your wallet keys like Coinbase, Binance, BlockFi, Kraken, etc.",
        "created_utc": 1619947164,
        "id": "gwn1ugp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619975964.0
    },
    {
        "author": "TreeHugChamp",
        "body": "When she comes out:        \nHer: sorry I’m so late.      \nBf: where do you think you guys are going.        \nGf: oh yeah sorry babes, something about sweets, why don’t you meet my boyfriend.    \nBf: here just have everything.     \nBf#2: ty.       \nBf: you guys are trekking?      \nBf#2: no actually we are using a car.       \nBf: take my car keys now.       \nEnd scene",
        "created_utc": 1620113712,
        "id": "gwvr6n9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620142512.0
    },
    {
        "author": "introvertedhedgehog",
        "body": "Well firstly his ideas hardly addresses the points I illustrated. Interesting but full of conjecture and vague suppositions, typical for that kind of pitch \"people disagree with me but this is because they are stupid and are part of the machine\"\n\n If VCs where prone to believe every similar line of reason they read like Dan's they would invest after every one of thousands of hockey stick presentations they see. Here is one such gem based on emotional appeal to the outsider:\n\n\"The idea that Satoshi perfectly crafted Bitcoin on the first try is unfathomable for them to consider.\" \n\nTo which the first commentor correctly replies \"Because it's unfathomable that this is true\" and there you have the summary of the two sides of the argument.\n\nEven a brief browse through the Wikipedia entry for Bitcoin will tell you as much based on its history.\n\nThere are so many other problems with BtC but let's just choose one and let's also apply another line if reasoning: how secure is it in a physical sense? People are keeping their keys on physical media in safety deposit boxes at multiple banks because they are rightly concerned people can and would kill them for their Bitcoin or otherwise steal it. Many people who used services for their wallet have been burnt hard. We have laws about the fiet money proceeds of such crimes but people who own BTC do well to be concerned. Whose jurisdiction does solving a theft of Bitcoin actually fall under? Where exactly is Satoshi if he is even a real person? If he is not dead it's pretty dangerous to be him.\n\nThe truth is that BTC is flawed and will be changed/replaced as people solve problems with it. As such it will become obsolete or be updated and when that happens it will be vulnerable and Dans reasoning is flawed on this basis.\n\nI have no doubt there is utility for crypto. I just think investing in any particular technology as an investment asset will be demonstrated to be a huge mistake in 15 years when when we look back on the crypto bubble of 20xx. Many of the Dotcom companies had value there was still a bubble. Except now with crypto we have perfected this bubble. For Dotcom and firms pretended to have value and products or services. \n\nBottom line: Dan is invested",
        "created_utc": 1620144188,
        "id": "gwx67sy",
        "score": 1,
        "subreddit": "investing",
        "created": 1620172988.0
    },
    {
        "author": "outandaboutbc",
        "body": "Yes, I am aware of that. It happened in a scenario where it meant either do that or the death of ETH.   \n\n\nI know... I know... \"it happened once, what's to say it won't happen again ?\". \n\nI doubt they'll start reversing it because people's keys got hacked or they got scammed. You can only do so many reversals before people leave. That's bad publicity.",
        "created_utc": 1620183633,
        "id": "gwzeyc9",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1620212433.0
    },
    {
        "author": "Powerful_Reward_8567",
        "body": "You can’t have fake Bitcoin or borrow Bitcoin like shares. It’s all on the blockchain and you can take custody of your keys. People will prefer crypto over stock market with its huge gains in short term.",
        "created_utc": 1620079826,
        "id": "gwu48pv",
        "score": 0,
        "subreddit": "investing",
        "created": 1620108626.0
    },
    {
        "author": "OKImHere",
        "body": "No thanks. Humility ain't my style. You start telling people you got lucky, they start thinking they need to get lucky to be successful. You don't. Anyone can do it. No luck required. \n\nDon't sell yourself short. You say you got lucky breaks, but you also say it can disappear in a heartbeat. So you must understand how quickly you could throw it all away if you made bad choices. Not making those choices is one of the keys to your success. That's not luck. That's you doing that intentionally.",
        "created_utc": 1620176709,
        "id": "gwz0uvo",
        "score": 0,
        "subreddit": "stocks",
        "created": 1620205509.0
    },
    {
        "author": "rica217",
        "body": "Did they show parents how to use the safety keys in this video also or nah?",
        "created_utc": 1620246679,
        "id": "gx2j708",
        "score": 0,
        "subreddit": "stocks",
        "created": 1620275479.0
    },
    {
        "author": "oxxoMind",
        "body": "Don't listen to this “Not your keys, not your Crypto” bullcrap.\n\nIf you forgot your wallet's password or your device accidentally destroyed or malfunction, then your cryptos are gone with it. Its almost impossible to recover it.   \nIf Robinhood gets bankrupt, chances are you can still take back some of your crypto when they got liquidated.\n\nSo its up to your where you want to bet the odds. Put your crypto wherever you feel safe.",
        "created_utc": 1620109458,
        "id": "gwvme7v",
        "score": 0,
        "subreddit": "StockMarket",
        "created": 1620138258.0
    },
    {
        "author": "CalligrapherOneTwo3",
        "body": "Yes, as a Canadian, there are multiple exchanges available to us such as Newton, ShakePay, NDAX, WealthSimple Crypto, and some Bitcoin/Ethereum ETFs. Here are a few points which may or may not be helpful to you from my perspective regarding buying this alternative asset class, cold storage, taxation, and the cheapest method of accumulating/procuring it in Canada:\n\n1. Personally, I only buy on the Newton app since they currently have the lowest purchasing fees out of all of the available exchanges in Canada. Newton's average spread varies from 0.50% to 0.60% which is 2-3 times cheaper than most of the other available exchanges that are available to us as Canadians. I also use the ShakePay app to earn free Bitcoin on a daily basis by physically shaking my phone once a day. Trust me, I know that sounds ridiculous, stupid, and suspicious, but ShakePay is a legitimate company based out of Montréal which is regulated by both FINTRAC and AMF while it is also legally licensed as a Money Service Business. I never actually buy from ShakePay because of their high purchasing spreads (which is approximately 1.75%) and I simply use them for the free daily accumulation of Bitcoin. Anyone who uses ShakePay can attest to this and easily confirm their legitimacy. \n\n2. Since I actually want to own the underlying asset, I withdraw my Bitcoin from both of those exchanges and I put my assets into a cold storage wallet. In Canada, this is currently the cheapest method of accumulating Bitcoin and truly owning the assets by storing them \"offline\" in a cold storage wallet. However, in order to unlock the ShakingSats feature in ShakePay to earn free Bitcoin, you will need to be referred as per their current terms and conditions. I can assist you with that in addition to answering any general questions that you may have regarding buying, selling, converting, and taxation-related issues if you want to message me directly as I am always willing to help educate others in this space with whatever knowledge and/or experience that I have gained over the years.\n\n3. If you want tax free capital gains, you can buy BTCX, ETHX or BTCC in your TFSA. With that said, you do not truly own crypto with any of those because they are a fund; and therefore, you own shares of the fund and not the asset itself. As the saying goes and as you may have heard if you have done your due diligence: \"not your keys, not your crypto\". As such, you run and operate with all of the associated risks of leaving your coins on an exchange which is why I choose to own the real thing and use a cold storage wallet. The products mentioned above are not insured. Big risk, but tax free/deferred in a TFSA/RRSP.\n\n4. You may have heard of a Canadian company named Quadriga. In short, many investors did not truly own their Bitcoin with them since Quadriga sold \"entitlements to receive crypto assets or fiat currency from Quadriga\" while Quadriga held the \"keys\" to the real Bitcoin and investors lost around 135 million dollars CAD, but up to 250 million dollars CAD according to Wikipedia. This is verifiable information, a famous story, and a perfect example of \"not your keys, not your Bitcoin\" as well as a lack of insurance of clients. Also, as of April, 22, 2021, Thodex, an exchange with 400,000 users went offline while Interpol issued a red notice for its CEO who mysteriously disappeared. According to Fortune,  an international manhunt is currently underway to locate the CEO and secure $2 billion in digital tokens he allegedly embezzled from Thodex.\n\n5. Unfortunately, with BTCC, ETHX, and WealthSimple Crypto, you cannot take your Bitcoin off of their exchanges because, again, you do not truly own Bitcoin with them. Rather, you own shares of the fund whereas those organizations truly own the asset since they have the \"keys\". They are the ones who own the real asset (crypto) and simply run the fund with the crypto backing that fund as they make money through their ridiculously overpriced premiums and spread/fees (WealthSimple's spread is around 1.5-2.0% if not higher and BTCC's MER is about 1%).\n\n6. In regards to taxes, if you truly own the asset (crypto), it is subject to capital appreciation tax whenever you trigger a taxable event such as selling it, buying things with it, and/or converting crypto-to-crypto. As such, you need to be prudent in your bookkeeping behavior and calculate your \"adjusted cost base\" for each transaction. There is no legal requirement forcing you to calculate your \"adjusted cost base\" for each transaction, but it just saves you a lot of headaches later on when you need to pay taxes. This is no different than investing in traditional equities in a taxable account after you have maxed out your TFSA, RRSP, RESP, etc.\n\n7. Before you invest in anything regardless of the asset class, make sure you understand what you are putting your money towards, understand your risk tolerance, understand the proper asset allocation percentages for your risk tolerance, and formulate a clear plan of what you want to achieve. For me, the biggest investment is not really Bitcoin itself, but rather, it is in the underlying technology and innovation of the blockchain infrastructure which serves as a massive global public ledger leading to the decentralization of this digital currency as well as its invincibility and independence from overbearing governing bodies whereby the Bitcoin unit itself simply has a monetary value relative to fiat currency. Disclaimer: I am irresponsibly long Bitcoin/Ethereum.\n\nNow, here are some general points of interests to help you understand cold storage wallets:\n\n1. There is a big misconception that if you decide to operate as your own bank (i.e.truly own your Bitcoin) and use a cold storage wallet device (i.e. physical hardware connected via USB to your PC), that your assets (Bitcoin) will be transferred and stored onto that physical USB device. This is the part that confuses a lot of people. In short, Bitcoin is not stored on that device, it will never be stored there, and this is because Bitcoin can never leave its \"blockchain\".\n\n2. So, what does your cold storage device do? The device allows you to have a \"key\" to your asset (Bitcoin) on the blockchain. How is this \"key\" established? Without going too deep into the technical aspects, when you initially setup the hardware wallet device, you will be given a 24-word \"seed phrase\" and it is literally 24 words. From a computer science perspective, this 24-word \"seed phrase\" actually represents and is transcribed into a huge series/string of alphanumeric characters. This 24-word \"seed phrase\" is essentially your \"keys\" to your assets on the blockchain.\n\n3. Your 24-word \"seed phrase\" is what is most important if you decide to act as your own bank and truly own Bitcoin since this is what gives you access to it. It does not matter if you lose your physical device and it does not matter if your physical device was destroyed. Why? Again, your assets are on the blockchain and not on the physical device. So, if you lose your physical device, you can simply replace it with another one (and this can be one from a different manufacturer too), set it up with your original 24-word \"seed phrase\" and you will once again have access to your assets since they are on the blockchain. In essence, never lose your \"keys\" because then you will have truly lost your Bitcoin. \n\n4. As you can probably see now, your 24-word \"seed phrase\" is extremely important (and more important than the physical hardware device itself). Therefore, when you first take note of your 24-word \"seed phrase\" during the initial setup of your physical hardware device, make sure that no one is watching, there are no cameras around you (including your mobile phone), etc. Only you should know your \"keys\". Never type it out on any digital device, never e-mail it to yourself, never take a photo of it, never upload it to a cloud database such as Google Docs and never try to encrypt it and put it on a regular USB drive. You want this 24-word seed phrase as private as possible. So, if anyone/anything asks you for your \"keys\", never give it out. Period.\n\n5. What is a blockchain? It is a transparent, public, and append-only ledger. Basically, you can add data to this transparent, open, and public ledger, but you can never edit/delete previously established data within it. This is executed by a mechanism of consensus creation between geographically scattered parties (i.e. computers) that do not need to trust each other. The parties only need to trust the consensus mechanism itself. Blockchain infrastructure relies on some form of challenge such that no single party on the network can consistently and systematically solve this challenge more than everyone else on the network. This randomizes the consensus mechanism of confirming transactions and ensures that no single party can force the blockchain ledger to accept a particular entry onto the ledger that others disagree with. This is a peer-to-peer network that can maintain updates to the ledger and verify those updates in such a way that it is impossible to defraud and impossible to alter an entry after it has been confirmed via consensus.\n\nI sincerely hope that this has been helpful to you and good luck!",
        "created_utc": 1620574084,
        "id": "gxi7nro",
        "score": -1,
        "subreddit": "CanadianInvestor",
        "created": 1620602884.0
    },
    {
        "author": "TheNorseHorseForce",
        "body": "I mean,  who owns the private keys and encryption method for your imessages. Apple.  \n\nThey can absolutely read them,  if necessary.  However,  I bet it's primarily for FISA warrants,  which are daily.",
        "created_utc": 1620482614,
        "id": "gxdzkaz",
        "score": -2,
        "subreddit": "stocks",
        "created": 1620511414.0
    },
    {
        "author": "vrijheidsfrietje",
        "body": "The solution would be for Jack Ma to adopt the kid and rename him Mini-Ma.",
        "created_utc": 1620475226,
        "id": "gxdnyky",
        "score": 878,
        "subreddit": "wallstreetbets",
        "created": 1620504026.0
    },
    {
        "author": "heycals",
        "body": "How does that kid look older than Ma?",
        "created_utc": 1620444058,
        "id": "gxcn43c",
        "score": 399,
        "subreddit": "wallstreetbets",
        "created": 1620472858.0
    },
    {
        "author": "vrijheidsfrietje",
        "body": "A rich person with a bizarre and memey sense of humor like Elon Musk might in this case. I don't see Jack Ma doing that. We're in the wrong timeline :')",
        "created_utc": 1620478192,
        "id": "gxds6sn",
        "score": 177,
        "subreddit": "wallstreetbets",
        "created": 1620506992.0
    },
    {
        "author": "Ohmstheory",
        "body": "Kid is like....\n\nHE JACK MA FACE",
        "created_utc": 1620456915,
        "id": "gxd4g4j",
        "score": 150,
        "subreddit": "wallstreetbets",
        "created": 1620485715.0
    },
    {
        "author": "harsh876",
        "body": "He was taken from his parents when young because of how similar he look and was taken on different gigs and publicity events, now that he’s older he’s been essentially abandoned\n\nArticle:\n\nhttps://www.whatsonweibo.com/six-years-after-becoming-a-viral-hit-little-jack-ma-is-not-doing-well-at-all/",
        "created_utc": 1620473518,
        "id": "gxdlsjt",
        "score": 149,
        "subreddit": "wallstreetbets",
        "created": 1620502318.0
    },
    {
        "author": "Janto_2021",
        "body": "#look ma, it's Frodo Baggins",
        "created_utc": 1620421700,
        "id": "gxbh9il",
        "score": 145,
        "subreddit": "wallstreetbets",
        "created": 1620450500.0
    },
    {
        "author": "idma",
        "body": "I honestly never bothered to check out PLTR because I knew there was way too much volatility, I just took a look, holy crap, talk about whiplash. \n\nIt didn't even establish a MA until after it spiked up then spiked down",
        "created_utc": 1620342394,
        "id": "gx7kz2h",
        "score": 140,
        "subreddit": "wallstreetbets",
        "created": 1620371194.0
    },
    {
        "author": "Kaita316",
        "body": "Are we sure that Jack Ma didn’t reincarnate?",
        "created_utc": 1620453676,
        "id": "gxd0pgh",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1620482476.0
    },
    {
        "author": "invader2",
        "body": "Very cheap company. Would easily trade for double without the risks. \n\nI’ve been wanting to start a position but I can’t bring myself to buy it. Risk of accounting fraud. The fact that VIEs are illegal in China and there’s no guarantee share holders have any rights. Also the fact that jack ma stole alipay from alibaba shareholders 10 years ago.",
        "created_utc": 1620220046,
        "id": "gx0sran",
        "score": 40,
        "subreddit": "ValueInvesting",
        "created": 1620248846.0
    },
    {
        "author": "CrashTestDumb13",
        "body": "Um. My whole portfolio. I buy and hold everything for the long term. Unless if something fundamentally changes with any of my companies I have no plans to sell. But my biggest holdings are AMZN, NVDA, MA, and V.",
        "created_utc": 1620444267,
        "id": "gxcngiu",
        "score": 33,
        "subreddit": "stocks",
        "created": 1620473067.0
    },
    {
        "author": "donrane",
        "body": "Yea, not sure Jack Ma is in an environment that´s suitable for children.",
        "created_utc": 1620481377,
        "id": "gxdxcnm",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1620510177.0
    },
    {
        "author": "squarerabbits",
        "body": "You're right that's fucked up\n\nhttps://www.vice.com/en/article/5dpe7n/jack-ma-doppelganger-quits-livestreaming",
        "created_utc": 1620453422,
        "id": "gxd0el8",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1620482222.0
    },
    {
        "author": "Neuchacho",
        "body": "He looks like Jack Ma.",
        "created_utc": 1620472502,
        "id": "gxdkkil",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1620501302.0
    },
    {
        "author": "Milkingcowcat_Morphy",
        "body": "https://www.ellemen.com/spotlight/a35606550/xiao-ma-yun/\nI knew the story when I was in China , because he was a “super star” back to that time. There are many reports cover this story, one important reason that he got abandoned is that, since last year, there has been such a “correct bad values on internet” action in China. There are also more examples except him, for instance, the “eating broadcasts” were extremely popular before, now is forbidden to show up on the internet in China. \nbtw, source is in Chinese..",
        "created_utc": 1620462868,
        "id": "gxdalz2",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1620491668.0
    },
    {
        "author": "GeezWhizGuys",
        "body": "Jack MA's mother is Ma Ma.",
        "created_utc": 1619912845,
        "id": "gwlp26x",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619941645.0
    },
    {
        "author": "freeBobbyDAYVID",
        "body": "mini ma",
        "created_utc": 1620445650,
        "id": "gxcpnsg",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1620474450.0
    },
    {
        "author": "icvy",
        "body": "but that kid is a real sad. Chinese media hype him up due to his resemblance to Jack Ma, then some company signs him as a \"celebrity\", after milking him for months/years, they throw him aside.",
        "created_utc": 1620455029,
        "id": "gxd2b2t",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1620483829.0
    },
    {
        "author": "cambeiu",
        "body": "Just remember: [996](https://www.marketwatch.com/story/alibabas-jack-ma-calls-the-996-chinas-72-hour-work-week-a-huge-blessing-2019-04-15)",
        "created_utc": 1620005706,
        "id": "gwqf2e8",
        "score": 10,
        "subreddit": "StockMarket",
        "created": 1620034506.0
    },
    {
        "author": "erasuli",
        "body": "Yeah it’s better to buy shares than to buy options. It’s difficult to time the market. I was holding sndl options and the expired like a week before the stock blew up.\n\nAli baba is extremely undervalued. It’s a gift at this price. But no one can really predict when it will take off. It took off once people found out that jack ma was ok and then again when the communist government hit Ali baba with a fine.\n\nIt will go up, hopefully soon. But it might require some patience.",
        "created_utc": 1620351026,
        "id": "gx81x6g",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1620379826.0
    },
    {
        "author": "Cloverfied",
        "body": "He talked about any or all \"revolutions\", noting Ford's industrial revolution in turning factories into production engines, have many car companies start and fail within a short time period.  He displayed a list of car companies throughout the early 1900's and noted that he wanted to show all the car companies that started up making cars with their name that started with the letter \"M\" but then found that there were so many within the letter \"M\" that he decided to take just the car companies that started with just \"Ma\" and had a large populated list of companies that started and failed in the automobile manufacturing business.\n\nHis opposition doesn't come from a new market being created, his opposition is in choosing who the winners of that market are going to be.  The ones that will return profits to investors over a period of time - hopefully enough time to return the investor's capital and then some.\n\nBuffet doesn't \"not understand\" speculation.  He understands it just fine, his thesis is to invest in good companies that offer returns to shareholders based on the capital they have at risk.  He believes that in a world of thousands upon thousands of companies there is no need to take undue risks and that over a long period of time, making investments in quality companies with good management will return more profits than making a gamble on companies with a large amount of potential outcomes.  He believes his ability, or anyone's for that matter, to \"pick\" a winner based off so many unknown variables is completely at question and warns anyone to steer clear of said behavior.",
        "created_utc": 1619905002,
        "id": "gwl8vyx",
        "score": 10,
        "subreddit": "CanadianInvestor",
        "created": 1619933802.0
    },
    {
        "author": "NeoMatrixBug",
        "body": "Ma man, Diamond 💎hands to making world better and fairer to oppressed.",
        "created_utc": 1620307155,
        "id": "gx5arev",
        "score": 10,
        "subreddit": "Wallstreetbetsnew",
        "created": 1620335955.0
    },
    {
        "author": "Parking-Aside-6166",
        "body": "Ma tilray gang how are you holding up? 🚀🚀🚀",
        "created_utc": 1620396724,
        "id": "gx9x8kd",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1620425524.0
    },
    {
        "author": "Parking-Aside-6166",
        "body": "Ma tilray gang, dont you start selling now, we’re in it for the big win \n13—-&gt;16—&gt;20—&gt;30 ——&gt;60$ 🚀🚀🚀",
        "created_utc": 1620399755,
        "id": "gxa45l2",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1620428555.0
    },
    {
        "author": "NachzehrerL",
        "body": "YSK that people have done terrible things to that child just because he looks like Jack Ma, by terrible I mean injecting the boy with slow-growth hormone type of terrible. \n\nhttps://www.whatsonweibo.com/six-years-after-becoming-a-viral-hit-little-jack-ma-is-not-doing-well-at-all/",
        "created_utc": 1620454906,
        "id": "gxd25w9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620483706.0
    },
    {
        "author": "judi_hench",
        "body": "Huh? That's not really a reply to what I've said. You did the same with the guy above who articulates my point much better.\n\nI think clover will go up in the mid/long term with the MA age and expansion plan, but it's got a long hangover effect of spacmania and the seek insurance thing is a valid concern. I also think that since gme everything has become a \"omg short interest\" fiasco with people buying stocks expecting a repeat. It ain't going to happen every again, risk adjustment across the board already occurred (look at the jump in clov to 17).\n\n\n\nSo in summary, it is about making bets, but not about parroting useless shite like you have done. Buy shares if you think it'll go up, average down it it tanks post earnings. Don't expect a squeeze, gamma slides occur but less frequently than people would have you believe",
        "created_utc": 1620462609,
        "id": "gxdacsf",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620491409.0
    },
    {
        "author": "EP40BestInDaLee",
        "body": "When the pimps in the crib ma pop it in my ass, pop it in my ass",
        "created_utc": 1620018961,
        "id": "gwr0as9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620047761.0
    },
    {
        "author": "Crisn232",
        "body": "wellll HELLLOO Mr. Powells! I am dr. Ma and this... this is mini-Ma!",
        "created_utc": 1620482389,
        "id": "gxdz5ms",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620511189.0
    },
    {
        "author": "dennis8542",
        "body": "Lmao I say that yesterday too... I ma go cry to 💤😂",
        "created_utc": 1620116204,
        "id": "gwvtwk0",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620145004.0
    },
    {
        "author": "M-Catalyst",
        "body": "I have a bullish outlook on both as well even if I am not currently long on either atm. SQ looks to have a double bottom on the daily chart and the 50 MA has held up these past few weeks which makes me think a minor beat on earnings would at the very least not drop below $240 in the very near short term. You never know obviously but the risk imo isn't substantial if one wanted to swing trade a call even holding through earnings for unexpected results. For holding stock I don't see it worth it atm as I see an entry at around 225 to be feasible as it tends to fall thru it's 50 MA for a few days before pivoting back up. The chart basically fuckin looks like the NASDAQ. W shaped recovery lol. Think it won't get that close to it's recent low of $202. Sorry for the wall of text, even if I'm not in these plays I just seem to enjoy theory crafting lol",
        "created_utc": 1619881691,
        "id": "gwjq7ar",
        "score": 6,
        "subreddit": "options",
        "created": 1619910491.0
    },
    {
        "author": "SojoX",
        "body": "the risk and benefit of chinese stocks is its government. It's a government with absolute authority and highly centralized. Jack Ma and Ant Finance  just examples of the government show corporations who's the ruling class. Well, the government can help companies go to the moon too with its almost unlimited resources",
        "created_utc": 1620106599,
        "id": "gwvitp0",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620135399.0
    },
    {
        "author": "t33po",
        "body": "Never forget Jack Ma. Still dissapeared. If the Bezos of China can be erased, anyone can be. Happy Chinese stock speculation! NIO plays by the rules tho👀👀👀",
        "created_utc": 1620105980,
        "id": "gwvi066",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620134780.0
    },
    {
        "author": "nightastheold",
        "body": "Bought BABA weeklies at close. I think Jack Ma is going to be spotted riding a jet ski",
        "created_utc": 1620072595,
        "id": "gwtnyb1",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620101395.0
    },
    {
        "author": "chainerection",
        "body": "\"In The Air Tonight\" is ma favourite song of his.",
        "created_utc": 1620125457,
        "id": "gww4gr4",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620154257.0
    },
    {
        "author": "powerbutts",
        "body": "Jack Ma in a little trouble himself.",
        "created_utc": 1620481008,
        "id": "gxdwppy",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620509808.0
    },
    {
        "author": "gettendies",
        "body": "They lobotomized Jack Ma amd he was one of their own!",
        "created_utc": 1620182330,
        "id": "gwzch16",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620211130.0
    },
    {
        "author": "ThePelvicWoo",
        "body": "NASDAQ found support on the rising 100 day MA in March, yesterday it tested the 50 day and bounced. It's still stuck in a range and has been for a couple months now .\n\nSuch a boring market to trade in",
        "created_utc": 1620229306,
        "id": "gx1deis",
        "score": 4,
        "subreddit": "stocks",
        "created": 1620258106.0
    },
    {
        "author": "Inferdo12",
        "body": "Didn't jack ma retire?",
        "created_utc": 1620010537,
        "id": "gwqnp4b",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1620039337.0
    },
    {
        "author": "therealoptionisyou",
        "body": "I have been using 100 and 200 moving average crossing to filter stocks that might be recovering after dipping. The downside of this approach is that if the crossing doesn't happen today (I think) it won't show in the results. Also there are noises like stable stocks that fluctuate around the MA. I'm using TradingView.\n\nPlease let me know if anyone has a better approach!",
        "created_utc": 1619875288,
        "id": "gwjdapy",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1619904088.0
    },
    {
        "author": "eyeball29",
        "body": "I was going to mention cryptocurrencies as a whole, as they are popping up as usable currencies all over the place. You can buy computer parts on Newegg, local shops are taking it up, credit card companies are delving into it so you can pay \"wherever Visa and Mastercard are accepted\". I think this takes a lot of steam out of the fallback onto gold theory.",
        "created_utc": 1619996331,
        "id": "gwpxwbm",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620025131.0
    },
    {
        "author": "paper_bull",
        "body": "Fuck jack ma is one ugly mofo.",
        "created_utc": 1620453727,
        "id": "gxd0rlm",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620482527.0
    },
    {
        "author": "kingsword",
        "body": "Am I retraded to drop 30% on SPY $450, Mar 2022? Dropping another 20% on $MA and $CLNE too. Hold my hands papa jpow",
        "created_utc": 1620012062,
        "id": "gwqq9xs",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620040862.0
    },
    {
        "author": "midtnrn",
        "body": "SPY was over extended off 50 day MA. I'm guessing we correct back down to 400-405 range over the next week.",
        "created_utc": 1620141949,
        "id": "gwx0oyp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620170749.0
    },
    {
        "author": "ShiddyInvestor",
        "body": "7 ma dude",
        "created_utc": 1620446761,
        "id": "gxcre1q",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620475561.0
    },
    {
        "author": "Koop-a-loop",
        "body": "IMO, wait until it reclaims the 200 MA or finds some sort of support",
        "created_utc": 1620329035,
        "id": "gx6pu74",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620357835.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "It’s all growth. If you like growth you gotta buy some value/hybrids right now like MasterCard or Visa. Even Facebook or GOOGL could fall in that category. The market will treat the financials better though, for now at least. Travel spend increase will push them up another 15-25% this year alone.",
        "created_utc": 1620336395,
        "id": "gx77sgq",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620365195.0
    },
    {
        "author": "ZhangtheGreat",
        "body": "The following stocks in my portfolio need to get their heads out of their asses and start gaining again: TSLA, MA, MSFT, DIS, MRNA, INTC, EBAY. Please call me when you’re showing some positive momentum for once ![gif](emote|free_emotes_pack|disapproval)",
        "created_utc": 1620318509,
        "id": "gx60j92",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620347309.0
    },
    {
        "author": "tell442",
        "body": "Anyone else ever have TD sell the wrong tax lot? I submitted LIFO and it sold FIFO.\n\nJust got off the phone with them they claim they would correct it.\n\nI had SHAK shares from last June it sold instead of ones i wanted to sell i bought in March when it broke the 100 day ma",
        "created_utc": 1620396005,
        "id": "gx9vo0l",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620424805.0
    },
    {
        "author": "invader2",
        "body": "What about when jack ma stole alipay from alibaba shareholders? \n\nOr the risk of accounting fraud.\n\nI agree that on paper it looks super cheap. I can’t bring myself to buy it tho.",
        "created_utc": 1620219442,
        "id": "gx0rmdo",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1620248242.0
    },
    {
        "author": "QuietStormMk",
        "body": "Go collect your stimmy peasant, ma last posts are for you and your wife and her mother",
        "created_utc": 1620285564,
        "id": "gx4ir9v",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620314364.0
    },
    {
        "author": "b4ttlepoops",
        "body": "GME may not have had a good day... but look at the year to date returns/ 1 yr return! It’s on sale guys! \n\nSymbol:\tGME\nName:\tGameStop Corp.\nLast Trade:\t160.73\nChange:\t-1.47\nChange %:\t-0.91%\nPrev Close:\t162.20\nOpen:\t159.00\nHigh:\t161.49\nLow:\t151.80\nVol:\t3.97M\nAvg Vol:\t24.98M\n1yr Target:\t41.79\n50-day MA:\t154.31\n200-day MA:\t61.96\nEPS:\t-3.31\nMkt Cap:\t11.38B\nYtd Return:\t753.13%\n1yr Return:\t2833.03%\nShort Rate:\t0.65%\nBeta:\t-1.82\nInst. Own:\t1.09%\nDiv &amp; Yield:\t1.52 (43.80%)\n Created by StockMaster https://itunes.apple.com/us/app/id591644846 https://www.stockideal.com/app/index.html",
        "created_utc": 1620174111,
        "id": "gwyvexi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620202911.0
    },
    {
        "author": "OutOf12One",
        "body": "I agree in that threat but I think with TAM of $50B plenty of room. This will likely be a threat down the line but not anytime soon. Also not sure if you caught that former CEO of MasterCard is on the Board so plenty of connections and likely sticks if affirm decides to enter their space.",
        "created_utc": 1620108417,
        "id": "gwvl4vp",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1620137217.0
    },
    {
        "author": "StockNewbs",
        "body": "Jack ma",
        "created_utc": 1620075934,
        "id": "gwtvkif",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620104734.0
    },
    {
        "author": "RobotArtichoke",
        "body": "500 mA \n\nHope you don’t need your phone for a while",
        "created_utc": 1619978679,
        "id": "gwowfbi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620007479.0
    },
    {
        "author": "AstronautCurrent408",
        "body": "ma man",
        "created_utc": 1620387905,
        "id": "gx9gqic",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620416705.0
    },
    {
        "author": "RidexThexWave",
        "body": "ARKK 5/21 100p. Closing the week below the bottom channel trendline and seems to have bounced off the 200-MA which should equal some short term pain. May be a little early but I won't be late!",
        "created_utc": 1620413771,
        "id": "gxb0g8o",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620442571.0
    },
    {
        "author": "FappyDuPlenty",
        "body": "Hey everyone, I have the same story you probably see on a daily basis...Got into investing with the retail craze that hit at the beginning of 2021.  Started off with the growth stocks, had some highs had some lows but I've settled into a more sustainable and hopefully less stressful portfolio and I would love if I could get some feedback.  See below for my tickers:\n\nMost of these are going to be long term positions but I'm planning on swing trading AMD, INTC, NVDA, Z\n\n* AAPL (9.77%)\n* AGNC (4.89%)\n* ALLY (2.05%)\n* AMAT (5.86%)\n* AMD (9.15%) \n* AMZN (8.75%)\n* FB (1.38%)\n* GOOG (12.37%)\n* HD (2.08%)\n* HRZN (4.4%)\n* INTC (2.94%)\n* LOW (1.67%)\n* MA (4.82%)\n* MSFT (7.72%)\n* NVDA (2.32%)\n* O (2.59%)\n* OMF (2.16%)\n* PSEC (6.25%)\n* QYLD (1.73%)\n* SHW (2.31%)\n* V (3.26%)\n* Z (1.53%)\n\nThanks for taking a look! Do I have too many tickers, should I sell some of those and move that money into something like VTI, QQQ, etc?",
        "created_utc": 1620406057,
        "id": "gxaizo3",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620434857.0
    },
    {
        "author": "UnderstandingNew7083",
        "body": "This is allowed on WSB?? Wtf is going on? I’ve seen 2 pro GME posts in my feed this morning. \nEND GAME. TURN UP THE MA FUKN VOLUME",
        "created_utc": 1620299874,
        "id": "gx4yjlp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620328674.0
    },
    {
        "author": "TopBuyer777",
        "body": "In 418 call ma that expire today . I should get a double easily",
        "created_utc": 1620229132,
        "id": "gx1cyxv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620257932.0
    },
    {
        "author": "chasingthecontrails",
        "body": "I used to travel tons for work so it was worth it for me. They also have the best service compared to my visa or mastercard(s)",
        "created_utc": 1620243377,
        "id": "gx2baoh",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1620272177.0
    },
    {
        "author": "Captain-Whoopass",
        "body": "Max pain for rate hike is 200 day MA so 360 as of today",
        "created_utc": 1620180082,
        "id": "gwz7yqg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620208882.0
    },
    {
        "author": "dehmos",
        "body": "Ma boy. Am so proud of you",
        "created_utc": 1619878504,
        "id": "gwjj4re",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619907304.0
    },
    {
        "author": "spyaintnobitch",
        "body": "I have no idea why there isn't a legit market-based real world casino. Or is there? I want to bet on SPY 0 dates with titties in ma face",
        "created_utc": 1620094937,
        "id": "gwuzkwg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620123737.0
    },
    {
        "author": "bofasaurus",
        "body": "Jack ma missing was the best thing to happen to the discussion thread",
        "created_utc": 1620096764,
        "id": "gwv33ye",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620125564.0
    },
    {
        "author": "MadCritic",
        "body": "UNH! Its chart simply gives me peace. \n\nBRK-B. Can't go wrong with it, diversified within itself.\n\nDIS. Your childhood, your dad's childhood, your future kid's childhood. Also Pixar, Marvel, and Star Wars. Got theme parks + streaming service.\n\nO. Real estate stock that pays monthly dividend. Good for having cash on hand.\n\nMasterCard and Visa!",
        "created_utc": 1620074041,
        "id": "gwtr8jv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620102841.0
    },
    {
        "author": "EdwardDiGi",
        "body": "Well I think biden administration has to deal with China, until now nothing has changed but the issues on the table are numerous:\n\n\\- Meng Wanzhou release from Vancouver should start the appeasement process\n\n\\- Lift of Iran sanctions, to benefit oil and investments between China and Iran\n\nIf US succeeds in that Chinese may start to open themselves more to Western investors, and confidence will start to come back\n\nJack Ma was becoming too powerful, and was a threat for political stability in the country. With new rules getting in place and time to understand them, plus trade tensions going away little by little, I guess China can be a good place to be in the stock market",
        "created_utc": 1620047317,
        "id": "gws1h25",
        "score": 2,
        "subreddit": "investing",
        "created": 1620076117.0
    },
    {
        "author": "death_by_paper_cut",
        "body": "Yeah tell that to Jack Ma",
        "created_utc": 1620165380,
        "id": "gwycssq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620194180.0
    },
    {
        "author": "Donkeycow15",
        "body": "Hoes pay ma bills",
        "created_utc": 1619988262,
        "id": "gwphway",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620017062.0
    },
    {
        "author": "tacofury-inc",
        "body": "Look MA! We got a gatekeeper!",
        "created_utc": 1619988493,
        "id": "gwpicst",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620017293.0
    },
    {
        "author": "Rattlessnakes",
        "body": "If you ain’t from ma hood",
        "created_utc": 1620474167,
        "id": "gxdmkzv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620502967.0
    },
    {
        "author": "StarShip2SpaceCake",
        "body": "Saw u/JoeyFoster222's meme and this nonsense was birthed like a jar to spawn\n\n\nHave a fantastic weekend you funky motherfuckers\n\n\nAnd remember to call ma dukes on Sunday, she'd love to hear from ya! 🍄⚡✌️",
        "created_utc": 1620447122,
        "id": "gxcrxz9",
        "score": 2,
        "subreddit": "shroomstocks",
        "created": 1620475922.0
    },
    {
        "author": "cplange1",
        "body": "&gt;NASDAQ found support on the rising 100 day MA in March, yesterday it tested the 50 day and bounced. It's still stuck in a range and has been for a couple months now .\n\nThe reason I'm not using the 50 is that it hasn't generally respected the 50.  The lows tend to respect the 100-day during dips which tends to correspond closely with the trend line I drew.\n\nI don't think we're looking at a major meltdown--there's nothing so catastrophic we'd hit correction that I know of, but I think there may be a modest pull back to consolidate after earnings as well as take profits (there could also be some rebalancing as well)",
        "created_utc": 1620229869,
        "id": "gx1eswr",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620258669.0
    },
    {
        "author": "arbiter12",
        "body": "Ma dude got lucky and thinks he's a genius.\n\nI'd like to say it happens to the best of us but really, it happens only to the worst.",
        "created_utc": 1620397850,
        "id": "gx9zrb1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620426650.0
    },
    {
        "author": "somekindofgiuse",
        "body": "Grandissimo! Io che potevo permettermi solo 36 azioni mi sento povero... Ma non per molto",
        "created_utc": 1620401334,
        "id": "gxa7twx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620430134.0
    },
    {
        "author": "tockstocks",
        "body": "No worries. I'm actually home sick right now (not Covid, just sinus infection) so I don't have much else to do, anyway. :)\n\n1. They sent our practice a cold call email with the features and it seemed cool looking, so I tried it out. I tend to try lots of demos mostly just to see what is out there, but I never really have plans to make a full switch because we like ECW. It was more curiosity than a desire to switch, really. If it had been a platform that could have integrated directly into our EMR, that would have been better. \n2. We pay a quarterly licensing free for ECW and had/have some setup costs with new features. Overall, the expense is roughly $15k + $5k per provider, per year. I think the biggest hurdle is that it isn't using practice data, but insurance claim data. In theory, that should be the same, but it is definitely not in practice. We are also rather unique in that we don't participate with Medicare, so we have very few MA patients and wouldn't be able to use this for 95% of our patients. That point was probably my biggest reason for not adding one extra tool, even though it is free. At some point, there is just too much data and you can't expect employees to navigate it efficiently, so we stick with basic measures and just try to do really well on them. \n3. Nobody else has offered to pay us to use a service, so that is unique. Athena has a free EMR version, but it is ad-supported so our visit notes would look like they're sponsored by a drug company, which isn't a good look! The financial incentive selling points seem to be the ability to easily qualify for Medicare Meaningful Use, but we don't participate so that benefit doesn't help us. \n4. I have had more pitches for a direct contracting service in the last two months than I've had in 14 years, so I feel like a ton of companies are trying to jump on what they are as easy money. We are a part of an ACO, but are not subject to capitation. I think FFS is going away, but not until something like Medicare for All is passed. Not sure of the timeline there, but I'd expect 2023 to be the point where smaller primary cares actually start moving towards something like that. Our ACO has put December 2022 as their \"you must promise to at least consider a capitation model\" deadline, but we are not required to switch at that point. \n\nLastly, because we don't take Medicare, I don't think we are exactly Clover's target market right now and may not be the best perspective on their sales pitch. All the commercial insurances are already doing their own similar thing, so they'll be competing with existing products from BCBS/Cigna/UHC/etc. if they ever mean to expand past Medicare.",
        "created_utc": 1620245868,
        "id": "gx2h847",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620274668.0
    },
    {
        "author": "jsfsmith",
        "body": "&gt; The leader of Alibaba is in an open conflict with his totalitarian government.\n\nDaniel Zhang has problems with the CCP? This is news to me. \n\nIf you're talking about Jack Ma, he hasn't been involved with running Alibaba for years.",
        "created_utc": 1620405040,
        "id": "gxaglcq",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620433840.0
    },
    {
        "author": "Tongaduder",
        "body": "Du ma what kind of viet does this shit?",
        "created_utc": 1620428953,
        "id": "gxbvzuu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620457753.0
    },
    {
        "author": "Freaking_Donk_2020",
        "body": "Bought BaBa right from the IPO. JACK MA might as well be richest man on earth but china ain't having it! He got kidnapped for like a month. Smh",
        "created_utc": 1620456477,
        "id": "gxd3yl4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620485277.0
    },
    {
        "author": "Investing8675309",
        "body": "I think there’s a lot of garbage in KWEB. Would rather pick and choose and roll the dice - like I think Tencent, BABA, and probably JD are good bets. Besides, with Tencent you basically get a Chinese VC firm with Pony Ma managing your money. Don’t get me wrong, I respect the approach of KWEB and index investing and it makes sense, just feel like I have enough friends in China that I have confidence in a few specific targets.",
        "created_utc": 1620224857,
        "id": "gx12w0r",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620253657.0
    },
    {
        "author": "jsfsmith",
        "body": "There's a lot of misinformation about the VIE structure that's worth clearing up here. It is true that all of Alibaba's assets are privately owned by the founders of the company. However, those founders also hold BABA / HKG:9988, because the VIE has an exclusive contract to the profits of Alibaba. If you look up their 20-F SEC filing, you can see the exact number of shares owned by Jack Ma, Joseph Tsai, etc. \n\nThere is no such thing as \"Chinese Alibaba stock.\" It does not exist. It is only listed outside of China via the VIE structure. As such, the VIE is essentially Alibaba's main / only source of capital. Also, both the NYSE listing (BABA) and the HKEX listing (9988) are for the same Cayman Islands VIE. While the VIE does absolutely introduce a degree of uncertainty, Alibaba needs their foreign shareholders just as much as the foreign shareholders need Alibaba. It is in their best interests to keep the peace and keep shenanigans to a minimum.",
        "created_utc": 1620297320,
        "id": "gx4vaz9",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620326120.0
    },
    {
        "author": "competitivebunny",
        "body": "Mod this ma— *wait*",
        "created_utc": 1620257648,
        "id": "gx37sgu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620286448.0
    },
    {
        "author": "chainerection",
        "body": "I see ma doppel ganger.\n\nYeahh,Fuck you tim go up to 150",
        "created_utc": 1620133788,
        "id": "gwwhz82",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620162588.0
    },
    {
        "author": "Homeless_Emperor_Xi",
        "body": "Jack Ma is not the CEO. Please do your research before parroting FUD.",
        "created_utc": 1620070817,
        "id": "gwtjvbi",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1620099617.0
    },
    {
        "author": "ZhangtheGreat",
        "body": "I overpurchased CP today. If the price goes back up, I’m going to unload a few shares for a quick gain. I’m also going to yell at MA for wiping out all my gains over the last month; it better not be losing ground to other credit cards!",
        "created_utc": 1620079890,
        "id": "gwu4djt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620108690.0
    },
    {
        "author": "midtnrn",
        "body": "I too have been burned by Tesla. Yesterday I was actually expecting a bounce. It was sitting around 20 and 50 day MA and knowing 700 was a prior support level all the ingredients were there for a bounce.",
        "created_utc": 1619872262,
        "id": "gwj8rmd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619901062.0
    },
    {
        "author": "Nerdicane",
        "body": "MVIS is pure pump and dump. They have no product to market. They’re hoping to get bought by someone bigger.\n\nYahoo finance has, as of april 14th, FAMI having a 2% Short interest. The share offering accounts for the dip in price. So, theoretically, the short interest went from 2% to 130% and it didn’t affect the price. \n\nNot to mention this wasn’t a company the was overvalued or failing to begin with, which is usually what draws short attention. They’re just a tiny mushroom grower in China. Why would financial institutions target that?\n\nWhich brings me to the biggest factor for me, China. Every company in China is owned by China. They just allow business owners to think they own their company. Just ask Jack Ma. Or you could if he wasn’t still missing after 3 months. IF he shows back up I’m sure he’ll be much more pro-CCP. But I’m sure when he’s replaced , the new guy will certainly be. \n\nMy philosophy is this: if there are inconsistent signals and it’s the CCP, stay the fuck away.",
        "created_utc": 1619875894,
        "id": "gwje9pj",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1619904694.0
    },
    {
        "author": "CRASH_THE_WORLD",
        "body": "Dioporco ma allora c'è ne sono di italiani ritardati e io che pensavo di essere l'unico",
        "created_utc": 1619856264,
        "id": "gwir47k",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619885064.0
    },
    {
        "author": "zeroIsAllorNothing",
        "body": "HaHa! Dangerous times, always. \nBtw, that’s the lower line on a Bollinger Band. As Volatility rises the bands widen, since they are plus minus 2Sigma from the MA. I don’t display them to prevent optical clutter. Thx.",
        "created_utc": 1620060759,
        "id": "gwsvysc",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1620089559.0
    },
    {
        "author": "HJ-InvestingYT",
        "body": "Absolutely agree with your points. I do however think the capital intensive nature of the industry can be a benefit to the company as it creates a barrier to entry for potential competitors. \n\nCurrency risk for me is the biggest concern I think, though my working assumption is in the long term these currencies should stabilise as the total economy grows. \n\nAs you mentioned, the TPG and MasterCard investments were a fantastic piece of business too. Looking forward to see where this one goes long term, the numbers look like investors will be compensated heavily for the additional risk!",
        "created_utc": 1620473841,
        "id": "gxdm6nl",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620502641.0
    },
    {
        "author": "semiprotacoeater",
        "body": "I’d never invest in baba, Jack Ma is an idiot.",
        "created_utc": 1620478205,
        "id": "gxds7h5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620507005.0
    },
    {
        "author": "ExaltedNecrosis",
        "body": "Yeah, that original statement is completely wrong. Even in the US, 40% of in-person transactions are cash. In Mexico, it's 90%. It's 82% in Austria and Germany.\n\nThere is still so, so much room to grow for companies that provide credit, debit, or online payments. That's why I'm super bullish on V, MA, SQ, PYPL, MELI, etc. It doesn't matter how much of the digital payments pie each of these has when the pie itself is going to grow by huge amounts in the future. Cash is still king in most of the world, but it's trending towards digital payments each year.",
        "created_utc": 1620396591,
        "id": "gx9wxyh",
        "score": 2,
        "subreddit": "investing",
        "created": 1620425391.0
    },
    {
        "author": "Vegetable-Cold1253",
        "body": "A du ma lol",
        "created_utc": 1620425125,
        "id": "gxbofbm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620453925.0
    },
    {
        "author": "Churner_throwaway-",
        "body": "Amazon Microsoft Visa MasterCard Bank of America JPMorgan Goldman Sachs Peloton AKA my portfolio",
        "created_utc": 1620443423,
        "id": "gxcm22d",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620472223.0
    },
    {
        "author": "Low-Nefariousness912",
        "body": "Damn this dude “bonbon” lives on this shit. Get some fresh air ma du!",
        "created_utc": 1620437058,
        "id": "gxcaw09",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620465858.0
    },
    {
        "author": "puu222",
        "body": "Baba on the streets, Jack Ma in your sheets.",
        "created_utc": 1620348011,
        "id": "gx7w2xg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620376811.0
    },
    {
        "author": "NPRjunkieDC",
        "body": "Binance is Chinese. Read some posts on Reddit with horror stories . Their customer service sounds like Chinese Communist Party with Jack Ma",
        "created_utc": 1620339354,
        "id": "gx7ei6r",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620368154.0
    },
    {
        "author": "FragrantWarthog6",
        "body": "That “child” is just Jack Ma using Benjamin Button bioengineering to escape the authorities.",
        "created_utc": 1620457206,
        "id": "gxd4rhp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620486006.0
    },
    {
        "author": "xrparmy",
        "body": "Puts on jack ma",
        "created_utc": 1620382557,
        "id": "gx99qh5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620411357.0
    },
    {
        "author": "coastereight",
        "body": "I think the S&amp;P is due to touch the 50 day MA. The market will probably go lower this month but I'm hoping we see some shift back to growth and the Russell 2000.\n\nNot financial advice.",
        "created_utc": 1620329281,
        "id": "gx6qfcd",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620358081.0
    },
    {
        "author": "Plenty-Grape-1840",
        "body": "Nie ma szans",
        "created_utc": 1620319229,
        "id": "gx628fp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620348029.0
    },
    {
        "author": "Otherwise-Cash183",
        "body": "It has to be oversold for sure.\n\nSure the housing market might hit a bad streak but why dump that moneyprinter now?\n\nBesides it's always the little guy who gets rammed from behind so they would only have somewhat meager returns until shit gets back on track. Did Visa and Mastercard stop existing after 2008? Nope they made money and they still do. Rocket has solid finances even if they might fuck people on fees. This isn't Lehman brothers.",
        "created_utc": 1620305341,
        "id": "gx57bge",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620334141.0
    },
    {
        "author": "Diaper_Gravy",
        "body": "Are you saying 1000% in 2/3 years isn’t possible or are you saying its not possible for this company? Tons of companies have grown 1000% in 3 years. Check out Skyworks’ growth in its earlier years when it was around $5. What makes you know more information about the current climate of the EV semiconductor business versus a company that has been in the business for 10+ years? Maybe they have data/contracts that are disclosed, that help support their claim of a secured $2billion in deals. Or maybe they are understanding the exponential growth in the EV sector within this next 2/3 years and have been ramping up supply and projections. \n\nI hear your argument but dont find it more valid then the information presented to me from this SPAC",
        "created_utc": 1620278016,
        "id": "gx49ea3",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1620306816.0
    },
    {
        "author": "kkInkr",
        "body": "SMH, ADI, AMAT, ASML, ATEYY, AVGO, HIMX, INTT,  KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI,  PXLW, QCOM, QRVO, SIMO, SWKS, TER,\n\nbesides the usual AMD, INTC, NVDA, and TSM. Those 4 imo are outdated.  SMH is the ETF.\n\nCircuitry, CDNS, SNPS, ANSS, they are being ignored, but have dominant roles, imo.",
        "created_utc": 1619900068,
        "id": "gwkwyeo",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619928868.0
    },
    {
        "author": "toydan",
        "body": "I picked up more $SWKS Friday. Also decided to get back in $MU w 2023 @ $75 tomorrow. About only trade I plan to make other some CCs",
        "created_utc": 1620008585,
        "id": "gwqkabk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620037385.0
    },
    {
        "author": "TheBoom129",
        "body": "Guys and gal this is just something I found looking at the option chart.  if ya buy or sell, best of luck. Thought I would share it here to see whether other saw the same thing I did when looking at the option chart on Ma and Swks nothing more &amp; nothing less. I am sure as hell not telling anyone what to do.",
        "created_utc": 1619982702,
        "id": "gwp6nno",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620011502.0
    },
    {
        "author": "moolium",
        "body": "I'm risk adverse myself,  I always liked swks, but I bought intel after the drop.  They are trading cheap l, the consensus is that they're the loser of the group, I'm betting against the grain.  With the new ceo and working towards new foundries in the next decade,  I'm treating them as a growth company currently at 10x earnings.  Right now in the market that's hard to find. We'll see.",
        "created_utc": 1619995594,
        "id": "gwpwhzh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620024394.0
    },
    {
        "author": "ReaditB4Bomber",
        "body": "TF is this skyworks solutions dip, i thought it was on sale yesterday after earnings, gonna buy some later on in the day😋",
        "created_utc": 1620062772,
        "id": "gwt0qj7",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1620091572.0
    }
]