[
    {
        "author": "freakishgnar",
        "body": "Fed Presidents, members of Congress and members of the executive branch should be required to put their assets in a blind trust when they take office. People making decisions on monetary and civil policy should not be using that intel as strategy for a portfolio. You're there as a servant to the people, not for personal enrichment. This should not be and should never have been legal.\n\nCall me stodgy, but it goes against all the ethics of public service and leadership.",
        "created_utc": 1631839191,
        "id": "hd5dsax",
        "permalink": "/r/stocks/comments/ppj07q/powell_orders_ethics_review_after_fed_presidents/hd5dsax/",
        "score": 668,
        "subreddit": "stocks",
        "created": 1631867991.0
    },
    {
        "author": "tsimtsimtsim",
        "body": "Many said the exact same about GE, ExxonMobil, IBM, Cisco, AT&amp;T, HP, Intel, etc. etc. etc.\n\nApple didn't start getting big until the iPhone came out in 2007, 14 yrs ago. Is it that hard to believe anything can happen in the next 20 years?\n\nGuess what the biggest company was 20 yrs ago in 2001... GE at 405 billion market cap. Microsoft was second at 290 billion. Apple was nowhere near top 10 at 8 billion.",
        "created_utc": 1630546630,
        "id": "hb9gk5c",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9gk5c/",
        "score": 325,
        "subreddit": "stocks",
        "created": 1630575430.0
    },
    {
        "author": "tsimtsimtsim",
        "body": "People said the same about Intel and smartphones, and we all know how that went...",
        "created_utc": 1630546680,
        "id": "hb9go2g",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9go2g/",
        "score": 140,
        "subreddit": "stocks",
        "created": 1630575480.0
    },
    {
        "author": "r2002",
        "body": "I guess my question would be -- is it hard to spot the decline? For example, can we look into the history of GE, Intel, or HP and pinpoint a specific 1-3 year time frame when we can tell they are losing marketing share and not innovating enough to be a top tier company?\n\nOr is it impossible to tell when you're the frog slowly boiling.",
        "created_utc": 1630550030,
        "id": "hb9nkhi",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9nkhi/",
        "score": 91,
        "subreddit": "stocks",
        "created": 1630578830.0
    },
    {
        "author": "FinalDevice",
        "body": "INTC is my favorite long term play right now. Sure, they've made mistakes and lost market share - but one, they're still dominant. Two, they have their own fabs and the federal government is considering chip fab capacity to be a matter of national security.",
        "created_utc": 1632599254,
        "id": "he9b1bc",
        "permalink": "/r/stocks/comments/pvblkn/what_stocks_currently_at_their_52_week_lows_or/he9b1bc/",
        "score": 75,
        "subreddit": "stocks",
        "created": 1632628054.0
    },
    {
        "author": "hendrix_srv",
        "body": "INTC - pretty much nothing to lose and a lot to gain.  AMD has had the upper hand before more than once and screwed the pooch.  IMO INTC has a deep talent bench.  Would be stupid to write them off.",
        "created_utc": 1631425243,
        "id": "hcj3zhz",
        "permalink": "/r/stocks/comments/pmlktv/low_pe_ratio_tech_stocks_but_still_not_worth/hcj3zhz/",
        "score": 67,
        "subreddit": "stocks",
        "created": 1631454043.0
    },
    {
        "author": "No_Blackberry_1870",
        "body": "For example look at the all time charts for Cisco and intel. In the 2000s everyone over paid for the growth potential those companies had and despite those companies doing the best they ever had in terms of revenues today. Their stock prices have still not reached their 2000s peaks.",
        "created_utc": 1630908191,
        "id": "hbs26pl",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbs26pl/",
        "score": 55,
        "subreddit": "stocks",
        "created": 1630936991.0
    },
    {
        "author": "1234sure4321",
        "body": "INTC, MU, and a for a long shot PLUG.",
        "created_utc": 1632596504,
        "id": "he94w6r",
        "permalink": "/r/stocks/comments/pvblkn/what_stocks_currently_at_their_52_week_lows_or/he94w6r/",
        "score": 55,
        "subreddit": "stocks",
        "created": 1632625304.0
    },
    {
        "author": "d4v1d87",
        "body": "TSM, Tesla, Palantir, INTC, PayPal",
        "created_utc": 1632683877,
        "id": "hedrypn",
        "permalink": "/r/stocks/comments/pvvzsl/whats_your_top_5_stocks_to_buy_and_hold_for_the/hedrypn/",
        "score": 47,
        "subreddit": "stocks",
        "created": 1632712677.0
    },
    {
        "author": "Gerti27",
        "body": "Intel and BABA are great companies to own in my opinion. The direction that Intel is heading in with their new CPUs and GPUs looks quite promising. As for BABA, everyone and their grandma knows this company is undervalued. Once the fear about China dies down, this thing is going to go back to 300.",
        "created_utc": 1631434031,
        "id": "hcjfr1x",
        "permalink": "/r/stocks/comments/pmlktv/low_pe_ratio_tech_stocks_but_still_not_worth/hcjfr1x/",
        "score": 36,
        "subreddit": "stocks",
        "created": 1631462831.0
    },
    {
        "author": "Dry_Dog_698",
        "body": "Ok, so I have no investments in either the auto industry nor silicon.  However I looked into it and here are some reasons why the OP is an idiot.\n\nHis argument is that INTC is a good investment because of the automotive chip shortage.\n\n1). INTC doesn’t make automobile chips\n\n2). Neither do the car companies\n\n3) car computer modules are created by companies who then outsource in bulk the components.  So something like Chrysler will buy a module from Bosch who will buy the from the cheapest bidder.\n\n4) there is a chip shortage.  However the current issue is that because it’s outsourced through several rings of suppliers car manufacturers have almost no control over their supply chains and no clout over their actual producer(TSM).  So when they cancelled and then restarted their orders the auto industry set their supply chains back a few months. \n\nThe shortage is that, several months worth of production.  It might sound big for Toyota to make 1.5m fewer cars this year.  But that’s 15%.  It’s not a total shutdown.\n\n5). If this were an EV issue then companies that don’t really sell EVs, most of them (Nissan/Renault, Stellantis, Ford, Toyota, Honda, Mazda, etc) wouldn’t have been hit either, no?\n\nFinally, Ford has what?  100k LiON batteries to put in cars this year?  In their production run of 7m cars?  Ford can try and blame EVs, but the truth is their whole industry blundered bigly.  Ford just blundered worse cause they’re so bad at managing supply.\n\nYou’re arguing a secular increase in chip usage due to EVs.  Hey genius, there’s a secular increase in chips due to everything.   It’s why TSM is putting $100b into capex this year.",
        "created_utc": 1631416792,
        "id": "hcip0nb",
        "permalink": "/r/wallstreetbets/comments/pmjvob/chip_stocks_with_foundries_about_to_be_worth/hcip0nb/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1631445592.0
    },
    {
        "author": "doducduy96",
        "body": "I buy VOO every month with 40% of my income. Whenever I feel anxious about my position, I take a deep breath, a day off and go for a walk/drive around town. When I walkout of the door, a AMZN package I ordered 18 hours ago had already been here, neat. Then I take out my AAPL phone and go to GOOGL to look for a place to eat/chill, just got my PFE vaccine last month so I’m good to go. Hoping into my trust worthy F F150 and starting to drive, I notice that hmmm I have been seeing a lot of TSLA cars around, maybe it’ll be my next car? I’m daydreaming. The drive is 5 miles, I wonder why the HDs, COSTs, WMTs, TGTs parking are always packed like that, even tho it’s only Wednesday, \nHmmm guess I’ll skip groceries today. I feel lazy. Sitting at the restaurant’s outdoor patio, I enjoy my brunch with a glass of wine, my eyes start wandering around. What a beautiful day, the birds, the air, the people. Maybe it’s enough wine for the day, I go in to grab a soft drink. 8 out of 10 drinks on the fountain machine are KO products. Lots people around me are working on their AAPL and MSFT laptops. They are so thin yet very powerful. As a tech geek I know they are powered by INTC and AMD CPUs, and the heavy stuffs are done with NVIDIA GPUs. Gosh people are so productive nowadays! It’s time to leave, I lay my JPM V card to the tray, 5x points for dining baby! 5 mins later I’m on my way. Shit, I’m almost out of gas, pulling into a CVX gas station, tap my BAC MA card because I’ll get 3% cash back on Gas. Damn there’s a line wrapping around that MCD and SBUX drive thru, the food is unhealthy but well business is still booming I guess. \nGetting back into my home, I suddenly remember tomorrow is Oct 1st. I have T, VZ, NFLX bills to pay. \nDamn, I observed a lot from my lazy day today. I wonder what my life would be without all of the conveniences I saw today. \nI log into my Fidelity account and buy 4 more VOO shares. \nFeeling good.",
        "created_utc": 1633029707,
        "id": "hevxkhv",
        "permalink": "/r/stocks/comments/pyfu9h/remember_what_investing_is_all_about/hevxkhv/",
        "score": 35,
        "subreddit": "stocks",
        "created": 1633058507.0
    },
    {
        "author": "crepeblanket",
        "body": "What was the news about Intel delaying their govt deliveries so they bought some AMD and NVIDIA chips while waiting for Intel to come through? Intel being the defacto govt chip supplier doesn’t sound like an absolutely sure thing long term",
        "created_utc": 1630765009,
        "id": "hbkk4ay",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbkk4ay/",
        "score": 34,
        "subreddit": "investing",
        "created": 1630793809.0
    },
    {
        "author": "No_Blackberry_1870",
        "body": "That’s irrelevant to my example of over paying for growth. 21 years ago those companies were the Nvidia and amd of their times. Also intel literally makes double what amd and nvidia make combined lol.",
        "created_utc": 1630909644,
        "id": "hbs48wh",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbs48wh/",
        "score": 31,
        "subreddit": "stocks",
        "created": 1630938444.0
    },
    {
        "author": "Romeo_Zero",
        "body": "The M1 MacBook Air is just an insane price/performance bargain. I don’t care that you can get an asus gaming bro laptop with a 1tb HDD, 16gb ram, 144hz screen, i7 etc for the same price, I’ll take that M1 every time. Solid build, excellent keyboard, insane battery, and the M1 first gen runs circles around most processors.\n\nApple is going to be absolutely scary with the MX chips in a few years, nothing from Intel or AMD will be able to touch it\n\nThis coming from a Windows guy. The best thing Apple did the last 5 years is make their own soc and ditch Intel",
        "created_utc": 1631663757,
        "id": "hcvy7px",
        "permalink": "/r/wallstreetbets/comments/po8ev0/aapl_trying_to_stop_the_bleeding_unloading_all/hcvy7px/",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1631692557.0
    },
    {
        "author": "Laakhesis",
        "body": "Long $INTC",
        "created_utc": 1632656375,
        "id": "hec30zo",
        "permalink": "/r/ValueInvesting/comments/pvqbjp/the_most_undervalued_stocks_currently_selling_at/hec30zo/",
        "score": 31,
        "subreddit": "ValueInvesting",
        "created": 1632685175.0
    },
    {
        "author": "nigirizushi",
        "body": "That's because Intel mobile chips were always power hungry. They couldn't get a day standby time or whatever horrible battery life it was. \n\nTesla wouldn't make their own chip, at least at first, but would just license ARM.",
        "created_utc": 1630559000,
        "id": "hba3udc",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hba3udc/",
        "score": 30,
        "subreddit": "stocks",
        "created": 1630587800.0
    },
    {
        "author": "jubothecat",
        "body": "Intel said it was going to build the world's fastest super computer like 10 years ago. Now, they were supposed to deliver it years ago, and they still don't have the technology to make what they said they would. Even if released today it would now only be like the 3rd fastest because they waited too long.\nTldr: even if Intel has these new government contracts, they are so far behind that they have a lot longer of a journey to be the best chip maker than people think (most laymen don't even know AMD is better right now).",
        "created_utc": 1630765482,
        "id": "hbkl4bs",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbkl4bs/",
        "score": 28,
        "subreddit": "investing",
        "created": 1630794282.0
    },
    {
        "author": "TheCenturion27",
        "body": "I would not put 10k and gamble it on penny stocks. I’d rather put it on things like Apple, Intel, Microsoft, Pepsi, KO, Amazon etc etc. \n\nI’m mentally challenged so don’t take my word for it.",
        "created_utc": 1631588624,
        "id": "hcrxc9n",
        "permalink": "/r/pennystocks/comments/pntjao/i_have_10k_to_put_in_where_should_i_put_it/hcrxc9n/",
        "score": 28,
        "subreddit": "pennystocks",
        "created": 1631617424.0
    },
    {
        "author": "Stoli1387",
        "body": "Intel from a value perspective, trulieve from a growth/speculative perspective... although I own positions in both they aren't on my watchlist",
        "created_utc": 1631547140,
        "id": "hcp9ck2",
        "permalink": "/r/stocks/comments/pnhmqa/what_are_the_most_out_of_favor_stocks_on_your/hcp9ck2/",
        "score": 28,
        "subreddit": "stocks",
        "created": 1631575940.0
    },
    {
        "author": "PaulP97",
        "body": "Intel isn’t even on here? They’re building factories in the US to start supplying chips, lol.",
        "created_utc": 1631445977,
        "id": "hcjulbt",
        "permalink": "/r/stocks/comments/pmqf6z/which_semiconductors_company_has_best_long_term/hcjulbt/",
        "score": 27,
        "subreddit": "stocks",
        "created": 1631474777.0
    },
    {
        "author": "Investing8675309",
        "body": "Man seriously value investing sub, are we really picking Intel as our top pick for the next decade? \n\nThis is one of two industries I have domain expertise in and there is no way I would touch this with a ten foot pole. Fully aware it looks really super duper on the screeners.",
        "created_utc": 1632674042,
        "id": "hed3fld",
        "permalink": "/r/ValueInvesting/comments/pvqbjp/the_most_undervalued_stocks_currently_selling_at/hed3fld/",
        "score": 26,
        "subreddit": "ValueInvesting",
        "created": 1632702842.0
    },
    {
        "author": "raknor1981",
        "body": "just buy Intel that stock never moves",
        "created_utc": 1632794956,
        "id": "hejo6z0",
        "permalink": "/r/wallstreetbets/comments/pwvrsi/the_great_market_wheeze_is_almost_upon_us/hejo6z0/",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1632823756.0
    },
    {
        "author": "ArtfulLying",
        "body": "Ah yes, the people with the united States governments Intel at their fingertips don't know how the world works but random redditor #8 does and is calling them out. Classic.",
        "created_utc": 1631310346,
        "id": "hcd43tx",
        "permalink": "/r/stocks/comments/plrvw1/democrats_propose_2_tax_on_stock_buybacks_to/hcd43tx/",
        "score": 23,
        "subreddit": "stocks",
        "created": 1631339146.0
    },
    {
        "author": "tdreampo",
        "body": "So as a person that’s been an investor for decades AND I have worked in the tech industry for decades, I personally have sold all my Intel stock. I held Intel for about fifteen years but I’m now very convinced that their glory days are behind them. They certainly will be a billion dollar company for decades to come but they are just far too behind the next big race. Here is why. \n\nThe actual architecture and nature of the cpu race has changed. For years it was all about raw performance, we saw this with x86 architecture (which is intels bread and butter) we have seen this for 30 years, higher clock speeds, more cores. But two major shifts happened in the industry that Intel just isn’t prepared for. One is the rise of mobile devices led by the iPhone with android soon to follow. Power consumption became the driving metric for better battery life. Most mobile phones use a cpu architecture called“ARM” vs Intels x86 architecture that powers most windows devices. ARM CPU’s use considerably less power then their x86 counterparts and now that the worlds primary computer is their phone, arm has considerable market share. The next thing that happened was ARM CPU’s became incredibly powerful and could rival (and sometimes just destroy) X86 CPU’s in performance while consuming less power. The industry term now is “performance per watt” This is why Apple is switching out their entire product line to ARM even on Mac’s which over the last decade or so ran Intel CPU’s. \n\nAnother tech shift is cloud computing with the rise of AWS, Azure and Google cloud. Electric costs are out of control for big data centers so these guys are turning to ARM CPU’s for server side work as well. This is a MASSIVE shift in the industry that no one knows about except people that work in the industry. So Intel is being directly assaulted on both the server side and the mobile side in a war that they were WAY late to the party on. I don’t see them recovering easily from this shift. \n\nNow of course none of this happens over night and it will probably take a decade but their hay-days are behind them. Then you look at what AMD is doing and they are actually making decent products after all these years. So even on Intels home turf they have a fierce competitor. Hope that helps.",
        "created_utc": 1631276443,
        "id": "hcaxj2d",
        "permalink": "/r/StockMarket/comments/pldsgf/semiconductorchip_industry_where_do_you_see_the/hcaxj2d/",
        "score": 23,
        "subreddit": "StockMarket",
        "created": 1631305243.0
    },
    {
        "author": "SomewhatAmbiguous",
        "body": "Amazing to see a post optimistic about Intel's margins the week it was reported they are slashing prices on their highest margin sector (data center).\n\nIntel faces declining market share in its biggest markets for the foreseeable future.\n\nTo regain competitiveness Intel needs to invest massively and pull off its highly ambitious roadmap: 3 node shrinks in the next 3 years, something they haven't managed in the last 10. That is to say they need to execute perfectly after having failed to do so for the past decade.\n\nIntel's price reflects the huge challenge ahead of it.",
        "created_utc": 1631658468,
        "id": "hcvmt83",
        "permalink": "/r/ValueInvesting/comments/pocebj/intc_is_the_best_value_stock_in_todays_market/hcvmt83/",
        "score": 23,
        "subreddit": "ValueInvesting",
        "created": 1631687268.0
    },
    {
        "author": "Yupperroo",
        "body": "I really think that the conclusion and much of the comparative analysis with Intel misses the mark. Who cares about water usage? I get it, people like companies to be green but what IS THE POINT is that the chips they are making ARE GREEN that is the chips use less power and are more powerful. Intel missed a critical development and is very far behind TSM. While Intel does have new chips in its pipeline they aren't about to catch up to TSM any time soon and Intel has a lot of execution risk in its plan to once again be the flagship company it once was.",
        "created_utc": 1632148432,
        "id": "hdlfgvm",
        "permalink": "/r/investing/comments/prv5hi/dd_taiwan_semiconductor_manufacturing_tsm/hdlfgvm/",
        "score": 22,
        "subreddit": "investing",
        "created": 1632177232.0
    },
    {
        "author": "omen_tenebris",
        "body": "It'd be stupid to write Intel off, but they bled talent for a long time, with idiotic internal policies, behind on fab technology so decided to rename 10nm to Intel 7.\nNot to mention a lot of anti consumer policies.\nWith that said we'll see if there little-big architecture can achieve what they want. It's not unlikely that it'll be a colossal failure or a home run, but the realistic thing is that it'll be mediocre.\n\nFurthermore Intel core architecture at this point is a patchwork mess of random idiotic instructions with little to no uses.\n\nX86 as a whole is loosing ground to risk. At this point arguably Apple will the biggest competitor as their chips are absolutely fucking insane. Competitive performance with almost no power draw ( and heat).\n\nNext 10 years are gonna be fun as I'm a computer enthusiast",
        "created_utc": 1631447283,
        "id": "hcjwev9",
        "permalink": "/r/stocks/comments/pmlktv/low_pe_ratio_tech_stocks_but_still_not_worth/hcjwev9/",
        "score": 22,
        "subreddit": "stocks",
        "created": 1631476083.0
    },
    {
        "author": "neogeomasta",
        "body": "Your analogy is slightly flawed. Intel is the like the runner who blew everyone else away at the start and has now stumbled repeatedly and everyone else is starting to catch up.  They are still ahead, way ahead. I don’t mean with innovation etc as everyone likes to say they are way behind on that and that’s likely true. \n\nBut revenue last few years of 70 Billion 71 Billion 77 billion for Intel and 6 Billion 6 Billion 9 Billion for AMD. \n\nIntel is waaaaay ahead even with their falls, and have a ton of money to throw at getting their tech back to the best.",
        "created_utc": 1631561112,
        "id": "hcq7enf",
        "permalink": "/r/stocks/comments/pnhmqa/what_are_the_most_out_of_favor_stocks_on_your/hcq7enf/",
        "score": 22,
        "subreddit": "stocks",
        "created": 1631589912.0
    },
    {
        "author": "Suminod",
        "body": "most tech servers are still on Intel and the fabs for the US market are here in the US, Arizona and Oregon",
        "created_utc": 1632161797,
        "id": "hdmbx62",
        "permalink": "/r/investing/comments/prw7it/chinas_growing_property_crisis_a_look_onto_a_few/hdmbx62/",
        "score": 22,
        "subreddit": "investing",
        "created": 1632190597.0
    },
    {
        "author": "Paul_Ostert",
        "body": "Ibm, xerox, Motorola, Intel, GM, Dell, HP, GE, Oracle, Sears",
        "created_utc": 1632792963,
        "id": "hejjvg3",
        "permalink": "/r/StockMarket/comments/pwv8xl/the_10_biggest_stocks_in_the_sp_500_every_5_years/hejjvg3/",
        "score": 22,
        "subreddit": "StockMarket",
        "created": 1632821763.0
    },
    {
        "author": "nonobeast18",
        "body": "Agree. They have a ton of cash, little debt, their new ceo has be engineering background. I have high hopes for intel.",
        "created_utc": 1632599781,
        "id": "he9c8g9",
        "permalink": "/r/stocks/comments/pvblkn/what_stocks_currently_at_their_52_week_lows_or/he9c8g9/",
        "score": 21,
        "subreddit": "stocks",
        "created": 1632628581.0
    },
    {
        "author": "IndividualForward177",
        "body": "All fabs are running at 100%. All they can do short term to increase profits is raise prices which TSMC and Samsung just did. TSMC is building new fabs, Intel is building, GlobalFoundries is building, Samsung just announced increase in capital spending and they will profit from it in 2-3 years as this is on average how long it takes to finish a new fab. Right now the equipment makers will be the big winners on chip shortage. AMAT and LRCX are particularly undervalued. They sold off recently along with MU because they also supply DRAM equipment and there is suspicion in the industry DRAM cycle peaked. But their DRAM manufacturing equipment is less than 10% of portfolio. Moreover, new generation of DRAM goes 3D stacks which need new manufacturing equipment. So the whole industry will 🚀",
        "created_utc": 1630685684,
        "id": "hbgnmlu",
        "permalink": "/r/wallstreetbets/comments/ph7zba/looking_for_chip_shortage_buys_here_are_the/hbgnmlu/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1630714484.0
    },
    {
        "author": "EPMD_",
        "body": "There are lots of exceptions. Amazon and Walmart have been kind of duds this year as high P/E stocks, while GM and Goldman Sachs have been low P/E All-Stars.\n\nStock | Price increase past year | P/E ratio\n:--|--:|--:\nAmazon | +2.8% | 60.4\nGoldman Sachs | +99.7% | 7.6\nWalmart | +2.8% | 41.9\nGM | +66.0% | 5.7\n\nP/E cannot be relied upon in isolation to pick good/bad buys. GM is a good example of the complication of P/E. Almost all of GM's business is internal combustion engine cars, so its P/E is using its legacy business as a base in the calculation, but all of the optimism around GM is about everything else they are doing besides internal combustion engine cars. GM itself thinks their legacy business will disappear in 10-15 years, so its P/E is nonsensical when looking forward. Their \"true\" future P/E is going to be based on earnings from non-internal combustion engine cars, and those earnings are essentially zero right now. In other words, their true forward looking P/E is much higher than 5.7. They are a future high P/E stock disguised as a current low P/E stock, but the future high P/E is going to be driven by earnings declines.\n\nIn terms of finding value, there is usually a story why a company's P/E is low. You have to find the story and see if you are okay with it. Maybe it's something like Intel where consumer sentiment is so negative due to their rivals' recent tech advantages, but the deeper you look, the more you see competitive advantages that Intel will be able to maintain and leverage going forward to build its stock price back up. Or maybe it's a low P/E like Altria because no one wants to own tobacco stocks.",
        "created_utc": 1630629887,
        "id": "hbdycab",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbdycab/",
        "score": 21,
        "subreddit": "ValueInvesting",
        "created": 1630658687.0
    },
    {
        "author": "Real_Comfortable3467",
        "body": "I made $8.70 last month. Unfortunately I don't have a Twitter to share my intel.",
        "created_utc": 1631371681,
        "id": "hcfut5b",
        "permalink": "/r/pennystocks/comments/pm786b/870k_gains_for_august/hcfut5b/",
        "score": 21,
        "subreddit": "pennystocks",
        "created": 1631400481.0
    },
    {
        "author": "tsimtsimtsim",
        "body": "Intel has made and broken many promises before.",
        "created_utc": 1631425667,
        "id": "hcj4ll2",
        "permalink": "/r/stocks/comments/pmlktv/low_pe_ratio_tech_stocks_but_still_not_worth/hcj4ll2/",
        "score": 19,
        "subreddit": "stocks",
        "created": 1631454467.0
    },
    {
        "author": "kehmuhkl",
        "body": "Intel is currently investing billions to ramp up production in the US.",
        "created_utc": 1632338426,
        "id": "hdvqat2",
        "permalink": "/r/stocks/comments/pt959x/which_semiconductor_stock_would_you_recommend/hdvqat2/",
        "score": 18,
        "subreddit": "stocks",
        "created": 1632367226.0
    },
    {
        "author": "Bamstradamus",
        "body": "DDR5 news might provide a pop, but they would still have to sell the memory.  I have said it over and over on CRSR posts, this chip shortage is not ending any time soon, the vast majority of people are still waiting on GPU's to upgrade anything, especially since at higher resolutions the bottleneck moves from the CPU to the GPU, you can run 4k60 on a first gen Ryzen as long as you have a GPU capable of outputting the frames.\n\nAdd to that historically the first set of chips on a new DDR is typically slower then the previous gens top tier, the fact all RAM is essentially the same since their are only 3 major manufacturers and everyone just repackages those chips, GSkill probably outbidding everyone else for \"the good chip\" at the start again *seriously did any of you even build a Ryzen system, Corsair had like 4 compatible sku's for the entire 300 series chipsets life, Gskill got all the B-die*\nand the fact we don't have any real world specs to work with yet I don't know anyone chomping at the bit for the DDR5 release.\n\nI can see the news drop leading to a pop, I do not see DDR5 sales making an actual contribution to value until the NEXT set of chipsets come from AMD/Intel.",
        "created_utc": 1631207033,
        "id": "hc7a6r0",
        "permalink": "/r/wallstreetbets/comments/pl07i6/crsr_ddr5_should_be_coming_very_soon/hc7a6r0/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1631235833.0
    },
    {
        "author": "Velaryon1007",
        "body": "INTC is at a point where it can skyrocket if their fab investments go as planned in a couple of years, but it's a future play with a lot of investments, bureaucracy and governments involved. \n\nEven if their GPU sales beat all estimates, that will at most compensate the revenue lost due to AMD's resurgence in the CPU and server sides.",
        "created_utc": 1631439755,
        "id": "hcjmphq",
        "permalink": "/r/stocks/comments/pmlktv/low_pe_ratio_tech_stocks_but_still_not_worth/hcjmphq/",
        "score": 17,
        "subreddit": "stocks",
        "created": 1631468555.0
    },
    {
        "author": "The_Antonin_Scalia",
        "body": "I work in the chip industry, and while I can't comment too much on Intel's cash flows, etc. I can give a bit of a bear case on them from a technical standpoint:\n\n1. Converting Intel's fabs into a foundry business will be incredibly hard. From a technical standpoint, fabbing your own chips is extremely different from being a contract foundry. Intel, in particular, is known for doing a lot of manual layout/hacks to squeeze performance out of their process nodes, and this will be difficult (if not impossible) to replicate for foundry clients.\n2. Intel isn't really an attractive place to work anymore. Most of the best people I know aren't going to Intel, they're going elsewhere: Apple, Nvidia, etc.\n3. Intel has absolutely no chance in competing with TSMC on advanced nodes and realistically is out of this race for a long time. They're late to EUV, and TSMC's head start is pretty insurmountable.\n\n\nThis isn't to say that Intel won't be profitable over the next years, but I think it's important to keep some perspective. This is an investment where you're hoping that the company decline slower than the market is currently pricing.",
        "created_utc": 1631674489,
        "id": "hcwlbxf",
        "permalink": "/r/ValueInvesting/comments/pocebj/intc_is_the_best_value_stock_in_todays_market/hcwlbxf/",
        "score": 17,
        "subreddit": "ValueInvesting",
        "created": 1631703289.0
    },
    {
        "author": "Kurso",
        "body": "**Intel Annual Revenue**  \n\n2020\t$77,867. \n\n2019\t$71,965. \n\n2018\t$70,848. \n\n2017\t$62,761. \n\n2016\t$59,387. \n\n2015\t$55,355. \n\n2014\t$55,870. \n\n2013\t$52,708. \n\n2012\t$53,341. \n\n2011\t$53,999. \n\n2010\t$43,623. \n\n2009\t$35,127. \n\n2008\t$37,586.",
        "created_utc": 1631460318,
        "id": "hcklsjl",
        "permalink": "/r/stocks/comments/pmqf6z/which_semiconductors_company_has_best_long_term/hcklsjl/",
        "score": 17,
        "subreddit": "stocks",
        "created": 1631489118.0
    },
    {
        "author": "ThrobbinHood42069",
        "body": "I’m balls deep in INTC. Undervalued for sure based on market sentiment. Invest in nvda and amd too.  No reason to only play one side of the semis.",
        "created_utc": 1631992170,
        "id": "hdd6hm7",
        "permalink": "/r/wallstreetbets/comments/pqs7r7/intels_fab_investments_as_a_percentage_of/hdd6hm7/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1632020970.0
    },
    {
        "author": "x_ScubaSteve_x",
        "body": "$KLIC\n\nWe are in a massive semiconductor shortage that’s impacting nearly every industry. Companies like Intel, Samsung, TSMC are investing billions to build new factories and increase capacities. KLIC is a company that manufactures equipment used to manufacture semiconductors. They also sell their services to service, maintain, and repair their equipment.\n\nMy cost basis is about $45 right now. I’m not sure what my price target is, but I didn’t even think about selling it when it hit $75 a few days ago. I think it’s going to take years for the full semiconductor market to catch up to demand as it is only going to continue to increase globally.\n\n$KLIC has a P/E of 17x in an industry with competitors sitting as high as 58x. Industry median is 27.9x. They have a profit margin of 20.60%, higher than any competitor in the segment. They have revenue growth of 106% TTM. Also, all 3 analyst ratings offered in TDA list it as a strong buy, so you know this shit is solid. \n\nI have no idea if any of the things I said line up in any way, shape, or form. I didn’t research who these guys supply to. I just figured it didn’t matter. Global shortage. Cheap. How can it possibly go tits up?",
        "created_utc": 1632024443,
        "id": "hdf8ud1",
        "permalink": "/r/wallstreetbets/comments/pqs7co/what_is_your_single_highest_conviction_idea_right/hdf8ud1/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1632053243.0
    },
    {
        "author": "Not_FinancialAdvice",
        "body": "&gt; That's because Intel mobile chips were always power hungry. They couldn't get a day standby time or whatever horrible battery life it was. \n\nThe Intel PXA270 XScale processor (which was an ARM implementation) in my old Palm Treo 650 gave me 2-3 days of battery life. They sold the XScale IP to Marvell later on.",
        "created_utc": 1630560235,
        "id": "hba5qyf",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hba5qyf/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1630589035.0
    },
    {
        "author": "datingadviceThrow789",
        "body": "MSFT AAPL CSCO GOOGL FB INTC\n\nWSB is fun, but why not allocate a portion of your portfolio to FCF generating Titans",
        "created_utc": 1631891054,
        "id": "hd7qyvw",
        "permalink": "/r/wallstreetbets/comments/pq1url/about_time_to_cash_out_and_start_over/hd7qyvw/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1631919854.0
    },
    {
        "author": "ra__account",
        "body": "See the recent discussion that we're still paying baggage fees that were markets as temporary after 9/11. If there's limited enough suppliers (like the AMD/Intel/NVidia trio), they can keep prices up without crossing the line of overtly colluding. Creating and manufacturing a powerful CPU is very costly and the only edge players like Apple have no interest in driving prices down.",
        "created_utc": 1630777573,
        "id": "hblc3s2",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hblc3s2/",
        "score": 15,
        "subreddit": "investing",
        "created": 1630806373.0
    },
    {
        "author": "Dry_Dog_698",
        "body": "Sure sport.  \n\nTo take advantage of your 40% get in touch with me when INTC starts creating window lift motors and the lightbulbs that flash when you forget to change your oil.",
        "created_utc": 1631418306,
        "id": "hcis2u4",
        "permalink": "/r/wallstreetbets/comments/pmjvob/chip_stocks_with_foundries_about_to_be_worth/hcis2u4/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1631447106.0
    },
    {
        "author": "iopq",
        "body": "My favorite one is $AMD and $INTC\n\nI'm not long Intel, but have a good amount of shares in AMD. I think it has a better future with TSMC nodes far ahead of Intel\n\n$AMD and $NVDA is another one, but I would choose the $NVDA side in this one",
        "created_utc": 1631751313,
        "id": "hd0o75j",
        "permalink": "/r/investing/comments/pp0jnw/what_are_some_of_your_favorite_duopolies/hd0o75j/",
        "score": 15,
        "subreddit": "investing",
        "created": 1631780113.0
    },
    {
        "author": "helio987",
        "body": "ok...you go to be around my age then.  that's why I get nervous with some of this shit now.  too many companies are way overvalued.  the only 2 of mine that survived were msft and intel and I only did well because I bought a lot more when msft went to $20. I bought etrade back then thinking that's the future and it was the first big online trading site and they went down as well.  They are still around but a division of morgan stanly I think.",
        "created_utc": 1631401065,
        "id": "hchroos",
        "permalink": "/r/wallstreetbets/comments/pmcivi/remember_the_internet_bubble_heres_me_selling/hchroos/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1631429865.0
    },
    {
        "author": "Zeracho",
        "body": "Apparantly the early Intel relayed was understated (\"there's been a small plane in NYC that hit a building\"), there's an article out from yesterday about some of the experiences of the photographers that took now-iconic photos those days.\n\nBook thing was apparantly edited (not saying W was our most intellectual pres but comon...)",
        "created_utc": 1631373731,
        "id": "hcfzi4q",
        "permalink": "/r/wallstreetbets/comments/pm8877/when_the_end_is_near_and_bulls_are_truly_fuked/hcfzi4q/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1631402531.0
    },
    {
        "author": "skilliard7",
        "body": "Nvidia is a great company, but extremely overvalued at the moment.  Their price to earnings ratio is 80 during a cyclical peak. When the GPU shortage subsides from Intel entering the industry and mining demand falling when Eth3reum goes proof of stake, their earnings will stagnate and their price will fall substantially.",
        "created_utc": 1631200108,
        "id": "hc6tl2d",
        "permalink": "/r/stocks/comments/pkvonq/what_is_your_biggest_holding_for_the_long_term/hc6tl2d/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1631228908.0
    },
    {
        "author": "WVUMD",
        "body": "M1 chip was faster single core than anything Intel or AMD made at the time, and doesn't require a fan. That is bonkers. M1 macbook air at 899 pricepoint was the best value laptop I've ever used.\n\nThe reason their value took a shit was because of the 3 billion they'll lose from the Apple Store. The net margin on that money is probably 90%. Their margin on everything else is not even close. They're not worth as much without that revenue. It has nothing to do with \"not innovating",
        "created_utc": 1632795235,
        "id": "hejosa2",
        "permalink": "/r/wallstreetbets/comments/pwvuyt/wtf_is_going_on_with_aapl/hejosa2/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1632824035.0
    },
    {
        "author": "Dry_Dog_698",
        "body": "You gotta consider that when someone is lying about something as obvious as this(40% of a car’s cost is not in its silicon) what else are they lying about?\n\nINTC is a value trap through and through.\n\nCrap post from a crap poster.",
        "created_utc": 1631414428,
        "id": "hcik1u7",
        "permalink": "/r/wallstreetbets/comments/pmjvob/chip_stocks_with_foundries_about_to_be_worth/hcik1u7/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1631443228.0
    },
    {
        "author": "StockNCryptoGodfathr",
        "body": "INTC been money in the bank. Last few years you can buy it at $45 multiple times and sell it around $60. Love the company but running the Wheel on it has been extremely profitable verses buy and hold.",
        "created_utc": 1632603436,
        "id": "he9kfn6",
        "permalink": "/r/stocks/comments/pvblkn/what_stocks_currently_at_their_52_week_lows_or/he9kfn6/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1632632236.0
    },
    {
        "author": "HesitantInvestor0",
        "body": "Woah, that's a crazy list. You may turn on to be right, but you've got two Chinese companies amid a period where China is regulating like crazy, basically demanding bribes from companies, and is going to be tough on companies that deal in consumer data.\n\nThen you've got Intel which needs to do some serious innovating if they're going to compete with AMD and Nvidia. I understand their businesses are not exactly the same but I'm assuming they'll move toward that.\n\nAnd finally Foot Locker, an objectively terrible performing stock, very volatile throughout its entire existence, and a store that absolutely sucks.\n\nI'll be very impressed if this goes well for you! Not hating, just observing. To be honest, I've had a bad year in stocks so clearly I'm no one to listen to hahah",
        "created_utc": 1632705881,
        "id": "hef55lj",
        "permalink": "/r/CanadianInvestor/comments/pw0ufe/what_stocks_are_you_considering_as_we_move_into/hef55lj/",
        "score": 13,
        "subreddit": "CanadianInvestor",
        "created": 1632734681.0
    },
    {
        "author": "Bobbybushay2k18",
        "body": "Ooo intel is a good one. Super long hold required obviously, not sure when/if I enter a position",
        "created_utc": 1631550457,
        "id": "hcphdom",
        "permalink": "/r/stocks/comments/pnhmqa/what_are_the_most_out_of_favor_stocks_on_your/hcphdom/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1631579257.0
    },
    {
        "author": "ImTheMonk",
        "body": "&gt; AMD is currently trading at $105 and NVDA at $220. meanwhile INTC is trading at $54\n\nLMFAO. Ban this moron, please",
        "created_utc": 1632521983,
        "id": "he5b3c9",
        "permalink": "/r/wallstreetbets/comments/purthk/why_i_am_bullish_on_intc/he5b3c9/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1632550783.0
    },
    {
        "author": "Pristine-Card9751",
        "body": "Based on the latest 13F, Intel is Baupost’s largest investment. What does Seth Klarman knows that the rest doesn’t? Has he insured his position?",
        "created_utc": 1631674758,
        "id": "hcwlv6w",
        "permalink": "/r/ValueInvesting/comments/pocebj/intc_is_the_best_value_stock_in_todays_market/hcwlv6w/",
        "score": 12,
        "subreddit": "ValueInvesting",
        "created": 1631703558.0
    },
    {
        "author": "Investing8675309",
        "body": "Worked at Intel in manufacturing, this is spot on. \n\nPeople who don’t work in the industry don’t understand how insurmountable TSM’s lead is and the incredible flywheel they have. It is one of the most dominant moats of any business. \n\nPeople on here are posting about Intel catching up. This isn’t like making a cool new smartphone and catching up with a competitor in a year. We could drop ASML’s latest EUV tools and a new giant fab on Intel’s doorstep and it would still take them years to hit acceptable yields, this is the most complex manufacturing process on the planet and is just as much art with the recipes as it is science.",
        "created_utc": 1631684221,
        "id": "hcx29eg",
        "permalink": "/r/ValueInvesting/comments/pocebj/intc_is_the_best_value_stock_in_todays_market/hcx29eg/",
        "score": 12,
        "subreddit": "ValueInvesting",
        "created": 1631713021.0
    },
    {
        "author": "Look_here_Listen_",
        "body": "Well in their current state I wouldn’t say they are undervalued. They are going to have declining revenues and earnings for the foreseeable future. No reason to pay a premium on that. \n\nIf you believe in the blue sky scenario, then yeah they are incredibly undervalued. I just don’t see them delivering on their roadmap without hiccups; they never get things out on time. \n\nThey will continue to lose market share across all their CPU lines for the next 2-3 years minimum. AMD is just now eating away at their server market share which will be pretty disastrous for intel since they have great margins.\n\nI think intel is an interesting turnaround play, but there still is downside risk.",
        "created_utc": 1631454342,
        "id": "hck8nem",
        "permalink": "/r/stocks/comments/pmqf6z/which_semiconductors_company_has_best_long_term/hck8nem/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1631483142.0
    },
    {
        "author": "rebelo55",
        "body": "INTC need to up their game and grab market share back.",
        "created_utc": 1631414225,
        "id": "hcijm9g",
        "permalink": "/r/wallstreetbets/comments/pmjvob/chip_stocks_with_foundries_about_to_be_worth/hcijm9g/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1631443025.0
    },
    {
        "author": "senecadocet1123",
        "body": "Baba, Tencent and Intel make up for 50% of my portfolio",
        "created_utc": 1631192236,
        "id": "hc6csed",
        "permalink": "/r/stocks/comments/pkvonq/what_is_your_biggest_holding_for_the_long_term/hc6csed/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1631221036.0
    },
    {
        "author": "sunstersun",
        "body": "I like JD and Qualcomm.\n\nIntel is because there's a very good chance their strategy fails and are left with nothing.",
        "created_utc": 1632785062,
        "id": "hej2yyo",
        "permalink": "/r/investing/comments/pwp2ro/some_thoughts_moving_forward_into_202122/hej2yyo/",
        "score": 11,
        "subreddit": "investing",
        "created": 1632813862.0
    },
    {
        "author": "eomar2828",
        "body": "i am still buying MSFT and INTC. I really like NVDA the company, but not NVDA the price. I own AAPL but am iffy on the price.",
        "created_utc": 1630864053,
        "id": "hbplpel",
        "permalink": "/r/ValueInvesting/comments/pif8jm/my_top_tech_stocks_to_watch_that_pays_dividends/hbplpel/",
        "score": 11,
        "subreddit": "ValueInvesting",
        "created": 1630892853.0
    },
    {
        "author": "Myleftarm",
        "body": "How is Intel a failed company?",
        "created_utc": 1630895325,
        "id": "hbrg0c3",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrg0c3/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1630924125.0
    },
    {
        "author": "luckyone1992",
        "body": "The debate between AMD and Intel is particularly strong online",
        "created_utc": 1631247971,
        "id": "hc9ve5o",
        "permalink": "/r/StockMarket/comments/pldsgf/semiconductorchip_industry_where_do_you_see_the/hc9ve5o/",
        "score": 11,
        "subreddit": "StockMarket",
        "created": 1631276771.0
    },
    {
        "author": "Rand_alThor__",
        "body": "If you brought INTC today, and somehow travelled 21 years back in time to Sept 2000, you could sell at a 27% profit.",
        "created_utc": 1631191786,
        "id": "hc6byki",
        "permalink": "/r/stocks/comments/pkufdf/rstocks_daily_discussion_options_trading_thursday/hc6byki/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1631220586.0
    },
    {
        "author": "SnipahShot",
        "body": "Pfizer and Intel are mine.",
        "created_utc": 1631561859,
        "id": "hcq98ub",
        "permalink": "/r/stocks/comments/pnhmqa/what_are_the_most_out_of_favor_stocks_on_your/hcq98ub/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1631590659.0
    },
    {
        "author": "Cookecrisp",
        "body": "It's the most pervasive biggest lie. I traded believing it's true and lost tons thinking the market price was better intel than my DD on some beaten down stocks.",
        "created_utc": 1632779840,
        "id": "heis2nf",
        "permalink": "/r/wallstreetbets/comments/pwi174/i_accidentally_purchased_the_wrong_stock_now_im_up/heis2nf/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1632808640.0
    },
    {
        "author": "nwdogr",
        "body": "I know Intel has issues but I find it interesting that it has several times the revenue and operating income of NVDA but less than half the market cap. NVDA's got a *lot* of success priced in.",
        "created_utc": 1631193331,
        "id": "hc6etqm",
        "permalink": "/r/stocks/comments/pkufdf/rstocks_daily_discussion_options_trading_thursday/hc6etqm/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1631222131.0
    },
    {
        "author": "yeppersbruh",
        "body": "There's one guy on Intel's Yahoo Finance comment section who's constantly calling Intel a sinking ship, immediately saying that \"AMD deep green while sinking ship Intel is deep red\" (If that's actually the case, he's pretty damn silent if that's not the case though). He also almost always ends his comments with \"ENOUGH SAID\".  \n\n\nI sometimes look into the comment section to see if he finally stopped doing that but the guy just keeps going for some reason, I wonder what his actual real life occupation is.",
        "created_utc": 1632601357,
        "id": "he9fqq4",
        "permalink": "/r/wallstreetbets/comments/pvbyqp/even_worse/he9fqq4/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1632630157.0
    },
    {
        "author": "Adept-Investing",
        "body": "Intel",
        "created_utc": 1630721175,
        "id": "hbisizr",
        "permalink": "/r/wallstreetbets/comments/ph5kv4/35k_to_69k_in_a_week/hbisizr/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1630749975.0
    },
    {
        "author": "Myleftarm",
        "body": "The post was about failed companies and Intel is a terrible example of one.",
        "created_utc": 1630896615,
        "id": "hbrijqi",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrijqi/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1630925415.0
    },
    {
        "author": "MyThrowawayThyme",
        "body": "&gt;  Amd is wining the pc market and intel stoped making ssd's and their gpus is highly experimental.\n\nHey, I build my own computers, too. You know what I don't do? Comment randomly because AMD had a few good releases. \n\nAll the data centers and government contracts will keep Intel in the game for a long, long time. \n\nThe blue vs red war we see as consumers means nothing.",
        "created_utc": 1632666966,
        "id": "hecmz8n",
        "permalink": "/r/ValueInvesting/comments/pvqbjp/the_most_undervalued_stocks_currently_selling_at/hecmz8n/",
        "score": 10,
        "subreddit": "ValueInvesting",
        "created": 1632695766.0
    },
    {
        "author": "redratus",
        "body": "Yup, Intel is working on an autonomous taxi vehicle with nio and a company in Israel…I’m bullish",
        "created_utc": 1631548269,
        "id": "hcpc3h8",
        "permalink": "/r/stocks/comments/pnhmqa/what_are_the_most_out_of_favor_stocks_on_your/hcpc3h8/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1631577069.0
    },
    {
        "author": "sps133",
        "body": "I ran a DCF on INTC a couple of weeks ago. Its CFO could get cut in half, and it would still be underpriced.",
        "created_utc": 1631664339,
        "id": "hcvzgqs",
        "permalink": "/r/ValueInvesting/comments/pocebj/intc_is_the_best_value_stock_in_todays_market/hcvzgqs/",
        "score": 10,
        "subreddit": "ValueInvesting",
        "created": 1631693139.0
    },
    {
        "author": "imposter22",
        "body": "Intel gets sued by patent troll in China.  \nFixed that headline for you",
        "created_utc": 1632167321,
        "id": "hdmpepo",
        "permalink": "/r/wallstreetbets/comments/ps1h6u/intel_accused_of_infringing_finfet_patent_loses/hdmpepo/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1632196121.0
    },
    {
        "author": "dennis8542",
        "body": "Soo many opportunities and here you are playing INTC 😂",
        "created_utc": 1632519340,
        "id": "he5503a",
        "permalink": "/r/wallstreetbets/comments/purthk/why_i_am_bullish_on_intc/he5503a/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1632548140.0
    },
    {
        "author": "Mad_Nekomancer",
        "body": "I don't own INTC but it does seem to me there's a lot more upside than downside. With the low PE and the amount of money they seem poised to get from governments for building fabs they'll do well. People on this sub seem to overrate the importance of high-end products in terms of how much it has to do with making money IMO. \n\nThe only semi stocks I own are TSM and NVDA but it just seems to me there's room for more winners in the space and I can't see INTC being a loser considering how profitable they are.",
        "created_utc": 1631448302,
        "id": "hcjxwh2",
        "permalink": "/r/stocks/comments/pmlktv/low_pe_ratio_tech_stocks_but_still_not_worth/hcjxwh2/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1631477102.0
    },
    {
        "author": "NoTransportation2899",
        "body": "In and out for $2k baby gains on spy calls, intc calls, intc puts. Not holding shit overnight. Feels amazing not holding like a dumb baggie to -90% . Options only intraday for me now",
        "created_utc": 1631559014,
        "id": "hcq27s3",
        "permalink": "/r/wallstreetbets/comments/pncese/daily_discussion_thread_for_september_13_2021/hcq27s3/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1631587814.0
    },
    {
        "author": "nigirizushi",
        "body": "I don't think NVDA is a bad bet. I'm just more bullish on AMD. ARM combined with INTC losing their status quo are both more favorable to AMD on a 10+ year scale.",
        "created_utc": 1632696129,
        "id": "heekrf7",
        "permalink": "/r/stocks/comments/pvvzsl/whats_your_top_5_stocks_to_buy_and_hold_for_the/heekrf7/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1632724929.0
    },
    {
        "author": "hawkxp71",
        "body": "Not really.  Its really only been the last 4 years.\n\nFrom 2006 to 2017, INTC was increasing market share.\n\nhttps://images.app.goo.gl/jALuER55XeGGh2ew9",
        "created_utc": 1631765056,
        "id": "hd1g2kk",
        "permalink": "/r/wallstreetbets/comments/pp5n2e/intc_intel_ceo_spoke_of_wanting_to_be_active_in/hd1g2kk/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1631793856.0
    },
    {
        "author": "SnipahShot",
        "body": "Say what now? Intel has done nothing since he became CEO? First of all, are you aware that he is the CEO for only 7 months?\nNot only that but the amount of things he started to push Intel into and the amount of moves he makes actually made me believe in Intel again and buy into Intel.",
        "created_utc": 1631778438,
        "id": "hd1yfmm",
        "permalink": "/r/stocks/comments/pp789l/cisco_projects_growth_of_5_to_7_over_next_four/hd1yfmm/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1631807238.0
    },
    {
        "author": "RobotArtichoke",
        "body": "INTC is such a boomer company. How did I ever get sucked into that pile of shit when everyone here was telling me to buy AMD. Sometimes you have to admit defeat.",
        "created_utc": 1630685966,
        "id": "hbgob55",
        "permalink": "/r/wallstreetbets/comments/ph24jo/daily_discussion_thread_for_september_03_2021/hbgob55/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1630714766.0
    },
    {
        "author": "pasta4u",
        "body": "There are plenty of states that can. Intel has plants in New York and Texas i believe. \n\nYou can remediate the pollution  with proper processes.",
        "created_utc": 1630991261,
        "id": "hbwb8cu",
        "permalink": "/r/wallstreetbets/comments/pjf98i/wishful_thinking_is_china_fucked/hbwb8cu/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1631020061.0
    },
    {
        "author": "SmallParade",
        "body": "This is in the London Times this AM:\n\n&gt;A Defence Forces firing range in Oranmore, Co Galway, has been selected as a possible location for a “mega-fab” Intel semiconductor plant that could create 10,000 jobs.\n\nhttps://www.thetimes.co.uk/article/intel-targets-army-firing-range-ireland-job-factory-bvt7c726m\n\nAMD only has 12,600 employees total.",
        "created_utc": 1631449320,
        "id": "hcjzgeb",
        "permalink": "/r/stocks/comments/pmqf6z/which_semiconductors_company_has_best_long_term/hcjzgeb/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1631478120.0
    },
    {
        "author": "RobotArtichoke",
        "body": "Imagine buying INTC at the top 🤡 \n\n(Me. I did that)",
        "created_utc": 1631567043,
        "id": "hcqm4ed",
        "permalink": "/r/wallstreetbets/comments/pnn4wa/what_are_your_moves_tomorrow_september_14_2021/hcqm4ed/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1631595843.0
    },
    {
        "author": "ExceptionallyGreat",
        "body": "All in AMD calls for INTC earnings then?",
        "created_utc": 1631767493,
        "id": "hd1k2az",
        "permalink": "/r/wallstreetbets/comments/pp5n2e/intc_intel_ceo_spoke_of_wanting_to_be_active_in/hd1k2az/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1631796293.0
    },
    {
        "author": "bigred91224",
        "body": "INTC is soo tempting right now given its P/E under 12.  \n  \nI really think AMD will replace Intel as the top CPU manufacturer, but Intel just seems *very* undervalued right now.",
        "created_utc": 1631207012,
        "id": "hc7a4yz",
        "permalink": "/r/stocks/comments/pkufdf/rstocks_daily_discussion_options_trading_thursday/hc7a4yz/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1631235812.0
    },
    {
        "author": "Investing8675309",
        "body": "Worked in this industry for many years and know it well, worrisome the top voted equity on this thread is Intel. Feel like all this sub does is look at low PEs and ignore the business positioning and call it a “value stock” and a great bargain. This is going to be Intel’s roughest decade since the 80’s when they had to exit the RAM business for microprocessors.",
        "created_utc": 1632672462,
        "id": "heczmz5",
        "permalink": "/r/ValueInvesting/comments/pvqbjp/the_most_undervalued_stocks_currently_selling_at/heczmz5/",
        "score": 9,
        "subreddit": "ValueInvesting",
        "created": 1632701262.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "https://www.tomshardware.com/news/intel-ice-lake-inefficient-for-cloudflare\n\nNET chooses AMD over INTC for new processors",
        "created_utc": 1630515542,
        "id": "hb7i3n8",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7i3n8/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630544342.0
    },
    {
        "author": "Jaypalm",
        "body": "ARM doesn’t make chips. Neither does AMD. ARM is an architecture, like x86. It’s an IP company. AMD designs and sells CPUs. As the underdog in the desktop CPU market they would be hurting themselves to collude with Intel when what they’re actually doing is making better products and undercutting Intel’s prices. I’m not saying there isn’t market collusion, but your arguments will have more merit if you actually know what you’re talking about.",
        "created_utc": 1630799360,
        "id": "hbmmlyz",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbmmlyz/",
        "score": 8,
        "subreddit": "investing",
        "created": 1630828160.0
    },
    {
        "author": "paq12x",
        "body": "INTC has a stock split 2:1 at the end of July 2000.\n\nIn the last 10 years, return for INTC is 14% annually or a total of 268% in 10 years.  \n\nNot bad at all.",
        "created_utc": 1630760951,
        "id": "hbkc7t1",
        "permalink": "/r/stocks/comments/phq0mw/is_v_visa_a_good_long_term_hold_for_5_years_or/hbkc7t1/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630789751.0
    },
    {
        "author": "updownleftrightabsta",
        "body": "INTC is positive YTD, 1 year, 5 years. It hasn't done well but I wouldn't call it failing GE-style. OP just means stock price wise, not execution wise (related but not completely correlated)",
        "created_utc": 1630895328,
        "id": "hbrg0in",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrg0in/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630924128.0
    },
    {
        "author": "daynighttrade",
        "body": "It'll keep them making money for another 2-3 years at the most. AMD having superior and power efficient cores (with low TCO) will move those contracts away.   \n \nThe only way Intel can be proven to be undervalued is if they get their foundry at par with TSMC, and that's a very big challenge.  TSMC executes like clockwork, while Intel has had a bad track record for last 4-5 years",
        "created_utc": 1632668916,
        "id": "hecrcu0",
        "permalink": "/r/ValueInvesting/comments/pvqbjp/the_most_undervalued_stocks_currently_selling_at/hecrcu0/",
        "score": 8,
        "subreddit": "ValueInvesting",
        "created": 1632697716.0
    },
    {
        "author": "Xx_Majesticface_xX",
        "body": "TSMC is a fairly well known stock, however, I’m placing my bets on Global Foundries. While there were talks a few months ago in regards to Intel acquiring them, a lot of electronics that don’t require high end semi conductors(7nm TSMC, 8nm Samsung, 10nm Intel) are made using cheap, larger nodes that are less efficient. Global foundries failed to develop high end chips after they abandoned their rnd, but they hold a 15% market share(at last check) in markets which use lower grade nodes. Best part is, that they are supposedly going public in 2022. I personally think that this is a wise investment, though a rather obvious one, as any company which is trusted by the US government and hold a market share in a sector worth billions is a simple stock to buy",
        "created_utc": 1630714543,
        "id": "hbiflpp",
        "permalink": "/r/wallstreetbets/comments/phgqi2/lets_talk_about_tsm_stock_taiwan_semiconductor/hbiflpp/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630743343.0
    },
    {
        "author": "seigy",
        "body": "Agree with both.  \nMU: DDR4 prices are holding very well, there is still a chip shortage that plays into their demand, and DDR5 will start rolling out (at a nice premium) in the next few months.\nINTC: While they have fallen behind the curve, they are the domestic chip producer and under Pat's leadership, they are finally starting to become aggressive on competing with AMD.  I think it will still be a couple years before they can get the company turned around but I am very optimistic that they will get there.",
        "created_utc": 1632601746,
        "id": "he9glts",
        "permalink": "/r/stocks/comments/pvblkn/what_stocks_currently_at_their_52_week_lows_or/he9glts/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1632630546.0
    },
    {
        "author": "sokpuppet1",
        "body": "Look at what the interest rates were in 2000, consider how many retail traders were active in the market, and consider that intel and nvidia make very different kinds of chips. Taken together, you’re comparing two very different market regimes and two very different companies.",
        "created_utc": 1632700187,
        "id": "heet72u",
        "permalink": "/r/stocks/comments/pw3owd/shorting_nvda_should_i_buy_puts/heet72u/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1632728987.0
    },
    {
        "author": "senecadocet1123",
        "body": "Intel and Baba make 35% of my portfolio",
        "created_utc": 1631454227,
        "id": "hck8e4q",
        "permalink": "/r/stocks/comments/pmlktv/low_pe_ratio_tech_stocks_but_still_not_worth/hck8e4q/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1631483027.0
    },
    {
        "author": "Ryano3",
        "body": "21% MSFT\n\n21% AAPL\n\n19% AMZN\n\n10% GOOG\n\n9% NVDA\n\n8% BABA\n\n5% AMD\n\n5% INTC\n\n2% VOO\n\nup on everything but BABA and INTC, currently daily averaging into VOO",
        "created_utc": 1630987598,
        "id": "hbw5bf0",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hbw5bf0/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1631016398.0
    },
    {
        "author": "tsimtsimtsim",
        "body": "Many said the exact same about GE, ExxonMobil, IBM, Cisco, AT&amp;T, HP, Intel, etc. etc. etc.\n\nApple didn't start getting big until the iPhone came out in 2007, 14 yrs ago. Is it that hard to believe anything can happen in the next 20 years?\n\nGuess what the biggest company was 20 yrs ago in 2001... GE at 405 billion market cap. Microsoft was second at 290 billion. Apple was nowhere near top 10 at 8 billion.",
        "created_utc": 1630546630,
        "id": "hb9gk5c",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9gk5c/",
        "score": 325,
        "subreddit": "stocks",
        "created": 1630575430.0
    },
    {
        "author": "tsimtsimtsim",
        "body": "People said the same about Intel and smartphones, and we all know how that went...",
        "created_utc": 1630546680,
        "id": "hb9go2g",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9go2g/",
        "score": 140,
        "subreddit": "stocks",
        "created": 1630575480.0
    },
    {
        "author": "r2002",
        "body": "I guess my question would be -- is it hard to spot the decline? For example, can we look into the history of GE, Intel, or HP and pinpoint a specific 1-3 year time frame when we can tell they are losing marketing share and not innovating enough to be a top tier company?\n\nOr is it impossible to tell when you're the frog slowly boiling.",
        "created_utc": 1630550030,
        "id": "hb9nkhi",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9nkhi/",
        "score": 91,
        "subreddit": "stocks",
        "created": 1630578830.0
    },
    {
        "author": "No_Blackberry_1870",
        "body": "For example look at the all time charts for Cisco and intel. In the 2000s everyone over paid for the growth potential those companies had and despite those companies doing the best they ever had in terms of revenues today. Their stock prices have still not reached their 2000s peaks.",
        "created_utc": 1630908191,
        "id": "hbs26pl",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbs26pl/",
        "score": 55,
        "subreddit": "stocks",
        "created": 1630936991.0
    },
    {
        "author": "crepeblanket",
        "body": "What was the news about Intel delaying their govt deliveries so they bought some AMD and NVIDIA chips while waiting for Intel to come through? Intel being the defacto govt chip supplier doesn’t sound like an absolutely sure thing long term",
        "created_utc": 1630765009,
        "id": "hbkk4ay",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbkk4ay/",
        "score": 34,
        "subreddit": "investing",
        "created": 1630793809.0
    },
    {
        "author": "No_Blackberry_1870",
        "body": "That’s irrelevant to my example of over paying for growth. 21 years ago those companies were the Nvidia and amd of their times. Also intel literally makes double what amd and nvidia make combined lol.",
        "created_utc": 1630909644,
        "id": "hbs48wh",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbs48wh/",
        "score": 31,
        "subreddit": "stocks",
        "created": 1630938444.0
    },
    {
        "author": "nigirizushi",
        "body": "That's because Intel mobile chips were always power hungry. They couldn't get a day standby time or whatever horrible battery life it was. \n\nTesla wouldn't make their own chip, at least at first, but would just license ARM.",
        "created_utc": 1630559000,
        "id": "hba3udc",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hba3udc/",
        "score": 30,
        "subreddit": "stocks",
        "created": 1630587800.0
    },
    {
        "author": "jubothecat",
        "body": "Intel said it was going to build the world's fastest super computer like 10 years ago. Now, they were supposed to deliver it years ago, and they still don't have the technology to make what they said they would. Even if released today it would now only be like the 3rd fastest because they waited too long.\nTldr: even if Intel has these new government contracts, they are so far behind that they have a lot longer of a journey to be the best chip maker than people think (most laymen don't even know AMD is better right now).",
        "created_utc": 1630765482,
        "id": "hbkl4bs",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbkl4bs/",
        "score": 28,
        "subreddit": "investing",
        "created": 1630794282.0
    },
    {
        "author": "IndividualForward177",
        "body": "All fabs are running at 100%. All they can do short term to increase profits is raise prices which TSMC and Samsung just did. TSMC is building new fabs, Intel is building, GlobalFoundries is building, Samsung just announced increase in capital spending and they will profit from it in 2-3 years as this is on average how long it takes to finish a new fab. Right now the equipment makers will be the big winners on chip shortage. AMAT and LRCX are particularly undervalued. They sold off recently along with MU because they also supply DRAM equipment and there is suspicion in the industry DRAM cycle peaked. But their DRAM manufacturing equipment is less than 10% of portfolio. Moreover, new generation of DRAM goes 3D stacks which need new manufacturing equipment. So the whole industry will 🚀",
        "created_utc": 1630685684,
        "id": "hbgnmlu",
        "permalink": "/r/wallstreetbets/comments/ph7zba/looking_for_chip_shortage_buys_here_are_the/hbgnmlu/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1630714484.0
    },
    {
        "author": "EPMD_",
        "body": "There are lots of exceptions. Amazon and Walmart have been kind of duds this year as high P/E stocks, while GM and Goldman Sachs have been low P/E All-Stars.\n\nStock | Price increase past year | P/E ratio\n:--|--:|--:\nAmazon | +2.8% | 60.4\nGoldman Sachs | +99.7% | 7.6\nWalmart | +2.8% | 41.9\nGM | +66.0% | 5.7\n\nP/E cannot be relied upon in isolation to pick good/bad buys. GM is a good example of the complication of P/E. Almost all of GM's business is internal combustion engine cars, so its P/E is using its legacy business as a base in the calculation, but all of the optimism around GM is about everything else they are doing besides internal combustion engine cars. GM itself thinks their legacy business will disappear in 10-15 years, so its P/E is nonsensical when looking forward. Their \"true\" future P/E is going to be based on earnings from non-internal combustion engine cars, and those earnings are essentially zero right now. In other words, their true forward looking P/E is much higher than 5.7. They are a future high P/E stock disguised as a current low P/E stock, but the future high P/E is going to be driven by earnings declines.\n\nIn terms of finding value, there is usually a story why a company's P/E is low. You have to find the story and see if you are okay with it. Maybe it's something like Intel where consumer sentiment is so negative due to their rivals' recent tech advantages, but the deeper you look, the more you see competitive advantages that Intel will be able to maintain and leverage going forward to build its stock price back up. Or maybe it's a low P/E like Altria because no one wants to own tobacco stocks.",
        "created_utc": 1630629887,
        "id": "hbdycab",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbdycab/",
        "score": 21,
        "subreddit": "ValueInvesting",
        "created": 1630658687.0
    },
    {
        "author": "Not_FinancialAdvice",
        "body": "&gt; That's because Intel mobile chips were always power hungry. They couldn't get a day standby time or whatever horrible battery life it was. \n\nThe Intel PXA270 XScale processor (which was an ARM implementation) in my old Palm Treo 650 gave me 2-3 days of battery life. They sold the XScale IP to Marvell later on.",
        "created_utc": 1630560235,
        "id": "hba5qyf",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hba5qyf/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1630589035.0
    },
    {
        "author": "ra__account",
        "body": "See the recent discussion that we're still paying baggage fees that were markets as temporary after 9/11. If there's limited enough suppliers (like the AMD/Intel/NVidia trio), they can keep prices up without crossing the line of overtly colluding. Creating and manufacturing a powerful CPU is very costly and the only edge players like Apple have no interest in driving prices down.",
        "created_utc": 1630777573,
        "id": "hblc3s2",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hblc3s2/",
        "score": 15,
        "subreddit": "investing",
        "created": 1630806373.0
    },
    {
        "author": "eomar2828",
        "body": "i am still buying MSFT and INTC. I really like NVDA the company, but not NVDA the price. I own AAPL but am iffy on the price.",
        "created_utc": 1630864053,
        "id": "hbplpel",
        "permalink": "/r/ValueInvesting/comments/pif8jm/my_top_tech_stocks_to_watch_that_pays_dividends/hbplpel/",
        "score": 11,
        "subreddit": "ValueInvesting",
        "created": 1630892853.0
    },
    {
        "author": "Myleftarm",
        "body": "How is Intel a failed company?",
        "created_utc": 1630895325,
        "id": "hbrg0c3",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrg0c3/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1630924125.0
    },
    {
        "author": "Adept-Investing",
        "body": "Intel",
        "created_utc": 1630721175,
        "id": "hbisizr",
        "permalink": "/r/wallstreetbets/comments/ph5kv4/35k_to_69k_in_a_week/hbisizr/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1630749975.0
    },
    {
        "author": "Myleftarm",
        "body": "The post was about failed companies and Intel is a terrible example of one.",
        "created_utc": 1630896615,
        "id": "hbrijqi",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrijqi/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1630925415.0
    },
    {
        "author": "RobotArtichoke",
        "body": "INTC is such a boomer company. How did I ever get sucked into that pile of shit when everyone here was telling me to buy AMD. Sometimes you have to admit defeat.",
        "created_utc": 1630685966,
        "id": "hbgob55",
        "permalink": "/r/wallstreetbets/comments/ph24jo/daily_discussion_thread_for_september_03_2021/hbgob55/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1630714766.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "https://www.tomshardware.com/news/intel-ice-lake-inefficient-for-cloudflare\n\nNET chooses AMD over INTC for new processors",
        "created_utc": 1630515542,
        "id": "hb7i3n8",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7i3n8/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630544342.0
    },
    {
        "author": "Jaypalm",
        "body": "ARM doesn’t make chips. Neither does AMD. ARM is an architecture, like x86. It’s an IP company. AMD designs and sells CPUs. As the underdog in the desktop CPU market they would be hurting themselves to collude with Intel when what they’re actually doing is making better products and undercutting Intel’s prices. I’m not saying there isn’t market collusion, but your arguments will have more merit if you actually know what you’re talking about.",
        "created_utc": 1630799360,
        "id": "hbmmlyz",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbmmlyz/",
        "score": 8,
        "subreddit": "investing",
        "created": 1630828160.0
    },
    {
        "author": "paq12x",
        "body": "INTC has a stock split 2:1 at the end of July 2000.\n\nIn the last 10 years, return for INTC is 14% annually or a total of 268% in 10 years.  \n\nNot bad at all.",
        "created_utc": 1630760951,
        "id": "hbkc7t1",
        "permalink": "/r/stocks/comments/phq0mw/is_v_visa_a_good_long_term_hold_for_5_years_or/hbkc7t1/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630789751.0
    },
    {
        "author": "updownleftrightabsta",
        "body": "INTC is positive YTD, 1 year, 5 years. It hasn't done well but I wouldn't call it failing GE-style. OP just means stock price wise, not execution wise (related but not completely correlated)",
        "created_utc": 1630895328,
        "id": "hbrg0in",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrg0in/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630924128.0
    },
    {
        "author": "Xx_Majesticface_xX",
        "body": "TSMC is a fairly well known stock, however, I’m placing my bets on Global Foundries. While there were talks a few months ago in regards to Intel acquiring them, a lot of electronics that don’t require high end semi conductors(7nm TSMC, 8nm Samsung, 10nm Intel) are made using cheap, larger nodes that are less efficient. Global foundries failed to develop high end chips after they abandoned their rnd, but they hold a 15% market share(at last check) in markets which use lower grade nodes. Best part is, that they are supposedly going public in 2022. I personally think that this is a wise investment, though a rather obvious one, as any company which is trusted by the US government and hold a market share in a sector worth billions is a simple stock to buy",
        "created_utc": 1630714543,
        "id": "hbiflpp",
        "permalink": "/r/wallstreetbets/comments/phgqi2/lets_talk_about_tsm_stock_taiwan_semiconductor/hbiflpp/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630743343.0
    },
    {
        "author": "Arturion34",
        "body": "This is big, but INTC just started making similar plans to blow up chio production. Overall, i think both are solid buys and own both",
        "created_utc": 1630613049,
        "id": "hbcx25b",
        "permalink": "/r/stocks/comments/pgk8sz/is_tsm_a_strong_buy/hbcx25b/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630641849.0
    },
    {
        "author": "Several_Situation887",
        "body": "I don't know that NVIDIA is particularly over-valued, or not. They design wonderful GPU and computing chips. I believe that they contract with foundries like TSMC to have their chips produced. I could be wrong on that though.\n\nBut, I don't see anything NVIDIA produces as likely to find their way into school bus air conditioning, or any other place where pedestrian basic chips perform perfectly adequately.\n\nThat would be like purchasing a Ferrari station wagon because you needed a car to get groceries with. Expensive, and not the niche that NVIDIA or Ferrari want to play in.\n\nIn the areas where their chips are going to be in demand, the competition is fierce from AMD, Intel, and many other chip designers that play in that space. And, who is king at any given time cycles.",
        "created_utc": 1630910281,
        "id": "hbs53q3",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbs53q3/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630939081.0
    },
    {
        "author": "Both-Ad-7757",
        "body": "This is a fantastic explanation and I’m with you on Intel. Very well put good sir!",
        "created_utc": 1630630214,
        "id": "hbdz1us",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbdz1us/",
        "score": 6,
        "subreddit": "ValueInvesting",
        "created": 1630659014.0
    },
    {
        "author": "SnipahShot",
        "body": "And to add on top of that Intel finally put their foot in the gaming GPU market for the first time. Regardless of how good Alchemist will be, it will take profits from AMD and Nvidia, especially if it is as good as they make it sound.",
        "created_utc": 1630914900,
        "id": "hbsavdb",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbsavdb/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630943700.0
    },
    {
        "author": "daaammmN",
        "body": "It all depends on if you overpaid or not.\n\nIntel was almost at the 80$ mark in the 2000s.\n\nSince then it has grown a lot, but still, 20 years later and it never reached its all time high.\n\nThis just proves that you can overpay for growth.\nIf you are overpaying, you might not see an increase for many years to come\n\nI haven't dug into MasterCard, but I did for Visa.\n\nIMO, Visa (and most of the market) is overpriced. The growth that Visa is projecting (mid teens) for the next 5 years is already priced in.\n\nIf the bull market continues, the stock price might increase, but it's just a matter of time before the correction arrives and reality kicks in.\n\nI want to own Visa, I like it very much. They have been buying back shares like crazy, which is awesome. It's on my watchlist. But it still has to drop a lot for me to be a buyer. I have no doubt that it will be a buy at some point in the future though.",
        "created_utc": 1630758713,
        "id": "hbk8hho",
        "permalink": "/r/stocks/comments/phq0mw/is_v_visa_a_good_long_term_hold_for_5_years_or/hbk8hho/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630787513.0
    },
    {
        "author": "shashwat73",
        "body": "I added V and INTC. Low PE ratios, great companies, and good technicals on both",
        "created_utc": 1630680824,
        "id": "hbgbvlk",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbgbvlk/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630709624.0
    },
    {
        "author": "JRshoe1997",
        "body": "INTC, LMT, and TGT",
        "created_utc": 1630674506,
        "id": "hbfxlgg",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbfxlgg/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630703306.0
    },
    {
        "author": "FullAtticus",
        "body": "Exactly. There are three companies (Arm, Intel, AMD) making CPUs for example. All they have to do is have 3 managers meet up for lunch one afternoon and they can dictate prices to the market. Sure it's illegal, but good luck proving they did it.",
        "created_utc": 1630793181,
        "id": "hbmaah1",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbmaah1/",
        "score": 5,
        "subreddit": "investing",
        "created": 1630821981.0
    },
    {
        "author": "Spiritual_Extreme_81",
        "body": "GOOG reportedly plans to put its own chips in Chromebook laptops from 2023, ditching both INTC and AMD.",
        "created_utc": 1630883538,
        "id": "hbqs6hn",
        "permalink": "/r/wallstreetbets/comments/phcns0/weekend_discussion_thread_for_the_weekend_of/hbqs6hn/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630912338.0
    },
    {
        "author": "ScruffyBelievesInGME",
        "body": "Targets this week in no particular order are: INTC, GM, COIN, UBER, F, VIAC, DISCA, LMT, SQ, ON, PLTR, ADM, and AAPL",
        "created_utc": 1630960851,
        "id": "hbunayw",
        "permalink": "/r/wallstreetbets/comments/pj77jg/what_are_your_moves_tomorrow_september_07_2021/hbunayw/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630989651.0
    },
    {
        "author": "TaxGuy_021",
        "body": "AMD and Nvidia dont have an insurmountable lead. They are ahead of Intel for sure for now, but I believe intel has what it takes to get back in the game.",
        "created_utc": 1630866603,
        "id": "hbprfhq",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbprfhq/",
        "score": 5,
        "subreddit": "investing",
        "created": 1630895403.0
    },
    {
        "author": "meowman3000",
        "body": "Intel is getting government money to setup fabs in the US, as part of an infrastructure bill.  I could see them treating TSMC like they do Huawei in the future if Intel gets enough capacity.  I could see a strong case for national security, in which case Nvidia and AMD would shift to Intel, assuming the fabs are competitive.\n\nA small chance at least.",
        "created_utc": 1630637279,
        "id": "hbee1ue",
        "permalink": "/r/stocks/comments/pgk8sz/is_tsm_a_strong_buy/hbee1ue/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630666079.0
    },
    {
        "author": "Nuclear_N",
        "body": "INTC has been such a dog.",
        "created_utc": 1630859096,
        "id": "hbpah9w",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbpah9w/",
        "score": 4,
        "subreddit": "investing",
        "created": 1630887896.0
    },
    {
        "author": "bcuap10",
        "body": "Markets in theory function well because of competition and displayed consumer/investor preference.\n\nThey gov should fund 5-10 startups and give them funding to create pilot plants. Then hold competitions to advance the companies forward for more funding.\n\nYou would end up with more surplus and innovation if 2-3 new companies emerge and then sub specialize in different parts than giving everything to a dinosaur like Intel.",
        "created_utc": 1630773662,
        "id": "hbl38jl",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbl38jl/",
        "score": 4,
        "subreddit": "investing",
        "created": 1630802462.0
    },
    {
        "author": "Pokesaurus_Rex",
        "body": "and Intel hasn’t innovated a CPU since like 2015…we are on 14nm++++++. They can’t even get a 7nm CPU to work and it got so bad they had to bring back one of their best designers out of fucking retirement.",
        "created_utc": 1630919676,
        "id": "hbsg83o",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbsg83o/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630948476.0
    },
    {
        "author": "sweYoda",
        "body": "Coca-Cola, Kroger, Tyson Foods, Disney, Google, Intel",
        "created_utc": 1630640934,
        "id": "hbela50",
        "permalink": "/r/investing/comments/pgo4l0/anybody_hedging_heavily_against_a_downtown/hbela50/",
        "score": 4,
        "subreddit": "investing",
        "created": 1630669734.0
    },
    {
        "author": "noobc4k3",
        "body": "Why is INTC  dumping AH?",
        "created_utc": 1630531290,
        "id": "hb8kdol",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8kdol/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630560090.0
    },
    {
        "author": "notmsnewty",
        "body": "ALYI - hemp batteries are the future. I hope this is the company.  Anyone else have intel?",
        "created_utc": 1630625285,
        "id": "hbdonrm",
        "permalink": "/r/pennystocks/comments/pg9ogi/daily_plays_september_02_2021/hbdonrm/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1630654085.0
    },
    {
        "author": "datingadviceThrow789",
        "body": "INTC and CLF are the best govt plays moving forward. Love them both.",
        "created_utc": 1630600645,
        "id": "hbc1uwi",
        "permalink": "/r/wallstreetbets/comments/pgl9ng/cliffs_natural_resources_inc_clf_huge_potential/hbc1uwi/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630629445.0
    },
    {
        "author": "GraysonMA",
        "body": "When you buy leaps you are taking on a lot of vega exposure which can add significant risk to your portfolio. However, vega gives you a second way to win if you stick to companies that have IVR/IV% near their 52 week lows. [Barchart is a great resource for finding these.](https://www.barchart.com/options/iv-rank-percentile/stocks?orderBy=optionsWeightedImpliedVolatility&amp;orderDir=asc)\nI also choose underlyings that have low correlation with each other. This keeps things a little less volatile which is especially important using any type of leverage. [PortfolioVisualizer has a great tool for this.](https://www.portfoliovisualizer.com/asset-correlations?s=y&amp;symbols=SPY+TLT+KO+PG+D+INTC+MCD+VZ+FB+MSFT+NVDA+LLY+NEE&amp;timePeriod=2&amp;tradingDays=60&amp;months=36). Leaps I bought recently are in PG, INTC, FB, D, MSFT, KO, VZ, and MCD. LLY is an solid low correlation pick but I’m waiting for a dip in IV.",
        "created_utc": 1630675696,
        "id": "hbg03gf",
        "permalink": "/r/options/comments/pgu6ms/leaps_recommendations/hbg03gf/",
        "score": 3,
        "subreddit": "options",
        "created": 1630704496.0
    },
    {
        "author": "him7403",
        "body": "Microsoft and Apple hold and buy Intel? That's a big lol 😂\n\nUnfortunately stock market doesn't follow your formula.",
        "created_utc": 1630868623,
        "id": "hbpvwt2",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbpvwt2/",
        "score": 3,
        "subreddit": "investing",
        "created": 1630897423.0
    },
    {
        "author": "myglasstrip",
        "body": "Take a look at the Intel 20 year chart and tell me when intc got back to its last ath of 73.94 a share or whatever.",
        "created_utc": 1630538488,
        "id": "hb8zbv3",
        "permalink": "/r/wallstreetbets/comments/pfyl89/why_are_you_not_buying_ko_leaps/hb8zbv3/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630567288.0
    },
    {
        "author": "donktastic",
        "body": "That's not completely true and even if it was it doesn't matter. The proprietary tech steps are all done in secure locations like the US, Israel and Ireland with the US doing 100% of their R&amp;D. The R&amp;D sites are massive and also do manufacturing which handles the most top secret stuff, like US military stuff. Asia only gets the cost saving steps that are not sensitive, like packaging. \n\nIf shit hit the fan and world war 3 broke out, Intel could easily do 100% of its process in the US or allied countries. The most important part being that Intel is a US company, is based in the USA and is invested in the success of the nation.",
        "created_utc": 1630782995,
        "id": "hblo2pd",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hblo2pd/",
        "score": 3,
        "subreddit": "investing",
        "created": 1630811795.0
    },
    {
        "author": "Thin_Influence5878",
        "body": "INTC ftw",
        "created_utc": 1630866065,
        "id": "hbpq8bw",
        "permalink": "/r/ValueInvesting/comments/pif8jm/my_top_tech_stocks_to_watch_that_pays_dividends/hbpq8bw/",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1630894865.0
    },
    {
        "author": "Macre117",
        "body": "Intel",
        "created_utc": 1630514532,
        "id": "hb7fkbu",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7fkbu/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630543332.0
    },
    {
        "author": "shortyafter",
        "body": "I had been holding out since I started in February, but over the last few months lots of great buying opportunities have come up.  I am now 100% invested and will continue to average in my minuscule salary over the coming months and years.\n\nI have a retirement account that is made up of index funds.\n\nIn addition, this year I designed a defensive, value portfolio which hopefully gives me some protection on the downside.  I may not beat the S+P but I feel like I have good capital protection plus steady and reliable returns from dividends.  Rough percentages:\n\nBUD - Anheuser Busch Inbev - 5%\n\nADM - Archer-Daniels-Midland- 3.75% (agriculture company)\n\nBNS - Bank of Novia Scotia - 6%\n\nBAYRY - Bayer AG - 3%\n\nBTI - British American Tobacco - 10%\n\nKOF - Coca Cola Femsa - 6%\n\nFDP - Fresh Del Monte - 6%\n\nIBDRY - Iberdrola - 4.5% (Spanish renewable energy)\n\nIMBBY - Imperial brands - 9% (tobacco)\n\nINTC - Intel Corp - 6.5%\n\nLMT - Lockheed Martin - 9%\n\nLOGI - Logitech - 5%\n\nNTDOY - Nintendo - 8%\n\nPAAS - Pan American Silver Corp - 1.5%\n\nREPYY - Repsol - 8% (Spanish energy)\n\nUVV - Universal Corp - 6% (tobacco leaf grower)\n\nWPC - WP Carey - 1.5% (REIT)\n\nI'd like to round out some of my smaller positions, and I'd also like to pick up some mega cap tech (FAANG) in the future.  I bought what I could in this crazy market by looking for deals.",
        "created_utc": 1630677381,
        "id": "hbg3t08",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hbg3t08/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630706181.0
    },
    {
        "author": "agyria",
        "body": "Nah PayPal is intel while SQ is AMd",
        "created_utc": 1630623295,
        "id": "hbdkfxu",
        "permalink": "/r/wallstreetbets/comments/pgphq9/what_are_your_moves_tomorrow_september_03_2021/hbdkfxu/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630652095.0
    },
    {
        "author": "Disastrous_Proof6562",
        "body": "Intel comes to mind. Before the dot com bubble they were the big thing. They never crashed and burned or anything, but they failed to take off and meet expectations.",
        "created_utc": 1630903391,
        "id": "hbruwil",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbruwil/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630932191.0
    },
    {
        "author": "throughthehazel",
        "body": "INTC 50s 9/17 poots",
        "created_utc": 1630536020,
        "id": "hb8ud2v",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8ud2v/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630564820.0
    },
    {
        "author": "Scion_capital_intern",
        "body": "Well CCP has already infiltrated all of our Intel agencies and defense contractors so.. \n\nIt's the same thing. But yes.",
        "created_utc": 1630879305,
        "id": "hbqji8o",
        "permalink": "/r/wallstreetbets/comments/phcns0/weekend_discussion_thread_for_the_weekend_of/hbqji8o/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630908105.0
    },
    {
        "author": "senecadocet1123",
        "body": "The only one I would by heavily is Intel right now",
        "created_utc": 1630877550,
        "id": "hbqfrdi",
        "permalink": "/r/ValueInvesting/comments/pif8jm/my_top_tech_stocks_to_watch_that_pays_dividends/hbqfrdi/",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1630906350.0
    },
    {
        "author": "SugarDaddyVA",
        "body": "Their management has been terrible.  They missed a chip cycle which will set them back years in competition with other companies such as TMSC.  Great article explaining what happened here:  https://www.google.com/amp/s/www.tomshardware.com/amp/news/intel-announces-delay-to-7nm-processors-now-one-year-behind-expectations\n\nI’ll look at them again in a few years if they turn things around.",
        "created_utc": 1630868939,
        "id": "hbpwlw8",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbpwlw8/",
        "score": 3,
        "subreddit": "investing",
        "created": 1630897739.0
    },
    {
        "author": "Stoli1387",
        "body": "Intel if you're patient",
        "created_utc": 1630692101,
        "id": "hbh31da",
        "permalink": "/r/stocks/comments/ph1s4s/rstocks_daily_discussion_fundamentals_friday_sep/hbh31da/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630720901.0
    },
    {
        "author": "828stocks",
        "body": "Thank you for my tasty dividend, INTC.  You might be fucking me, but at least you're buying dinner.",
        "created_utc": 1630593293,
        "id": "hbbjvvx",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbbjvvx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630622093.0
    },
    {
        "author": "DongKelly32",
        "body": "Look up AS ML (pretty sure they’re private but just being safe). They make the machine that makes shit for Intel, TSMC, AMD, NVDA, etc. and it costs $150m+",
        "created_utc": 1630698475,
        "id": "hbhhl5g",
        "permalink": "/r/wallstreetbets/comments/ph24jo/daily_discussion_thread_for_september_03_2021/hbhhl5g/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630727275.0
    },
    {
        "author": "Afro_Superbiker",
        "body": "Here's hoping. I don't think their gpu will be aimed at the gaming market, so I don't think it will garner the same hype that a new release from Nvidia does.\n\nOver time though, especially with investment from the u.s with the aims of developing their u.s fabs, Intel will gain new life.",
        "created_utc": 1630714059,
        "id": "hbieok5",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbieok5/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1630742859.0
    },
    {
        "author": "mistermc90",
        "body": "Tip: just look where the cheap free cashflow to the firm / shareprice is!!!\n \n-BTI, ITB (big tobacco in general) //\n-INTC (semiconductor) //\n-RDSB (big oil/gas cashflow machine) //\n-VZ (telco with strong free CF in an oligopolistic market) //\n-FRE (strong german health company) //\n-VRTX (tremendous value drug company - 10/10 financials)",
        "created_utc": 1630688427,
        "id": "hbguas9",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbguas9/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630717227.0
    },
    {
        "author": "Parallelism09191989",
        "body": "Intel and TSM\n\nEverybody overreacting to AMD leapfrogging Intel.",
        "created_utc": 1630685309,
        "id": "hbgmpm0",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbgmpm0/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630714109.0
    },
    {
        "author": "PrincPaco",
        "body": "Not so sure about some of those tickers, unless you're buying Puts. Regardless, I wish you Good luck.\n\nINTC LEAPS may be a good play.",
        "created_utc": 1630961251,
        "id": "hbuo7fc",
        "permalink": "/r/wallstreetbets/comments/pj77jg/what_are_your_moves_tomorrow_september_07_2021/hbuo7fc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630990051.0
    },
    {
        "author": "CrimsonBrit",
        "body": "INTC",
        "created_utc": 1630948074,
        "id": "hbtu8pw",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbtu8pw/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630976874.0
    },
    {
        "author": "spongesquare",
        "body": "What happened to Intel?",
        "created_utc": 1630516952,
        "id": "hb7ljkv",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7ljkv/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630545752.0
    },
    {
        "author": "Overhaul2977",
        "body": "AMD’s profit margin is pretty good, they are taking market share from intel and approaching Nvidia in performance for their GPUs, and they are innovating well under current management. The problem with your analysis is you’re looking at book value, you need to look at future growth and both companies they can take market share have a fair amount higher market cap, meaning it has plenty of space to grow if things keep going well for them. The stock market cares about future growth, not too much on past performance.\n\nTo give you a basic idea of investing, there are four types of companies - Dogs, Cash Cows, Question Marks, and Stars. AMD is at the Question Mark phase that is almost to Star. They are taking market share in a fast growing area. The typical investor strategy in that situation is to “buy”.",
        "created_utc": 1630588805,
        "id": "hbb9kpu",
        "permalink": "/r/wallstreetbets/comments/pghk1y/how_are_people_buying_shares_of_amd_at_this/hbb9kpu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630617605.0
    },
    {
        "author": "ZeroSumBananas",
        "body": "Here are some stocks I have looked at some higher risk than others you can go with Google, Microsoft, Apple, Tesla, ISRG, Lucid, CHPT, Facebook, Intel this would be a contrarian buy, Nokia, Berkshire Hathaway, so those are some common stocks. Depends on your risk tolerance. If you want risk you can go with Chinese stocks....Not responsible for your success or failure. Not recommending anything. Good luck. Do your DD",
        "created_utc": 1630884623,
        "id": "hbqud9e",
        "permalink": "/r/stocks/comments/pidyd7/hey_im_not_that_old/hbqud9e/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630913423.0
    },
    {
        "author": "ErojectionPrection",
        "body": "I think nvidia is fine to hold onto for a while.\n\nThey're still far ahead of amd in the professional world but the money is in the consumer world. AMD has been very competitive in that regard over the years. But Intel is the bigger victim of AMD's success. Nvidia simply has real competition now. But only in a tiny area.",
        "created_utc": 1630912141,
        "id": "hbs7j12",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbs7j12/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630940941.0
    },
    {
        "author": "merlinsbeers",
        "body": "IBM made probably the biggest mistake in business history by giving Microsoft and Intel the ability to make computers on the PC architecture without IBM involvement.\n\nThey could have owned that whole ecosystem and leveraged their incredible brand recognition to attract the talent that made it happen.\n\nBut, if they had, IBM management would have overcontrolled it so we'd probably all be using Macs and talking about PC only in conversations with words like Amiga, Imsai, and Heathkit.",
        "created_utc": 1630940177,
        "id": "hbtc2gd",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbtc2gd/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630968977.0
    },
    {
        "author": "pacifistrebel",
        "body": "I hope intel can turn around their fabrication business. If they can, the current price is a steal. If not.. who knows what will happen. The USA could benefit from competent domestic semiconductor fabrication.",
        "created_utc": 1630894021,
        "id": "hbrdf0r",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbrdf0r/",
        "score": 2,
        "subreddit": "investing",
        "created": 1630922821.0
    },
    {
        "author": "WolfPackWSB",
        "body": "AMD Samsung Intel Xilinx TSM &amp; ON are the major ASIC manufacturers.. Most patents are held by TSM",
        "created_utc": 1630932103,
        "id": "hbsw3lq",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbsw3lq/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630960903.0
    },
    {
        "author": "niversally",
        "body": "You have a lot of superintendent Chalmers energy when he says he’s balding not bald respect the ing. Intel is failing not failed.",
        "created_utc": 1630895736,
        "id": "hbrgu4q",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrgu4q/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630924536.0
    },
    {
        "author": "rebatomm",
        "body": "A good question on the wrong place :)\n\nYour logic is good in a long term investing plan. \n\nThis forum is a hour/daily based investors, evaluations is the last thing people here will follow.\n\nJust as example, they invest in a failed tourism company in the beginning of pandemic and most of them won lots of cash. And they will keep a obvious garbage company just because, even if it goes to zero.\n\nIf you’re a long term investor this is a good place to get daily news but never, really never, follow a advice. Except mine of course :)\n\nMy opinion, not advice: AMD is garbage and intel is not much better. Apple and Microsoft are investing in their own cpus.\nIf you want something similar check nvidia.",
        "created_utc": 1630589175,
        "id": "hbbadyk",
        "permalink": "/r/wallstreetbets/comments/pghk1y/how_are_people_buying_shares_of_amd_at_this/hbbadyk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630617975.0
    },
    {
        "author": "datatistic",
        "body": "TSMC is a beast!!! At least 2 or 3 steps ahead of any competitor. Nobody can compete with them in manufacturing and thats why most semis companies focus only on designing chips (high margins) and let TSMC do the manufacture. \n\nNo company is investing in R&amp;D like they do so don't expect Intel or anyone to come close in terms of manufacturing capabilities.",
        "created_utc": 1630686346,
        "id": "hbgp8l1",
        "permalink": "/r/StockMarket/comments/pgk9bw/is_tsm_a_strong_buy/hbgp8l1/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1630715146.0
    },
    {
        "author": "Audere-est-Facere8",
        "body": "no intel but holding 700 with you!",
        "created_utc": 1630636052,
        "id": "hbebhut",
        "permalink": "/r/pennystocks/comments/pg9ogi/daily_plays_september_02_2021/hbebhut/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1630664852.0
    },
    {
        "author": "goodoystertastegood",
        "body": "With you on Intel. If you look that their PE ratio (against the industry), it's pretty absurd how illogical the markets are pricing them. And the fundamental advantages they've had. I hope the new CEO will be able to execute what he planned. Definitely long on Intel",
        "created_utc": 1630654422,
        "id": "hbf5hfl",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbf5hfl/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1630683222.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "I mean that’s part of it but also people just want to see if they continue taking market share from INTC I’m sure. \n\nIt did just rally like +25%, although that was from a significant dip, but it’s not really “waiting” on anything. Need some catalysts. Earnings, big deals, bad news for INTC, etc.",
        "created_utc": 1630530791,
        "id": "hb8j9zx",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8j9zx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630559591.0
    },
    {
        "author": "Uesugi1989",
        "body": "Thanks to a certain stock that shall not be named, the first four months were by far better for me (intel served me well also). The recent months my small cap got bashed quite a lot but the S&amp;P 500 which still is the biggest position in my portfolio is rising continually. \n\nWith that being said, i hold around 15% cash currently by not contributing to my investements  since i believe a correction will happen the following months, just like earlier this April",
        "created_utc": 1630775013,
        "id": "hbl6bjz",
        "permalink": "/r/stocks/comments/phqq42/we_have_had_8_months_already_in_the_trading_year/hbl6bjz/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630803813.0
    },
    {
        "author": "ScruffyBelievesInGME",
        "body": "I'm out on options for a while. I think INTC will take a long time to pay off but that when it does it'll take off at a gallop.\n\nThanks for the well wishes. May the stock gods make you filthy fucking rich.",
        "created_utc": 1630961363,
        "id": "hbuogod",
        "permalink": "/r/wallstreetbets/comments/pj77jg/what_are_your_moves_tomorrow_september_07_2021/hbuogod/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630990163.0
    },
    {
        "author": "Goals16",
        "body": "Intel, Exxon, American Airlines",
        "created_utc": 1630950396,
        "id": "hbtzmyq",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbtzmyq/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630979196.0
    },
    {
        "author": "nodoze101",
        "body": "Basically there are thousands of stocks ... you try to find the good ones/ diamonds in the rough.... ones that fall under the radar and invest. Nobody (w a day job) can look at all.. at least that's why I find some good in SOME of these posts. Look at AMD, 2016/17 left for dead ... much better plan for revival and MUCH more focused and driven under Lisa Su... Intel, FUBAR and resting on their butts ...   CRNT (obviously in my opinion)  falls into this category, micro cap, conservative management and playing in a vastly growing industry, 5G ... and they have an existing competitive advantage in their 5G IP50 line (wideband) and a new System on a Chip that will provide a huge opportunity to basically corner the 5G back and mid haul market... so much so that they will be in a position to OEM the SOY to competitors .. increasing their slice of the market and vastly upping their profit margin... or getting bought out.   \n\n\nSeparating the huchksters from the information, and then doing you're own DD, is how you stand a better chance of beating the market; long term stocks w good fundimentals.. if momentum hits, great .. if not, they will still rise on their own merits once their revenue takes off.",
        "created_utc": 1630936560,
        "id": "hbt4f2t",
        "permalink": "/r/RobinHoodPennyStocks/comments/piyw11/crnt_low_volume_low_float_microcap_w_best_of/hbt4f2t/",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1630965360.0
    },
    {
        "author": "jasoncyke",
        "body": "Intel has been such a letdown since it dipped below 60 dollars.",
        "created_utc": 1630549201,
        "id": "hb9lwcm",
        "permalink": "/r/stocks/comments/pfqcg3/rstocks_daily_discussion_wednesday_sep_01_2021/hb9lwcm/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630578001.0
    },
    {
        "author": "Jacklewis98",
        "body": "I had a huge feeling Intel would be complacent, through what their management and executives actions towards AMD made me think they thought AMD would go bankrupt before they caught up",
        "created_utc": 1630602240,
        "id": "hbc5x87",
        "permalink": "/r/pennystocks/comments/pgdufv/where_do_you_get_your_info/hbc5x87/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1630631040.0
    },
    {
        "author": "LargeFatherOrtiz",
        "body": "my intc puts are ded",
        "created_utc": 1630608390,
        "id": "hbcladk",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbcladk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630637190.0
    },
    {
        "author": "Summebride",
        "body": "Stocks means stock market securities that you've surely heard of, Microsoft, Intel, JP Morgan, etc.\n\nBonds are a timed instrument where you lend your money to something and they pay it back later, with a slight amount extra.\n\nBonds have traditionally been for old people as they neither go up or down very much, and are predictable.  \n\nStocks can change in value radically and have traditionally been recommended for young  people so if you lose a lot of value, you have time to make it up.  \n\nBlended fund just means a mix of those two kinds of things.  \n\nAt 23 there's no other choice than stock.  \n\nAAR% likely means average annual return.  So if the AAR% was 4% and you have 1000 placed there, it would have gained about $40 during the year.  \n\nBunds are have recently been returning close to nothing.  Someday that might change but for now they're pretty much a worthless option for you.",
        "created_utc": 1630726021,
        "id": "hbj1hwp",
        "permalink": "/r/stocks/comments/phieda/first_time_putting_money_into_retirement/hbj1hwp/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630754821.0
    },
    {
        "author": "Trump_Ate_My_Ass",
        "body": "Which is better? 11th gen intel i7-11370H with Intel Iris XE graphics or AMD Ryzen 7 5700U with AMD Radeon graphics?",
        "created_utc": 1630535840,
        "id": "hb8tzt3",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8tzt3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630564640.0
    },
    {
        "author": "Aggressive_Watch3782",
        "body": "Quik logic is a perfect short! I lost my shirt on them for long term gain. Every earnings call wait until next quarter…Nvidia blows it out of the park regularly and it’s basically a 50/50 after. It’s gone down when you just heard the most mind numbing numbers and then it goes down the next day! I ask how is this possible! \n-People are just trimming and taking profits! \nI don’t think that’s it, why take money out of the #1 stock that invented the Metavese and A/I by a fortuitous accident! Gaming company invented the GPU, Gaming company invented A/I, ray tracing and augmented reality!  Platform is best in class command a premium. \nNot many companies out their using their BILLIONS of free cash flow for R&amp;D which unlike Intel continues to make things we never dreamed about a reality today! \nOh yeah, 350 automobile companies are signed up for their driving platform and when Tesla is forced to use it . This stock will be out of reach because it’s going to be worth the most of any company today! This new Metavese thingy is at a minimum double what the impact of the game changing internet did… whaaat, I’m barely proficient now! Us old baskets are in a world of pain trying to figure that out. It is going to change the way all of us live and work so that many more of us get to also enjoy our best lives.",
        "created_utc": 1630806721,
        "id": "hbn0uzw",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hbn0uzw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630835521.0
    },
    {
        "author": "datingadviceThrow789",
        "body": "Intel will join if China takes over Taiwan.",
        "created_utc": 1630785710,
        "id": "hblu2uy",
        "permalink": "/r/StockMarket/comments/pgxwfk/a_bit_of_fun_the_top_12_market_caps_right_now_in/hblu2uy/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630814510.0
    },
    {
        "author": "LastTradeTonight",
        "body": "I know YouTube is filled with peep calling the wheel “free” money. \n\nLong term you won’t get the same raw SPY return. \nIt’s less volatile and more income driven. Also the capital lock-up is less per contract per 100 shares. \nStraight CC on SPY makes more sense than the put side bc it can get you a 70/30 risk profile with higher income. \n\n\nIf you don’t care about income and are long-term investor than buy-hold is going to work better than the wheel. \n\nPersonally, when I run the wheel it’s on a large cap with good options volume that has some vol but over all pretty stable. In the past companies like BAC, AAPL, INTC.  I haven’t run it since last year for obvious reasons.",
        "created_utc": 1630778216,
        "id": "hbldj7b",
        "permalink": "/r/options/comments/phhqo3/options_on_3x_etfs/hbldj7b/",
        "score": 1,
        "subreddit": "options",
        "created": 1630807016.0
    },
    {
        "author": "maz-o",
        "body": "i kinda have this feeling too that intel will crush it in the coming 5 years",
        "created_utc": 1630743630,
        "id": "hbjpyd0",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbjpyd0/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630772430.0
    },
    {
        "author": "moldyjellybean",
        "body": "Yes and INTC is not a tech company.  I've been in the datacenter field for many years and I'm indifferent to brand, I'm mostly looking at energy efficiency, tech advancements.  Someone wanted to invest in Intel last week and I spelled out why not.  Originally my thesis was around 2016 when I bought AMD and Intel had Brian K was head of Intel.  This is no go and it may turn around a bit on buybacks, financial engineering they have a ton of money but it's not on the back of technology.  \n\nAny non boomer working in cloud computing/semi field can tell you INTC is not where you want to put your money.  I believe Pat is more tech inclined but it's a long road and in the mean time you can invest in AMD, TSM, NVDA, AMZN, MSFT, APPL etc if you want exposure to semi or cloud computing.  \n\n\n\nhttps://old.reddit.com/r/wallstreetbets/comments/panf65/intel_is_50_bucks_just_saying/ha79m4v/",
        "created_utc": 1630866105,
        "id": "hbpqbjw",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbpqbjw/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630894905.0
    },
    {
        "author": "SnipahShot",
        "body": "Your comments seem like you are a 5 year old.\n\n\"Do you really think the super smart people they hire are morons that will sit around and let AAPL go under?\"\n\nHundreds of companies had \"super smart\" people.  \nAre you familiar with Nokia? BlockBuster? BlackBerry? IBM?  \nHeck, even Intel has been trading downwards for almost 6 months.\n\nIt doesn't matter how many \"super smart people\" a company has, if a company fails to innovate and expand their business they will start going down.  \nThis is not the case for Apple, but it is not because of \"super smart people\", it is because they still seem to innovate and expand.\n\nAlso, do you even know what exactly Apple are planning on doing in the healthcare and EV? Who their competition is in each of these fields?",
        "created_utc": 1630869503,
        "id": "hbpxuzt",
        "permalink": "/r/stocks/comments/pifkoc/why_is_aapls_revenue_growth_declining/hbpxuzt/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630898303.0
    },
    {
        "author": "Premier_Legacy",
        "body": "Team intel . Any day now",
        "created_utc": 1630985938,
        "id": "hbw2ego",
        "permalink": "/r/wallstreetbets/comments/pj77jg/what_are_your_moves_tomorrow_september_07_2021/hbw2ego/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631014738.0
    },
    {
        "author": "ummacles123",
        "body": "99% of retail customers dont know what the hell is that 14nm, they know Intel has always been in computers and has worked. AMD fanboys need to stop using that nm excuse.",
        "created_utc": 1630931677,
        "id": "hbsve50",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbsve50/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630960477.0
    },
    {
        "author": "SoyFuturesTrader",
        "body": "You know for people who really wanted to make money they’d go spent some time doing intel work in the DoD then maybe operations officer at the CIA then go off grid and spy on all the people with info in the know \n\nThen buy SPY call and put FDs accordingly",
        "created_utc": 1630642995,
        "id": "hbep0nq",
        "permalink": "/r/wallstreetbets/comments/pgphq9/what_are_your_moves_tomorrow_september_03_2021/hbep0nq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630671795.0
    },
    {
        "author": "Afro_Superbiker",
        "body": "Great points, cheers! \n\nIntel is one of my value picks in my portfolio, and I hope their value is recognized in the future. \n\nThe stock price of AMD is ridiculous compared to them.",
        "created_utc": 1630633211,
        "id": "hbe5i3a",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbe5i3a/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1630662011.0
    },
    {
        "author": "UncleFupa",
        "body": "I work in the hardware security space... I've been to enough conferences to know for a fact the government is throwing a significant amount of money into this field.. billions...  At one point they were talking about standing up their own foundry...\n\nThe chip shortage combined with the need to have secure devices is forcing the government to be there funding into producing this stuff at home and not overseas.  \n\nIt seemed like it barely made the news, but a few weeks ago, it was announced Intel won the contract for government chips.  This was huge news to me. It's an undisclosed amount, but if I had to guess, it's not insignificant. And these are the type of contacts that once they get going, it's almost impossible to end.  Intel will be the government's arm for anything hardware related from here on out.  Sort of like Boeing or any defense company.",
        "created_utc": 1630762019,
        "id": "hbke6u9",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbke6u9/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630790819.0
    },
    {
        "author": "SnipahShot",
        "body": "1. Pfizer.\n\nThe stock dropped after the FDA approval and by the end of the year they have the booster EUA request for the general public (already requested). They have their protease inhibitor that might completely obliterate the worst thing in Covid - The infection rate, which they will request EUA in the last quarter of the year.\n\n2. Intel \n\nIntel has been beat for a while due to nothing of significance. Now they are coming with a new CPU Alder Lake which seems to surpass what AMD has to offer and also seems to be cheaper. Intel is also releasing a new gaming GPU, which is the first time for Intel to release a gaming one so it opens a brand new market for them. It also seems like this GPU will be able to compete against the top of Nvidia and AMD, while possibly being cheaper, if the CPU pricings are an indication.    \nAlso Intel is investing in their foundries with support from the US government, in order to manufacture chips outside of China.",
        "created_utc": 1630797141,
        "id": "hbmib99",
        "permalink": "/r/stocks/comments/phzp60/playing_a_stock_game_in_school_need_advice_on/hbmib99/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630825941.0
    },
    {
        "author": "donktastic",
        "body": "They key here is that Intel in a Domestic company with domestic production. AMD and NVIDIA both rely on TSMC for production. TSMC I'd great and all but they are a foreign country and this industry is to vital to national security to rely on foreign production. Also certain top secret products will never get contracted out of country either. Intel will always have that edge.",
        "created_utc": 1630766383,
        "id": "hbkn1xc",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbkn1xc/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630795183.0
    },
    {
        "author": "UncleFupa",
        "body": "The government wants domestic chip production with the ability to oversee and control the process...  Instead of doing this theirselves, they will be doing this through Intel.  There is no reason they would be doing this twice through two different companies.",
        "created_utc": 1630766841,
        "id": "hbko0yt",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbko0yt/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630795641.0
    },
    {
        "author": "Imaginary_Trader",
        "body": "Interesting comment on AMD and KISS. I bought in pre-zen too, thought it looked promising, but did in no way think that Intel would be on 14nm for so long. Maybe I didn't research enough about Intel and the going-ons there but it's still shocking to me that AMD was able to bridge such a gap.",
        "created_utc": 1630602051,
        "id": "hbc5g3u",
        "permalink": "/r/pennystocks/comments/pgdufv/where_do_you_get_your_info/hbc5g3u/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1630630851.0
    },
    {
        "author": "th3cr1t1c",
        "body": "So AVGO is trading at a 25% premium to fair value.  INTC is trading at a 29% discount to Fair Value.\n\nUsing Gordon Growth Model (Dividend Discount Model), Intel's valuation is $22 per share.\n\nThat does not make either of these two attractive recommendations at this particular time.  It also is threatened by the expectation of chip shortages to extend into 2022-23 (Morningstar Research) by which time, FOMC action on interest rates may trigger a sell-off in the broader market.\n\n(Source: Am finance data analytics professional with 25 years professional experience and investing experience.)",
        "created_utc": 1630860186,
        "id": "hbpcxzz",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbpcxzz/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630888986.0
    },
    {
        "author": "tsimtsimtsim",
        "body": "Many said the exact same about GE, ExxonMobil, IBM, Cisco, AT&amp;T, HP, Intel, etc. etc. etc.\n\nApple didn't start getting big until the iPhone came out in 2007, 14 yrs ago. Is it that hard to believe anything can happen in the next 20 years?\n\nGuess what the biggest company was 20 yrs ago in 2001... GE at 405 billion market cap. Microsoft was second at 290 billion. Apple was nowhere near top 10 at 8 billion.",
        "created_utc": 1630546630,
        "id": "hb9gk5c",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9gk5c/",
        "score": 325,
        "subreddit": "stocks",
        "created": 1630575430.0
    },
    {
        "author": "tsimtsimtsim",
        "body": "People said the same about Intel and smartphones, and we all know how that went...",
        "created_utc": 1630546680,
        "id": "hb9go2g",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9go2g/",
        "score": 140,
        "subreddit": "stocks",
        "created": 1630575480.0
    },
    {
        "author": "r2002",
        "body": "I guess my question would be -- is it hard to spot the decline? For example, can we look into the history of GE, Intel, or HP and pinpoint a specific 1-3 year time frame when we can tell they are losing marketing share and not innovating enough to be a top tier company?\n\nOr is it impossible to tell when you're the frog slowly boiling.",
        "created_utc": 1630550030,
        "id": "hb9nkhi",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9nkhi/",
        "score": 91,
        "subreddit": "stocks",
        "created": 1630578830.0
    },
    {
        "author": "nigirizushi",
        "body": "That's because Intel mobile chips were always power hungry. They couldn't get a day standby time or whatever horrible battery life it was. \n\nTesla wouldn't make their own chip, at least at first, but would just license ARM.",
        "created_utc": 1630559000,
        "id": "hba3udc",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hba3udc/",
        "score": 30,
        "subreddit": "stocks",
        "created": 1630587800.0
    },
    {
        "author": "IndividualForward177",
        "body": "All fabs are running at 100%. All they can do short term to increase profits is raise prices which TSMC and Samsung just did. TSMC is building new fabs, Intel is building, GlobalFoundries is building, Samsung just announced increase in capital spending and they will profit from it in 2-3 years as this is on average how long it takes to finish a new fab. Right now the equipment makers will be the big winners on chip shortage. AMAT and LRCX are particularly undervalued. They sold off recently along with MU because they also supply DRAM equipment and there is suspicion in the industry DRAM cycle peaked. But their DRAM manufacturing equipment is less than 10% of portfolio. Moreover, new generation of DRAM goes 3D stacks which need new manufacturing equipment. So the whole industry will 🚀",
        "created_utc": 1630685684,
        "id": "hbgnmlu",
        "permalink": "/r/wallstreetbets/comments/ph7zba/looking_for_chip_shortage_buys_here_are_the/hbgnmlu/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1630714484.0
    },
    {
        "author": "EPMD_",
        "body": "There are lots of exceptions. Amazon and Walmart have been kind of duds this year as high P/E stocks, while GM and Goldman Sachs have been low P/E All-Stars.\n\nStock | Price increase past year | P/E ratio\n:--|--:|--:\nAmazon | +2.8% | 60.4\nGoldman Sachs | +99.7% | 7.6\nWalmart | +2.8% | 41.9\nGM | +66.0% | 5.7\n\nP/E cannot be relied upon in isolation to pick good/bad buys. GM is a good example of the complication of P/E. Almost all of GM's business is internal combustion engine cars, so its P/E is using its legacy business as a base in the calculation, but all of the optimism around GM is about everything else they are doing besides internal combustion engine cars. GM itself thinks their legacy business will disappear in 10-15 years, so its P/E is nonsensical when looking forward. Their \"true\" future P/E is going to be based on earnings from non-internal combustion engine cars, and those earnings are essentially zero right now. In other words, their true forward looking P/E is much higher than 5.7. They are a future high P/E stock disguised as a current low P/E stock, but the future high P/E is going to be driven by earnings declines.\n\nIn terms of finding value, there is usually a story why a company's P/E is low. You have to find the story and see if you are okay with it. Maybe it's something like Intel where consumer sentiment is so negative due to their rivals' recent tech advantages, but the deeper you look, the more you see competitive advantages that Intel will be able to maintain and leverage going forward to build its stock price back up. Or maybe it's a low P/E like Altria because no one wants to own tobacco stocks.",
        "created_utc": 1630629887,
        "id": "hbdycab",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbdycab/",
        "score": 21,
        "subreddit": "ValueInvesting",
        "created": 1630658687.0
    },
    {
        "author": "Not_FinancialAdvice",
        "body": "&gt; That's because Intel mobile chips were always power hungry. They couldn't get a day standby time or whatever horrible battery life it was. \n\nThe Intel PXA270 XScale processor (which was an ARM implementation) in my old Palm Treo 650 gave me 2-3 days of battery life. They sold the XScale IP to Marvell later on.",
        "created_utc": 1630560235,
        "id": "hba5qyf",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hba5qyf/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1630589035.0
    },
    {
        "author": "Adept-Investing",
        "body": "Intel",
        "created_utc": 1630721175,
        "id": "hbisizr",
        "permalink": "/r/wallstreetbets/comments/ph5kv4/35k_to_69k_in_a_week/hbisizr/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1630749975.0
    },
    {
        "author": "RobotArtichoke",
        "body": "INTC is such a boomer company. How did I ever get sucked into that pile of shit when everyone here was telling me to buy AMD. Sometimes you have to admit defeat.",
        "created_utc": 1630685966,
        "id": "hbgob55",
        "permalink": "/r/wallstreetbets/comments/ph24jo/daily_discussion_thread_for_september_03_2021/hbgob55/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1630714766.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "https://www.tomshardware.com/news/intel-ice-lake-inefficient-for-cloudflare\n\nNET chooses AMD over INTC for new processors",
        "created_utc": 1630515542,
        "id": "hb7i3n8",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7i3n8/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630544342.0
    },
    {
        "author": "paq12x",
        "body": "INTC has a stock split 2:1 at the end of July 2000.\n\nIn the last 10 years, return for INTC is 14% annually or a total of 268% in 10 years.  \n\nNot bad at all.",
        "created_utc": 1630760951,
        "id": "hbkc7t1",
        "permalink": "/r/stocks/comments/phq0mw/is_v_visa_a_good_long_term_hold_for_5_years_or/hbkc7t1/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630789751.0
    },
    {
        "author": "Xx_Majesticface_xX",
        "body": "TSMC is a fairly well known stock, however, I’m placing my bets on Global Foundries. While there were talks a few months ago in regards to Intel acquiring them, a lot of electronics that don’t require high end semi conductors(7nm TSMC, 8nm Samsung, 10nm Intel) are made using cheap, larger nodes that are less efficient. Global foundries failed to develop high end chips after they abandoned their rnd, but they hold a 15% market share(at last check) in markets which use lower grade nodes. Best part is, that they are supposedly going public in 2022. I personally think that this is a wise investment, though a rather obvious one, as any company which is trusted by the US government and hold a market share in a sector worth billions is a simple stock to buy",
        "created_utc": 1630714543,
        "id": "hbiflpp",
        "permalink": "/r/wallstreetbets/comments/phgqi2/lets_talk_about_tsm_stock_taiwan_semiconductor/hbiflpp/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630743343.0
    },
    {
        "author": "Arturion34",
        "body": "This is big, but INTC just started making similar plans to blow up chio production. Overall, i think both are solid buys and own both",
        "created_utc": 1630613049,
        "id": "hbcx25b",
        "permalink": "/r/stocks/comments/pgk8sz/is_tsm_a_strong_buy/hbcx25b/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630641849.0
    },
    {
        "author": "Both-Ad-7757",
        "body": "This is a fantastic explanation and I’m with you on Intel. Very well put good sir!",
        "created_utc": 1630630214,
        "id": "hbdz1us",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbdz1us/",
        "score": 6,
        "subreddit": "ValueInvesting",
        "created": 1630659014.0
    },
    {
        "author": "daaammmN",
        "body": "It all depends on if you overpaid or not.\n\nIntel was almost at the 80$ mark in the 2000s.\n\nSince then it has grown a lot, but still, 20 years later and it never reached its all time high.\n\nThis just proves that you can overpay for growth.\nIf you are overpaying, you might not see an increase for many years to come\n\nI haven't dug into MasterCard, but I did for Visa.\n\nIMO, Visa (and most of the market) is overpriced. The growth that Visa is projecting (mid teens) for the next 5 years is already priced in.\n\nIf the bull market continues, the stock price might increase, but it's just a matter of time before the correction arrives and reality kicks in.\n\nI want to own Visa, I like it very much. They have been buying back shares like crazy, which is awesome. It's on my watchlist. But it still has to drop a lot for me to be a buyer. I have no doubt that it will be a buy at some point in the future though.",
        "created_utc": 1630758713,
        "id": "hbk8hho",
        "permalink": "/r/stocks/comments/phq0mw/is_v_visa_a_good_long_term_hold_for_5_years_or/hbk8hho/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630787513.0
    },
    {
        "author": "shashwat73",
        "body": "I added V and INTC. Low PE ratios, great companies, and good technicals on both",
        "created_utc": 1630680824,
        "id": "hbgbvlk",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbgbvlk/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630709624.0
    },
    {
        "author": "JRshoe1997",
        "body": "INTC, LMT, and TGT",
        "created_utc": 1630674506,
        "id": "hbfxlgg",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbfxlgg/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630703306.0
    },
    {
        "author": "meowman3000",
        "body": "Intel is getting government money to setup fabs in the US, as part of an infrastructure bill.  I could see them treating TSMC like they do Huawei in the future if Intel gets enough capacity.  I could see a strong case for national security, in which case Nvidia and AMD would shift to Intel, assuming the fabs are competitive.\n\nA small chance at least.",
        "created_utc": 1630637279,
        "id": "hbee1ue",
        "permalink": "/r/stocks/comments/pgk8sz/is_tsm_a_strong_buy/hbee1ue/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630666079.0
    },
    {
        "author": "sweYoda",
        "body": "Coca-Cola, Kroger, Tyson Foods, Disney, Google, Intel",
        "created_utc": 1630640934,
        "id": "hbela50",
        "permalink": "/r/investing/comments/pgo4l0/anybody_hedging_heavily_against_a_downtown/hbela50/",
        "score": 4,
        "subreddit": "investing",
        "created": 1630669734.0
    },
    {
        "author": "noobc4k3",
        "body": "Why is INTC  dumping AH?",
        "created_utc": 1630531290,
        "id": "hb8kdol",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8kdol/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630560090.0
    },
    {
        "author": "notmsnewty",
        "body": "ALYI - hemp batteries are the future. I hope this is the company.  Anyone else have intel?",
        "created_utc": 1630625285,
        "id": "hbdonrm",
        "permalink": "/r/pennystocks/comments/pg9ogi/daily_plays_september_02_2021/hbdonrm/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1630654085.0
    },
    {
        "author": "datingadviceThrow789",
        "body": "INTC and CLF are the best govt plays moving forward. Love them both.",
        "created_utc": 1630600645,
        "id": "hbc1uwi",
        "permalink": "/r/wallstreetbets/comments/pgl9ng/cliffs_natural_resources_inc_clf_huge_potential/hbc1uwi/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630629445.0
    },
    {
        "author": "GraysonMA",
        "body": "When you buy leaps you are taking on a lot of vega exposure which can add significant risk to your portfolio. However, vega gives you a second way to win if you stick to companies that have IVR/IV% near their 52 week lows. [Barchart is a great resource for finding these.](https://www.barchart.com/options/iv-rank-percentile/stocks?orderBy=optionsWeightedImpliedVolatility&amp;orderDir=asc)\nI also choose underlyings that have low correlation with each other. This keeps things a little less volatile which is especially important using any type of leverage. [PortfolioVisualizer has a great tool for this.](https://www.portfoliovisualizer.com/asset-correlations?s=y&amp;symbols=SPY+TLT+KO+PG+D+INTC+MCD+VZ+FB+MSFT+NVDA+LLY+NEE&amp;timePeriod=2&amp;tradingDays=60&amp;months=36). Leaps I bought recently are in PG, INTC, FB, D, MSFT, KO, VZ, and MCD. LLY is an solid low correlation pick but I’m waiting for a dip in IV.",
        "created_utc": 1630675696,
        "id": "hbg03gf",
        "permalink": "/r/options/comments/pgu6ms/leaps_recommendations/hbg03gf/",
        "score": 3,
        "subreddit": "options",
        "created": 1630704496.0
    },
    {
        "author": "myglasstrip",
        "body": "Take a look at the Intel 20 year chart and tell me when intc got back to its last ath of 73.94 a share or whatever.",
        "created_utc": 1630538488,
        "id": "hb8zbv3",
        "permalink": "/r/wallstreetbets/comments/pfyl89/why_are_you_not_buying_ko_leaps/hb8zbv3/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630567288.0
    },
    {
        "author": "Macre117",
        "body": "Intel",
        "created_utc": 1630514532,
        "id": "hb7fkbu",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7fkbu/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630543332.0
    },
    {
        "author": "shortyafter",
        "body": "I had been holding out since I started in February, but over the last few months lots of great buying opportunities have come up.  I am now 100% invested and will continue to average in my minuscule salary over the coming months and years.\n\nI have a retirement account that is made up of index funds.\n\nIn addition, this year I designed a defensive, value portfolio which hopefully gives me some protection on the downside.  I may not beat the S+P but I feel like I have good capital protection plus steady and reliable returns from dividends.  Rough percentages:\n\nBUD - Anheuser Busch Inbev - 5%\n\nADM - Archer-Daniels-Midland- 3.75% (agriculture company)\n\nBNS - Bank of Novia Scotia - 6%\n\nBAYRY - Bayer AG - 3%\n\nBTI - British American Tobacco - 10%\n\nKOF - Coca Cola Femsa - 6%\n\nFDP - Fresh Del Monte - 6%\n\nIBDRY - Iberdrola - 4.5% (Spanish renewable energy)\n\nIMBBY - Imperial brands - 9% (tobacco)\n\nINTC - Intel Corp - 6.5%\n\nLMT - Lockheed Martin - 9%\n\nLOGI - Logitech - 5%\n\nNTDOY - Nintendo - 8%\n\nPAAS - Pan American Silver Corp - 1.5%\n\nREPYY - Repsol - 8% (Spanish energy)\n\nUVV - Universal Corp - 6% (tobacco leaf grower)\n\nWPC - WP Carey - 1.5% (REIT)\n\nI'd like to round out some of my smaller positions, and I'd also like to pick up some mega cap tech (FAANG) in the future.  I bought what I could in this crazy market by looking for deals.",
        "created_utc": 1630677381,
        "id": "hbg3t08",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hbg3t08/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630706181.0
    },
    {
        "author": "agyria",
        "body": "Nah PayPal is intel while SQ is AMd",
        "created_utc": 1630623295,
        "id": "hbdkfxu",
        "permalink": "/r/wallstreetbets/comments/pgphq9/what_are_your_moves_tomorrow_september_03_2021/hbdkfxu/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630652095.0
    },
    {
        "author": "throughthehazel",
        "body": "INTC 50s 9/17 poots",
        "created_utc": 1630536020,
        "id": "hb8ud2v",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8ud2v/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630564820.0
    },
    {
        "author": "Stoli1387",
        "body": "Intel if you're patient",
        "created_utc": 1630692101,
        "id": "hbh31da",
        "permalink": "/r/stocks/comments/ph1s4s/rstocks_daily_discussion_fundamentals_friday_sep/hbh31da/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630720901.0
    },
    {
        "author": "828stocks",
        "body": "Thank you for my tasty dividend, INTC.  You might be fucking me, but at least you're buying dinner.",
        "created_utc": 1630593293,
        "id": "hbbjvvx",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbbjvvx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630622093.0
    },
    {
        "author": "DongKelly32",
        "body": "Look up AS ML (pretty sure they’re private but just being safe). They make the machine that makes shit for Intel, TSMC, AMD, NVDA, etc. and it costs $150m+",
        "created_utc": 1630698475,
        "id": "hbhhl5g",
        "permalink": "/r/wallstreetbets/comments/ph24jo/daily_discussion_thread_for_september_03_2021/hbhhl5g/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630727275.0
    },
    {
        "author": "Afro_Superbiker",
        "body": "Here's hoping. I don't think their gpu will be aimed at the gaming market, so I don't think it will garner the same hype that a new release from Nvidia does.\n\nOver time though, especially with investment from the u.s with the aims of developing their u.s fabs, Intel will gain new life.",
        "created_utc": 1630714059,
        "id": "hbieok5",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbieok5/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1630742859.0
    },
    {
        "author": "mistermc90",
        "body": "Tip: just look where the cheap free cashflow to the firm / shareprice is!!!\n \n-BTI, ITB (big tobacco in general) //\n-INTC (semiconductor) //\n-RDSB (big oil/gas cashflow machine) //\n-VZ (telco with strong free CF in an oligopolistic market) //\n-FRE (strong german health company) //\n-VRTX (tremendous value drug company - 10/10 financials)",
        "created_utc": 1630688427,
        "id": "hbguas9",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbguas9/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630717227.0
    },
    {
        "author": "Parallelism09191989",
        "body": "Intel and TSM\n\nEverybody overreacting to AMD leapfrogging Intel.",
        "created_utc": 1630685309,
        "id": "hbgmpm0",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbgmpm0/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630714109.0
    },
    {
        "author": "spongesquare",
        "body": "What happened to Intel?",
        "created_utc": 1630516952,
        "id": "hb7ljkv",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7ljkv/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630545752.0
    },
    {
        "author": "Overhaul2977",
        "body": "AMD’s profit margin is pretty good, they are taking market share from intel and approaching Nvidia in performance for their GPUs, and they are innovating well under current management. The problem with your analysis is you’re looking at book value, you need to look at future growth and both companies they can take market share have a fair amount higher market cap, meaning it has plenty of space to grow if things keep going well for them. The stock market cares about future growth, not too much on past performance.\n\nTo give you a basic idea of investing, there are four types of companies - Dogs, Cash Cows, Question Marks, and Stars. AMD is at the Question Mark phase that is almost to Star. They are taking market share in a fast growing area. The typical investor strategy in that situation is to “buy”.",
        "created_utc": 1630588805,
        "id": "hbb9kpu",
        "permalink": "/r/wallstreetbets/comments/pghk1y/how_are_people_buying_shares_of_amd_at_this/hbb9kpu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630617605.0
    },
    {
        "author": "rebatomm",
        "body": "A good question on the wrong place :)\n\nYour logic is good in a long term investing plan. \n\nThis forum is a hour/daily based investors, evaluations is the last thing people here will follow.\n\nJust as example, they invest in a failed tourism company in the beginning of pandemic and most of them won lots of cash. And they will keep a obvious garbage company just because, even if it goes to zero.\n\nIf you’re a long term investor this is a good place to get daily news but never, really never, follow a advice. Except mine of course :)\n\nMy opinion, not advice: AMD is garbage and intel is not much better. Apple and Microsoft are investing in their own cpus.\nIf you want something similar check nvidia.",
        "created_utc": 1630589175,
        "id": "hbbadyk",
        "permalink": "/r/wallstreetbets/comments/pghk1y/how_are_people_buying_shares_of_amd_at_this/hbbadyk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630617975.0
    },
    {
        "author": "datatistic",
        "body": "TSMC is a beast!!! At least 2 or 3 steps ahead of any competitor. Nobody can compete with them in manufacturing and thats why most semis companies focus only on designing chips (high margins) and let TSMC do the manufacture. \n\nNo company is investing in R&amp;D like they do so don't expect Intel or anyone to come close in terms of manufacturing capabilities.",
        "created_utc": 1630686346,
        "id": "hbgp8l1",
        "permalink": "/r/StockMarket/comments/pgk9bw/is_tsm_a_strong_buy/hbgp8l1/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1630715146.0
    },
    {
        "author": "Audere-est-Facere8",
        "body": "no intel but holding 700 with you!",
        "created_utc": 1630636052,
        "id": "hbebhut",
        "permalink": "/r/pennystocks/comments/pg9ogi/daily_plays_september_02_2021/hbebhut/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1630664852.0
    },
    {
        "author": "goodoystertastegood",
        "body": "With you on Intel. If you look that their PE ratio (against the industry), it's pretty absurd how illogical the markets are pricing them. And the fundamental advantages they've had. I hope the new CEO will be able to execute what he planned. Definitely long on Intel",
        "created_utc": 1630654422,
        "id": "hbf5hfl",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbf5hfl/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1630683222.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "I mean that’s part of it but also people just want to see if they continue taking market share from INTC I’m sure. \n\nIt did just rally like +25%, although that was from a significant dip, but it’s not really “waiting” on anything. Need some catalysts. Earnings, big deals, bad news for INTC, etc.",
        "created_utc": 1630530791,
        "id": "hb8j9zx",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8j9zx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630559591.0
    },
    {
        "author": "jasoncyke",
        "body": "Intel has been such a letdown since it dipped below 60 dollars.",
        "created_utc": 1630549201,
        "id": "hb9lwcm",
        "permalink": "/r/stocks/comments/pfqcg3/rstocks_daily_discussion_wednesday_sep_01_2021/hb9lwcm/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630578001.0
    },
    {
        "author": "Jacklewis98",
        "body": "I had a huge feeling Intel would be complacent, through what their management and executives actions towards AMD made me think they thought AMD would go bankrupt before they caught up",
        "created_utc": 1630602240,
        "id": "hbc5x87",
        "permalink": "/r/pennystocks/comments/pgdufv/where_do_you_get_your_info/hbc5x87/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1630631040.0
    },
    {
        "author": "LargeFatherOrtiz",
        "body": "my intc puts are ded",
        "created_utc": 1630608390,
        "id": "hbcladk",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbcladk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630637190.0
    },
    {
        "author": "Summebride",
        "body": "Stocks means stock market securities that you've surely heard of, Microsoft, Intel, JP Morgan, etc.\n\nBonds are a timed instrument where you lend your money to something and they pay it back later, with a slight amount extra.\n\nBonds have traditionally been for old people as they neither go up or down very much, and are predictable.  \n\nStocks can change in value radically and have traditionally been recommended for young  people so if you lose a lot of value, you have time to make it up.  \n\nBlended fund just means a mix of those two kinds of things.  \n\nAt 23 there's no other choice than stock.  \n\nAAR% likely means average annual return.  So if the AAR% was 4% and you have 1000 placed there, it would have gained about $40 during the year.  \n\nBunds are have recently been returning close to nothing.  Someday that might change but for now they're pretty much a worthless option for you.",
        "created_utc": 1630726021,
        "id": "hbj1hwp",
        "permalink": "/r/stocks/comments/phieda/first_time_putting_money_into_retirement/hbj1hwp/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630754821.0
    },
    {
        "author": "Trump_Ate_My_Ass",
        "body": "Which is better? 11th gen intel i7-11370H with Intel Iris XE graphics or AMD Ryzen 7 5700U with AMD Radeon graphics?",
        "created_utc": 1630535840,
        "id": "hb8tzt3",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8tzt3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630564640.0
    },
    {
        "author": "maz-o",
        "body": "i kinda have this feeling too that intel will crush it in the coming 5 years",
        "created_utc": 1630743630,
        "id": "hbjpyd0",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbjpyd0/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630772430.0
    },
    {
        "author": "SoyFuturesTrader",
        "body": "You know for people who really wanted to make money they’d go spent some time doing intel work in the DoD then maybe operations officer at the CIA then go off grid and spy on all the people with info in the know \n\nThen buy SPY call and put FDs accordingly",
        "created_utc": 1630642995,
        "id": "hbep0nq",
        "permalink": "/r/wallstreetbets/comments/pgphq9/what_are_your_moves_tomorrow_september_03_2021/hbep0nq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630671795.0
    },
    {
        "author": "Afro_Superbiker",
        "body": "Great points, cheers! \n\nIntel is one of my value picks in my portfolio, and I hope their value is recognized in the future. \n\nThe stock price of AMD is ridiculous compared to them.",
        "created_utc": 1630633211,
        "id": "hbe5i3a",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbe5i3a/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1630662011.0
    },
    {
        "author": "UncleFupa",
        "body": "I work in the hardware security space... I've been to enough conferences to know for a fact the government is throwing a significant amount of money into this field.. billions...  At one point they were talking about standing up their own foundry...\n\nThe chip shortage combined with the need to have secure devices is forcing the government to be there funding into producing this stuff at home and not overseas.  \n\nIt seemed like it barely made the news, but a few weeks ago, it was announced Intel won the contract for government chips.  This was huge news to me. It's an undisclosed amount, but if I had to guess, it's not insignificant. And these are the type of contacts that once they get going, it's almost impossible to end.  Intel will be the government's arm for anything hardware related from here on out.  Sort of like Boeing or any defense company.",
        "created_utc": 1630762019,
        "id": "hbke6u9",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbke6u9/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630790819.0
    },
    {
        "author": "Imaginary_Trader",
        "body": "Interesting comment on AMD and KISS. I bought in pre-zen too, thought it looked promising, but did in no way think that Intel would be on 14nm for so long. Maybe I didn't research enough about Intel and the going-ons there but it's still shocking to me that AMD was able to bridge such a gap.",
        "created_utc": 1630602051,
        "id": "hbc5g3u",
        "permalink": "/r/pennystocks/comments/pgdufv/where_do_you_get_your_info/hbc5g3u/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1630630851.0
    },
    {
        "author": "EatMeatPeeps",
        "body": "Hear me out, but, long term poots on Intel.",
        "created_utc": 1630505522,
        "id": "hb6tqzy",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb6tqzy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630534322.0
    },
    {
        "author": "fuzedz",
        "body": "HDVY, do your own research. Possible large settlement with INTC.",
        "created_utc": 1630591928,
        "id": "hbbgnae",
        "permalink": "/r/pennystocks/comments/pg9ogi/daily_plays_september_02_2021/hbbgnae/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1630620728.0
    },
    {
        "author": "vgraminco",
        "body": "\"for a long time has essentially been complacent in its innovation\" ? just wondering how to reach this conclusion. I am comparing R&amp;D spending of Intel and AMD, Intel R&amp;D spending is 19% of its revenue and AMD is 17%. Converting to $ amount, Intel R&amp;D is $3B in Q2/21 and AMD is $659M in Q2/21.",
        "created_utc": 1630717472,
        "id": "hbilcvs",
        "permalink": "/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/hbilcvs/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630746272.0
    },
    {
        "author": "NATbagholder",
        "body": "Intel is already building new fabs, but I can see them building more if someone else will pay.",
        "created_utc": 1630732252,
        "id": "hbjblmc",
        "permalink": "/r/wallstreetbets/comments/phcns0/weekend_discussion_thread_for_the_weekend_of/hbjblmc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630761052.0
    },
    {
        "author": "wc_helmets",
        "body": "Yes, but I just started learning about value investing over the last few months.  I do an 80/20 split with 80% going into an ETF portfolio that's anchored by VOO but leans small cap value with exposure into developing and emerging markets and some long term bonds.  I just dump into that every paycheck and rearrange once a quarter to keep my ratios about the same.  The other 20% goes into individual stock picks.  Really, I think of individual stocks, my biggest one is Intel, and it's only 1% of my entire portfolio.  I want to test this out for a few years and maybe slowly shift the balance if I feel like I'm getting the hang of it.  I believe the market is overvalued right now, but I believe, in general, in the idea that the market is where you should invest your money.  I'm still going 25 or so years until retirement so I got time to really dig into some of the companies I'd like to when a correction happens.\n\nI also run a magic formula investor portfolio with about $600.00, just to compare how it looks with next year, have about $350.00 invested in crypto, and an account for daytrades and options plays that I do not feed but only use the money that are in them.  There's something to be said for scratching some itches but keeping those itches from your main money.",
        "created_utc": 1630533566,
        "id": "hb8pb0m",
        "permalink": "/r/ValueInvesting/comments/pfv9wi/do_you_keep_a_large_portion_of_your_investment_in/hb8pb0m/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1630562366.0
    },
    {
        "author": "NewPairOfShoes",
        "body": "I understand the DDR5 stance, but adoption of that won't be widespread for another year at least.  People need new boards, memory and CPUs to accomodate the new tech.  If Intel can make a case to move to 12th gen and AMD for the new Zen, then Corsair will be in a good position.",
        "created_utc": 1630607839,
        "id": "hbcjwzx",
        "permalink": "/r/wallstreetbets/comments/pgjxjj/50k_crsr_yolo/hbcjwzx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630636639.0
    },
    {
        "author": "masteroflich",
        "body": "Carbios 14.95%\n\nDisney 10%\n\nShopify 8.59%\n\nLG Electronics 8.53%\n\nTencent 8.02%\n\nSofi 6.28%\n\nSiemens Energy 5.81%\n\nSony 4.99%\n\nAlibaba 4.71%\n\nCD Projekt 4.69%\n\nIntel 4.43%\n\nClean Energy ETF 3.37%\n\nSamsung SDI 3.65%\n\nTaiwan Semi 3.08%\n\nApple 2.98%\n\nBayer 2.49%\n\nBlackberry 2.45%\n\nCitius Pharmaceutics 0.58%\n\nIQIYI 0.03%\n\nTrivago 0.01%\n\n&amp;#x200B;\n\nI recently sold some Nokia and Varta shares.\n\nBuilding currently a AutoDesk position and want overall a bit more exposure to sume blue chips companies (Adobe, Google, Apple)",
        "created_utc": 1630760764,
        "id": "hbkbvzq",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hbkbvzq/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630789564.0
    },
    {
        "author": "papasmurftp",
        "body": "Yes he's looking for some intel",
        "created_utc": 1630514673,
        "id": "hb7fx2t",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7fx2t/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630543473.0
    },
    {
        "author": "BooBeef",
        "body": "Yes but it would have to grow 1500% for its current evaluation to be a fair price. It’s market cap is more then half of Intel’s but AMD makes 6 billion in revenue while INTEL makes 78 billion in revenue. So it’s potential growth is more then priced in, it can only go down from here",
        "created_utc": 1630591171,
        "id": "hbbewh1",
        "permalink": "/r/wallstreetbets/comments/pghk1y/how_are_people_buying_shares_of_amd_at_this/hbbewh1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630619971.0
    },
    {
        "author": "shortyafter",
        "body": "You don't have anything like Tesla or ARK funds, which is good.  I'm not deeply familiar with most of these companies, so I don't know what their revenue streams or growth prospects look like.  What I can say is that a lot of those names have been trading very high lately... AMD, Nvidia, TSM, ASML, etc. Those companies in particular all seem to have bright futures, but if there is any significant correction in tech stocks, you're very exposed, especially if you bought recently at high valuations.  You'll have very little margin of safety.\n\nAnd if there's any broader economic disruption, it's possible that not all of these companies make it out safe and sound, or at least as healthy as you'd like to seem them given current valuations.\n\nFor example, even good companies like Cisco didn't make it out in one piece from the dot-com bubble.  And old industry leaders like IBM and Intel have gotten hammered in the past two decades, while Microsoft made something of a surprise comeback after being declared dead around 2012.\n\nThe point is that if you've bought growth stories, that's OK, but it seems your whole portfolio is growth stories.  It's forward-looking.  Which is the idea, in a way, but IMO you want at least some of your portfolio dedicated to something that is solid in the present, and doesn't rely on a growth story in order to generate or even maintain returns.  The benefit of an ETF is you get a bit of everything, and even QQQ is quite diversified compared to your portfolio.  \n\nI'm new but this is my understanding of things.  I hope it made sense.",
        "created_utc": 1630586622,
        "id": "hbb54en",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hbb54en/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630615422.0
    },
    {
        "author": "BooBeef",
        "body": "Look at intel before 2017 - 2018. They were never increasing core counts on there desktop processors, and only did so at the end of 2018 early 2019 when AMD started releasing there RYZN and Thread-ripper  chipsets",
        "created_utc": 1630717596,
        "id": "hbillm3",
        "permalink": "/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/hbillm3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630746396.0
    },
    {
        "author": "Xerxes897",
        "body": "AMD is like a 2 year play at minimum. Got to be patient while they steal all the market share from Intel.",
        "created_utc": 1630691489,
        "id": "hbh1lmz",
        "permalink": "/r/wallstreetbets/comments/ph24jo/daily_discussion_thread_for_september_03_2021/hbh1lmz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630720289.0
    },
    {
        "author": "notnagash",
        "body": "According to an article on NASDAQ Intel is 63% undervalued, i am pretty new to active investing and don't know mucj but I am expecting Intel to go pretty high if their gpu doesn't suck, maybe not as ridiculous as AMD but probably over their intrinsic value",
        "created_utc": 1630669948,
        "id": "hbfp5lm",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbfp5lm/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1630698748.0
    },
    {
        "author": "Overhaul2977",
        "body": "Yes however intel’s revenue is primarily driven by long-term contracts that were written when they were ahead. AMD is now ahead and those contracts will expire. A lot of investors expect AMD to win those contracts when they come up for renewal. Will that happen? Who knows. A lot of US govt. contracts are still being renewed with intel because intel manufacters their chips in the US.\n\nI personally don’t see AMD as over-priced for its potential, but I do believe most of its potential is now priced-in unless a major positive event occurs. I see more downside risk in the event intel makes a breakthrough (although that is highly unlikely for awhile) or a negative event occurs. \n\nRegardless, AMD’s run up is backed by fundamentals and reasonable expectations. There are definitely major downside risks since it has a P/E of almost 40, but it can definitely grow into that P/E if it continues its current trajectory. The biggest problem with AMD is their value isn’t primary driven by its own performance, but the poor performance of its competitor, which makes the investment a bit risky.",
        "created_utc": 1630602453,
        "id": "hbc6gic",
        "permalink": "/r/wallstreetbets/comments/pghk1y/how_are_people_buying_shares_of_amd_at_this/hbc6gic/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630631253.0
    },
    {
        "author": "MonoDun",
        "body": "&gt;**Someone close to Larry Fink told a friend of a friend he says 'Merv what if Tesla, Amazon, Intel collab on starting a datacenter, GPU, AI chip plant here in Texas, Fink's good for a billion, Biden will get about 10 billion approved and the other players add 9 billion poof no more chip shortage, in fact we flood the market to bankrupt the competition [Fink loved that part] Bidens going to announce it on Tuesday at 9:00 am, to calm the market, along with the rest of the new stimulus package.**   \n  \nThis is purely anecdotal, you have the right but not the obligation to believe it or not.",
        "created_utc": 1630730923,
        "id": "hbj9liu",
        "permalink": "/r/wallstreetbets/comments/phcns0/weekend_discussion_thread_for_the_weekend_of/hbj9liu/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1630759723.0
    },
    {
        "author": "Xx_Majesticface_xX",
        "body": "No, I’m saying that there’s going to be a new stock in 2022 that will allow you to have access to a company with 15% of the market share in regards to cheap consumer electronics. I’m sorry but TSMC is a stock that every investors knows about, it’s not a bad stock but you aren’t going to get good returns. Invest in it, but I’m telling you about a stock that will probably succeed as GF isn’t going away. You obviously aren’t involved with computer and consumer electronics to know that it isn’t just TSMC, Samsung, and Intel, and that it isn’t just cpus and gpus, cars and fridges. The market is much larger than you think, and there are other companies you should be looking at. Invest in TSMC, you’ll still get a return, but don’t insult me over a stock that will also get you returns that’s opening in a few months. TSMC isn’t the next dodge coin, it’s basically apple or Amazon, a stock which won’t go down in price but also won’t see a huge jump as people have already invested in it.",
        "created_utc": 1630715301,
        "id": "hbih3j5",
        "permalink": "/r/wallstreetbets/comments/phgqi2/lets_talk_about_tsm_stock_taiwan_semiconductor/hbih3j5/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1630744101.0
    },
    {
        "author": "VolatilityBox",
        "body": "Extremely strong business but the p/e overshoots their growth slightly. I know it's a long shot but Intel might catch up as a secondary player and take market share from them, given that they're subsidized by the US govt.",
        "created_utc": 1630618395,
        "id": "hbd9xy7",
        "permalink": "/r/stocks/comments/pgk8sz/is_tsm_a_strong_buy/hbd9xy7/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1630647195.0
    },
    {
        "author": "-bjorn",
        "body": "Intel on what? 👀 ^^/s",
        "created_utc": 1630516989,
        "id": "hb7lmw0",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7lmw0/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1630545789.0
    },
    {
        "author": "silentbrownman",
        "body": "What just happened to intel?",
        "created_utc": 1630516804,
        "id": "hb7l6be",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7l6be/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1630545604.0
    },
    {
        "author": "tsimtsimtsim",
        "body": "Many said the exact same about GE, ExxonMobil, IBM, Cisco, AT&amp;T, HP, Intel, etc. etc. etc.\n\nApple didn't start getting big until the iPhone came out in 2007, 14 yrs ago. Is it that hard to believe anything can happen in the next 20 years?\n\nGuess what the biggest company was 20 yrs ago in 2001... GE at 405 billion market cap. Microsoft was second at 290 billion. Apple was nowhere near top 10 at 8 billion.",
        "created_utc": 1630546630,
        "id": "hb9gk5c",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9gk5c/",
        "score": 325,
        "subreddit": "stocks",
        "created": 1630575430.0
    },
    {
        "author": "tsimtsimtsim",
        "body": "People said the same about Intel and smartphones, and we all know how that went...",
        "created_utc": 1630546680,
        "id": "hb9go2g",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9go2g/",
        "score": 140,
        "subreddit": "stocks",
        "created": 1630575480.0
    },
    {
        "author": "r2002",
        "body": "I guess my question would be -- is it hard to spot the decline? For example, can we look into the history of GE, Intel, or HP and pinpoint a specific 1-3 year time frame when we can tell they are losing marketing share and not innovating enough to be a top tier company?\n\nOr is it impossible to tell when you're the frog slowly boiling.",
        "created_utc": 1630550030,
        "id": "hb9nkhi",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hb9nkhi/",
        "score": 91,
        "subreddit": "stocks",
        "created": 1630578830.0
    },
    {
        "author": "No_Blackberry_1870",
        "body": "For example look at the all time charts for Cisco and intel. In the 2000s everyone over paid for the growth potential those companies had and despite those companies doing the best they ever had in terms of revenues today. Their stock prices have still not reached their 2000s peaks.",
        "created_utc": 1630908191,
        "id": "hbs26pl",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbs26pl/",
        "score": 55,
        "subreddit": "stocks",
        "created": 1630936991.0
    },
    {
        "author": "crepeblanket",
        "body": "What was the news about Intel delaying their govt deliveries so they bought some AMD and NVIDIA chips while waiting for Intel to come through? Intel being the defacto govt chip supplier doesn’t sound like an absolutely sure thing long term",
        "created_utc": 1630765009,
        "id": "hbkk4ay",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbkk4ay/",
        "score": 34,
        "subreddit": "investing",
        "created": 1630793809.0
    },
    {
        "author": "No_Blackberry_1870",
        "body": "That’s irrelevant to my example of over paying for growth. 21 years ago those companies were the Nvidia and amd of their times. Also intel literally makes double what amd and nvidia make combined lol.",
        "created_utc": 1630909644,
        "id": "hbs48wh",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbs48wh/",
        "score": 31,
        "subreddit": "stocks",
        "created": 1630938444.0
    },
    {
        "author": "nigirizushi",
        "body": "That's because Intel mobile chips were always power hungry. They couldn't get a day standby time or whatever horrible battery life it was. \n\nTesla wouldn't make their own chip, at least at first, but would just license ARM.",
        "created_utc": 1630559000,
        "id": "hba3udc",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hba3udc/",
        "score": 30,
        "subreddit": "stocks",
        "created": 1630587800.0
    },
    {
        "author": "jubothecat",
        "body": "Intel said it was going to build the world's fastest super computer like 10 years ago. Now, they were supposed to deliver it years ago, and they still don't have the technology to make what they said they would. Even if released today it would now only be like the 3rd fastest because they waited too long.\nTldr: even if Intel has these new government contracts, they are so far behind that they have a lot longer of a journey to be the best chip maker than people think (most laymen don't even know AMD is better right now).",
        "created_utc": 1630765482,
        "id": "hbkl4bs",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbkl4bs/",
        "score": 28,
        "subreddit": "investing",
        "created": 1630794282.0
    },
    {
        "author": "IndividualForward177",
        "body": "All fabs are running at 100%. All they can do short term to increase profits is raise prices which TSMC and Samsung just did. TSMC is building new fabs, Intel is building, GlobalFoundries is building, Samsung just announced increase in capital spending and they will profit from it in 2-3 years as this is on average how long it takes to finish a new fab. Right now the equipment makers will be the big winners on chip shortage. AMAT and LRCX are particularly undervalued. They sold off recently along with MU because they also supply DRAM equipment and there is suspicion in the industry DRAM cycle peaked. But their DRAM manufacturing equipment is less than 10% of portfolio. Moreover, new generation of DRAM goes 3D stacks which need new manufacturing equipment. So the whole industry will 🚀",
        "created_utc": 1630685684,
        "id": "hbgnmlu",
        "permalink": "/r/wallstreetbets/comments/ph7zba/looking_for_chip_shortage_buys_here_are_the/hbgnmlu/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1630714484.0
    },
    {
        "author": "EPMD_",
        "body": "There are lots of exceptions. Amazon and Walmart have been kind of duds this year as high P/E stocks, while GM and Goldman Sachs have been low P/E All-Stars.\n\nStock | Price increase past year | P/E ratio\n:--|--:|--:\nAmazon | +2.8% | 60.4\nGoldman Sachs | +99.7% | 7.6\nWalmart | +2.8% | 41.9\nGM | +66.0% | 5.7\n\nP/E cannot be relied upon in isolation to pick good/bad buys. GM is a good example of the complication of P/E. Almost all of GM's business is internal combustion engine cars, so its P/E is using its legacy business as a base in the calculation, but all of the optimism around GM is about everything else they are doing besides internal combustion engine cars. GM itself thinks their legacy business will disappear in 10-15 years, so its P/E is nonsensical when looking forward. Their \"true\" future P/E is going to be based on earnings from non-internal combustion engine cars, and those earnings are essentially zero right now. In other words, their true forward looking P/E is much higher than 5.7. They are a future high P/E stock disguised as a current low P/E stock, but the future high P/E is going to be driven by earnings declines.\n\nIn terms of finding value, there is usually a story why a company's P/E is low. You have to find the story and see if you are okay with it. Maybe it's something like Intel where consumer sentiment is so negative due to their rivals' recent tech advantages, but the deeper you look, the more you see competitive advantages that Intel will be able to maintain and leverage going forward to build its stock price back up. Or maybe it's a low P/E like Altria because no one wants to own tobacco stocks.",
        "created_utc": 1630629887,
        "id": "hbdycab",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbdycab/",
        "score": 21,
        "subreddit": "ValueInvesting",
        "created": 1630658687.0
    },
    {
        "author": "Not_FinancialAdvice",
        "body": "&gt; That's because Intel mobile chips were always power hungry. They couldn't get a day standby time or whatever horrible battery life it was. \n\nThe Intel PXA270 XScale processor (which was an ARM implementation) in my old Palm Treo 650 gave me 2-3 days of battery life. They sold the XScale IP to Marvell later on.",
        "created_utc": 1630560235,
        "id": "hba5qyf",
        "permalink": "/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hba5qyf/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1630589035.0
    },
    {
        "author": "ra__account",
        "body": "See the recent discussion that we're still paying baggage fees that were markets as temporary after 9/11. If there's limited enough suppliers (like the AMD/Intel/NVidia trio), they can keep prices up without crossing the line of overtly colluding. Creating and manufacturing a powerful CPU is very costly and the only edge players like Apple have no interest in driving prices down.",
        "created_utc": 1630777573,
        "id": "hblc3s2",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hblc3s2/",
        "score": 15,
        "subreddit": "investing",
        "created": 1630806373.0
    },
    {
        "author": "eomar2828",
        "body": "i am still buying MSFT and INTC. I really like NVDA the company, but not NVDA the price. I own AAPL but am iffy on the price.",
        "created_utc": 1630864053,
        "id": "hbplpel",
        "permalink": "/r/ValueInvesting/comments/pif8jm/my_top_tech_stocks_to_watch_that_pays_dividends/hbplpel/",
        "score": 11,
        "subreddit": "ValueInvesting",
        "created": 1630892853.0
    },
    {
        "author": "Myleftarm",
        "body": "How is Intel a failed company?",
        "created_utc": 1630895325,
        "id": "hbrg0c3",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrg0c3/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1630924125.0
    },
    {
        "author": "Adept-Investing",
        "body": "Intel",
        "created_utc": 1630721175,
        "id": "hbisizr",
        "permalink": "/r/wallstreetbets/comments/ph5kv4/35k_to_69k_in_a_week/hbisizr/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1630749975.0
    },
    {
        "author": "Myleftarm",
        "body": "The post was about failed companies and Intel is a terrible example of one.",
        "created_utc": 1630896615,
        "id": "hbrijqi",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrijqi/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1630925415.0
    },
    {
        "author": "RobotArtichoke",
        "body": "INTC is such a boomer company. How did I ever get sucked into that pile of shit when everyone here was telling me to buy AMD. Sometimes you have to admit defeat.",
        "created_utc": 1630685966,
        "id": "hbgob55",
        "permalink": "/r/wallstreetbets/comments/ph24jo/daily_discussion_thread_for_september_03_2021/hbgob55/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1630714766.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "https://www.tomshardware.com/news/intel-ice-lake-inefficient-for-cloudflare\n\nNET chooses AMD over INTC for new processors",
        "created_utc": 1630515542,
        "id": "hb7i3n8",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7i3n8/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630544342.0
    },
    {
        "author": "Jaypalm",
        "body": "ARM doesn’t make chips. Neither does AMD. ARM is an architecture, like x86. It’s an IP company. AMD designs and sells CPUs. As the underdog in the desktop CPU market they would be hurting themselves to collude with Intel when what they’re actually doing is making better products and undercutting Intel’s prices. I’m not saying there isn’t market collusion, but your arguments will have more merit if you actually know what you’re talking about.",
        "created_utc": 1630799360,
        "id": "hbmmlyz",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbmmlyz/",
        "score": 8,
        "subreddit": "investing",
        "created": 1630828160.0
    },
    {
        "author": "paq12x",
        "body": "INTC has a stock split 2:1 at the end of July 2000.\n\nIn the last 10 years, return for INTC is 14% annually or a total of 268% in 10 years.  \n\nNot bad at all.",
        "created_utc": 1630760951,
        "id": "hbkc7t1",
        "permalink": "/r/stocks/comments/phq0mw/is_v_visa_a_good_long_term_hold_for_5_years_or/hbkc7t1/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630789751.0
    },
    {
        "author": "updownleftrightabsta",
        "body": "INTC is positive YTD, 1 year, 5 years. It hasn't done well but I wouldn't call it failing GE-style. OP just means stock price wise, not execution wise (related but not completely correlated)",
        "created_utc": 1630895328,
        "id": "hbrg0in",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrg0in/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630924128.0
    },
    {
        "author": "Xx_Majesticface_xX",
        "body": "TSMC is a fairly well known stock, however, I’m placing my bets on Global Foundries. While there were talks a few months ago in regards to Intel acquiring them, a lot of electronics that don’t require high end semi conductors(7nm TSMC, 8nm Samsung, 10nm Intel) are made using cheap, larger nodes that are less efficient. Global foundries failed to develop high end chips after they abandoned their rnd, but they hold a 15% market share(at last check) in markets which use lower grade nodes. Best part is, that they are supposedly going public in 2022. I personally think that this is a wise investment, though a rather obvious one, as any company which is trusted by the US government and hold a market share in a sector worth billions is a simple stock to buy",
        "created_utc": 1630714543,
        "id": "hbiflpp",
        "permalink": "/r/wallstreetbets/comments/phgqi2/lets_talk_about_tsm_stock_taiwan_semiconductor/hbiflpp/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630743343.0
    },
    {
        "author": "Arturion34",
        "body": "This is big, but INTC just started making similar plans to blow up chio production. Overall, i think both are solid buys and own both",
        "created_utc": 1630613049,
        "id": "hbcx25b",
        "permalink": "/r/stocks/comments/pgk8sz/is_tsm_a_strong_buy/hbcx25b/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630641849.0
    },
    {
        "author": "Several_Situation887",
        "body": "I don't know that NVIDIA is particularly over-valued, or not. They design wonderful GPU and computing chips. I believe that they contract with foundries like TSMC to have their chips produced. I could be wrong on that though.\n\nBut, I don't see anything NVIDIA produces as likely to find their way into school bus air conditioning, or any other place where pedestrian basic chips perform perfectly adequately.\n\nThat would be like purchasing a Ferrari station wagon because you needed a car to get groceries with. Expensive, and not the niche that NVIDIA or Ferrari want to play in.\n\nIn the areas where their chips are going to be in demand, the competition is fierce from AMD, Intel, and many other chip designers that play in that space. And, who is king at any given time cycles.",
        "created_utc": 1630910281,
        "id": "hbs53q3",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbs53q3/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630939081.0
    },
    {
        "author": "Both-Ad-7757",
        "body": "This is a fantastic explanation and I’m with you on Intel. Very well put good sir!",
        "created_utc": 1630630214,
        "id": "hbdz1us",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbdz1us/",
        "score": 6,
        "subreddit": "ValueInvesting",
        "created": 1630659014.0
    },
    {
        "author": "SnipahShot",
        "body": "And to add on top of that Intel finally put their foot in the gaming GPU market for the first time. Regardless of how good Alchemist will be, it will take profits from AMD and Nvidia, especially if it is as good as they make it sound.",
        "created_utc": 1630914900,
        "id": "hbsavdb",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbsavdb/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630943700.0
    },
    {
        "author": "daaammmN",
        "body": "It all depends on if you overpaid or not.\n\nIntel was almost at the 80$ mark in the 2000s.\n\nSince then it has grown a lot, but still, 20 years later and it never reached its all time high.\n\nThis just proves that you can overpay for growth.\nIf you are overpaying, you might not see an increase for many years to come\n\nI haven't dug into MasterCard, but I did for Visa.\n\nIMO, Visa (and most of the market) is overpriced. The growth that Visa is projecting (mid teens) for the next 5 years is already priced in.\n\nIf the bull market continues, the stock price might increase, but it's just a matter of time before the correction arrives and reality kicks in.\n\nI want to own Visa, I like it very much. They have been buying back shares like crazy, which is awesome. It's on my watchlist. But it still has to drop a lot for me to be a buyer. I have no doubt that it will be a buy at some point in the future though.",
        "created_utc": 1630758713,
        "id": "hbk8hho",
        "permalink": "/r/stocks/comments/phq0mw/is_v_visa_a_good_long_term_hold_for_5_years_or/hbk8hho/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630787513.0
    },
    {
        "author": "shashwat73",
        "body": "I added V and INTC. Low PE ratios, great companies, and good technicals on both",
        "created_utc": 1630680824,
        "id": "hbgbvlk",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbgbvlk/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630709624.0
    },
    {
        "author": "JRshoe1997",
        "body": "INTC, LMT, and TGT",
        "created_utc": 1630674506,
        "id": "hbfxlgg",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbfxlgg/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630703306.0
    },
    {
        "author": "FullAtticus",
        "body": "Exactly. There are three companies (Arm, Intel, AMD) making CPUs for example. All they have to do is have 3 managers meet up for lunch one afternoon and they can dictate prices to the market. Sure it's illegal, but good luck proving they did it.",
        "created_utc": 1630793181,
        "id": "hbmaah1",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbmaah1/",
        "score": 5,
        "subreddit": "investing",
        "created": 1630821981.0
    },
    {
        "author": "Spiritual_Extreme_81",
        "body": "GOOG reportedly plans to put its own chips in Chromebook laptops from 2023, ditching both INTC and AMD.",
        "created_utc": 1630883538,
        "id": "hbqs6hn",
        "permalink": "/r/wallstreetbets/comments/phcns0/weekend_discussion_thread_for_the_weekend_of/hbqs6hn/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630912338.0
    },
    {
        "author": "TaxGuy_021",
        "body": "AMD and Nvidia dont have an insurmountable lead. They are ahead of Intel for sure for now, but I believe intel has what it takes to get back in the game.",
        "created_utc": 1630866603,
        "id": "hbprfhq",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbprfhq/",
        "score": 5,
        "subreddit": "investing",
        "created": 1630895403.0
    },
    {
        "author": "meowman3000",
        "body": "Intel is getting government money to setup fabs in the US, as part of an infrastructure bill.  I could see them treating TSMC like they do Huawei in the future if Intel gets enough capacity.  I could see a strong case for national security, in which case Nvidia and AMD would shift to Intel, assuming the fabs are competitive.\n\nA small chance at least.",
        "created_utc": 1630637279,
        "id": "hbee1ue",
        "permalink": "/r/stocks/comments/pgk8sz/is_tsm_a_strong_buy/hbee1ue/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630666079.0
    },
    {
        "author": "Nuclear_N",
        "body": "INTC has been such a dog.",
        "created_utc": 1630859096,
        "id": "hbpah9w",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbpah9w/",
        "score": 4,
        "subreddit": "investing",
        "created": 1630887896.0
    },
    {
        "author": "bcuap10",
        "body": "Markets in theory function well because of competition and displayed consumer/investor preference.\n\nThey gov should fund 5-10 startups and give them funding to create pilot plants. Then hold competitions to advance the companies forward for more funding.\n\nYou would end up with more surplus and innovation if 2-3 new companies emerge and then sub specialize in different parts than giving everything to a dinosaur like Intel.",
        "created_utc": 1630773662,
        "id": "hbl38jl",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbl38jl/",
        "score": 4,
        "subreddit": "investing",
        "created": 1630802462.0
    },
    {
        "author": "Pokesaurus_Rex",
        "body": "and Intel hasn’t innovated a CPU since like 2015…we are on 14nm++++++. They can’t even get a 7nm CPU to work and it got so bad they had to bring back one of their best designers out of fucking retirement.",
        "created_utc": 1630919676,
        "id": "hbsg83o",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbsg83o/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630948476.0
    },
    {
        "author": "sweYoda",
        "body": "Coca-Cola, Kroger, Tyson Foods, Disney, Google, Intel",
        "created_utc": 1630640934,
        "id": "hbela50",
        "permalink": "/r/investing/comments/pgo4l0/anybody_hedging_heavily_against_a_downtown/hbela50/",
        "score": 4,
        "subreddit": "investing",
        "created": 1630669734.0
    },
    {
        "author": "noobc4k3",
        "body": "Why is INTC  dumping AH?",
        "created_utc": 1630531290,
        "id": "hb8kdol",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8kdol/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630560090.0
    },
    {
        "author": "notmsnewty",
        "body": "ALYI - hemp batteries are the future. I hope this is the company.  Anyone else have intel?",
        "created_utc": 1630625285,
        "id": "hbdonrm",
        "permalink": "/r/pennystocks/comments/pg9ogi/daily_plays_september_02_2021/hbdonrm/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1630654085.0
    },
    {
        "author": "datingadviceThrow789",
        "body": "INTC and CLF are the best govt plays moving forward. Love them both.",
        "created_utc": 1630600645,
        "id": "hbc1uwi",
        "permalink": "/r/wallstreetbets/comments/pgl9ng/cliffs_natural_resources_inc_clf_huge_potential/hbc1uwi/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630629445.0
    },
    {
        "author": "GraysonMA",
        "body": "When you buy leaps you are taking on a lot of vega exposure which can add significant risk to your portfolio. However, vega gives you a second way to win if you stick to companies that have IVR/IV% near their 52 week lows. [Barchart is a great resource for finding these.](https://www.barchart.com/options/iv-rank-percentile/stocks?orderBy=optionsWeightedImpliedVolatility&amp;orderDir=asc)\nI also choose underlyings that have low correlation with each other. This keeps things a little less volatile which is especially important using any type of leverage. [PortfolioVisualizer has a great tool for this.](https://www.portfoliovisualizer.com/asset-correlations?s=y&amp;symbols=SPY+TLT+KO+PG+D+INTC+MCD+VZ+FB+MSFT+NVDA+LLY+NEE&amp;timePeriod=2&amp;tradingDays=60&amp;months=36). Leaps I bought recently are in PG, INTC, FB, D, MSFT, KO, VZ, and MCD. LLY is an solid low correlation pick but I’m waiting for a dip in IV.",
        "created_utc": 1630675696,
        "id": "hbg03gf",
        "permalink": "/r/options/comments/pgu6ms/leaps_recommendations/hbg03gf/",
        "score": 3,
        "subreddit": "options",
        "created": 1630704496.0
    },
    {
        "author": "him7403",
        "body": "Microsoft and Apple hold and buy Intel? That's a big lol 😂\n\nUnfortunately stock market doesn't follow your formula.",
        "created_utc": 1630868623,
        "id": "hbpvwt2",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbpvwt2/",
        "score": 3,
        "subreddit": "investing",
        "created": 1630897423.0
    },
    {
        "author": "myglasstrip",
        "body": "Take a look at the Intel 20 year chart and tell me when intc got back to its last ath of 73.94 a share or whatever.",
        "created_utc": 1630538488,
        "id": "hb8zbv3",
        "permalink": "/r/wallstreetbets/comments/pfyl89/why_are_you_not_buying_ko_leaps/hb8zbv3/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630567288.0
    },
    {
        "author": "donktastic",
        "body": "That's not completely true and even if it was it doesn't matter. The proprietary tech steps are all done in secure locations like the US, Israel and Ireland with the US doing 100% of their R&amp;D. The R&amp;D sites are massive and also do manufacturing which handles the most top secret stuff, like US military stuff. Asia only gets the cost saving steps that are not sensitive, like packaging. \n\nIf shit hit the fan and world war 3 broke out, Intel could easily do 100% of its process in the US or allied countries. The most important part being that Intel is a US company, is based in the USA and is invested in the success of the nation.",
        "created_utc": 1630782995,
        "id": "hblo2pd",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hblo2pd/",
        "score": 3,
        "subreddit": "investing",
        "created": 1630811795.0
    },
    {
        "author": "Thin_Influence5878",
        "body": "INTC ftw",
        "created_utc": 1630866065,
        "id": "hbpq8bw",
        "permalink": "/r/ValueInvesting/comments/pif8jm/my_top_tech_stocks_to_watch_that_pays_dividends/hbpq8bw/",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1630894865.0
    },
    {
        "author": "Macre117",
        "body": "Intel",
        "created_utc": 1630514532,
        "id": "hb7fkbu",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7fkbu/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630543332.0
    },
    {
        "author": "shortyafter",
        "body": "I had been holding out since I started in February, but over the last few months lots of great buying opportunities have come up.  I am now 100% invested and will continue to average in my minuscule salary over the coming months and years.\n\nI have a retirement account that is made up of index funds.\n\nIn addition, this year I designed a defensive, value portfolio which hopefully gives me some protection on the downside.  I may not beat the S+P but I feel like I have good capital protection plus steady and reliable returns from dividends.  Rough percentages:\n\nBUD - Anheuser Busch Inbev - 5%\n\nADM - Archer-Daniels-Midland- 3.75% (agriculture company)\n\nBNS - Bank of Novia Scotia - 6%\n\nBAYRY - Bayer AG - 3%\n\nBTI - British American Tobacco - 10%\n\nKOF - Coca Cola Femsa - 6%\n\nFDP - Fresh Del Monte - 6%\n\nIBDRY - Iberdrola - 4.5% (Spanish renewable energy)\n\nIMBBY - Imperial brands - 9% (tobacco)\n\nINTC - Intel Corp - 6.5%\n\nLMT - Lockheed Martin - 9%\n\nLOGI - Logitech - 5%\n\nNTDOY - Nintendo - 8%\n\nPAAS - Pan American Silver Corp - 1.5%\n\nREPYY - Repsol - 8% (Spanish energy)\n\nUVV - Universal Corp - 6% (tobacco leaf grower)\n\nWPC - WP Carey - 1.5% (REIT)\n\nI'd like to round out some of my smaller positions, and I'd also like to pick up some mega cap tech (FAANG) in the future.  I bought what I could in this crazy market by looking for deals.",
        "created_utc": 1630677381,
        "id": "hbg3t08",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hbg3t08/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630706181.0
    },
    {
        "author": "agyria",
        "body": "Nah PayPal is intel while SQ is AMd",
        "created_utc": 1630623295,
        "id": "hbdkfxu",
        "permalink": "/r/wallstreetbets/comments/pgphq9/what_are_your_moves_tomorrow_september_03_2021/hbdkfxu/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630652095.0
    },
    {
        "author": "Disastrous_Proof6562",
        "body": "Intel comes to mind. Before the dot com bubble they were the big thing. They never crashed and burned or anything, but they failed to take off and meet expectations.",
        "created_utc": 1630903391,
        "id": "hbruwil",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbruwil/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630932191.0
    },
    {
        "author": "throughthehazel",
        "body": "INTC 50s 9/17 poots",
        "created_utc": 1630536020,
        "id": "hb8ud2v",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8ud2v/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630564820.0
    },
    {
        "author": "Scion_capital_intern",
        "body": "Well CCP has already infiltrated all of our Intel agencies and defense contractors so.. \n\nIt's the same thing. But yes.",
        "created_utc": 1630879305,
        "id": "hbqji8o",
        "permalink": "/r/wallstreetbets/comments/phcns0/weekend_discussion_thread_for_the_weekend_of/hbqji8o/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630908105.0
    },
    {
        "author": "senecadocet1123",
        "body": "The only one I would by heavily is Intel right now",
        "created_utc": 1630877550,
        "id": "hbqfrdi",
        "permalink": "/r/ValueInvesting/comments/pif8jm/my_top_tech_stocks_to_watch_that_pays_dividends/hbqfrdi/",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1630906350.0
    },
    {
        "author": "SugarDaddyVA",
        "body": "Their management has been terrible.  They missed a chip cycle which will set them back years in competition with other companies such as TMSC.  Great article explaining what happened here:  https://www.google.com/amp/s/www.tomshardware.com/amp/news/intel-announces-delay-to-7nm-processors-now-one-year-behind-expectations\n\nI’ll look at them again in a few years if they turn things around.",
        "created_utc": 1630868939,
        "id": "hbpwlw8",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbpwlw8/",
        "score": 3,
        "subreddit": "investing",
        "created": 1630897739.0
    },
    {
        "author": "Stoli1387",
        "body": "Intel if you're patient",
        "created_utc": 1630692101,
        "id": "hbh31da",
        "permalink": "/r/stocks/comments/ph1s4s/rstocks_daily_discussion_fundamentals_friday_sep/hbh31da/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630720901.0
    },
    {
        "author": "828stocks",
        "body": "Thank you for my tasty dividend, INTC.  You might be fucking me, but at least you're buying dinner.",
        "created_utc": 1630593293,
        "id": "hbbjvvx",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbbjvvx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630622093.0
    },
    {
        "author": "DongKelly32",
        "body": "Look up AS ML (pretty sure they’re private but just being safe). They make the machine that makes shit for Intel, TSMC, AMD, NVDA, etc. and it costs $150m+",
        "created_utc": 1630698475,
        "id": "hbhhl5g",
        "permalink": "/r/wallstreetbets/comments/ph24jo/daily_discussion_thread_for_september_03_2021/hbhhl5g/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630727275.0
    },
    {
        "author": "Afro_Superbiker",
        "body": "Here's hoping. I don't think their gpu will be aimed at the gaming market, so I don't think it will garner the same hype that a new release from Nvidia does.\n\nOver time though, especially with investment from the u.s with the aims of developing their u.s fabs, Intel will gain new life.",
        "created_utc": 1630714059,
        "id": "hbieok5",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbieok5/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1630742859.0
    },
    {
        "author": "mistermc90",
        "body": "Tip: just look where the cheap free cashflow to the firm / shareprice is!!!\n \n-BTI, ITB (big tobacco in general) //\n-INTC (semiconductor) //\n-RDSB (big oil/gas cashflow machine) //\n-VZ (telco with strong free CF in an oligopolistic market) //\n-FRE (strong german health company) //\n-VRTX (tremendous value drug company - 10/10 financials)",
        "created_utc": 1630688427,
        "id": "hbguas9",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbguas9/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630717227.0
    },
    {
        "author": "Parallelism09191989",
        "body": "Intel and TSM\n\nEverybody overreacting to AMD leapfrogging Intel.",
        "created_utc": 1630685309,
        "id": "hbgmpm0",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbgmpm0/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630714109.0
    },
    {
        "author": "spongesquare",
        "body": "What happened to Intel?",
        "created_utc": 1630516952,
        "id": "hb7ljkv",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb7ljkv/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630545752.0
    },
    {
        "author": "Overhaul2977",
        "body": "AMD’s profit margin is pretty good, they are taking market share from intel and approaching Nvidia in performance for their GPUs, and they are innovating well under current management. The problem with your analysis is you’re looking at book value, you need to look at future growth and both companies they can take market share have a fair amount higher market cap, meaning it has plenty of space to grow if things keep going well for them. The stock market cares about future growth, not too much on past performance.\n\nTo give you a basic idea of investing, there are four types of companies - Dogs, Cash Cows, Question Marks, and Stars. AMD is at the Question Mark phase that is almost to Star. They are taking market share in a fast growing area. The typical investor strategy in that situation is to “buy”.",
        "created_utc": 1630588805,
        "id": "hbb9kpu",
        "permalink": "/r/wallstreetbets/comments/pghk1y/how_are_people_buying_shares_of_amd_at_this/hbb9kpu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630617605.0
    },
    {
        "author": "ZeroSumBananas",
        "body": "Here are some stocks I have looked at some higher risk than others you can go with Google, Microsoft, Apple, Tesla, ISRG, Lucid, CHPT, Facebook, Intel this would be a contrarian buy, Nokia, Berkshire Hathaway, so those are some common stocks. Depends on your risk tolerance. If you want risk you can go with Chinese stocks....Not responsible for your success or failure. Not recommending anything. Good luck. Do your DD",
        "created_utc": 1630884623,
        "id": "hbqud9e",
        "permalink": "/r/stocks/comments/pidyd7/hey_im_not_that_old/hbqud9e/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630913423.0
    },
    {
        "author": "ErojectionPrection",
        "body": "I think nvidia is fine to hold onto for a while.\n\nThey're still far ahead of amd in the professional world but the money is in the consumer world. AMD has been very competitive in that regard over the years. But Intel is the bigger victim of AMD's success. Nvidia simply has real competition now. But only in a tiny area.",
        "created_utc": 1630912141,
        "id": "hbs7j12",
        "permalink": "/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i/hbs7j12/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630940941.0
    },
    {
        "author": "pacifistrebel",
        "body": "I hope intel can turn around their fabrication business. If they can, the current price is a steal. If not.. who knows what will happen. The USA could benefit from competent domestic semiconductor fabrication.",
        "created_utc": 1630894021,
        "id": "hbrdf0r",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbrdf0r/",
        "score": 2,
        "subreddit": "investing",
        "created": 1630922821.0
    },
    {
        "author": "niversally",
        "body": "You have a lot of superintendent Chalmers energy when he says he’s balding not bald respect the ing. Intel is failing not failed.",
        "created_utc": 1630895736,
        "id": "hbrgu4q",
        "permalink": "/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/hbrgu4q/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630924536.0
    },
    {
        "author": "rebatomm",
        "body": "A good question on the wrong place :)\n\nYour logic is good in a long term investing plan. \n\nThis forum is a hour/daily based investors, evaluations is the last thing people here will follow.\n\nJust as example, they invest in a failed tourism company in the beginning of pandemic and most of them won lots of cash. And they will keep a obvious garbage company just because, even if it goes to zero.\n\nIf you’re a long term investor this is a good place to get daily news but never, really never, follow a advice. Except mine of course :)\n\nMy opinion, not advice: AMD is garbage and intel is not much better. Apple and Microsoft are investing in their own cpus.\nIf you want something similar check nvidia.",
        "created_utc": 1630589175,
        "id": "hbbadyk",
        "permalink": "/r/wallstreetbets/comments/pghk1y/how_are_people_buying_shares_of_amd_at_this/hbbadyk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630617975.0
    },
    {
        "author": "datatistic",
        "body": "TSMC is a beast!!! At least 2 or 3 steps ahead of any competitor. Nobody can compete with them in manufacturing and thats why most semis companies focus only on designing chips (high margins) and let TSMC do the manufacture. \n\nNo company is investing in R&amp;D like they do so don't expect Intel or anyone to come close in terms of manufacturing capabilities.",
        "created_utc": 1630686346,
        "id": "hbgp8l1",
        "permalink": "/r/StockMarket/comments/pgk9bw/is_tsm_a_strong_buy/hbgp8l1/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1630715146.0
    },
    {
        "author": "Audere-est-Facere8",
        "body": "no intel but holding 700 with you!",
        "created_utc": 1630636052,
        "id": "hbebhut",
        "permalink": "/r/pennystocks/comments/pg9ogi/daily_plays_september_02_2021/hbebhut/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1630664852.0
    },
    {
        "author": "goodoystertastegood",
        "body": "With you on Intel. If you look that their PE ratio (against the industry), it's pretty absurd how illogical the markets are pricing them. And the fundamental advantages they've had. I hope the new CEO will be able to execute what he planned. Definitely long on Intel",
        "created_utc": 1630654422,
        "id": "hbf5hfl",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbf5hfl/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1630683222.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "I mean that’s part of it but also people just want to see if they continue taking market share from INTC I’m sure. \n\nIt did just rally like +25%, although that was from a significant dip, but it’s not really “waiting” on anything. Need some catalysts. Earnings, big deals, bad news for INTC, etc.",
        "created_utc": 1630530791,
        "id": "hb8j9zx",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8j9zx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630559591.0
    },
    {
        "author": "Uesugi1989",
        "body": "Thanks to a certain stock that shall not be named, the first four months were by far better for me (intel served me well also). The recent months my small cap got bashed quite a lot but the S&amp;P 500 which still is the biggest position in my portfolio is rising continually. \n\nWith that being said, i hold around 15% cash currently by not contributing to my investements  since i believe a correction will happen the following months, just like earlier this April",
        "created_utc": 1630775013,
        "id": "hbl6bjz",
        "permalink": "/r/stocks/comments/phqq42/we_have_had_8_months_already_in_the_trading_year/hbl6bjz/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630803813.0
    },
    {
        "author": "jasoncyke",
        "body": "Intel has been such a letdown since it dipped below 60 dollars.",
        "created_utc": 1630549201,
        "id": "hb9lwcm",
        "permalink": "/r/stocks/comments/pfqcg3/rstocks_daily_discussion_wednesday_sep_01_2021/hb9lwcm/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630578001.0
    },
    {
        "author": "Jacklewis98",
        "body": "I had a huge feeling Intel would be complacent, through what their management and executives actions towards AMD made me think they thought AMD would go bankrupt before they caught up",
        "created_utc": 1630602240,
        "id": "hbc5x87",
        "permalink": "/r/pennystocks/comments/pgdufv/where_do_you_get_your_info/hbc5x87/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1630631040.0
    },
    {
        "author": "LargeFatherOrtiz",
        "body": "my intc puts are ded",
        "created_utc": 1630608390,
        "id": "hbcladk",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbcladk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630637190.0
    },
    {
        "author": "Summebride",
        "body": "Stocks means stock market securities that you've surely heard of, Microsoft, Intel, JP Morgan, etc.\n\nBonds are a timed instrument where you lend your money to something and they pay it back later, with a slight amount extra.\n\nBonds have traditionally been for old people as they neither go up or down very much, and are predictable.  \n\nStocks can change in value radically and have traditionally been recommended for young  people so if you lose a lot of value, you have time to make it up.  \n\nBlended fund just means a mix of those two kinds of things.  \n\nAt 23 there's no other choice than stock.  \n\nAAR% likely means average annual return.  So if the AAR% was 4% and you have 1000 placed there, it would have gained about $40 during the year.  \n\nBunds are have recently been returning close to nothing.  Someday that might change but for now they're pretty much a worthless option for you.",
        "created_utc": 1630726021,
        "id": "hbj1hwp",
        "permalink": "/r/stocks/comments/phieda/first_time_putting_money_into_retirement/hbj1hwp/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630754821.0
    },
    {
        "author": "Trump_Ate_My_Ass",
        "body": "Which is better? 11th gen intel i7-11370H with Intel Iris XE graphics or AMD Ryzen 7 5700U with AMD Radeon graphics?",
        "created_utc": 1630535840,
        "id": "hb8tzt3",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb8tzt3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630564640.0
    },
    {
        "author": "Aggressive_Watch3782",
        "body": "Quik logic is a perfect short! I lost my shirt on them for long term gain. Every earnings call wait until next quarter…Nvidia blows it out of the park regularly and it’s basically a 50/50 after. It’s gone down when you just heard the most mind numbing numbers and then it goes down the next day! I ask how is this possible! \n-People are just trimming and taking profits! \nI don’t think that’s it, why take money out of the #1 stock that invented the Metavese and A/I by a fortuitous accident! Gaming company invented the GPU, Gaming company invented A/I, ray tracing and augmented reality!  Platform is best in class command a premium. \nNot many companies out their using their BILLIONS of free cash flow for R&amp;D which unlike Intel continues to make things we never dreamed about a reality today! \nOh yeah, 350 automobile companies are signed up for their driving platform and when Tesla is forced to use it . This stock will be out of reach because it’s going to be worth the most of any company today! This new Metavese thingy is at a minimum double what the impact of the game changing internet did… whaaat, I’m barely proficient now! Us old baskets are in a world of pain trying to figure that out. It is going to change the way all of us live and work so that many more of us get to also enjoy our best lives.",
        "created_utc": 1630806721,
        "id": "hbn0uzw",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hbn0uzw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630835521.0
    },
    {
        "author": "datingadviceThrow789",
        "body": "Intel will join if China takes over Taiwan.",
        "created_utc": 1630785710,
        "id": "hblu2uy",
        "permalink": "/r/StockMarket/comments/pgxwfk/a_bit_of_fun_the_top_12_market_caps_right_now_in/hblu2uy/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630814510.0
    },
    {
        "author": "LastTradeTonight",
        "body": "I know YouTube is filled with peep calling the wheel “free” money. \n\nLong term you won’t get the same raw SPY return. \nIt’s less volatile and more income driven. Also the capital lock-up is less per contract per 100 shares. \nStraight CC on SPY makes more sense than the put side bc it can get you a 70/30 risk profile with higher income. \n\n\nIf you don’t care about income and are long-term investor than buy-hold is going to work better than the wheel. \n\nPersonally, when I run the wheel it’s on a large cap with good options volume that has some vol but over all pretty stable. In the past companies like BAC, AAPL, INTC.  I haven’t run it since last year for obvious reasons.",
        "created_utc": 1630778216,
        "id": "hbldj7b",
        "permalink": "/r/options/comments/phhqo3/options_on_3x_etfs/hbldj7b/",
        "score": 1,
        "subreddit": "options",
        "created": 1630807016.0
    },
    {
        "author": "maz-o",
        "body": "i kinda have this feeling too that intel will crush it in the coming 5 years",
        "created_utc": 1630743630,
        "id": "hbjpyd0",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbjpyd0/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630772430.0
    },
    {
        "author": "moldyjellybean",
        "body": "Yes and INTC is not a tech company.  I've been in the datacenter field for many years and I'm indifferent to brand, I'm mostly looking at energy efficiency, tech advancements.  Someone wanted to invest in Intel last week and I spelled out why not.  Originally my thesis was around 2016 when I bought AMD and Intel had Brian K was head of Intel.  This is no go and it may turn around a bit on buybacks, financial engineering they have a ton of money but it's not on the back of technology.  \n\nAny non boomer working in cloud computing/semi field can tell you INTC is not where you want to put your money.  I believe Pat is more tech inclined but it's a long road and in the mean time you can invest in AMD, TSM, NVDA, AMZN, MSFT, APPL etc if you want exposure to semi or cloud computing.  \n\n\n\nhttps://old.reddit.com/r/wallstreetbets/comments/panf65/intel_is_50_bucks_just_saying/ha79m4v/",
        "created_utc": 1630866105,
        "id": "hbpqbjw",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbpqbjw/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630894905.0
    },
    {
        "author": "SnipahShot",
        "body": "Your comments seem like you are a 5 year old.\n\n\"Do you really think the super smart people they hire are morons that will sit around and let AAPL go under?\"\n\nHundreds of companies had \"super smart\" people.  \nAre you familiar with Nokia? BlockBuster? BlackBerry? IBM?  \nHeck, even Intel has been trading downwards for almost 6 months.\n\nIt doesn't matter how many \"super smart people\" a company has, if a company fails to innovate and expand their business they will start going down.  \nThis is not the case for Apple, but it is not because of \"super smart people\", it is because they still seem to innovate and expand.\n\nAlso, do you even know what exactly Apple are planning on doing in the healthcare and EV? Who their competition is in each of these fields?",
        "created_utc": 1630869503,
        "id": "hbpxuzt",
        "permalink": "/r/stocks/comments/pifkoc/why_is_aapls_revenue_growth_declining/hbpxuzt/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630898303.0
    },
    {
        "author": "SoyFuturesTrader",
        "body": "You know for people who really wanted to make money they’d go spent some time doing intel work in the DoD then maybe operations officer at the CIA then go off grid and spy on all the people with info in the know \n\nThen buy SPY call and put FDs accordingly",
        "created_utc": 1630642995,
        "id": "hbep0nq",
        "permalink": "/r/wallstreetbets/comments/pgphq9/what_are_your_moves_tomorrow_september_03_2021/hbep0nq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630671795.0
    },
    {
        "author": "Afro_Superbiker",
        "body": "Great points, cheers! \n\nIntel is one of my value picks in my portfolio, and I hope their value is recognized in the future. \n\nThe stock price of AMD is ridiculous compared to them.",
        "created_utc": 1630633211,
        "id": "hbe5i3a",
        "permalink": "/r/ValueInvesting/comments/pgtuck/does_pe_matter/hbe5i3a/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1630662011.0
    },
    {
        "author": "UncleFupa",
        "body": "I work in the hardware security space... I've been to enough conferences to know for a fact the government is throwing a significant amount of money into this field.. billions...  At one point they were talking about standing up their own foundry...\n\nThe chip shortage combined with the need to have secure devices is forcing the government to be there funding into producing this stuff at home and not overseas.  \n\nIt seemed like it barely made the news, but a few weeks ago, it was announced Intel won the contract for government chips.  This was huge news to me. It's an undisclosed amount, but if I had to guess, it's not insignificant. And these are the type of contacts that once they get going, it's almost impossible to end.  Intel will be the government's arm for anything hardware related from here on out.  Sort of like Boeing or any defense company.",
        "created_utc": 1630762019,
        "id": "hbke6u9",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbke6u9/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630790819.0
    },
    {
        "author": "SnipahShot",
        "body": "1. Pfizer.\n\nThe stock dropped after the FDA approval and by the end of the year they have the booster EUA request for the general public (already requested). They have their protease inhibitor that might completely obliterate the worst thing in Covid - The infection rate, which they will request EUA in the last quarter of the year.\n\n2. Intel \n\nIntel has been beat for a while due to nothing of significance. Now they are coming with a new CPU Alder Lake which seems to surpass what AMD has to offer and also seems to be cheaper. Intel is also releasing a new gaming GPU, which is the first time for Intel to release a gaming one so it opens a brand new market for them. It also seems like this GPU will be able to compete against the top of Nvidia and AMD, while possibly being cheaper, if the CPU pricings are an indication.    \nAlso Intel is investing in their foundries with support from the US government, in order to manufacture chips outside of China.",
        "created_utc": 1630797141,
        "id": "hbmib99",
        "permalink": "/r/stocks/comments/phzp60/playing_a_stock_game_in_school_need_advice_on/hbmib99/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630825941.0
    },
    {
        "author": "donktastic",
        "body": "They key here is that Intel in a Domestic company with domestic production. AMD and NVIDIA both rely on TSMC for production. TSMC I'd great and all but they are a foreign country and this industry is to vital to national security to rely on foreign production. Also certain top secret products will never get contracted out of country either. Intel will always have that edge.",
        "created_utc": 1630766383,
        "id": "hbkn1xc",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbkn1xc/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630795183.0
    },
    {
        "author": "UncleFupa",
        "body": "The government wants domestic chip production with the ability to oversee and control the process...  Instead of doing this theirselves, they will be doing this through Intel.  There is no reason they would be doing this twice through two different companies.",
        "created_utc": 1630766841,
        "id": "hbko0yt",
        "permalink": "/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal/hbko0yt/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630795641.0
    },
    {
        "author": "Imaginary_Trader",
        "body": "Interesting comment on AMD and KISS. I bought in pre-zen too, thought it looked promising, but did in no way think that Intel would be on 14nm for so long. Maybe I didn't research enough about Intel and the going-ons there but it's still shocking to me that AMD was able to bridge such a gap.",
        "created_utc": 1630602051,
        "id": "hbc5g3u",
        "permalink": "/r/pennystocks/comments/pgdufv/where_do_you_get_your_info/hbc5g3u/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1630630851.0
    },
    {
        "author": "th3cr1t1c",
        "body": "So AVGO is trading at a 25% premium to fair value.  INTC is trading at a 29% discount to Fair Value.\n\nUsing Gordon Growth Model (Dividend Discount Model), Intel's valuation is $22 per share.\n\nThat does not make either of these two attractive recommendations at this particular time.  It also is threatened by the expectation of chip shortages to extend into 2022-23 (Morningstar Research) by which time, FOMC action on interest rates may trigger a sell-off in the broader market.\n\n(Source: Am finance data analytics professional with 25 years professional experience and investing experience.)",
        "created_utc": 1630860186,
        "id": "hbpcxzz",
        "permalink": "/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/hbpcxzz/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630888986.0
    },
    {
        "author": "Opeth4Lyfe",
        "body": "Because it’s trading rich right now. No matter how wonderful a company is it can still be over valued. Look at Intel, Cisco, GE, Amazon in the tech bubble. Tons of potential growth, lots of enthusiasm about their futures, no one thought they would go down. They corrected by as much as 90% in some cases…but on average lost 70% of their value. Amazon went from 113 to 6 but the company was in tremendous shape and growing incredibly fast. Would have taken over a decade to recover…and most of those companies are still not back at their previous ATH.",
        "created_utc": 1630878171,
        "id": "hbqh3eo",
        "permalink": "/r/stocks/comments/phyt50/aapl_or_cash/hbqh3eo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630906971.0
    },
    {
        "author": "kanye_psychiatrist",
        "body": "INTC hurt me and I don’t want to talk about it",
        "created_utc": 1630860719,
        "id": "hbpe5pn",
        "permalink": "/r/wallstreetbets/comments/phcns0/weekend_discussion_thread_for_the_weekend_of/hbpe5pn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630889519.0
    },
    {
        "author": "EatMeatPeeps",
        "body": "Hear me out, but, long term poots on Intel.",
        "created_utc": 1630505522,
        "id": "hb6tqzy",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb6tqzy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630534322.0
    },
    {
        "author": "fuzedz",
        "body": "HDVY, do your own research. Possible large settlement with INTC.",
        "created_utc": 1630591928,
        "id": "hbbgnae",
        "permalink": "/r/pennystocks/comments/pg9ogi/daily_plays_september_02_2021/hbbgnae/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1630620728.0
    },
    {
        "author": "vgraminco",
        "body": "\"for a long time has essentially been complacent in its innovation\" ? just wondering how to reach this conclusion. I am comparing R&amp;D spending of Intel and AMD, Intel R&amp;D spending is 19% of its revenue and AMD is 17%. Converting to $ amount, Intel R&amp;D is $3B in Q2/21 and AMD is $659M in Q2/21.",
        "created_utc": 1630717472,
        "id": "hbilcvs",
        "permalink": "/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/hbilcvs/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630746272.0
    },
    {
        "author": "NATbagholder",
        "body": "Intel is already building new fabs, but I can see them building more if someone else will pay.",
        "created_utc": 1630732252,
        "id": "hbjblmc",
        "permalink": "/r/wallstreetbets/comments/phcns0/weekend_discussion_thread_for_the_weekend_of/hbjblmc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630761052.0
    },
    {
        "author": "wc_helmets",
        "body": "Yes, but I just started learning about value investing over the last few months.  I do an 80/20 split with 80% going into an ETF portfolio that's anchored by VOO but leans small cap value with exposure into developing and emerging markets and some long term bonds.  I just dump into that every paycheck and rearrange once a quarter to keep my ratios about the same.  The other 20% goes into individual stock picks.  Really, I think of individual stocks, my biggest one is Intel, and it's only 1% of my entire portfolio.  I want to test this out for a few years and maybe slowly shift the balance if I feel like I'm getting the hang of it.  I believe the market is overvalued right now, but I believe, in general, in the idea that the market is where you should invest your money.  I'm still going 25 or so years until retirement so I got time to really dig into some of the companies I'd like to when a correction happens.\n\nI also run a magic formula investor portfolio with about $600.00, just to compare how it looks with next year, have about $350.00 invested in crypto, and an account for daytrades and options plays that I do not feed but only use the money that are in them.  There's something to be said for scratching some itches but keeping those itches from your main money.",
        "created_utc": 1630533566,
        "id": "hb8pb0m",
        "permalink": "/r/ValueInvesting/comments/pfv9wi/do_you_keep_a_large_portion_of_your_investment_in/hb8pb0m/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1630562366.0
    },
    {
        "author": "NewPairOfShoes",
        "body": "I understand the DDR5 stance, but adoption of that won't be widespread for another year at least.  People need new boards, memory and CPUs to accomodate the new tech.  If Intel can make a case to move to 12th gen and AMD for the new Zen, then Corsair will be in a good position.",
        "created_utc": 1630607839,
        "id": "hbcjwzx",
        "permalink": "/r/wallstreetbets/comments/pgjxjj/50k_crsr_yolo/hbcjwzx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630636639.0
    },
    {
        "author": "masteroflich",
        "body": "Carbios 14.95%\n\nDisney 10%\n\nShopify 8.59%\n\nLG Electronics 8.53%\n\nTencent 8.02%\n\nSofi 6.28%\n\nSiemens Energy 5.81%\n\nSony 4.99%\n\nAlibaba 4.71%\n\nCD Projekt 4.69%\n\nIntel 4.43%\n\nClean Energy ETF 3.37%\n\nSamsung SDI 3.65%\n\nTaiwan Semi 3.08%\n\nApple 2.98%\n\nBayer 2.49%\n\nBlackberry 2.45%\n\nCitius Pharmaceutics 0.58%\n\nIQIYI 0.03%\n\nTrivago 0.01%\n\n&amp;#x200B;\n\nI recently sold some Nokia and Varta shares.\n\nBuilding currently a AutoDesk position and want overall a bit more exposure to sume blue chips companies (Adobe, Google, Apple)",
        "created_utc": 1630760764,
        "id": "hbkbvzq",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hbkbvzq/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630789564.0
    },
    {
        "author": "pbj_halfevil",
        "body": "perhaps it is a good time to buy INTC",
        "created_utc": 1630766873,
        "id": "hbko3ba",
        "permalink": "/r/StockMarket/comments/pha2z1/gm_shutting_down_production_at_most_of_its_plants/hbko3ba/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630795673.0
    },
    {
        "author": "Patrickstarho",
        "body": "Nxp should be on that list",
        "created_utc": 1631248296,
        "id": "hc9vy4d",
        "permalink": "/r/StockMarket/comments/pldsgf/semiconductorchip_industry_where_do_you_see_the/hc9vy4d/",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1631277096.0
    },
    {
        "author": "Jundestag",
        "body": "Long term I’d say the chip makers who are best at creating embedded chips. AMD is not one of those.\n\nEverything will be smart and/or robot at some point. And it needs to be very power efficient.\n\nPc’s will be just a very small percentage of future chip market growth.\n\nSo I would bet on asml, tsmc, intel (as a foundry), broadcom, nxp",
        "created_utc": 1631252186,
        "id": "hca1zj6",
        "permalink": "/r/StockMarket/comments/pldsgf/semiconductorchip_industry_where_do_you_see_the/hca1zj6/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1631280986.0
    },
    {
        "author": "_midvar",
        "body": "Favorite (lesser known) semiconductor/adjacent plays:\n\nLSCC, ATOM, UMC, LAM, KLAC, NXP, ON, SKYT, TSEM, MX",
        "created_utc": 1631452570,
        "id": "hck53r7",
        "permalink": "/r/stocks/comments/pmqf6z/which_semiconductors_company_has_best_long_term/hck53r7/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631481370.0
    },
    {
        "author": "FrugalNorwegian",
        "body": "New NXPI reddit forum just started today\n\n[https://www.reddit.com/r/NXPI\\_Stock/](https://www.reddit.com/r/NXPI_Stock/)",
        "created_utc": 1630520124,
        "id": "hb7tb0p",
        "permalink": "/r/stocks/comments/n1yj5i/nxpi_time_to_buy/hb7tb0p/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630548924.0
    },
    {
        "author": "rocket6733",
        "body": "No NXPI or Infineon?",
        "created_utc": 1631289928,
        "id": "hcbrvr7",
        "permalink": "/r/StockMarket/comments/pldsgf/semiconductorchip_industry_where_do_you_see_the/hcbrvr7/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1631318728.0
    }
]