[
    {
        "author": "jwd18104",
        "body": "Xilinx",
        "created_utc": 1630933996,
        "id": "hbszgvx",
        "score": 9,
        "subreddit": "stocks",
        "created": 1630962796.0
    },
    {
        "author": "Summebride",
        "body": "Psychologically people will be happy to load up if it breaks $100.  I dipped out at $120 with the express intent of rebuying if it dipped like that.  For a while I wasn't sure it would before we have resolution of the Xilinx merger. But now it seems like entry in the $90's is quite possible.",
        "created_utc": 1632944297,
        "id": "herf2mb",
        "score": 7,
        "subreddit": "stocks",
        "created": 1632973097.0
    },
    {
        "author": "One_of_the_blessings",
        "body": "Can China hurry up and approve this XLNX and AMD merger?",
        "created_utc": 1631493235,
        "id": "hcmsw3w",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1631522035.0
    },
    {
        "author": "Overhaul2977",
        "body": "Pretty sure AMD is going down to meet the eventual merger price with Xilinx. Xilinx is still at a discount at $154 when AMD is at $106, since Xilinx shareholders will get 1.7234 shares. This is assuming the merger is approved.",
        "created_utc": 1631231131,
        "id": "hc8vd2w",
        "score": 4,
        "subreddit": "stocks",
        "created": 1631259931.0
    },
    {
        "author": "DragonInPajama",
        "body": "AMD.\n\nWhy is everyone too retarded to understand how big of a gold mine AMD is? Because more than 99% of people don't even know what's inside their computer.\n\nAMD has developed and successfully deployed a revolutionary technological feat. Instead of making YUGE chips with a lot of cores that are superexpensive to manufacture, they make small \"chiplets\" that cost fuck all to make and just put 8 of them into a CPU. That way they can sell a cpu with 64 cores for a tenth of the price of an intel one AND with higher margins than them. \n\nThe \"unique\" knowledge is that they plan on doing the same with GPUs and down the line they will just mix CPU and GPU (and FPGA after they merge with xlnx later this year) dies in the same package tailored to customers.",
        "created_utc": 1632050836,
        "id": "hdg90ey",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1632079636.0
    },
    {
        "author": "cantadmittoposting",
        "body": "Alright folks you heard it here first.\n\nXLNX deal is probably going to get stuffed by China in retaliation for US/SK nuking an acquisition of an SK/US semiconductor firm by US regulators after China approved it. This is a mirror of the situation.\n\nSo we either get:\n\n1. Biden is holding the other deal hostage in order to get XLNX approved and *both* will go through after negotiation.\n\n2. China will spite kill XLNX in retaliation if US/SK is actually committed to killing the smaller deal.",
        "created_utc": 1631706691,
        "id": "hcxu2om",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631735491.0
    },
    {
        "author": "ImRunningOutOfIdead",
        "body": "What do you folks think about the chances for the Xilinx acquisition? I have been buying Xilinx thinking it is a smart way to play AMD, but is there a chance it wont happen?",
        "created_utc": 1631796259,
        "id": "hd2lswr",
        "score": 3,
        "subreddit": "stocks",
        "created": 1631825059.0
    },
    {
        "author": "AbleCritic",
        "body": "I remember I was called retarded for loading up on Xilinx instead of AMD when it was 118 a share.",
        "created_utc": 1631351218,
        "id": "hcezdfw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631380018.0
    },
    {
        "author": "the-faded-ferret",
        "body": "AMD acquisition of Xilinx and double data center profits this year… this growth stock about to have a P/E of 10 lol",
        "created_utc": 1631628800,
        "id": "hctlrqn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631657600.0
    },
    {
        "author": "WorkingCorrect1062",
        "body": "AMD is safer, lots of room to grow in GPU and CPU market. Xilinx acquisition to be closed, 20% down from ATH",
        "created_utc": 1633037805,
        "id": "hewg7ep",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633066605.0
    },
    {
        "author": "dbosspec",
        "body": "Xilinx merger approval incoming this month",
        "created_utc": 1631922164,
        "id": "hd9qmua",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631950964.0
    },
    {
        "author": "ManagerMilkshake",
        "body": "AMD is acquiring Xilinx. FPGAs will be huge in the future",
        "created_utc": 1631279491,
        "id": "hcb3dbe",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1631308291.0
    },
    {
        "author": "letsmakesomecalls",
        "body": "Nah amd isnt going to have it as bad as the rest and xlnx acquisition will get approved by china. We",
        "created_utc": 1631811874,
        "id": "hd3moaw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631840674.0
    },
    {
        "author": "WolfPackWSB",
        "body": "AMD Samsung Intel Xilinx TSM &amp; ON are the major ASIC manufacturers.. Most patents are held by TSM",
        "created_utc": 1630932103,
        "id": "hbsw3lq",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630960903.0
    },
    {
        "author": "HairZealous",
        "body": "it will. it will. patience. 150 easy, june 2022. we get xilinx merger, 150 asap.",
        "created_utc": 1631175545,
        "id": "hc5qw3n",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631204345.0
    },
    {
        "author": "Hani95",
        "body": "I don't do SPY stuff, I focus on tickers, so no advice from me on what you should do there haha. \n\nAnd yeah I was red on Citi, Razer, Xilinx, CCS, ViacomCBS, and UWMC, but i was just more green than red haha.",
        "created_utc": 1631180707,
        "id": "hc5w6mk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631209507.0
    },
    {
        "author": "pawlacz33",
        "body": "um xlnx wtf?",
        "created_utc": 1631564639,
        "id": "hcqg6c6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631593439.0
    },
    {
        "author": "One_of_the_blessings",
        "body": "AMD and XLNX merger wen",
        "created_utc": 1631973147,
        "id": "hdby74b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632001947.0
    },
    {
        "author": "AbleCritic",
        "body": "XLNX",
        "created_utc": 1632433851,
        "id": "he0l7xk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632462651.0
    },
    {
        "author": "isellamdcalls",
        "body": "I was saying I get to buy it more AMD leaps I wasn't suggesting they do it. I sell weeklies anyway. That said the Xilinx merger supposed to go through by the end of the year and this dip is a decent time to buy leaps which is why I bought them myself",
        "created_utc": 1632196324,
        "id": "hdogh93",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632225124.0
    },
    {
        "author": "DragonInPajama",
        "body": "AMD, or XLNX if you like it risky.",
        "created_utc": 1632162453,
        "id": "hdmdijm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632191253.0
    },
    {
        "author": "cwolf908",
        "body": "I don't take pleasure in entertaining internet trolls, but since I don't want to see you spreading misinformation to others, I'll bite...\n\nMy first clue that you don't know what your talking about:\n\n&gt;buy shares of whoever paints gold stars on Lisa Su's parking spaces at all of AMD's **fabs**\n\n**Fact:** AMD doesn't own any fabs.\n\nThe only guise under which you can call this acquisition a \"mistake\" is viewing it through the lens of: \"I'm a short-term shareholder and wanted to make a quick buck and get out.\" From any other standpoint, this acquisition is a win. Let's count the ways:\n\n1) AMD's acquisition of XLNX increases Total Addressable Market significantly  \n2) AMD's acquisition of XLNX increases AMD's access to manufacturing capacity at TSMC (XLNX + AMD wafer allocations)  \n3) AMD's acquisition of XLNX increases AMD's ability to extract the most out of their partnership with TSMC and TSMC's nodes (**fact:** XLNX has one of the best fab teams due to their extensive partnership with TSMC and being a \"pipe-cleaner\" for leading edge nodes)   \n4) AMD's acquisition of XLNX diversifies AMD's IP and grants them access to myriad programmable accelerator solutions developed by XLNX (these are all but guaranteed to make their way into AMD products as chiplet-based, flexible accelerators)  \n5) AMD's acquisition of XLNX opens a door for AMD to break into the growing, profitable 5G market  \n6) AMD's acquisition of XLNX gives AMD a jumpstart toward Software-Defined Silicon (SDSi) and/or Software-Defined Compute\n\n&gt;...a stodgy technology vendor with little to no synergy...\n\nXLNX earns over $3B a year and is growing that revenue at double-digit rates... how is that \"stodgy?\" I've already covered your lack of understanding on synergy.",
        "created_utc": 1632941730,
        "id": "her8std",
        "score": 2,
        "subreddit": "stocks",
        "created": 1632970530.0
    },
    {
        "author": "Overhaul2977",
        "body": "https://www.amd.com/en/corporate/xilinx-acquisition  \nhttps://www.barrons.com/articles/xilinx-could-be-a-cheap-way-to-play-amd-thanks-to-the-merger-arbitrage-spread-51628188820",
        "created_utc": 1631308047,
        "id": "hccywln",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631336847.0
    },
    {
        "author": "DragonInPajama",
        "body": "amd/xlnx",
        "created_utc": 1631826446,
        "id": "hd4mgli",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631855246.0
    },
    {
        "author": "Spitzly",
        "body": "Merger with xilinx speculated to complete before year end. Xilinx or AMD calls",
        "created_utc": 1632406575,
        "id": "hdyszmr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632435375.0
    },
    {
        "author": "adamrch",
        "body": "Does XLNX have any exposure to this market?",
        "created_utc": 1632801727,
        "id": "hek1j2t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632830527.0
    },
    {
        "author": "krzen",
        "body": "Yeah, I used to be that way. Took getting burned a couple times to see the light. I think it’s doubly true with the xlnx arb cloud right now. These days I stick to playing the earnings run up and wait to see what comes after before attempting any post earnings plays.",
        "created_utc": 1630522557,
        "id": "hb7z7nr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630551357.0
    },
    {
        "author": "mutemutiny",
        "body": "!remindme get \"lube\" if {XLNX merger = true}",
        "created_utc": 1631211230,
        "id": "hc7kc9h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631240030.0
    },
    {
        "author": "MyPotatoSenpai",
        "body": "AMD \\~10% of my portfolio\n\nGMG.V \\~5% of my portfolio\n\nCMC.v \\~5% of my portfolio\n\n&amp;#x200B;\n\nExpecing big growth from all in the coming years, CMC - garbage to gas, and other chemicals, loads of LOI letters signed once they're fully functional, GMG - aluminum graphene batteries that charge in 5 minutes, loads chaaper than lithium, they also have an in house process to create low cost graphene from natural gas which on it's own is worth something. AMD - Xilinx merger should keep the shares moving up over time.",
        "created_utc": 1631201847,
        "id": "hc6xp1o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631230647.0
    },
    {
        "author": "TruthHurts236911",
        "body": "I have my March, April, May, June ones already. Thinking of doing some put spreads because i expect it to trade between 105-111 until next earnings or xilinx finalizing merger which i kind of doubt happens before EoY.",
        "created_utc": 1631663462,
        "id": "hcvxlpo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631692262.0
    },
    {
        "author": "isellamdcalls",
        "body": "buying xilinx",
        "created_utc": 1631663801,
        "id": "hcvyaz3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631692601.0
    },
    {
        "author": "knappis",
        "body": "Hedging is bisexual. But Markets go up or they go down and betting both sides will cut into profits. I’d rather go full 🌈🐻 tomorrow (tho I actually do hold som $XLNX shares for reasons).",
        "created_utc": 1632261823,
        "id": "hdrt7te",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632290623.0
    },
    {
        "author": "GreatTragedy",
        "body": "For those not paying attention, it appears the AMD acquisition of Xilinx is imminent (expected to close not later than November).  If it goes through as expected (China has slowly begun letting their approval leak out), each share of Xilinx will convert to 1.732 shares of AMD.  At current prices, that means Xilinx shares will net an easy ~16% profit.  Current price targets for Xilinx run as high as $165 as of last week, so risk is minimal if the deal doesn't pan out.  I'm in for about 40% of my currently portfolio.",
        "created_utc": 1632324159,
        "id": "hdur2e1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632352959.0
    },
    {
        "author": "isellamdcalls",
        "body": "xilinx",
        "created_utc": 1632586387,
        "id": "he8hxs3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632615187.0
    },
    {
        "author": "rbaggio200",
        "body": "Announced Oct '20 and was supposed to be completed end 2021. \n\nIt's not free money, it's called risk arbitrage. \n\nAside from comments mentioned, to participate in this, you'll need to buy Xilinx and short 1.7234 shares of AMD per Xilinx stock. \n\nAside from the practical difficulty of replicating this ratio, you'll have to account for the financing cost of shorting AMD, which depends on your broker. \n\nSpreads for all-stock transactions tend to be the widest, followed by part-cash-part-stock, followed by all-cash, but not a definitive rule.",
        "created_utc": 1630659152,
        "id": "hbfax54",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1630687952.0
    },
    {
        "author": "isellamdcalls",
        "body": "AMD as a merger with xilinx so they're going to be tsm's largest customer, also they're doing a 4 billion buyback program right now",
        "created_utc": 1631462695,
        "id": "hckr7jv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631491495.0
    },
    {
        "author": "BlueFin33",
        "body": "Y no XLNX tho? I initially started with AMD too, but the merger is just extra 20% AMD.",
        "created_utc": 1631197547,
        "id": "hc6nqjj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631226347.0
    },
    {
        "author": "cantadmittoposting",
        "body": "Wtf are you talking about. I'm saying the XLNX deal is going to get nixed by China.\n\nYou want a date? End of month. The other deal is already dead.",
        "created_utc": 1631707465,
        "id": "hcxvcd2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631736265.0
    },
    {
        "author": "cantadmittoposting",
        "body": "I'll buy XLNX puts.",
        "created_utc": 1631707700,
        "id": "hcxvqmc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631736500.0
    },
    {
        "author": "thejunes",
        "body": "Waiting on that AMD/XLNX merger, but AMD is really putting Intel in their grave. Global chip shortage should boost their sales and they are trying to secure supply.",
        "created_utc": 1632031513,
        "id": "hdfkb2v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632060313.0
    },
    {
        "author": "Tarwins-Gap",
        "body": "Xlnx so you get more AMD for your buck.",
        "created_utc": 1632400275,
        "id": "hdyfxpq",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1632429075.0
    },
    {
        "author": "BlueFin33",
        "body": "IMO it's the safer play. I can't imagine the merger not getting approved. \n\nAMD dropping down to XLNXs level after the merger is a possibility too, so with my leverage I much rather hold XLNX.",
        "created_utc": 1631198894,
        "id": "hc6qsn1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631227694.0
    },
    {
        "author": "Cantgetfooledagain1",
        "body": "AAPL, AMD and PACK\n\nAAPL - oh shit factors (car, AR, new phone, spaceship idk) + buybacks\n\nAMD - XLNX merger, steel/copper/oil of hardware\n\nPACK - 2 Soros brothers own it, packaging company that uses paper products and razorblade business model. E-commerce + ESG play",
        "created_utc": 1631233801,
        "id": "hc91755",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631262601.0
    },
    {
        "author": "Infinityaero",
        "body": "AMD/XLNX because Lisa Su has been killing it with their short, medium and long term strategic planning for years now, and I don't see that streak ending soon. About a quarter of my portfolio.",
        "created_utc": 1631228582,
        "id": "hc8ps72",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631257382.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Gyna makes me worried about AMD/XLNX",
        "created_utc": 1631625232,
        "id": "hctdy5d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631654032.0
    },
    {
        "author": "Anth916",
        "body": "it stagnates for long periods though. Like it will just do nothing for the longest time. I think a huge part of it is the XLNX deal. Once that deal is fully finalized, then I think the stock will be free to go on more runs than it has. It's almost like that deal still being in limbo is keeping the stock in check",
        "created_utc": 1631478943,
        "id": "hclw95q",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631507743.0
    },
    {
        "author": "Year3030",
        "body": "Interesting, I'm East Coast right now I know some of the offshore wind guys. \n\nMy opinion is that data science and machine learning is already kind of old news. If you are into that check out the Xilinx accelerator cards and learn how to VHDL code. That's the same hardware PLTR uses, as far as I know. \n\nAt the moment I think there are some interesting possibilities in biology (check out Ginkgo Bioworks) and quantum computing, if you want to go for higher than 200k.",
        "created_utc": 1631712412,
        "id": "hcy4m5o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631741212.0
    },
    {
        "author": "kupka316",
        "body": "China, approve XLNX deal tomorrow, thanks.",
        "created_utc": 1631824572,
        "id": "hd4hy3t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631853372.0
    },
    {
        "author": "One_of_the_blessings",
        "body": "I really need XLNX to hold $150 this week",
        "created_utc": 1632148737,
        "id": "hdlg6e7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632177537.0
    },
    {
        "author": "Cold-Income619",
        "body": "Lol. Congratulations, I hope NVID follows suit. Do you think the Xilinx and AMD acquisition will be a strong catalyst?",
        "created_utc": 1632776334,
        "id": "heiknxb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632805134.0
    },
    {
        "author": "Cold-Income619",
        "body": "Oh yeah I've heard if Xilinx. Thanks! 🙌",
        "created_utc": 1632406646,
        "id": "hdyt5ml",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632435446.0
    },
    {
        "author": "IndividualForward177",
        "body": "Can't help you with timing switch from ASML to AMD. It's not something I considered.  Keep in mind AMD will merge with Xilinx by the end of the year (most likely). Xilinx owners get 1.7 shares of AMD per 1 share of Xilinx in the merger. Currently I think Xilinx share price is at 1.5 ratio because they are waiting for final approval by China. When it's approved the gap will close.",
        "created_utc": 1632845356,
        "id": "helz5zz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632874156.0
    },
    {
        "author": "ritholtz76",
        "body": "Is xolinx following amd pattern? Wondering if it makes sense to move to AMD from xlnx.",
        "created_utc": 1632963869,
        "id": "hesn3cv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632992669.0
    },
    {
        "author": "Der-lassballern-Mann",
        "body": "I don't know what you mean. In the long run the stock was always good to me. Just because it 0,4% down? Happens. It will go up. Value is still there. Wait till the Xilinx merger is through.",
        "created_utc": 1630590240,
        "id": "hbbcsdv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630619040.0
    },
    {
        "author": "merlinsbeers",
        "body": "I think that reflects the market's estimate of future prospects pretty well. AMD is growing in x86 server and nVidia is going to get ARM (there should be a slight discount for the uncertainty but the duffers are probably overbidding it so it washes).\n\nBut, I believe that people don't understand that the XLNX deal is dilutive and will be a millstone around AMD's neck until a massive, expensive restructuring of XLNX's whole ecosystem is done, while they also don't understand the full implications of nVidia's domination of the AI/ML market.\n\nSo, unless there's some surprise for us all, that 4.6:1 ratio between them is going to grow.",
        "created_utc": 1630596006,
        "id": "hbbqcxs",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630624806.0
    },
    {
        "author": "DragonInPajama",
        "body": "xlnx 185c expiring jan 2023. When china greenlights the merger they will more than double.",
        "created_utc": 1631653245,
        "id": "hcvanls",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631682045.0
    },
    {
        "author": "ImpartialObserverGuy",
        "body": "How is nobody here talking about Xilinx? With the AMD acquisition approval from China coming in next 2 weeks ... it could easily go to 220$+",
        "created_utc": 1631706557,
        "id": "hcxtupk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631735357.0
    },
    {
        "author": "WallStreetSewerGator",
        "body": "I like the company. I like the team. But it's x86 in a SoC future. Data centers are going to move more into SoC in the future as well, and the Xilinx merger may not happen - leaving them back at square one in that department.\n\n200 shares isn't worth the stress and effort of trying to swing trade. I would hold here.",
        "created_utc": 1631671724,
        "id": "hcwfmf2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631700524.0
    },
    {
        "author": "MrJumblez",
        "body": "AMD is trading sideways till the XLNX merger goes through. Should go through in November",
        "created_utc": 1631503675,
        "id": "hcne9zx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631532475.0
    },
    {
        "author": "GammaKnifeNice",
        "body": "GENI, STEM, MAPS, and maybe MTTR.  XLNX for big cap.  \n\nYou should listen to me because my fantasy team won with 169 points today",
        "created_utc": 1631499745,
        "id": "hcn6n0a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631528545.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "I’m callin it: AMD goes flat or pulls back even more until XLNX is approved, it’ll rocket to 140 over several days then pull back to 120ish.",
        "created_utc": 1631721464,
        "id": "hcypjq2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631750264.0
    },
    {
        "author": "merlinsbeers",
        "body": "Lisa Su didn't bring AMD back. Jim Keller, Satoshi Nakamoto, and the clown car that is Intel's C-suite did.\n\nBuying XLNX is proof that her investment in providing custom-silicon services couldn't beat larger, slower reprogrammable circuits with rube-goldbergian dev systems.\n\nKeep acting like it's a cult or a club and not an investment.",
        "created_utc": 1632952601,
        "id": "herz5fj",
        "score": 0,
        "subreddit": "stocks",
        "created": 1632981401.0
    },
    {
        "author": "DragonInPajama",
        "body": "xlnx. They were big into it with huawei and got cucked hard, they ate back to it again.",
        "created_utc": 1632764155,
        "id": "hehtrsb",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1632792955.0
    },
    {
        "author": "merlinsbeers",
        "body": "\n\n\n&gt;&gt;I don't take pleasure in entertaining internet trolls, but since I don't want to see you spreading misinformation to others, I'll bite...\n\n&gt;My first clue that you don't know what your talking about:\n\n&gt;&gt;buy shares of whoever paints gold stars on Lisa Su's parking spaces at all of AMD's **fabs**\n\n&gt;**Fact:** AMD doesn't own any fabs.\n\n**Fact:** r/whoosh has a new champion.\n\n&gt;The only guise under which you can call this acquisition a \"mistake\" is viewing it through the lens of: \"I'm a short-term shareholder and wanted to make a quick buck and get out.\"\n\nTry: \"I've been in the engineering business for thirty years and know exactly what these two companies do and it's not a synergy.\"\n\n&gt; From any other standpoint, this acquisition is a win.\n\nThis outta be good.\n\n&gt; Let's count the ways:\n\n&gt;1) AMD's acquisition of XLNX increases Total Addressable Market significantly  \n\nAMD accesses its market just fine, as does XLNX. They aren't the same market so it doesn't increase scale for the things either company builds. Your answer would have the same value if they had bought Krispy Kreme.\n\n&gt;2) AMD's acquisition of XLNX increases AMD's access to manufacturing capacity at TSMC (XLNX + AMD wafer allocations)  \n\nOnly if they stop shipping XLNX product to free up the wafers. They could have paid a lot less to TSM to get the capacity away from Xilinx.\n\n&gt;3) AMD's acquisition of XLNX increases AMD's ability to extract the most out of their partnership with TSMC and TSMC's nodes (**fact:** XLNX has one of the best fab teams due to their extensive partnership with TSMC and being a \"pipe-cleaner\" for leading edge nodes)   \n\nSo now AMD is paying full price for shakedown testing of vendors that they previously got for free. Nice.\n\n&gt;4) AMD's acquisition of XLNX diversifies AMD's IP and grants them access to myriad programmable accelerator solutions developed by XLNX (these are all but guaranteed to make their way into AMD products as chiplet-based, flexible accelerators)  \n\nAMD's IP doesn't need diversifying, and XLNX's lowers the average value of the collective IP basket. There might be some value in putting XLNX FPGA arrays on AMD chips but it's a niche within a niche, not the vast meadow of easy money you need it to be.\n\n&gt;5) AMD's acquisition of XLNX opens a door for AMD to break into the growing, profitable 5G market  \n\nAbsolutely nothing was stopping them and they're years late to that party. 5g isn't growing, the majority of the value in it was taken as low-hanging fruit already. Adding gigabit wifi to Teddy Ruxpin dolls isn't going to reduce the vast Goodwill charge that's coming to AMD shareholders' future.\n\n&gt;6) AMD's acquisition of XLNX gives AMD a jumpstart toward Software-Defined Silicon (SDSi) and/or Software-Defined Compute\n\nOld tech. Xilinx does that now, and doesn't make as much profit from it as AMD makes from its existing business lines. Combining the companies won't refresh it or make it more profitable.\n\n&gt;&gt;...a stodgy technology vendor with little to no synergy...\n\n&gt;XLNX earns over $3B a year and is growing that revenue at double-digit rates... how is that \"stodgy?\" I've already covered your lack of understanding on synergy.\n\nYou're projecting on who understands what.\n\nFirst XLNX *revenue* is $3B. Its *earnings* are $600-800M and those have been flat for many years, and actually declining 20% since 2019 despite revenue growing 20% to that 3B in 2019.\n\nXLNX is not a growth center, which is why synergy has to be the focus, and the lack of it is key to understanding the problem here \n\nThe only way AMD improves XLNX is if they overhaul the crufty, confusing development system that comes with XLNX products and increases the velocity of design wins before XLNX FPGA gets replaced by some better software-customizable hardware methodology. There's no way XLNX improves AMD enough to be a good value.\n\nI'll accept that you don't actually know what you're talking about and admit that I don't have all the information in the world, so I'll wait for someone else to find a way this deal makes a net profit for AMD.\n\nMeanwhile, take a gold star; you can have one of Lisa's.",
        "created_utc": 1632950928,
        "id": "hervcrb",
        "score": 0,
        "subreddit": "stocks",
        "created": 1632979728.0
    },
    {
        "author": "isellamdcalls",
        "body": "thinking of selling 100 shares of amd and using the cash to buy more june calls. CCs arent cutting it rn. wanna capitalize on the xlnx acquisition",
        "created_utc": 1632191447,
        "id": "hdo6yb5",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1632220247.0
    },
    {
        "author": "merlinsbeers",
        "body": "Buying Xilinx was a mistake.",
        "created_utc": 1632935343,
        "id": "heqt99t",
        "score": -2,
        "subreddit": "stocks",
        "created": 1632964143.0
    }
]