[
    {
        "author": "garlicroastedpotato",
        "body": "Not all of them.  IBM was always a government contracts company and that's where they put their money.  Most of their stuff is machine learning, machine understanding, and machine implementation.",
        "created_utc": 1636000995,
        "id": "hj8v6x0",
        "score": 109,
        "subreddit": "stocks",
        "created": 1636029795.0
    },
    {
        "author": "FinndBors",
        "body": "People retire, people have to liquidate. Almost everyone can't hold forever.\n\nAnd you are mentioning individual stocks like Microsoft and Apple. Yeah they are killing it right now. But they won't be forever. Just look at top companies throughout the decades. In 30 years, Apple might deteriorate into a Kodak. Microsoft might deteriorate into an IBM.",
        "created_utc": 1636651614,
        "id": "hk8434j",
        "score": 66,
        "subreddit": "stocks",
        "created": 1636680414.0
    },
    {
        "author": "high_roller_dude",
        "body": "nope. more like next ibm as bear case. and next csco as best bull case.",
        "created_utc": 1636078417,
        "id": "hjd6nvt",
        "score": 46,
        "subreddit": "stocks",
        "created": 1636107217.0
    },
    {
        "author": "gnnr25",
        "body": "Apple was part of the old guard (IBM, Microsoft, Solaris, Novell, etc)",
        "created_utc": 1637178084,
        "id": "hl0z2a7",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1637206884.0
    },
    {
        "author": "Qarantyl",
        "body": "Also he picked maybe the single best performing company of the lot. People were saying the same thing about Cisco and IBM being great long holds and they're lower today than in 1999. AMZN is 1/1000 and there's no way you could have known what it would become in 1999, it was literally just a bookstore.",
        "created_utc": 1637193712,
        "id": "hl20gl3",
        "score": 30,
        "subreddit": "stocks",
        "created": 1637222512.0
    },
    {
        "author": "Chthroop",
        "body": "Hi.  Thanks for the write up and you rightly point to the need for excellent commercial execution\n\nI think we should be very clear on who the peers are for $PLTR.  \n\nIn no way is $SNOW a peer. Snowflake is a next generation, true cloud database . It’s a full SAAS model and it’s extremely strong at data analytics (though it can do true database work in a pinch).   It’s a general purpose tool that’s very simple to start using and requires zero setup and almost zero support.  Competitors include Amazon Redshift, Google BigQuery etc\n\nCompare this to $PLTR which is really an analysis / data integration platform that’s highly customized to users (so far mostly government) and has historically had a huge consulting requirement to setup.  \n\n$Ddog is also not a good comparison as it is an application, stack and now database monitoring toolset.  \n\nSo, who are the good comparisons /competitors? IBM Watson springs to mind.  But probably the best i can think of that’s publicly traded is Alteryx $AYX.  However Palantir is much “heaver” even that Alteryx\n\nAnyone have some better comp ideas?",
        "created_utc": 1637011641,
        "id": "hkrr0sn",
        "score": 29,
        "subreddit": "stocks",
        "created": 1637040441.0
    },
    {
        "author": "hopeitshelpful",
        "body": "This is a hard yes.  It’s great you’re seeing this trend, but it is nothing new, is fundamental to successful business at scale and is important to understanding both competition and the deflationary effects of technology.  \n\nLook at almost any business and you will see how it has been incrementally automated over the last 100 years.  It is necessary (not sufficient) to maintain as much automation or more than your competitors in order to scale and meet inevitable price deflation/“cost efficiencies”.  Think about the printing press to automate writing copies of books, IBM digital computers automating human “computers” (brilliant subplot of Hidden Figures movie), Xerox machines automating rapid copying of documents in the 70s/80s, email automating the postal service, industrial factory automation over the last 70 years, etc.\n\nThe rule for companies is they must adapt/evolve or die.  No other option unless you have a government-enforced monopoly (eg, patent protection or regulated utility).  \n\nWorkers face the same pressures, and their continually improving standard of living depends on it.  \n\n\nSource: am advisor to various Fortune 500 and tech companies, and my IP specialists help these companies find innovations used by competitors and other industries to stay ahead of the curve.",
        "created_utc": 1635948697,
        "id": "hj5eoj0",
        "score": 27,
        "subreddit": "investing",
        "created": 1635977497.0
    },
    {
        "author": "CHERCK_FLOKI",
        "body": "Please tell me this is a joke.\n\nIntel can’t hire half decent engineers. Their entire ecosystem is antiquated beyond belief. \n\nIf you can’t hire the brightest minds because your pay and equity structure is literally laughed at in the industry, then how you change structurally?\n\nEngineers laugh at intel because it’s a joke. Please don’t waste your money. This is the IBM of chip makers. Put that money elsewhere. Anywhere. Just not intel",
        "created_utc": 1636908847,
        "id": "hkltpxe",
        "score": 26,
        "subreddit": "stocks",
        "created": 1636937647.0
    },
    {
        "author": "Dan_inKuwait",
        "body": "I don't know how to put this nicely...\n\nBut paging zjz and me to the same issue is like alerting the CEO/CTO of IBM and pairing him with the guy that has nightshift urinal.cleaning duty in a small distict office somewhere in the middle of the Congo where the the town only has electricity on Tuesday afternoons.....  \n\nOne of those two individuals knows what's going on, the other is just there for the gum.\n\nMy pockets are full of used gum....",
        "created_utc": 1636560066,
        "id": "hk2xzed",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1636588866.0
    },
    {
        "author": "Kierik",
        "body": "Oracle, Intel, verizon, time warner, IBM,",
        "created_utc": 1636484447,
        "id": "hjywzm6",
        "score": 23,
        "subreddit": "investing",
        "created": 1636513247.0
    },
    {
        "author": "garlicroastedpotato",
        "body": "I mean, you could say the same thing about Amazon and Microsoft missing on opportunities.\n\nMicrosoft could have built: eReaders, smartphones, tablets, they could have made Chrome, gMail, Google, and Steam.... but let all of that slide to other companies who stole data from Microsoft.\n\nIBM has a massive company with massive amounts of infrastructure",
        "created_utc": 1636001719,
        "id": "hj8wank",
        "score": 22,
        "subreddit": "stocks",
        "created": 1636030519.0
    },
    {
        "author": "noveltieaccount",
        "body": "I wonder how much Microsoft needs to continue to innovate in order to exist. If I take Coca Cola as a counter-example, I think the company could be run by completely incompetent management and as long as they don't get over leveraged I think they will still be around. With Microsoft, are they more like IBM where their survival is dependent on their ability to continue to innovate?\n\nI think Buffet says something like a good business is one that an idiot could run. I'm not saying Microsoft isn't a good business, but I guess I could see in the next 100 years where an idiot gets his hands on Microsoft and puts it out of business.",
        "created_utc": 1637592896,
        "id": "hln6wuu",
        "score": 19,
        "subreddit": "ValueInvesting",
        "created": 1637621696.0
    },
    {
        "author": "filtervw",
        "body": "The market looks for future results. Intel at the moment looks like IBM when Azure and AWS came around. All promises, no gain. I worked at IBM in those times, the entire company could see what was happening, only the leadership and VPs were busy ignoring reality just to make their quarterly bonuses.",
        "created_utc": 1637257368,
        "id": "hl59c1q",
        "score": 19,
        "subreddit": "stocks",
        "created": 1637286168.0
    },
    {
        "author": "Ozzy4253",
        "body": "This or next decade. Depends if ion trapping is best approach or could go to nothing. Or maybe it pumps but does so before they reach major milestones like Tesla.\n\n\nIt's not just IONQ who are betting big on QC, Google, Honeywell, IBM, Intel, Rigetti and some non-public companies D-wave, PsiQuantum, Xandu are all big players. Chinese companies as well. High risk, high reward. Remember to do your DD.",
        "created_utc": 1637191970,
        "id": "hl1wl5t",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1637220770.0
    },
    {
        "author": "EpicDumperoonie",
        "body": "Treating them like ibm in what way? Ibm sold off a lot of businesses over the years and intel is releasing their 12th gen cpus which have good reviews.",
        "created_utc": 1636664107,
        "id": "hk8z2g3",
        "score": 15,
        "subreddit": "ValueInvesting",
        "created": 1636692907.0
    },
    {
        "author": "Edz_",
        "body": "Yea man nice you bought a 100 billion company (that's the equivalent of IBM or 3M) with literal 0 revenue at pretty much the top.",
        "created_utc": 1637692606,
        "id": "hlss0h0",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1637721406.0
    },
    {
        "author": "ETHBTCVET",
        "body": "Intel arleady is the IBM, PFE or HP of the stocks, it fucking trades sideways since the dotcom, if I was heavy on Intel since 2000's I'd be pissed especially because it had monopoly since like core 2 duo.",
        "created_utc": 1636883141,
        "id": "hkkjg06",
        "score": 13,
        "subreddit": "stocks",
        "created": 1636911941.0
    },
    {
        "author": "charsons",
        "body": "Ah I think I’ve figured out how IBM trades. When the market pumps, it dumps. When the market dumps, it also dumps.",
        "created_utc": 1635778556,
        "id": "hiw1vf3",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635807356.0
    },
    {
        "author": "GreyLaser",
        "body": "I wouldn't be too excited about quantum computing just yet. Regardless of what clickbait headlines would try to suggest, any significant quantum computing (other than very niche scientific applications and proofs of concept) is still decades away. Very much like fusion.\n\nHaving said that, if i had to pick an investment related to quantum computing, IBM is one of the main players in this field.",
        "created_utc": 1637024214,
        "id": "hkskneu",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1637053014.0
    },
    {
        "author": "pat-nasty",
        "body": "Another thing that I hated about options trading back when I did in the 90's was closing out stupid positions and/or opening stupid positions. I closed an IBM CSP at -88% with 22DTE and the guy was (concerned maybe) SO weird about it.",
        "created_utc": 1637654866,
        "id": "hlquxyo",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1637683666.0
    },
    {
        "author": "ETHBTCVET",
        "body": "Intel gives me that IBM and PFE vibes, forever a sideways stock.",
        "created_utc": 1636236696,
        "id": "hjlq7gf",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1636265496.0
    },
    {
        "author": "MajorSurprise9882",
        "body": "Lenovo are owned thinkpad brand from from IBM, it has reputation of durable and rugged laptop. Also it's the only laptop that certified to use on ISS",
        "created_utc": 1635954549,
        "id": "hj5th4a",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1635983349.0
    },
    {
        "author": "alwayswashere",
        "body": "Intel the next IBM",
        "created_utc": 1636538691,
        "id": "hk1ushq",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1636567491.0
    },
    {
        "author": "AZ-Jeeper",
        "body": "I’d like to put my life savings in IBM please... oh my god what the fuck is this place!!!",
        "created_utc": 1637727259,
        "id": "hluzq5l",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1637756059.0
    },
    {
        "author": "howtotailslide",
        "body": "IBM is one of largest players in the quantum computing space and was the first to have quantum cloud computing available.\n\nThey’re leading somewhere just not with major consumer level stuff anymore. I think they gave that up sometime when they sold thinkpad to Lenovo",
        "created_utc": 1636012903,
        "id": "hj9a6de",
        "score": 11,
        "subreddit": "stocks",
        "created": 1636041703.0
    },
    {
        "author": "spacequarks",
        "body": "Cloudflare is the future of cloud computing. Period. We use their workers product (edge compute similar to AWS Lambda) and running their R2 beta. Cloudflare also manages the insane mess that is DNS since we offer our SaaS with custom domains. \n\nAWS/GCP/Azure are gonna look like Oracle, IBM and Sun Microsystems in the future.",
        "created_utc": 1635997833,
        "id": "hj8pwfe",
        "score": 10,
        "subreddit": "stocks",
        "created": 1636026633.0
    },
    {
        "author": "Redditsome22",
        "body": "gonna roast ur IBM there only",
        "created_utc": 1636280968,
        "id": "hjnq8bb",
        "score": 10,
        "subreddit": "stocks",
        "created": 1636309768.0
    },
    {
        "author": "CoalFlavored",
        "body": "Maybe it’s hindsight bias, but I don’t think it’s as simple as “look at Kodak/IBM/GE” like everyone always says. It’s no coincidence that those three companies had their biggest stock market presence in generally the same era and have not been very relevant in the 2000s. Modern companies have probably learned to some extent how not to die from stagnation. MSFT is kind of lucky that their core business required evolution, and I don’t see a company like AAPL dying because they slept on innovation.",
        "created_utc": 1636652314,
        "id": "hk85vgm",
        "score": 9,
        "subreddit": "stocks",
        "created": 1636681114.0
    },
    {
        "author": "Difficult_Delay_8604",
        "body": "If you want to learn about technical analysis\n\n* Learn about trend indicators e.g. moving averages, momentum indicators e.g. Oscillators, volatility indicators e.g. Bollinger Bands, Volume indicators e.g. Chaikin Money Flow\n* Support and resistance lines\n* Read some books about technical analysis. This one is a good overview but it focuses more on futures but the stuff is generally applicable to stocks as well: \"Technical Analysis of the Financial Markets: A Comprehensive Guide to Trading Methods and Applications\". Use z-lib or some other book pirating sites\n* Try and stay away from price action because that's the most suspect of all technical analysis. On the other hand, algorithmic/system trading is arguably the most rigorous of technical analysis based strategies.\n\nIf you want to learn about fundamental analysis\n\n* Learn about multipliers and other fundamentals e.g. P/E, EBITA, EV.\n* Learn how to make financial models e.g. Here's Martin Shkreli teaching how to build a financial model with IBM as an example [https://www.youtube.com/watch?v=fASInVKShnM](https://www.youtube.com/watch?v=fASInVKShnM) (disclaimer, I think this particular valuation turned out to be wrong so focus more on the techniques/models used rather than specifics about the companies) and here's DeepFuckingValue valuing GME [https://www.youtube.com/watch?v=GZTr1-Gp74U](https://www.youtube.com/watch?v=GZTr1-Gp74U). I think they make this type of dry stuff more \"accessible\" for the average person?\n* Read some books. I've heard intelligent investor by Benjamin Graham is good, although I haven't read it so see what the others here think\n\nBut honestly, just buy ETFs and save enough to retire.",
        "created_utc": 1635755257,
        "id": "hiv2qos",
        "score": 9,
        "subreddit": "stocks",
        "created": 1635784057.0
    },
    {
        "author": "G_Money_Stacks",
        "body": "Ya you're right! I guess if dividends equates to incompetency, then you might want to stay clear of Visa, Apple, Nvidia, Coca-Cola, Microsoft, AT&amp;T, Verizon, IBM, Walmart, and countless other companies who are and have done really well for years. Those guys are clearly shady and incompetent and should not be invested in. Good call!",
        "created_utc": 1637800457,
        "id": "hlz0n62",
        "score": 9,
        "subreddit": "investing",
        "created": 1637829257.0
    },
    {
        "author": "No_Balance_3566",
        "body": "Surprised nobody talked about \n\n1. McDonalds \n2. IBM",
        "created_utc": 1637619951,
        "id": "hlp1d7y",
        "score": 9,
        "subreddit": "ValueInvesting",
        "created": 1637648751.0
    },
    {
        "author": "Randomusername8347",
        "body": "Quantum volume is the main one. If they were truly 100,000 times better than Google/IBM, they would have people begging them to take their money. \n\nI said this in another comment, but using this as a metric is akin to SpaceX launching 100,000 hobby rockets 100 ft and equating it to launching a single rocket 10,000,000 ft.",
        "created_utc": 1636352278,
        "id": "hjrwzqv",
        "score": 9,
        "subreddit": "stocks",
        "created": 1636381078.0
    },
    {
        "author": "Time_Kaleidoscope",
        "body": "Just when you think you’ve figured it out, INTC and IBM become relevant again and steal all the market share with quantum computing… \n\nprobably not",
        "created_utc": 1637567476,
        "id": "hlm6jpa",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1637596276.0
    },
    {
        "author": "slashrshot",
        "body": "AMD has a forward PE of 59\nINTC is 9.  \namd has alot of growth priced in.  \nIntel is priced like its going to become IBM.  \n\n1. Foundry Services - only real competitor is TSMC\n2. GPU - people dont believe intel could make a competitive GPU.  \nI have never seen intel fail if it tries it just got complacent. It also had an architecture day and their presentation seems solid.  \n\nto me, its an easy buy and hold what else is intel going to do? go to 40? amd has to keep growing every year to match their valuations.",
        "created_utc": 1637617996,
        "id": "hlowsf3",
        "score": 9,
        "subreddit": "stocks",
        "created": 1637646796.0
    },
    {
        "author": "soulefood",
        "body": "Microsoft is a software company. Quantum computing has different applications than normal computing and is more of a hardware thing. You're looking for the 1960s IBM of quantum computing, which ironically might be IBM.",
        "created_utc": 1637185371,
        "id": "hl1h3mh",
        "score": 8,
        "subreddit": "investing",
        "created": 1637214171.0
    },
    {
        "author": "7loUge",
        "body": "Sure they exist, we just don't for the most part know who they are. Amazon back in the early days looked pretty bad. IBM and GE back in the old days looked great. It's always a rise and fall. Mega caps won't go out of style--like Rome they aren't built in a day and don't fall in a day.",
        "created_utc": 1637031932,
        "id": "hkt22bi",
        "score": 8,
        "subreddit": "stocks",
        "created": 1637060732.0
    },
    {
        "author": "Intelligent-Lead-558",
        "body": "Honestly, 5 years from now PayPal might have a significantly less role in the pay space with companies like affirm and the whole space changing due to crypto. That whole argument of “5 years from now” doesn’t work for every stock. Companies like IBM who were tech giants have never recovered. If there is a changing landscape one has to be prudent and can’t just look at past performance as an indication of the future. Let’s be honest PayPal is not a Microsoft or something that like it’s a payment structure at the end of the day. Anyways I advise to be cautious.",
        "created_utc": 1637602242,
        "id": "hlntfz9",
        "score": 8,
        "subreddit": "CanadianInvestor",
        "created": 1637631042.0
    },
    {
        "author": "rawbdor",
        "body": "Hedge funds shorted gamestop. Hedge funds shorted gamestop to a degree where there were more shares out short than existed. This was problem number one. \n\nWhen you buy shares in your brokerage account like interactive brokers or ameritrade, you are technically buying from your broker. If your broker doesn't have the shares, he has to buy them from the market. This is usually fine, because whatever price your broker pays, your broker will charge you, for those shares. If you want to buy 100 shares of gamestop, and your broker doesn't have the shares, he will check the acquire the shares (with your money) from the national best ask. However, your broker now needs to wait 3 days for whoever he bought them from to deliver them. They are allowed up to 3 days to deliver the shares they sell you. \n\nAt the same time, huge volume of options were being traded in Gamestop. Tons of wsb apes bought options to the tune of 250 million shares. Only 50 million shares actually existed. Market makers and options sellers sold options to buy tons of shares because these market makers usually make tons of money selling options that expire worthless. Options brokers like Citadel sold tons of calls that they expected to expire worthless. If those calls expired in-the-money, Citadel (and others) would need to deliver 250 million shares to the people who purchased those options. Only 50 million shares existed. So now, not only did you have too many shares short (where everyone who was short was fucked), you also had options sellers effectively short (because the promised to deliver 250m shares that they didn't have).  \n\nThe options sellers needed to find 250m shares, Only 50m existed. The options buyers (normal folks on robinhood or ameritrade) were therefore owed 250m shares, but only 50m existed. If the options sellers could not deliver those shares, your broker (robinhood / ameritrade) would have been forced to go buy the shares on the open market. Remember, when you buy a call option, your counterparty is your broker. But your broker goes and gets it from somewhere else. Their counterparty is the options seller or the clearing house or somewhere else. If you buy a call option, you give your broker the $200, and he is your counterparty. But he takes your $200 and goes to citadel, and says \"Citadel gimme that option\" and Citadel says \"Ok, gimme the money\". Then it goes to the clearing houses for a few days for the trade to clear. \n\n money. Your broker (Robinhood) owes  you 100 shares. The options seller (Citadel) owes your broker (Robinhood) 100 shares. But they're trading through a clearinghouse, who has guaranteed the trade. So, if Citadel does not deliver the 100 shares to your broker, your broker has to deliver 100 shares to you anyway. He will need to go to the market and pay absolutely any price to get it. Your broker will then go to the clearinghouse and say \"You were supposed to give me 100 shares. You didn't. So I had to go buy it myself, again. You have to pay my bill\".  The clearinghouse will go to Citadel and say \"I was supposed to give 100 shares to Robinhood to give to Jimbob, but you never gave me the shares. Jimbob wanted his 100 shares. Robinhood had to pay $1000 for them. Robinhood wants me to cough up $1000. I just did. Now you need to cough up that $1000 to me.\"\n\nThis is the cascade. But remember, 250 MILLION shares were due to be delivered, and only 50 million existed. If the above situation happens on an IBM or a MSFT, it's probably not a big deal. The stock may rise 5-10% or something, but ultimately it's not an issue because there are plenty of shares available. But what if there are no shares available, and the people who own the shares refuse to sell at any price, and the options sellers MUST deliver the shares to teh clearinghouse so that they can deliver them to the brokers who can deliver them to the customers? What if the shares simply do not exist? \n\nNow you have a problem. Jimbob wants his shares. Robinhood tries to buy from the market, but there's almost zero available, and they sell for $10,000 per share. Robinhood cannot deliver the shares to their customers. Robinhood goes bankrupt, and goes to the clearinghouse and demands a solution. The clearinghouse goes bankrupt. The clearinghouse sues every counterparty to help deliver the shares. The counterparties go bankrupt. Citadel now can't repay any of their normal business operating debt, so the big banks lose billions. Stocks start tanking as everyone sells everything just so they can have cash to try to buy gamestop shares form the wsb apes who refuse to sell at any price. The market tanks, leading to any leveraged funds to go bankrupt. Etc etc etc.",
        "created_utc": 1637909601,
        "id": "hm4nqbs",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1637938401.0
    },
    {
        "author": "Lazy-Statistician-85",
        "body": "American Airlines, Boeing,  Tesla,  IBM, Carnival,  and watch Ford",
        "created_utc": 1636209957,
        "id": "hjk0up0",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1636238757.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "I bought IBM for other reasons, but they're the only company that is pretty much guaranteed to have a big slice of the pie if quantum computing ends up with a profitable use case.\n\nFor example, they're partnering with Raytheon. Somebody comes up with something, they'll have little choice but to license it to IBM to support defense use. But more likely, IBM will be on the forefront of any breakthroughs, because of their long-term investments in the engineering.\n\nGoogle will most likely cancel the program before it has results. Useful results are ***decades away***, and they cancel everything...",
        "created_utc": 1637020031,
        "id": "hksbcp6",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1637048831.0
    },
    {
        "author": "GroceryBright",
        "body": "Rule #1 Stonks only go up\nRule #2 don't forget rule #1\n\nNVIDIA and AMD are sexy right now, revenue and profits increased, great products, great potential but way overpriced.\n\nIntel is solid, probably underpriced, but the last few years have been poor in terms of product sentiment. AMD kicked their buts with their CPUs. Apple ditched them and released some of the most powerful CPUs in the market.\n\nEven if they deliver a great GPU in the coming months, their brand has been stained after years of reashing products, selling them for very high prices and no innovation. This is the main reason Apple ditched them and AMD as surged and is the darling of gamers and in the server space.\n\nSo Intel have a lot of work to do. They would need to compete with AMD on price, with Apple on performance and power consumption and probably with NVIDIA on computing power (GPUs).\n\nMy sentiment is that they are so far behing everyone else that in a few years they could be to CPUs and GPUs what IBM is today for PCs...\n\nObviously this is my bear scenario. They could turn it around and become an amazing company again, but my sense is that they need to really innovate very quickly in order not to lose any more market / relevance.\n\nHappy to be challenged on my thoughts.\n\nFor the last 20 years or so I have been jumping between Intel and AMD CPUs.\n\nBefore 2004, Intel probably.\n2004 - 2008 AMD\n2008 - 2018 Intel\n2018 - AMD\n\nAMD were dead around 2014 and they turned it around. Maybe Intel will manage to do it too.",
        "created_utc": 1636241514,
        "id": "hjm0pyp",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1636270314.0
    },
    {
        "author": "VisualMod",
        "body": "&gt;IBM Cloud Selects 3rd Gen AMD EPYC(TM) Processors for New Bare Metal Offering for Compute-Intensive Workloads\n$AMD\n\n^\\*Walter ^Bloomberg ^[@DeItaone](http://twitter.com/DeItaone) ^at ^2021-11-10 ^09:00:39 ^EST-0500",
        "created_utc": 1636552850,
        "id": "hk2gy1j",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636581650.0
    },
    {
        "author": "javiermex",
        "body": "To be fair it is a form of risk mitigation.\n\nI hate that it's like this, but for example if your company or corporation was doing better and the '90s like IBM then it is now than those pensions from back then would be dragging down your company down today, if not putting the corporation at risk of not being able to pay out those pensions.\n\nI guess the pension system relies on the future outcome. If your company shrinks in the future but you're still paying pensions out from the past it could really bite them.\n\nThere should be some type of system though I'm just not sure.",
        "created_utc": 1636776706,
        "id": "hkf5isp",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1636805506.0
    },
    {
        "author": "G1G1G1G1G1G1G",
        "body": "Intel has growth over the years Where IBM has majorly declined from sales to profit. So no.",
        "created_utc": 1636664100,
        "id": "hk8z1tq",
        "score": 7,
        "subreddit": "ValueInvesting",
        "created": 1636692900.0
    },
    {
        "author": "DavidAg02",
        "body": "IBM is a terrible example. Little to no chance that they outperform the market anytime soon (if ever). Only reason to hold IBM is the dividend.\n\nYour best bet is to cycle into sectors that aren't as risky in a rising rate environment... financials, energy, healthcare, etc.\n\nTech is traditionally the sector that does the best in a low rate environment, which is what we've been in and are now coming out of. Take your tech profits and move to a different sector.",
        "created_utc": 1637687147,
        "id": "hlsdtu4",
        "score": 7,
        "subreddit": "stocks",
        "created": 1637715947.0
    },
    {
        "author": "FinndBors",
        "body": "2000 dot com companies are equivalent to todays SPACs.\n\n2000 big tech like Intel, Cisco, HP, IBM are equivalent to todays big tech. Todays big tech valuations outstrip some of the big tech in 2000. Cisco did approach triple digit PE, but there’s also a popular internet retailer and a trillion market cap car company with high PEs too.",
        "created_utc": 1637539891,
        "id": "hlkrztp",
        "score": 7,
        "subreddit": "investing",
        "created": 1637568691.0
    },
    {
        "author": "notherday11",
        "body": "tbh I’m not sure IBM is actually competent enough to grow even in the scam space",
        "created_utc": 1636060600,
        "id": "hjc160h",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636089400.0
    },
    {
        "author": "neuromancer88",
        "body": "Possible, but I don't think it's likely\n\n1) Vertical integration is not really an advantage. It can be when you've got a monopoly and the market is booming (ie. run the factories at max capacity and sell everything you make). During a downturn you're stuck with a whole bunch of fixed costs which don't allow you to properly \"flex down\"\n\n2) You can make a chip that beats the competitor across the board, BUT... \n\n* is it as cost effective to produce? die size, manufacturing yields, etc..\n* even if both are equally cost effective... just the fact that AMD is now competing, Intel will never get back to the margins they printed during their dominant/monopoly phase\n\n3) Chip shortage... Intel makes a few kinds of chips and you can't take a broad based, global chip shortage and say that they will benefit. They primarily benefit when there is a shortage in PC related chips. They cannot simply decide to start making automotive chips\n\nSure, you can **project** a similar trajectory to MSFT... but MSFT is a rare unicorn which makes Satya Nadella one of my most admired CEOs. There are many more IBM, GM/Ford, Wang/Digital, Dutch East India Co, AT&amp;T, Nokia/Blackberry out there than there are MSFTs. **THIS** is what I would project.",
        "created_utc": 1636095563,
        "id": "hjdyjrh",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636124363.0
    },
    {
        "author": "peter-doubt",
        "body": "QQQ, VDO, VTI...  Index funds contain many popular stocks, like AAPL.\n\nSo why are you also holding AAPL? Because you want more % there, or because you're not  thinking about the duplication?  I'd do more ETFs that contain AAPL and ditch AAPL, or go the other way. \n\nAlso, IBM and MSFT... Current growth is in their cloud operations.. pick one, perhaps? (I'm not arguing the value of either, but why have both?)\n\nAll these ETFs/ indices, and tech sector focus... Without SMH? Why so? \n\nINTC is a weak link among these. \n\nAt your age, even bad moves will wash out over time.  How often do you rebalance?",
        "created_utc": 1636281175,
        "id": "hjnqgol",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636309975.0
    },
    {
        "author": "LL_2200",
        "body": "PLTR going back to 22. PLTR so going to be one of those boomer stocks where you look at it 10-20 years later and it’s basically the exact same price…..IBM T PFE",
        "created_utc": 1636552590,
        "id": "hk2ge6m",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636581390.0
    },
    {
        "author": "eyerollingsex",
        "body": "IBM trade at the same price it did in 1999\n\nThe stock is basically a savings account",
        "created_utc": 1636553497,
        "id": "hk2ic7r",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636582297.0
    },
    {
        "author": "schaferlite",
        "body": "Long term thoughts on IBM? \n\nSinking ship, or will it bounce back to 130+ territory?",
        "created_utc": 1637350566,
        "id": "hlale32",
        "score": 6,
        "subreddit": "stocks",
        "created": 1637379366.0
    },
    {
        "author": "biba8163",
        "body": "IBM CEO sounds like a scammer",
        "created_utc": 1636058199,
        "id": "hjbv2y3",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636086999.0
    },
    {
        "author": "Apha-apha",
        "body": "IBM Honeywell IONQ 🚀🚀🚀🔥",
        "created_utc": 1636346989,
        "id": "hjrp477",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636375789.0
    },
    {
        "author": "Zakiahmed1976",
        "body": "Try a few from my list:\n\nABR,ACRE, BIP, CNQ, GOOD, VLO, WHF, ED, EV, EVA, AVGO, COR, GAIN, GTY, IIPR, MPW, O, NEP, RY, ADC, XOM, STAG, EPD, TD, NLY, VZ, PM, DUK, IRM, WMB, IBM, SO, AZN",
        "created_utc": 1636824288,
        "id": "hkh7asv",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636853088.0
    },
    {
        "author": "workinguntil65oridie",
        "body": "IBM rev has declined QoQ for years their current portfolio is garbage except for Redhat growth.\n\nNot a dominant cloud player. Would do more dd first",
        "created_utc": 1636992197,
        "id": "hkqdv5x",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1637020997.0
    },
    {
        "author": "ddropthesoap",
        "body": "Was also Software Engineer at Big3 Cloud providers ( not including IBM ). I like Digital Ocean, but I'm not sure the upside is high. I had leaps at $105, and that went up 1500% and closed that position. DOCN is long, multi year play. Even Citron called $200 P.T., which is a lofty upper bound. I think $130-$170 is a realistic P.T. for DOCN over the next few years unless they have some blow out quarter.\n\nCloudFlare is uniquely positioned among cloud with a unique product line, including leading on serverless / edge computing.\n\nDigital Ocean is competing on VMs which is a margin business. The question is, how large is the niche for an easier-to-use cloud for hobbyist and smaller scale web applications? They already have a million users. How many developers are out there? This is unlike Shopify which has a much larger addressable demographic. They've been able to increase average spend per developer, but it's not a  multi-bagger.",
        "created_utc": 1637261788,
        "id": "hl5kniv",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1637290588.0
    },
    {
        "author": "BrianKronberg",
        "body": "Quantum cloud computing.  A 53 qubit quantum processor solved a problem in 200 seconds that would take the fastest super computer 2.5 billion years to solve.  IBM just announced a 120 qubit quantum computer and has a 500+ coming and a 1000+ slated for 2023.  They will be the new mainframe.  So much faster than any normal servers for specific workloads and so expensive that you will want to rent time on them instead of building your own.",
        "created_utc": 1637201098,
        "id": "hl2gmow",
        "score": 6,
        "subreddit": "investing",
        "created": 1637229898.0
    },
    {
        "author": "brutl_duess",
        "body": "Cowboys are a lot like IBM, past champions that everyone clings onto even though they’ve been sideways for decades.",
        "created_utc": 1636316862,
        "id": "hjpv5z9",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636345662.0
    },
    {
        "author": "I_DontRead_Replies",
        "body": "Have none of you guys ever learned the history of IBM? Way worse than anything listed thus far. They went on-site to concentration camps to sell and set up equipment to assist the Nazis. The Holocaust was conducted with IBM machines. I have no idea how this company is still in existence. They didn’t even change the name.",
        "created_utc": 1637419095,
        "id": "hle078u",
        "score": 5,
        "subreddit": "stocks",
        "created": 1637447895.0
    },
    {
        "author": "1011010110001010",
        "body": "Why invest in IONQ instead of a more established quantum company like IBM?",
        "created_utc": 1637869702,
        "id": "hm2k5nt",
        "score": 5,
        "subreddit": "stocks",
        "created": 1637898502.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "I posted about the McDonalds deal last week, a few people are talking about them.😉\n\n&gt;most big companies spinoff apart of their business because well it’s to unload all the garbage debt that the parent company (IBM owns). So all bad debt now going to that spinoff company\n\nThe real problem is that IBM has a longstanding, very successful managed IT services division. 30 years ago that was high margin, but now it is low margin. And now they're more focused on cloud services. These units are directly competing. And it creates confusion for existing customers. By spinning off the old-school part of the IT consulting services, they clarify things a lot. It can be awkward to negotiate contracts when you're competing with yourself. And the industry has moved strongly to \"hybrid cloud,\" with multi-vendor support, so they can get more money from the managed infrastructure clients in the spinoff, where those clients might choose some other cloud provider. And IBM can stay focused on being a cloud and AI provider.\n\nKyndryl isn't full of debt it is just low-margin and contains a lot of harmful redundancy that may thrive separately.\n\nIBM has been doing major partnerships for almost 100 years, they're not the sort of company that creates a bunch of debt they can't pay and have to stuff in a suitcase. Check their credit rating.\n\nThe Palo Alto deal sounds really good, that could be a big winner for both. The Cisco deal will likely be irrelevant unless Cisco finds a better angle for a 5G play. The Boston Dynamics thing may be pretty good, but it is always hard to tell with BD if it is just going to result in nice videos. The Raytheon thing is good for Raytheon in the short term, and in the very-unlikely event that quantum computing actually impacts computer security in the next 100 years, it will help them both to have a working relationship in place.\n\nIBM has a lot of other stuff going on too. They recently signed a deal to take over Honda's European finance and procurement operations. They've been \"global allies\" with Deloitte for over 20 years are going to offer a new AI-backed anti-fraud service to governments, for example to identify tax fraud.\n\nMost of what they do flies under the radar, but they've got a lot going on, and the extra free cash flow they'll get from spinning off the legacy IT will really help them.",
        "created_utc": 1635918453,
        "id": "hj465l7",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1635947253.0
    },
    {
        "author": "curiousprovisions",
        "body": "For some reason? They’ve dropped the ball for years and are looking like the IBM of the chip space",
        "created_utc": 1636935444,
        "id": "hknoqqo",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636964244.0
    },
    {
        "author": "TheDudeAbidesFarOut",
        "body": "Shout-out to IBM for the freebie!",
        "created_utc": 1636024075,
        "id": "hj9neu7",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636052875.0
    },
    {
        "author": "Pass_Little",
        "body": "No, it's not compariable.  Yet it is.\n\nThe underlying principle here is this:\n\nWinners Rotate.   \n\nIn 2000,  you would have been convinced that tech was the future because of the behavior of tech pre-2000.  And you should definitely buy it.\n\nIn 2007 you would have made the argument that tech hasn't done well since well, look at the last 10 years.  So you should buy anything BUT tech.\n\nNow in 2021, the argument is that tech has done well the last 10 years so you should buy it.\n\nIs tech going to crash like it did in 2000?   Not likely.   \n\nBut I do believe that the FAANG stocks are going to be replaced over the next 20 years as the top performers, just like GM, Walmart, Exxon, Ford, GE and IBM were over the last 20.       Even over the last 10 there have been drastic changes at the top of the pile.\n\nYou can pick pretty much any market segment and see periods where you thought it was the best thing ever, based on the past 10 years of performance.   And in many, if not most cases, each of those segments did more poorly the following 10 years.  Generally you can only tell what did well, not what will do well.",
        "created_utc": 1637533224,
        "id": "hlkd0vu",
        "score": 5,
        "subreddit": "investing",
        "created": 1637562024.0
    },
    {
        "author": "Si1verange1",
        "body": "So why did INTC \"report worse-than-expected Q3 non-GAAP revenue and issued Q4 adjusted EPS guidance below estimates?\"  Not trying to be snarky, but looking for a reason why this will turn around.  If Intel can't make bank in a worldwide chip shortage, then what are they even doing?\n\nIf you want to compare Intel to other dinosaur tech companies, then this is something IBM does, not Microsoft?",
        "created_utc": 1636091825,
        "id": "hjdu0gf",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636120625.0
    },
    {
        "author": "Alwayscorrecto",
        "body": "Intel will make the fall of IBM look like a success story.",
        "created_utc": 1636619549,
        "id": "hk6j53c",
        "score": 4,
        "subreddit": "investing",
        "created": 1636648349.0
    },
    {
        "author": "FormalWath",
        "body": "Not the whole market, there are certain sections that I would argue are *undervalued*. For every Tesla or Nio with insane market cap there is VW, for every AMZN or MSFT soaring on cloud prices there is IBM, which hasn't soared that much YoY but surprisingly has hands in a lot of cloud shit (thanks to Red Hat they bought few years ago).",
        "created_utc": 1637133440,
        "id": "hkymsrr",
        "score": 4,
        "subreddit": "stocks",
        "created": 1637162240.0
    },
    {
        "author": "scooter572021",
        "body": "Over 10 years the total return for IBM with dividends is 9.86%, less than 1% a year. After taxes it's negative. \n\nTheir buyouts went on far longer than five years. They were nonstop from 1986 til Rometty left. Here's a very good summary: [https://www.discerningreaders.com/an-ibm-case-study-do-stock-buybacks-work.html](https://www.discerningreaders.com/an-ibm-case-study-do-stock-buybacks-work.html)\n\nThe company turned to financial engineering rather than making use of the highly dedicated, intelligent staff they began the 1980s with. They fired the people they had promised lifetime employment to. Outsourced everything they could and spun off the rest.  Shortsighted management paid no attention to those in the trenches who had good ideas. It was a tragedy for what had been a wonderful company.",
        "created_utc": 1637336172,
        "id": "hl9jwko",
        "score": 4,
        "subreddit": "investing",
        "created": 1637364972.0
    },
    {
        "author": "bartturner",
        "body": "Maybe 50 years ago.  But do not think IBM has done anything innovative in a long time.",
        "created_utc": 1636024896,
        "id": "hj9omaa",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636053696.0
    },
    {
        "author": "KGOAT1",
        "body": "Well INTC isn’t innovating either, and plus their sales have DECLINED 1% YoY, when other tech companies have even doubled their sales YoY. Plus, INTC’s earnings always disappoint. IBM is very bad, too.",
        "created_utc": 1636910808,
        "id": "hklyj07",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636939608.0
    },
    {
        "author": "xkulp8",
        "body": "European investors favor big pharma, banks, grocery stores and mature tech over anything like fubo. Check out a 20-year chart of the euro stoxx 50. Imagine IBM, but an entire continent.",
        "created_utc": 1637475125,
        "id": "hlha1dq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1637503925.0
    },
    {
        "author": "mrh0057",
        "body": "Claims made by wall street veterans (people who discovered Enron, Bernie Madoff, etc).  These are acquisitions and haven't been proven yet.\n\nTelsa, GE, IBM, Facebook, the new alternative assets, SPACs,\n\nProven:\n\nTheranos, Wirecard, Nikola, Wells Fargo, JP Morgan\n\nJim Chanos who discovered a lot of the frauds in the 80s, 90s, and 2000s says right now it's worse he has seen which is amazing since the 80s(S&amp;L, Junk Bonds, etc.) and 2000s(Enron, Global Crossing, World Com, most of the mortgage industry, rating agencies, insurance, Madoff, Investment Banks, etc).\n\nIt's not possible to predict when exactly it will happen but as debt builds up the more unstable the system becomes.",
        "created_utc": 1637453355,
        "id": "hlg5ib4",
        "score": 4,
        "subreddit": "stocks",
        "created": 1637482155.0
    },
    {
        "author": "Investing8675309",
        "body": "There’s a reason nobody is talking about IBM. They’re a garbage dump backwater of tech that has missed every big trend since the mainframe.  Surprised these press releases didn’t include Watson. Long period of declining revenues and earnings and a slew of terrible CEOs (jury still out on Krishna, losing the Red Hat CEO was a bummer).\n\nThe Kyndryl spin-off is smart. They should jettison off Red Hat if they had any sense and just focus on being a contract solutions provider to large enterprise. This will still be the same IBM unfortunately after the spin off.\n\nI don’t understand why in the world anyone would buy this over companies that provide real cloud - ie Google. The rest of you can keep hawking IBM’s quantum, cloud, and AI expertise without having a clue what you’re talking about.",
        "created_utc": 1635915849,
        "id": "hj42943",
        "score": 4,
        "subreddit": "ValueInvesting",
        "created": 1635944649.0
    },
    {
        "author": "dbosspec",
        "body": "So at 35% to 100% more tdp against 2020 AMD chips intel performs better also more expensive ram. You don’t say lol good luck with IBM I mean intel bud",
        "created_utc": 1636056500,
        "id": "hjbqpjz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636085300.0
    },
    {
        "author": "Aggravating_Beyond_2",
        "body": "IBM -16%….oh wait, it’s already happened",
        "created_utc": 1636049800,
        "id": "hjb9ok6",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636078600.0
    },
    {
        "author": "TendieGatherer",
        "body": "IBM Cloud Selects 3rd Gen AMD EPYC(TM) Processors for New Bare Metal Offering for Compute-Intensive Workloads",
        "created_utc": 1636553336,
        "id": "hk2hzu2",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636582136.0
    },
    {
        "author": "featureenvy",
        "body": "I've had a lot of luck with SPY personally. I've held my shares for probably almost 10 years with fairly stable growth. \n\nAnother one I invested in more recently is QTUM which is a non-diversified quantum tech fund. I invested in this because I'm in software and am expecting quantum computing to pick up steam over the next 10-20 years. Invested in IBM for the same reason.",
        "created_utc": 1636406799,
        "id": "hjurbmn",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636435599.0
    },
    {
        "author": "abomb2155",
        "body": "I wish someone had told me to start earlier. I started investing small time when I got my first job out of college but would have loved to invest earlier with my part time school jobs. I only invested in things I knew back then like Apple and IBM (worked there so got a discount).",
        "created_utc": 1636728951,
        "id": "hkc6z2h",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636757751.0
    },
    {
        "author": "talm0",
        "body": "IBM entering levels for some LEAPs maybe. Maybe it’s just a turd, though, and will flush even lower.",
        "created_utc": 1636583986,
        "id": "hk4na0r",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636612786.0
    },
    {
        "author": "Ctofaname",
        "body": "IBM does not produce any chips anymore and have not for 6 years. IBM does not do any manufacturing what so ever anymore.",
        "created_utc": 1636993697,
        "id": "hkqhjeo",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1637022497.0
    },
    {
        "author": "AlmightySnoo",
        "body": "In the 60s we didn't have cloud computing. Now that changed, you can let a big company like IBM, Google or Amazon handle the huge quantum circuitry, and you as a client only put your quantum program on their cloud and they execute it on their quantum computer and you get your results shortly afterwards.",
        "created_utc": 1637176028,
        "id": "hl0txdz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1637204828.0
    },
    {
        "author": "coconutmofo",
        "body": "Can confirm. Was foreman on Stonehenge, apprentice on pyramids.\n\nCisco would be the foundation for the entire internet(web), which was the future.\n\nLike IBM was for computing in the 70s and 80s.\n\nLike MSFT was for Personal Computing in the 80s and 90s.\n\nLike Amazon (and Ebay) was(is) for ecommerce in the 2000s.\n\nNVDA will power the foundation for crypto, meta, etc, which is the future.\n\nThing is, it was all absolutely true.\nUp to a point.\n\nBut who knows when/where that point is?",
        "created_utc": 1637206172,
        "id": "hl2rn4p",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1637234972.0
    },
    {
        "author": "eomar2828",
        "body": "Intc has partnerships with IBM who recently announced (past 6 months or so) a 2nm chip. If INTC can get that in production in the next 4ish years they will be ahead of the game I believe. If that happens I would expect a big upswing .\n\nI like vale as a diversified play and specifically as a not crazy overvalued play on EV. Nickel is a primary component in batteries and will be in high demand soon.",
        "created_utc": 1637243695,
        "id": "hl4cbts",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1637272495.0
    },
    {
        "author": "robdeere",
        "body": "Commiserations to us.  Might get into IBM for the sympathy pump.",
        "created_utc": 1637183378,
        "id": "hl1c7ma",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1637212178.0
    },
    {
        "author": "jwonz_",
        "body": "It might be the next IBM",
        "created_utc": 1635792981,
        "id": "hiwzwrj",
        "score": 3,
        "subreddit": "investing",
        "created": 1635821781.0
    },
    {
        "author": "Otaehryn",
        "body": "I think they only cut small amount of company (6-9bn market cap), so this will not hugely affect them, except for less overhead.\n\nI think the underlying Red Hat business still has 20% growth but they are not optimal at managing it. I think it will take couple of more years for this to reflect on IBM growth, so I plan to continue holding. Price is also cheap now if you want to enter.",
        "created_utc": 1636122174,
        "id": "hjf29lt",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636150974.0
    },
    {
        "author": "stickman07738",
        "body": "Remember you need to remember that quantum computing will require significant cash and companies will need to be well-financed (like GOOG, AMZN, IBM) or need to continually raise capital typical by additional stock offering - this will happen to many small / new players.   \n\nHON is well financed but their quantum computing division is [proposed to merge](https://fortune.com/2021/07/21/honeywell-cambridge-quantum-computing-error-correction-quantum-volume-breakthroughs/) with Cambridge Quantum Computing - this is the one I am watching as they have been working in the area for over 10 years and are well-financed.",
        "created_utc": 1636457309,
        "id": "hjx9vuy",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1636486109.0
    },
    {
        "author": "sweetleef",
        "body": "By that logic alone, you could also include Intel, HP, Dell, Cisco, Oracle, Sun, IBM, and dozens of other companies that make good products you use daily, but have done nothing relative to NVDA/AMD.",
        "created_utc": 1636656487,
        "id": "hk8ggdc",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636685287.0
    },
    {
        "author": "mlord99",
        "body": "how much do you understand that shit about their new trapped gates that they are developing? I agree that IBM prototype is not scaleable due to the absolute zero requirement but ionq just might fulfill the DiVincenzo's criteria in a scalable way",
        "created_utc": 1636470959,
        "id": "hjxzbxk",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1636499759.0
    },
    {
        "author": "Thereg99",
        "body": "well I never assume that stocks reach levels that are projected.  I just ask if there is still meat left on the bone when I buy it.  In this case I figured 20% was worth taking at a 3xer.  Who knows.  its penny stocks.  its all a gamble.  this isnt investing in Apple or IBM",
        "created_utc": 1636752491,
        "id": "hkdrebk",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1636781291.0
    },
    {
        "author": "biba8163",
        "body": "- They had business enterprise servers and software.  They lost that.\n\n- They had enterprise consulting consulting services.  They lost that.\n\n- They were claiming to be the leaders in AI.  They lost that.\n\n- They were clueless about the rise of cloud computing.  They've already lost out on that.\n\nThe IBM CEO sounds like an impostor who scammed himself into the CEO position  using talking points in the super competitive tech space that requires vision and execution not only to stay relevant but just to survive.\n\n&gt; We have automation, security, consulting, etc and this will allow us to grow. We're going to leverage our partners for a win win win\n\nhttps://www.youtube.com/watch?v=UX8qldKluPU",
        "created_utc": 1637355609,
        "id": "hlayn4m",
        "score": 3,
        "subreddit": "stocks",
        "created": 1637384409.0
    },
    {
        "author": "PresterJohnsKingdom",
        "body": "Honestly some of the \"best value\" companies (looking at fundamentals) are those in \"unattractive\" industries... Exxon Mobile, Phillip Morris, Smith and Wesson, Dow Chemical....you get the idea.\n\nOil, cigarettes, guns, industrials...they aren't fancy, but they make money.  Check out \"The Growth Trap:  IBM vs Standard Oil\" and some Jeremy Siegel.",
        "created_utc": 1637239591,
        "id": "hl44jx0",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1637268391.0
    },
    {
        "author": "kokatsu_na",
        "body": "At a glance, from what I've seen, the quality of their voice-to-text is about the same as AWS/Azure produce or even better. The main problem with let's say Azure, is that text sometimes doesn't make any sense. Houndify can produce meaningful text and catch more nuances, voice recognition is great. But at the other hand, their text-to-speech sounds robotic. AWS/Azure is better in this field. Also, adoption of Houndify among developers is still quite low.\n\nSo it's more about contextual meaning. Their closest competitors are \"IBM Watson Speech to Text\" and Alexa I think (I might be wrong). The good thing about SoundHound is that they partnered with many car producers such as Hyundai, Mercedes-Benz, Honda, Daimler AG, which is a good sign for me. Can guarantee a long-term growth.\n\nI still need to take a second look, but so far it looks pretty promising 👍 Probably gonna invest in it.",
        "created_utc": 1637138935,
        "id": "hkytnja",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1637167735.0
    },
    {
        "author": "FactualNeutronStar",
        "body": "Maybe some companies in the next 10 years explode to become $10T market cap because of some revolutionary innovation, but there is really no reason believe Microsoft, Google, Apple, and Amazon are not here to stay. They are massively profitable and sitting on massive piles of cash. \n\nGE and IBM failed to innovate which, as far as I can tell, the current leaders have vowed to do the exact opposite. Exxon failed to adapt to the changing energy environment and accrued massive amounts of debt. And Walmart... is still not a bad investment.",
        "created_utc": 1637540897,
        "id": "hlku6n6",
        "score": 3,
        "subreddit": "investing",
        "created": 1637569697.0
    },
    {
        "author": "badgebruce",
        "body": " IBM CEO Arvind Krishna said Thursday that his firm's spinoff of Kyndryl Holdings (NYSE:KD) gives Big Blue \"the portfolio that allows us to grow\" and provides it with sufficient cash flow to invest in R&amp;D while still maintaining its dividend.  \nKrishna, who also serves as the company's chairman, told CNBC that the firm now has a portfolio focused on growth centers like Red Hat, automation, security and consulting.",
        "created_utc": 1636080779,
        "id": "hjdbmvp",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636109579.0
    },
    {
        "author": "Vast_Cricket",
        "body": "Spin off KD NOT split. You get KD today if you already possess IBM.",
        "created_utc": 1636050930,
        "id": "hjbcj13",
        "score": 3,
        "subreddit": "options",
        "created": 1636079730.0
    },
    {
        "author": "headshotmonkey93",
        "body": "Yeah it's a cult, but it's also what might fall Tesla on the head at a certain point. If Musk isn't open for new invention, he doesn't think high off, they might also fall behind. Maybe the name Howard Hughes says something to you.\nI realize that it looks fantastic now, but at one point we've also thought that about Microsoft, and all of a sudden Apple and Google have overtaken them left and right for making some failed decisions. \nBatterywise their competitors are already at their level. And Waymo is strong too. It's really just the car companies that need to get there shit together.\n\nThey look good, cause the other car manufacturers were old dinosaurs. Like what MS or Apple were to Compaq and IBM. But new players are always joining the market and change things too.",
        "created_utc": 1636136152,
        "id": "hjg289j",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636164952.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "These are both risky because they have a lot of expectations built in. For example, the price rise that NVDA got out of the ARM acquisition announcement presumes that they intend to behave in a monopolistic way, and can squeeze that market without vendors switching to RISC-V. And that the won't receive any significant regulatory response. Otherwise, the acquisition price makes no financial sense at all, it is just tossing money out the window. \n\nINTC has similar problems. People are bullish because they're building a fab. When they tried to contract out use of their existing fabs in the past, they did very poorly at it; they were greedy, they were unwilling to offer competitive prices. And when people wouldn't pay a premium just to have the honor of being their customer, they discontinued the service instead of lowering prices. And they made a lot of excuses about what had happened.\n\nBasically none of that is going to find its way into either technical or fundamental analysis. That is why I don't touch either of these stocks, and I prefer companies like AMD, AMAT, and even IBM. (What I like about IBM is that the bear case has been very popular, everybody can say something bad about them, and yet they're doing a great job of integrating their AI tools with the cloud and providing quality APIs to developers; and they're doing that while maintaining high margins and large revenue)",
        "created_utc": 1636318478,
        "id": "hjpzc1g",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1636347278.0
    },
    {
        "author": "sskyzz",
        "body": "That’s what everybody probably thought about Kodak/IBM/GE",
        "created_utc": 1636659304,
        "id": "hk8ndwu",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636688104.0
    },
    {
        "author": "Difficult_Delay_8604",
        "body": "If you want to learn about technical analysis\n\n* Learn about trend indicators e.g. moving averages, momentum indicators e.g. Oscillators, volatility indicators e.g. Bollinger Bands, Volume indicators e.g. Chaikin Money Flow\n* Support and resistance lines\n* Read some books about technical analysis. This one is a good overview but it focuses more on futures but the stuff is generally applicable to stocks as well: \"Technical Analysis of the Financial Markets: A Comprehensive Guide to Trading Methods and Applications\". Use z-lib or some other book pirating sites\n* Try and stay away from price action because that's the most suspect of all technical analysis. On the other hand, algorithmic/system trading is arguably the most rigorous of technical analysis based strategies.\n\nIf you want to learn about fundamental analysis\n\n* Learn about multipliers and other fundamentals e.g. P/E, EBITA, EV.\n* Learn how to make financial models e.g. Here's Martin Shkreli teaching how to build a financial model with IBM as an example [https://www.youtube.com/watch?v=fASInVKShnM](https://www.youtube.com/watch?v=fASInVKShnM) (disclaimer, I think this particular valuation turned out to be wrong so focus more on the techniques/models used rather than specifics about the companies) and here's DeepFuckingValue valuing GME [https://www.youtube.com/watch?v=GZTr1-Gp74U](https://www.youtube.com/watch?v=GZTr1-Gp74U). I think they make this type of dry stuff more \"accessible\" for the average person?\n* Read some books. I've heard intelligent investor by Benjamin Graham is good, although I haven't read it so see what the others here think\n\nBut honestly, just buy ETFs and save enough to retire.",
        "created_utc": 1635755257,
        "id": "hiv2qos",
        "score": 9,
        "subreddit": "stocks",
        "created": 1635784057.0
    },
    {
        "author": "Afrofreak1",
        "body": "We are talking multiple years here if not decades. Companies like Exxon. a.) They are in a dying industry and have been unsuccessful in pivoting away from fossil fuels to alternative sources of revenue. b.) They are a poorly run company that has had multiple CEOs in the past 10 years. c.) They have had declining revenue since 2014. d.) They are not reinvesting a lot of their profits back into the business because so much of it is released to shareholders as dividends. They know that that is one of the few reasons they are still in a lot of portfolios and ETFs. \"tHey pAy a HeAlThY dIvIdEnD.\" Yes, but as a result they are backed into a corner and their business plan is basically: Extract as much value from the business as possible while we still can. \n\nDoes that mean that you can't make money off Exxon stock? No, ofc not, and in fact it's one of the best performing stocks in the S&amp;P500 this year. However, a company that has peaked without any contingency plan to continued growth will never be able to match the returns of a company like Microsoft or Google that are growing 20+% Y-o-Y top and bottom line. I will happily pay a premium to companies that have an outstanding track record and ample room to grow and, more importantly, *the proven ability to seek out alternative sources of revenue*. That is not priced in because we don't even know where these companies are headed until they tell us. I am putting my faith in Nadella and Pichai to lead those companies to growth opportunities that investors hadn't even considered yet. \n\nMeanwhile back at Exxon they are just doing damage control to make sure that their dividend is paid at all costs. That is a terrible investment strategy and the difference in returns over the past decade show it. How likely is it do you think that Exxon will continue down this path and likewise for Microsoft and Google? I do not want companies that don't have a bright future ahead because the potential for sizeable returns is just so much smaller. Unfortunately, companies like Exxon still occupy a sizeable chunk in the S&amp;P500 because once-upon-a-time Exxon in particular was the largest company in the world by market cap. As a result, it drops the S&amp;P500s total return hence why I went with the NASDAQ-100. \n\nIt's not that I'm actively *picking* tech stocks, it's that I'm *removing* chronically underperforming companies like Exxon, Chevron, Wells Fargo, IBM, Ford, GM, etc. and the NASDAQ is the most similar to what an ideal portfolio would look like.",
        "created_utc": 1635773029,
        "id": "hivqasw",
        "score": 1,
        "subreddit": "investing",
        "created": 1635801829.0
    },
    {
        "author": "LegitimateShameHands",
        "body": "Gus Richard upgraded AMD on October 27th and downgraded them today while upgrading INTC. How can you change your mind and upgrade and again downgrade within 4 days wtf",
        "created_utc": 1635768886,
        "id": "hivj5jc",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635797686.0
    },
    {
        "author": "mrlumpus98",
        "body": "My intel $47.50c for 11/5 might actually print",
        "created_utc": 1635768922,
        "id": "hivj7im",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635797722.0
    },
    {
        "author": "mrkaluzny",
        "body": "Don’t sell AAPL. I think they’re going to 200 in 22 (depends on chips shortage) new MacBooks are flying off the shelves AAPL is supply bound but the margin on their own devices is higher then Intel-based ones. And this is not priced in IMO.",
        "created_utc": 1635753576,
        "id": "hiv110b",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635782376.0
    },
    {
        "author": "Wazoo_destroyer",
        "body": "1. Intel has been heavily supporting their share price, where would it be without them? Sub $40?\n2. Their p/e ratio reflects their market saturation, who are they going to steal market share from? They are the incumbent.\n3. And they will need every cent to build new fabs.\n4. Never say never, Intel is going to have to take on massive debt, in addition to the 30B they carry at present, to fund IDM2.0. If the CFO is looking for cash the dividend is easy pickings.\n\nTheir new weird CEO has stated intc is aiming for leadership in 2025, 3-4 years away. One thing to remember is this super cycle aside, the semiconductor biz is cyclical, boom and bust. In 3 or 4 years when demand drops off and both TSMC and INTC have built massive chip foundry capacity, where will the customers go? To the foundry with the best process. Whoever has overbuilt will suffer.",
        "created_utc": 1635760375,
        "id": "hiv80az",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635789175.0
    },
    {
        "author": "Wazoo_destroyer",
        "body": "&gt; The nm stuff isn't really accurate for any of them anymore so not worried about a rebrand.\n\nGate leakage and ultimately performance per watt is the real measure of a process. If one compares Tsmc and Intel fabbed processors on what both call 7nm, the tsmc silicon is easily better.",
        "created_utc": 1635759591,
        "id": "hiv75y6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635788391.0
    },
    {
        "author": "Gy7479",
        "body": "Well you create an account with them, then open a BTC or Eth wallet and send your crypto using the wallet adress (Bitcoin to Bitcoin, Eth to Eth). You have one free withdrawal per month, no length terms. Blockfi is only lending to institutions. Please take the time to read their whole website and FAQ, and take the time to read about sending and receiving cryptos, gas fees (transfer fees that you pay for every transaction), etc. I treat my cryptos like my stocks: long term hodler, passive income, aiming for 5% in cryptos for my portfolio. Mainly Btc and Eth, will add a few smaller coins eventually. \n\nAs usual, not your keys not your coins warning.",
        "created_utc": 1635775763,
        "id": "hivvreo",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1635804563.0
    },
    {
        "author": "TheRootOfMostEvil",
        "body": "The keys to financial independence are meme stocks and cryptos. 🔑🔑",
        "created_utc": 1635785768,
        "id": "hiwidpk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635814568.0
    }
]