[
    {
        "author": "BackThatThangUp",
        "body": "I will give you 2 zebra pelt and 1 lion tooth for Tesla stock",
        "created_utc": 1624854222,
        "id": "h3acnch",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1624883022.0
    },
    {
        "author": "ktn699",
        "body": "get a zebra. 1 year of 100 delta exposure for 25% of capital.",
        "created_utc": 1624396317,
        "id": "h2p2tu0",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1624425117.0
    },
    {
        "author": "cashflow_",
        "body": "There’s a zebra cobra in North Carolina. Can spit venom 9 feet. Sounds like my ex",
        "created_utc": 1625028593,
        "id": "h3izant",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625057393.0
    },
    {
        "author": "sloop703",
        "body": "Thoughts on TWNK? Lol \n\nZebra cakes were the shit",
        "created_utc": 1623250109,
        "id": "h15q8y5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1623278909.0
    },
    {
        "author": "wiseoldmeme",
        "body": "http://tastytradenetwork.squarespace.com/tt/blog/2020/6/26/the-zebra-set-up-tastybeats-june-22-26",
        "created_utc": 1624409841,
        "id": "h2psq0y",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624438641.0
    },
    {
        "author": "warren_534",
        "body": "That's one possibility.\n\nBut if you want a true synthetic long stock holding, then there are 2 ways:\n\n1. Long call combined with short put\n2. ZEBRA (zero extrinsic back ratio) - long 2 ITM calls, short 1 ATM call .. setup so that the extrinsic of the short call exactly offsets the total extrinsic of the 2 long calls. Typically, this means long 2x75 delta calls, and short 1x50 delta call.\n\nBoth of these give you a 100 delta position, which exactly matches just being long the stock. Both of these use options only. Both require less margin than holding the stock.\n\nThe ZEBRA is better, because it has lower risk than owning the stock or the long call/short put synthetic. And it gives a lot of flexibility to write another call against it if you like, and regularly roll that. And putting this on with LEAPS would give you the long term holding.",
        "created_utc": 1623369601,
        "id": "h1cefvc",
        "score": 3,
        "subreddit": "options",
        "created": 1623398401.0
    },
    {
        "author": "ChudBuntsman",
        "body": "The ZEBRA offsets time decay but Im not sure what youre doing it on. Theres no such thing as \"shares in VIX\"...if youre doing it on VXX you have to understand that those shares decay even if the VIX index stays flat due to the negative roll yield/contango. So as time passes, your underlying will  drift farther and farther from your strikes and will consequently require a far greater move in VIX for this to print.\n\n\nYou could do this same thing on puts in SPY and it would work better. Or, take a look at my comment history, I wrote some long posts describing other strategies in the past week",
        "created_utc": 1622745810,
        "id": "h0gzx34",
        "score": 3,
        "subreddit": "options",
        "created": 1622774610.0
    },
    {
        "author": "thepinionator",
        "body": "You're an absolute unit. Thank you so much. I've never heard of a ZEBRA before; it's quite elegant.",
        "created_utc": 1623977279,
        "id": "h25nlh1",
        "score": 3,
        "subreddit": "options",
        "created": 1624006079.0
    },
    {
        "author": "SamQuentin",
        "body": "Last 6 mos...\nNvda\nZbra\nCar\nCat\nHes\nJpm\nMrna \nVuzi",
        "created_utc": 1622853689,
        "id": "h0mtnmn",
        "score": 2,
        "subreddit": "stocks",
        "created": 1622882489.0
    },
    {
        "author": "GimmeAllDaTendiesNow",
        "body": "In my opinion a zebra spread is the best way to get -100 deltas outside of straight shorting stock. You could also do a poor mans covered put, which is the opposite of a covered call. It’s not -100 deltas but gives you a strong net-short position.",
        "created_utc": 1623987581,
        "id": "h266eo0",
        "score": 2,
        "subreddit": "options",
        "created": 1624016381.0
    },
    {
        "author": "tim2k000",
        "body": "what species? monarch, zebra long  wing, fritillary?",
        "created_utc": 1622863054,
        "id": "h0nao4k",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622891854.0
    },
    {
        "author": "ssamjjang",
        "body": "&gt;No time decay to worry about, since it's already addressed with the 1 short option.\n\nIs there really no time decay though? Wouldn't the theta from the 2 long options be greater than the theta from the 1 short option?\n\nThe ZEBRA example shown here (https://optionstradingiq.com/the-comprehensive-guide-to-the-zebra-strategy/) compares a AAPL ZEBRA with a AAPL call and the ZEBRA had a theta of -8.10 versus -8.66 for the call.\n\nDoesn't seem like much of a difference to me.",
        "created_utc": 1623790950,
        "id": "h1w6ees",
        "score": 1,
        "subreddit": "options",
        "created": 1623819750.0
    },
    {
        "author": "filth100",
        "body": "I only say this as the position you describe isn’t really going short. You’re risking the upside as if you was going short but you’re not gaining much as the stock dips lower. It usually a close to -100 delta strategy and therefore is nearly equivalent to a regular short position. \n\nIf you don’t know why you would prefer selling calls as opposed to going synthetic short but maybe you can outline that for me. \n\nMaybe a ZEBRA spread would be better. There’s -100 delta per spread however there is a debit paid for the spread but the breakeven is still typically at the spot price of the underlying as the Extrinsic value approaches 0.",
        "created_utc": 1623918219,
        "id": "h22f8bo",
        "score": 1,
        "subreddit": "options",
        "created": 1623947019.0
    },
    {
        "author": "warren_534",
        "body": "I'm primarily a directional swing trader in the futures and futures options markets, but will also do non-directional trades when conditions warrant it.\n\nI do buy options too, mainly as a substitute for a long or short futures position, generally in the indexes - ES, NQ, or RTY futures. I typically buy 75 delta ITM options, either outright or as part of a ZEBRA position.\n\nOther than that, then I do a lot of naked option or strangle writing in futures options when IVR/IVP are high, and credit spreads or iron condors when IVR/IVP are low.\n\nRight now, I have a lot of short strangles in corn, wheat, and soybeans, as the IVR/IVP have been in the 90s.",
        "created_utc": 1623532821,
        "id": "h1k0oc8",
        "score": 1,
        "subreddit": "options",
        "created": 1623561621.0
    },
    {
        "author": "rupert1920",
        "body": "I prefer other options as cover for the short call - for example, synthetic shares, ZEBRA, or a far-dated long call.",
        "created_utc": 1623541485,
        "id": "h1kg438",
        "score": 1,
        "subreddit": "options",
        "created": 1623570285.0
    },
    {
        "author": "Timafeo",
        "body": "Thanks for the detailed response! In this theoretical case margin wouldn't be an issue because it would always be less than actual stock ownership (unless in an IRA).\n\nThats an interesting point about dividends too. I was under the impression that short puts were almost always priced to accommodate the dividend. Though even if this is true, it does show a problem with other stock replacement strategies such as the ZEBRA (back ratio with calls).\n\nLastly, I see what you mean about volatility when it comes to strategies like the ZEBRA since a decrease would eat up the cushion to the downside, but shouldn't a true synthetic long have no extrinsic value (and therefore no fluctuations with volatility)?\n\nThanks again!",
        "created_utc": 1623415166,
        "id": "h1ea3kb",
        "score": 1,
        "subreddit": "options",
        "created": 1623443966.0
    },
    {
        "author": "girl_with_huge_boobs",
        "body": "lubed zebra butthole, duh",
        "created_utc": 1624812987,
        "id": "h387qt1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624841787.0
    },
    {
        "author": "Timafeo",
        "body": "If you want to mimic stock ownership, buy deep ITM leaps. Something with a delta of at least 0.7.\n\nAnother option is the more complicated strategy called a \"ZEBRA\". It simulates stock ownership with no decay to theta (and very little risk to volatility) *if* you are directionally right. If you're wrong and it starts to drop then you need to close the position and recenter it before theta and volatility contraction eat you. (in other words, it takes much more management but has a better upside).",
        "created_utc": 1624876890,
        "id": "h3b2esc",
        "score": 1,
        "subreddit": "options",
        "created": 1624905690.0
    },
    {
        "author": "GraysonMA",
        "body": "Theta will kick your ass. Consider zebra call spreads if you want leverage in a non margin account. They have more generous breakevens and don’t decay like calls.",
        "created_utc": 1625029430,
        "id": "h3j0ite",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625058230.0
    },
    {
        "author": "quiethandle",
        "body": "I might go long SFIX after thinking about it more. It has more room to move up than to move down. But if you buy a call, don't buy a out-of-the-money call before earnings because they will get killed due to IV crush. If you want to use call options to simulate stock in a way that won't get hurt from IV crush, take a look at the \"ZEBRA\": https://www.tastytrade.com/shows/options-workshop/episodes/the-zero-extrinsic-back-ratio-zebra-08-13-2018",
        "created_utc": 1622939767,
        "id": "h0qtlxp",
        "score": 1,
        "subreddit": "options",
        "created": 1622968567.0
    },
    {
        "author": "advan24r",
        "body": "ZBRA Zebra Technologies.  The industry needs inventory management.  They are used to track covid vaccines too.",
        "created_utc": 1622615835,
        "id": "h0abgyn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622644635.0
    },
    {
        "author": "ssamjjang",
        "body": "alright cool; guess i'll just to have play around with them myself to iron out all the intricacies of zebra. although it's a synthetic long, i'm sure there are scenarios where its behavior deviates from that of the underlying stock (i.e. when IV goes up). \n\nif you're looking to go leveraged long with limited downside (no margin-call) and trying to minimize the effects of greeks (theta decay and/or IV crush), is there a reason why you'd prefer zebras over something like a vertical debit spread?",
        "created_utc": 1623797760,
        "id": "h1wkrsg",
        "score": 1,
        "subreddit": "options",
        "created": 1623826560.0
    },
    {
        "author": "scottt1112",
        "body": "ZEBRA",
        "created_utc": 1625040991,
        "id": "h3jenso",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625069791.0
    },
    {
        "author": "SteamSteamLG",
        "body": "Zebra cakes are little Debbie not hostess",
        "created_utc": 1623250254,
        "id": "h15ql7s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623279054.0
    },
    {
        "author": "NobodyImportant13",
        "body": "For that zebra strategy:\n\nI don't trade options in my rIRA or IRA though, so I'm not sure if your broker can exercise if you don't have the funds to purchase the 100 or 200 shares.  Exercising also won't get you out of the short call as the counter party has the right but not the obligation to exercise.",
        "created_utc": 1623189470,
        "id": "h12x450",
        "score": 1,
        "subreddit": "options",
        "created": 1623218270.0
    },
    {
        "author": "Pipebendingfool",
        "body": "I’m more of a little Debbie type of guy. Zebra cakes are on point. \n\nNo deal 4 u sir",
        "created_utc": 1623809058,
        "id": "h1x6eun",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623837858.0
    },
    {
        "author": "Timafeo",
        "body": "That makes sense that the long leg would end up far OTM. Thank you for explaining that. \n\n&amp;#x200B;\n\nSo, here's a specific question: suppose I tried a Zebra in this case, as /u/LWinthorpe3 suggested. Since there is no extrinsic value in the spread when it's positive and the legs are deep ITM, couldn't I choose to exercise the option in order to get out of the position (in the event that I couldn't sell it due to low liquidity)? If I understand it right, exercising means giving up extrinsic value, but there is none when that type of spread is deep ITM. On the other hand, if I wanted to get out of the position after it turned against me, the contract legs would be much closer to the underlying's price and should therefore be easier to sell (even though this is where the extrinsic value risk is). Does this sound reasonable? I'm just working through this, so I'm sorry if I'm way off base.\n\n&amp;#x200B;\n\nSide note, I prefer your suggestion for the simulated stock with a put spread versus running a Zebra, since the dollar-to-delta is better for leverage, but I wonder if the Zebra may help with these liquidity problems.",
        "created_utc": 1623185373,
        "id": "h12o14h",
        "score": 1,
        "subreddit": "options",
        "created": 1623214173.0
    },
    {
        "author": "filth100",
        "body": "ZEBRA put spread on spy expiring 2023. You therefore have no extrsinsic value and you are effectively short 100 shares with a capped loss of $18,000 per $100 shares however when $SPY does fall massively you’ll be in a huge profit",
        "created_utc": 1622892726,
        "id": "h0oc7y5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622921526.0
    },
    {
        "author": "Timafeo",
        "body": "That's funny that you mentioned this. I've been looking for a reason to try Zebras! I like that there would be no value lost to theta decay so long as the underlying moves in the right direction. I wonder if this would work:\n\nLEAPS Zebra as a \"set it and forget it\" position, only managed if the position turns south and starts to risk theta decay. How would you suggest managing it? Also, would you take profits as it moves up (if so, how)?",
        "created_utc": 1623168039,
        "id": "h11j016",
        "score": 1,
        "subreddit": "options",
        "created": 1623196839.0
    },
    {
        "author": "Ok_Ad_526",
        "body": "Consider a zebra trade (synthetic stock). This Tasty trade episode even uses Apple as an example. https://www.tastytrade.com/shows/options-trading-concepts-live/episodes/zebra-stock-replacement-12-14-2020",
        "created_utc": 1624493908,
        "id": "h2twg5a",
        "score": 1,
        "subreddit": "options",
        "created": 1624522708.0
    },
    {
        "author": "professor_jeffjeff",
        "body": "This got a lot longer than I had anticipated, so had to split into three comments because reddit.\n\n&amp;#x200B;\n\nI think that picking a strategy is one of the hardest things to do.  I've been working on it for the past six months while I've been studying options and all the other shit that I didn't even know that I didn't know.  The only thing that I can say for sure that I've learned is just how little I actually know about how to trade in general.  I spent 6 hours yesterday stalking u/warren_534's post history and in the first 5 minutes I'm like WTF even is a ZEBRA, so there's another three hours later in the day yesterday learning a lot more about how delta works and realizing just how little I actually know about the greeks, as well as finally at least sorta understanding how buying power in a margin account actually works.  I've gotten conflicting advice from different people on different sources and the thing is that in most cases, none of those people are wrong.  Everything depends on so many things that it's just crazy.\n\n&amp;#x200B;\n\nI've watched a LOT of hours of tasty trade, but something felt off to me about them for some reason.  I did some research and I've found some shady shit, like that ordinary person who made millions on options trading is actually under investigation for fraud and their \"profits\" were only because they rolled the massive amount of debt they had forward perpetually so it never showed up on the balance sheet or something.  I've gotten some good info from them also though, so I think they're still decent but take any success story from them with a grain of salt.\n\nHere's a few things that I've learned.  I'm writing this out partially for myself too.  I'm experienced with stocks but not with options, so don't necessarily assume that I'm right about everything:\n\n* Risk management is stupid-important.  Read the Kelly Criterion for gambling (in the r/options wiki I think) and then read it again, then when you think you understand it go back and read it like two more times.  This is about getting rich slowly but consistently and having your wins outweigh your losses, so you absolutely have to manage your risk.  Max risk seems to be somewhere between 2% (conservative) and 5% of your total portfolio for a single trade.\n* Trade sizing is also stupid-important.  This is applied risk management.  Let's say I have a 2k portfolio, so that means a 5% risk is $100.  If GME is at $244 today and I buy 5 shares for $1220, then I need to bail if the amount of money I have from the shares is at $1120.  That means my stop loss is at $224.  Another way would be to see how far down I think the stock is likely to move based on some indicator, so maybe the total price range per day averaged over the past week.  My exit strategy then becomes my entry price - average daily range, so how many shares can I buy so that entry price - average daily range is less than $200?  There's a lot of other ways to do this as well since maybe I'll hedge with a protective put (not on a $2k portfolio but could on a larger one) so that adjusts my max loss but also the entry price of the position.  Better to just not trade GME though.\n* Exit strategy is important.  You never lose if you take profit, so who gives a shit if you missed out on making more profit because you still made profit.  Your goal isn't to make huge profits from a single trade with a YOLO, it's to make small profits consistently over time from many trades by doing something repeatable and at a small enough amount that you can afford to be wrong some of the time without tanking your account.\n* BTC, STC, BTO, STO are all stupid-important to get right.  If you accidentally a word when you enter a trade you could end up in a losing position by accident because you bought a put instead of a call or tried to close your position but accidentally opened a new position instead and now you're losing even more money.  Here's the thing:  It's &lt;action&gt; to &lt;thing&gt; where &lt;action&gt; is either buy or sell and &lt;thing&gt; is either open or close.  The first thing you do will have &lt;action&gt; to &lt;thing&gt;, so to close out the position you need to do &lt;opposite action&gt; to &lt;opposite thing&gt;.  Buy and Sell are opposites, and Open and Close are opposites.  Some online trading platforms have shit UI/UX (hey ToS, why the FUCK can't I get events on my fucking chart?  Fidelity, is there a reason I get three different charts that all have different lists of indicators?) so it's easy to select the wrong thing.  If you don't know what a condor looks like by seeing the order, you shouldn't be fucking trading condors.  Same with every other type of spread.\n* Buy and hold with dollar cost averaging on broad ETFs is a completely viable strategy.  If you invest $N every month and just split it between VTI, QQQ, SPY, and DIA, then you'll do fine after like 20-30 years.  If you're like 22 and just opened a Roth IRA after getting your first real job, then $500 per month will max the yearly contribution and you'll be at like $2 million at least by the time you hit retirement age.  Just convert that shit into bonds later on so that you don't lose all the money you made when you're old.\n* If you ask for a strategy on this subreddit, you'll get 10 people arguing over 12 strategies and then another 5 different people telling you why each of these strategies is terrible because of different reasons.  Listen to all of them because they're all right and all wrong.  All knowledge is power - Sun Tzu probably\n* Most people on reddit know precisely fuck-all about how taxes work.  I've seen more shit tax advice and provably wrong information on this subreddit than on r/WSB, although not by much.  Get a good tax weasel and pay them to answer your dumb questions.  \n* There's a thing called the Wash Sale rule that I don't entirely understand, but I think that if you sell a stock in December then don't buy that same stock or any options on that stock until Feb 1st.  Not sure if that's totally accurate; ask your tax weasel.  If you buy and hold, this will not apply to you because you will never sell.\n* Margin is dollars of interest, so ignore the actual interest rate.  If you have $20k of margin that you actually borrow to buy stock with and the rate is 8%, then that's $1600 of interest you'll pay over 1 year, and therefore about $31 per week.  If those shares are making you $50 per week in premium, then fuck margin interest.  That said, do NOT use your margin just for leverage on buying stocks.  Use it as a safety net if you need to rescue a trade and use the buying power it gives you to reduce the cash you need for spreads.\n* Spreads are a thing but when someone says \"oh just close it out before it expires\" they're assuming that you'll even be able to close it out or even roll it.  If you have a call credit spread and your short leg expires OTM but then goes ITM after hours, your long leg won't execute and now your risk goes from capped to \"oh fuck\" and you'd better hope that on Monday (or Tuesday if it's a holiday weekend) the stock you just bought with the margin that you don't have doesn't open down so that when your broker liquidates it you don't end up still owing them money.  DO NOT let a spread expire if it's even remotely near the money; fucking close that shit out and don't trade spreads if there isn't enough liquidity.  I've seen at least 10 people in various places online who got fucked by this exact thing and heard about a whole lot more.  InTheMoney did a [video](https://www.youtube.com/watch?v=uImgQWZofjA) about it.\n* I have a list of things to watch for that go on my calendar and I only do certain things around those dates.  These are dividends, earnings, and the Fed Open Market Committee meetings (FOMC).  There are ways to profit from these things and the uncertainty (and IV crush) that can happen around them, but I don't totally understand how to utilize those strategies so I just fuck right off in opening any positions if I'm in a week where one of those things is happening.\n\nTo be continued.",
        "created_utc": 1624500124,
        "id": "h2u83m3",
        "score": 1,
        "subreddit": "options",
        "created": 1624528924.0
    }
]