[
    {
        "author": "EitherToe",
        "body": "We are all in here for money, not for political garbage on what's right or wrong. Ignore the Reddit stupidity of \"HurRrH Durrrrr, cHIna BAd\" therefore stock go down. We see JP Morgan pull \"I did not take a bribe\" but here we are betting on them or some other unethical company. Didi even has Goldman Sachs, Apple and Uber buy-in/management/oversight. Alibaba has big names like Charlie Munger buying stock, most people wouldn't bet against these people/companies.\n\nBig tech USA is never going to win in Asia, this makes no sense. People here who think the Chinese government is going to let AWS or Microsoft run its software have done no research. A market of 1.4 billion, expecting to reach a greater GDP in 5 or so years is going to open its legs for the US? Let that sink in for a moment, the richest people in the US are owners of large US companies and supported by the US government. Is China dumb enough to let Amazon in and give them a free business that can't be controlled? Huawei failed outside of China but it's going to be building Chinese IoT infrastructure just like Cisco, Salesforce, AWS etc. \n\nChina already has its big tech equivalent, some of them turning volumes higher than their US counterparts. I won't push people to either side, just present some arguments. You bet on what you think will actually make you money given your risk tolerance.",
        "created_utc": 1626708070,
        "id": "h5rf1bs",
        "score": 28,
        "subreddit": "stocks",
        "created": 1626736870.0
    },
    {
        "author": "bewards",
        "body": "Company website is broken and incomplete, android mobile app has like minimal downloads, and their guideline videos for integrating with sites like shopify seem very early stage development (their CMS looks like a watered down salesforce embedded service chat queue). I'd be careful with this one, as I don't see anything that SF(MC) couldn't do.",
        "created_utc": 1626886002,
        "id": "h60sfso",
        "score": 15,
        "subreddit": "pennystocks",
        "created": 1626914802.0
    },
    {
        "author": "ItIsMrWilliams",
        "body": "VERB is a no brainer! Sold osme holdings to acquire VERB.\n\nThey also offer solutions for medical device sales. These companies have a lot of money to provide their salesforce with a modern platform that generates actionable leads and insights.\n\nUBER MEGA BULLISH",
        "created_utc": 1626276347,
        "id": "h55w8i9",
        "score": 13,
        "subreddit": "pennystocks",
        "created": 1626305147.0
    },
    {
        "author": "ORFOperon",
        "body": "Very well said. They even announced that they will follow where there customers go. They may have a lot of involvement in Microsoft, but they are also involved in Google, Salesforce and more recently looking to expand into Amazon web services.",
        "created_utc": 1626521151,
        "id": "h5i7pdk",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1626549951.0
    },
    {
        "author": "teslas_love_pigeon",
        "body": "Beyond retarded. Reminds me of the retards that were comparing PLTR with SalesForce, DataDog, and Splunk.\n\nBasically people with zero industry experience grabbing random companies for comparison.",
        "created_utc": 1626652722,
        "id": "h5ozcc4",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1626681522.0
    },
    {
        "author": "Daredizzle",
        "body": "Do you use Salesforce? It's been built upon itself for two decades and is a really necessary and clunky solution consolidating data. They've been keeping themselves alive by acquiring company after company which is all they have going for them. They've spread themselves so thin over hundreds of different services you can purchase to run your business on THEIR platform. If you ever want to try new software, you better hope they integrate with SFDC because you're so unfortunately entrenched that the amount of money you'd have to spend to get out from under Salesforce is too high. You're stuck. And you may have had 5 different Salesforce admins who all had their own opinions on how it should be set up and automated and odds are good no one has ever done any clean up efforts. So instead of smooth sailing, you've got thousands of orphaned records that get in the way of reporting, and your marketing and sales automations because they'll all get tossed in the mix too. \n\nNot a single person in tech likes using Salesforce. Not one.",
        "created_utc": 1625511537,
        "id": "h45mj9p",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625540337.0
    },
    {
        "author": "This_is_a_Crab",
        "body": "I have been working with Salesforce for 10 years... and anything that minimise Salesforce to a CRM only instead of looking at it as a Platform doesnt understand Salesforce at all.",
        "created_utc": 1626646466,
        "id": "h5om4wd",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1626675266.0
    },
    {
        "author": "Mortal1ty1337",
        "body": "Big cap tech:\n\nAmazon 9.9%\nAdobe 6.1%\nNvidia 5.9%\nAMD 5.6%\nFacebook 5.3%\nAlphabet 5.2%\nApple 5.0%\nMicrosoft 4.8%\nNetflix 3.9%\nSquare 3.9%\n\nSaaS:\n\nSalesforce 4.8%\nHubspot 4.2%\nDocusign 4.0%\nWorkday 3.9%\nDatadog 3.5%\nDynatrace 4.1%\n\nGaming:\n\nActivision 4.3%\nTaketwo 3.8%\nUnity 4.1%\n\nDogs:\n\nZilliow 4.7%\nC3.ai 2.9%\n\nI've sold some poor performers recently though; Aterian, Spotify, Redfin and Airbnb. I'm still 8pc below my Feb highs.",
        "created_utc": 1626335168,
        "id": "h5923hm",
        "score": 6,
        "subreddit": "stocks",
        "created": 1626363968.0
    },
    {
        "author": "Grey_Eye_22",
        "body": "20% compounded growth of revenue for salesforce since 2006 with \\~70% gross margins. Buying Stack and other companies and integrating it into their systems. \n\nPayPal has been doing a good job expanding Venmo and building out the online payment network. Expanding into a lot of other industries.",
        "created_utc": 1625509595,
        "id": "h45ioow",
        "score": 6,
        "subreddit": "stocks",
        "created": 1625538395.0
    },
    {
        "author": "Pdicky69",
        "body": "Wait, you just described a highly moated situation for CRM. I realize the software might not be as good but shit they are entrenched like a motherfucker. How is this not a good position to invest into?",
        "created_utc": 1625513336,
        "id": "h45q3k6",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625542136.0
    },
    {
        "author": "Summebride",
        "body": "I have low confidence in cab companies' abilities. \n\nHowever, on paper, it's not inconceivable.  \n\nUber is essentially an app with a map and a match-up algorithm, not different than say a dating app.  It's a smooth enough interface that includes a payment and review system.  That's it.  \n\nI don't see why someone couldn't code basically the same app.  Like say a cab company owner hires a few decent programmers.  Or a speculative software company writes the app and the licenses it out to cab companies the same way a jillion different CRM saas companies sell their mediocre customer service ticketing systems to everyone.  \n\nUber interface but without the actual headache of contracting drivers, being liable for anything, etc.  Just selling a software service and skimming a few percent off every dollar spent.",
        "created_utc": 1625954840,
        "id": "h4qv666",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625983640.0
    },
    {
        "author": "GeneEnvironmental925",
        "body": "CRM could definitely see a move up soon.  I wouldn't be surprised to see a dividend initiated within the next couple years.",
        "created_utc": 1626207260,
        "id": "h52qyxn",
        "score": 5,
        "subreddit": "stocks",
        "created": 1626236060.0
    },
    {
        "author": "chromelogan",
        "body": "What do you all think of Salesforce. I picked up 6 shares today. I know it has been trading sideways for a while but I feel like it is a great company with solid fundamentals",
        "created_utc": 1626206203,
        "id": "h52olpp",
        "score": 5,
        "subreddit": "stocks",
        "created": 1626235003.0
    },
    {
        "author": "high_roller_dude",
        "body": "hey I like your way of thinking on your investment thesis and your investing approach of longer term view. \n\nI own several on your list. \n\nI own TDOC, which I came to own via LVGO. my shares got converted into tdoc and cash last yr and been holding. not gonna lie the SP return on this past yr has really sucked. but it is a long term play for me and my cost basis is low so I am willing to see it play out. \n\nmy biggest winners last few yrs are also on ur list. I got into crwd, net, and pins all back in 2019. what monsters these companies have been. not sure if id chase NET or Crwd today, valuation is very stretched now imo. but do look out for buying opps. \n\nalso to balance out your portfolio and reduce beta allocate certain % of ur capital into more mature tech Co's with stable cashflows. i like crm and adbe in particular",
        "created_utc": 1625190156,
        "id": "h3r5z1x",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625218956.0
    },
    {
        "author": "Daredizzle",
        "body": "As someone who works near the CRM space in tech, I honestly wouldn't bank on Salesforce that hard. There is a pretty solid collection of tech startups all cusping on IPO that are trying to end Salesforce as a requirement to run a business. But that's just me.",
        "created_utc": 1625509828,
        "id": "h45j51f",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625538628.0
    },
    {
        "author": "Brown_Coat_Black_Hat",
        "body": "I'm not a fan of FB, meaning, I am not a power or casual user of any of their products. But here are the opportunities in front of FB.\n\n1. Instagram is the fastest growing social platform outside US\n2. They haven't started to monetize WhatsApp yet\n3. VR today is what EV was 10-15 years ago. But if you actually use a VR headset you would realize the potential. It's not just entertainment and workouts. It's gonna change how we do our day jobs.\n4. FB and it's products are ideal customer service (CRM) channels for brands. A lot of companies are already consolidating their existing channels in to messenger.\n5. Facebook pay (monetization within FB platform)\n6. Premium paid services like Twitter\n7. FB commerce is just getting started\n8. B2B (workplace products)",
        "created_utc": 1626049955,
        "id": "h4v8xn3",
        "score": 4,
        "subreddit": "stocks",
        "created": 1626078755.0
    },
    {
        "author": "JungAndReckless6",
        "body": "My take on valuation solely consists of the old Peter Lynch quote, “Investing in stocks is an art, not a science, and people who’ve been trained to rigidly quantify everything are at a disadvantage.” Another historical example was Massachusetts banning their residents from buying the Apple ipo because it was priced at 90x earnings and they thought the valuation would offer investors poor returns. The rules are constantly changing.\n\nIn my mind, it’s always been far more important to maintain cash flow into my portfolio and invest in super high quality management in expanding markets that should compound quite well for decades. If I believe NET is a 500b company in 15-20 years, there’s little reason to fuss about valuation, especially when it’s such an imprecise art. I understand it being more difficult getting in now, as my cost basis is significantly lower in most of the companies you mentioned (low 40’s in NET for example) but you really just need to commit to it.\n\nI also found it interesting that during the huge growth sell off, stocks like NET and CRWD didn’t pull back as hard as a PTON ROKU or TDOC (all 5 of which I own) and they immediately made new highs, saw huge institutional accumulation, and saw some crazy volume. People want to own these stocks, and valuation can’t reflect the qualitative.\n\nAlso, some of the items in your watchlist are cheaper than your portfolio btw, PINS ETSY CRM all have a fwd PE of 50-60 which is considerably lower than everything in your portfolio aside from the mega caps and probably CLF.\n\nI own CRWD NET ABNB PINS ETSY PTON SQ SOFI TSLA TDOC of everything you mentioned, and like most of the others.",
        "created_utc": 1625202032,
        "id": "h3rqr7r",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625230832.0
    },
    {
        "author": "imprezzive02",
        "body": "AI doesn’t make AI products. They are a software company in the same vein as CRM. Company has underperformed due to their clients inability to execute with their software. Long term they will be solid but it’s concerning in the short term. I’d be careful with options",
        "created_utc": 1626145252,
        "id": "h4zvmtx",
        "score": 3,
        "subreddit": "options",
        "created": 1626174052.0
    },
    {
        "author": "RedFish2488",
        "body": "Apple, Netflix, Salesforce",
        "created_utc": 1625541826,
        "id": "h476stb",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1625570626.0
    },
    {
        "author": "yeahyeah2468",
        "body": "What‘s your take on the popular growth stock names like SQ, SHOP, MELI, NET, CRM etc….\n\nStill good or have I missed the next generation of „growth“ stocks?",
        "created_utc": 1625673055,
        "id": "h4d66qf",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625701855.0
    },
    {
        "author": "hmchugh98",
        "body": "TLDR:  AvePoint is unusual in that it went public as a profitable company. Founded in 2001 as a provider of backup technology for Microsoft Exchange, the company has since become a major provider of SaaS technology for a wide swath of the Microsoft environment with 2020 revenue of $152 million, of which 75 percent is recurring revenue. The company estimates 2021 revenue to reach $194 million, of which over 80 percent will be recurring. We’re one of those rare SaaS, high-growth, but profitable, companies out there. There’s only seven other public companies like us trading on Wall Street today that have at least $150 million in revenue and at least 25 percent year-over-year growth, and that has at least 10 percent EBITDA profit margins. So that makes us quite unique. [We] have about $258 million cash on the balance sheet with no debt. We’re already multi-cloud. We follow the customer. Most customers today are multi-cloud. So we already have a product for Google Workspace. We have SaaS backup for Salesforce. And we can also already support Box and Dropbox. Customers today are multi-cloud. They may use Microsoft 365 for their office work, for their email, but they could be using Box or Dropbox file share, they could be using Salesforce for CRM, and even AWS for compute.",
        "created_utc": 1625839296,
        "id": "h4lbhyf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625868096.0
    },
    {
        "author": "Ischmetch",
        "body": "I think CRM is a solid play.",
        "created_utc": 1626220964,
        "id": "h53j67p",
        "score": 3,
        "subreddit": "stocks",
        "created": 1626249764.0
    },
    {
        "author": "brund0gg",
        "body": "CRM is prime",
        "created_utc": 1626194704,
        "id": "h51ylo1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626223504.0
    },
    {
        "author": "_foldLeft",
        "body": "Waiting years for CRM to go up",
        "created_utc": 1626189931,
        "id": "h51nqwc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626218731.0
    },
    {
        "author": "LeocantoKosta_",
        "body": "I think gaming stocks suck. Would rather own more AMZN, MSFT, AMD, NVDA for gaming exposure. \n\nSaaS is great, check out NOW, I like them better than CRM or Workday.\n\nWould suggest adding some value oriented names or an ETF as a counterbalance. UNH, KKR, MDLZ, SHW, TGT are good ideas.",
        "created_utc": 1626365906,
        "id": "h5agsnz",
        "score": 3,
        "subreddit": "stocks",
        "created": 1626394706.0
    },
    {
        "author": "zethras",
        "body": "Shop and SQ will be going higher by the end of the year. With the current tragectory Shop might hit 1700 or higher and SQ might reach 280 (previous ATH). CRM will also keep going up like always.\n\nNot sure about the other companies.",
        "created_utc": 1625675535,
        "id": "h4dbune",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625704335.0
    },
    {
        "author": "interrobangbros",
        "body": "I’d venture to guess having &gt;50 individual stock positions is somewhat rare for the average retail investor and &gt;100 and very rare. That’s why you’ll get people who see “I have 100 positions” who instantly respond with “lol you’ve only built an ETF.” I’ve had plenty of people tell me that when I’ve mentioned how many positions I have. They say I’m diversified too much with the added risk of picking stocks. What they fail to ask if what are my holdings in. Currently, nearly 3/4 of my portfolios are in IT, consumer discretionary, and health care. I’m far from diversified. I also only have 29 stocks that are in SPY and 19 that are in QQQ. I am seeking response risk since I plan to be invested for 30+ more years. \n\nJust realized I’m rambling about me lol. In regards to your positions, I’ll stick with what I originally said. Sell anything you don’t have 100% conviction in. It doesn’t have to be a mass selling. You could do it over 6-12 months or something. I have a Sell Watchlist that I occasionally add positions to that I’m wavering on. I’ll pay a bit more attention to them, news around them, their earnings, investor call, etc. to see if my investment thesis still holds. If it doesn’t, I sell. A stock usually sits on that watchlist for 3-6 months before I sell it or decide I still want to be invested. It works for me. Maybe something like that would work for you and help you pare down from 150 to only the companies you really want to own. \n\nI perused your list. I don’t recognize some and don’t have the time to look them up now but my 2 cents on a few that aren’t in your keep section:\n\nI own and wouldn’t consider selling: APPN, CRWD, ETSY, ISRG, MELI, SE, SQ, ZS, AMT, \n\nI own and wouldn’t consider selling but would understand why someone else would: APPH, FSLY, NIO, SNOW, TDOC, \n\nI don’t own CRM but I expect I will soon. \n\nOf the ones I mentioned above, MELI and ISRG are two of my highest conviction holdings. MELI in particular. It’s my 3rd largest position. They are an incredible company growing shockingly fast (hello Mercado Pago!) and they aren’t even an 80B MC company yet. I could see them 5x in the next 10 years.",
        "created_utc": 1625976603,
        "id": "h4rx6gp",
        "score": 3,
        "subreddit": "stocks",
        "created": 1626005403.0
    },
    {
        "author": "No_Werewolf_1214",
        "body": "No TSLA, no BABA, no CRM, No SHOP, no JD, no MELI. \n\nOtherwise you’re good with what’s on the list.",
        "created_utc": 1625511396,
        "id": "h45m96k",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625540196.0
    },
    {
        "author": "ALL_GRAVY_BABY",
        "body": "Salesforce\n\nGoogle\n\nHalliburton (kinda)\n\nCoca Cola and Pepsi/Frito Lay\n\nHome Depot and Lowe's",
        "created_utc": 1626313646,
        "id": "h584apf",
        "score": 3,
        "subreddit": "stocks",
        "created": 1626342446.0
    },
    {
        "author": "Jeffamazon",
        "body": "No doubt it’s a great business but future revenues are both incredibly optimistic and already priced in. Moreover their software is extremely bespoke thus not as easily scalable as a Facebook, Google, or Salesforce would be.",
        "created_utc": 1626996195,
        "id": "h66q7k4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1627024995.0
    },
    {
        "author": "Nomadic_Marvel07",
        "body": "CRM 300c 8/20? 10 bagger? Easy Mode?",
        "created_utc": 1627006784,
        "id": "h67afbt",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1627035584.0
    },
    {
        "author": "madspiderman",
        "body": "They are doing salesforce model. Invest and sell them your product. Get them locked in for life",
        "created_utc": 1626918675,
        "id": "h62td2t",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1626947475.0
    },
    {
        "author": "confusedp",
        "body": "CRM is a long term undervalued play. They have a solid growth and stable profits. Maybe it is too much of a boomer like stock but putting some of your chad money on the side for plays like this doesn't hurt in the long run.",
        "created_utc": 1625135841,
        "id": "h3o26f3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625164641.0
    },
    {
        "author": "kygah0902",
        "body": "I’m curious: why no SHOP, CRM, or MELI?",
        "created_utc": 1625512912,
        "id": "h45p9j6",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625541712.0
    },
    {
        "author": "Getsiv",
        "body": "It’s not a list of “greatest returns”. It’s a just a list of “popular winners”. All big names. **Major** players. I’d be surprised if any didn’t know all of them except Nvidia and maybe Salesforce or Adobe but they’re long shots.\n\nTons of other stocks would make the “+300% over the last 10 years”.",
        "created_utc": 1625690580,
        "id": "h4ea5xv",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1625719380.0
    },
    {
        "author": "Bitcointhummper",
        "body": "CRM to buy out WORK probably at month end. Stock &amp; cash merger. One of the biggest buy outs in tech history... 📉\n\nMy portfolio will be hedged with CRM and NVDA puts instead of SPY puts EOM",
        "created_utc": 1626122751,
        "id": "h4ynksv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626151551.0
    },
    {
        "author": "DookieBrains_88",
        "body": "I spoke with them about this earlier today. Wasn’t sure if my position was closed out or what. \n\nYou’ll get shares of Slack (CRM) in comparison to what you owned in Slack (WORK). You should get roughly ~.25 shares of $CRM for every share of $WORK you had",
        "created_utc": 1627010733,
        "id": "h67i232",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1627039533.0
    },
    {
        "author": "Personal_coach",
        "body": "Guys, if you didn’t buy $SNOW ❄️ last week you might consider $CRM next week🚀",
        "created_utc": 1625857094,
        "id": "h4me94n",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625885894.0
    },
    {
        "author": "Orvilleengineer",
        "body": "Any thoughts on what could be causing productivity stocks to be in the red today?  (CRM, MSFT, AMZN, ZM, etc)?",
        "created_utc": 1625859190,
        "id": "h4mink5",
        "score": 2,
        "subreddit": "investing",
        "created": 1625887990.0
    },
    {
        "author": "DookieBrains_88",
        "body": "Don’t hold me to the number exactly. It was more along the lines of .24xxxx but used .25 for ease. \n\nEither way, I’m happy about the merger. Slack looked like it was pretty much settled around the $44 mark where CRM has great potential",
        "created_utc": 1627012069,
        "id": "h67kfek",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1627040869.0
    },
    {
        "author": "Personal_coach",
        "body": "$CRM LONG RUNWAY 🚀",
        "created_utc": 1626184494,
        "id": "h51c481",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626213294.0
    },
    {
        "author": "Qauaan",
        "body": "Except for CRM that I decided to sell before earning. You are all welcome!",
        "created_utc": 1627421154,
        "id": "h6r6d09",
        "score": 2,
        "subreddit": "stocks",
        "created": 1627449954.0
    },
    {
        "author": "callsmeal",
        "body": "Salesforce Ventues is the part that sounds good to me.",
        "created_utc": 1626383550,
        "id": "h5blqxx",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1626412350.0
    },
    {
        "author": "[deleted]",
        "body": "if you are not buying great trio of e-commerce $AMZN + $SHOP + $CRM than you just don't like to gain money",
        "created_utc": 1625580294,
        "id": "h48lcyb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625609094.0
    },
    {
        "author": "geniusmanchild",
        "body": "CRM is an amazing pick tbh",
        "created_utc": 1626194865,
        "id": "h51yz0t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626223665.0
    },
    {
        "author": "stevoacp1",
        "body": "CRM only goes down or sideways",
        "created_utc": 1626119313,
        "id": "h4yg2ob",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626148113.0
    },
    {
        "author": "NobleSociety",
        "body": "I'm currently holding 45 shares of CRM. It is the largest part of my portfolio, and has done very well since I got it at $97. I know it's not GME or AMC, but seeing prices fluctuate as much as those have, I really don't want to \"keep all my eggs in one basket\". Would it be worth it to sell some shares and put them into something safer like an ETF, or at least diversify a little bit more?",
        "created_utc": 1626814622,
        "id": "h5x69nc",
        "score": 2,
        "subreddit": "investing",
        "created": 1626843422.0
    },
    {
        "author": "greytoc",
        "body": "For each share of Slack that you owned, you should have received $26.79 in cash and 0.0776 share of Salesforce. Are you sure you have a loss? CRM was up 2.5% today.",
        "created_utc": 1626991719,
        "id": "h66gz58",
        "score": 2,
        "subreddit": "investing",
        "created": 1627020519.0
    },
    {
        "author": "Jeermm",
        "body": "FB, AAPL, AMZN, MSFT, GOOG. add NVDA, CRM, IBM, ADBE, ORCL, SNOW, TEAM, and PATH.",
        "created_utc": 1627193257,
        "id": "h6g4p59",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1627222057.0
    },
    {
        "author": "high_roller_dude",
        "body": "dude i hope ur right. crm has been my worst performer past 2 yrs. i got in at $150 avg cost and this thing has really sucked, compared to msft, aapl, nvda, adbe, etc etc",
        "created_utc": 1625529866,
        "id": "h46leuk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625558666.0
    },
    {
        "author": "AngelaQQ",
        "body": "ZM is already the most value-priced SaaS stock other than CRM from a forward p/e perspective, so Zoom I guess.",
        "created_utc": 1626034827,
        "id": "h4udlql",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626063627.0
    },
    {
        "author": "Bitcointhummper",
        "body": "Can’t wait to buy a fat put on CRM",
        "created_utc": 1626118957,
        "id": "h4yfaug",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626147757.0
    },
    {
        "author": "imlaggingsobad",
        "body": "Chuck in paypal, nvidia, salesforce and disney, and you have a great mega cap tech portfolio that will almost certainly beat SPY.",
        "created_utc": 1626245872,
        "id": "h54ndt5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626274672.0
    },
    {
        "author": "bullishchilipepper10",
        "body": "CRM calls following a red day usually work for me",
        "created_utc": 1626314862,
        "id": "h586nhx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626343662.0
    },
    {
        "author": "4Ublue",
        "body": "Optimistic but you should  see good returns with those.\n\nThe common thread among 1 trillion companies today is they are all consumer facing companies with a range of revenue streams.\n\nI'd say Salesforce being mostly B2B software has probably got limited upside, but should be a solid compounder in the long run.",
        "created_utc": 1625571007,
        "id": "h4867m8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625599807.0
    },
    {
        "author": "Bitcointhummper",
        "body": "I got MRNA, NVDA and CRM puts",
        "created_utc": 1627361481,
        "id": "h6o8v03",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627390281.0
    },
    {
        "author": "potatosalad_123",
        "body": "their 10K says “Salesforce, Microsoft, Oracle, SAP, and Adobe” are their main competition",
        "created_utc": 1626378342,
        "id": "h5b9xwn",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1626407142.0
    },
    {
        "author": "GlobalOwl3",
        "body": "Love this analysis. Buy CSCO CRM HLT as they are #1s from last few years?",
        "created_utc": 1626349354,
        "id": "h59iwxb",
        "score": 1,
        "subreddit": "options",
        "created": 1626378154.0
    },
    {
        "author": "DoDaOpposite",
        "body": "CRM or CLF",
        "created_utc": 1627182809,
        "id": "h6fppsx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627211609.0
    },
    {
        "author": "Personal_coach",
        "body": "$CRM LONG RUNWAY",
        "created_utc": 1626436762,
        "id": "h5dyux9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626465562.0
    },
    {
        "author": "bourbonburn",
        "body": "Go subscribe to Motley Fool Stock Advisor or Rule Breakers, either one, and start learning about investing. Put 20-30% in QQQ and the rest into individual stocks like ETSY, MELI, LULU, CRM, NET, and any other growth stock you research and like over time.",
        "created_utc": 1626924853,
        "id": "h635cs5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626953653.0
    },
    {
        "author": "hendrix_srv",
        "body": "T &gt; **STRONG SELL**\n\nT has no chance of being a beneficial investment \\*ever\\*.  It's done, it's toast.  It's a dial phone.\n\nThere are literally hundreds of easy choices that will outperform T over \\*forever\\*.  I'd rather have 37% of my portfolio in IRBT or CCL, but you could have SHOP or ROKU or PYPL or SQ or NKE or FB or COST or HD or CRM or AAPL or ADBE (full disclosure, I own some of those stocks).  \n\nreiterate: strong sell!!",
        "created_utc": 1626921327,
        "id": "h62ys3j",
        "score": 1,
        "subreddit": "investing",
        "created": 1626950127.0
    },
    {
        "author": "superman_565",
        "body": "\"FAANG\" = Consumer facing companies, not corporate. Adobe and Salesforce are huge in their own domains, but they are for corporate workers and not your average consumer. Therefore, they are not included in the acronym. \n\nWhile Microsoft might dominate with Azure and Office, those are corporate products, unlike Netflix.",
        "created_utc": 1626921097,
        "id": "h62ybmn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626949897.0
    },
    {
        "author": "AppleTree98",
        "body": "Salesforce is shockingly expensive for the enterprise customer. This will only add to that cost. This looks like a mega-acquisition that is doomed to fail IMO. Smells like AT&amp;T buying ....well any of their last multi-billion dollar escapades \n\n2015, AT&amp;T purchased DirecTV for $48.5 billion\n2016, AT&amp;T announced a deal to buy Time Warner for $108.7 billion\n2017, it was reported that AT&amp;T would introduce a cloud-based DVR streaming",
        "created_utc": 1626930386,
        "id": "h63e9s7",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1626959186.0
    },
    {
        "author": "greytoc",
        "body": "So that means that you should receive $80.37 in cash and 0.2328 shares of CRM. You are now a fractional Salesforce shareholder. (assuming that your broker supports fractional shares)\n\nSo your original investment of WORK is worth \\~$138.17 at close today.\n\nIf you were holding WORK - that's about $46.05/share.\n\ntl;dr - you don't have a loss.",
        "created_utc": 1626994593,
        "id": "h66mzdd",
        "score": 1,
        "subreddit": "investing",
        "created": 1627023393.0
    },
    {
        "author": "tay_clem",
        "body": "Well that’s a relief. I was really worried that money would just disappear\n\nI’ll def have to keep an eye out so I can understand what’s going on. I have a feeling stock info for CRM is gonna be incomplete until it’s all settled for sure",
        "created_utc": 1627009799,
        "id": "h67gcpv",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1627038599.0
    },
    {
        "author": "greytoc",
        "body": "Your broker probably hasn't completed the mandatory corporate action processing yet. The ticker WORK isn't trading and should be delisted. What you have are shares of CRM. \n\nYou likely have fractional shares of CRM which closed at $248.28 today. \n\nIt's easier to figure out if you disclose how many shares of Slack you started with.",
        "created_utc": 1626992444,
        "id": "h66iio3",
        "score": 1,
        "subreddit": "investing",
        "created": 1627021244.0
    },
    {
        "author": "PaleontologistWest",
        "body": "AWS will decline in profit over time.  THere is increasing comp for cloud computing services like google MSFT, many others smaller companies like salesforce etc.  so once the market is saturated in 5 years, you won't be able to charge a fortune for it.",
        "created_utc": 1627678288,
        "id": "h74mmy9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627707088.0
    },
    {
        "author": "89percent",
        "body": "I definitely consider them high-growth markets. I might have been too quick in the OP, as Azure is definitely a strong product in a high-growth market.\n\nSaaS business software is also a high-growth market, but it looks like specialised companies like Salesforce and Servicenow are dominating their respective niches.",
        "created_utc": 1627654882,
        "id": "h733h3b",
        "score": 1,
        "subreddit": "investing",
        "created": 1627683682.0
    },
    {
        "author": "foyerhead",
        "body": "I agree with what you said! Regardless of valuation, good companies in expanding sectors will move up over time. I guess I’m a little worried that jumping in at a rich valuation would result in a lower than average market return - or rather the opportunity cost of not getting on the ground floor of a multibagger(even though it’s a crapshoot)\n\nI also believe that value isn’t dead, of course finding good companies with good business models and management is important, but you can also try to get the best price that you think you can get. I don’t mean wait and hold cash for years hoping it drops to a certain price point, but to look for the best opportunities that you believe in is the future and providing you the best possible returns as well. \n\nThere’s just so many companies with great tailwinds for the future, it’s pretty much impossible for me to invest in all of them! So I’m picking a few that I believe with give me the most bang for my buck (I think anyways)\n\nOn the topic of Etsy, I like the two acquisitions that they made but last quarter they also said about 30% of their revenue from sales was from masks. I wanted to get in when it sat at 160 but I didn’t feel strongly enough before it jumped. I’d like to see a few more consistent quarters to get enough conviction to invest in them. \n\nSame thing with PINS, they got a huge bump from COVID but I’m sort of skeptical of how much they can grow, since I believe that it’s a more niche social media platform than say a Facebook. Again I’d like to observe a bit more and see what direction they’re headed before I jump in.\n\nI’ll look into CRM a bit more! It’s been a while so I forgot while I didn’t get in",
        "created_utc": 1625204297,
        "id": "h3ru1nz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625233097.0
    },
    {
        "author": "SoyFuturesTrader",
        "body": "You miss the point \n\nPeople here are trying to give SoFi a SaaS multiple valuation when really they should be given a bank multiple valuation \n\nYou really just made my point with the Salesforce example",
        "created_utc": 1625162907,
        "id": "h3pjqq7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625191707.0
    },
    {
        "author": "foyerhead",
        "body": "Yea if only I had gotten into investing last year haha I would have done the same. \n\nI want to get into CRM but it’s too expensive right now. Adobe I’ll take a look at!",
        "created_utc": 1625190769,
        "id": "h3r748x",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625219569.0
    },
    {
        "author": "WikiSummarizerBot",
        "body": "**[California_High-Speed_Rail](https://en.wikipedia.org/wiki/California_High-Speed_Rail)** \n \n &gt;California High-Speed Rail (CAHSR or CHSR) is a publicly funded high-speed rail system under construction in the U.S. state of California. It is projected to connect the Anaheim Regional Transportation Intermodal Center in Anaheim and Union Station in Downtown Los Angeles with the Salesforce Transit Center in San Francisco via the Central Valley, providing a one-seat ride between Union Station and San Francisco in 2 hours and 40 minutes, a distance of 380 miles (610 km). Future extensions (in Phase 2) are planned to connect southward to stations in San Diego County via the Inland Empire, as well as northward to Sacramento.\n \n^([ )[^(F.A.Q)](https://www.reddit.com/r/WikiSummarizer/wiki/index#wiki_f.a.q)^( | )[^(Opt Out)](https://reddit.com/message/compose?to=WikiSummarizerBot&amp;message=OptOut&amp;subject=OptOut)^( | )[^(Opt Out Of Subreddit)](https://np.reddit.com/r/wallstreetbets/about/banned)^( | )[^(GitHub)](https://github.com/Sujal-7/WikiSummarizerBot)^( ] Downvote to remove | v1.5)",
        "created_utc": 1625261563,
        "id": "h3urt8s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625290363.0
    },
    {
        "author": "shabbatshalom44",
        "body": "Of course, if you’re opening the position for the medium term that’s a good idea. I just made an extra 23% on $CRM since the last dip doing that because it’s been rangebound since the Slack purchase. However with stuff I have no interest in selling anytime soon, I’m not taking that chance especially because of the tax trigger. That 20% becomes essentially neutralized and I’m missing upside if I get called away.",
        "created_utc": 1625264505,
        "id": "h3uxwfp",
        "score": 1,
        "subreddit": "investing",
        "created": 1625293305.0
    },
    {
        "author": "mr_Dennis1",
        "body": "MSFT, PYPL, FB, DIS, V, GOOG, CRM",
        "created_utc": 1625180490,
        "id": "h3qnc7a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625209290.0
    },
    {
        "author": "merlinsbeers",
        "body": "You shorted all of this at once? Why not just buy a VIX call?\n\nTop 10 Holdings (66.93% of Total Assets)\n\nName Symbol % Assets  \nApple Inc AAPL 21.46%  \nMicrosoft Corp MSFT 20.38%  \nNVIDIA Corp NVDA 4.98%  \nVisa Inc Class A V 3.95%  \nPayPal Holdings Inc PYPL 3.42%  \nMastercard Inc A MA 3.19%  \nAdobe Inc ADBE 2.80%  \nIntel Corp INTC 2.26%  \nSalesforce.com Inc CRM 2.26%  \nCisco Systems Inc CSCO 2.23%",
        "created_utc": 1626062315,
        "id": "h4vuq7a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626091115.0
    },
    {
        "author": "Chiller233",
        "body": "CRM bought WORK like 6 months ago. Work went up 50% in one day.",
        "created_utc": 1626123817,
        "id": "h4ypx8m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626152617.0
    },
    {
        "author": "OutgoingHostility",
        "body": "First year i swing traded too much and missed handfuls of opportunities during this bull market. Also got in right before the covid crash so i was already down bad from the get go. Past year my top have been NKE, PYPL, XLV (healthcare etf), CRM, and GOLD (to hedge inflation) but that’s been a bad investment so far. LT ik it’ll pay off though, or so I hope.",
        "created_utc": 1625396729,
        "id": "h40geeh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625425529.0
    },
    {
        "author": "Grey_Eye_22",
        "body": "I think PayPal could already be worth $500 billion depending on what valuation metrics you use.  \n\nFree cash flow of 5.1 billion in 2020 with revenue growing 20%+/year. Visa is worth&gt;$500 billion with a cash flow of $9.7 billion in 2020 with revenue growth below 7%. \n\n&amp;#x200B;\n\nSalesforce has a cash flow of $4 billion currently with gross margins of 75% and revenue growing 25%+/year.",
        "created_utc": 1625509979,
        "id": "h45jfrv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625538779.0
    },
    {
        "author": "00rb33k",
        "body": "SAP, MSFT, CRM (Salesforce), AWS",
        "created_utc": 1627305640,
        "id": "h6l0tcq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627334440.0
    },
    {
        "author": "jsntx",
        "body": "CRM FUBO UAL and a few meme stocks",
        "created_utc": 1627068824,
        "id": "h6a9dmd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627097624.0
    },
    {
        "author": "tay_clem",
        "body": "I double checked my share numbers and I had around 20. So, I’ll end up with 5 CRM shares of my math is right and terms don’t change. Still a good deal I suppose. And if I hold onto it, I’m sure it’ll still have plenty of growth potential",
        "created_utc": 1627011284,
        "id": "h67j1hc",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1627040084.0
    },
    {
        "author": "Bitcointhummper",
        "body": "My CRM puts just got breached",
        "created_utc": 1626961225,
        "id": "h64j5fy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626990025.0
    },
    {
        "author": "detelini",
        "body": "I did receive that share of Slack, but I don't see any shares of Salesforce in my stock lists. Maybe it'll show up later? Yesterday my WORK shares were valued at ~$45/share so to get $26.79/share is confusing to me.",
        "created_utc": 1626991892,
        "id": "h66hcbb",
        "score": 1,
        "subreddit": "investing",
        "created": 1627020692.0
    },
    {
        "author": "Chiller233",
        "body": "Yeah felt real dumb buying it a few weeks before a 50% increase lol\n\n\"SAN FRANCISCO — Salesforce said on Tuesday that it would buy the workplace software company Slack for $27.7 billion in cash and stock, the latest in a wave of deals as the coronavirus pandemic boosts demand for tools that enable people to work remotely.Dec 2, 2020\"",
        "created_utc": 1626144746,
        "id": "h4zuqks",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626173546.0
    },
    {
        "author": "Smooth_Consequence_1",
        "body": "You’ve got 1 share of every stock in the market .. why? Why don’t you just pick an index that will give you a consistent 11% each year &amp; throw the majority in growth stocks .. you speak about 10 baggers but none of them will 10 bag lol maybe 1 will but you only have $300 in them 😂 so you wait 10 years for a 10 bagger and turned 300 into 3k because none of them will 10 bag any time soon. \n\nIt seems you just want to have 1 of every stock to be cool &amp; different which is cool. Lol I’ve just never seen this much diversification from a retail investor, you’re missing out on gains. 10% gains in 300$ is 30$ .. 10% gains from $3k is 300 .. &amp; lol like you got 1 share of $pton ? 😂 \n\nYou could’ve went with the s&amp;p 500, threw the rest in mRNA , RBLX, pton, aapl, CRM, fb, ms, goog, MSFT and been up so much more .. if I could go back and get some of these at the price you did I would be worth hundreds of thousands lol",
        "created_utc": 1627162108,
        "id": "h6eoeeb",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1627190908.0
    },
    {
        "author": "Personal_coach",
        "body": "$CRM",
        "created_utc": 1626424192,
        "id": "h5dj81t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626452992.0
    },
    {
        "author": "Jerzup",
        "body": "Yeah Zillow operates at a net $1.6billion loss per year.\n\nI’m a Salesforce dev for a competitor of Zillow and open door in California and they don’t make any profit on homes they buy and resell. We literally sell them our renovated properties and make $100k profit and they still buy it. \n\nThey can keep this up forever tho, pretty much like Uber.",
        "created_utc": 1626501344,
        "id": "h5hl6fr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626530144.0
    },
    {
        "author": "Personal_coach",
        "body": "CRM",
        "created_utc": 1626447401,
        "id": "h5eji0i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626476201.0
    },
    {
        "author": "Bitcointhummper",
        "body": "Want to have down side protection without getting cucked by Vix or SPY puts? \n\nPuts on NVDA MRNA and CRM will be extra bloody in a broad market correction",
        "created_utc": 1626651273,
        "id": "h5owd1z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626680073.0
    },
    {
        "author": "OmniscientOpossum",
        "body": "MP, AMD, CRM",
        "created_utc": 1626875871,
        "id": "h604ufm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626904671.0
    },
    {
        "author": "UpperSpinach",
        "body": "Basically corporate got shilled some shitty CRM product disguised as \"intelligent analytics\" that does fuck-all, at least from my anecdotal experience, because a good chunk of hiring still gets done via random human interactions",
        "created_utc": 1626729651,
        "id": "h5sta0q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626758451.0
    },
    {
        "author": "questionsIHave54",
        "body": "No one really according to SeekingAlpha VERB provides more features than Salesforce and Zoom",
        "created_utc": 1626365357,
        "id": "h5afjte",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1626394157.0
    },
    {
        "author": "spd0",
        "body": "No they won't. Have you tried using the competitors? They are all dogshit compared to aws, the only one getting close is DigitalOcean and they will get bought out soon(SOON).\n\nSalesforce services is very different from AWS, most of the time they are not competitors. Their services compliment each other: heroku is build on top of aws.\n\nIf the only bear case for amazon is that google/msft/oracle/ibm are clawing at market share, then there is no bear case. Guy who created aws just became the new ceo, I think amazon is going to rip everyone a new asshole and maintain a pseudo monopoly on cloud services in the next 10 years.",
        "created_utc": 1627723272,
        "id": "h76oulh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627752072.0
    },
    {
        "author": "asymptoticessence",
        "body": "You are 100% correct. I have no idea what CRM means.",
        "created_utc": 1627614723,
        "id": "h71g7vr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627643523.0
    },
    {
        "author": "thetef",
        "body": "CRM. 310 by 8/20. Don’t be pusses.",
        "created_utc": 1627614229,
        "id": "h71f9u8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627643029.0
    },
    {
        "author": "zanoo911",
        "body": "Excellent, thank you. Do any of these compare with TTD in any meaningful way? NICE ADSK INTU CDNS CRM APPS",
        "created_utc": 1627521964,
        "id": "h6wjbwm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627550764.0
    },
    {
        "author": "pennyether",
        "body": "Best in breed for what they do, and every enterprise company is going to shift to using their software at one point or another.  Just like salesforce became the ubiquitous CRM for sales, Coupa will be ubiquitous on the finance/expense side.  Huge addressable market, very sticky, and they have a huge amount of momentum.  The product itself is pretty good (haven't used it, but read many reviews).\n\nA bonus feature of their software.. when you use it, you get access to their community and AI. So, like, imagine you are sourcing something on your supply chain from XYZ, it'll tell you \"many Coupa members are seeing missed shipments from XYZ, consider using ABC instead\".\n\nBasically a private review/rating/etc platform for the users.. but also AI that tracks orders, dates received, payment info, etc, and can automatically detect patterns from vendors/locations/etc (across ALL Coupa users, not just your company) and notify you.  Like... imagine the AI telling you \"hey, you could probably only pay $X for this item, that's what others are paying!\" or \"this vendor has been shipping late recently\", etc\n\nBear thesis is typical for that of a high growth company. A lot of their success is priced in. As far as growth goes, it's probably my top pick.",
        "created_utc": 1627571679,
        "id": "h6yqgqn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627600479.0
    },
    {
        "author": "Imasayitnow",
        "body": "Missed the NEGG thing but 82.50 ORCL calls bailed my last few weeks out. If it's tech, and it's huge, it's printing (mostly, CRM didn't work out as well)",
        "created_utc": 1625686194,
        "id": "h4e02kb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625714994.0
    },
    {
        "author": "shreyc8",
        "body": "I got the email which said I could buy the shares from 7 to 14 July using any of the listed brokers. I am with Fedility investment so bought through their website. \n\nhttps://wise.com/owners/brokers/?utm_medium=crm&amp;utm_source=email&amp;utm_campaign=6f64f3ae-ea97-477f-85f2-b70d18c8a007&amp;utm_variant=144b7f08-da4b-4b66-9711-04d26a10eff3&amp;utm_date=07-07-2021\n\nThis may be helpful.",
        "created_utc": 1625867145,
        "id": "h4mz1yl",
        "score": 1,
        "subreddit": "investing",
        "created": 1625895945.0
    },
    {
        "author": "Nosefuroughtto",
        "body": "I find it odd to consider Amazon like Standard Oil. SO derived it’s monopolistic power through acquisitions of rival refineries and distributors; purely horizontal integration, followed by outright price fixing.\n\nAmazon is absolutely massive, but the growth method and diversity of markets they participate in distinguishes them from old trust oriented monopolies. I’m terms of AWS, the majority of growth was organic, and would not have ran afoul of antitrust law back in its hay day, such as when US v. Aluminum Co. of America was prevailing law.\n\nAn attempt to break up Amazon by business segment would probably fail due to the shift since the 70’s from Per Se Antitrust violations to the Rule of Reason. They aren’t dominating any given sector to the point that a court could likely prove anti-consumer behavior, which has increasingly become the prime factor.\n\nOnline shopping has a fairly rich market with Walmart, Home Depot, Best Buy, wayfair, etc.; physical stores obviously have Walmart and target being dominant; subscription services are still beaten by Netflix and Google, with Disney catching up fast; AWS competes with Oracle, Microsoft snd Google.\n\nOverall I think the justifications for breaking up Amazon are weak in light of the method of growth, the fact that they aren’t shutting out competitors in any given industry right now, and our much more consumer viewpoint focus on antitrust enforcement.",
        "created_utc": 1625846036,
        "id": "h4lpzte",
        "score": 86,
        "subreddit": "stocks",
        "created": 1625874836.0
    },
    {
        "author": "Carrot_Tiny",
        "body": "Y’all are too quick to believe MSM, quote was taken out of context. It will crash from BILLIONS. \n\nBurry has been pro GME since 2019, fucker even sent a letter to GameStop directly telling them the best action to take in order to reach where GameStop now currently is. He has been balls deep in all of this for far longer than any of us.\n\nCassandra may be hot take central but when it comes to financial numerical values he knows his shit better than any. \n\nAn oracle cursed to never be believed yet always right.",
        "created_utc": 1625158164,
        "id": "h3p8km6",
        "score": 40,
        "subreddit": "Wallstreetbetsnew",
        "created": 1625186964.0
    },
    {
        "author": "cuittle",
        "body": "Short $ORCL? Got it",
        "created_utc": 1625456694,
        "id": "h43dp31",
        "score": 34,
        "subreddit": "investing",
        "created": 1625485494.0
    },
    {
        "author": "Wenzu-u-rozi",
        "body": "You say that as if you checked with the oracle of truth\n\nI guess gamestop lied to the sec after the vote count when they reported 140% short interest, right?",
        "created_utc": 1625433548,
        "id": "h42bm7v",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1625462348.0
    },
    {
        "author": "approachingX",
        "body": "Careful guys we got a genius here! He said it first - market will either go up or down or maintain these levels today! Fucking oracle!",
        "created_utc": 1625740534,
        "id": "h4gjbo9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1625769334.0
    },
    {
        "author": "Coffin-Feeder",
        "body": "I have snorted this DD. Thank you WSB oracle.",
        "created_utc": 1625716070,
        "id": "h4fpl3q",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625744870.0
    },
    {
        "author": "Banana_Pi-",
        "body": "It’s not much but day 1 of running credit spreads for SPY. Made $6 so… I’m basically the Oracle from Omaha",
        "created_utc": 1625583761,
        "id": "h48sfqu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625612561.0
    },
    {
        "author": "beelo50",
        "body": "Thank god my wife works at ORCL",
        "created_utc": 1625678168,
        "id": "h4dhuuh",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625706968.0
    },
    {
        "author": "Jaysler87",
        "body": "Oracle is that you?",
        "created_utc": 1625192103,
        "id": "h3r9njv",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625220903.0
    },
    {
        "author": "HulksInvinciblePants",
        "body": "&gt;Good thing you can share your wisdom then, oh eternal oracle of the market.\n\nHmmm. I'm don't recall trying to predict when the market will crash and I post quite a bit, when I'm qualified to do so. My advice this time was making users aware of how bad this post was and how illiterates most this sub is. \n\n&gt;Surely you know more then Dalio, what books have you written?\n\nL. Ron Hubbard and Cosby wrote books too. That's a pretty low bar. \n\n&gt;Gold is a old-school store of value by definition and as we saw in 2020 (amongst others) a great asset during times of uncertainty and crashes. Buy it during calm times, sell during fearful times.\n\nYeah, that's not accurate. Gold is not a hedge, its a portfolio diversifier. It's market correlation is 0.02, which is an unattached, positive number...not the large negative correlation you would hope for from a hedge. It did absolutely nothing during the dot-com bubble and probably hurt most investors that held during 2020.",
        "created_utc": 1625837302,
        "id": "h4l7k4r",
        "score": 5,
        "subreddit": "investing",
        "created": 1625866102.0
    },
    {
        "author": "Empland",
        "body": "#Fomo into ORCL @86.5 😎",
        "created_utc": 1625680191,
        "id": "h4dmi2c",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625708991.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$ORCL my safe haven!",
        "created_utc": 1625751862,
        "id": "h4h0u01",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625780662.0
    },
    {
        "author": "SteeplesInSeattle",
        "body": "You must be a Wall Street Oracle, here take my money",
        "created_utc": 1625588415,
        "id": "h492m7g",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625617215.0
    },
    {
        "author": "Tarrifying",
        "body": "Silly ORCL, going above $80 again",
        "created_utc": 1625326029,
        "id": "h3xfd12",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625354829.0
    },
    {
        "author": "Pioneer160",
        "body": "VZ, T, NVDA, ORCL, MA, DIS, FB driving it up.",
        "created_utc": 1625161990,
        "id": "h3phm69",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625190790.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$ORCL almost past the sell off! Let's go!",
        "created_utc": 1625751572,
        "id": "h4h0995",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625780372.0
    },
    {
        "author": "GirlOutWest",
        "body": "Yeah saw that flight announcement coming on a Thursday right after market close... yup I'm a God damn oracle",
        "created_utc": 1625192591,
        "id": "h3rakic",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625221391.0
    },
    {
        "author": "Inquiring_Barkbark",
        "body": "where is DeepVeinThrombosis\n\nwe need the oracle",
        "created_utc": 1625829854,
        "id": "h4kvu15",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625858654.0
    },
    {
        "author": "IvanGlez14",
        "body": "Nop, yesterday it was a great day for me. I Bet money on Oracle some days ago and sold them yesterday and Fuck yeah! Today i just notice it was a bad day so i sold everything. I lost like 1-1.5% of my capital but all ok, i won yesterday more than i lost today.",
        "created_utc": 1625758682,
        "id": "h4hfl3a",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625787482.0
    },
    {
        "author": "Boxman212",
        "body": "I was an oracle in 2000.  I had a website development company with 100 employees along with online yellow pages if anyone here even knows what that means.  I knew all the latest tech etc.  I lost 200k by 2001 in the market from day trading with etrade.  The Nasdaq did not come back up to the 2000's level for 13 yrs.  I learned my lesson the hard way but it was the best lesson I've ever learned.  I glad I learned that in my 20s.",
        "created_utc": 1625451210,
        "id": "h435gc5",
        "score": 3,
        "subreddit": "investing",
        "created": 1625480010.0
    },
    {
        "author": "dajmynd_hends",
        "body": "Can $ORCL move already?",
        "created_utc": 1625226993,
        "id": "h3smgfc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625255793.0
    },
    {
        "author": "isc1200s",
        "body": "I expect $ORCL to pullback on Tuesday before it continues on an upward trend. The RSI indicates the stock is overbought. \n\nI'll be looking for this as my entry point. \n\nBullish 👍",
        "created_utc": 1625389865,
        "id": "h409br8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625418665.0
    },
    {
        "author": "Hiei154",
        "body": "Oracle going to 100 soon. Huge breakout",
        "created_utc": 1625705272,
        "id": "h4f5i4x",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625734072.0
    },
    {
        "author": "Proffesssor",
        "body": "The Oracle of Omaha used to rave about how WMT was run. Think he stopped praising it about 15 years ago. Wondering what changed my self.",
        "created_utc": 1625174635,
        "id": "h3qatjt",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625203435.0
    },
    {
        "author": "DKB08",
        "body": "I don't know anyone in IT who likes Oracle other than one guy who is near retirement.",
        "created_utc": 1625123090,
        "id": "h3nnv73",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625151890.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$ORCL Oracle foretold that the stock will go back to ATH by end of next week $81 -&gt; $85",
        "created_utc": 1625239864,
        "id": "h3tcotv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625268664.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$SPY (because tech it king), $ORCL (for hybrid and digital return to work play), $NCR (for upcoming tech to allow banks to do coin transactions so people don't have to use other platforms), $AMCX (because it's a real company with upward momentum, semi linked to memes, and has low liquidity so can jump hard)",
        "created_utc": 1625245811,
        "id": "h3trhp6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625274611.0
    },
    {
        "author": "langhartdev",
        "body": "Oh thank you for your vision great oracle",
        "created_utc": 1625749515,
        "id": "h4gwea3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625778315.0
    },
    {
        "author": "tmoney_99",
        "body": "Nobody talking about ORCL?",
        "created_utc": 1625679483,
        "id": "h4dkvwt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625708283.0
    },
    {
        "author": "Hornysnek69",
        "body": "Instead of buying on a discount I bought 24 ORCL 90 calls smh",
        "created_utc": 1625587845,
        "id": "h491br0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625616645.0
    },
    {
        "author": "dugg08302010",
        "body": "Somewhere far off the oracle of Omaha is dying laughing his ass off at wsb 😂😂😂🤣🤣🤣",
        "created_utc": 1625162149,
        "id": "h3phzcc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625190949.0
    },
    {
        "author": "mba111",
        "body": "ORACLE is mooning hard today",
        "created_utc": 1625156683,
        "id": "h3p51sn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625185483.0
    },
    {
        "author": "LeDudeDeMontreal",
        "body": "Got me very confused..\n\nI thought Oracle did pretty well over the last 6 months!",
        "created_utc": 1625446870,
        "id": "h42yx2u",
        "score": 2,
        "subreddit": "investing",
        "created": 1625475670.0
    },
    {
        "author": "Ninswitchsu",
        "body": "Workplace technology. Holding some calls on $ORCL and $CSCO.",
        "created_utc": 1625689917,
        "id": "h4e8o9h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625718717.0
    },
    {
        "author": "Aokay1er",
        "body": "If I'm understanding your analysis and using it to analyze a different ticker. Do you think ORCL will go down again back to 75-76 or is it on an uptrend. \n\nI know different ticker and I do hold positions in SOFI, but I'm curious to hear your opinion on this. Thanks.",
        "created_utc": 1625720238,
        "id": "h4fw11w",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625749038.0
    },
    {
        "author": "DomeCollector",
        "body": "GOOGL calls, NFLX calls, ORCL holding calls and don’t think will make it anywhere, and KO calls, SPCE straddle, kinda all I can think of atm",
        "created_utc": 1625635335,
        "id": "h4bobje",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625664135.0
    },
    {
        "author": "realister",
        "body": "Anyone know what’s the news with Oracle it’s been pumping non stop and now at 52 week high. Just a random pump?",
        "created_utc": 1625844250,
        "id": "h4lm1ls",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625873050.0
    },
    {
        "author": "KOBA-fight-4-Ape",
        "body": "Leave it and eat a cookie \n\nThe Oracle knows",
        "created_utc": 1625367471,
        "id": "h3zhkfo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625396271.0
    },
    {
        "author": "aimaguru",
        "body": "Yeah I'm not the oracle for ya when it comes to trying to time the market :)   \n\n\nI've been mostly right on my directional plays but wrong too many times to count on \"oh I'll just sell here and up my position on the way down\" or \"this is DEFINITELY never going higher than this\" (cries in AMC)  \n\n\nOne framework I've seen (maybe rementioned on Fatty's DD) is would you be more upset about selling at X and it runs up to \\[price target\\] or holding and it dropping to \\[your worst case thesis\\].   \n\n\nPersonally (my risk tolerance and thesis re: ATOS, not necessarily yours) is that I like the stock enough and am enjoying the IV selling calls enough that, although I'd love a quick 4-10x pop, I'm okay with holding for the longer term, averaging down, and waiting for phase 3 and/or an acquisition down the line.",
        "created_utc": 1625146056,
        "id": "h3oi6m0",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1625174856.0
    },
    {
        "author": "Hornysnek69",
        "body": "ORCL bb yes",
        "created_utc": 1625665541,
        "id": "h4cpuhr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625694341.0
    },
    {
        "author": "dajmynd_hends",
        "body": "$ORCL I LOVE YOU &lt;3",
        "created_utc": 1625666123,
        "id": "h4cr0vu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625694923.0
    },
    {
        "author": "Moe_Greene_",
        "body": "Wednesday Options Volumes:\r  \n\r  \n$AAPL 3048K (81% call 19% put)\r  \n**$TSLA 1033K (41% call 59% put)**\r  \n**$AMC 884K (55% call 45% put)**\r  \n$T 680K (95% call 5% put)\r  \n**$NIO 615K (66% call 34% put)**\r  \n**$AMD 526K (74% call 26% put)**\r  \n**$PLTR 502K (66% call 34% put)**\r  \n$AMZN 484K (70% call 30% put)\r  \n$MSFT 423K (59% call 42% put)\r  \n**$WISH 347K (84% call 16% put)**\r  \n**$BABA 311K (60% call 40% put)**\r  \n$FB 309K (70% call 30% put)\r  \n$F 287K (67% call 33% put)\r  \n$CCL 266K (76% call 24% put)\r  \n$MU 247K (71% call 29% put)\r  \n$ORCL 243K (78% call 22% put)\r  \n$HYG 241K (4% call 96% put)",
        "created_utc": 1625725331,
        "id": "h4g2pvo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625754131.0
    },
    {
        "author": "CodeMaitre",
        "body": "ORCL One Year and 6 Month Chart - [https://imgur.com/S6dI2gg](https://imgur.com/S6dI2gg)\n\nIt has pretty much made its move, you'd be buying in the \"sell\" area statistically. You're correct, the buy zone is  always below regression trend (average) line in the middle, so you'd want to snag it if it goes back down to 75-80. Although its true downward potential is the blue -1 deviation line, so 70-73. Deviations change a little bit day to day as more price data is added but right now you'd be buying into an uptrend which is not very safe. You'd basically be betting to get the cherry on top running up to +1 deviations at 88-91.",
        "created_utc": 1625753301,
        "id": "h4h3vfm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625782101.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$ORCL just going for it today!",
        "created_utc": 1625579074,
        "id": "h48iybw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625607874.0
    },
    {
        "author": "IAintInTheClub",
        "body": "The Great Philosopher and Oracle of our time, Ronald 'Tater' White,  once opined \"You can't fix stupid\"",
        "created_utc": 1625159119,
        "id": "h3pauh4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625187919.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "ORACLE $85C 9/17 are the way, sell off after earnings not justified and just closed a big deal german bank",
        "created_utc": 1625392244,
        "id": "h40bqif",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625421044.0
    },
    {
        "author": "idkfawin32",
        "body": "dude the sheer number of pump and dumps in the past 2 weeks has forced me to learn how to do DD.  Screw these fake plays go in ORCL with me. Absolute monster in the making, pays dividends, not overbought like every other tech stock. P/E ratio is excellent, price is showing good momentum and has room to run past 100 in the next month or two.",
        "created_utc": 1625388189,
        "id": "h407mqw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625416989.0
    },
    {
        "author": "SocialIQof0",
        "body": "[https://www.cnbc.com/2020/08/30/how-warren-buffett-made-billions-became-oracle-of-omaha.html](https://www.cnbc.com/2020/08/30/how-warren-buffett-made-billions-became-oracle-of-omaha.html)\n\nThere's the answers for you.",
        "created_utc": 1625332861,
        "id": "h3xskjp",
        "score": 1,
        "subreddit": "investing",
        "created": 1625361661.0
    },
    {
        "author": "Hornysnek69",
        "body": "Not worthy, small positions Only bought ORCL and ASTR they mooned hard. Also bought 3k of BA calls but that’s flat",
        "created_utc": 1625244806,
        "id": "h3tp4bf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625273606.0
    },
    {
        "author": "Toys_R_Them",
        "body": "Most of the new growth has been in tech, and tech rarely pays dividends, outside of some stalwarts like MSFT and ORCL.\n\nA lot of those dividend payers are energy companies and REITs, who also underperformed for various pandemic-related reasons.\n\nA portfolio that high in dividends is typically recommended for older people, who need current income and downside protection in case of economic swings, and could care less about potential growth of their portfolio decades from now.",
        "created_utc": 1625527071,
        "id": "h46gcpx",
        "score": 1,
        "subreddit": "investing",
        "created": 1625555871.0
    },
    {
        "author": "Hiei154",
        "body": "Oracle breaking the fuck out. 100$ next week easily. Still time to get in",
        "created_utc": 1625851536,
        "id": "h4m298w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625880336.0
    },
    {
        "author": "Hiei154",
        "body": "Oracle is gonna run like amazon once it gets JEDI",
        "created_utc": 1625847295,
        "id": "h4lssgt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625876095.0
    },
    {
        "author": "Hiei154",
        "body": "ORCL at all time high breaking out. 1/10 market cap of Amazon with half of its income. Huge growth incoming once JEDI is granted to Oracle. PT 100$ next week.",
        "created_utc": 1625848604,
        "id": "h4lvq3q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625877404.0
    },
    {
        "author": "Hornysnek69",
        "body": "ORCL, NEGG",
        "created_utc": 1625684472,
        "id": "h4dw87v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625713272.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$ORCL mo' fuckin' bussin'!! $90 here we come!!",
        "created_utc": 1625680082,
        "id": "h4dm91p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625708882.0
    },
    {
        "author": "Buttmunch_1990",
        "body": "100% SOFI is trading at a discount right now. The Oracle of Omaha would tell you this is a great price!",
        "created_utc": 1625579273,
        "id": "h48jcx8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625608073.0
    },
    {
        "author": "HowdySon",
        "body": "I’m I the only one that bought ORCL after the Twitter mention?",
        "created_utc": 1625618979,
        "id": "h4avows",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1625647779.0
    },
    {
        "author": "garlicnoodle18",
        "body": "Add ORCL to buy. Curling on MacD and mfi still under 50 on the daily",
        "created_utc": 1625236297,
        "id": "h3t4b0i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625265097.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "oracle gonna be $85 by the end of next week, unusual option buy up yesterday followed by a run today after it being sold off after earnings when its using it cash flow for growth, divi run up opportunity on the 29th too. Like the company and my $85 are banking on it doing well.",
        "created_utc": 1625255900,
        "id": "h3uf9nm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625284700.0
    },
    {
        "author": "Hoppus87",
        "body": "Anyone in ORCL?",
        "created_utc": 1625234161,
        "id": "h3szjm7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625262961.0
    },
    {
        "author": "dajmynd_hends",
        "body": "$ORCL is makin it!🚀🚀🚀\nI hope so 🙄",
        "created_utc": 1625154297,
        "id": "h3oznlu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625183097.0
    },
    {
        "author": "Tiny-Control-4132",
        "body": "Those AMD calls ate all my apple and oracle profit for today fuk",
        "created_utc": 1625687977,
        "id": "h4e4994",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625716777.0
    },
    {
        "author": "FalconGhost",
        "body": "What is the bottom o oracle",
        "created_utc": 1625579206,
        "id": "h48j81a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625608006.0
    },
    {
        "author": "Aokay1er",
        "body": "Need oracle to dump",
        "created_utc": 1625835239,
        "id": "h4l3ti9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625864039.0
    },
    {
        "author": "Hiei154",
        "body": "ORACLE IS BREAKING OUT",
        "created_utc": 1625845174,
        "id": "h4lo34f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625873974.0
    },
    {
        "author": "Vovochik43",
        "body": "I like Oracle, their Cloud offering is going well and they still pay a correct dividend for a tech stock. I see it as a long play position.",
        "created_utc": 1625480978,
        "id": "h4472yf",
        "score": 1,
        "subreddit": "investing",
        "created": 1625509778.0
    },
    {
        "author": "idkfawin32",
        "body": "For a moment I thought this was going to be a bearish post on the company “Oracle” which I have been becoming excited to invest in",
        "created_utc": 1625508682,
        "id": "h45gwp8",
        "score": 1,
        "subreddit": "investing",
        "created": 1625537482.0
    },
    {
        "author": "Triple3alpha",
        "body": "SCHD/ORCL, have your cake and eat it too (dividend givers with growth)",
        "created_utc": 1625158366,
        "id": "h3p9266",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625187166.0
    },
    {
        "author": "ElkFalse6637",
        "body": "They were upgraded before the ER same way than ORCL . Market has lost its logic and is about emotion with unrealistic expectations and tend to punish people doing great and reward the thrill of the moment . This where it comes a retard is laughing all the way to the bank while the Savvy crashes against the wall .\nDisclaimer: I own small position of MU 350 shares ..",
        "created_utc": 1625188959,
        "id": "h3r3pom",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625217759.0
    },
    {
        "author": "idkfawin32",
        "body": "My picks of the week are ORCL, COP, GDYN, CSC, BA, FIGS, and ESTE\n\nOf which ORCL looks like the best one to buy shares in and FIGS and ESTE look like the best to buy calls in.",
        "created_utc": 1625388691,
        "id": "h40853b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625417491.0
    },
    {
        "author": "TechniCruller",
        "body": "Buy the run on ORCL",
        "created_utc": 1625237017,
        "id": "h3t5z10",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625265817.0
    },
    {
        "author": "Hornysnek69",
        "body": "24x orcl 90",
        "created_utc": 1625609313,
        "id": "h4acy7l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625638113.0
    },
    {
        "author": "baconNlegs",
        "body": "Any news on ORCL? Up 9% in 5 days",
        "created_utc": 1625673025,
        "id": "h4d6494",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625701825.0
    },
    {
        "author": "Hornysnek69",
        "body": "My ORCL calls doubled today. Too bad I sold all but 2 for a 40% gain",
        "created_utc": 1625679871,
        "id": "h4dlrqm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625708671.0
    },
    {
        "author": "Imasayitnow",
        "body": "Missed the NEGG thing but 82.50 ORCL calls bailed my last few weeks out. If it's tech, and it's huge, it's printing (mostly, CRM didn't work out as well)",
        "created_utc": 1625686194,
        "id": "h4e02kb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625714994.0
    },
    {
        "author": "[deleted]",
        "body": "Fuck you ORCL",
        "created_utc": 1625752930,
        "id": "h4h334s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625781730.0
    },
    {
        "author": "Hornysnek69",
        "body": "Forgot about ORCL",
        "created_utc": 1625669706,
        "id": "h4cynrf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625698506.0
    },
    {
        "author": "Hornysnek69",
        "body": "Orcl only goes up",
        "created_utc": 1625669997,
        "id": "h4czamz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625698797.0
    },
    {
        "author": "wrex619",
        "body": "Puts on ORCL?",
        "created_utc": 1625859716,
        "id": "h4mjq2i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625888516.0
    },
    {
        "author": "Hiei154",
        "body": "ORCL at all time high breaking out. 1/10 market cap of Amazon with half of its income. Huge growth incoming once JEDI is granted to Oracle. PT 100$ next week.",
        "created_utc": 1625849831,
        "id": "h4lyic1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625878631.0
    },
    {
        "author": "Hiei154",
        "body": "ORCL at all time high breaking out. 1/10 market cap of Amazon with half of its income. Huge growth incoming once JEDI is granted to Oracle. PT 100$ next week.",
        "created_utc": 1625849266,
        "id": "h4lx83g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625878066.0
    },
    {
        "author": "GeorgeWashingtonTFP",
        "body": "What says orcl is getting contract?",
        "created_utc": 1625851306,
        "id": "h4m1r50",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625880106.0
    },
    {
        "author": "Hornysnek69",
        "body": "ORCL AINT stopping",
        "created_utc": 1625579069,
        "id": "h48ixzj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625607869.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "$85 oracle calls printing money today🤑🤑🤑",
        "created_utc": 1625237890,
        "id": "h3t80nw",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625266690.0
    },
    {
        "author": "InvestmentOracle",
        "body": "I can't stand anyone who brands themself as an 'oracle'.",
        "created_utc": 1625478169,
        "id": "h4448oz",
        "score": 0,
        "subreddit": "investing",
        "created": 1625506969.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$ORCL, fuck yes! There's gotta be some banger news in the background!",
        "created_utc": 1625677322,
        "id": "h4dfxkk",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625706122.0
    },
    {
        "author": "contrejo",
        "body": "I know someone that knows nothing about investing that put money in Doge coin because of the hype and made money. Sold it and put in AMC at 30. Thinks he's an oracle.",
        "created_utc": 1625485204,
        "id": "h44bom9",
        "score": 0,
        "subreddit": "investing",
        "created": 1625514004.0
    },
    {
        "author": "OfficialTestikills",
        "body": "I personally invest heavily in Web3 crypto's and crypto projects that help run and keep these crypto's decentralised. \n\nWhat's a web3 crypto? These aren't to be confused with junk like Bitcoin that thinks it is a store of value or will become the new financial system, web3 crypto is literally creating the next stage in internet where you don't need to worry about your companies information / personal information / classified documents being stored on a server that is owned and managed by other companies. Web3 splits this up between 100's of validators that all talk to each other and keep this decentralised and secure from attacks. \n\nThere's also ones creating the future of finance. No longer do you need to get bent over by huge interest rates and banks fucking people over whenever they feel like it. DEFI is run by liquidity pools, people like you and I who store our money with the service and as a result get a percentage of the interest rates. These rates always remain low and competitive and go to the people rather than the big banks.\n\nThen you have oracles that power the decentralisation. Oracles gain info from many sources and feed it to the protocol to offer decentralised information. For easy laymans terms, if I wanted a weather oracle, it would gather weather data from 1000's weather stations and news outlets, work out the average forecast and feed that to my protocol. This means my protocol is giving the users the most accurate non-biased information. Just as a high-level. \n\nSo how do you make money from this? Well, let's look at Ethereum just as an example. Every single protect that runs on Ethereum has to pay \"gas\" fees on each transaction, this is paid in Ethereum. Ethereum already has 1000's of applications including VISA and MasterCard that constantly have a demand for Ethereum in order to operate and pay these gas fees. You as the investor holds the Ethereum they need and this creates supply and demand. Additionally, each time a company pays their gas fees, the gas is \"burnt\" (meaning Ethereum used to pay for the transaction is burnt) creating deflation. \n\nEthereum is just one project, and not one that I personally even invest in that much, but it's one that I'm sure most people have heard of.   \nIf you want to look at getting some crypto while it's currently on a low and has huge potentially to be the future of a new decentralised internet feel free to use my exchange code. Swyftx is aussie based exchange and you get 20% off fees with my code, plus I get a kick back [https://trade.swyftx.com.au/register/?ref=brentboydskinner](https://trade.swyftx.com.au/register/?ref=brentboydskinner)\n\n&amp;#x200B;\n\nMessage me if you want to know more",
        "created_utc": 1625700460,
        "id": "h4ew1mj",
        "score": -1,
        "subreddit": "investing",
        "created": 1625729260.0
    },
    {
        "author": "Hiei154",
        "body": "Oracle going to moon. Huge breakout that noone knows about",
        "created_utc": 1625705315,
        "id": "h4f5laf",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1625734115.0
    },
    {
        "author": "ShirleySerious1",
        "body": "The Oracle.",
        "created_utc": 1625779296,
        "id": "h4ipvpt",
        "score": -1,
        "subreddit": "StockMarket",
        "created": 1625808096.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "Oracle Calls killing it today🤑This is about the time most people fomo in🤔",
        "created_utc": 1625675331,
        "id": "h4dbdy8",
        "score": -3,
        "subreddit": "wallstreetbets",
        "created": 1625704131.0
    },
    {
        "author": "Hiei154",
        "body": "Oracle breaking out. Buy this if you missed out on Amazon and MSFT",
        "created_utc": 1625842406,
        "id": "h4li09q",
        "score": -4,
        "subreddit": "wallstreetbets",
        "created": 1625871206.0
    },
    {
        "author": "Scottieboo71",
        "body": "LSPD stickers for my laptop came in today!!!   I teach Finance at a college and I have a friendly stock market challenge with a few on them every year.  Laptop has my core holdings Apple, Oracle, CNR, TD, SU, ENB, ENGH (that one was difficult to get), and now LSPD's flame logo goes on.  Missing because it isn't a good look is GSY love the returns but can't brag about owning that in front of students living off of Kraft Dinner and Mr Noodle.  And not even the real KD, it's Giant Tiger Brand Kraft Dinner.  Aka Shitty Kitty KD.",
        "created_utc": 1625510447,
        "id": "h45kdkh",
        "score": -6,
        "subreddit": "CanadianInvestor",
        "created": 1625539247.0
    },
    {
        "author": "KyivComrade",
        "body": "Good thing you can share your wisdom then, oh eternal oracle of the market. Surely you know more then Dalio, what books have you written? \n\n\n\n\nGold is a old-school store of value by definition and as we saw in 2020 (amongst others) a great asset during times of uncertainty and crashes. Buy it during calm times, sell during fearful times.\n\n\n\n\nDividends is the only one I'd agree with since the dividend will be shrunk or cut as stockprices plummet.",
        "created_utc": 1625835651,
        "id": "h4l4jfz",
        "score": -9,
        "subreddit": "investing",
        "created": 1625864451.0
    },
    {
        "author": "MsTreeWeaver",
        "body": "A few I haven’t seen listed that have done well for me are NKE, GPC, PAYX, ADP",
        "created_utc": 1625443915,
        "id": "h42u48i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625472715.0
    }
]