[
    {
        "author": "mcuban",
        "body": "Supply and Demand, but in this case it literally could be because the source of demand has been crippled . When RH shut it down, then cut it back, lets put aside why, they cut of the greatest source of demand.  They created a RobinHood Dive.  No RH buyers, means sellers lower their price to find buyers. And they keep on lowering it till they find buyers.  Keep the most natural buyers out of the market and the price keeps on FALLING.\n\nThen that drop accelerates because the more the stock falls the more owners who bought on margin get margin calls.  When that margin call happens, its brutal.  They just take your stock, send you a fuck you note and sell your stock at the market price, no matter how low. They just want to get your cash to pay back the loan. \n\nThat then accelerates the selling. \n\nWhich then leads to what we are seeing in the market right now with GME in particular\n\n&amp;#x200B;\n\nSo what to do ? \n\nIf you can afford to hold the stock, you hold.  I dont own it, but thats what i would do. \n\nWhy ? because when RH and the other online brokers open it back up to buyers, then we will see what WSB is really made of. That is when you get to make it all work. \n\nI have no doubt that there are funds and big players that have shorted this stock again thinking they are smarter than everyone on WSB.\n\nI know you are going to hate to hear this, but the lower it goes, the more powerful WSB can be stepping up to buy the stock again. The only question is what broker do you use . Do you stay with RH , who is going to have the same liquidity problems over and over again, or do you as a group find a broker with a far, far, far better balance sheet that wont cut you off and then go ham on Wall Street.",
        "created_utc": 1612277721,
        "id": "glqidn6",
        "score": 71259,
        "subreddit": "wallstreetbets",
        "created": 1612306521.0
    },
    {
        "author": "Sam474",
        "body": "During this scary and uncertain time with $GME I sure wish I knew a billionaire with a ton of experience in these things who could personally give me an opinion. That would be so fucking nice.\n\n&gt; If you can afford to hold the stock, you hold. I dont own it, but thats what i would do.\n\nHey does anyone know who this guy is? He thinks holding sounds good.",
        "created_utc": 1612278461,
        "id": "glqkf24",
        "score": 38084,
        "subreddit": "wallstreetbets",
        "created": 1612307261.0
    },
    {
        "author": "mcuban",
        "body": "Patience.  Disruption is never easy or straight line.  Is what you believe in still true. If it is, stay with it. If it's not, figure out what changed, learn from it and reload for the next asset . As always DO THE WORK.  Assets including stocks move for a lot of different reasons. Trading stocks isnt easy. Trading Crypto, NFT, whatever, isnt easy. None of this shit is easy. You know what it is ? Its time consuming and brain consuming.  And when you learn share.  If you want to beat old school Wall Street you have to share that knowledge and find the power in numbers",
        "created_utc": 1612277217,
        "id": "glqgybg",
        "score": 33230,
        "subreddit": "wallstreetbets",
        "created": 1612306017.0
    },
    {
        "author": "mcuban",
        "body": "I learned some expensive lessons when i first started trading stocks.  It was painful. But i tried to learn what i got right and wrong.  Right now, right here. The game is changing.  The hard part is ask yourself if what you believed in has actually changed. \n\nBTC HODLers are a great example to follow.  Many bought at the highs in 2017 and watched it fall by 2/3 or more.  But they held on because they believed in the asset. \n\nThe same applies to stocks.  When I buy a stock  I make sure i know why Im buying it. Then I HODL until till I learn that something has changed.  THe price may go up or down, but if i still believe in the logic that made me buy the asset, I dont sell. If something changed that I didnt expect , then I look at selling.",
        "created_utc": 1612277006,
        "id": "glqgclf",
        "score": 25541,
        "subreddit": "wallstreetbets",
        "created": 1612305806.0
    },
    {
        "author": "mcuban",
        "body": "What has happened the past few weeks with WSB has all happened before, it was just the big guys doing the battling. The only new thing was WSB traders took them on .\n\nVolkswagen was the short squeeze that was even crazier at the time.  Ackmen vs Icahn on Herbalife was similar to this, but it was big money vs big money\n\nMomentum and technical trading have been going on forever, which really is what is happening now broken down into charts and graphs. \n\nWhat i love about this now, is that if you pick your spots right and work as a group, you can hit again and again",
        "created_utc": 1612278821,
        "id": "glqldnc",
        "score": 24362,
        "subreddit": "wallstreetbets",
        "created": 1612307621.0
    },
    {
        "author": "mcuban",
        "body": "H/T to Spugliese for this question \n\n Hey Mark! Thanks for doing this. What are your thoughts on which services to use? I’m planning on getting g out of RH for obvious reasons, any retail trading companies you’d recommend? I want to support free trade and hit Robinhood in the wallet for what they’ve done here. Also, any legitimacy to a class action suit against them? \n\nPick the brokerage with the strongest balance sheet. What ruined it on RH is that they didnt have enough cash to deal with the growth in accounts, margin loans and volatility. The EXACT SAME THING will happen at the next broker if you dont make sure they have a MULTI-TRILLION dollar balance sheet to be able to handle these kind of circumstances \n\nAnd there will be class action suits. And they will be combined and they will win and you will get a check for less than $10",
        "created_utc": 1612280852,
        "id": "glqqzx6",
        "score": 18634,
        "subreddit": "wallstreetbets",
        "created": 1612309652.0
    },
    {
        "author": "RyoTheMan",
        "body": "down 80% from his 80K investment and his biggest issue is trying not to fap to it.  \n\n\nThis guy fucks",
        "created_utc": 1612285978,
        "id": "glr5cpp",
        "score": 18347,
        "subreddit": "wallstreetbets",
        "created": 1612314778.0
    },
    {
        "author": "seebrookebee",
        "body": "Lol three days ago he was ready to lose it all",
        "created_utc": 1612280283,
        "id": "glqpd44",
        "score": 16630,
        "subreddit": "wallstreetbets",
        "created": 1612309083.0
    },
    {
        "author": "idiesoonpls",
        "body": "Same guy that went deep on crypt at 10k -sold at first dip for a loss before it shot to 40k. His exit means nothing. He has been and always will be a paper handed bitch. And if history tells us anything him exiting his position means moon shots",
        "created_utc": 1612280683,
        "id": "glqqih5",
        "score": 13648,
        "subreddit": "wallstreetbets",
        "created": 1612309483.0
    },
    {
        "author": "alexneeeeewin",
        "body": "If only we had a regulatory body that's sole purpose is to take evidence like this and punish the people behind it",
        "created_utc": 1612216951,
        "id": "glnmlv2",
        "score": 13358,
        "subreddit": "wallstreetbets",
        "created": 1612245751.0
    },
    {
        "author": "epicoliver3",
        "body": "Give it to me and I can turn that 12k back into 65$",
        "created_utc": 1614216090,
        "id": "goniab6",
        "score": 12783,
        "subreddit": "wallstreetbets",
        "created": 1614244890.0
    },
    {
        "author": "OverlordHippo",
        "body": "\"it says here on your resume that you were published in the Wall Street Journal?\"",
        "created_utc": 1612216234,
        "id": "glnkvi6",
        "score": 12624,
        "subreddit": "wallstreetbets",
        "created": 1612245034.0
    },
    {
        "author": "miansaab17",
        "body": "If I didn't sell when it was above $400, why would I sell now?",
        "created_utc": 1614265735,
        "id": "gopneg6",
        "score": 11833,
        "subreddit": "wallstreetbets",
        "created": 1614294535.0
    },
    {
        "author": "UserWill",
        "body": "Bring this to the top - remind the paper hands to trade it in for diamonds.",
        "created_utc": 1614288277,
        "id": "gor7bv9",
        "score": 11289,
        "subreddit": "wallstreetbets",
        "created": 1614317077.0
    },
    {
        "author": "bpstclair",
        "body": "Just a thought: I’m a fairly disciplined investor more akin to r/stocks than WSB. I follow WSB for entertainment value and it never disappoints. \n\nHowever, what happened to these guys was not right. When RH restricted trading, I felt obligated to help carry the water up the hill, so I bought in at $395 and was/is prepared to lose it. \n\nLife is a series of moments like this one. I saw ordinary people from tons of different countries, backgrounds and political spectrums unite to try to “stick it to the man”. \n\nFor me, that was worth more than what I personally have lost monetarily so far.",
        "created_utc": 1612286865,
        "id": "glr7o95",
        "score": 11161,
        "subreddit": "stocks",
        "created": 1612315665.0
    },
    {
        "author": "Khamvom",
        "body": "Every news network is going on and on about silver. The only accounts that wanted silver were the thousands of bots spamming this page with it. HOLD THE LINE",
        "created_utc": 1612200666,
        "id": "glmgfzg",
        "score": 10658,
        "subreddit": "wallstreetbets",
        "created": 1612229466.0
    },
    {
        "author": "unmarried-egg",
        "body": "Thanks for this. I bought into GME in the 30s because of posts like this. I held because of memes and emojis. Still in, still optimistic, but it feels nice to put a wrinkle on the ol brain again. \n\nI think one of the main problems in addition to this is the media conundrum. Politics aside, you either have to believe CNBC that Melvin closed the position or you don’t. Or, deeper, that Melvin lied to them. Problem is, how can you learn the truth other than time?",
        "created_utc": 1612314462,
        "id": "glt1xig",
        "score": 10372,
        "subreddit": "wallstreetbets",
        "created": 1612343262.0
    },
    {
        "author": "mcuban",
        "body": "First, find a job to pay your bills. Got to take care of the basics. Then get back after it.  Just remember, its not in the dreaming, its in the doing",
        "created_utc": 1612276757,
        "id": "glqfokv",
        "score": 10047,
        "subreddit": "wallstreetbets",
        "created": 1612305557.0
    },
    {
        "author": "UkReadey",
        "body": "It tells us how many shares are being traded throughout the day and whether shares are being sold by us or HFs. \n\nLow volume with the price dropping generally means HFs are trading small amounts of stocks to each other to drive the price down. \n\nIf there was loads of volume and price continuously moving down this would indicate were selling.\nVolume is low and price going down. It's just bullshit manipulation with the same stocks, over and over",
        "created_utc": 1612204653,
        "id": "glmqw8a",
        "score": 9999,
        "subreddit": "wallstreetbets",
        "created": 1612233453.0
    },
    {
        "author": "iurnaux",
        "body": " **Upvote for everyone who missed out this on daily thread:**\n\n15 minutes before close on Friday, a huge 3500 sell order for $245 was listed on the boards and was being laddered down to hit it to trigger any $250 stop losses and hunt for more on the way down.\n\nAS THE SELL ORDER HIT THE BOARD... A 15,000 Buy order for $250 popped up like Gandalf at Helms Deep.\n\nThat buy order instantly chewed through every sell order in front of the $245 order, and the price shot to $315.\n\nA second 8000 sell order for $285 was posted 1 minute before close, and a solid wall of fucking justice popped up with a 13,000 share buy order for $290 and a second 5000 buy order for $310.\n\nThere was a HUGE player behind us Friday...\n\nIt was fucking magical.",
        "created_utc": 1612171227,
        "id": "glkxadp",
        "score": 9408,
        "subreddit": "wallstreetbets",
        "created": 1612200027.0
    },
    {
        "author": "willpowerlifter",
        "body": "Definitely happy to see this, and it supports my confirmation bias.",
        "created_utc": 1612243721,
        "id": "glp5tvp",
        "score": 8589,
        "subreddit": "wallstreetbets",
        "created": 1612272521.0
    },
    {
        "author": "AlbantheAlbanian",
        "body": "Someone tell me how this is not illegal? I’m betting it is, but when it’s global media outlets backed by hedgies (who are deliberately using media to manipulate paper handed investors) the thought of prosecuting is a pipe dream.",
        "created_utc": 1612195237,
        "id": "glm2fp2",
        "score": 8531,
        "subreddit": "wallstreetbets",
        "created": 1612224037.0
    },
    {
        "author": "mcuban",
        "body": "Yes.  WSB leveraged the value of community. They took it to the people and made it bottom up. There is so much power and upside in this.  Sometimes its expensive to learn. Anyone who has traded for  a while has learned an expensive lesson they couldnt afford. I know i have. \n\nnext time WSB will be smarter. And next time can still be around GME, AMC, etc. \n\nThere will be a point in the stock where wall street starts saying \"I told you so\",  let that happen for a few weeks. \n\nThen hit them again, at a broker with the financial strength to never have to shut you off",
        "created_utc": 1612281199,
        "id": "glqs0mj",
        "score": 8284,
        "subreddit": "wallstreetbets",
        "created": 1612309999.0
    },
    {
        "author": "Recklezzz",
        "body": "Ok thats it. Im buying.",
        "created_utc": 1612369761,
        "id": "glvl0pi",
        "score": 8002,
        "subreddit": "wallstreetbets",
        "created": 1612398561.0
    },
    {
        "author": "theycallme1",
        "body": "You did it. You brilliant bastard. You really did it.",
        "created_utc": 1614288169,
        "id": "gor72fj",
        "score": 7831,
        "subreddit": "wallstreetbets",
        "created": 1614316969.0
    },
    {
        "author": "13374L",
        "body": "Make sure you crack it on the rotate view as well",
        "created_utc": 1614266995,
        "id": "gopq9p4",
        "score": 7158,
        "subreddit": "wallstreetbets",
        "created": 1614295795.0
    },
    {
        "author": "TreeOfMadrigal",
        "body": "Just because we don't announce it doesn't mean we don't exist lmao.",
        "created_utc": 1612376628,
        "id": "glw2cdk",
        "score": 6862,
        "subreddit": "wallstreetbets",
        "created": 1612405428.0
    },
    {
        "author": "me4547",
        "body": "this is wallstreet bets when has it ever been about \"wise moves\"",
        "created_utc": 1612360723,
        "id": "glv05rt",
        "score": 6676,
        "subreddit": "wallstreetbets",
        "created": 1612389523.0
    },
    {
        "author": "commo64dor",
        "body": "The price doesn't fucking move. Germans are excellent in following orders, and it finally pays off",
        "created_utc": 1612268107,
        "id": "glpzre6",
        "score": 6540,
        "subreddit": "wallstreetbets",
        "created": 1612296907.0
    },
    {
        "author": "mcuban",
        "body": " LOVE LOVE LOVE it\n\nI think there should be incentives for companies to give stock to EVERY single employee",
        "created_utc": 1612279328,
        "id": "glqmqrk",
        "score": 6500,
        "subreddit": "wallstreetbets",
        "created": 1612308128.0
    },
    {
        "author": "bluedaddy1",
        "body": "I can’t read. Does it say Buy the dip and hold?",
        "created_utc": 1612217040,
        "id": "glnmtkk",
        "score": 6477,
        "subreddit": "wallstreetbets",
        "created": 1612245840.0
    },
    {
        "author": "EasternBearPower",
        "body": "Regarding Silver:\n\nThis might be a false flag operation.\n\nStep 1: Swarm the place with bots.\n\nStep 2: Start shilling and create conversation.\n\nStep 3: The media picks-up and \"blames\" the \"Reddit Army\".\n\nWe are not an army, this is a public forum, everyone says and does whatever it likes.\n\nThere is no leader, no group, no common goal besides becoming our wive's boyfriend.\n\nSuck a gourd.",
        "created_utc": 1612183791,
        "id": "gllcqdl",
        "score": 6395,
        "subreddit": "wallstreetbets",
        "created": 1612212591.0
    },
    {
        "author": "mcuban",
        "body": "i have no idea. No one really does.  I do think that once RH and others open up buying some of these will pop up. I just dont know how much or if it will happen for sure.\n\nI think the stocks are getting shorted because the shorts know that the natural buyers , the folks on RH and others like it are being prevented from buying, so that will make it most likely the stock will go down\n\nPeople dont realize how shorts jumped in when they saw the buy side shut off",
        "created_utc": 1612279087,
        "id": "glqm3io",
        "score": 6293,
        "subreddit": "wallstreetbets",
        "created": 1612307887.0
    },
    {
        "author": "Jesus_Would_Do",
        "body": "MOM ITS AN ONLINE GAME, I CANT FUCKING PAUSE IT",
        "created_utc": 1614276102,
        "id": "goqbw52",
        "score": 6074,
        "subreddit": "wallstreetbets",
        "created": 1614304902.0
    },
    {
        "author": "luroot",
        "body": "So that's what it feels like to have FU money...",
        "created_utc": 1614117540,
        "id": "goihddl",
        "score": 5482,
        "subreddit": "wallstreetbets",
        "created": 1614146340.0
    },
    {
        "author": "vladdasp",
        "body": "Good news. Could’ve come before I’ve shat myself, but hey, I’ll take it 🙌💎",
        "created_utc": 1612361110,
        "id": "glv0xd2",
        "score": 5378,
        "subreddit": "wallstreetbets",
        "created": 1612389910.0
    },
    {
        "author": "MtHoodMan",
        "body": "&gt; fucking incompetent\n\nMoon it is",
        "created_utc": 1614292259,
        "id": "gorgho5",
        "score": 5371,
        "subreddit": "wallstreetbets",
        "created": 1614321059.0
    },
    {
        "author": "kinsarc",
        "body": "We would NOT be in this position if the Robinhood bullshit hadn't occurred. It literally stopped the train. We should be pissed more than anything about that.",
        "created_utc": 1612305676,
        "id": "glsj6z1",
        "score": 5154,
        "subreddit": "wallstreetbets",
        "created": 1612334476.0
    },
    {
        "author": "2Fasting2Furious",
        "body": "Jeff Bezos, who owns the Post, happens to own the Post, and made it clear today that he owned the Post. \"I own the Post,\" the Post owner Bezos stated, \"and no one can tell me I don't own the Post, for in fact I do indeed own the Post.\"\n\nWhen asked to respond, Elon Musk, who does not own the Post (Jeff Bezos owns the Post) said, \"Give my regards to your Post owner, Jeff Bezos. He owns the Post, not me. I'm not Jeff Bezos. I'm not the man who owns the Post.\"\n\nIt should be noted that Jeff Bezos actually does, in fact, own the Post.\n\nhttps://postowner.com/jeffbezos/jeff-bezos-owns-the-post/",
        "created_utc": 1614115966,
        "id": "goidvt9",
        "score": 5109,
        "subreddit": "wallstreetbets",
        "created": 1614144766.0
    },
    {
        "author": "MangoSachem83",
        "body": "Is this what it feels like to be Melvin Capital?",
        "created_utc": 1612303100,
        "id": "glsd5cz",
        "score": 5012,
        "subreddit": "wallstreetbets",
        "created": 1612331900.0
    },
    {
        "author": "ForShotgun",
        "body": "If I had a dollar for every day we’ve said tomorrow’s the big day after it started dropping I’d... still be 60% down.",
        "created_utc": 1612320035,
        "id": "gltdcff",
        "score": 4984,
        "subreddit": "wallstreetbets",
        "created": 1612348835.0
    },
    {
        "author": "irishace88",
        "body": "They can drive it to $1 but when it comes time for them to buy shares the only shares they can buy will belong to us apes and will cost $10,000 because that's the only price us apes will sell them for",
        "created_utc": 1612218192,
        "id": "glnpjm1",
        "score": 4947,
        "subreddit": "wallstreetbets",
        "created": 1612246992.0
    },
    {
        "author": "Corvaldt",
        "body": "I just read an article on there slagging Reddit off because 'flash mobbing' silver won't work. WE KNOW. WE FUCKING KNOW. THAT'S WHY NO ONE HAS ACTUALLY SUGGESTED IT. I swear by the holy blue balls of Zeus if these fuckers did 60 seconds of primary research...",
        "created_utc": 1612214143,
        "id": "glnfope",
        "score": 4914,
        "subreddit": "wallstreetbets",
        "created": 1612242943.0
    },
    {
        "author": "zepapa",
        "body": "Got in at $291 with just 1 share. It ain't much, but honest work. Holding it until Alpha Centauri!",
        "created_utc": 1612191798,
        "id": "gllsyqk",
        "score": 4900,
        "subreddit": "wallstreetbets",
        "created": 1612220598.0
    },
    {
        "author": "Hester1868",
        "body": "my 2 y/o son just asked me “dad, is it true they rigged the stock market last week by illegally limiting trades on certain securities?” i said “yes son, it is true” i couldn’t lie to him. \n\nhe responded “HOLD THE FUCKING LINE” &amp; a tear came to my eye, i’ve never felt more proud",
        "created_utc": 1612213252,
        "id": "glndbyk",
        "score": 4883,
        "subreddit": "wallstreetbets",
        "created": 1612242052.0
    },
    {
        "author": "freakydeku",
        "body": "Yesterday I noticed that if you search “SLVR” on Reddit it ONLY shows those spam bots. Even if you try to search for silver showing results from r/wallstreetbets. I had to COME to the subreddit to see the post saying not to buy it, because I thought it had been deleted.",
        "created_utc": 1612204041,
        "id": "glmpa0g",
        "score": 4750,
        "subreddit": "wallstreetbets",
        "created": 1612232841.0
    },
    {
        "author": "Ninja_Destroyer_",
        "body": "Yeah, he's a chad. Paperhanded bitch boy. He ain't bout it bout it.",
        "created_utc": 1612296692,
        "id": "glrwonl",
        "score": 4668,
        "subreddit": "wallstreetbets",
        "created": 1612325492.0
    },
    {
        "author": "EldritchTruthBomb",
        "body": "I think the weak hands have already been shook. Anyone that's held this long is now in-it-to-win-it. I'm not even worried anymore. Everyone still holding values this too much to pull out now. Hell I'm getting a thrill just from constantly holding. Everyday it pisses them off even more.",
        "created_utc": 1612210567,
        "id": "gln68ac",
        "score": 4628,
        "subreddit": "wallstreetbets",
        "created": 1612239367.0
    },
    {
        "author": "Nelsaroni",
        "body": "Imagine the pressure and frustration he felt in real life. Then imagine the euphoria of getting the tendies at the end of it all.",
        "created_utc": 1612279370,
        "id": "glqmuys",
        "score": 4599,
        "subreddit": "wallstreetbets",
        "created": 1612308170.0
    },
    {
        "author": "red_adept",
        "body": "This is beautiful.  I lost it at the end.  \"This is not financial advice\"  ahaha",
        "created_utc": 1614387185,
        "id": "gox4gm6",
        "score": 4573,
        "subreddit": "wallstreetbets",
        "created": 1614415985.0
    },
    {
        "author": "newbuu2",
        "body": "&gt; I know you are going to hate to hear this, but the lower it goes, the more powerful WSB can be stepping up to buy the stock again. \n\nGetting stock for a discount? Who could be mad at that?",
        "created_utc": 1612279119,
        "id": "glqm6oi",
        "score": 4436,
        "subreddit": "wallstreetbets",
        "created": 1612307919.0
    },
    {
        "author": "explosivelydehiscent",
        "body": "WAKE UP. This is the day you have to HOLD like you've never held before. The orcs are out in force cyber bullying and the price manipulation is at a Crescendo or descendo since they are making it fall. HOLD. Don't let anyone tell you differently, not your boomer parents, trolls, or MLM friends from high school that need your money for eyeliner. HOLD.",
        "created_utc": 1612271187,
        "id": "glq4g1p",
        "score": 4319,
        "subreddit": "wallstreetbets",
        "created": 1612299987.0
    },
    {
        "author": "Throwawaythrower22",
        "body": "Told my boss I’d give him a handjob if it reaches $250 today.\nMan I love being self employed.",
        "created_utc": 1614343001,
        "id": "gotmo0y",
        "score": 4204,
        "subreddit": "wallstreetbets",
        "created": 1614371801.0
    },
    {
        "author": "FiveAlarmDogParty",
        "body": "Another thing we have to worry about is a lot of people had stop loss limits - so they’re trying to drive it down and hit those as a bit of a boost because as they push the stock to that point it triggers further selling - driving it lower. \n\nThese MFers really pulled out all the stops. Full blown market manipulation in multiple ways. Unbelievable that this shit is legal and it lends credence to the idea that they were faking shares and shorting them. Fuck everyone on the other side of this. We need an investigation yesterday",
        "created_utc": 1612281537,
        "id": "glqszwr",
        "score": 4196,
        "subreddit": "wallstreetbets",
        "created": 1612310337.0
    },
    {
        "author": "RenaissanceMan79",
        "body": "&gt;If i borrow a stock from you to short, and when I short it and your buddy buys it, then they can loan it to someone else to short\n\nI finally get it now:\n\n* A loans 1 share to B\n* B short sells it to C\n* C then loans the share out to D\n* D also short sells it\n\nEven though only 1 share is involved the short interest is now 2 because D owes C 1 share, and B owes A 1 share. D could buy and close the short with C, now C has a share that B could buy and close with A and the whole thing is unwound.\n\nOnly problem is D sold the share to WSB... and WE AREN'T SELLING!!! 💎🙌",
        "created_utc": 1612280654,
        "id": "glqqfj8",
        "score": 4117,
        "subreddit": "wallstreetbets",
        "created": 1612309454.0
    },
    {
        "author": "AutoModerator",
        "body": "That's a great question. It's an important question. Thanks for asking it. As I said in my opening statement, I appreciate you inviting me here to talk about this today. It's something that hasn't been discussed enough in my opinion. In conclusion, we're out of time.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
        "created_utc": 1614177602,
        "id": "gol3phr",
        "score": 4084,
        "subreddit": "wallstreetbets",
        "created": 1614206402.0
    },
    {
        "author": "umbrajoke",
        "body": "And he would deserve it.",
        "created_utc": 1614289194,
        "id": "gor9huo",
        "score": 4005,
        "subreddit": "wallstreetbets",
        "created": 1614317994.0
    },
    {
        "author": "SpaceBollzz",
        "body": "I'm on CNBC and Bloomberg they're both claiming silver is the new stock we're all chasing, there were a few posts about it here last night apparently, maybe one silver post for every 20 GME posts.\n\nDiversion tactic",
        "created_utc": 1612175972,
        "id": "gll2llg",
        "score": 3985,
        "subreddit": "wallstreetbets",
        "created": 1612204772.0
    },
    {
        "author": "fjposter22",
        "body": "Is it in the realm of possibility that these hedge funds just, don’t cover their shorts at all? They go full felon and act like it never happened, ala “Fake News!”?",
        "created_utc": 1612279427,
        "id": "glqn0h1",
        "score": 3903,
        "subreddit": "wallstreetbets",
        "created": 1612308227.0
    },
    {
        "author": "istrx13",
        "body": "Good thing I put that money in fully expecting to never see it again",
        "created_utc": 1614209719,
        "id": "gon54dk",
        "score": 3809,
        "subreddit": "wallstreetbets",
        "created": 1614238519.0
    },
    {
        "author": "Substantial-Wasabi86",
        "body": "This... This right here is beautiful. I wish I could read it.",
        "created_utc": 1612286001,
        "id": "glr5ezc",
        "score": 3754,
        "subreddit": "wallstreetbets",
        "created": 1612314801.0
    },
    {
        "author": "erjo5055",
        "body": "Did a band of retards just save their nostalgic childhood happy place? Sure seems like it",
        "created_utc": 1612362393,
        "id": "glv3mcu",
        "score": 3709,
        "subreddit": "wallstreetbets",
        "created": 1612391193.0
    },
    {
        "author": "DryTrumpin",
        "body": "#Just remember, they will HAVE to cover if you hold. No matter how low it goes",
        "created_utc": 1612362826,
        "id": "glv4k8m",
        "score": 3700,
        "subreddit": "wallstreetbets",
        "created": 1612391626.0
    },
    {
        "author": "robbo2020a",
        "body": "If it hits 0, that's a buying opportunity. They're worth atleast 10",
        "created_utc": 1612303285,
        "id": "glsdlcx",
        "score": 3616,
        "subreddit": "wallstreetbets",
        "created": 1612332085.0
    },
    {
        "author": "zjz",
        "body": "Hey I saw that people were saying good DD wasn't getting through. I made a change that should result in a lot more DD getting through even if it's from a newer user.\n\nI'm not sure if it'll solve the issue entirely but I'm working on it.",
        "created_utc": 1612216488,
        "id": "glnlhd4",
        "score": 3599,
        "subreddit": "wallstreetbets",
        "created": 1612245288.0
    },
    {
        "author": "HopelessFFBaddict",
        "body": "Probably just a cramp from trying to read. Eat a banana &amp; it will smooth back out",
        "created_utc": 1614315382,
        "id": "gospi0m",
        "score": 3595,
        "subreddit": "wallstreetbets",
        "created": 1614344182.0
    },
    {
        "author": "Pools4Adventures",
        "body": "It seems to me that a lot of people really like this stock.",
        "created_utc": 1612227213,
        "id": "glo9rts",
        "score": 3361,
        "subreddit": "wallstreetbets",
        "created": 1612256013.0
    },
    {
        "author": "Godspeedhero",
        "body": "Imagine how embarassing it must be to have billions of dollars at their disposal and work in the shadows manipulating the market only to get beat by a bunch of people with at most dollars in the thousands who openly tell everyone what they're doing.",
        "created_utc": 1614209727,
        "id": "gon54z7",
        "score": 3308,
        "subreddit": "wallstreetbets",
        "created": 1614238527.0
    },
    {
        "author": "Dave_Tribbiani",
        "body": "This is the paper bitch that bought b!tco!n at 12k and panic sold it at 10k LMAOOOOOO\n\n\nHe was never on our side.",
        "created_utc": 1612284198,
        "id": "glr0l1n",
        "score": 3300,
        "subreddit": "wallstreetbets",
        "created": 1612312998.0
    },
    {
        "author": "zachd2011",
        "body": "\"If you get it all the way I'll give you my Berkshire Hathaway stock\" lmaooo",
        "created_utc": 1612234457,
        "id": "gloowwz",
        "score": 3297,
        "subreddit": "wallstreetbets",
        "created": 1612263257.0
    },
    {
        "author": "Hybrid_Blood",
        "body": "Could just sell tomorrow, might even get lucky and it will uptick a bit",
        "created_utc": 1614288661,
        "id": "gor88pw",
        "score": 3296,
        "subreddit": "wallstreetbets",
        "created": 1614317461.0
    },
    {
        "author": "JimCricket99",
        "body": "Oh man, CNBC just put silver experts on TV, who said not seeing shorts, it looks long. The other said not worth the buy. \n\nCNBC: Okay Thank You. \n\nTotal interview time like 1 maybe 2min. Looks like the price is wrong Bob. 😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂",
        "created_utc": 1612209086,
        "id": "gln2gip",
        "score": 3295,
        "subreddit": "wallstreetbets",
        "created": 1612237886.0
    },
    {
        "author": "InfiniteElway",
        "body": "For the newbies..\nYou say youll do something, you do it or get banned\n\nDrink piss\nEat shit\n\nChop off penis",
        "created_utc": 1612219478,
        "id": "glnsoiw",
        "score": 3232,
        "subreddit": "wallstreetbets",
        "created": 1612248278.0
    },
    {
        "author": "OrangesAreOrangeHa",
        "body": "Until they stop limiting buys, it won’t move up.\n\nAnd even then, can momentum be restarted?\n\nThat’s the whole story to me.  If they allow buying and a headline or two turn bullish, then it’s moon time.  Otherwise, it’s Olive Garden time.",
        "created_utc": 1612311729,
        "id": "glsw9zp",
        "score": 3224,
        "subreddit": "wallstreetbets",
        "created": 1612340529.0
    },
    {
        "author": "mcuban",
        "body": "yes. definitely. HODLing worked in CRYPTO.  But it will take some Whales to act as a foundation",
        "created_utc": 1612280365,
        "id": "glqplmh",
        "score": 3215,
        "subreddit": "wallstreetbets",
        "created": 1612309165.0
    },
    {
        "author": "the_Rei",
        "body": "To be honest, this bullshit upsets me more than it should...been hearing all morning how “reddit created the silver rally” when all I see on Reddit are posts/comments exposing the scam. **Do they not see it or are they choosing to ignore it?**",
        "created_utc": 1612195995,
        "id": "glm4fo4",
        "score": 3136,
        "subreddit": "wallstreetbets",
        "created": 1612224795.0
    },
    {
        "author": "griff_girl",
        "body": "I closed my eyes and tried to read it in braille across the screen but it was just smooth— like my brain, only less mushy.",
        "created_utc": 1612294865,
        "id": "glrs2p7",
        "score": 3116,
        "subreddit": "wallstreetbets",
        "created": 1612323665.0
    },
    {
        "author": "U2ez_",
        "body": "Exactly. I’d bet my gains that he doesn’t say anything about selling, he just does it when he wants and doesn’t say anything until people see it in his update after market close.",
        "created_utc": 1612244420,
        "id": "glp6vs2",
        "score": 3079,
        "subreddit": "wallstreetbets",
        "created": 1612273220.0
    },
    {
        "author": "odraencoded",
        "body": "Deep Fucking Value said he would buy the stock at the price it was.\n\nDeep Fucking Value bought 50k shares this week.  \n\nDeep Fucking Value just profited obscenely from this.\n\nI'm not religious but I'm pretty sure DFV is some sort of messiah.",
        "created_utc": 1614206273,
        "id": "gomxntv",
        "score": 3021,
        "subreddit": "wallstreetbets",
        "created": 1614235073.0
    },
    {
        "author": "godson21212",
        "body": "Lol imagine the media shitstorm if this poor fucking schmuck actually does it  and posts a video here. CNBC wouldn't even have to be creative. \"WSB castrates redditor in a satanic ritual to beseech the market gods for bountiful tendie harvest!\"",
        "created_utc": 1612228649,
        "id": "glocski",
        "score": 2997,
        "subreddit": "wallstreetbets",
        "created": 1612257449.0
    },
    {
        "author": "pizzadude139",
        "body": "Honestly I think the biggest source of inspiration one can take from him isn’t necessarily hodling $GME. It is to find a treasure of a stock before anybody else does and start buying leaps. That should honestly be the biggest takeaway here.",
        "created_utc": 1612239293,
        "id": "gloyeye",
        "score": 2965,
        "subreddit": "wallstreetbets",
        "created": 1612268093.0
    },
    {
        "author": "JohnGCarroll",
        "body": "Bleeding red? Loss of momentum? What? Did we just watch the same day? Volume was low, hedges desperately running their ladder attack and it not working. There is no loss of momentum. Millions more retail investors poured into the stock today.",
        "created_utc": 1612216151,
        "id": "glnkob6",
        "score": 2962,
        "subreddit": "wallstreetbets",
        "created": 1612244951.0
    },
    {
        "author": "GrayGanja",
        "body": " Everyone was complaining when this stock was $300-400 that \"Oh man I wish I would've got in it earlier\". WELL HERE IS YOUR WISH MOTHERFUCKER. IT IS SITTING AT sub $100. THIS IS RIGHT WHERE YOU WANT IT. QUIT ALL THIS PAPER HANDED SHIT. WE ARE IN THE PERFECT POSITION. BUY THE DIP RIDE IT HIGH.",
        "created_utc": 1612281867,
        "id": "glqtx53",
        "score": 2927,
        "subreddit": "wallstreetbets",
        "created": 1612310667.0
    },
    {
        "author": "tunafun",
        "body": "The cfo resigned because it looks better than getting fired",
        "created_utc": 1614131151,
        "id": "goj8vf5",
        "score": 2922,
        "subreddit": "wallstreetbets",
        "created": 1614159951.0
    },
    {
        "author": "wakeuphicks",
        "body": "HOW DO YOU WANT TO HANDLE IT?",
        "created_utc": 1612309606,
        "id": "glsru1r",
        "score": 2917,
        "subreddit": "wallstreetbets",
        "created": 1612338406.0
    },
    {
        "author": "Kos__",
        "body": "Me. I’m 💎🙌🏻 but it’s concerning seeing “regretful” and “doubtful” posts on social media. Mass sellers don’t help our cause. I’m still up since I got in at $43 but it will all be for nothing if people sell",
        "created_utc": 1612342666,
        "id": "glucclo",
        "score": 2910,
        "subreddit": "wallstreetbets",
        "created": 1612371466.0
    },
    {
        "author": "shad0wtig3r",
        "body": "Yes Jim it's fraud you stupid fuck, why can't you see that when your cohost can?\n\nThey are literally scared to call it what it is.",
        "created_utc": 1614264725,
        "id": "gopl1e2",
        "score": 2900,
        "subreddit": "wallstreetbets",
        "created": 1614293525.0
    },
    {
        "author": "MST_RK_P2",
        "body": "Just impaled a bratwurst and washed it down with a doppelbock at 6 AM EST in the states to show my respect.",
        "created_utc": 1612351742,
        "id": "glumejb",
        "score": 2865,
        "subreddit": "wallstreetbets",
        "created": 1612380542.0
    },
    {
        "author": "blow_zephyr",
        "body": "Is it true that you were told to stop investing in everyone who came on shark tank because you were making the other sharks look bad?",
        "created_utc": 1612278404,
        "id": "glqk9kb",
        "score": 2861,
        "subreddit": "wallstreetbets",
        "created": 1612307204.0
    },
    {
        "author": "OrdinaryInformation",
        "body": "It smells like 📃🙌 bitch in here. I'm not fucking selling.",
        "created_utc": 1612281517,
        "id": "glqsxwv",
        "score": 2828,
        "subreddit": "wallstreetbets",
        "created": 1612310317.0
    },
    {
        "author": "Bad-Buck",
        "body": "This is it. This is the post that convinced me I’m just living in a computer program.",
        "created_utc": 1612307737,
        "id": "glsnts4",
        "score": 2778,
        "subreddit": "wallstreetbets",
        "created": 1612336537.0
    },
    {
        "author": "DrowningRabbit",
        "body": "I mean, I can't say I'm super upset with the sub $100 price, as I came in for solidarity at $312 with 1 share.\n\nToday it hitting sub $100 means I just doubled down and got an extra 2. I'm at my limit of \"Eh, I can lose this and not care\" so I'll hold strong with my little 3 stonks, but if I'm here, you should be here too!!  💎  👐",
        "created_utc": 1612280512,
        "id": "glqq0uq",
        "score": 2771,
        "subreddit": "wallstreetbets",
        "created": 1612309312.0
    },
    {
        "author": "Hi-Im-High",
        "body": "We accidentally didn’t turn off auto ship on a large tub of kelp and bottle of fish oil for our dogs. we tried to return them and they said “keep it, please donate it to a shelter if you don’t need it” amazing and have ordered from them since.",
        "created_utc": 1612362244,
        "id": "glv3anc",
        "score": 2768,
        "subreddit": "wallstreetbets",
        "created": 1612391044.0
    },
    {
        "author": "alphabolo",
        "body": "it is so dystopian to google 'silver squeeze' and see mainstream financial media establishments across the board inexplicably reporting that it's what we're now obsessed with. Anyone actually browsing here knows the opposite is true.",
        "created_utc": 1612177860,
        "id": "gll4smy",
        "score": 2762,
        "subreddit": "wallstreetbets",
        "created": 1612206660.0
    },
    {
        "author": "massdev",
        "body": "Yup the hedge is the play because they are betting not only will stock support collapse but that WSB et al. have paper hands.\n\nIt allows them to suppress the price and support without actually chasing the shares driving up demand and price which is counter to their goals.",
        "created_utc": 1612218457,
        "id": "glnq6qd",
        "score": 2749,
        "subreddit": "wallstreetbets",
        "created": 1612247257.0
    },
    {
        "author": "Greenplums1",
        "body": "Absolutely. These Canadian journalists are nothing special, it's just that they are a govt funded org (CBC) so their bosses and bosses' bosses aren't beholden to private hands. Journalists are generally smart, national journalists are exceedingly smart. The idea that they (US national journalists) didn't check whether or not WSB was encouraging silver or whatever else is a joke. They checked. They know WSB is not. But do they care? Either they don't care and they publish what they think they boss wants them to think or the guy above them tells them \"hmm great job, but keep working on it; try this angle or that angle.\" \n\nAnd guess when the boss approves it? When it says what he thinks his bosses will like for it to say. No conspiracy required. \n\nPeople who say \"durr how can you think the media is a conspiracy?!\" have never worked in a newsroom. There are countless ways to get the message you want the exact way you want and they don't require starting a seance with cloaks and daggers shouting \"we are the media! this is conspiracy!\"\n\nOnce it becomes more and more obvious the shilling of silver and whatever else, when it becomes untenable to argue the opposite, suddenly US journalists will be like \"ahhh actually the redditors didn't do x y and z\" It's just a shell game, wasting time and printing lies until they can't then they move the goalposts, etc.",
        "created_utc": 1612211274,
        "id": "gln82a1",
        "score": 2740,
        "subreddit": "wallstreetbets",
        "created": 1612240074.0
    },
    {
        "author": "cafescafes",
        "body": "tldr; buy more GME Monday, got it",
        "created_utc": 1614387340,
        "id": "gox4qqv",
        "score": 2739,
        "subreddit": "wallstreetbets",
        "created": 1614416140.0
    },
    {
        "author": "MrHandyHands616",
        "body": "*Just posted this in GME part 1 so sorry for copy paste but I can’t contain myself!!!!!!*\n\nSeriously these hedges are fucking oblivious. We are retarded apes. When the price dips we FUCKING BUY MORE.  GME round 1 was like boot camp or training or whatever the fuck, but my point is that we all have been hardened and have also seen the promised land.\n\nThe only reason we didn’t squeeze to thousands per share the first round was fucking Robinhood. Now that people switched brokers, and we’ve seen all the hedges other tricks, I’m so damn optimistic. \n\nAll you fucks that bought at $300 need to take a shower and get dressed because we are coming to pick you up!!! \n\nAvg cost basis $78 here. I’m averaging up!! Goofy said it best. ILL FUKN DO IT AGAIN\n\n🚀🚀🚀🙌💎🙌🚀🚀🚀🚀",
        "created_utc": 1614275336,
        "id": "goq9zby",
        "score": 2733,
        "subreddit": "wallstreetbets",
        "created": 1614304136.0
    },
    {
        "author": "I_DILL_E",
        "body": "I will pay off my astronomical amount of student loans if it reaches 5k. Please ban me if it dont lol",
        "created_utc": 1614249654,
        "id": "gooxbtw",
        "score": 2691,
        "subreddit": "wallstreetbets",
        "created": 1614278454.0
    },
    {
        "author": "HatDisaster",
        "body": "I’ve had YOLO for over a year.  I buy into these sector ETF’s to make it seem like I don’t have a gambling habit.  It’s like craft beer and alcoholics.",
        "created_utc": 1612979177,
        "id": "gmu8vj0",
        "score": 2687,
        "subreddit": "wallstreetbets",
        "created": 1613007977.0
    },
    {
        "author": "alexneeeeewin",
        "body": "If only we had a regulatory body that's sole purpose is to take evidence like this and punish the people behind it",
        "created_utc": 1612216951,
        "id": "glnmlv2",
        "score": 13358,
        "subreddit": "wallstreetbets",
        "created": 1612245751.0
    },
    {
        "author": "OverlordHippo",
        "body": "\"it says here on your resume that you were published in the Wall Street Journal?\"",
        "created_utc": 1612216234,
        "id": "glnkvi6",
        "score": 12624,
        "subreddit": "wallstreetbets",
        "created": 1612245034.0
    },
    {
        "author": "Khamvom",
        "body": "Every news network is going on and on about silver. The only accounts that wanted silver were the thousands of bots spamming this page with it. HOLD THE LINE",
        "created_utc": 1612200666,
        "id": "glmgfzg",
        "score": 10658,
        "subreddit": "wallstreetbets",
        "created": 1612229466.0
    },
    {
        "author": "UkReadey",
        "body": "It tells us how many shares are being traded throughout the day and whether shares are being sold by us or HFs. \n\nLow volume with the price dropping generally means HFs are trading small amounts of stocks to each other to drive the price down. \n\nIf there was loads of volume and price continuously moving down this would indicate were selling.\nVolume is low and price going down. It's just bullshit manipulation with the same stocks, over and over",
        "created_utc": 1612204653,
        "id": "glmqw8a",
        "score": 9999,
        "subreddit": "wallstreetbets",
        "created": 1612233453.0
    },
    {
        "author": "iurnaux",
        "body": " **Upvote for everyone who missed out this on daily thread:**\n\n15 minutes before close on Friday, a huge 3500 sell order for $245 was listed on the boards and was being laddered down to hit it to trigger any $250 stop losses and hunt for more on the way down.\n\nAS THE SELL ORDER HIT THE BOARD... A 15,000 Buy order for $250 popped up like Gandalf at Helms Deep.\n\nThat buy order instantly chewed through every sell order in front of the $245 order, and the price shot to $315.\n\nA second 8000 sell order for $285 was posted 1 minute before close, and a solid wall of fucking justice popped up with a 13,000 share buy order for $290 and a second 5000 buy order for $310.\n\nThere was a HUGE player behind us Friday...\n\nIt was fucking magical.",
        "created_utc": 1612171227,
        "id": "glkxadp",
        "score": 9408,
        "subreddit": "wallstreetbets",
        "created": 1612200027.0
    },
    {
        "author": "AlbantheAlbanian",
        "body": "Someone tell me how this is not illegal? I’m betting it is, but when it’s global media outlets backed by hedgies (who are deliberately using media to manipulate paper handed investors) the thought of prosecuting is a pipe dream.",
        "created_utc": 1612195237,
        "id": "glm2fp2",
        "score": 8531,
        "subreddit": "wallstreetbets",
        "created": 1612224037.0
    },
    {
        "author": "bluedaddy1",
        "body": "I can’t read. Does it say Buy the dip and hold?",
        "created_utc": 1612217040,
        "id": "glnmtkk",
        "score": 6477,
        "subreddit": "wallstreetbets",
        "created": 1612245840.0
    },
    {
        "author": "EasternBearPower",
        "body": "Regarding Silver:\n\nThis might be a false flag operation.\n\nStep 1: Swarm the place with bots.\n\nStep 2: Start shilling and create conversation.\n\nStep 3: The media picks-up and \"blames\" the \"Reddit Army\".\n\nWe are not an army, this is a public forum, everyone says and does whatever it likes.\n\nThere is no leader, no group, no common goal besides becoming our wive's boyfriend.\n\nSuck a gourd.",
        "created_utc": 1612183791,
        "id": "gllcqdl",
        "score": 6395,
        "subreddit": "wallstreetbets",
        "created": 1612212591.0
    },
    {
        "author": "irishace88",
        "body": "They can drive it to $1 but when it comes time for them to buy shares the only shares they can buy will belong to us apes and will cost $10,000 because that's the only price us apes will sell them for",
        "created_utc": 1612218192,
        "id": "glnpjm1",
        "score": 4947,
        "subreddit": "wallstreetbets",
        "created": 1612246992.0
    },
    {
        "author": "Corvaldt",
        "body": "I just read an article on there slagging Reddit off because 'flash mobbing' silver won't work. WE KNOW. WE FUCKING KNOW. THAT'S WHY NO ONE HAS ACTUALLY SUGGESTED IT. I swear by the holy blue balls of Zeus if these fuckers did 60 seconds of primary research...",
        "created_utc": 1612214143,
        "id": "glnfope",
        "score": 4914,
        "subreddit": "wallstreetbets",
        "created": 1612242943.0
    },
    {
        "author": "zepapa",
        "body": "Got in at $291 with just 1 share. It ain't much, but honest work. Holding it until Alpha Centauri!",
        "created_utc": 1612191798,
        "id": "gllsyqk",
        "score": 4900,
        "subreddit": "wallstreetbets",
        "created": 1612220598.0
    },
    {
        "author": "Hester1868",
        "body": "my 2 y/o son just asked me “dad, is it true they rigged the stock market last week by illegally limiting trades on certain securities?” i said “yes son, it is true” i couldn’t lie to him. \n\nhe responded “HOLD THE FUCKING LINE” &amp; a tear came to my eye, i’ve never felt more proud",
        "created_utc": 1612213252,
        "id": "glndbyk",
        "score": 4883,
        "subreddit": "wallstreetbets",
        "created": 1612242052.0
    },
    {
        "author": "freakydeku",
        "body": "Yesterday I noticed that if you search “SLVR” on Reddit it ONLY shows those spam bots. Even if you try to search for silver showing results from r/wallstreetbets. I had to COME to the subreddit to see the post saying not to buy it, because I thought it had been deleted.",
        "created_utc": 1612204041,
        "id": "glmpa0g",
        "score": 4750,
        "subreddit": "wallstreetbets",
        "created": 1612232841.0
    },
    {
        "author": "EldritchTruthBomb",
        "body": "I think the weak hands have already been shook. Anyone that's held this long is now in-it-to-win-it. I'm not even worried anymore. Everyone still holding values this too much to pull out now. Hell I'm getting a thrill just from constantly holding. Everyday it pisses them off even more.",
        "created_utc": 1612210567,
        "id": "gln68ac",
        "score": 4628,
        "subreddit": "wallstreetbets",
        "created": 1612239367.0
    },
    {
        "author": "SpaceBollzz",
        "body": "I'm on CNBC and Bloomberg they're both claiming silver is the new stock we're all chasing, there were a few posts about it here last night apparently, maybe one silver post for every 20 GME posts.\n\nDiversion tactic",
        "created_utc": 1612175972,
        "id": "gll2llg",
        "score": 3985,
        "subreddit": "wallstreetbets",
        "created": 1612204772.0
    },
    {
        "author": "zjz",
        "body": "Hey I saw that people were saying good DD wasn't getting through. I made a change that should result in a lot more DD getting through even if it's from a newer user.\n\nI'm not sure if it'll solve the issue entirely but I'm working on it.",
        "created_utc": 1612216488,
        "id": "glnlhd4",
        "score": 3599,
        "subreddit": "wallstreetbets",
        "created": 1612245288.0
    },
    {
        "author": "Pools4Adventures",
        "body": "It seems to me that a lot of people really like this stock.",
        "created_utc": 1612227213,
        "id": "glo9rts",
        "score": 3361,
        "subreddit": "wallstreetbets",
        "created": 1612256013.0
    },
    {
        "author": "JimCricket99",
        "body": "Oh man, CNBC just put silver experts on TV, who said not seeing shorts, it looks long. The other said not worth the buy. \n\nCNBC: Okay Thank You. \n\nTotal interview time like 1 maybe 2min. Looks like the price is wrong Bob. 😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂",
        "created_utc": 1612209086,
        "id": "gln2gip",
        "score": 3295,
        "subreddit": "wallstreetbets",
        "created": 1612237886.0
    },
    {
        "author": "InfiniteElway",
        "body": "For the newbies..\nYou say youll do something, you do it or get banned\n\nDrink piss\nEat shit\n\nChop off penis",
        "created_utc": 1612219478,
        "id": "glnsoiw",
        "score": 3232,
        "subreddit": "wallstreetbets",
        "created": 1612248278.0
    },
    {
        "author": "the_Rei",
        "body": "To be honest, this bullshit upsets me more than it should...been hearing all morning how “reddit created the silver rally” when all I see on Reddit are posts/comments exposing the scam. **Do they not see it or are they choosing to ignore it?**",
        "created_utc": 1612195995,
        "id": "glm4fo4",
        "score": 3136,
        "subreddit": "wallstreetbets",
        "created": 1612224795.0
    },
    {
        "author": "godson21212",
        "body": "Lol imagine the media shitstorm if this poor fucking schmuck actually does it  and posts a video here. CNBC wouldn't even have to be creative. \"WSB castrates redditor in a satanic ritual to beseech the market gods for bountiful tendie harvest!\"",
        "created_utc": 1612228649,
        "id": "glocski",
        "score": 2997,
        "subreddit": "wallstreetbets",
        "created": 1612257449.0
    },
    {
        "author": "JohnGCarroll",
        "body": "Bleeding red? Loss of momentum? What? Did we just watch the same day? Volume was low, hedges desperately running their ladder attack and it not working. There is no loss of momentum. Millions more retail investors poured into the stock today.",
        "created_utc": 1612216151,
        "id": "glnkob6",
        "score": 2962,
        "subreddit": "wallstreetbets",
        "created": 1612244951.0
    },
    {
        "author": "alphabolo",
        "body": "it is so dystopian to google 'silver squeeze' and see mainstream financial media establishments across the board inexplicably reporting that it's what we're now obsessed with. Anyone actually browsing here knows the opposite is true.",
        "created_utc": 1612177860,
        "id": "gll4smy",
        "score": 2762,
        "subreddit": "wallstreetbets",
        "created": 1612206660.0
    },
    {
        "author": "massdev",
        "body": "Yup the hedge is the play because they are betting not only will stock support collapse but that WSB et al. have paper hands.\n\nIt allows them to suppress the price and support without actually chasing the shares driving up demand and price which is counter to their goals.",
        "created_utc": 1612218457,
        "id": "glnq6qd",
        "score": 2749,
        "subreddit": "wallstreetbets",
        "created": 1612247257.0
    },
    {
        "author": "Greenplums1",
        "body": "Absolutely. These Canadian journalists are nothing special, it's just that they are a govt funded org (CBC) so their bosses and bosses' bosses aren't beholden to private hands. Journalists are generally smart, national journalists are exceedingly smart. The idea that they (US national journalists) didn't check whether or not WSB was encouraging silver or whatever else is a joke. They checked. They know WSB is not. But do they care? Either they don't care and they publish what they think they boss wants them to think or the guy above them tells them \"hmm great job, but keep working on it; try this angle or that angle.\" \n\nAnd guess when the boss approves it? When it says what he thinks his bosses will like for it to say. No conspiracy required. \n\nPeople who say \"durr how can you think the media is a conspiracy?!\" have never worked in a newsroom. There are countless ways to get the message you want the exact way you want and they don't require starting a seance with cloaks and daggers shouting \"we are the media! this is conspiracy!\"\n\nOnce it becomes more and more obvious the shilling of silver and whatever else, when it becomes untenable to argue the opposite, suddenly US journalists will be like \"ahhh actually the redditors didn't do x y and z\" It's just a shell game, wasting time and printing lies until they can't then they move the goalposts, etc.",
        "created_utc": 1612211274,
        "id": "gln82a1",
        "score": 2740,
        "subreddit": "wallstreetbets",
        "created": 1612240074.0
    },
    {
        "author": "Ca1amity",
        "body": "##1. Remind everyone that these short attacks are in part to find your stop losses and snipe them.\n\n##2. Remind everyone that today's low close will be fed to the news media to manipulate sentiment - expect headlines and coverage saying \"we told you so, get out while you still can\"; \"the squeeze is over\"; \"the hedges have covered\" etc. This is *designed* to trigger a fear response in your brain.\n\n##3. Remind everyone to stop using robinhood\n\n##4. Remind everyone to buy when they can - the more real shares we lock up and hold, the fewer they have to buy and cover.\n\n##5. Remind everyone that even if they ladder this down to fucking $5 and start buying to cover the SP will, by definition, have to rise. They can't buy what they need to cover from each other, the math just doesn't work out.\n\n##6. Remind everyone there is a very good chance they were using fake shares in these short positions adding to the blatantly illegal activity we've seen thus far. There is legitimate DD on this possibility that's been posted here and on actual investing subreddits.\n\n##7. Remind everyone that it is not a loss until you sell. That is why your account says \"unrealized gains\" and \"unrealized losses.\" Until you click the button it hasn't happened.",
        "created_utc": 1612213743,
        "id": "glnemu7",
        "score": 2421,
        "subreddit": "wallstreetbets",
        "created": 1612242543.0
    },
    {
        "author": "SirGeraltTheWitcher",
        "body": "I love a good detailed call out, yes, love it.\n\nFor every award this post gets, I'll love it move.",
        "created_utc": 1612206951,
        "id": "glmx00l",
        "score": 2352,
        "subreddit": "wallstreetbets",
        "created": 1612235751.0
    },
    {
        "author": "hororopu",
        "body": " **Important Update on short interest: (also Sorry for spamming a bit but I feel like this can't be spammed enough...it really is that important)**\n\n**1:** you can't short any GME stock on Schwab. (For the ultra retards: no available stock to short -&gt;fake news all over)\nFuc'em [https://twitter.com/AlphaRRCapital1/status/1356277059945955330/photo/1](https://twitter.com/AlphaRRCapital1/status/1356277059945955330/photo/1)\n\n**2:** CEO of S3 Partners(short interest data analyst company) Just did an interview with fucking CNBC.... Don't trust the fucking data they put out and spread the word. 💎✋ 🚀🚀🚀\n\n[https://twitter.com/S3Partners/status/1356261321537433602](https://twitter.com/S3Partners/status/1356261321537433602)\n\n(Just tell me that you already fucking know so I fucking know that you retards fucking know and just keep 💎✋)",
        "created_utc": 1612206625,
        "id": "glmw5ex",
        "score": 2324,
        "subreddit": "wallstreetbets",
        "created": 1612235425.0
    },
    {
        "author": "Comprehensive-Ad7423",
        "body": "So, let’s just rewind a few days. Thursday, they executed a ladder attack, trading large stock holdings between themselves, gradually lowering the offering each time. What did this do? Trick the market algorithms into thinking there was a mass sell off! Was there really? Fuck no.\nDid we sell? Fuck no! Did we hold? Fuck yes! 💎🤲🏻💎🤲🏻\n\nIn the hours following their futile attempt of BLATANT ILLEGAL MARKET MANIPULATION, the stock rose again to +300, an honest representation of the situation, because none of us retards sold!!!\n\nThe corrupts at wall street have had the entire weekend to think of a strategy to keep us at bay. Trying to create hype about silver to distract us, using their media contacts to distort the narrative, scaremongering... has it worked? Fuck no!\n\nWhat they are now doing is using a reduced form of laddering to keep the main stocks at bay. In other words they will continue to trade between themselves at a level that will keep the stock stagnant. This will be a futile attempt to deceive us that the game is up (excuse the pun) and that the squeeze is over.\n\nPeople, the squeeze is just getting started! It has barley begun!\nThey will do EVERYTHING in their power to come out on top. The amount of blatant illegal acts they committed last week proves this. There are literally no rules they will not break on their quest to cause panic and ultimately get us retards to sell our stock.\n\nThey are continuing to drive the price down now aftermarket in attempt to create further panic so that people sell tomorrow. This is exactly what they want. DO NOT FALL FOR IT!!!\n\nHERE IS THE IMPORTANT PART;\nNo matter what people say, what you hear in the media or any other form of bullshit distraction...\n\nTHEY CANNOT CLOSE THEIR POSITIONS UNLESS WE SELL. Simple as that. It’s mathematics. The short float is more than the physical amount of existing shares. Bottom line.\n\nThey can’t get out of this without buying the shares back. And who controls the price at which the buy back? WE DO!\n\nEveryone just take a step back, chill out, block out the noise and absolutely 100% hold every bit of stock you own.\nWe are winning here. It really is that simple.\n\nIf everyone can stay cool and follow this advice, we got this.\n\nPlease upvote, share etc. Don’t care about karma or anything this is far more important. The message needs to be spread so that we can do what’s necessary and finally get ours. We’ve spent too long being oppressed by this corrupt system. It’s time for change.\n\nGME &amp; AMC are the main focus. Anything else is a distraction.\n\nLETS DO THIS!!! 💎🤲🏻💎🤲🏻💎🤲🏻",
        "created_utc": 1612217728,
        "id": "glnofug",
        "score": 2303,
        "subreddit": "wallstreetbets",
        "created": 1612246528.0
    },
    {
        "author": "Anxietyonfilm",
        "body": "Ironically it's making it so poor people like me can buy shares, I now have 5 GME, 🚀🚀🚀\n\nNot financial advice just a retard who wants a rocket",
        "created_utc": 1612196396,
        "id": "glm5hsj",
        "score": 2273,
        "subreddit": "wallstreetbets",
        "created": 1612225196.0
    },
    {
        "author": "UnhingedCorgi",
        "body": "It’s part of painting the picture that we’re a bunch of gambling, immature degenerates. Which is fair, but it doesn’t mean we’re wrong...",
        "created_utc": 1612218357,
        "id": "glnpxyq",
        "score": 2262,
        "subreddit": "wallstreetbets",
        "created": 1612247157.0
    },
    {
        "author": "teddyog",
        "body": "\"I'm retarded. I don't even know how to check buying volume.\" So true it almost hurts.",
        "created_utc": 1612221204,
        "id": "glnwq7v",
        "score": 2232,
        "subreddit": "wallstreetbets",
        "created": 1612250004.0
    },
    {
        "author": "MarinaraSaucey12",
        "body": "I only got to buy one stock. I know it isn’t much but I’m trying my best",
        "created_utc": 1612212065,
        "id": "glna3wu",
        "score": 2179,
        "subreddit": "wallstreetbets",
        "created": 1612240865.0
    },
    {
        "author": "Comprehensive-Ad7423",
        "body": "So, let’s just rewind a few days.\n\nThursday, they executed a ladder attack, trading large stock holdings between themselves, gradually lowering the offering each time. What did this do? Trick the market algorithms into thinking there was a mass sell off! Was there really? Fuck no. Did we sell? Fuck no! Did we hold? Fuck yes! 💎🤲🏻💎🤲🏻\n\nIn the hours following their futile attempt of BLATANT ILLEGAL MARKET MANIPULATION, the stock rose again to +300, an honest representation of the situation, because none of us retards sold!!!\n\nThe corrupts at wall street have had the entire weekend to think of a strategy to keep us at bay. Trying to create hype about silver to distract us, using their media contacts to distort the narrative, scaremongering... has it worked? Fuck no!\n\nWhat they are now doing is using a reduced form of laddering to keep the main stocks at bay. In other words they will continue to trade between themselves at a level that will keep the stock stagnant. This will be a futile attempt to deceive us that the game is up (excuse the pun) and that the squeeze is over.\n\nPeople, the squeeze is just getting started! It has barley begun!\n\nThey will do EVERYTHING in their power to come out on top. The amount of blatant illegal acts they committed last week proves this. There are literally no rules they will not break on their quest to cause panic and ultimately get us retards to sell our stock.\n\nThey are continuing to drive the price down now aftermarket in attempt to create further panic so that people sell tomorrow. This is exactly what they want. DO NOT FALL FOR IT!!!\n\nHERE IS THE IMPORTANT PART;\n\nNo matter what people say, what you hear in the media or any other form of bullshit distraction...\n\nTHEY CANNOT CLOSE THEIR POSITIONS UNLESS WE SELL. Simple as that. It’s mathematics. The short float is more than the physical amount of existing shares. Bottom line.\n\nThey can’t get out of this without buying the shares back. And who controls the price at which the buy back? WE DO!\n\nEveryone just take a step back, chill out, block out the noise and absolutely 100% hold every bit of stock you own.\n\nWe are winning here. It really is that simple. If everyone can stay cool and follow this advice, we got this.\n\nPlease upvote, share etc. Don’t care about karma or anything this is far more important. The message needs to be spread so that we can do what’s necessary and finally get ours. We’ve spent too long being oppressed by this corrupt system. It’s time for change.\n\nGME &amp; AMC are the main focus. Anything else is a distraction.\n\nLETS DO THIS!!! 💎🤲🏻💎🤲🏻💎🤲🏻",
        "created_utc": 1612219939,
        "id": "glntrp6",
        "score": 2159,
        "subreddit": "wallstreetbets",
        "created": 1612248739.0
    },
    {
        "author": "kisssmysaas",
        "body": "I cant short GME because it keeps saying theres no share available",
        "created_utc": 1612225184,
        "id": "glo5gtd",
        "score": 2137,
        "subreddit": "wallstreetbets",
        "created": 1612253984.0
    },
    {
        "author": "waslookoutforchris",
        "body": "Silver is fake news.  It's the most manipulated commodity on earth and JP Morgan is completely in control of the silver market.  They regularly turn it over to make a quick profit.  Only a sucker who doesn't know this will buy silver.\n\nIT'S A TRAP!  BUY GME, HOLD GME, LUV GME.",
        "created_utc": 1612170204,
        "id": "glkw3rh",
        "score": 2031,
        "subreddit": "wallstreetbets",
        "created": 1612199004.0
    },
    {
        "author": "BossMcHogg",
        "body": "People think “oh I missed GME let me get in on this next one early” but it is oh so wrong thinking.  There is no “next one” like this GME.  We are talking about an event that will undoubtedly lead to industry reform.  This is a perfect storm.",
        "created_utc": 1612187306,
        "id": "gllipp0",
        "score": 2019,
        "subreddit": "wallstreetbets",
        "created": 1612216106.0
    },
    {
        "author": "bomberman1998",
        "body": "Ask yourself right now what you want to do. Your choice is either:\n\n1) Sell at a loss and lose 50% forever, have horrible dreams that you lost your ticket for a better life\n\n2) Not sell and get on the rocket to escaping your miserable life\n\nThis is a social game right now. They are trying so hard to mindfuck you and tap into your self preservation instincts. Why are they trying so hard? Because they know they can win because they know deep down you are a big pussy and these numbers scare you. All you have to do to not fuck this up is hold. They have money and experience on their side. You have math and cold hard facts about the inescapable position they put themselves into. Just fuckin hold!! Once this rocket takes off then you'll feel way worse if you sell now then how you will feel once it 10x's!\nGME=🚀\n💎🤲 kills the 🌈🐻",
        "created_utc": 1612224426,
        "id": "glo3v41",
        "score": 1914,
        "subreddit": "wallstreetbets",
        "created": 1612253226.0
    },
    {
        "author": "MrMindwaves",
        "body": "\"One of the biggest mistakes people generally make, and I’m guilty of it  too, is wishful thinking. You know, like you want something to be true,  even if it isn’t true. You ignore the real truth, because of what you  want to be true \"\n\n\\-Elon musk.  \n\n\nQuite ironic, really.",
        "created_utc": 1612188337,
        "id": "gllkr7t",
        "score": 1904,
        "subreddit": "investing",
        "created": 1612217137.0
    },
    {
        "author": "Jaamies97",
        "body": "I even can't 😓 my broker has a IQ test (6 yes or no  questions about trading) and I cant pass it. After that I could trade options and materials.",
        "created_utc": 1612190884,
        "id": "gllqjtd",
        "score": 1857,
        "subreddit": "wallstreetbets",
        "created": 1612219684.0
    },
    {
        "author": "TeamDisrespect",
        "body": "Not betting on it as much as taking out an insurance policy just in case it does.",
        "created_utc": 1612221914,
        "id": "glnyckz",
        "score": 1827,
        "subreddit": "wallstreetbets",
        "created": 1612250714.0
    },
    {
        "author": "zero_rc",
        "body": "The price of a share is determined by what the last share sold for. \n\nWe are not selling any shares, it is just the hedge funds running algorithms that continue to sell small quantities at a slightly lower price each time back and fourth.\n\nThe low volume supports the above statements. It's just the hedge funds manipulating the market. It has been ongoing since I jumped on this train last week. They are trying to play the waiting game in the hopes of saving some $$$\n\nIt's not going well for them as literally no one is selling. Short selling is no longer offered on many platforms from what is being reported. \n\nConclusion?\n\nHOLD GME\n\n\\*Not investment advice",
        "created_utc": 1612210106,
        "id": "gln51tv",
        "score": 1821,
        "subreddit": "wallstreetbets",
        "created": 1612238906.0
    },
    {
        "author": "r-nck-51",
        "body": "That was pretty rude. Do it again.",
        "created_utc": 1612194737,
        "id": "glm12z2",
        "score": 1800,
        "subreddit": "wallstreetbets",
        "created": 1612223537.0
    },
    {
        "author": "Longjumping_College",
        "body": "Literally wsb was talking about $GME and $BB as in BlackBerry and he kept for days spamming $BBBY on his show and social media. \n\nHe probably made a shit ton on that one as no one here was holding that stock. (Well... a few probably fell for it)",
        "created_utc": 1612183159,
        "id": "gllbruv",
        "score": 1714,
        "subreddit": "wallstreetbets",
        "created": 1612211959.0
    },
    {
        "author": "seven11evan",
        "body": "I’m gonna have to take your word for it.  Have a hard enough time with english",
        "created_utc": 1612207113,
        "id": "glmxfae",
        "score": 1706,
        "subreddit": "wallstreetbets",
        "created": 1612235913.0
    },
    {
        "author": "kautica0",
        "body": "Fake news is colluding with hedge funds to use WSB’s name to take out WSB retail investors by hyping fake silver squeeze. Pass it on.",
        "created_utc": 1612195888,
        "id": "glm45ou",
        "score": 1681,
        "subreddit": "wallstreetbets",
        "created": 1612224688.0
    },
    {
        "author": "HephaestionsThighs",
        "body": "I attempted to open a short position to see what response id get on fidelity. the result: \n \"your order to sell short can not be accepted. The security is either ineligble to short, there are currently no shares to short, or there are insufficient shares available to meet your request (impossible it was literally 1 lmao)\"",
        "created_utc": 1612207661,
        "id": "glmyu16",
        "score": 1676,
        "subreddit": "wallstreetbets",
        "created": 1612236461.0
    },
    {
        "author": "ThaddeusJP",
        "body": "If someone has no problem dumping 1m into this they can afford to lose it",
        "created_utc": 1612201527,
        "id": "glmioyv",
        "score": 1663,
        "subreddit": "wallstreetbets",
        "created": 1612230327.0
    },
    {
        "author": "burninmedia",
        "body": "Amc has more volume today then GME. The bottom vertical lines are trade volume for that time. Look back at earlier in the week and see how high they are. Volume today looks like early December, when no one was trading GME. This is great because it means our hold is working otherwise there would be more volume indicating the is lots of selling and buying. Which were not selling! GME 💎✋🚀🚀🚀🚀🚀",
        "created_utc": 1612204037,
        "id": "glmp9mf",
        "score": 1620,
        "subreddit": "wallstreetbets",
        "created": 1612232837.0
    },
    {
        "author": "Comprehensive-Ad7423",
        "body": "So, let’s just rewind a few days. \n\nThursday, they executed a ladder attack, trading large stock holdings between themselves, gradually lowering the offering each time. What did this do? Trick the market algorithms into thinking there was a mass sell off! Was there really? Fuck no. Did we sell? Fuck no! Did we hold? Fuck yes! 💎🤲🏻💎🤲🏻\n\nIn the hours following their futile attempt of BLATANT ILLEGAL MARKET MANIPULATION, the stock rose again to +300, an honest representation of the situation, because none of us retards sold!!!\n\nThe corrupts at wall street have had the entire weekend to think of a strategy to keep us at bay. Trying to create hype about silver to distract us, using their media contacts to distort the narrative, scaremongering... has it worked? Fuck no!\n\nWhat they are now doing is using a reduced form of laddering to keep the main stocks at bay. In other words they will continue to trade between themselves at a level that will keep the stock stagnant. This will be a futile attempt to deceive us that the game is up (excuse the pun) and that the squeeze is over.\n\nPeople, the squeeze is just getting started! It has barley begun!\n\nThey will do EVERYTHING in their power to come out on top. The amount of blatant illegal acts they committed last week proves this. There are literally no rules they will not break on their quest to cause panic and ultimately get us retards to sell our stock.\n\nThey are continuing to drive the price down now aftermarket in attempt to create further panic so that people sell tomorrow. This is exactly what they want. DO NOT FALL FOR IT!!!\n\nHERE IS THE IMPORTANT PART;\n\nNo matter what people say, what you hear in the media or any other form of bullshit distraction...\n\nTHEY CANNOT CLOSE THEIR POSITIONS UNLESS WE SELL. Simple as that. It’s mathematics. The short float is more than the physical amount of existing shares. Bottom line.\n\nThey can’t get out of this without buying the shares back. And who controls the price at which the buy back? WE DO!\n\nEveryone just take a step back, chill out, block out the noise and absolutely 100% hold every bit of stock you own. We are winning here. It really is that simple.\n\nIf everyone can stay cool and follow this advice, we got this.\n\nPlease upvote, share etc. Don’t care about karma or anything this is far more important. The message needs to be spread so that we can do what’s necessary and finally get ours. We’ve spent too long being oppressed by this corrupt system. It’s time for change.\n\nGME &amp; AMC are the main focus. Anything else is a distraction.\n\nLETS DO THIS!!! 💎🤲🏻💎🤲🏻💎🤲🏻",
        "created_utc": 1612218815,
        "id": "glnr2nt",
        "score": 1496,
        "subreddit": "wallstreetbets",
        "created": 1612247615.0
    },
    {
        "author": "tdvx",
        "body": "There’s 1.25T worth of silver lmao it can’t be fucking squeezed let alone by retail.",
        "created_utc": 1612176553,
        "id": "gll39k2",
        "score": 1491,
        "subreddit": "wallstreetbets",
        "created": 1612205353.0
    },
    {
        "author": "MixSaffron",
        "body": "Here it is in Brail to help!\n\n⠠⠃⠥⠽ ⠞⠓⠑ ⠙⠊⠏ ⠁⠝⠙ ⠓⠕⠇⠙",
        "created_utc": 1612220152,
        "id": "glnu9tm",
        "score": 1462,
        "subreddit": "wallstreetbets",
        "created": 1612248952.0
    },
    {
        "author": "FixingandDrinking",
        "body": "Premarket makes it look like we are on a sinking ship they don't know we all have rockets up our ass prepare for lift off.",
        "created_utc": 1612188637,
        "id": "gllld9m",
        "score": 1454,
        "subreddit": "wallstreetbets",
        "created": 1612217437.0
    },
    {
        "author": "Solomon_Grungy",
        "body": "Imagine putting every single person that inspires hope for this generation on a single rocket and watching it explode! That's so fucking on brand for 2021.",
        "created_utc": 1612216871,
        "id": "glnmevg",
        "score": 1435,
        "subreddit": "wallstreetbets",
        "created": 1612245671.0
    },
    {
        "author": "SeorgeGoros",
        "body": "\"They did it to protect their customer\"",
        "created_utc": 1612213525,
        "id": "glne1yi",
        "score": 1434,
        "subreddit": "wallstreetbets",
        "created": 1612242325.0
    },
    {
        "author": "PM_ME_YOUR_LITCOIN",
        "body": "I know this is wsb but surprised how hard it is to find some logic in this sub nowadays",
        "created_utc": 1612228103,
        "id": "globmjs",
        "score": 1429,
        "subreddit": "wallstreetbets",
        "created": 1612256903.0
    },
    {
        "author": "RollTide16-18",
        "body": "This might be a new tactic by the suits. Disguise any kind of hysteria as being caused by Reddit. Could see them doing it in the future.",
        "created_utc": 1612210849,
        "id": "gln6ylb",
        "score": 1424,
        "subreddit": "wallstreetbets",
        "created": 1612239649.0
    },
    {
        "author": "spoobydoo",
        "body": "The fake stories about Redditors piling into silver appeared across every major outlet last night *at the same* time, right at futures open.\n\nTo anyone who bothered to come here and see what we were talking about it is a clear media attempt at manipulation. Except they aren't trying to manipulate us, we know they are clearly lying - they are trying to manipulate *other* retail traders and the lazy professionals who rely on pundit opinions for their trading tips.",
        "created_utc": 1612184112,
        "id": "glld8bz",
        "score": 1404,
        "subreddit": "wallstreetbets",
        "created": 1612212912.0
    },
    {
        "author": "JosephCrawley",
        "body": "All this is doing, is causing us who couldn't afford it at peak, to be able to buy in the dip...",
        "created_utc": 1612210807,
        "id": "gln6un0",
        "score": 1395,
        "subreddit": "wallstreetbets",
        "created": 1612239607.0
    },
    {
        "author": "MIA4real",
        "body": "DFV is a true stubborn masshole\n\nIt brings tears to my droopy eye",
        "created_utc": 1612214781,
        "id": "glnhb2s",
        "score": 1382,
        "subreddit": "wallstreetbets",
        "created": 1612243581.0
    },
    {
        "author": "WonderingWhyToo",
        "body": "Yup. I have an order for GME @220 on TD and it dipped to 216-217 for a while and my order was never filled. It’s probably because there are no real sellers only the hedge funds playing their game buying selling back and forth.",
        "created_utc": 1612213289,
        "id": "glndfnr",
        "score": 1377,
        "subreddit": "wallstreetbets",
        "created": 1612242089.0
    },
    {
        "author": "jadeskye7",
        "body": "If you bought today you got it on discount.",
        "created_utc": 1612210437,
        "id": "gln5wd4",
        "score": 1315,
        "subreddit": "wallstreetbets",
        "created": 1612239237.0
    },
    {
        "author": "Bombom124",
        "body": "I’ve lost over half my portfolio that it took years to save for in just a few days. But guess fucking what. IM NOT FUCKING LEAVING ITS MOON OR DEATH!! I’ve chosen my path and won’t fold no matter what 💎🙌🚀🚀🚀🚀🚀",
        "created_utc": 1612196475,
        "id": "glm5p2f",
        "score": 1308,
        "subreddit": "wallstreetbets",
        "created": 1612225275.0
    },
    {
        "author": "Singular-cat-lady",
        "body": "Those fearmongering articles give me so much strength to hold even longer. If me buying and holding shares of flipping GAMESTOP is enough to turn the whole market upside-down, what the fuck was keeping it together until now??\n\nWe know from experience that institutional investors won't \"take one for the team\" and miss profits to save the economy. Even IF this play could crash and burn the whole thing (spoiler: it won't) then by God am I going to do it because they've done it to us and they'll do it again. Turns out the only way to get sensible legislation passed is when the wrong people benefit from the system.",
        "created_utc": 1612201151,
        "id": "glmhpi1",
        "score": 1289,
        "subreddit": "wallstreetbets",
        "created": 1612229951.0
    },
    {
        "author": "SparksMKII",
        "body": "Doesn't matter as we're the target of a massive smear campaign any public figure speaking out in support will help in the fight we're in now even if they only say it to make themselves look good.",
        "created_utc": 1612209000,
        "id": "gln28kb",
        "score": 1280,
        "subreddit": "wallstreetbets",
        "created": 1612237800.0
    },
    {
        "author": "brbcripwalking",
        "body": "Different energy around here after this red day. New people are easily triggered.\n\nIt’s a part of trading you guys will get used to it.\n\nMost of us are team bull around here so we feel your pain.",
        "created_utc": 1612233109,
        "id": "glom48l",
        "score": 1236,
        "subreddit": "wallstreetbets",
        "created": 1612261909.0
    },
    {
        "author": "Waddlow",
        "body": "\"My question is, how did you humans evolve to have diamond hands? I myself have only these flesh hands covered in human skin. Also, I like silver, and not because it is the color of my entire body.\"",
        "created_utc": 1612223868,
        "id": "glo2nus",
        "score": 1231,
        "subreddit": "wallstreetbets",
        "created": 1612252668.0
    },
    {
        "author": "Skadi793",
        "body": "If Melvin had some kind of insurance on the position, or a corresponding hedge, it would NOT have needed a 2.4 billion dollar bailout from another firm",
        "created_utc": 1612190011,
        "id": "glloedx",
        "score": 1195,
        "subreddit": "investing",
        "created": 1612218811.0
    },
    {
        "author": "aron2295",
        "body": "They have to write a letter pinky promising not to do it again.",
        "created_utc": 1612220234,
        "id": "glnugx7",
        "score": 1178,
        "subreddit": "wallstreetbets",
        "created": 1612249034.0
    },
    {
        "author": "sxt173",
        "body": "I panicked a lot and bought 10 more shares. It would be easier if the hedgies just wired us cash instead of spending money to do a short ladder attack. We can all save ourselves some time but if they insist on spending cash so I can buy dips, ehhh I'm sure they are \"professional investors\".",
        "created_utc": 1612196484,
        "id": "glm5pwp",
        "score": 1156,
        "subreddit": "wallstreetbets",
        "created": 1612225284.0
    },
    {
        "author": "Everest03",
        "body": "Is it silly that I’m just really excited about owning shares? \n\nHi, I’m a shareholder, it just sounds fancy 😂",
        "created_utc": 1612223542,
        "id": "glo1xx0",
        "score": 1130,
        "subreddit": "wallstreetbets",
        "created": 1612252342.0
    },
    {
        "author": "Ryder1587",
        "body": "So is the theory that they are taking losses every time they sell it back to each other in order to drive the price down for their shorts they must cover ?",
        "created_utc": 1612230150,
        "id": "glofzls",
        "score": 1125,
        "subreddit": "wallstreetbets",
        "created": 1612258950.0
    },
    {
        "author": "Xenetine",
        "body": "(Super new to stocks; my game plan now is to hold/follow the group, and then learn about stocks on the side.)\n\nHow does volume affect the price/outcome?  \n\nThis is my thought process from reading other comments.  The low volume means that there's not at lot of shares actually being bought/sold/traded.  This hints to the hedge funds trying to make us think that the price is falling.  If the hedge funds are trying to scare us, then we hold because it means they're scared.  (Is that somewhat correct?)\n\nAnd if the price is this low, but the volume increases exponentially, is that when we start getting scared?",
        "created_utc": 1612206402,
        "id": "glmvkkx",
        "score": 1122,
        "subreddit": "wallstreetbets",
        "created": 1612235202.0
    },
    {
        "author": "RonEats",
        "body": "Well CNN is a known sellout:  \n\n\n[https://www.cnn.com/2021/01/31/investing/silver-price-squeeze-reddit-wallstreetbets/index.htm](https://www.cnn.com/2021/01/31/investing/silver-price-squeeze-reddit-wallstreetbets/index.html)\n\n&amp;#x200B;\n\n \"SLV will destroy the biggest banks, not just some little hedge funds,\" one WallStreetBets user wrote. \"\n\nSo who wrote it?",
        "created_utc": 1612187346,
        "id": "glliskk",
        "score": 1115,
        "subreddit": "wallstreetbets",
        "created": 1612216146.0
    },
    {
        "author": "eyoslz",
        "body": " *\"Look, if you had one shot, or one opportunity*  \n*To seize everything you ever wanted, in one moment*  \n*Would you capture it, or just let it slip? \"*\n\nI figured, this line would be the perfect start and is precisely describing the mindset we - *the people* \\- have for the upcoming war. War? Yes, the war on **The Establishment**. Let me explain...\n\nFor the very first time - in a real fuck\\*\\*\\* long time - i have some hope and faith for mankind.\n\nI´ll give you first some context to who am I :\n\nI´m a 30 year old dude from Germany, went to college, majored in economics, working a 9-5 Job in a bank and I´m really interested in economy and geopolitics. I speak english (sorry for all typos and mistakes in this post), german, russian and some spanish. Living just the normal life you know. I watch and read a ton of news from all over the world. From diffrent sorts of media, countries and perspectives, basically everything i can get my hands on. And let me tell you one thing, ***the world is ill.***\n\nThe coronavirus hit the world hard, everywhere and more or less homogeneous. Germany, USA, Europe, Russia, China, you name it. Every country is handling the problem on its own. And besides China, with their guerilla tactics on the virus and mass surveillance with big brother, the majority of the countries are doing pretty fuc\\*\\*\\* bad at it. Bascially every single country in the world is fighting the virus in expense of us humans. They restrict every privat aspect in our lives, just to keep the economy running as long as possible. Bailing out huge privat companies with tax money, pumping trillions of fresh cash into a system which is already at the bottom with 0 intrest rates all over the world. Investing and promoting climate-killing activites. All of that, because **the economy** is ruling every single country. Not the elected parties or politicans, all of them are just on the payroll of big corporations. They (big corp) set the Laws and rules which we all have to obey. It does not fuck\\*\\*\\* matter if you fight dems vs. reps, at the bottom, both parties are payed and controlled by big corp. Its the same in Germany, Russia, Spain and all over the world. Some are ruled by obvious corrupt dicators, some are better hidden with \"elected\" parties and representatives. At the end we - the people - are working and living exclusively for the purpose to serve the rich, wealthy, 1%.\n\nWe have to empower the people, showing them the mirror. We dont fight reps vs. dems. ; Black vs. white ; Immigrant vs. citizen ; you name it. We have to fight the 1%, the rich. They try everything to drive a wedge betweeen us the people. Making us hating each other, fighting each other. But GUYS were all on the same side. **Everyone of us 99%.**\n\nThe unequal distribution of wealth in the world is peaking never seen before in history. We all get pissed on our heads by our governments and they dont even have the decency to sell it as rain. People all over the place working in systemically relevant jobs earning the least money and having the greatest risk of all. All that while the Stockmarkets are skyrocketing and Billionairs and Millionairs are just getting richer and richer every. single. day. People struggeling making ends meet, living paycheck to paycheck, still recovering from 2008.\n\nAnd as this global pandemic is ongoing and finally uncovering who the government/big corps really cares about. People start to become awake of the situation. Schools are all over the place garbage, the Health system is stressed out, privatized and monetized for max profit. Riots taking place all over the world. Rioting against dicators, corrupt governments and mishandling the pandemic, everything in favor of big corp.\n\nI was devistated and felt powerless, knowing i couldnt change anything by myself in this fuc\\*\\*ed up rigged system.\n\nThat was until last week...\n\n# You crazy motherf**** autists.\n\nI do not exaggerate, when i say, - **this is History in the making** \\- All it takes are some brave, loyal, and stupid apes liking the Stock. Thats it. The financial system is on the merge of collapse and we´re witnissing a never seen before wealth transfer. This thing will change the market and the world for all future.\n\nI finally found a way to take action in the revolution we need. Simply liking $GME **🚀** and buying all the stocks I fuc\\*\\*\\* can **🚀** **🚀** . I already build a position last week and will buy more moday morning **💎🙌** . I yolo everything i have in, I dont even care. This is a once in a liftime opportunity for us to make a change in the rigged system. We cant live and work only for the rich an wealthy. Apes together strong!!!\n\nSo take your shot, seize the opportunity, dont let it slip and make the **GAME STOP**\n\n# #POWER TO THE PEOPLE\n\n# #EAT THE RICH\n\n \n\n# $GME I just love the Stock 🚀 🚀 🚀 🚀 🚀\n\n&amp;#x200B;\n\nThis is not financial advice or whatsoever, im just your everyday normal guy",
        "created_utc": 1612216429,
        "id": "glnlccj",
        "score": 1106,
        "subreddit": "wallstreetbets",
        "created": 1612245229.0
    },
    {
        "author": "roro1211",
        "body": "Popeyes 🐔 just tweeted⚡️⚡️⚡️ @AMCTheaters⚡️⚡️⚡️. Woohoo! Do NOT sell. Buy and hold. This is it. Teamwork and some help from the tendiessss 🍗 📈🔥🔥🔥🔥🔥",
        "created_utc": 1612198780,
        "id": "glmblvs",
        "score": 1099,
        "subreddit": "Wallstreetbetsnew",
        "created": 1612227580.0
    },
    {
        "author": "Tribalwaves",
        "body": "I dunno about this guy. \nIf this guy told me it was sunny outside I’d still check.  So, I dunno....",
        "created_utc": 1612182784,
        "id": "gllb7ua",
        "score": 1088,
        "subreddit": "Wallstreetbetsnew",
        "created": 1612211584.0
    },
    {
        "author": "jytusky",
        "body": "I think there are two purposes to this narrative. One is to distract and divert, the second is to profit off of the few that have no clue, leave them with bags, and place the blame on Redditors.\n\nThe finance sector is way ahead of us on framing the narrative. Thankfully more and more people are getting information elsewhere and will hopefully see through it.",
        "created_utc": 1612199879,
        "id": "glmeeyw",
        "score": 1077,
        "subreddit": "pennystocks",
        "created": 1612228679.0
    },
    {
        "author": "Anamimimi",
        "body": "they want it to go up, down afterwards, and free tendies they get from paperhands, because this is how they gonna pay our GME tendies",
        "created_utc": 1612182997,
        "id": "gllbj80",
        "score": 1074,
        "subreddit": "wallstreetbets",
        "created": 1612211797.0
    },
    {
        "author": "lokusai",
        "body": "Got it. Buying barley. I've heard it's the new gourd.",
        "created_utc": 1612185865,
        "id": "gllg2tw",
        "score": 1042,
        "subreddit": "wallstreetbets",
        "created": 1612214665.0
    },
    {
        "author": "Estrovia",
        "body": "🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕\n\n*THINK CRITICALLY*\n\nWHY SO MUCH FAKE NEWS ON SILVER? WHY ALL THE FUD FROM MAINSTREAM MEDIA? WHY SO MANY NEW ACCOUNTS SPREADING DISINFORMATION? \n\nTHIS IS NOT THE PLAY OF SOMEONE WHO IS WINNING. THIS IS THE\nPLAY OF SOMEONE DESPERATE WHO CANNOT WIN BY NORMAL MEANS!\n\nHOLD. THE. LINE. DON'T GET BORED. DON'T GET DISTRACTED. HOLD GME AND WATCH YOUR LIFE CHANGE. NO NEED TO CONSTANTLY CHECK. SHORT SQUEEZES TAKE DAYS. YOU WILL KNOW WHEN IT BEGINS.\n\n(I'm just a 🦍, don't take advice from me)\n\n💎🙏💎🙏💎🙏💎🙏💎🙏💎🙏💎🙏💎",
        "created_utc": 1612208924,
        "id": "gln21qd",
        "score": 1036,
        "subreddit": "wallstreetbets",
        "created": 1612237724.0
    },
    {
        "author": "CuteRadio",
        "body": "It IS stock market manipulation.",
        "created_utc": 1612193917,
        "id": "gllyut3",
        "score": 1032,
        "subreddit": "wallstreetbets",
        "created": 1612222717.0
    },
    {
        "author": "Limewire-",
        "body": "Honestly so much bs floating around in the media at the moment.\n\nNo-one is talking bout 'piling into silver' like CNBC said this morning. Only shills and bots spamming the sub.\n\nAlso last week they were saying that Reddit is jumping into American Airlines after it had a price surge...wtf...I haven't seen a single post or comment mentioning American Airlines on here at all and I've basically been sat on WSB all day every day for a week now.",
        "created_utc": 1612180183,
        "id": "gll7onb",
        "score": 1028,
        "subreddit": "wallstreetbets",
        "created": 1612208983.0
    },
    {
        "author": "Piorz",
        "body": "FOR THE NEWBIES. This could easily be a hedge, don’t just assume that call buying means it’s at risk. This can be the case yes but it could also be a smaller position hedging a bigger position.  \n\nMake up your own mind and don’t take captions for what they are",
        "created_utc": 1612220434,
        "id": "glnuxy8",
        "score": 1023,
        "subreddit": "wallstreetbets",
        "created": 1612249234.0
    },
    {
        "author": "thegamingbacklog",
        "body": "If they could they would have when it went to its lowest last week. They don't own enough stock to do it, we're all holding it or buying it when they try to ladder. As long as everyone keeps holding they cannot push the price down enough to get out of their hole, and each day the are stuck in it they bleed money, and at some point will have to buy their way out of the hole.",
        "created_utc": 1612208620,
        "id": "gln19wc",
        "score": 988,
        "subreddit": "wallstreetbets",
        "created": 1612237420.0
    },
    {
        "author": "TehOuchies",
        "body": "Or it may be over quicker than you think.\n\nNone of us know.\n\nBut what we do know. There will not be another GME. This was a historic event that had all the planets in the solar system align to somehow tilt it this direction. \n\nIt caused an evolution in playbooks. And that part is what is going to be a lasting effect.",
        "created_utc": 1612210238,
        "id": "gln5dux",
        "score": 957,
        "subreddit": "wallstreetbets",
        "created": 1612239038.0
    },
    {
        "author": "Retricide",
        "body": "I'm going to explain what volume and open interest are because it appears no one in this thread understands. Regarding the $800C's...\n\nThe open interest of 6,687 refers to the number of contracts that were OPEN prior to the start of the trading day. The open interest (OI) is updated once per day PRIOR to open; it is not updated again until premarket the following trading day. You also don't know if those are long or short calls - it's impossible to tell from OI alone. OI just tells you how many contracts are \"open,\" and you can sell a call to open - effectively shorting the underlying.\n\nThe volume for those $800C today was 16k. Volume includes all transactions that occurred this day i.e. sell to open, buy to open, sell to close, buy to close.  So 16k volume doesn't mean 16,000 contracts were open. It could mean 7k contracts were bought to open + 7k were sold to close (could've been opened/closed the same day) + 2k were sold to open. In that example, the volume is 16k even though the net effect was selling to open 2k contracts.\n\nSo how do you interpret the volume? You compare OI on consecutive days.\n\nTomorrow morning the OI will update to reflect the total number of open contracts, so the previous 6.6k may go up OR down depending if net contracts were open or closed. If we use that above example of net 2k contracts sold to open -&gt; tomorrow's OI would be 6.6k + 2k = 8.6k. So you can't look at that 8.6k and say \"That must mean there are 8,600 long calls\" because we just explained that we know 2,000 are short calls...and we have no idea about the other 6,600.\n\nStill, even after looking at how OI changes, it's impossible to say if those are buys or sells without looking at the order book/flow. For example, if the OI goes up by 2k those could be 2k long calls, 2k short calls, or some combination.\n\nThe call flow OP posted probably indicates OTM call buying because it's at the ask price (\"the \\_A\" indicates that), but in that same screenshot he posted there was some large ATM put buying. In this screenshot you could say there were 2k calls bought vs. 1.2k puts, but you have to remember the puts are much closer to the money so they will have a much greater effect on how MM's hedge.\n\nThere's been a lot of misinformation here recently, so hopefully this explains what vol/OI mean.",
        "created_utc": 1612228935,
        "id": "glodeio",
        "score": 949,
        "subreddit": "wallstreetbets",
        "created": 1612257735.0
    },
    {
        "author": "Kreval",
        "body": "After the tendy man comes and brings tasty treats to the good reddit girls and boys, let's crowd fund buying his old building. We can hang a pirate flag off the front of it and race segways around the empty offices and floors",
        "created_utc": 1612178658,
        "id": "gll5rd1",
        "score": 939,
        "subreddit": "wallstreetbets",
        "created": 1612207458.0
    },
    {
        "author": "nariz_choken",
        "body": "I got enough shares for it to be life changing money if it goes to the moon, and not enough money invested to worry much either so 🤷 I will continue holding",
        "created_utc": 1612220968,
        "id": "glnw6ux",
        "score": 938,
        "subreddit": "wallstreetbets",
        "created": 1612249768.0
    },
    {
        "author": "Thorfax117",
        "body": " Ima keep reposting this because it needs to be seen\n\n**EXPLANATION FOR WORRIED NEWBIE TRADERS 👇🏻**\n\n&gt;*”The volume is low”*.\n\nWhat does this mean? The total volume of shares being moved around is LOW. The dips you are seeing are artificial and are NOT due to people selling shares. It’s illegal market manipulation at its finest.\n\nHedge funders sell their shares to each other at lower and lower bids (by tiny amounts) in rapid succession using bots. This tricks the algorithm into thinking a shit ton of shares are being dumped = the price is shown to go down.\n\nIn reality, no one is selling. Hedge funders are just moving shares between each other. If people were actually selling, you’d need at least 10x the volume to bring the price down like that.\n\nSo, stop panicking pussies. They’ve been doing this all week. Stop staring at your screen and watching every dollar movement. Go for a walk without a phone, have a shower, damn have breakfast if you haven’t already. Share this info to other newbie traders\n\nInfo of volume can be see in level 2 market data, found free on this stream:[https://www.youtube.com/watch?v=EQbg\\_WU-0AQ&amp;ab\\_channel=StocksBigPlays](https://www.youtube.com/watch?v=EQbg_WU-0AQ&amp;ab_channel=StocksBigPlays)\n\n**WHAT'S TO STOP THEM FROM DOING THIS FOREVER?**\n\nWell, unlike us retarded diamond handed monkeys, everyone with a short position has to pay daily interest on their positions to their broker. The longer they wait the more they have to pay to stay in the game. This is a war of attrition, but one side (us) does not have a financial penalty for staying on the battlefield, the other side (those with short positions) do.",
        "created_utc": 1612206673,
        "id": "glmw9ya",
        "score": 934,
        "subreddit": "wallstreetbets",
        "created": 1612235473.0
    },
    {
        "author": "ummwut",
        "body": "I'm holding to $69,420 and then selling ONE of my GME shares. They want the rest? They'll have to bleed for it.\n\nThis is not financial advice; it is unprofessional opinion.",
        "created_utc": 1612188355,
        "id": "gllksi5",
        "score": 917,
        "subreddit": "wallstreetbets",
        "created": 1612217155.0
    },
    {
        "author": "EasternBearPower",
        "body": "Regarding Silver:\n\nThis might be a false flag operation.\n\nStep 1: Swarm the place with bots.\n\nStep 2: Start shilling and create conversation.\n\nStep 3: The media picks-up and \"blames\" the \"Reddit Army\".\n\nWe are not an army, this is a public forum, everyone says and does whatever it likes.\n\nThere is no leader, no group, no common goal besides becoming our wives boyfriend.\n\nSuck a gourd.",
        "created_utc": 1612178707,
        "id": "gll5tlv",
        "score": 909,
        "subreddit": "wallstreetbets",
        "created": 1612207507.0
    },
    {
        "author": "Baelthor_Septus",
        "body": "If someone pressed the wrong number on the keyboard he will be really fucking pissed. \n\nI really hope whoever it is has info we don't.",
        "created_utc": 1612220025,
        "id": "glntz2s",
        "score": 903,
        "subreddit": "wallstreetbets",
        "created": 1612248825.0
    },
    {
        "author": "Churn",
        "body": "Same.  I spent a couple hours on wsb Wednesday evening and then when I got up Thursday morning.  Then went to a coffee shop where they had msnbc on a tv, they were interviewing the co-founder of Reddit and giving him credit for what he unleashed on wallstreet.  So there’s this man in his sixties with his phone out looking at a stock graph while he’s watching the tv.  I mention that it’s odd they are asking the reddit founder what’s next for wsb.   The guy looks at me and smiles, says, “well now they are moving to silver.”  \n\nI was like, wait, what?  I hadn’t seen even a blip about silver.  I didn’t say anything because maybe I missed it.  So a couple hours later, I’m back on wsb and no... it’s all GME, AMC, BB, NOK.  Nothing about silver.  But then by the next day... silver silver silver..\n\nIt really seemed like the attempt to manipulate wsb into silver got traction outside of wsb first where they believe anything the MM says.  Back here in the actual wsb, the attempted posts about silver were getting downvotes.  \n\nIs it a mystery that we have millions of new subscribers?  They needed to be able to upvote their own narrative here.  So now there’s five times as many bots and sock puppets as real wsb subscribers.",
        "created_utc": 1612173180,
        "id": "glkzglx",
        "score": 900,
        "subreddit": "wallstreetbets",
        "created": 1612201980.0
    },
    {
        "author": "MrNiemand",
        "body": "Yep, because it works. My dad is a pretty intelligent guy running his own business, I told him I bought some GME stock, he told me I should have bought silver instead because that's what reddit is short squeezing right now...\n\nHe got this from random ass local news in my tiny shitty EU country. I even sent him the home page for WSB yesterday - he didn't check. He just read the news that the media served.",
        "created_utc": 1612199670,
        "id": "glmdvwb",
        "score": 897,
        "subreddit": "wallstreetbets",
        "created": 1612228470.0
    },
    {
        "author": "OPXur",
        "body": "How much hedge funds paying these media sites? Why isn't it criminal to report fake news yet?",
        "created_utc": 1612201559,
        "id": "glmirtt",
        "score": 892,
        "subreddit": "wallstreetbets",
        "created": 1612230359.0
    },
    {
        "author": "Secure-Ad1612",
        "body": "I feel as though at this point, the silver campaign wasn’t intended to trick WSB into buying; it was intended to trick the general public (FOMO).\n\nIt looks as diverting attention is only a side effect, where as the main motive is raising funds in order to pay for the naked calls which they’ll need to buyback by tomorrow’s close.\n\nNot financial advice; purely speculation.",
        "created_utc": 1612210721,
        "id": "gln6mpc",
        "score": 868,
        "subreddit": "wallstreetbets",
        "created": 1612239521.0
    },
    {
        "author": "LargeSackOfNuts",
        "body": "Everything else is a distraction tactic.\n\nShort-ladders? Not falling for it.\n\nSilver? Heck no.\n\nReddit got bored of GME? Nope.",
        "created_utc": 1612223096,
        "id": "glo0yoy",
        "score": 867,
        "subreddit": "wallstreetbets",
        "created": 1612251896.0
    },
    {
        "author": "mayhap11",
        "body": "If it works...",
        "created_utc": 1612230839,
        "id": "glohfb4",
        "score": 859,
        "subreddit": "wallstreetbets",
        "created": 1612259639.0
    },
    {
        "author": "Greebo427",
        "body": "You want to know how long it will take?\n\nWithin the next 18 days 30,000,000 shorted GME shares need to be covered (bought) by the hedgies - see link below.\n\nAt today’s price of approx $300 per share- that’s $9 Billion + the premium being paid for having the position.\n\nHow long does the line need to be held? 18 days \n\nhttps://www.barchart.com/stocks/quotes/GME/options\n\n\nThis is not financial advice, do your own research.",
        "created_utc": 1612210569,
        "id": "gln68h1",
        "score": 851,
        "subreddit": "wallstreetbets",
        "created": 1612239369.0
    }
]