[
    {
        "author": "Theta_kang",
        "body": "True, true, but it also makes it rain confetti when I complete trades.",
        "created_utc": 1628096142,
        "id": "h7p4cfi",
        "permalink": "/r/wallstreetbets/comments/oxwuiw/it_absolutely_blows_my_mind_that_so_many_people/h7p4cfi/",
        "score": 2017,
        "subreddit": "wallstreetbets",
        "created": 1628124942.0
    },
    {
        "author": "hom6872",
        "body": "Not disagreeing with this at all.  Just letting you know that people have been preaching this for months and it just goes in one ear and out the other for most.",
        "created_utc": 1628029155,
        "id": "h7lvhsu",
        "permalink": "/r/stocks/comments/oxebmu/you_dont_own_chinese_company_stocks_when_you_buy/h7lvhsu/",
        "score": 619,
        "subreddit": "stocks",
        "created": 1628057955.0
    },
    {
        "author": "PayMe2Shill4U",
        "body": "Not going to double check, not going to doubt, if it sounds too good to be true then I AM IN BABY",
        "created_utc": 1628171313,
        "id": "h7szl6o",
        "permalink": "/r/wallstreetbets/comments/oyhsyz/mcafees_dividend_will_make_us_rich/h7szl6o/",
        "score": 568,
        "subreddit": "wallstreetbets",
        "created": 1628200113.0
    },
    {
        "author": "SoBrandnu2021",
        "body": "It wasnt just robinhood. They took the brunt of it, but T.O.S, WEEBULL, and CMEG all restricted buying and created restricted lists. So to blame RH only is to understate the problem. This was the whole system. I believe ETrade also had restrictions.  I dont have an account with them",
        "created_utc": 1628099684,
        "id": "h7pd250",
        "permalink": "/r/wallstreetbets/comments/oxwuiw/it_absolutely_blows_my_mind_that_so_many_people/h7pd250/",
        "score": 392,
        "subreddit": "wallstreetbets",
        "created": 1628128484.0
    },
    {
        "author": "SamQuentin",
        "body": "I don’t understand the appeal of this company.  It seems like even $30 is a generous valuation.  IMHO.",
        "created_utc": 1628088270,
        "id": "h7olcm8",
        "permalink": "/r/stocks/comments/oxt5xo/robinhoods_stock_is_spiking_but_this_is_the_time/h7olcm8/",
        "score": 367,
        "subreddit": "stocks",
        "created": 1628117070.0
    },
    {
        "author": "rooterRoter",
        "body": "Honestly, I’d index it until I knew wtf I was doing. \n\nOptions are an amazing, powerful, but potentially dangerous tool. \n\nYou could become fabulously wealthy with a ton of fuck you money, or you could go broke. \n\nGuess which is more likely, especially if you don’t know what you are doing?",
        "created_utc": 1628037552,
        "id": "h7md1bb",
        "permalink": "/r/options/comments/oxgwzr/parents_gave_me_125000_was_going_to_index_it_but/h7md1bb/",
        "score": 349,
        "subreddit": "options",
        "created": 1628066352.0
    },
    {
        "author": "LongComparison",
        "body": "Phew I got in at 38 and sold at 65 after it hit 80. It was really hard to do that once it hit 80. It felt like I was losing money to hit the sell button, but in reality I made a great profit and locked it in. I still have a ton to learn. It shouldn't have been that hard. If it was in the 90s right now I probably wouldn't even be having these thoughts, which is scary in itself.\n\nI guess this is why it's important to have an exit strategy and execute it? Just thinking out loud.",
        "created_utc": 1628088376,
        "id": "h7ollek",
        "permalink": "/r/wallstreetbets/comments/oxt0mq/hood_yolo_update/h7ollek/",
        "score": 277,
        "subreddit": "wallstreetbets",
        "created": 1628117176.0
    },
    {
        "author": "zjz",
        "body": "Y'know, I have no particular love for RH, but every broker I've ever been on has been a piece of shit at one time or another.\n\nOptionsHouse used to just go down for no reason.\n\nOne time with TDAmeritrade some connection to the NYSE went down, but only one way, so I submitted an order for S&amp;P eminis like 4 times in a row and it *appeared* nothing went through. Nope, it went through. Four times. TDAmeritrade couldn't even figure out what my position was, let alone close it. It took like a fucking hour for me to be able to close this position of unknown size.\n\nI traded with the ninjatrader brokerage (whichever it was, phillip capital?) and their shit would crash too. Sometimes the data would get wonky and update slow during real shit.\n\nEDIT: the real trick is to have 2-3 brokerages you like and be able to use the other when one commits die",
        "created_utc": 1628096153,
        "id": "h7p4dff",
        "permalink": "/r/wallstreetbets/comments/oxwuiw/it_absolutely_blows_my_mind_that_so_many_people/h7p4dff/",
        "score": 269,
        "subreddit": "wallstreetbets",
        "created": 1628124953.0
    },
    {
        "author": "banditcleaner2",
        "body": "I was thinking how funny would it be if all the people that actually got in and made profits on HOOD and got out just immediately put that money into GME and AMC",
        "created_utc": 1628168192,
        "id": "h7st6m0",
        "permalink": "/r/wallstreetbets/comments/oyfbho/robinhood_shares_fall_as_stockholders_file_to/h7st6m0/",
        "score": 256,
        "subreddit": "wallstreetbets",
        "created": 1628196992.0
    },
    {
        "author": "Tymon123",
        "body": "On this sub maybe but outside this tiny echo chamber no-one gives a fuck. All my friends love Robinhood and are clueless when I ask why they are still using it.",
        "created_utc": 1628098171,
        "id": "h7p9ckd",
        "permalink": "/r/wallstreetbets/comments/oxwuiw/it_absolutely_blows_my_mind_that_so_many_people/h7p9ckd/",
        "score": 251,
        "subreddit": "wallstreetbets",
        "created": 1628126971.0
    },
    {
        "author": "APComet",
        "body": "Turn it upside down 😎",
        "created_utc": 1628132256,
        "id": "h7rdfee",
        "permalink": "/r/wallstreetbets/comments/oy6neg/am_i_doing_this_the_right_way/h7rdfee/",
        "score": 242,
        "subreddit": "wallstreetbets",
        "created": 1628161056.0
    },
    {
        "author": "Uisce-beatha",
        "body": "I see it in my head movies and it ma...ma...ma makes my eyes rain",
        "created_utc": 1628099343,
        "id": "h7pc8cg",
        "permalink": "/r/wallstreetbets/comments/oxwuiw/it_absolutely_blows_my_mind_that_so_many_people/h7pc8cg/",
        "score": 224,
        "subreddit": "wallstreetbets",
        "created": 1628128143.0
    },
    {
        "author": "cowboys5xsbs",
        "body": "Clov is coming back any day now it just needed to get cigarettes",
        "created_utc": 1628035090,
        "id": "h7m812m",
        "permalink": "/r/wallstreetbets/comments/ox7tlc/kids_dont_be_like_me/h7m812m/",
        "score": 223,
        "subreddit": "wallstreetbets",
        "created": 1628063890.0
    },
    {
        "author": "12hamsteaks",
        "body": "What is gold? Is it like a physical Bitcoin?",
        "created_utc": 1628084794,
        "id": "h7odlsb",
        "permalink": "/r/investing/comments/oxshiy/companies_are_capitalizing_on_the_ongoing_gold/h7odlsb/",
        "score": 220,
        "subreddit": "investing",
        "created": 1628113594.0
    },
    {
        "author": "JellyfishComplete370",
        "body": "Fuck it \n\nI made an oath to not buy or ever trade it after GME and AMC episode",
        "created_utc": 1628031122,
        "id": "h7lzqd6",
        "permalink": "/r/wallstreetbets/comments/oxecbe/are_we_all_secretly_holding_since_ipo_i_am/h7lzqd6/",
        "score": 174,
        "subreddit": "wallstreetbets",
        "created": 1628059922.0
    },
    {
        "author": "duplicatesnowflake",
        "body": "T.O.S. didn't allow people to trade it on margin because it was super volatile and would be a liability if it crashed.\n\nI was able to trade in and out of GME as much as I wanted with my own money.\n\nWas it cool? No. But well within their ethical right considering it was their own money at risk.\n\nNot even remotely the same situation as deactivating the buy button for a stock people were already holding in the midst of a squeeze.\n\nI can't really make a probable case that Robinhood colluded with Citadel. There certainly appeared to be a conflict of interest. The Clearinghouse raising requirements explanation does make sense.\n\nBut they were not properly funded for the level of risk they took on and had to know something like this could happen. Gross negligence at best.",
        "created_utc": 1628102640,
        "id": "h7pk46b",
        "permalink": "/r/wallstreetbets/comments/oxwuiw/it_absolutely_blows_my_mind_that_so_many_people/h7pk46b/",
        "score": 166,
        "subreddit": "wallstreetbets",
        "created": 1628131440.0
    },
    {
        "author": "Melodic_Ad_8747",
        "body": "If you have to ask, the answer is no.\n\nMaybe take 5 or 10k and try. And set rules for yourself, because chances are your first \"hit\" will be free (10 banger) and then youl dump the rest in, blow it all.\n\nI'm not trying to be a dick, but 125k is nothing to waste even if you come form money. Don't be stupid. Anyone successfully trading options consistently didn't let themselves get wiped out when they were new. Take your time, it's not going anywhere.",
        "created_utc": 1628037695,
        "id": "h7mdbpf",
        "permalink": "/r/options/comments/oxgwzr/parents_gave_me_125000_was_going_to_index_it_but/h7mdbpf/",
        "score": 164,
        "subreddit": "options",
        "created": 1628066495.0
    },
    {
        "author": "Stevenerf",
        "body": "Took me a month. Made big 5digit profits from OCGN. Sold it high at $17/share. Game changer for me. Gave me enough to start really playing and making far bigger position plays",
        "created_utc": 1628129708,
        "id": "h7r8fcf",
        "permalink": "/r/pennystocks/comments/oy7va9/how_long_were_you_trading_before_you_hit_you/h7r8fcf/",
        "score": 152,
        "subreddit": "pennystocks",
        "created": 1628158508.0
    },
    {
        "author": "Tacostain1",
        "body": "Where is the mention that while it was halted for volatility Robinhood had a message stating \"some stock exchanges, NOT ROBINHOOD, have temporarily halted trading of HOOD\" Such a blatant slap in the face to any January Ape",
        "created_utc": 1628087670,
        "id": "h7ojyq5",
        "permalink": "/r/wallstreetbets/comments/oxt0ah/robinhood_halted_for_volatility_after_surging_65/h7ojyq5/",
        "score": 139,
        "subreddit": "wallstreetbets",
        "created": 1628116470.0
    },
    {
        "author": "Juicy_Brucesky",
        "body": "You guys fucking said it would be 20 dollars last week\n\n\n\n\n\nSo now this week it's \"this HOOD bullrun  can't last much longer\"\n\n\n\n\n\n\n\n\n\nWhat does that mean for next week? Probably something like \"HOOD is currently valued at $200, but that's expected to drop SOON\"\n\n\n\n\n\n\n\n\n\nIs devaluing HOOD 2021's version of the covid bears? \"Guys cases are up again, deaths always lag behind, shit isn't just hitting the fan, it's spraying all over the room 8/20 SPY 100P , BUY FOR MUCHO TENDIES\"",
        "created_utc": 1628078844,
        "id": "h7o2faa",
        "permalink": "/r/wallstreetbets/comments/oxou2l/robinhood_will_eventually_tank/h7o2faa/",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1628107644.0
    },
    {
        "author": "Energetic504",
        "body": "MVST is actively working on solid-state battery tech. From a SEC filing: \n\n“We are actively working to build on our polyaramid knowledge to develop a solid electrolyte battery system that incorporates the polyaramid material as a component of the solid electrolyte. If the solid electrolyte approach is successful, not only will it eliminate the use of liquid electrolyte, but it will also potentially enable new anode chemistries such as Li metal, which is needed to reach cells with over 1000 Wh/L energy densities.”",
        "created_utc": 1628132414,
        "id": "h7rdqbb",
        "permalink": "/r/wallstreetbets/comments/oy8kd2/microvast_vs_quantumscape/h7rdqbb/",
        "score": 136,
        "subreddit": "wallstreetbets",
        "created": 1628161214.0
    },
    {
        "author": "Red_Meridian",
        "body": "That’s it guys, time to pack it up. GS called for any increase so they can sell their institutional shares to retail and then tank the SP 500. 15% correction incoming.",
        "created_utc": 1628171744,
        "id": "h7t0j5k",
        "permalink": "/r/investing/comments/oyg2nv/goldman_becomes_sp_500s_biggest_bull_after_a/h7t0j5k/",
        "score": 129,
        "subreddit": "investing",
        "created": 1628200544.0
    },
    {
        "author": "georgejetsonn",
        "body": "No. He sold about 4.5% of all stocks granted to him. They were sold as part of the IPO and it was specified in the S-1.\n\nThe one that appeared to be selling 100% was the CMO, but that's only because people are too lazy to read SEC filings and take their data from third party platforms. She actually sold about 10% of all the stocks granted to her that she converted to common stock, the rest are restricted stock units. All employees were allowed to sell up to 15% in the first day. \n\nAll this can be found in S-1, Form 3 and Form 4.",
        "created_utc": 1628170739,
        "id": "h7syd9e",
        "permalink": "/r/stocks/comments/oyfih9/robinhood_retreats_after_monster_rally_this_week/h7syd9e/",
        "score": 129,
        "subreddit": "stocks",
        "created": 1628199539.0
    },
    {
        "author": "Scarethefish",
        "body": "Whatever he thought, it definitely didnt go accordion to plan.",
        "created_utc": 1628087075,
        "id": "h7oilyb",
        "permalink": "/r/wallstreetbets/comments/oxqcpg/my_experience_trading_with_robinhood_this_past/h7oilyb/",
        "score": 125,
        "subreddit": "wallstreetbets",
        "created": 1628115875.0
    },
    {
        "author": "thisdude415",
        "body": "ADRs are where an American bank holds 1 foreign share and issues 1 share on an American exchange, denominated in American dollars, paying foreign taxes and making filings on your behalf, receiving foreign dividends in foreign currency and forwarding them to you in USD. \n\nThe “normal” ADR shares are fully backed by fully owned ordinary shares. The ADR exists to make it convenient, because the ADR Sponsor will open a brokerage account in Japan, UK, Germany, France, Singapore, etc, fill out the paperwork in Japanese, buy shares in JPY, make appropriate regulatory filings on your behalf. However, the **actual foreign share** is held **in America** by an **American bank**. ADR holders can still vote as if they were shareholders. It’s almost like the old days where $1 was backed by $1 of gold in a bank. \n\nChinese stocks are ADRs. But they aren’t backed by shares of the underlying security. They’re shares of a shell company called a VIE. VIE stands for variable interest entity. \n\nThe VIE is an ostensibly independent company that has negotiated **a contract** with a Chinese company for a share of ALL future profits. The VIE then sells shares **of itself** and these become listed in the USA as ADRs. Someone who owns an ADR of a VIE does not own a share of a Alibaba. They own a slice of a company in the Bahamas contractually “guaranteed” payments by Chinese companies. It’s more like an annuities contract to future profits, but written to break Chinese law. \n\nIt’s important to remember that the entire structure of VIEs was invented explicitly ~~break~~ *circumvent* Chinese laws prohibiting foreign ownership of Chinese companies. \n\nFinally… contracts are only as good as the legal systems that govern them. \n\nI have strong faith that neither American nor Japanese courts want to fuck up ADRs of Toyota. They may tinker at the margins, maybe with taxes or disclosure. But they won’t invalidate the structure leaving you with nothing.  \n\nI have approximately 0 faith that China’s courts will respect the legal structure of VIE ADRs when it becomes inconvenient for them. The linchpin of a VIE is just a contract governed by Chinese law, circumventing Chinese law, between a Chinese company and a barely nonfictional “company” in the Cayman Islands.\n\nEdit: note as well that many Hong Kong listings of mainland companies are also the VIE structure. Hong Kongers are not allowed to own Chinese A shares either.",
        "created_utc": 1628037084,
        "id": "h7mc3m3",
        "permalink": "/r/stocks/comments/oxebmu/you_dont_own_chinese_company_stocks_when_you_buy/h7mc3m3/",
        "score": 123,
        "subreddit": "stocks",
        "created": 1628065884.0
    },
    {
        "author": "Verix19",
        "body": "I've been out of any Chinese stocks for about 6 months now, too much can happen, most of it involves you losing all or part of your investment.",
        "created_utc": 1628029569,
        "id": "h7lwdyt",
        "permalink": "/r/stocks/comments/oxebmu/you_dont_own_chinese_company_stocks_when_you_buy/h7lwdyt/",
        "score": 123,
        "subreddit": "stocks",
        "created": 1628058369.0
    },
    {
        "author": "Artistic_Data7887",
        "body": "It all started when I was a boy in Bulgaria",
        "created_utc": 1628090045,
        "id": "h7opgsd",
        "permalink": "/r/stocks/comments/oxt5xo/robinhoods_stock_is_spiking_but_this_is_the_time/h7opgsd/",
        "score": 118,
        "subreddit": "stocks",
        "created": 1628118845.0
    },
    {
        "author": "Disboot",
        "body": "I'll go pick up my Tesla tomorrow if he'll pay for it.",
        "created_utc": 1628166955,
        "id": "h7sques",
        "permalink": "/r/wallstreetbets/comments/oygln5/biden_to_set_target_for_50_evs_by_2030_100b_in/h7sques/",
        "score": 116,
        "subreddit": "wallstreetbets",
        "created": 1628195755.0
    },
    {
        "author": "Ratchet_as_fuck",
        "body": "Hah if you look at my post history not too long ago I was deep into OSRS. Most of my time I sunk into that game but now I sink it into losing money and making memes!",
        "created_utc": 1628077366,
        "id": "h7o04yc",
        "permalink": "/r/wallstreetbets/comments/oxqcpg/my_experience_trading_with_robinhood_this_past/h7o04yc/",
        "score": 115,
        "subreddit": "wallstreetbets",
        "created": 1628106166.0
    },
    {
        "author": "CodyPomeray_",
        "body": "Got out today at 38 with like 60 shares. 10 mins after selling it was near 47. you welcome",
        "created_utc": 1628030976,
        "id": "h7lzf1u",
        "permalink": "/r/wallstreetbets/comments/oxecbe/are_we_all_secretly_holding_since_ipo_i_am/h7lzf1u/",
        "score": 107,
        "subreddit": "wallstreetbets",
        "created": 1628059776.0
    },
    {
        "author": "Terrigible",
        "body": "Yes. If you go onto the HKEX website, it says that Alibaba is incorporated in the Cayman Islands",
        "created_utc": 1628033662,
        "id": "h7m52s5",
        "permalink": "/r/stocks/comments/oxebmu/you_dont_own_chinese_company_stocks_when_you_buy/h7m52s5/",
        "score": 98,
        "subreddit": "stocks",
        "created": 1628062462.0
    },
    {
        "author": "dragonbenj",
        "body": "It sounds like you take profits constantly and there is nothing wrong with that.  I do the same thing with options I buy and then sell\nA few hours later with a 50% gain… might never get rich this way but def aren’t going to lose everything either.. I find it best after I exit a position for profit not to look at that stock again for a few days and move on to the next potential trades…",
        "created_utc": 1628165175,
        "id": "h7snstg",
        "permalink": "/r/wallstreetbets/comments/oyg1se/buy_and_sell_too_early/h7snstg/",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1628193975.0
    },
    {
        "author": "guthixguthix502",
        "body": "Great, can it hit 140 now? I got fd calls expiring next week.",
        "created_utc": 1628165706,
        "id": "h7sonyq",
        "permalink": "/r/wallstreetbets/comments/oyg6kr/when_amd_has_your_accounts_back/h7sonyq/",
        "score": 91,
        "subreddit": "wallstreetbets",
        "created": 1628194506.0
    },
    {
        "author": "WrathofKhaan",
        "body": "The mention of Microsoft as the 2017 customer was very bullish and leads me to believe either: \n\nA) Drew Markham/MVIS General Counsel and M&amp;A Ace reviewed the MSFT/MVIS Contract/NDA and determined they were within their rights to disclose the relationship publicly (which gives MVIS significantly greater negotiating leverage in discussing an acquisition of the Near-Eye Display (NED) AR vertical, which powers the Hololens 2). The announcement puts significantly more pressure on MSFT to acquire the NED vertical, especially considering the national security risks associated with this critical IP being vital to the $22B US Army IVAS contract. The Department of Defense has conducted a thorough review and I’m sure they have identified that Microsoft not owning the rights to the “Miracle *MicroVision* Display Engine” represents a national security threat. It would make sense for the DoD to put pressure on MSFT to acquire this IP to prevent it from falling into enemy hands.\n\nor\n\nB) Microsoft gave MicroVision the green light to announce the relationship because MSFT is about to announce acquiring the NED vertical.\n\nEither way it is BAFF (*Bullish as F#cking F#ck*).\n\nAlso, MVIS is positioning itself to be a global leader in automotive LiDAR with best-in-class tech in terms of resolution, specs, and scalability. The IAA Mobility Summit in Munich is coming up in September and MicroVision is hosting the DVN Automotive LiDAR Conference and Expo in Frankfurt in November. Soon the whole world will see we have best-in-class automotive LiDAR.\n\nPosition: 13,450 shares at $7.46 avg, will be adding more JAN23 $42 LEAPS tomorrow. \n\nThis is the way.",
        "created_utc": 1628135129,
        "id": "h7riry1",
        "permalink": "/r/wallstreetbets/comments/oy3u7a/mvis_er_call_mvis_product_on_hololense_2_confirmed/h7riry1/",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1628163929.0
    },
    {
        "author": "atp8776",
        "body": "Yes our goal is to be poor. You are doing it right 👍🏼",
        "created_utc": 1628138618,
        "id": "h7ror68",
        "permalink": "/r/wallstreetbets/comments/oy6neg/am_i_doing_this_the_right_way/h7ror68/",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1628167418.0
    },
    {
        "author": "MisterKrayzie",
        "body": "Lol exactly. I believe it's an IRA account too. \n\nSo from my understanding, he basically posts his dumbass \"yolo's\" on whatever stock. Posts it here. People see it and think they can pull the same shit. More people jump in and he bails out each time ASAP. What people don't get is a tiny percentage movement for him is fucking massive while your dingus account with 200 shares gaining 2% is worthless. \n\nHe'll exit his position entirely and jump on something else. Rinse repeat. You can check the dudes history and it's all there.",
        "created_utc": 1628135552,
        "id": "h7rjj85",
        "permalink": "/r/wallstreetbets/comments/oxvwwe/speed_run_strat_inverse_adam_jonas_threw_25m_into/h7rjj85/",
        "score": 84,
        "subreddit": "wallstreetbets",
        "created": 1628164352.0
    },
    {
        "author": "superhappykid",
        "body": "LMAO exactly what this guy said. Lost it at this comment hah.",
        "created_utc": 1628035754,
        "id": "h7m9e49",
        "permalink": "/r/wallstreetbets/comments/oxczrk/loss_porn_need_help_seriously/h7m9e49/",
        "score": 83,
        "subreddit": "wallstreetbets",
        "created": 1628064554.0
    },
    {
        "author": "Eccentricc",
        "body": "Everyone is a dumb ass in their own way. R/stocks and any other financial sub can act all 'professional' as they want but when it comes down to it, everyone is the same. Everyone is stupid no matter where you go.\n\nAt least *redacted* sub tries to bring everyone together. You can't even talk about certain things on r/stocks! There's a very large update happening RIGHT Now. *redacted * .... But no. r/stocks tries to censor them says *redacted * sub is the bad guys. Honestly if it's any *big players * trying to take advantage of retailers it's the mods here.\n\nIdk. *redacted *sub is full of stupid but at least it's not censored and you can have reasonable discussions with everyone",
        "created_utc": 1628167476,
        "id": "h7srt0g",
        "permalink": "/r/stocks/comments/oyfih9/robinhood_retreats_after_monster_rally_this_week/h7srt0g/",
        "score": 82,
        "subreddit": "stocks",
        "created": 1628196276.0
    },
    {
        "author": "mijiwa",
        "body": "And let SHF short it first",
        "created_utc": 1628167632,
        "id": "h7ss3f1",
        "permalink": "/r/wallstreetbets/comments/oyfbho/robinhood_shares_fall_as_stockholders_file_to/h7ss3f1/",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1628196432.0
    },
    {
        "author": "ace_thebroker",
        "body": "Fuck man. AMD has been killing it",
        "created_utc": 1628167474,
        "id": "h7srsvx",
        "permalink": "/r/wallstreetbets/comments/oyg6kr/when_amd_has_your_accounts_back/h7srsvx/",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1628196274.0
    },
    {
        "author": "vladedivac12",
        "body": "If you held, pretty much nothing happened. Of course your portfolio looked like shit like it did in March 2020 but only paper loss. Investment is a long term game, if you're in it for the short term you might get burned.",
        "created_utc": 1628083029,
        "id": "h7o9yak",
        "permalink": "/r/CanadianInvestor/comments/oxrhrb/if_you_knew_the_below_was_coming_what_would/h7o9yak/",
        "score": 75,
        "subreddit": "CanadianInvestor",
        "created": 1628111829.0
    },
    {
        "author": "WorkingtoLoseItAll",
        "body": "I like to look here before I check my account value. It prepares me",
        "created_utc": 1628168596,
        "id": "h7stzcg",
        "permalink": "/r/wallstreetbets/comments/oyeeib/daily_discussion_thread_for_august_05_2021/h7stzcg/",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1628197396.0
    },
    {
        "author": "haveYouLookedIntoIt",
        "body": "Wasn't it every company that uses apex as a clearing house?",
        "created_utc": 1628099040,
        "id": "h7pbhcz",
        "permalink": "/r/wallstreetbets/comments/oxwuiw/it_absolutely_blows_my_mind_that_so_many_people/h7pbhcz/",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1628127840.0
    },
    {
        "author": "MrHandyHands616",
        "body": "Excellent op. \n\nVery accurate too - it shows WSB collective net worth of $13mil and with 10.7mil users that’s $1.21 per person so checks out",
        "created_utc": 1628044334,
        "id": "h7mqtz1",
        "permalink": "/r/wallstreetbets/comments/oxgtpe/how_it_feels_when_ops_random_dd_was_actually/h7mqtz1/",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1628073134.0
    },
    {
        "author": "Peelboy",
        "body": "*I'll go pick up my Tesla tomorrow if we'll pay for it.",
        "created_utc": 1628169259,
        "id": "h7svazq",
        "permalink": "/r/wallstreetbets/comments/oygln5/biden_to_set_target_for_50_evs_by_2030_100b_in/h7svazq/",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1628198059.0
    },
    {
        "author": "Cooperjpugh",
        "body": "I jumped in after the arch drop. Severely undervalued. So surprised it’s still as low as it it",
        "created_utc": 1628165260,
        "id": "h7snxus",
        "permalink": "/r/wallstreetbets/comments/oyfyqg/viac_earnings_q2_key_results_show_high_streaming/h7snxus/",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1628194060.0
    },
    {
        "author": "Crime_Dawg",
        "body": "Actually the \"apes\" said to just stay the fuck away entirely.\n\nWhat the fuck would an account made 2 weeks ago even know about OG wsb and apes? God damn shills don't even try to hide it anymore.",
        "created_utc": 1628091483,
        "id": "h7osx63",
        "permalink": "/r/wallstreetbets/comments/oxt0ah/robinhood_halted_for_volatility_after_surging_65/h7osx63/",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1628120283.0
    },
    {
        "author": "Mediocre-Payment-899",
        "body": "If this isn’t an ad for Fidelity it should be",
        "created_utc": 1628081700,
        "id": "h7o7dlp",
        "permalink": "/r/wallstreetbets/comments/oxqcpg/my_experience_trading_with_robinhood_this_past/h7o7dlp/",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1628110500.0
    },
    {
        "author": "bluedaddy1",
        "body": "Headline is semi misleading. There is no binding agreement, it counts hybrids as EVs, and the $100B in incentives is what the administration is calling for (would still need to get voted on by Congress)",
        "created_utc": 1628167660,
        "id": "h7ss5cg",
        "permalink": "/r/wallstreetbets/comments/oygln5/biden_to_set_target_for_50_evs_by_2030_100b_in/h7ss5cg/",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1628196460.0
    },
    {
        "author": "AlE833",
        "body": "It’s really becoming a joke isn’t it. But the hedge funds must also be involved in this? I can’t believe that retail investors are the only ones doing this?",
        "created_utc": 1628085639,
        "id": "h7offbr",
        "permalink": "/r/stocks/comments/oxt5xo/robinhoods_stock_is_spiking_but_this_is_the_time/h7offbr/",
        "score": 64,
        "subreddit": "stocks",
        "created": 1628114439.0
    },
    {
        "author": "Tacocattimusmaximus",
        "body": "This sub is so full of shills it kills me lol. Pushing gold are we? I thought that strategy was over with.",
        "created_utc": 1628086446,
        "id": "h7oh7h2",
        "permalink": "/r/investing/comments/oxshiy/companies_are_capitalizing_on_the_ongoing_gold/h7oh7h2/",
        "score": 61,
        "subreddit": "investing",
        "created": 1628115246.0
    },
    {
        "author": "iDoctorBob",
        "body": "Good fucking luck. \n\nMy morning ritual consists of coffee, cranking it, and then looking at my PLTR shares as they trade down another 5%. I can’t wait until they moon in 2042.",
        "created_utc": 1628074694,
        "id": "h7nwfxj",
        "permalink": "/r/wallstreetbets/comments/oxppt9/pltr_yolo_or/h7nwfxj/",
        "score": 61,
        "subreddit": "wallstreetbets",
        "created": 1628103494.0
    },
    {
        "author": "ReasonHound",
        "body": "Believe it or not some people don’t give a shit about GME. I honestly don’t even know why GME and AMC are so high. They are shitty companies.",
        "created_utc": 1628096635,
        "id": "h7p5kit",
        "permalink": "/r/wallstreetbets/comments/oxwuiw/it_absolutely_blows_my_mind_that_so_many_people/h7p5kit/",
        "score": 61,
        "subreddit": "wallstreetbets",
        "created": 1628125435.0
    },
    {
        "author": "LeChronnoisseur",
        "body": "Same, then it came back in july :(",
        "created_utc": 1628136755,
        "id": "h7rlm87",
        "permalink": "/r/wallstreetbets/comments/oy6neg/am_i_doing_this_the_right_way/h7rlm87/",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1628165555.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "**WSB for the next year:**\n\n*HOOD goes up:* IT’S A PUMP AND DUMP JUST WAIT\n\n*HOOD goes down:* SEE HAHAH TOLD YOU STOCK DYING, 30 SOON\n\n*HOOD goes up:* MANIPULATION, ITLL GO DOWN AGAIN WATCH\n\n*HOOD goes down:* HAHAH TOLD YOU, DEAD STOCK\n\nRinse and repeat. \n\nGuys, stocks go up and down. We didn’t say it would go up everyday forever 🤣",
        "created_utc": 1628163113,
        "id": "h7skjau",
        "permalink": "/r/wallstreetbets/comments/oyeeib/daily_discussion_thread_for_august_05_2021/h7skjau/",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1628191913.0
    },
    {
        "author": "Bruce-man-Bat-wayne",
        "body": "It can take weeks for the numbers to update. If one institution is selling and another is buying it can appear that they both own for several weeks.",
        "created_utc": 1628033599,
        "id": "h7m4y0y",
        "permalink": "/r/wallstreetbets/comments/oxfhug/according_to_nasdaqcom_institutions_currently_own/h7m4y0y/",
        "score": 57,
        "subreddit": "wallstreetbets",
        "created": 1628062399.0
    },
    {
        "author": "aguibuk",
        "body": "Timing is indeed important though. Predictions without timing are literally useless. I could say a crash is coming, don't know when but it's coming. I'll be right eventually, and I'm 100% certain about it. Also, a big bill run is coming sometime. Oh and Nasdaq is going to drop 1000 points in a single day sometime in the future",
        "created_utc": 1628138926,
        "id": "h7rp9p3",
        "permalink": "/r/stocks/comments/oy57s2/the_coming_crisis/h7rp9p3/",
        "score": 55,
        "subreddit": "stocks",
        "created": 1628167726.0
    },
    {
        "author": "wiseguy187",
        "body": "I think a big problem that happened during the virus is all the money printing to hold up the market while giving poor people a couple 1k dollar checks. Well the people already positioned in good places hold large 401ks or stocks or and inventory of homes made soo much money. Im 32 and my 401k went from 100k to 220k last year. This market proping has made the well off, better off. So now they are putting all the newly earned money in assets, stocks, homes. Over paying for homes and property isnt a big deal when you made a ton of money against a struggling middle/lower class. This has created alot of inflation for assets which has made it even harder to break out of your current situation. The divide is growing, Shit I think there will be a huge wealth inequality in the younger generation based off home owners before 2020 and after the pandemic. My peers are buying homes they may be able to afford, on 2 incomes over a 30 year period. But people arent afforded the extra slack or cash to deal with all the obstacles life comes with. This will likely lead to a lower birth rate, higher mental illness, higher divorce rates and likely a growing of inequality. Just my opinion. Im currently looking to buy some land in New England around the White Mountains. Maybe im paranoid but land and homes seems to be the new asset to horde. I think the repercussions of global warming will be exponential and can see many wealthy east coasters slowly moving more north over the next 50 years.",
        "created_utc": 1628137261,
        "id": "h7rmhae",
        "permalink": "/r/stocks/comments/oy57s2/the_coming_crisis/h7rmhae/",
        "score": 55,
        "subreddit": "stocks",
        "created": 1628166061.0
    },
    {
        "author": "not-always-popular",
        "body": "I’ve pushed it all into GME and crossing my fingers",
        "created_utc": 1628082927,
        "id": "h7o9qzn",
        "permalink": "/r/CanadianInvestor/comments/oxrhrb/if_you_knew_the_below_was_coming_what_would/h7o9qzn/",
        "score": 55,
        "subreddit": "CanadianInvestor",
        "created": 1628111727.0
    },
    {
        "author": "EtikaStarBloodline",
        "body": "keep spreading negative news about robinhood ive noticed every time you apes hype something up the stocks go down and when you try to destroy it the shares go up and up. you guys are worse than any hedge fund or citedal because you make money off the unsure bull shet you guys spread to trick dumb retail investors with pump and dumps",
        "created_utc": 1628079460,
        "id": "h7o3fkr",
        "permalink": "/r/wallstreetbets/comments/oxou2l/robinhood_will_eventually_tank/h7o3fkr/",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1628108260.0
    },
    {
        "author": "irresponsible_owl",
        "body": "What ongoing gold trend? Trend in *what*?\n\nIt sounds like you just made this whole thing up because it's very vague. For example:\n\n&gt; The demand for gold has been driven not only by cultural changes\n\nWhat demand? What changes?\n\n&gt; but also by the income growth in some of the world’s most dynamic and rapidly growing economies. \n\nWhich economies are those? What is a dynamic economy?\n\nDo you have any sources at all for your vague claims? You could post this and replace gold with literally any other asset and it would be just as meaningful.",
        "created_utc": 1628090492,
        "id": "h7oqj9i",
        "permalink": "/r/investing/comments/oxshiy/companies_are_capitalizing_on_the_ongoing_gold/h7oqj9i/",
        "score": 54,
        "subreddit": "investing",
        "created": 1628119292.0
    },
    {
        "author": "iwashwindows",
        "body": "You and me both buddy! I pulled out half of my 17k to pay off all debt except for mortgage and I put the $8500 left into something that immediately turned it to $5500🤣 sometimes you win big like I did in February and then you make crap impatient decisions and lose. But now it’s all play money so hopefully I’m patient and start to make some back to pay off the mortgage!",
        "created_utc": 1628135933,
        "id": "h7rk78x",
        "permalink": "/r/pennystocks/comments/oy7va9/how_long_were_you_trading_before_you_hit_you/h7rk78x/",
        "score": 54,
        "subreddit": "pennystocks",
        "created": 1628164733.0
    },
    {
        "author": "wolflarsen55",
        "body": "Bought at $35, sold $78. I always buy even amounts and sell half as soon as it covers my initial purchase price. Then I let the other half \"ride\" as free money. I won't always hit tendies but it is a solid exit strat for me.",
        "created_utc": 1628090823,
        "id": "h7orc0x",
        "permalink": "/r/wallstreetbets/comments/oxt0mq/hood_yolo_update/h7orc0x/",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1628119623.0
    },
    {
        "author": "OnlineMarketingBoii",
        "body": "Nope. We all said we shoudln't touch it.",
        "created_utc": 1628085692,
        "id": "h7ofjes",
        "permalink": "/r/wallstreetbets/comments/oxt0mq/hood_yolo_update/h7ofjes/",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1628114492.0
    },
    {
        "author": "Goldstone117",
        "body": "Then again, I've seen plays so retarded that it reaches a critical point where they collapse within itself creating a black hole of dead brain cells that somehow manages to squeeze profits\n\nOf course they loose those profits in their next position",
        "created_utc": 1628033815,
        "id": "h7m5e91",
        "permalink": "/r/wallstreetbets/comments/ox7tlc/kids_dont_be_like_me/h7m5e91/",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1628062615.0
    },
    {
        "author": "salfkvoje",
        "body": "Not Fidelity. Switched over and am pretty happy. Their desktop site is ass, but their app is \"okay\", actually it has a lot of good customization. And I guess they're rolling out a beta that's even better, but not available for android yet.",
        "created_utc": 1628100027,
        "id": "h7pdvqj",
        "permalink": "/r/wallstreetbets/comments/oxwuiw/it_absolutely_blows_my_mind_that_so_many_people/h7pdvqj/",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1628128827.0
    },
    {
        "author": "Ratchet_as_fuck",
        "body": "Perhaps ;o\n\nFun fact I created the concept art and idea for divine potions that made it into the game, the one dent I made on the OSRS community. Edit: [Here it is](https://www.reddit.com/r/2007scape/comments/az84d2/song_of_the_elves_content_suggestion_crystal_dust/?utm_medium=android_app&amp;utm_source=share)",
        "created_utc": 1628077778,
        "id": "h7o0ri6",
        "permalink": "/r/wallstreetbets/comments/oxqcpg/my_experience_trading_with_robinhood_this_past/h7o0ri6/",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1628106578.0
    },
    {
        "author": "wsb_mods_R_gay",
        "body": "I hope it keeps ripping, I want some puts when they become available.",
        "created_utc": 1628065959,
        "id": "h7nmam8",
        "permalink": "/r/wallstreetbets/comments/oxo21c/wen_hood_short_short_hood_dd/h7nmam8/",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1628094759.0
    },
    {
        "author": "BobSacamano47",
        "body": "Everyone is acting like AMD has to go down. It was nearly $100 a year ago, and earnings and forecasts are through the roof since then. It's still undervalued, just not criminally undervalued anymore.",
        "created_utc": 1628165779,
        "id": "h7sosd0",
        "permalink": "/r/wallstreetbets/comments/oyg2pc/daily_popular_tickers_thread_for_august_05_2021/h7sosd0/",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1628194579.0
    },
    {
        "author": "lateral_moves",
        "body": "Love how when pumps like this happen, RH has a notice that trading is temporarily halted. For their stock, it said some brokerages temporarily halted it, but not Robinhood. They are so fucking shady. I can't stand it.",
        "created_utc": 1628089577,
        "id": "h7oodf9",
        "permalink": "/r/stocks/comments/oxt5xo/robinhoods_stock_is_spiking_but_this_is_the_time/h7oodf9/",
        "score": 50,
        "subreddit": "stocks",
        "created": 1628118377.0
    },
    {
        "author": "Trippp2001",
        "body": "$WSRC - no dilution, smallish float, no debt.\n\nHave a uniquely “clean” and efficient mining technique and just announced an expected 4.6B in yearly revenue from gold.  3oz/ton expected.\n\nIt’s a penny stock, so you never know - it could be a PnD, but they just PR’d the mine, so you’d assume they wouldn’t lie in an official 8K.\n\nThey’ve also been in the mining industry for 100 years.",
        "created_utc": 1628030640,
        "id": "h7lyp71",
        "permalink": "/r/pennystocks/comments/oxe5la/is_an_epic_gold_and_silver_bull_run_about_to/h7lyp71/",
        "score": 49,
        "subreddit": "pennystocks",
        "created": 1628059440.0
    },
    {
        "author": "brutalpancake",
        "body": "Comments in here like you actually need it 60+ to make money. If it makes a quick move back to 35-40 those will print like crazy. Good luck, fellow Palantard.",
        "created_utc": 1628138985,
        "id": "h7rpdeb",
        "permalink": "/r/wallstreetbets/comments/oy9man/another_palantard_reporting_in_all_in_on_shares/h7rpdeb/",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1628167785.0
    },
    {
        "author": "Hyperiongame",
        "body": "Just about to say the same. Hopefully, OP sold it near $80 for max profit. It quickly went down. I was very surprised to HOOD way up when market opened",
        "created_utc": 1628087540,
        "id": "h7ojnpm",
        "permalink": "/r/wallstreetbets/comments/oxt0mq/hood_yolo_update/h7ojnpm/",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1628116340.0
    },
    {
        "author": "Izzyyiz",
        "body": "Yea it will tank but you best believe ima make those sweet tendies on options when the market opens! \n\nDropping 10k into deep OTM options at opening with the plan of cashing out in the afternoon and buying puts with the profits! See ya on the moon\n\nUpdate: Made 5k profits but left 25k on table sold right after the first halt as i thought it was going to tank but it kept running. Currently trying to execute phase 2 of my plan!\n\nUpdate: FUCK HOOD those fuckers robbed me of my profits! I had a great plan to hold till end of day but the HALT fucked me. If any of you retards held threw the first halt god bless your huge balls!\n\nUpdate: Made 200$ on the put and looking to get some calls when it stablizes\n\nLast update: Dont get in on puts the IV is waaayy too high. You will bleed unless massive movement and the stock seems to have stabilized.",
        "created_utc": 1628072136,
        "id": "h7nt8rp",
        "permalink": "/r/wallstreetbets/comments/oxou2l/robinhood_will_eventually_tank/h7nt8rp/",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1628100936.0
    },
    {
        "author": "pinkfloyd27",
        "body": "MVST has \\~$3.63 in cash per share after the merger (not counting two operation factories) and no debt. If the company went bankrupt today it would probably liquidate just under this price target.",
        "created_utc": 1628044172,
        "id": "h7mqif2",
        "permalink": "/r/wallstreetbets/comments/oxirt8/mvst_morgan_stanleys_adam_jonas_is_at_it_again/h7mqif2/",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1628072972.0
    },
    {
        "author": "Laxhobo2002",
        "body": "Cracking up that Vlad sold 1,250,000 shares near the bottom ($36.40), only for it to immediately spike up +20% in a single day. All hail Lord Vlad, the Paper-Handed  🧻🙌🏻",
        "created_utc": 1628033549,
        "id": "h7m4ubd",
        "permalink": "/r/wallstreetbets/comments/oxecbe/are_we_all_secretly_holding_since_ipo_i_am/h7m4ubd/",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1628062349.0
    },
    {
        "author": "chaben34",
        "body": "Now ride it back down to $40.",
        "created_utc": 1628087377,
        "id": "h7ojajz",
        "permalink": "/r/wallstreetbets/comments/oxt0mq/hood_yolo_update/h7ojajz/",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1628116177.0
    },
    {
        "author": "sdflysurf",
        "body": "fellow retard here - I hold AMC and 9K shares of MVIS.\n\nRemember also that MVIS is on the short-sell ban by Jeffries with AMC and GME\n\n[https://www.bloomberg.com/news/articles/2021-06-03/jefferies-blocks-short-sells-in-gamestop-amc-microvision](https://www.bloomberg.com/news/articles/2021-06-03/jefferies-blocks-short-sells-in-gamestop-amc-microvision)\n\n wonder why?  Overly shorted??  Huge possibility of further squeeze if shorts forced to cover??\n\nWell we all know that they aren't being forced to cover because no one at the SEC is putting their foot down - but imagine if MVIS announces a special dividend for selling off the NED part of the business - shorts would have to pay that dividend for every share they shorted.  It would crush them.",
        "created_utc": 1628140797,
        "id": "h7rs74p",
        "permalink": "/r/wallstreetbets/comments/oy3u7a/mvis_er_call_mvis_product_on_hololense_2_confirmed/h7rs74p/",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1628169597.0
    },
    {
        "author": "lubrigerms",
        "body": "The only people who were angry about the gme fiasco were greedy autist and dumbfucking apes who entered when it hit 300.",
        "created_utc": 1628098223,
        "id": "h7p9h5p",
        "permalink": "/r/wallstreetbets/comments/oxwuiw/it_absolutely_blows_my_mind_that_so_many_people/h7p9h5p/",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1628127023.0
    },
    {
        "author": "rocketpromoter",
        "body": "No one is going to stop using it.  All you gme retards were all over it before gme, despite their history of outages.\n\nAs long as they got a basic bitch setup that attracted you retards like flies to shit, they will always have new users.",
        "created_utc": 1628074742,
        "id": "h7nwi80",
        "permalink": "/r/wallstreetbets/comments/oxou2l/robinhood_will_eventually_tank/h7nwi80/",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1628103542.0
    },
    {
        "author": "Jimwin911",
        "body": "Keep loading it by the boat load at this price.  First official earnings due 8/16.  Projected $200M revenue this year",
        "created_utc": 1628133056,
        "id": "h7rexwx",
        "permalink": "/r/wallstreetbets/comments/oy8kd2/microvast_vs_quantumscape/h7rexwx/",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1628161856.0
    },
    {
        "author": "JimmyDuce",
        "body": "It’s the only one that restricted one side of the trade, the side that supported the short and was costing one of RHs primary source of income money.  Other brokers needed to properly assess their risks and capitalization and so rightly halted both sides of the trade.  RH was unique in choosing which side of the trade it allowed to continue",
        "created_utc": 1628099183,
        "id": "h7pbu22",
        "permalink": "/r/wallstreetbets/comments/oxwuiw/it_absolutely_blows_my_mind_that_so_many_people/h7pbu22/",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1628127983.0
    },
    {
        "author": "Alternative-Fox6236",
        "body": "no, I appreicate it. Didnt take this as a dick comment at all. But that's why I'm asking is there even a tradable edge in options? I was just going to index it.",
        "created_utc": 1628038913,
        "id": "h7mfsl7",
        "permalink": "/r/options/comments/oxgwzr/parents_gave_me_125000_was_going_to_index_it_but/h7mfsl7/",
        "score": 45,
        "subreddit": "options",
        "created": 1628067713.0
    },
    {
        "author": "nutsackninja",
        "body": "If you love it at 14 you are going to go crazy when it's $10.",
        "created_utc": 1628168695,
        "id": "h7su6gt",
        "permalink": "/r/wallstreetbets/comments/oyflkc/is_it_tlry_time_now/h7su6gt/",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1628197495.0
    },
    {
        "author": "jakemcl",
        "body": "I expect it to go up or down.",
        "created_utc": 1628168165,
        "id": "h7st4mx",
        "permalink": "/r/shroomstocks/comments/oyf7x9/cybin_today_the_day/h7st4mx/",
        "score": 44,
        "subreddit": "shroomstocks",
        "created": 1628196965.0
    },
    {
        "author": "MainStreetBetz",
        "body": "This one is a disgusting fraud.  They raise money, IPO/SPAC, insiders dump all their shares at open and then two months later they say it is a fraud and resign.  This was a pure pump and dump on to retail.  These guys deserve jail time.",
        "created_utc": 1628097961,
        "id": "h7p8ty7",
        "permalink": "/r/wallstreetbets/comments/oxxio0/down_80k_in_a_day_on_the_fraud_that_is_zymergen/h7p8ty7/",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1628126761.0
    },
    {
        "author": "sannitig",
        "body": "I would agree but gold seems to not be acting like it used to. It could be one of those things where currently it's acting differently, but when the stuff hits the fan people go back to their old ways and gold will skyrocket. And if you took a picture of gold right now you would expect it to be skyrocketing during the pandemic which it's not, which is why I made the statement of gold is not acting like it should",
        "created_utc": 1628083714,
        "id": "h7obc4o",
        "permalink": "/r/CanadianInvestor/comments/oxrhrb/if_you_knew_the_below_was_coming_what_would/h7obc4o/",
        "score": 44,
        "subreddit": "CanadianInvestor",
        "created": 1628112514.0
    },
    {
        "author": "Juffin",
        "body": "IMO the only good strategy is to not participate. RH has way too many problems to be a good long term hold. However, it's so volatile that you're gonna get margin called if you try to short it.",
        "created_utc": 1628097985,
        "id": "h7p8w0h",
        "permalink": "/r/wallstreetbets/comments/oxt0ah/robinhood_halted_for_volatility_after_surging_65/h7p8w0h/",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1628126785.0
    },
    {
        "author": "ImTheMonk",
        "body": "Did you watch the session? No one really seemed to think they broke any laws blocking purchase of GME/other meme stocks. There was some outrage and questions about how things got to the point where such a drastic action was needed, but congress-people from both parties, and the impartial market expert all seemed to accept that it was a necessary course of action for the brokerages to protect themselves.\n\nThe reason they wanted to talk to Vlad had more to do with A) payment for order flow and B) social media's influence on the market.\n\nAnd (A) is a really damned good thing to be asking about, because there are laws requiring brokers to provide \"best execution\" to their clients, but RH/Citadel have basically created a \"better than best\" execution option, allowing RH orders to be front-run. It should be illegal, and it's what RH's entire business model is built upon.",
        "created_utc": 1628097416,
        "id": "h7p7hki",
        "permalink": "/r/wallstreetbets/comments/oxwuiw/it_absolutely_blows_my_mind_that_so_many_people/h7p7hki/",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1628126216.0
    },
    {
        "author": "jmmy1232",
        "body": "Try forward testing for at least 6 months. If it works, you're good to go... BTW, what was the max drawdown?",
        "created_utc": 1628160502,
        "id": "h7sgv6e",
        "permalink": "/r/stocks/comments/oyepxj/getting_consistent_gains_of_about_500_a_year_for/h7sgv6e/",
        "score": 42,
        "subreddit": "stocks",
        "created": 1628189302.0
    },
    {
        "author": "DeMayon",
        "body": "well this is bullshit lmfao. They helped secure the deal at $10 and the valuation, and then they downgrade it. The $6 market cap valuation is literally equivalent to their contracted revenue.",
        "created_utc": 1628029267,
        "id": "h7lvqeb",
        "permalink": "/r/SPACs/comments/oxefv2/mvst_microvast_with_a_6_price_target_from_morgan/h7lvqeb/",
        "score": 41,
        "subreddit": "SPACs",
        "created": 1628058067.0
    },
    {
        "author": "MajesticCustard",
        "body": "Lol, we were not asked to write this by Wealthsimple. So no need to feel sad! We're writing the story because I'm genuinely curious what people think of the fractional shares features — that's why I pitched it to my editor last week. If they're bad to use — I want to hear all about that!",
        "created_utc": 1628136352,
        "id": "h7rkxfz",
        "permalink": "/r/CanadianInvestor/comments/oy1hb0/is_anyone_here_using_wealthsimples_fractional/h7rkxfz/",
        "score": 41,
        "subreddit": "CanadianInvestor",
        "created": 1628165152.0
    },
    {
        "author": "Snoo-63767",
        "body": "2k lol? I’m at 545. I’m so proud of it. I would kill for 2k lol.",
        "created_utc": 1628136060,
        "id": "h7rkf80",
        "permalink": "/r/wallstreetbets/comments/oy3u7a/mvis_er_call_mvis_product_on_hololense_2_confirmed/h7rkf80/",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1628164860.0
    },
    {
        "author": "thelonelyteaparty",
        "body": "For me, I pumped $2000 into TSLA in 2019, right before their Annual General Meeting, knowing that they'd have some big news to share. In one year it grew about 150% and that was huge for me as a new investor, in fact I had even created a brokerage account just to buy TSLA. Might not be a penny, but right now I'm hoping to do the same with MBH Corp.",
        "created_utc": 1628130119,
        "id": "h7r995u",
        "permalink": "/r/pennystocks/comments/oy7va9/how_long_were_you_trading_before_you_hit_you/h7r995u/",
        "score": 40,
        "subreddit": "pennystocks",
        "created": 1628158919.0
    },
    {
        "author": "Dyslexic_Engineer88",
        "body": "I am not worried long-term.\n\nI'll stay the course and ride it out. Betting long-term Canada and USA equities return more then inflation even if all hell breaks loose.\n\nI am split XEQT (personal) + WS SRI (RESP, SRRSP) portfolios. The Soonest I will need any of my investment is 12 years for RESP and 20 - 30 years for RRSP depending on if I retire early or wait.\n\nI own my house and I am investing in additions doing the work to add value over the cost.\n\nWorst case we have a few tight years and rid out any rough spots. Even the worst economic collapses in history still see equities bounce back above or near previous highs within a few years.\n\nBut if the true apocalypse comes, I am really good at fixing, building and making things so ill be just fine.",
        "created_utc": 1628081129,
        "id": "h7o6c0c",
        "permalink": "/r/CanadianInvestor/comments/oxrhrb/if_you_knew_the_below_was_coming_what_would/h7o6c0c/",
        "score": 40,
        "subreddit": "CanadianInvestor",
        "created": 1628109929.0
    },
    {
        "author": "peon2",
        "body": "Yeah I never had been to WSB before the GME thing and looked in for the fun during that saga.\n\nAt the time WSB was promoting the exact same things this sub was. AMD and PLTR were every other post here for months and it was the same there. They just are more funny about it and use the r-word",
        "created_utc": 1628167811,
        "id": "h7ssg1d",
        "permalink": "/r/stocks/comments/oyfih9/robinhood_retreats_after_monster_rally_this_week/h7ssg1d/",
        "score": 39,
        "subreddit": "stocks",
        "created": 1628196611.0
    },
    {
        "author": "PresterJohnsKingdom",
        "body": "Michael Burry was early.  He was lucky to have the liquidity to hold his position until the housing market crashed and his credit default swaps were profitable.  (2 or 3 years, if I recall)\n\nYou're not wrong in your premise, a black swan event could cause a major pull back.  But there's no way to see it coming.  \n\nTime in the market beats timing the market.",
        "created_utc": 1628134064,
        "id": "h7rgtjp",
        "permalink": "/r/stocks/comments/oy57s2/the_coming_crisis/h7rgtjp/",
        "score": 39,
        "subreddit": "stocks",
        "created": 1628162864.0
    },
    {
        "author": "Thestocksqueezeking",
        "body": "The cringe... it hurts.",
        "created_utc": 1628040885,
        "id": "h7mju8k",
        "permalink": "/r/Wallstreetbetsnew/comments/oxhuk4/just_thought_this_was_awesome/h7mju8k/",
        "score": 38,
        "subreddit": "Wallstreetbetsnew",
        "created": 1628069685.0
    },
    {
        "author": "arafdi",
        "body": "Hey if it works it's... a bit confusing, I guess...",
        "created_utc": 1628084529,
        "id": "h7od1bm",
        "permalink": "/r/wallstreetbets/comments/oxqcpg/my_experience_trading_with_robinhood_this_past/h7od1bm/",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1628113329.0
    },
    {
        "author": "AlwaysObamasFault",
        "body": "Yeah I just spent my entire savings on $20 puts expiring the 20th. I don’t think it will go that low but don’t plane on Diamond handing.",
        "created_utc": 1628091667,
        "id": "h7otdb6",
        "permalink": "/r/wallstreetbets/comments/oxt0mq/hood_yolo_update/h7otdb6/",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1628120467.0
    },
    {
        "author": "Kamikaze_Cash",
        "body": "Might sell another LRCX put credit spread. Real talk, LRCX is the tits.",
        "created_utc": 1627948424,
        "id": "h7hp5kc",
        "permalink": "/r/wallstreetbets/comments/owmjjx/what_are_your_moves_tomorrow_august_03_2021/h7hp5kc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627977224.0
    },
    {
        "author": "coolcomfort123",
        "body": "amat and lrcx are on fire, smh is also breaking 52 week high.",
        "created_utc": 1627918073,
        "id": "h7fslz7",
        "permalink": "/r/stocks/comments/owb350/rstocks_daily_discussion_monday_aug_02_2021/h7fslz7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627946873.0
    },
    {
        "author": "apooroldinvestor",
        "body": "It wont outperform stocks like ASML LRCX GOOGL NVDA etc.",
        "created_utc": 1627852211,
        "id": "h7ctsw3",
        "permalink": "/r/stocks/comments/ovy1nj/roth_ira_question/h7ctsw3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627881011.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I'm not long memes etc.  Blue chips like ASML MSFT AAPL GOOGL PYPL LRCX etc.",
        "created_utc": 1627957445,
        "id": "h7i7ymv",
        "permalink": "/r/stocks/comments/ow0oyo/this_week_will_be_interesting/h7i7ymv/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627986245.0
    },
    {
        "author": "dellarouche",
        "body": "It's lower vol because it's a 3x leveraged fund which means maintenance requirement is 100% on puts and calls sold.  It's not meant to be held overnight really.  But when it goes below 35, it's great for swing trade. \n\nIt's risky buying puts on it with the momentum of AMD and all the semiconductors beating earnings left and right currently, ie klac, lrcx, swks, qcom, amd, asml, txn, mchp, and upcoming amat, adi, qrvo.  Since it swings up 3x, it will render your puts worthless extremely fast.  \n\nOn 3x etfs, you have to be watching the minute chart because it can swing in both directions extremely violently.  It's not really a buy a put / call and forget it kind of ticker.",
        "created_utc": 1628034903,
        "id": "h7m7n33",
        "permalink": "/r/options/comments/oxb9za/soxl_puts/h7m7n33/",
        "score": 1,
        "subreddit": "options",
        "created": 1628063703.0
    },
    {
        "author": "Sillybanana7",
        "body": "I mean you can stop trading shit and trade stuff that's been going up for the past 5 or 6 years. Here's examples : shopify, amd, Nvda, aapl, msft, lrcx. Instead you trade crap and then ask for help lol",
        "created_utc": 1628031450,
        "id": "h7m0fce",
        "permalink": "/r/wallstreetbets/comments/oxczrk/loss_porn_need_help_seriously/h7m0fce/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628060250.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Depends. If you're younger (less than 60?) You can keep some cash and buy more tech on dips.  I also like healthcare.  UNH, TMO, DHR etc.  To me tech and healthcare are great investments forever.  Also I like semi equipment companies ASML and LRCX.",
        "created_utc": 1627833139,
        "id": "h7bpfgc",
        "permalink": "/r/stocks/comments/ovuesj/is_it_worth_it_to_diversify_into_sectors_that_are/h7bpfgc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627861939.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I also have LRCX.",
        "created_utc": 1627876096,
        "id": "h7e3acr",
        "permalink": "/r/stocks/comments/ow5bbc/asml_vs_pypl/h7e3acr/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627904896.0
    },
    {
        "author": "apooroldinvestor",
        "body": "The sliver of LRCX for one example is so small in the index  as to be not be worth anything.",
        "created_utc": 1627857269,
        "id": "h7d41o7",
        "permalink": "/r/stocks/comments/ovy1nj/roth_ira_question/h7d41o7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627886069.0
    },
    {
        "author": "thetagodfather",
        "body": "Ni ou Mao ma?",
        "created_utc": 1627812048,
        "id": "h7ar3vy",
        "permalink": "/r/stocks/comments/ovkz64/china_restrictions_on_stocks/h7ar3vy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627840848.0
    },
    {
        "author": "thetagodfather",
        "body": "They also wouldn’t need to punish all these big companies and guys like Jack Ma, it’s all about staying in control and showing them whose the boss",
        "created_utc": 1627812141,
        "id": "h7ar7ol",
        "permalink": "/r/stocks/comments/ovkz64/china_restrictions_on_stocks/h7ar7ol/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627840941.0
    }
]