[
    {
        "author": "greytoc",
        "body": "It depends on the type of institutional holder and size of the company. I generally favor companies with high percentage of institutional holders and lower percentage of insiders. I.e. $aapl, $msft, $fisv are examples.\n\nPart of my reasoning is that if a company cannot attract institutional investors, there could be something wrong fundamentally with the business.",
        "created_utc": 1630943329,
        "id": "hbtja49",
        "score": 5,
        "subreddit": "investing",
        "created": 1630972129.0
    },
    {
        "author": "gaydetector3000",
        "body": "FLT - Drone Delivery Company \n\nBeen pumping out patents lately and signing military and avionics contracts. As soon as their drones are airborne they will be #1 in the Drone Delivery operation. Prepared for a huge upside soon enough. \n\nThis stock is primed for takeoff… I’m talking long-term holding, 5yrs, 10yrs. My price target currently is 10$ but that could change in an instant if they get interest from Amazon or a large cap company like that",
        "created_utc": 1630831606,
        "id": "hbo18yj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630860406.0
    },
    {
        "author": "Light-of-Liberty",
        "body": "Do yourself a favor and pick up a handful of FLT when you get a chance. Drop Tesla until you can afford a whole one.... just try to simplify a little bit",
        "created_utc": 1630625665,
        "id": "hbdpfw4",
        "score": -1,
        "subreddit": "StockMarket",
        "created": 1630654465.0
    },
    {
        "author": "RandolphE6",
        "body": "Cherry picking some of the best winners in history while they are at (or near) their all time highs is representative of the average stock amirite?\n\nHere's some examples for you... in the year 2000 the top 10 stocks on the market were:\n\n\\#1: GE. 21 years later, you'd still be down 75%. (Ouch!)\n\n\\#2: Exxon Mobile. 21 years later you'd be up 50%. Hey not bad! (but still not better than the index)\n\n\\#3: Pfizer. 21 years later, you'd be down 5%.\n\n\\#4: Citigroup. 21 years later, you'd be down 85%. (Ouch!)\n\n\\#5: Cisco. 21 years later, you'd be down 30%.\n\n\\#6: Walmart. 21 years later, you'd be up 110%. Best so far! (but still lower than index)\n\n\\#7 Microsoft. 21 years later, you'd be up 1000%. Hey we found one of the winners!\n\n\\#8 AIG. 21 years later, you'd be down 97%. (Ouch!)\n\n\\#9 Merck. 21 years later, you'd be down 5%.\n\n\\#10 Intel. 21 years later, you'd be down 25%.\n\n&amp;#x200B;\n\nTo summarize, randomly picking one of the top 10 stocks on the market:\n\nYou'd have a 90% chance of doing worse than the SP500.You'd have a 70% of not only doing worse, but still being negative after 21 years, not including inflation.And you'd have a 30% chance of losing 75% or more..\n\nOf course this is all assuming you didn't sell sometime along the way. Microsoft being the clear winner, you still would've suffered through a 60% loss and taken over a decade to recoup. How many average people do you know can let their investment sit for over a decade while being in the red the entire time?",
        "created_utc": 1633406745,
        "id": "hffxaal",
        "score": 17,
        "subreddit": "stocks",
        "created": 1633435545.0
    },
    {
        "author": "wrb3",
        "body": "Dude on CNBC like “buy Cisco- sell Amazon.”\nBruh, go back to 1999.",
        "created_utc": 1633469052,
        "id": "hfj1awq",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1633497852.0
    },
    {
        "author": "DoDaOpposite",
        "body": "Why not just hold XLK if you want that much exposure to mega tech stocks?  And since you \"know\" those companies will go up long term, dont bother reading below.  I only post it for others that may not be so.... arrogant.\n\n\"Among the largest 15 companies in the index ( they are talking NASDAQ ) back in 2000, only four remain in the top 15 today: Microsoft, Cisco, Intel and Qualcomm.\n\nOver the entire 781-week period, only Qualcomm and Microsoft stocks had   \npositive returns -- up 1.54% and 1.34% annually, respectively. Cisco's   \nstock had a cumulative return of -52.5% (-4.8% annually) and Intel was   \ndown 24.63% (-1.9% annually).\"",
        "created_utc": 1633218104,
        "id": "hf5rncx",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633246904.0
    },
    {
        "author": "derprondo",
        "body": "I was more referring to the fact that CSCO never returned to the pre-bust high, bag holders are still down 20 years later.",
        "created_utc": 1633469591,
        "id": "hfj2ihz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633498391.0
    },
    {
        "author": "InnocentAnthro",
        "body": "Tesla is supply constrained - meanwhile other companies in the market have *spare* or *convertible capacity.* This will be an issue in keeping market share. \n\nBesides, you're missing my point. It doesn't matter whether Tesla had a bright future, I never denied that they have effective tech, an effective product and solid manufacturing potential. Tesla isn't going to collapse as a business. However, you can have great companies which are massively over-valued (think Cisco in dot-com era) and Tesla is one of these companies.\n\nTesla's current valuation doesn't make sense. In terms of EVs, VW is just a few % points behind Tesla in global market share (and has an equally bright future in this market) but is valued at 1/6 the value **despite having extensive market share in ICE markets**. That is absurd, Tesla made $31.5bn in revenue in 2020 whereas VW made $258bn in 2020. Fundamentally, the current valuation of Tesla is wrong. That's the problem with Tesla.",
        "created_utc": 1633087709,
        "id": "heyon4x",
        "score": 1,
        "subreddit": "investing",
        "created": 1633116509.0
    },
    {
        "author": "SirLauncelot",
        "body": "Apparently automation caused it.  You can use automation for scale and speed, or it can be used for consistency.  If it is critical infrastructure, you typically use it for the latter.  I recall doing upgrades on Cisco CRSes.  Takes over an hour to reboot and come back up to speed.  You don't  do more than a couple a night in case something goes wrong, and need the time to restore.",
        "created_utc": 1633488688,
        "id": "hfk5u1q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633517488.0
    },
    {
        "author": "Foman1231",
        "body": "Buys on CSCO 30C for January approaching $100 million today. Volume nearing 40,000 calls just at that strike.",
        "created_utc": 1633111352,
        "id": "hf02ost",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633140152.0
    },
    {
        "author": "ScreamingBuy1962",
        "body": "Make it slow and steady instead of trying to make a fortune overnight.  I am 59 and when I was in my twenties I was paying off student loans while putting what was left in options trading.  I made what felt like a small fortune in Csco options before I lost big. \n\nI stopped trading options in 1995 and starting gradually building up a stock portfolio.  When the IPhone came out I was I intrigued about the new  Apple. When I was at an awards dinner I saw my first sergeant watching a live basketball game on his iPhone—holy cow!  I bought 400 shares the next day, I think it was trading around 40 bucks a share in early 2007. That $16,000 appl investment is worth $2.25m today.   Own it don’t trade as Jim Crammer would say.",
        "created_utc": 1633131939,
        "id": "hf1b4zw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633160739.0
    },
    {
        "author": "Summebride",
        "body": "It's interesting and I don't have any basis on which to dispute.  I will say it's decidedly micro and anecdotal, whereas I'm taking the most macro view: Fastly has the most advanced tech that's respected by the most tech heavy players.  That has to be worth something.  \n\nI'd certainly be bitter if I did buy and hold, but I was selling tranches of FSLY on the times it was surging above $100.  I did however rebuild positions as it was falling to and through $70.  I thought it had a least one more run to $100 in it.  \n\nIf Roberts' prognosis is true, then it's been a heck of a turn.  \n\n Fastly was ready and able to solve the world's problems when COVID came along.  Seems pretty quick to be deemed irrelevant.  \n\nAnd what's even more crazy is their death was essentially triggered by Trump having a tantrum after social media users embarrassed him into thinking he was about to have a million person rally when in fact it was just 6,000 people.  \n\nHe made up that bizarre threat that tiktok was a national security threat... yet somehow this \"threat\" would be allowed to continue for 90 days as long as it was force-sold to the a Trump-supporting Walmart heirs.  That's a whale-sized pile of crimes and corruption right there.  \n\nInvestors speculated on what percent of Fastly's business might be impaired.  5%?  12%?  \n\nThe shocker came: China had abruptly killed 100% of their Fastly-Tiktok business.  Not just the US part.  All of it.  They'd either stolen or replaced FSLY's tech, all because of the tantrum threat.  \n\nI listened as Fastly management responded.  It sounded unpaniced and measured.  They talked about \"reserving the capacity\" in case Tiktok were to switch back.  At first that sounded ok.  But once it became obvious that wasn't going to happen, it sounded like they were still pining for that lost lover.  That was somewhat concerning to me.  Move on, and tell us what big client bases you're going to attack instead. \n\nThey did seem to recognize what the market was ruffled about, which at the time was Cloudflare's claim of distinction around security.  They acted seemingly appropriately by folding in Signal Sciences pretty quickly, so I was feeling somewhat comfortable about that.  \n\nHowever it's been quite awhile and I haven't seen or heard much from Fastly. They don't seem to have turned people on to the compute-on-edge, which feels to me like it might have huge potential.  \n\nWorse, when they've had hiccups, like with Tiktok or the large one hour outage this spring, it sounds like customers are flipping away from Fastly and the customer continues to do just fine without them (?)\n\nI think I read that after Amazon cut over when Fastly had the spring outage, they haven't bothered to flip back. If true, that doesn't speak too well of Fastly being essential.\n\nStill, if we think of NET and FSLY as Coke and Pepsi, there's always going to be a market for both.  I can't see Fastly just ceasing to exist, except through buy out of course.  I'd guessed some old blue chip like Cisco or IBM or Intel might buy them.",
        "created_utc": 1633380462,
        "id": "hfee8jc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633409262.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  4th of October\n\n\n\n## Upcoming events for Monday, October  4th\n\n - Stock splits:\n\n    - MECNY @ **8:5** (Payable date: 10/01/2021)\n    - MCHP @ **2:1** (Payable date: )\n\n - Expected earnings:\n\n  ADMP, AKU, BCAC, BPT, CIH, CMTL, FONR, GBRG, GWGH, HHLA, IFMK, KOR, NAPA, NEW, ONVO, PME, SNP, TENX, TYHT\n\n - Ex-div:\n\n  A, BBD, BBDO, BKSC, BNS, BRX, CSCO, CUZ, DG, DGX, ERIE, FINS, HLIO, ING, MTN, SAFM, WY\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.035%)\n    - 6-Month Bill Auction (previous: 0.050%)\n    - Durables Excluding Defense (previous: 2.4%)\n    - Factory Orders (consensus: 1.0%, previous: 0.4%)\n    - Factory orders ex transportation (previous: 0.8%)\n    - Investing.com Gold Index (actual: 54.8%, previous: 53.7%)\n    - Investing.com S&amp;P 500 Index (actual: 60.1%, previous: 61.1%)\n    - OPEC Meeting\n\n## Upcoming events for Tuesday, October  5th\n\n - Stock splits:\n\n    - ISRG @ **3:1** (Payable date: 10/04/2021)\n\n - Expected earnings:\n\n  AENZ, DRD, GGAL, PEP, SAR, THCA\n\n - Ex-div:\n\n  BDN, CMCSA, CVBF, GPS, JPM, PKBK, ROP, TTC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.075%)\n    - API Weekly Crude Oil Stock (previous: 4.127M)\n    - Exports (previous: 212.80B)\n    - FOMC Member Quarles Speaks\n    - IBD/TIPP Economic Optimism (previous: 48.5)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 60.1)\n    - ISM Non-Manufacturing Employment (previous: 53.7)\n    - ISM Non-Manufacturing New Orders (previous: 63.2)\n    - ISM Non-Manufacturing PMI (consensus: 60.0, previous: 61.7)\n    - ISM Non-Manufacturing Prices (previous: 75.4)\n    - Imports (previous: 282.90B)\n    - Markit Composite PMI (previous: 54.5)\n    - Redbook (previous: 16.5%)\n    - Services PMI (previous: 54.4)\n    - Trade Balance (consensus: -70.50B, previous: -70.10B)\n\n## Upcoming events for Wednesday, October  6th\n\n - Expected earnings:\n\n  AURC, AYI, DSWL, EDUC, HEPA, HIHO, IDT, JWEL, LEVI, LOOP, PV, RELL, RGP, RPM, STZ, STZ.B, TMQ, TNP, TRT, VLGEA, XIN\n\n - Ex-div:\n\n  ABM, CPB, CVA, FCPT, IMKTA, PFBC, PGR, RVSB, SSD, TIMB, VLGEA, WNC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 428K, previous: 374K)\n    - Crude Oil Imports (previous: -0.124M)\n    - Crude Oil Inventories (previous: 4.578M)\n    - Cushing Crude Oil Inventories (previous: 0.131M)\n    - Distillate Fuel Production (previous: 0.194M)\n    - EIA Refinery Crude Runs  (previous: 0.068M)\n    - EIA Weekly Distillates Stocks (consensus: -1.648M, previous: 0.385M)\n    - EIA Weekly Refinery Utilization Rates (previous: 0.6%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Bostic Speaks\n    - Gasoline Inventories (consensus: 1.400M, previous: 0.193M)\n    - Gasoline Production (previous: 0.246M)\n    - Heating Oil Stockpiles (previous: -0.366M)\n    - MBA 30-Year Mortgage Rate (previous: 3.10%)\n    - MBA Mortgage Applications (previous: -1.1%)\n    - MBA Purchase Index (previous: 280.4)\n    - Mortgage Market Index (previous: 734.9)\n    - Mortgage Refinance Index (previous: 3,359.5)\n\n## Upcoming events for Thursday, October  7th\n\n - Expected earnings:\n\n  ACCD, CAG, HELE, LW, TLRY\n\n - Ex-div:\n\n  AEO, AFB, AXP, BRC, CIO, CULP, DRI, EBF, FLIC, FSFG, GD, GIS, GNTX, HBNC, ISAA, LGI, LMNR, LNC, LOAN, MA, MMC, MRVL, NTAP, SGA, T, TD, TOL, TTEC, UDR, UVV, WSBF\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.040%)\n    - Challenger Job Cuts (previous: 15.723K)\n    - Consumer Credit (consensus: 17.50B, previous: 17.00B)\n    - Continuing Jobless Claims (consensus: 2,780K, previous: 2,802K)\n    - FOMC Member Williams Speaks\n    - Initial Jobless Claims (consensus: 348K, previous: 362K)\n    - Jobless Claims 4-Week Avg. (previous: 340.00K)\n    - Natural Gas Storage (previous: 88B)\n\n^^^^2021-10-04",
        "created_utc": 1633341614,
        "id": "hfc0z6i",
        "score": 0,
        "subreddit": "RobinHood",
        "created": 1633370414.0
    },
    {
        "author": "Due-Cryptographer",
        "body": "Firm's market cap climbing to $1 trillion\n\nOne trillion dollars.  \nThat's how much at least one analyst believes Cisco Systems Inc. will be worth in a few years--and you'd be hard pressed to find anyone to disagree.  \nThe San Jose-based networking behemoth's stock closed March 14 at $131.75 a share, slightly down from its March 10 one-year high of $141.88 (The entire Nasdaq slid 4 percent on March 14.)  \nThirty-seven investment banks recommend either a \"buy\" or a \"strong buy.\" None recommend a \"sell\" or even a \"hold.\"  \nOn any given day the volume of Cisco shares traded is the equivalent of every man, woman and child living in California--having hit 33 million as recently as March 9.  \nGeorge Kelly, an analyst with Morgan Stanley Dean Witter in New York who took Cisco public a decade ago, is one of the Cisco bulls. Cisco's stock is trading at roughly 120 times Mr. Kelly's earnings' estimate of $1.13 per share.  \nThe multiple, or price-to-earnings ratio, is a number that places a value on a stock. It is a ratio of the price of the stock to the profit of a company expressed per shares outstanding.  \n\"A low P/E usually signals investors are uncomfortable,\" Mr. Kelly said.  \nAs a reference, in 2000 Cisco's multiple of 120 compares to Microsoft Corp.'s multiple of 55 and Intel Corp.'s multiple of 42. Yet their values are below Cisco.  \n\"One of the reasons investors value Cisco so highly right now is that, unlike Microsoft, Cisco doesn't have the uncertainty of a Justice Department settlement--it's a much cleaner situation,\" Mr. Kelly said. \"Second, Cisco has had a tremendous track record of continuous upside surprises. And Cisco is viewed as opening several new markets, the biggest of which is optical, which is expected to be an explosive market.\"  \nPerfect returns  \nPaul Weinstein, an analyst with Credit Suisse First Boston, believes a $1 trillion market capitalization (stock price multiplied by shares outstanding) is within reach in a few years. He said Cisco's stock has increased 1,000 times, a perfect 100 percent annual return since it launched its IPO in 1990.  \n\"We humbly submit that over the next two to three years, Cisco could be the first trillion dollar market cap company--and don't think they wouldn't love it,\" Mr. Weinstein wrote in his \"strong buy\" recommendation.  \nAs of March 14, Microsoft's market cap stood about $510 billion, compared with Cisco's $465 billion, which is threefold the annual revenue of the state of California.  \nMichael Neiberg, lead analyst in the communications equipment sector for Chase Hambrecht &amp; Quist in New York, said Cisco is turning a lot of investors long-term.  \nRecommended  \nTechnology  \nRedwood City-based Jasper Therapeutics drops nearly 19% in Wall Street debut  \nTechnology  \nIonQ sets sights on new growth targets after going public  \nTechnology  \nTesla is launching a lottery with a $10,000 prize to encourage workers to be vaccinated against Covid-19  \n\"If you had picked a price point to sell \\[high\\] at anytime in the past 10 years, you would have been wrong,\" he said. \"They have such an impressive track record of growing ... that the financial community isn't thinking in terms of a multiple of what they're earning this year, but what they will be earning three or four years down the line.\"  \nAn opposing view  \nThere are market watchers that are dubious, however, about the high valuation assigned to a large-cap company like Cisco.  \nJeremy Siegel, a finance professor at the Wharton School, wrote this week in The Wall Street Journal that the high valuation assigned to large-cap technology stocks--Cisco is at the top of his list--are unsustainable.  \n\"History has shown that whenever companies, no matter how great, get priced above 50 to 60 times earnings, buyer beware,\" Mr. Siegel wrote.  \nHis statistical research concludes when companies reach big-cap status--ranked in the top 50 by market capitalization--their ability to generate long-term double-digit growth slows dramatically.  \nYoung bucks in a different field  \nLooking at multiples of high-flying valley gazelles that compete with Cisco is almost meaningless.  \nTake Juniper Networks Inc. The firm has rapidly gained a 15 percent market share in the high-end routing market, cracking a lucrative niche dominated by Cisco.  \nJuniper posted its first profit for the fourth quarter of 1999 of 3 cents per share. Extrapolating that performance out to a 12-month period would conservatively give the company a profit of 12 cents per share. But with its stock price closing March 14 at $245 a share, the upstart company can boast a P/E ratio of 2,042.  \nIs its stock more valuable than Cisco's? In a word, yes. At least Wall Street believes so.  \nBut both Messrs. Neiberg and Kelly note that what Wall Street is valuing is relatively short-term growth--the explosiveness of these new valley firms.  \n\"For the early adopters and early movers, Wall Street is willing to assign these values,\" Mr. Neiberg said.  \nBut he added that what Wall Street is betting on is extremely rapid growth for a year or two. As the rapid growth slows, the multiples will fall into a more earthly range.  \nComparing P/E ratios of other industry giants in different technology spaces may be tempting to investors, but Mr. Neiberg is wary of mixing two different dynamics.  \n\"Both \\[Microsoft and Intel\\] are benefiting from the PC revolution,\" Mr. Neiberg said. \"But they are in a much more moderate growth phase. The more rapid growth is to interconnect all those computers, and Cisco is the standard bearer for all that interconnection.\"  \nYou can reach Mr. Taylor at dtaylor@amcity.com.",
        "created_utc": 1633220957,
        "id": "hf5xxyf",
        "score": -5,
        "subreddit": "wallstreetbets",
        "created": 1633249757.0
    },
    {
        "author": "DoDaOpposite",
        "body": "Why not just hold XLK if you want that much exposure to mega tech stocks?  And since you \"know\" those companies will go up long term, dont bother reading below.  I only post it for others that may not be so.... arrogant.\n\n\"Among the largest 15 companies in the index ( they are talking NASDAQ ) back in 2000, only four remain in the top 15 today: Microsoft, Cisco, Intel and Qualcomm.\n\nOver the entire 781-week period, only Qualcomm and Microsoft stocks had   \npositive returns -- up 1.54% and 1.34% annually, respectively. Cisco's   \nstock had a cumulative return of -52.5% (-4.8% annually) and Intel was   \ndown 24.63% (-1.9% annually).\"",
        "created_utc": 1633218104,
        "id": "hf5rncx",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633246904.0
    },
    {
        "author": "InnocentAnthro",
        "body": "Tesla is supply constrained - meanwhile other companies in the market have *spare* or *convertible capacity.* This will be an issue in keeping market share. \n\nBesides, you're missing my point. It doesn't matter whether Tesla had a bright future, I never denied that they have effective tech, an effective product and solid manufacturing potential. Tesla isn't going to collapse as a business. However, you can have great companies which are massively over-valued (think Cisco in dot-com era) and Tesla is one of these companies.\n\nTesla's current valuation doesn't make sense. In terms of EVs, VW is just a few % points behind Tesla in global market share (and has an equally bright future in this market) but is valued at 1/6 the value **despite having extensive market share in ICE markets**. That is absurd, Tesla made $31.5bn in revenue in 2020 whereas VW made $258bn in 2020. Fundamentally, the current valuation of Tesla is wrong. That's the problem with Tesla.",
        "created_utc": 1633087709,
        "id": "heyon4x",
        "score": 1,
        "subreddit": "investing",
        "created": 1633116509.0
    },
    {
        "author": "Foman1231",
        "body": "Buys on CSCO 30C for January approaching $100 million today. Volume nearing 40,000 calls just at that strike.",
        "created_utc": 1633111352,
        "id": "hf02ost",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633140152.0
    },
    {
        "author": "ScreamingBuy1962",
        "body": "Make it slow and steady instead of trying to make a fortune overnight.  I am 59 and when I was in my twenties I was paying off student loans while putting what was left in options trading.  I made what felt like a small fortune in Csco options before I lost big. \n\nI stopped trading options in 1995 and starting gradually building up a stock portfolio.  When the IPhone came out I was I intrigued about the new  Apple. When I was at an awards dinner I saw my first sergeant watching a live basketball game on his iPhone—holy cow!  I bought 400 shares the next day, I think it was trading around 40 bucks a share in early 2007. That $16,000 appl investment is worth $2.25m today.   Own it don’t trade as Jim Crammer would say.",
        "created_utc": 1633131939,
        "id": "hf1b4zw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633160739.0
    }
]