[
    {
        "author": "KeepItcool_567",
        "body": "\nI put them in the same order of my list I posted before:\n\n1) Nikola, XPENG, Tesla, Plug Power, Ballard, Bloom Energy, BYD ADR, Nio, A10 Network.\n\n2) C3 Ai, iRobot, JD.com, Twilio, Splunk, Tebcent ADR, Salesforce.com, NVIDIA.\n\n3) Crowdstrike Holdings, Cloudflare, Check Point Software.\n\n4) Coinbase. (For now I have one item in my list, this company is going public this year, so I'm looking forward to getting it).",
        "created_utc": 1612168117,
        "id": "glktove",
        "score": 2,
        "subreddit": "investing",
        "created": 1612196917.0
    },
    {
        "author": "FearlessTrader",
        "body": "This is what I’m talking about!\n\nNVDA PINS SQ ADBE TSLA to the 🌙 and beyond 🪐",
        "created_utc": 1612167204,
        "id": "glksli5",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1612196004.0
    },
    {
        "author": "SasquatchTitties",
        "body": "I agree.\n\nPeople here keep brining up the \"value\" of the company while completely overlooking what is actually happening in the marketplace. Between the limit on buying stocks and hedge funds trading between themselves to drive the price down, and creating a distraction (SLV) to draw attention and fill pockets, this should be throwing off a significantly larger red flag than \"ERMERGERD WSB SAYS GME WORTH $69,420 LOOL\". Who gives a shit, you're completely missing the point here. Short sellers expose themselves to basically unlimited risk. But that risk never actually materializes for them because they can just cheat the system. Meanwhile someone can go buy a stock and lose value because of *their* game OR someone can go short a stock and become insolvent while the *big boys on WallStreet* walk away.\n\nGME isn't an isolated incident. BB, NOK, AMC and a number of others are getting hammered- and have been getting hammered since last Wednesday because the people on the losing side don't want to lose at the game they created for themselves. BB basically experienced a rug pull- it didn't taper off or settle in the 20's... it looks like someone pulled a plug. Look at what happened a month ago (or more) with PLTR and Shitron. Tesla, Microsoft, Apple, Nvidia... AMD have all been recent targets of this institutional wide short selling.",
        "created_utc": 1612291325,
        "id": "glrizwt",
        "score": 186,
        "subreddit": "stocks",
        "created": 1612320125.0
    },
    {
        "author": "Cptn_Canada",
        "body": "Or the appl. Or the nvda phase. Or the su bae AMD phase. Op is a new clown.",
        "created_utc": 1613008134,
        "id": "gmw1cbe",
        "score": 96,
        "subreddit": "wallstreetbets",
        "created": 1613036934.0
    },
    {
        "author": "korbnala",
        "body": "I actually work for a VAR/Reseller right now, and while it's true that hardware isn't the goldmine (all the margin is in software and accessories - but basically Software/SAAS) - there is *plenty* of margin in hardware - not to mention, the service charge for pre-building said gaming PC's. GME could theoretically score 8-15 points of margin on customized hardware, and still be selling at a discount.\n\nIf they score some partnerships with say, NVIDIA or AMD, that just helps the profit even further, if they are selling at a high enough rate. Companies tend to give 5-10 extra points discounting to their sellers if their order stream is consistent and high enough.\n\nI like the stock at $50, I think it's a steal, but I don't think there is any one silver bullet here.",
        "created_utc": 1613249263,
        "id": "gnaca53",
        "score": 62,
        "subreddit": "wallstreetbets",
        "created": 1613278063.0
    },
    {
        "author": "GushingGranny1",
        "body": "*\\*\\*\\*Disclosure: I have roughly $30,000 invested in AMD so my opinion might be biased.* \n\nPersonally, I think it is a great time if any to invest in AMD. Main reason why is that recently the stock saw a dip from the 100 down to the mid 80s level mostly due to hedge funds deleveraging because of the whole GME fiasco so you are buying it at a discount in my opinion. \n\nAnother reason why is that AMD is a classic turnaround story. It wasn't too long ago that the company was on the verge of bankruptcy due to failing product lines, but now it has CPUs that can rival and even outperform Intel and the specs for their GPUs shows they can actually go foot to foot with Nvidia. \n\nAlso, keep in mind that the market for CPUs and GPUs are still growing so I don't really expect a deceleration of the company's revenue growth. \n\nLastly, keep in mind that the Gov is still doing QE infinity, that and the trillions of stimulus they are gonna give out this year means it is a perfect environment for risk assets, so don't overthink it.",
        "created_utc": 1612198776,
        "id": "glmbllg",
        "score": 61,
        "subreddit": "investing",
        "created": 1612227576.0
    },
    {
        "author": "TJGaming5_",
        "body": "(Don't have enough karma to post so)\n\nFORGET HOLD; instead, BUY THE DIP. Here's why:\n\nGameStop just went through a massive undershoot and it's about to cycle back up or at least reach equilibrium with higher potential growth. \n\nBack in October, Microsoft announced a partnership with GameStop (this is important because of the XBOX market as prices for consoles start to return to normal with increased production of both the units and competitive GPUs by AMD and NVIDIA. \n\nThen there's GME's new executive appointments with a Chief Officer from Amazon AWS; this is in addition to their campaign for an E-Commerce transformation. \n\nAnd now onto technicals of the stock, Robinhood's class action lawsuits are coming together, short position volume is dying out, and we just saw the first green moves after that corrupt scam by Wall Street. \n\nTalking about indicators, RSI is low as hell, Schaff is on the verge of breaking 25, Ichimoku and short and long SMAs and EMAs are catching up, and MACD is converging for a cross at its bottom out level, so the room for growth is incredible and the push is around the corner. \n\nAll it needs is one burst of buy orders in the next couple days without Wall Street's short volume and the 8.4 million degenerates WSB can be in control again. This is without even mentioning social media influence now that everyone's eyes are on the stock.\n\n&amp;#x200B;\n\n[GameStop Execs sit on $1.3 billion gains](https://www.bloomberg.com/news/articles/2021-01-29/gamestop-executives-sit-on-1-3-billion-gain-from-trading-frenzy)\n\n[GameStop appoints new execs for Transformation](https://www.globenewswire.com/news-release/2021/02/03/2169124/0/en/GameStop-Appoints-Chief-Technology-Officer.html)\n\n[GME Short Interest by Volume](https://www.marketbeat.com/stocks/NYSE/GME/short-interest/)\n\n[GameStop announces multi-year partnership with Microsoft](https://news.gamestop.com/news-releases/news-release-details/gamestop-announces-multi-year-strategic-partnership-microsoft)",
        "created_utc": 1612372869,
        "id": "glvspvr",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1612401669.0
    },
    {
        "author": "iPokeMango",
        "body": "Pump and dumps via Reddit has been running rampant. A few PnDs to be aware of is the entire weed business. It was hyped for legalization in Canada. After legalizing, we learned they still can’t make a profit.\n\n\nCorsair is another stock being pumped. Pumpers call them a chip maker (which they are not) and compares them to Nvidia and AMD. LOL. \n\n\nThen there’s the BANG WSB index which this subreddit doesn’t even allow the keywords to be typed. Lazy ass mods.",
        "created_utc": 1613321508,
        "id": "gnfo2cl",
        "score": 44,
        "subreddit": "investing",
        "created": 1613350308.0
    },
    {
        "author": "0toHeroInvesting",
        "body": "Competitive pressure... they have to keep innovating... they have to continue to grow market share... compete with INTC, NVDA etc.\n\nOther additional reasons may include some better opportunities of growth if that is what you are looking for, though they might involve more risks",
        "created_utc": 1612273087,
        "id": "glq7uw2",
        "score": 37,
        "subreddit": "stocks",
        "created": 1612301887.0
    },
    {
        "author": "Jacob1235_S",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nEdit: i am not a financial professional...i don't lose enough money to be considered one yet",
        "created_utc": 1613761256,
        "id": "go1br9s",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1613790056.0
    },
    {
        "author": "therealPhloton",
        "body": "GME - 2k to 148k.\n\nOther than that, buy and holds (still holding) NFLX, NVDA, and ROKU. All 600+%.",
        "created_utc": 1612973114,
        "id": "gmtuk65",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1613001914.0
    },
    {
        "author": "billwaters",
        "body": "See the screenshot, all mainly due to NVDA put credit spreads",
        "created_utc": 1612310344,
        "id": "glste6o",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1612339144.0
    },
    {
        "author": "iesou",
        "body": "I am long and shorting these.\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613760402,
        "id": "go19t6s",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1613789202.0
    },
    {
        "author": "Any_Situation_3005",
        "body": "I disagree with you. My picks are\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS\n\nThis isn't financial advice",
        "created_utc": 1613758641,
        "id": "go15tji",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1613787441.0
    },
    {
        "author": "stereoeraser",
        "body": "50% were in TSLA, NVDA, SQ, NFLX in the last 2 years.\n\nThis year I’m exiting TSLA betting more on NVDA and SQ, REITs and commercial banks.\n\nThoughts?",
        "created_utc": 1612989970,
        "id": "gmuyjug",
        "score": 29,
        "subreddit": "investing",
        "created": 1613018770.0
    },
    {
        "author": "GundiScheme",
        "body": "I got in around $40 and I am holding with my fingers crossed. It seems like they are competitive with NVIDIA and NVIDA's stock price is insane. Intel has made too many mis-steps and they have a lot of dead wood stifling innovation. So I think AMD is a good way to invest in this space...try to get in as low as you can good luck",
        "created_utc": 1612196324,
        "id": "glm5b2s",
        "score": 27,
        "subreddit": "investing",
        "created": 1612225124.0
    },
    {
        "author": "Offduty_shill",
        "body": "I mean that's the thing with these pumps - if the company had actual value you wouldn't need to tell at people to buy it everyday. \n\nI have large positions in NVDA, U, and TSLA but you don't see me yelling at people to \"hold the line\" every time they dip. Why? Cause I know these securities have value that any investor can see and I don't need to convince them to buy in with some get rich quick schemes.\n\nWhat happens when most of your investors are in for a quick buck and don't actually believe in the business too, is that they're quick to bail out for a profit because they were never in it for the long term. And that's exactly what happened to GME, people saw a company's stock jump to ridiculous valuation thanks to a short squeeze and took profits. \n\nNo short ladder attacks or whatever other stupid conspiracy you want to bring up. If I bought GME at 20 wtf would I not sell at 300? Even if I thought it could keep running I'd still sell a decent portion of my position to secure profits.",
        "created_utc": 1612979463,
        "id": "gmu9k0f",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1613008263.0
    },
    {
        "author": "Secret_Notice",
        "body": "Meh... Huge fan of Nvidia. But it's really high right now. And they're a lot of problems getting these new chips out and sketchy ARMs details. I moved away from Nvidia and took a win. Bought AMD instead. But... I will buy again if I see a nice entry point. Prob somewhere in the high 400's.",
        "created_utc": 1612199367,
        "id": "glmd3uu",
        "score": 24,
        "subreddit": "investing",
        "created": 1612228167.0
    },
    {
        "author": "rando604",
        "body": "It wasn't really a surprise that their earnings were what they were. Do not let the gme hysteria get to you, amd has a real opportunity to steal some market share from Nvidia, give it time. Amd is a long term hold (for me).",
        "created_utc": 1612283482,
        "id": "glqyjqz",
        "score": 23,
        "subreddit": "stocks",
        "created": 1612312282.0
    },
    {
        "author": "tentdoor",
        "body": "There's a lot of market share that AMD doesn't cover. I'm not an expert on stonks but I work with computers all day. Nvidia rules at deep learning and 3D rendering. There's nothing else to beat it. CUDA is king.",
        "created_utc": 1612975615,
        "id": "gmu0fpb",
        "score": 21,
        "subreddit": "stocks",
        "created": 1613004415.0
    },
    {
        "author": "Slyric_",
        "body": "Wow you’re looking at those? I’m looking at them too! Here’s my portfolio: \n\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\nEdit: i am not a financial expert I’m just a retard sitting at computer",
        "created_utc": 1613760284,
        "id": "go19jmb",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1613789084.0
    },
    {
        "author": "CurveAhead69",
        "body": "So, technology that drastically improves existing cells. They never claimed they make the cells.    \n     \nIt’s like saying “I won’t buy this awesome laptop from company XYZ with the amazing cooler that massively improves graphics performance because the gpu is actually nvidia”. 🤦‍♂️.  \n    \n- Higher battery life.  \n- Faster charging.  \n- Extra safety.    \nIt’s a great update within HYLN’s scope.",
        "created_utc": 1613081338,
        "id": "gmzo3rm",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1613110138.0
    },
    {
        "author": "StopDeleteMyAccount",
        "body": "I think you underestimated the importance of TSMC. Just think about how many things today's use chips, TVs, cars, computer, data center, phones, cameras. About half of them are from TSMC (based on market share). Now apply the current auto ICs shortage to every sector. That's what will happen if China invades Taiwan. We are not going to see a collapse of TSM, we are going to see a Great Depression. I dont think the western powers will allow that to happen.\n\nAlso the fact that TSMC is the largest fab and has the most capacity but is still at full capacity tells you the world needs IC. Apple, AMD along takes away so much of their 5nm and 7nm slot already. The fact that Nvidia didn't produce their rtx3000s in TSMC is actually bullish because TSMC couldn't care less about it to lower its price to compete with Samsung. \n\nOn the topic of Samsung, their fab is the only threat to TSMC. However, it has been shown from time to time that TSMC process is better, in terms of performance and power. Apple once used both TSMC and Samsung to produce one of their iPhone processor. You can Google the result, but basically TSMC wins in every metrics.\n\nIntel on the other hand, is a closed fab meaning they do not produce chips for other companies. They only make their own stuff. So even they figure out their 7nm, it is not a threat to TSMC. On top of that there is no capacity in TSMC for Intel (said TSMC). \n\nThere are many other fabs in Taiwan outside of TSMC. And they are all getting the benefit from TSMC being at full capacity. It will be interesting to see if they can take all those orders in and grow or TSMC will increase its capacity faster.\n\nOther ealier concern is China. It is spending a lot of resources in chip manufacturing. However, this is no long a issue because of US sanctions. ASML and other key equipment manufacturers are not allowed or limited to sell to China. This basically put a chock hold on Chinese fans. Unless they can develop their own equipment, there is no chance for them to catch up to Samsung or TSMC.\n\n\nThis is my two cents. I'm increasing my holdings whenever I can on a 2~3% dip day. I don't see any competition in the next 5~10 years minimum.\n\n\nTLDR: This world need ICs. TSMC has 55% share in it. So you want in then buy TSMC. This is not going to fall into the hand of China, or there will be greater concern than TSMC share price.",
        "created_utc": 1612203617,
        "id": "glmo5xr",
        "score": 20,
        "subreddit": "investing",
        "created": 1612232417.0
    },
    {
        "author": "inomooshekki",
        "body": "Holy shit. Everything except Nvidia dropped like crazy. This is god sent signal. Buy everything.\n\nJk\n\nBuy gamestonk you fucktards",
        "created_utc": 1612970539,
        "id": "gmtom8j",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1612999339.0
    },
    {
        "author": "SPCE_VIRGIN",
        "body": "If you’re scared of TSLA, then go invest in AMD or NVDA. We will always need semiconductors for all things tech",
        "created_utc": 1613337944,
        "id": "gngufwe",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1613366744.0
    },
    {
        "author": "RollingDoingGreat",
        "body": "Maybe he’s retarded and meant to play NVDA",
        "created_utc": 1612974729,
        "id": "gmtycbx",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1613003529.0
    },
    {
        "author": "Any_Situation_3005",
        "body": "I disagree with you. My picks are\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS\n\nThis isn't financial advice",
        "created_utc": 1613758634,
        "id": "go15sx7",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1613787434.0
    },
    {
        "author": "Rick_C-69",
        "body": "If that ARM deal goes 100% through. Nvidia is my next all in.",
        "created_utc": 1612209502,
        "id": "gln3ivg",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1612238302.0
    },
    {
        "author": "brownbrandon",
        "body": "I'm not counting the apes out yet.\n\n2 shares of GME - NVDA 550C 2/5",
        "created_utc": 1612232751,
        "id": "gloldnd",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1612261551.0
    },
    {
        "author": "bryanna_leigh",
        "body": " MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613758764,
        "id": "go163dp",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1613787564.0
    },
    {
        "author": "Dankmooo",
        "body": "Sold my 15 AMD at 89, my 7 nvda at 535 and bought GME at ~240\n\nStill holding",
        "created_utc": 1613153912,
        "id": "gn31wq3",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1613182712.0
    },
    {
        "author": "Social_History",
        "body": "AMD and NVDA are bound to double any day now right?",
        "created_utc": 1612826428,
        "id": "gmmy4dg",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1612855228.0
    },
    {
        "author": "be_o3",
        "body": "Bullish as duck on NVDA 🚀",
        "created_utc": 1613018787,
        "id": "gmwldsa",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1613047587.0
    },
    {
        "author": "RayCashIsTrashDalio",
        "body": "SoftBank buying billions in calls again. See NVDA",
        "created_utc": 1612821453,
        "id": "gmmnqac",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1612850253.0
    },
    {
        "author": "SteezySF",
        "body": "&gt;MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nThese ones are better.  MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613757771,
        "id": "go13y6e",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1613786571.0
    },
    {
        "author": "magichead17",
        "body": "Thank you Nvidia for saving me from my retarded weed fomo",
        "created_utc": 1613078981,
        "id": "gmzisse",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1613107781.0
    },
    {
        "author": "Okmanl",
        "body": "I think that the high quality semiconductor themed stocks (AMD, TSM, NVDA) are the obvious candidates to outperform index funds going forward the next 5-10 years.",
        "created_utc": 1612215942,
        "id": "glnk5wt",
        "score": 12,
        "subreddit": "investing",
        "created": 1612244742.0
    },
    {
        "author": "cricket_observer",
        "body": "What is the max I will lose? A few hundred dollars?\n\nI lost 2000 on Nvidia deep OTM options in early 2020 and lost 500 dollars on CRSR calls last month (paper hands :().\n\nIt’s nothing! I hold that GME stock certificate as an achievement!",
        "created_utc": 1612224956,
        "id": "glo4zl2",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1612253756.0
    },
    {
        "author": "bigkev2569",
        "body": "NVDA breakout happening.  Look at call volume in 2/19 700c",
        "created_utc": 1613024169,
        "id": "gmwtehz",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1613052969.0
    },
    {
        "author": "MansteinDidNoWrong",
        "body": "Getting newfags to sell naked nvda calls should be the next meme",
        "created_utc": 1612305453,
        "id": "glsiomf",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1612334253.0
    },
    {
        "author": "EzekielSMELLiott",
        "body": "Lmao hopefully they start pumping the price up for me lol I do think it is a solid long term hold though. Between their partnerships with Intel and Nvidia and their battery subscription and swap ideas I think they have the most potential of all the Chinese EV companies.",
        "created_utc": 1612297113,
        "id": "glrxr0m",
        "score": 11,
        "subreddit": "stocks",
        "created": 1612325913.0
    },
    {
        "author": "picciona4",
        "body": "Someone said buy NVDA. Bought NVDA. NVDA goes up. Yay.",
        "created_utc": 1613067389,
        "id": "gmyre6e",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1613096189.0
    },
    {
        "author": "Ragefan66",
        "body": "Am I the only one that thinks TSLA will have no one even close to them in a decade or so?\n\n \n\nNIO will never even be close to TSLA's Robotaxi and automated driving. TSLA is already light years ahead of NIO in terms of driving data, will literally take NIO more than a decade to get the same data that TSLA has RIGHT NOW...and in 10 years TSLA will legit have just a stupid amount of data about 10,000 times more data than NIO. Not only that but NIO/Ford/GM just cannot compete with TSLA in terms of robotaxi/automated driving, they'd have to partner up with NVDA to even come CLOSE to TSLA (NVDA's AI is 3 years behind TSLA's) so even then they'd be three years behind TSLA and will have to pay extra money for NVDA's partnership which will decrease their margins or make the cars far more expensive while also not being on par with TSLA.\n\n&amp;#x200B;\n\nCar companies are playing catch up to TSLA's FIRST ITERATION....And I'm not even including batteries and solar......TSLA is undervalued at these prices someone fight me.",
        "created_utc": 1613169447,
        "id": "gn3zppw",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1613198247.0
    },
    {
        "author": "Toxicsoul92",
        "body": "And Nvidia",
        "created_utc": 1612196355,
        "id": "glm5dz3",
        "score": 10,
        "subreddit": "stocks",
        "created": 1612225155.0
    },
    {
        "author": "JonathanL73",
        "body": "If AMC is still low I'll buy more. If the markets red I'll probably Tesla, Apple, Nio, or Nvidia whichever ones are the most impacted.\n\nI'll also checkout Amazon to see if there's an overreaction from Bezos stepping down.",
        "created_utc": 1612326527,
        "id": "gltq47b",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1612355327.0
    },
    {
        "author": "_mvkoto",
        "body": "i like how you think my man. here are my favorites as well:\n\n&amp;#x200B;\n\n MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613760994,
        "id": "go1b5rb",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1613789794.0
    },
    {
        "author": "JewishPride07",
        "body": "NVDA 🚀 🚀",
        "created_utc": 1613056279,
        "id": "gmy0xpt",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1613085079.0
    },
    {
        "author": "footlong24seven",
        "body": "No mentions of NVDA but the stock is up 17% since Feb 1. I thought this was a trading sub.",
        "created_utc": 1613063535,
        "id": "gmyi1sb",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1613092335.0
    },
    {
        "author": "Halizones",
        "body": "Upcoming earnings:\n\n2/16 - PLTR\n\n2/17 - SHOP, BIDU, FSLY, MELI, NVTA, TWLO\n\n2/18 - FVRR, WMT, AMAT, FSLR, ROKU, TTD\n\n2/22 - CVAC\n\n2/23 - SQ\n\n2/24 - CRSP, JMIA, BILI, DDD, NVDA, RDFN, TDOC, VIAC\n\n2/25 - BUD, CROX, LI, NTLA, W, ABNB, BYND, CRM, DASH, DELL, ETSY, FSLR, RUN, SPCE, VLDR, VMW, ZS\n\n2/26 - DKNG",
        "created_utc": 1613144987,
        "id": "gn2hht7",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1613173787.0
    },
    {
        "author": "BobbyStokah",
        "body": "Loaded to the tits in MARA PLTR CRSR NVDA BABA UBER SNDL XPEV QS calls this week. Fingers crossed I make another 100k 🤞",
        "created_utc": 1613361749,
        "id": "gni0te1",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1613390549.0
    },
    {
        "author": "v1nzy",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nEdit: i am not a financial professional...i don't lose enough money to be considered one yet",
        "created_utc": 1613760942,
        "id": "go1b1ki",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1613789742.0
    },
    {
        "author": "NaNaNaNaNaNaNaNaNa65",
        "body": "Nvidia was truly the long term and don’t get fucked by pump and dumpers  play this week",
        "created_utc": 1613100693,
        "id": "gn0q7dz",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1613129493.0
    },
    {
        "author": "pizzabaconspagheti",
        "body": "Mama Cathie loading up on NVDA 😳",
        "created_utc": 1612224619,
        "id": "glo49uz",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1612253419.0
    },
    {
        "author": "stupidimagehack",
        "body": "I expanded by AMC and GME positions by 10% today. Will continue growing them slowly. \n\nTheaters will lead the return to normalcy in the US and globally. GME will transform into something better than Chewy. \n\nAnd that’s without a squeeze. It’s not today it’s about the future. Same as TSLA, NVDA, AMD.\n\nI had two crayons for lunch. \n\nThank you for reinforcing my thesis Mark Cuban.   Gold star.",
        "created_utc": 1612291682,
        "id": "glrjws7",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1612320482.0
    },
    {
        "author": "kk7766",
        "body": "Sold NVDA puts for 300% gain. That was easy",
        "created_utc": 1613154573,
        "id": "gn33fer",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613183373.0
    },
    {
        "author": "BluePuts",
        "body": "I asked my dad he works at the FBI CIA Miami CDC FDC BBC and he told me the NVDA ARM deal will get approved no problem",
        "created_utc": 1613253286,
        "id": "gnashv2",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613282086.0
    },
    {
        "author": "FearlessTrader",
        "body": "PLTR FUBO NVDA AAPL to the 🌙 actually no! To 🪐 \n\n🚀 🚀 🚀 🚀",
        "created_utc": 1613688120,
        "id": "gnxwgm3",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613716920.0
    },
    {
        "author": "ballarak",
        "body": "US semiconductor companies. Doesn't matter which one, Intel, amd, Nvidia, whatever. \n\nMassive chip shortage ongoing right now, and Biden is set to pass an executive order aimed at helping the semiconductor industry.\n\nHe's also indicated that after COVID relief, that funding to build chip fabs in the US will be part of the infrastructure bill.",
        "created_utc": 1613066634,
        "id": "gmyple9",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613095434.0
    },
    {
        "author": "Cygopat",
        "body": "Today's the day NVDA is breaking out of the 500 prison",
        "created_utc": 1613045637,
        "id": "gmxhpt9",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613074437.0
    },
    {
        "author": "Halizones",
        "body": "Wtf, someone bought 5m worth of NVDA 2/19 700c’s. 44k volume with 3k oi",
        "created_utc": 1612990354,
        "id": "gmuzg1g",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613019154.0
    },
    {
        "author": "BasedPotatoes",
        "body": "25k into $NVDA 3/5 612c. Pray for me lads",
        "created_utc": 1613166634,
        "id": "gn3tv3e",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613195434.0
    },
    {
        "author": "Jacob1235_S",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nEdit: i am not a financial professional...i don't lose enough money to be considered one yet",
        "created_utc": 1613761249,
        "id": "go1bqnm",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613790049.0
    },
    {
        "author": "bring_me_a_samich",
        "body": "So I agree with a lot of your pics. These though I have doubts about:\n\nDVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY",
        "created_utc": 1613760940,
        "id": "go1b1f3",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613789740.0
    },
    {
        "author": "pinks0cking",
        "body": "nvda puts... why....",
        "created_utc": 1613080982,
        "id": "gmznbuk",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613109782.0
    },
    {
        "author": "Visible_Antelope5010",
        "body": "FOMO gonna build up over the weekend, we PRINTING ON TUESDAY\n\nNext week's moons:\n\nthat must-not-be-named: RIOT,MARA, dat CRYPT0\n\nSemiconductors: SOXL , AMD, ON, TMC, NVDA\n\nWeed: Small cumback\n\nEVs again  😂",
        "created_utc": 1613184562,
        "id": "gn4rpew",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613213362.0
    },
    {
        "author": "LMY723",
        "body": "if you didnt literally sell your children to buy more nvda idk what to say",
        "created_utc": 1612813919,
        "id": "gmm736p",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1612842719.0
    },
    {
        "author": "johnwithcheese",
        "body": "I don’t know about that man. Here’s some of my favourite stocks me and my wife’s boyfriend invest in\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nEdit: i am not a financial advisor, i’ve only lost my net worth and only ever seen red",
        "created_utc": 1613761429,
        "id": "go1c5c4",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1613790229.0
    },
    {
        "author": "be_o3",
        "body": "Where are my NVDA bros",
        "created_utc": 1613157447,
        "id": "gn39xpu",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613186247.0
    },
    {
        "author": "crawford89",
        "body": "Imma let you finish, but these stocks are the ones that could be the best of all time maybe! Best of all time maybe kinda sorta!\n\nThese ones: MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613760207,
        "id": "go19dc3",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613789007.0
    },
    {
        "author": "Cygopat",
        "body": "holy fuck NVDA $599 this is it",
        "created_utc": 1613037902,
        "id": "gmx8xoc",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613066702.0
    },
    {
        "author": "magichead17",
        "body": "No talk about this Nvidia rip to 600",
        "created_utc": 1613038924,
        "id": "gmxa0we",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613067724.0
    },
    {
        "author": "geomanis",
        "body": "Hey friends, moves tomorrow:\n\nBUY: Facebook &gt; Company has had so much negative press but still literally prints money, and if we great EC's from other big tech I figure this'll moon too. Also, if they get split up by anti-trust, then that'll end up being bullish as all 4 major components of Facebook are individually better companies separated than together.\n\nBUY: Nvidia &gt; Crypto, Data Analysis, Gaming, etc require dedicated processing machines or boards. Figure Nvidia is a leader in design here and charges quite a premium, so big room for growth as decentralised finance kicks on, people do more bigdata or \"AI\" stuff and gaming (outside retail shops) gets bigger.\n\nBUY: JPM &gt; Figure that with all the idiot silver activity, good time to buy a company that has exposure to it, but otherwise has strong fundamentals and dividends.\n\nBUY: TLRY / APHA &gt; Going further into Weed stocks after they drop down from the 20% run up.\n\nHOLD: Meme stocks &gt; BB/Nok fundamentals haven't changed just valuation, GME is my Capital Gains Tax write-off for this FY and holding until just before FY finishes. :)",
        "created_utc": 1612332721,
        "id": "glu06ql",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1612361521.0
    },
    {
        "author": "tossserouttt3483726",
        "body": "Weird all year they lost market share and were getting crushed by nvidia and amd?  All gaming comps booted intel. Staying far away from this dead boomer stock",
        "created_utc": 1613336848,
        "id": "gngsbxw",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613365648.0
    },
    {
        "author": "jameskwonlee",
        "body": "Buyden administration will work with overseas manufacturers (TSM, KLIC) and domestic companies (AMD, NVDA, INTC) to address chip shortage.",
        "created_utc": 1613068844,
        "id": "gmyuveu",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613097644.0
    },
    {
        "author": "HazyClown",
        "body": "Where’s my fellow NVDA gang at??",
        "created_utc": 1613079800,
        "id": "gmzkorb",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613108600.0
    },
    {
        "author": "cricket_observer",
        "body": "NVDA is a monster, shouldn’t have sold it honestly. Maybe time to get back in.",
        "created_utc": 1613157616,
        "id": "gn3aawv",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613186416.0
    },
    {
        "author": "sbebgbsthfw-rhhhte",
        "body": "AMD AND NVIDIA ARE THE NEXT TENDIES THEN BAGGIES",
        "created_utc": 1613110479,
        "id": "gn164jz",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613139279.0
    },
    {
        "author": "Cattaphract",
        "body": "20%-30% isnt that hard the past years if you only bought the running tech stocks like AMD, Apple, Nvidia and co.",
        "created_utc": 1613332431,
        "id": "gngjn9o",
        "score": 8,
        "subreddit": "stocks",
        "created": 1613361231.0
    },
    {
        "author": "be_o3",
        "body": "My girl Cathie Wood and I have been betting on the same horses and it works get on board ppl NVDA is next",
        "created_utc": 1612996224,
        "id": "gmvd15i",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613025024.0
    },
    {
        "author": "spliffykillah",
        "body": "The real squeeze is the chip shortage $AMD $TSM $NVDA",
        "created_utc": 1612808264,
        "id": "gmluds3",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1612837064.0
    },
    {
        "author": "LMY723",
        "body": "You should probably buy NVDA.",
        "created_utc": 1612809412,
        "id": "gmlwzf3",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1612838212.0
    },
    {
        "author": "Parliament--",
        "body": "NOK, BB, NVDA calls to the fucking moon. im buying leaps so i can set and forget.",
        "created_utc": 1612826817,
        "id": "gmmyw8p",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1612855617.0
    },
    {
        "author": "Lord_Python_Of_WSB",
        "body": "Yeah exactly you dummy, you are the one claiming number of shares matter. Go read your own post, did you miss the part where I said \" what YOU are saying is the same as \" followed by amd and nvda share price example \n\nYou are saying if two companies have the same marketcap, its much harder to move the company that has higher number of shares\n\nHence I called your comment a retarded myth",
        "created_utc": 1612227630,
        "id": "gloan3h",
        "score": 8,
        "subreddit": "stocks",
        "created": 1612256430.0
    },
    {
        "author": "NEW_JERSEY_PATRIOT",
        "body": "&gt;FUCK YOU BOTS\n\n\nBUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING BUYING SELLING \nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613757496,
        "id": "go13cei",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1613786296.0
    },
    {
        "author": "Todders8787",
        "body": "obligatory GME to the moon statement,\n\n&amp;#x200B;\n\nbut also.   this will probably get lost in everything on this thread but I'm also dropping a lot into Nvidia.  bought in a couple years ago and they haven't done me wrong since.  i just like GPUs and playing video games.",
        "created_utc": 1612364587,
        "id": "glv8l1r",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1612393387.0
    },
    {
        "author": "thelandonblock",
        "body": "Doubled down on AAPL and NIO and bought into NVDA. Let’s see how this works out🚀",
        "created_utc": 1613688268,
        "id": "gnxwrxm",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613717068.0
    },
    {
        "author": "TeddyYolos",
        "body": "Apple and Microsoft, Intel’s largest clients, literally came out and said they will make their own chips instead of using Intel. \n\nNvidia, AMD, TSMC are the future. Intel is for Boomers. \n\nThe future is now old dog. \n\n🚀🚀🚀",
        "created_utc": 1613352683,
        "id": "gnhl1ny",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613381483.0
    },
    {
        "author": "BobbyStokah",
        "body": "Have MARA PLTR CRSR NVDA BABA UBER SNDL XPEV QS calls this week feel good about all of them",
        "created_utc": 1613331160,
        "id": "gngh507",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613359960.0
    },
    {
        "author": "arkansas_elk",
        "body": "NVDA and TLRY gains are gonna be far af babyyyy",
        "created_utc": 1613042137,
        "id": "gmxdhh9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613070937.0
    },
    {
        "author": "Varangian-guard",
        "body": "NVIDIA work with self driving car technology is going to fuel the next stage of their growth. As an example.",
        "created_utc": 1612977353,
        "id": "gmu4j27",
        "score": 7,
        "subreddit": "stocks",
        "created": 1613006153.0
    },
    {
        "author": "braamdepace",
        "body": "Everyone is watching weed no one is watching NVDA breakout",
        "created_utc": 1612976214,
        "id": "gmu1v9a",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613005014.0
    },
    {
        "author": "Serrot69",
        "body": "If you want “safe” companies that also provide some growth, look at things like: Apple, Microsoft, Visa, Nvidia, Amazon, etc. \n\nOr you can invest on ETFs and not worry about stock picking: S&amp;P, a tech index fund, mid cap index fund, etc.",
        "created_utc": 1612219161,
        "id": "glnrx8d",
        "score": 7,
        "subreddit": "stocks",
        "created": 1612247961.0
    },
    {
        "author": "kriptonicx",
        "body": "I think it really depends on your time horizon. Short-term investors are mostly focused on the ARM deal and bad news there could see it ~10% down quite easily. That said, NVDA is one of my largest positions just because I think it's well positioned for long-term growth. Stocks like NFLX, AMZN and NVDA have been expensive for a long time, but they're also consistent growth stories with a proven track record for their valuations. There are growth names that are a little safer if this is a 6-12 month play, but long-term I can't see you going wrong with NVDA.",
        "created_utc": 1612202043,
        "id": "glmk1qb",
        "score": 7,
        "subreddit": "investing",
        "created": 1612230843.0
    },
    {
        "author": "Afraid-Historian-937",
        "body": "NVIDIA is building their AI self-driving software on top of QNX\n\n[source Blackberry QNX YouTube](https://youtu.be/-9iggiTTbC8)",
        "created_utc": 1612232403,
        "id": "gloknly",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1612261203.0
    },
    {
        "author": "UselessPresent",
        "body": "My nvidia $600 calls aren’t looking too retarded anymore.",
        "created_utc": 1612825386,
        "id": "gmmw12w",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1612854186.0
    },
    {
        "author": "bigtimetimmyjim22",
        "body": "NVDA has been lagging for a few months, just catching up.",
        "created_utc": 1612977321,
        "id": "gmu4gfy",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1613006121.0
    },
    {
        "author": "ChronoZaga",
        "body": "So from what I understand, which is marginal at best...  AMD, Nvidia, etc need TSMC, Samsung, or ON to fabricate their chips.  Because AMD and Nvidia design the chips, and TSMC makes (fabricates) them.\n\nNow Intel owns all their own fabrication facilities, but their latest technology (fabrication process) is trailing behind the likes of TSMC and Samsung.  So Intel is competing with TSMC in fabrication, but has approached them to perhaps make some Intel chips while Intel sorts their shit out.  To this TSMC said \"sorry, but we got too many orders from AMD and Nvidia\" so you're on your own.\n\nI don't know that this helps anyone make a decision, but TSMC looks to have a market advantage for the next year or so.  Especially since they're making all the AMD chips in the PS5s and Xbox Series XYZ.\n\nBut don't take my word for it, I lost 17K on GME.  I clearly eat crayons.",
        "created_utc": 1613079129,
        "id": "gmzj58l",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613107929.0
    },
    {
        "author": "LudereHumanum",
        "body": "Dude, as a gamer: A *lot*. AMD is trailing Nvidia like the Nazis trailing Indiana Jones. Ever heard of DLSS or rtx? I *love* AMD as, a consumer. But, they're *seriously* behind Nvidia, when it comes to graphic cards anyway.",
        "created_utc": 1612985397,
        "id": "gmuntb1",
        "score": 7,
        "subreddit": "stocks",
        "created": 1613014197.0
    },
    {
        "author": "lavishcoat",
        "body": "PYPL and NVDA, good lads",
        "created_utc": 1613056784,
        "id": "gmy234c",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613085584.0
    },
    {
        "author": "LMY723",
        "body": "Nvidia is about to become a fucking monopoly if they buy ARM. buy in.",
        "created_utc": 1612808224,
        "id": "gmluaf9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1612837024.0
    },
    {
        "author": "onyxer03",
        "body": "&gt;MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.\n\nBut you cant forget about \n\n&amp;#x200B;\n\n MGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613760235,
        "id": "go19fny",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613789035.0
    },
    {
        "author": "Wsbgodd",
        "body": "NVDA NVDA NVDA NVDA!!!",
        "created_utc": 1613058930,
        "id": "gmy6z6l",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1613087730.0
    },
    {
        "author": "SmokingOnTheBombHay",
        "body": "Bro I had to listen to tea party radio.\n\nHere was Glen Beck “Obama bad, stock, Obama bad big bad, economy bad, Wall Street big mean, *fake crying , me patriot, now let’s hear from our sponser”. “Let me tel you how to have your portfolio ready for upcoming market turbulence, buy silver”\n\nSo many boomers in that warehouse bought it up though.  I pretty much told that, but god they were dumb.",
        "created_utc": 1612184568,
        "id": "glldy4a",
        "score": 168,
        "subreddit": "wallstreetbets",
        "created": 1612213368.0
    },
    {
        "author": "logan_jensen3",
        "body": "Don’t tel people to buy. SEC is here. We just like the stock",
        "created_utc": 1612232421,
        "id": "glokovf",
        "score": 148,
        "subreddit": "wallstreetbets",
        "created": 1612261221.0
    },
    {
        "author": "TheJunkieDoc",
        "body": "Nah that's Etoro for you. Some shady criminals sitting in Tel Aviv. They open markets late, stop your trades, add stop losses and so on.... I will post a pic tomorrow (if I think about it) what e-mail I got when I complained about it.",
        "created_utc": 1612223162,
        "id": "glo13xh",
        "score": 93,
        "subreddit": "wallstreetbets",
        "created": 1612251962.0
    },
    {
        "author": "IwannaKanye_Rest",
        "body": "I’m literally just smoking weed and it’s making billionaires cry; don’t tel me it can get better than this, bc it can’t",
        "created_utc": 1612286482,
        "id": "glr6o8p",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1612315282.0
    },
    {
        "author": "BigBananaSlinger",
        "body": "The fact that you can only buy 1 stock of gme and 10 of amc should tel you all you need to know man. If your buying any other stock your not helping the cause as much as you could be. AMC and gme only friends",
        "created_utc": 1612189580,
        "id": "gllneii",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1612218380.0
    },
    {
        "author": "HansBananaNuke",
        "body": "could you please tel me how the inside of israel’s arse tastes?",
        "created_utc": 1612194280,
        "id": "gllzus3",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1612223080.0
    },
    {
        "author": "DeveloperJ",
        "body": "Lol. They haven’t payed the 10 million shares they owe due to ITM calls on Friday. They have till tomorrow. \n\nThe volume is low. It’s a short ladder attack. These are counterfeit shares. It doesn’t actually impact the stock price. It’ll go back up. The stock is shorted over 100%.\n\n Neither the ITM calls from Friday nor the shorted stocks have even started to cover. Selling during a ladder attack is what they want. The only way GME actually goes down is from idiots selling during an artificial stock drop. \n\nDo whatever you want. I’m pretty sure it’s illegal for people to tel you what to do. But if you’re asking for reasons why I am holding, there they are.",
        "created_utc": 1612212483,
        "id": "glnb7o3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612241283.0
    },
    {
        "author": "redidididididit",
        "body": "Anybody wanna tel him?",
        "created_utc": 1612259943,
        "id": "glppx4i",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612288743.0
    },
    {
        "author": "Nerakus",
        "body": "I can’t tel if it’s too late to get in sndl. Seems like it.",
        "created_utc": 1612339696,
        "id": "glu9106",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1612368496.0
    },
    {
        "author": "Steazy2121",
        "body": "Well let it be known in history that I ain’t no paper handed bitch.... don’t tel my wife we’re down 2k or she’ll divorce me 🦍",
        "created_utc": 1612298001,
        "id": "glrzzwp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612326801.0
    },
    {
        "author": "BGis301",
        "body": "Bro let me tel you something. I literally don’t care",
        "created_utc": 1612303814,
        "id": "glsev7k",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1612332614.0
    },
    {
        "author": "lutha2020",
        "body": "Can anyone tel me why my webull acc is saying “insufficient buying power” when I try to buy AMC??",
        "created_utc": 1612192443,
        "id": "glluoxe",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612221243.0
    },
    {
        "author": "RushFPS",
        "body": "$TEL it’s about to take off again",
        "created_utc": 1612331758,
        "id": "gltysq2",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1612360558.0
    },
    {
        "author": "predated0",
        "body": "I have seen Phillips, Trotec and Plasmamade being mentioned in active testing. Besides that, Microsoft and Ansys are closely following the project.   \n\n\nSource: (you probably need to translate it through Google, but you can simply ctrl+f the above names)\n\n[https://www.ed.nl/eindhoven/tu-e-onderzoek-biedt-sportscholen-hoop-apparaten-verwijderen-aerosolen-uit-lucht\\~a0ea76e3/](https://www.ed.nl/eindhoven/tu-e-onderzoek-biedt-sportscholen-hoop-apparaten-verwijderen-aerosolen-uit-lucht~a0ea76e3/)  \n\n\nAs for sales, it's not for sale yet. People have been researching and developing this technology recently. The biggest issue is that purifiers are extremely costly and can cause more harm than good if they arent installed properly. They want to spend a lot of money on marketing to properly educate people how and where to install it, so I doubt its going to cost 45k$, probably more towards 50-60k$, but that is still a massive difference.\n\nAs for how it will end up performing on the stock market, I doubt the stock will keep rising, but I am fairly certain that it will at the very least spike once it is proven to have any positive results on covid, let alone that a lot of aging purifiers can be replaced with higher end hardware for the same cost.  \n\n\nAs for which ticker belongs to the company providing the new technology, I have no clue exactly, but according to other comments, there is vyst(for cheap play), LLC, trox, carr, jci(carr and jci might already be too late to invest), xiaomi, haier and midea(last three for china market). Not to forget the prototype companies Phillips, Trotec and Plasmamade ofcourse.",
        "created_utc": 1615174311,
        "id": "gq699lr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615203111.0
    },
    {
        "author": "OliveSorry",
        "body": "I like ansys at its current levels- i am an engineer and have experience with their products. However i am waiting for it to stop falling before i buy",
        "created_utc": 1614796583,
        "id": "gpk9gji",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614825383.0
    },
    {
        "author": "BigShortVox",
        "body": "Just realised, DFV looks and sounds like Edward Norton. \n\nAm I retarded or does someone see it as well?",
        "created_utc": 1614759986,
        "id": "gpij6u3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614788786.0
    },
    {
        "author": "Psychological_Dot541",
        "body": "$GSAT = buyout target \n\n   QUALCOMM- and -ERICSSON \n\nAPR 2, 2019:\nFormer Qualcomm boss pivots toward 5G startup XCOM.\n\nSEP 17, 2020: \nEricsson, Qualcomm, and U.S. Cellular announce first ever successful extended range 5G NR millimeter Wave (mmWave) data call in the U.S. on a commercial network.\n\nOCT 9, 2020:\nEricsson selected for U.S .DOD 5G testing.\n\nNOV 11, 2020:\nEricsson stock growth is tied to 5G expansion.\n\nFEB 9, 2021: \nQualcomm includes Globalstar's Band n53 in its new 5G X65 modem. The X65 is Qualcomm's flagship 5G modem and adds global 5G band support for n53.\n\nFEB 17, 2021:\nGLOBALSTAR ANNOUNCES STRATEGIC ALLIANCE WITH XCOM LABS.",
        "created_utc": 1614746978,
        "id": "gpi2hsu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614775778.0
    },
    {
        "author": "maddogenglish",
        "body": "Finally a warm day in Colorado so I'm going golfing tomorrow. I would appreciate it if PLTR, SNDL, QCOM, FCEL, QQQ and CAM bring in some ![img](emote|wsb_emojis|tendies) while I am away. Please make that happen.",
        "created_utc": 1614737247,
        "id": "gphkh88",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614766047.0
    },
    {
        "author": "Psychological_Dot541",
        "body": "5G is a fiercely competitive market. The United States will beat Huawei to establish the global standards and commercial market for security reasons - ergo the most prominent U.S. company is in Globalstar given that it already has trusted partners in both Qualcomm (and Ericsson by association) - both of which bring integrated services to 190+ countries.",
        "created_utc": 1614748269,
        "id": "gpi4hvy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614777069.0
    },
    {
        "author": "Flam3Shot_",
        "body": "With all due respect, I do not agree with your statement about there being direct competitors for most companies between the NASDAQ and NYSE. Strong, long lasting companies like Apple, Microsoft, Nvidia, Qualcomm, etc. hardly have any competition whatsoever in reference to the companies listed in the NYSE (unless you count stagnant/dying firms like Oracle or Nokia, but that’s really stretching it). Only thing I can really think of is Facebook v Twitter and some e-commerce stuff like Alibaba v Amazon. Either way, the examples are seldom. \n\nThat said, I appreciate your advice immensely. Thank you :)",
        "created_utc": 1614747255,
        "id": "gpi2xv4",
        "score": 1,
        "subreddit": "investing",
        "created": 1614776055.0
    }
]