[
    {
        "author": "nomad0010",
        "body": "dudes an oracle",
        "created_utc": 1630527511,
        "id": "hb8bg4n",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1630556311.0
    },
    {
        "author": "badgraydog",
        "body": "That's about the same time I sold my Apple shares. Think the market cap was about a billion and rumors were swirling around that Sun or Oracle was going to buy them.",
        "created_utc": 1631387231,
        "id": "hcguqcu",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1631416031.0
    },
    {
        "author": "Wholesome_Stuff",
        "body": "NET seems like a difficult stock to rate. In the past few years cyber attacks have become more prevalent, and will continue to be. Microsoft, Google, Oracle, IBM, Apple and i'm sure plenty of others have partnered with them. Besides their PEG ratio is -11.28, out of the ones you listed this is the lowest by more than double. I.e. they are the best deal for future earnings.",
        "created_utc": 1630620710,
        "id": "hbdesmj",
        "score": 34,
        "subreddit": "investing",
        "created": 1630649510.0
    },
    {
        "author": "hendrix_srv",
        "body": "Every Balmer acquisition was written off as worthless.  Had they chosen someone other than Nadella to replace Balmer, MSFT might be with IBM.\n\nI have a database that tracks revenues of many companies back to 2000, and I can select any group of companies and plot the revenue chart.  My \"tech majors\" groups is an astounding chart, with AAPL coming from the bottom and charting a steep course to the top in 05-10, and IBM and ORCL climbing early on then arcing back into the basement.",
        "created_utc": 1630902660,
        "id": "hbrtpbt",
        "score": 31,
        "subreddit": "stocks",
        "created": 1630931460.0
    },
    {
        "author": "papadragon",
        "body": "Oracle gonna beat and raise into a sell off like always",
        "created_utc": 1631341250,
        "id": "hceo0lw",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1631370050.0
    },
    {
        "author": "Peacock-Mantis",
        "body": "The Oracle is speaking to me, it’s telling me, Yolo GME calls. Which spooky expiration do we buyyy?",
        "created_utc": 1633015361,
        "id": "heuz04x",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1633044161.0
    },
    {
        "author": "Paul_Ostert",
        "body": "Ibm, xerox, Motorola, Intel, GM, Dell, HP, GE, Oracle, Sears",
        "created_utc": 1632792963,
        "id": "hejjvg3",
        "score": 22,
        "subreddit": "StockMarket",
        "created": 1632821763.0
    },
    {
        "author": "RonStampler",
        "body": "I’d never buy ORCL as a SW developer. At my old job we prioritized super hard to remove pur product’s (software) dependency to Oracle, and our customers wanted it too. At my new job I would never consider Oracle in our stack. I havent done any DD as a stock but I would be surprised if there’s a bull case at all.",
        "created_utc": 1630874122,
        "id": "hbq89sa",
        "score": 18,
        "subreddit": "investing",
        "created": 1630902922.0
    },
    {
        "author": "manalexicon",
        "body": "ORCL looks good as well by that criteria",
        "created_utc": 1630857050,
        "id": "hbp5t13",
        "score": 17,
        "subreddit": "investing",
        "created": 1630885850.0
    },
    {
        "author": "Dexteroid",
        "body": "short oracle they rejected me despite a stellar interview.",
        "created_utc": 1631492145,
        "id": "hcmqmcm",
        "score": 16,
        "subreddit": "options",
        "created": 1631520945.0
    },
    {
        "author": "Nova4853",
        "body": "If it moons tomorrow this guy deserves an “Oracle” next to his name",
        "created_utc": 1632197197,
        "id": "hdohzu7",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1632225997.0
    },
    {
        "author": "False-Box2223",
        "body": "![img](emote|t5_2th52|4735) I wonder if this guy even knows he is the great oracle",
        "created_utc": 1632909916,
        "id": "hepe6n7",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1632938716.0
    },
    {
        "author": "DesertAlpine",
        "body": "Why does everyone hate Cathie? I’ve listened to a few interviews with her and she seems like a cool person. She’s alpha bullish on the future.  She is somehow not jaded from the inane and insane roadblocks mob rule and the oligarchy heaps in the way. I like her. \n\nIn 20 years, if everything doesn’t unravel, she will be considered an oracle.",
        "created_utc": 1631949326,
        "id": "hdb0v9f",
        "score": 12,
        "subreddit": "stocks",
        "created": 1631978126.0
    },
    {
        "author": "SirZerty",
        "body": "Did you just call the oracle of Omaha a filthy tap water drinker?",
        "created_utc": 1632858879,
        "id": "hemvx8b",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1632887679.0
    },
    {
        "author": "Taberaremasen",
        "body": "You're retardedly rich and apparently an omniscient oracle who I'd love to meet behind Wendy's before my shift, and you're only gonna throw 100K at this shit? All in or you're a 🌈🐻.",
        "created_utc": 1632639287,
        "id": "hebhpjw",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1632668087.0
    },
    {
        "author": "UsingYourWifi",
        "body": "I think he's more doomer than is warranted these days, and he has a pathological persecution complex because he was never thanked by his clients for the housing crisis short. But Burry was printing money on pure longs for years before then and he's still long a lot of stuff. Dude isn't a permabear. While he's not an oracle, he is worth listening to.",
        "created_utc": 1631967078,
        "id": "hdbn2z3",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1631995878.0
    },
    {
        "author": "ninkorn",
        "body": "Everyone talks about The Oracle of Omaha.\n\nBut the GOAT of stock picking is The Oracle of San Francisco, aka Nancy Pelosi’s husband",
        "created_utc": 1632690755,
        "id": "hee8rac",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1632719555.0
    },
    {
        "author": "CroCra",
        "body": "u/SPAC-ey-McSpacface track record suddenly looking rock solid after his VIH home run. Tell us your next play, almighty oracle.",
        "created_utc": 1630701240,
        "id": "hbhnt5o",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1630730040.0
    },
    {
        "author": "Rymasq",
        "body": "people who said Tesla is an \"AI\" company probably don't work in tech. To put it bluntly, they are stupid. They don't even know what AI really is and that it is now everywhere, every company is technically an \"AI\" company. \n\nNow if Tesla has a substantially large amount of data on self driving, larger than any competitors, that is an asset that Tesla can absolutely sell. Until everyone else has that data, then the asset is worthless. \n\nOne thing that history has proven though is that getting somewhere first doesn't necessarily mean making the most amount of money. A great example of this is MySpace who was then usurped by Facebook a few years later. Those Wright brothers sure did make a ton of money by discovering flight..right? E.F Codd invented the relational database at IBM but Oracle sure does make a TON more money off it today.",
        "created_utc": 1631112441,
        "id": "hc2bx13",
        "score": 7,
        "subreddit": "stocks",
        "created": 1631141241.0
    },
    {
        "author": "Zack_attack801",
        "body": "Earnings are kind of a gamble. If you want to invest short term and you’re sure you like oracle you might want to just wait here til after earnings. If the price drops you’ll get in better. If it goes up you can always wait until it comes back down. Just depends what your goals are",
        "created_utc": 1631376700,
        "id": "hcg6b5l",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1631405500.0
    },
    {
        "author": "SoyFuturesTrader",
        "body": "I realized I’m way overextended with options. I initially started to hedge against tail risk.\n\nNow I’m way overexposed in stupid option plays from OTM TBT calls and TLT puts to meme stock calls to just overall dumb shit \n\nI need to go to rehab for my gambling problem and my drinking problem \n\nMy biggest YOLO of them all is my company equity which is now up to $13MM but I refuse to sell and diversify because I want to be an Oracle type billionaire",
        "created_utc": 1631181887,
        "id": "hc5xi73",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1631210687.0
    },
    {
        "author": "IAmPattycakes",
        "body": "I think I can talk for everyone in the software world.\n\nFuck Oracle.",
        "created_utc": 1631629042,
        "id": "hctmc6e",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1631657842.0
    },
    {
        "author": "Unlucky-Prize",
        "body": "I asked the oracle about china, we should be good:\n\n[https://imgur.com/a/eFoLBuu](https://imgur.com/a/eFoLBuu)\n\n&amp;#x200B;\n\nfull text:\n\n\"Tomorrow the massive evergrande debt crisis in china will be resolved. This is because the renminbi is a hard currency, and China has very few competitors for the renminbi. So its very unlikely that they will be under pressure to devalue the renminbi against the dollar, given that the renminbi is a stable currency. It would be hard for the US to make a move on China by saying that they can no longer have imports in dollars, as China is the #1 consumer of US imports.  \nThe only possible crisis in the next 24 hours is that Chinese companies might try to borrow in dollars, because they cant really borrow in renminbi. Its not that the renminbi is not a hard currency, its just that there is a lot of liquidity in the Chinese market, and banks could borrow in any currency they want. But since the Chinese government has been very careful in the past not to print money to finance bad assets, they will only go with renminbi.\"",
        "created_utc": 1632199581,
        "id": "hdoluwd",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1632228381.0
    },
    {
        "author": "BillyBob_Bob",
        "body": "Any recs on earnings plays for this week Mr. Oracle?",
        "created_utc": 1631027783,
        "id": "hbxuk67",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1631056583.0
    },
    {
        "author": "Feeling-Programmer11",
        "body": "Thx oracle",
        "created_utc": 1631558762,
        "id": "hcq1ldu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1631587562.0
    },
    {
        "author": "Chabubu",
        "body": "It was verified by Google search which returned the Reddit post with this quote by the Oracle.",
        "created_utc": 1632199782,
        "id": "hdom68v",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1632228582.0
    },
    {
        "author": "Abject_Resolution",
        "body": "I took out a loan to yolo into puts. This guys an oracle. Still believes",
        "created_utc": 1630614788,
        "id": "hbd1h6f",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630643588.0
    },
    {
        "author": "Fontec",
        "body": "Don’t buy the dip this week — personal oracle says 447.25 is bottom",
        "created_utc": 1631210694,
        "id": "hc7j1er",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631239494.0
    },
    {
        "author": "Potado",
        "body": "Bloomberg Terminals are becoming VERY dated. They were and still are the industry standard, but they're in the class of commercial tech products that really let themselves go after gaining monopolistic notoriety pre-2000. The Oracle database is another example - developers haven't done shit on that product for decades despite it continuing to power many huge enterprise clients.",
        "created_utc": 1632280952,
        "id": "hdswx5k",
        "score": 4,
        "subreddit": "investing",
        "created": 1632309752.0
    },
    {
        "author": "sheepinb",
        "body": "Wow ur such an oracle or not",
        "created_utc": 1632946152,
        "id": "herjo76",
        "score": 4,
        "subreddit": "stocks",
        "created": 1632974952.0
    },
    {
        "author": "Asdfgda",
        "body": "54m doesn't sound like it would last very long if they're fighting both apple and samsung...\n\nPatent law is tricky. Art priori is not always a sure thing as i understand it.\n\nI also wonder how hard it'd be to find a jury without any personal bias or some kind of stake in apple / samsung.\n\nIts a neat idea, but I dont think betting against FAANGs will work out for a 54m  comapy in this day and age lol.\n\nDidnt oracle have some big lawsuit kinda like this a few years back?",
        "created_utc": 1630920611,
        "id": "hbsh98i",
        "score": 4,
        "subreddit": "investing",
        "created": 1630949411.0
    },
    {
        "author": "Russki1319",
        "body": "Oracle",
        "created_utc": 1631529487,
        "id": "hcobnai",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631558287.0
    },
    {
        "author": "Bonbon676790",
        "body": "Thanks oracle Fred, I’m now a millionaire.",
        "created_utc": 1632020758,
        "id": "hdf17r3",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1632049558.0
    },
    {
        "author": "InterGalacticShrimp",
        "body": "Look if the oracle is watering the driveway, I'm pretty sure it's not tap water,  but more oracle like elixers",
        "created_utc": 1632859532,
        "id": "hemxcpc",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1632888332.0
    },
    {
        "author": "Risd2020",
        "body": "And he’s the Oracle for a reason",
        "created_utc": 1633035858,
        "id": "hewbqhb",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633064658.0
    },
    {
        "author": "Awesome____Sauce",
        "body": "I want to short the shit out of $ORCL",
        "created_utc": 1631147871,
        "id": "hc4jwcx",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631176671.0
    },
    {
        "author": "helpmefindthetruth",
        "body": "Oracle puts for sure. They're as dependable as Zoom when it comes to crashing after earnings.",
        "created_utc": 1631455625,
        "id": "hckbfm9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631484425.0
    },
    {
        "author": "WHistard42",
        "body": "My friend, whenever I try to talk stocks: \"Maybe I'll wait a couple years and then it'll be the right time.\"\n\nMe: \"What are you, a fucking oracle now?\"",
        "created_utc": 1631583721,
        "id": "hcrmtrm",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631612521.0
    },
    {
        "author": "jessejerkoff",
        "body": "I can tell you **exactly** why best buy is not the value play of the year. McKinsey even did a case study on them! The modernised their business on 2012, and think that is what customers want now. The main issue is What is good enough for the 2010s is ancient in the 2021 digital world.\n\n\nWhat they did is ***de-dinosaur*** their business. Not digitally transform it.\n\nGive it three years, best buy will have to do a digital transformation to survive into 2030. If they do it, then I'll buy in. Else they will fall.\n\nYou probably think one digital transformation is enough! And a revamped renew blue is all set up. You're wrong.\n\nMicrosoft had a similar problem, and so did SAP and Oracle.\n\nJust because they are tech companies does not mean they are ready for the future. \n\nAnd just because best buy has a web site does not make them an e-commerce company.",
        "created_utc": 1631202910,
        "id": "hc708yn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631231710.0
    },
    {
        "author": "SiggieBagADonuts",
        "body": "People shouldn’t be playing with money they aren’t willing to lose. You’re DD was sound and things just didn’t go as expected. At lot of us appreciate the work you put into your recommendations. Everyone on here should understand that its all an educated guess. While we like to joke around that you are an Oracle we realize that nobody is perfect. Your record is still stellar - keep the DD coming please!",
        "created_utc": 1632494070,
        "id": "he3glor",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1632522870.0
    },
    {
        "author": "User_Simulator",
        "body": "Sometimes there's good earnings they seem to always dump Throw that 7k in oracle Not even Not even I never preached it would end under 430, but like I thought it would end under 430, but like I thought it would open green again lol.\n\n ~ Russki1319\n\n-----\n\n[^^Info](https://github.com/trambelus/UserSim) ^^| [^^Subreddit](/r/User_Simulator)",
        "created_utc": 1632689623,
        "id": "hee64b5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1632718423.0
    },
    {
        "author": "Dragonhawk93",
        "body": "im about to buy 5k in puts on this. youre a god damn oracle OP and i hope youre right again lol",
        "created_utc": 1630600541,
        "id": "hbc1l2e",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630629341.0
    },
    {
        "author": "Crazyleggggs",
        "body": "Oracle is only up 50% for the year…. Stonks only go up right?",
        "created_utc": 1631629484,
        "id": "hctndot",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631658284.0
    },
    {
        "author": "BrutalHunny",
        "body": "Oracle missed, catalyst for a sell off. Spy 1 EOW.",
        "created_utc": 1631564635,
        "id": "hcqg5w0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631593435.0
    },
    {
        "author": "FredMc",
        "body": "Lol Oracle.  Jim Cramer said it was going to beat what happened?",
        "created_utc": 1631565812,
        "id": "hcqj3yq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631594612.0
    },
    {
        "author": "Justastonkie",
        "body": "Oracle puts for supper",
        "created_utc": 1631543148,
        "id": "hcozu3h",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631571948.0
    },
    {
        "author": "Aokay1er",
        "body": "Bought ORCL puts. Hope they print🤞",
        "created_utc": 1631559042,
        "id": "hcq2a9u",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631587842.0
    },
    {
        "author": "getouttaheee",
        "body": " ORCL is a trash ass company",
        "created_utc": 1631563801,
        "id": "hcqe31u",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631592601.0
    },
    {
        "author": "donkey199",
        "body": "The oracle of depacs says palantir backed blacksky is next",
        "created_utc": 1632425143,
        "id": "he01kel",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1632453943.0
    },
    {
        "author": "brandononandon",
        "body": "Me after following the Oracle u/Hour_Amphibian1844 DD but buying calls instead",
        "created_utc": 1631227737,
        "id": "hc8nxdi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631256537.0
    },
    {
        "author": "helpmefindthetruth",
        "body": "Oracle puts finna be that free money I always heard about.",
        "created_utc": 1631395896,
        "id": "hchfcoa",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631424696.0
    },
    {
        "author": "kiwifruta",
        "body": "The migration to Snowflake is taking much longer than initially anticipated. But the Snowflake SQL dialect is very similar to Oracle’s so it won’t take much to translate the SQL code and move the developers and analysts to a new dialect. \n\nPerformance improvements with Snowflake were incredible. I heard ex-Oracle developers who held half their patents founded Snowflake so there is also an innovation loss for Oracle.",
        "created_utc": 1630991857,
        "id": "hbwc4g9",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1631020657.0
    },
    {
        "author": "Moist_Lunch_5075",
        "body": "I dub thee: the oracle of buffalo",
        "created_utc": 1631040599,
        "id": "hbypo9n",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631069399.0
    },
    {
        "author": "callsmeal",
        "body": "I just lowered my ask to .83.  The algobot left.  But a bunch of other orders came down to match. Maybe the bot is in my head now. Calling u/redpillbluepill , our local oracle",
        "created_utc": 1631284049,
        "id": "hcbdh11",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1631312849.0
    },
    {
        "author": "new-chris",
        "body": "Good strategy - I have made a lot of money on ORCL dips and buying calls",
        "created_utc": 1631664120,
        "id": "hcvyzia",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631692920.0
    },
    {
        "author": "Spuri0n",
        "body": "$ORCL gonna dump this afternoon, buy some puts for their earnings and leave some room for the correction",
        "created_utc": 1631541405,
        "id": "hcovwn1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631570205.0
    },
    {
        "author": "Russki1319",
        "body": "So who's doing oracle earnings?",
        "created_utc": 1631542144,
        "id": "hcoxjif",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631570944.0
    },
    {
        "author": "Awesome____Sauce",
        "body": "ORCL puts, all $FDX and $SFIX might be good.",
        "created_utc": 1631497633,
        "id": "hcn29d7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631526433.0
    },
    {
        "author": "yoyo248",
        "body": "Puts on Oracle, calls on MANU",
        "created_utc": 1631497726,
        "id": "hcn2ghr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631526526.0
    },
    {
        "author": "Mirucias",
        "body": "Anyone playing Orcl earnings?",
        "created_utc": 1631559394,
        "id": "hcq35bz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631588194.0
    },
    {
        "author": "rabidmuffin",
        "body": "It does feel unlikely. Their current market cap is 56b so while 10xing that is certainly possible it would make them bigger than Oracle, Salesforce or Nvidia are today which feels like a stretch. But im still long PLTR.",
        "created_utc": 1631991382,
        "id": "hdd4me0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632020182.0
    },
    {
        "author": "KyivComrade",
        "body": "I want to believe...but deep down I know if WSB is bullish there is still more room to fall.\n\n\n\n\nNot until we worship a gecko-oracle or rely on dog-poop readings is the true bottom in.",
        "created_utc": 1632230778,
        "id": "hdprcs2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632259578.0
    },
    {
        "author": "BeastUSMC",
        "body": "The Oracle came. I listened and obeyed. Mr. Tuchman’s presence is undeniable. Now, I watch as does he.",
        "created_utc": 1632413840,
        "id": "hdza5zz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632442640.0
    },
    {
        "author": "notbrokemexican",
        "body": "Yeah and Oracle software is encoded in billions of Android devices, what's your point?",
        "created_utc": 1632733158,
        "id": "heg9iin",
        "score": 2,
        "subreddit": "stocks",
        "created": 1632761958.0
    },
    {
        "author": "kiwifruta",
        "body": "At my previous job we were moving away from Oracle DB (too expensive) to Snowflake and used only Juniper gear for the ISP devices.",
        "created_utc": 1630991351,
        "id": "hbwbd82",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1631020151.0
    },
    {
        "author": "TradeIdeas_87",
        "body": "Buying the selling this morning in ORCL. Agree with your comments fully but also see a company doing well and moving forward in important ways. IMHO we trade around today then start a march to $100 after consolidating in the $85-92 range for past few months.",
        "created_utc": 1631622982,
        "id": "hct9l1f",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1631651782.0
    },
    {
        "author": "ShitFeeder",
        "body": "There's oracle and fuelcell which are pretty hard to predict.",
        "created_utc": 1631284626,
        "id": "hcbeub9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631313426.0
    },
    {
        "author": "UnknownNo0722",
        "body": "Alright someone lend me your dirty smelly oracle and tell me what to do with my $400",
        "created_utc": 1631179036,
        "id": "hc5ueyr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631207836.0
    },
    {
        "author": "Buyatdipandhold",
        "body": "Oracle to the moon",
        "created_utc": 1631379907,
        "id": "hcgdoa2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631408707.0
    },
    {
        "author": "El-cid-98",
        "body": "R U serious? ORCL.",
        "created_utc": 1631548060,
        "id": "hcpbl6u",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631576860.0
    },
    {
        "author": "Kekbar",
        "body": "Oracle, the last tech titan with a respectable P/E, enormous revenues, constant stock buybacks, solid dividends. People love to hatejerk to them and ignore how solid they actually are.",
        "created_utc": 1631584073,
        "id": "hcrnky9",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631612873.0
    },
    {
        "author": "melvincaneatmyshorts",
        "body": "Anyone playing ORCL earnings?",
        "created_utc": 1631557003,
        "id": "hcpxa3m",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631585803.0
    },
    {
        "author": "TackleMySpackle",
        "body": "Personally, I only trade strangles when there is a known event coming. For example, with AFRM, I bought the ATM strangle (I think it was $95) about an hour before close of business on earnings day. \n\nI knew there would be a catalyst one way or the other within the next hour and that the next morning the price would swing likely in the positive direction. It did and I was successful.\n\nWith Nike, I jumped in a few days early thinking I would beat some of the IV. I was correct on that, but I guess a lot of other people did the same and that drove the price up $5 more than my strikes. When it crashed, the puts just didn't cover enough and I never adjusted - I should be flayed at the stake. \n\nI also bought Oracle ATM the day of (I think the morning of), and it dumped after earnings. I cashed the put out at about a 25% profit, but kept the call, because ORCL has a history of pumping a few weeks after earnings for their dividend. As of today, that call is now up about 10% so I went green on both sides of the straddle. I highly suggest you look at how ORCL performed a few weeks ago compared to last earnings. The chart patterns are almost identical. \n\nEach play is unique, but if you straddle just \"under the suspicion\" that the price will swing, without any assured date or event that might unfold, you might get lopsided.\n\nOne good rule of thumb I like is that a perfectly balanced straddle should find the put and call prices almost identical. Take CCXI, for example. If you bought the $17.50 straddle last week, the underlying has now moved up to $20. The $17.50C Nov is now worth more than the $17.50P Nov (for obvious reasons). If you wanted to balance this, you'd be better off rolling your put to the $20 because the pricing of the two is almost equivalent. It wouldn't technically be a straddle at that point, but you probably smell what I'm stepping in. \n\nOf course, if you find yourself rolling to the next higher strike, you're not really doing yourself any favors either, but I'm just trying to point out the balance aspect here. \n\nOne other note with straddles: IV can fuck you. CCXI is, I believe, the highest IV stock right now. If you straddled it now just in case the FDA approval doesn't go through, you might get IV crushed while your calls evaporate. In which case, you're not really reaping the benefit of the straddle. If you do CCXI, your best bet is to either sell puts and collect fat premiums and hope it skyrockets, or buy calls and hope it skyrockets. Buying puts right now, IMO, is not smart, but definitely track it so you can see how it would have unfolded for you. That's the best thing to do.\n\nTLDR: Buy an ATM straddle with about 45-60 DTE  just before an event; hopefully before IV gets nuts. Expect one side of your straddle to be sacrificial, but don't sell it if it does die. Milk the call/put that does perform for everything it's worth. Then, hang on to the dead side in hopes of a retraction/bounce in the other direction. Try to collect on both ends of the straddle.",
        "created_utc": 1632866800,
        "id": "hene1h5",
        "score": 2,
        "subreddit": "options",
        "created": 1632895600.0
    },
    {
        "author": "daynighttrade",
        "body": "So, Oracle calls?",
        "created_utc": 1630567332,
        "id": "hbaf639",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630596132.0
    },
    {
        "author": "PepeSilviaFTW",
        "body": "Who's in on ORCL or PLAY earnings this week?   \nLooking at calls on both.",
        "created_utc": 1630967365,
        "id": "hbv1fyx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630996165.0
    },
    {
        "author": "SnooStrawberries9414",
        "body": "Stocks are too expensive and could crash? Tell me more Mr. “Oracle of Omaha.”",
        "created_utc": 1631140835,
        "id": "hc45ecb",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1631169635.0
    },
    {
        "author": "Itonlygetshigher420",
        "body": "Kaplan , a member of the US fed and gov sold a Reaaaly big position 1m+ in oracle along side a few others. \n\nThis was last week.\n\nI thought the same as you but this news put me off as most times these crooks are right.",
        "created_utc": 1631452333,
        "id": "hck4o0r",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631481133.0
    },
    {
        "author": "ienjoycorgis",
        "body": "Imagine working at a company that uses Oracle products, and still working at that company.",
        "created_utc": 1631564062,
        "id": "hcqeq5l",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631592862.0
    },
    {
        "author": "Mirucias",
        "body": "Lmao I actually was going to buy Fcel calls, but went with Orcl puts. Kinda went alright i guess",
        "created_utc": 1631629683,
        "id": "hctnurr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631658483.0
    },
    {
        "author": "Aokay1er",
        "body": "Oracle puts and Apple calls maybe?🤷‍♂️",
        "created_utc": 1631492939,
        "id": "hcms94d",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631521739.0
    },
    {
        "author": "Caesar_aut_nullus",
        "body": "Be fearful when others are greedy and greedy when others are fearful - Oracle of Omaha",
        "created_utc": 1631832669,
        "id": "hd50c4b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631861469.0
    },
    {
        "author": "mo_faraway",
        "body": "Yeah this seemed more like trying to establish themselves as an oracle and get ppl to watch some scammy looking FX technical trading vids on youtube.",
        "created_utc": 1632902635,
        "id": "hep6ant",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1632931435.0
    },
    {
        "author": "Bluecoregamming",
        "body": "Oh great wise oracle, please bestow upon me your wisdom. Gmestop earnings, calls or puts?",
        "created_utc": 1630530708,
        "id": "hb8j3b5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630559508.0
    },
    {
        "author": "samthesuperman",
        "body": "Speaking of which, whats the play today oracle?",
        "created_utc": 1630578075,
        "id": "hbarg55",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630606875.0
    },
    {
        "author": "Free-Author",
        "body": "Dustin Moskovitz visited me in a dream last night, telling me I was getting cocky as I was still holding my ASAN calls from pre-earnings and looking to dump some to play SMAR today.  Things were going down, so I sold my ASAN calls and decided to get humble on American in general, buying some puts and Oracle calls and SMAR calls, anyway.\n\nASAN turned around.  Even though I'd be up 50% had I held it from where I am now, I am glad I got out with a big gain since ASAN was a yolo, and I didn't have much, left.  Riding the trend makes a profit, so here is to riding the downward SPY trend!",
        "created_utc": 1631027180,
        "id": "hbxt416",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631055980.0
    },
    {
        "author": "yuky19",
        "body": "If you got the money then yes. Cause this oracle never misses when he does full DD",
        "created_utc": 1631207784,
        "id": "hc7bzv9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631236584.0
    },
    {
        "author": "Aokay1er",
        "body": "Will ORCL keep dumping plz🥺",
        "created_utc": 1631580380,
        "id": "hcrfh00",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631609180.0
    },
    {
        "author": "DayMack8006",
        "body": "ORCL always dumos after earnings",
        "created_utc": 1631563758,
        "id": "hcqdz6j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631592558.0
    },
    {
        "author": "Spuri0n",
        "body": "$ORCL getting dumpster'd after my previous post -- bless up",
        "created_utc": 1631543597,
        "id": "hcp0vm4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631572397.0
    },
    {
        "author": "Russki1319",
        "body": "Throw that 7k in oracle",
        "created_utc": 1631544976,
        "id": "hcp44m0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631573776.0
    },
    {
        "author": "JerseyFlashBoys",
        "body": "I feel pretty gross buying ORCL but let’s get it",
        "created_utc": 1631552247,
        "id": "hcplqg2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631581047.0
    },
    {
        "author": "skin_flute_player",
        "body": "Anyone else gonna buy a FD for Oracle and hope earnings moon shots it?",
        "created_utc": 1631559477,
        "id": "hcq3con",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631588277.0
    },
    {
        "author": "Aggravating-Yam-8921",
        "body": "Oracle you sexy money printing beast. Not this time! Your not gonna eat my calls alive again, I'm on to you....",
        "created_utc": 1631423039,
        "id": "hcj0nl0",
        "score": 1,
        "subreddit": "options",
        "created": 1631451839.0
    },
    {
        "author": "Mirucias",
        "body": "Thought orcl puts was free money",
        "created_utc": 1631569187,
        "id": "hcqr78m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631597987.0
    },
    {
        "author": "moMoPIZA",
        "body": "&amp;#x200B;\n\nlol i will short oracle cause last time i bought calls i lost big and also they are shit",
        "created_utc": 1631569145,
        "id": "hcqr3s4",
        "score": 1,
        "subreddit": "options",
        "created": 1631597945.0
    },
    {
        "author": "Historical_Baker_137",
        "body": "ORCL calls yolo fuck it",
        "created_utc": 1631561748,
        "id": "hcq8z3a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631590548.0
    },
    {
        "author": "Aokay1er",
        "body": "ORCL is supposed to dump 😔",
        "created_utc": 1631561611,
        "id": "hcq8mr1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631590411.0
    },
    {
        "author": "Historical_Baker_137",
        "body": "oh well i hope ORCL doesn’t burn my money",
        "created_utc": 1631563328,
        "id": "hcqcwmi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631592128.0
    },
    {
        "author": "kale_boriak",
        "body": "ORCL has dropped post earnings pretty consistently recently, but keep expiration close, it also recovers.",
        "created_utc": 1631377813,
        "id": "hcg8tyi",
        "score": 1,
        "subreddit": "options",
        "created": 1631406613.0
    },
    {
        "author": "JourneymanInvestor",
        "body": "RBLX, COIN, WDC, STX, and TTWO. Roblox, especially, has printed money for me all year long (going long and short based on technical analysis).",
        "created_utc": 1630885948,
        "id": "hbqx125",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1630914748.0
    },
    {
        "author": "Jeermm",
        "body": "value stocks right now are mostly energy and commodities with a few exceptions here and there. a few off the top of my head would be XOM, RIO, BHP, LYB, OGN, STX, LVS, MU, etc. the list goes on and on. \n\nDM me if you’re really serious and I can try to help! This list I just shot off, ive owned and still own all of them except BHP, RIO, FCX, and VALE because i bought the etf $PICK instead.",
        "created_utc": 1630968577,
        "id": "hbv3xfb",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630997377.0
    }
]