[
    {
        "author": "gtani",
        "body": "That's a good mix, I look for TSM, AMAT, Lam, ASML, KLA in ETF's.  SMH would be great if it didn't have so much intel, TI etc but can't not have those in a semi ETF",
        "created_utc": 1619024862,
        "id": "gvcechf",
        "permalink": "/r/investing/comments/mvhbxg/the_us_semiconductor_sector_gets_reinforced_with/gvcechf/",
        "score": 2,
        "subreddit": "investing",
        "created": 1619053662.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the 29th of April\n\n\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARD, ARES, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLMN, BMRN, BMY, BPMC, BSIG, BSVN, BTU, BVN, BWB, BY, BZH, CACC, CAI, CARR, CASA, CAT, CBRE, CBZ, CCOI, CCXI, CFFN, CFR, CFX, CG, CGNT, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COR, COWN, CPLP, CPSH, CPT, CQP, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DRQ, DVA, DVD, DXCM, EBC, EBS, ECOL, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, EQNR, ERIE, ERII, ERJ, ETH, EVBN, EVLO, EVTC, EXLS, EXPO, FBHS, FBIZ, FBRX, FCN, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FTAI, FTNT, FTV, FWRD, GFF, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GOL, GPI, GRA, GSHD, GWB, HAYN, HGV, HP, HSY, HTGC, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INDT, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBPS, LEVL, LFVN, LH, LIND, LKQ, LLNW, LMAT, LPLA, LTC, LTRX, LYG, MA, MATW, MBIN, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MNOV, MO, MPW, MRK, MRLN, MSTR, MTLS, MTRN, MTSI, MVIS, NATI, NDLS, NEM, NEXA, NIO, NMM, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, NWG, OCFC, OFC, OMCL, ONEW, ONTO, OPI, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCG, PCSB, PEB, PH, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RCL, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SAND, SCX, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SNDR, SNP, SO, SPGI, SPSC, SRCL, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TOT, TPX, TREE, TROW, TRS, TRTN, TRUP, TUSK, TW, TWTR, TXRH, TXT, ULBI, ULH, USAK, USM, VC, VCRA, VICI, VIRC, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PLBC, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SLG, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - FOMC Member Quarles Speaks\n    - FOMC Member Williams Speaks\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 11B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 5.0%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n## Upcoming events for Friday, April 30th\n\n - Expected earnings:\n\n  ABBV, AON, AROC, ASIX, AVNT, AZN, B, BCPC, BCS, BRID, BSAC, CBOE, CCLP, CHTR, CL, CLX, CRI, CVEO, CVX, CWBC, DCOM, E, EEX, ESXB, FSBW, GT, GWW, HRC, HUN, IESC, IMO, IRMD, ITCB, ITW, JCI, JELD, LAZ, LFC, LHX, LSBK, LYB, MGP, MOG.A, MOG.B, NWHM, NWL, OFIX, OIIM, PBI, PFS, PIPR, PNM, POR, PSX, PSXP, QSR, SBFG, SHLX, SLCA, SPCB, TWIN, WETF, WPC, WY, XOM\n\n - Ex-div:\n\n  AON, ASRV, BX, C, CARR, CASY, CBAN, CLB, CMCO, CNBKA, CPLP, CZNC, DGICA, DGICB, DMLP, ELP, EVTC, EWBC, FAT, HAS, HEP, HESM, HFBL, KOF, KRP, LCUT, LYTS, MCI, NRG, NSEC, O, OHI, ORRF, PBCT, PEBO, PNW, SBNY, SBS, SGU, SPFI, SXT, SYF, TKC, TXN, WABC\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.4K)\n    - CFTC Copper speculative net positions (previous: 42.9K)\n    - CFTC Corn speculative net positions (previous: 522.7K)\n    - CFTC Crude Oil speculative net positions (previous: 500.0K)\n    - CFTC Gold speculative net positions (previous: 181.5K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.1K)\n    - CFTC Natural Gas speculative net positions (previous: -50.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -52.2K)\n    - CFTC Silver speculative net positions (previous: 41.7K)\n    - CFTC Soybeans speculative net positions (previous: 243.2K)\n    - CFTC Wheat speculative net positions (previous: 21.0K)\n    - Chicago PMI (consensus: 65.3, previous: 66.3)\n    - Core PCE Price Index (consensus: 0.3%, previous: 0.1%)\n    - Core PCE Price Index (consensus: 1.8%, previous: 1.4%)\n    - Dallas Fed PCE (previous: 1.80%)\n    - Employment Benefits (previous: 0.60%)\n    - Employment Cost Index (consensus: 0.7%, previous: 0.7%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.70%)\n    - Michigan Consumer Expectations (previous: 79.7)\n    - Michigan Consumer Sentiment (consensus: 87.4, previous: 86.5)\n    - Michigan Current Conditions (previous: 97.2)\n    - Michigan Inflation Expectations (previous: 3.7%)\n    - PCE Price index (previous: 1.6)\n    - PCE price index (previous: 0.2%)\n    - Personal Income (consensus: 20.3%, previous: -7.1%)\n    - Personal Spending (consensus: 4.1%, previous: -1.0%)\n    - Real Personal Consumption (previous: -1.2%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 344)\n    - U.S. Baker Hughes Total Rig Count (previous: 439)\n\n^^^^2021-04-29",
        "created_utc": 1619690422,
        "id": "gwa20lp",
        "permalink": "/r/RobinHood/comments/n11315/daily_discussion_thread_april_29th_2021/gwa20lp/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1619719222.0
    },
    {
        "author": "HazardousMako",
        "body": "Interesting to see what this does to semiconductors seeing how most of them like AMAT, LRCX, KLAC, TSM, etc. all make most of their money in Asia.\n\nhttps://www.bbc.com/news/business-56685136",
        "created_utc": 1617939194,
        "id": "gtw4arh",
        "permalink": "/r/wallstreetbets/comments/mn04vf/what_are_your_moves_tomorrow_april_09_2021/gtw4arh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617967994.0
    },
    {
        "author": "Dematsa",
        "body": "AMAT, LRCX, AMD, KLAC, TSM",
        "created_utc": 1617574171,
        "id": "gte2qpz",
        "permalink": "/r/stocks/comments/mjrul6/long_term_stocks/gte2qpz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617602971.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 27th of April\n\n\n\n## Upcoming events for Tuesday, April 27th\n\n - Stock splits:\n\n    - NSPR @ **1:15**\n\n - Expected earnings:\n\n  AAN, AAT, ABB, ABG, ACCO, ACGL, ACH, ADM, AHC, AJRD, AMD, AMGN, AMX, APAM, ARAY, ARVN, ATEN, ATNI, ATRC, AUDC, AWI, AWRE, BP, BSBR, BUSE, BXP, BYD, CAC, CALX, CASH, CB, CEQP, CHE, CHRW, CNC, COF, CROX, CRSP, CSGP, CYBE, CZWI, DTE, EBMT, ECL, EGP, EHC, EIX, ENPH, ENTG, EQR, ESBK, ESS, FBNC, FCBP, FCF, FCPT, FELE, FEYE, FFIC, FFIV, FFNW, FFWM, FIBK, FISV, FRST, FSV, FTI, GE, GLW, GOOD, GOOG, GOOGL, GPK, GRFS, HA, HAFC, HAS, HBCP, HEES, HFBL, HIW, HNP, HOPE, HRZN, HSBC, HUBB, HVT, HVT.A, IBA, IBCP, IEX, ILMN, IVZ, JBLU, JNPR, KNSA, KTCC, LBC, LBRT, LDL, LECO, LLY, MANH, MATX, MDLZ, MMC, MMM, MRC, MSCI, MSFT, MVBF, MXIM, NAVI, NCR, NOV, NVS, NXRT, ODT, OKE, OLN, OMAB, OPRA, OXSQ, PCAR, PFG, PHM, PII, PINS, PJT, PPBI, PPD, PROV, PSB, QCRH, QTS, RCKY, RNDB, RNST, ROIC, ROP, RRD, RTX, RXN, SAN, SBUX, SCL, SF, SFST, SHW, SPFI, SQNS, SSTK, ST, SYF, SYK, SYX, TENB, TER, TFII, TKC, TPB, TRMK, TRMT, TRU, TSBK, TX, TXN, UBS, UDR, UMBF, UPS, USNA, V, VALE, VBTX, VIST, WDR, WM, WNEB, WSBC, WSBF, YUMC\n\n - Ex-div:\n\n  AM, ATR, BK, CALM, ENTG, IFS, QADA, QADB, VSEC\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 1.300%)\n    - API Weekly Crude Oil Stock (previous: 0.436M)\n    - CB Consumer Confidence (consensus: 113.0, previous: 109.7)\n    - Dallas Fed Services Revenues (previous: 21.6)\n    - House Price Index (previous: 1.0%)\n    - House Price Index (previous: 12.0%)\n    - House Price Index (previous: 316.7)\n    - Redbook (previous: -17.2%)\n    - Redbook (previous: 13.5%)\n    - Richmond Manufacturing Index (previous: 17)\n    - Richmond Manufacturing Shipments (previous: 22)\n    - Richmond Services Index (previous: 16)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 11.7%, previous: 11.1%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.1%, previous: 1.2%)\n    - Texas Services Sector Outlook (previous: 28.9)\n\n## Upcoming events for Wednesday, April 28th\n\n - Expected earnings:\n\n  AAPL, ADP, AER, AFL, AGI, AKO.A, AKO.B, AKR, ALGN, ALIM, ALKS, ALRS, ALSN, ALTA, AM, AMED, APH, APLS, AR, ARCC, ASGN, ASH, ATOM, ATUS, AUY, AVB, AVT, AVTR, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BHE, BHLB, BLKB, BPOP, BRKL, BSMX, BSX, BXMT, CAKE, CAMT, CBTX, CCS, CDE, CHEF, CHX, CINF, CIT, CLR, CME, CMO, CNMD, CNO, CONE, CPF, CPSS, CREE, CSTM, CUBI, CYH, DAN, DISCA, DISCB, DISCK, DMRC, DRE, DRVN, DX, EAT, EBAY, ECHO, EQIX, ESI, ESRT, ETR, EVA, EVR, EXR, EXTR, F, FARO, FB, FCNCA, FISI, FIX, FORM, GD, GIB, GRMN, GRUB, GSK, GTY, HBNC, HELE, HES, HESM, HNI, HOLX, HT, HUM, IART, ICAD, ICLR, INOV, INVH, IPG, IR, IRT, ISBC, JAKK, JBSS, KALU, KNL, KRA, KRC, LC, LFUS, LIVN, LOGI, LXU, MAA, MAS, MC, MCO, MCRI, MDXG, MEOH, MGM, MGRC, MHH, MHO, MKL, MLCO, MLP, MN, MOH, MORN, MPX, MSA, MSC, MSVB, MTDR, MTH, MUSA, MXL, MYRG, NBR, NGVT, NLY, NOA, NOVA, NOW, NSC, NTB, NYCB, OBNK, OC, OI, OII, OIS, OPK, ORLY, ORN, OSK, OVV, PAG, PB, PDM, PEGA, PGRE, PI, PPC, PSA, PTC, QCOM, R, RBBN, RE, RES, RJF, RNR, ROK, ROL, RWT, SAIA, SC, SGC, SHOO, SHOP, SIGI, SIRI, SIX, SJW, SLAB, SLGN, SMED, SNY, SONY, SP, SPOK, SPOT, SRDX, SREV, SRI, SSB, SWK, SXC, TDOC, TDY, TECK, TEVA, TKR, TNL, TR, TROX, TTEK, TTMI, TWOU, TYL, UCTT, UFI, UMC, URI, UVE, UVSP, VET, VKTX, VNE, VRT, VRTS, VSEC, VVV, WCN, WELL, WERN, WH, WHG, WING, WNC, WRE, WWW, YNDX, YUM\n\n - Ex-div:\n\n  BPMP, BSRR, CFG, FRC, ITUB, KEN, KNOP, MAIN\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.416M)\n    - Crude Oil Inventories (consensus: 0.375M, previous: 0.594M)\n    - Cushing Crude Oil Inventories (previous: -1.318M)\n    - Distillate Fuel Production (previous: -0.088M)\n    - EIA Refinery Crude Runs  (previous: -0.286M)\n    - EIA Weekly Distillates Stocks (consensus: -0.163M, previous: -1.074M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 1.0%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision\n    - Gasoline Inventories (consensus: 0.425M, previous: 0.086M)\n    - Gasoline Production (previous: -0.229M)\n    - Goods Trade Balance (previous: -87.07B)\n    - Heating Oil Stockpiles (previous: 0.563M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 8.6%)\n    - MBA Purchase Index (previous: 295.5)\n    - Mortgage Market Index (previous: 724.8)\n    - Mortgage Refinance Index (previous: 3,219.9)\n    - Retail Inventories Ex Auto (previous: 1.2%)\n    - Wholesale Inventories (previous: 0.6%)\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARES, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLMN, BMRN, BMY, BPMC, BSIG, BSVN, BTU, BVN, BWB, BY, BZH, CARR, CASA, CAT, CBRE, CBZ, CCOI, CCXI, CFFN, CFR, CFX, CG, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COR, COWN, CPT, CQP, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CURO, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DRQ, DVA, DVD, DXCM, EBC, EBS, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, ERIE, ERII, ERJ, ETH, EVBN, EVLO, EVTC, EXLS, EXPO, FBC, FBHS, FCN, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FSP, FTAI, FTNT, FTV, FWRD, GEO, GFF, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GPI, GRA, GSHD, GWB, HAYN, HGV, HP, HSY, HTGC, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INDT, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBAI, LBPS, LEVL, LFVN, LH, LIND, LKQ, LLNW, LMAT, LPLA, LTC, LTRX, LYG, MA, MATW, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MO, MPW, MRK, MRLN, MSTR, MTLS, MTRN, MTSI, MVIS, NATI, NDLS, NEM, NIO, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, OCFC, OFC, OMCL, ONEW, ONTO, OPI, OPOF, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCG, PCSB, PEB, PFPT, PH, PMBC, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RCL, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SAND, SCX, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SNDR, SNP, SO, SPGI, SPSC, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TPX, TREE, TROW, TRS, TRTN, TRUP, TW, TWTR, TXRH, TXT, ULBI, ULH, USAK, USM, VC, VCRA, VICI, VIRC, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PLBC, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SLG, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 49B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 4.7%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n^^^^2021-04-27",
        "created_utc": 1619517616,
        "id": "gw17s1h",
        "permalink": "/r/RobinHood/comments/mzl03y/daily_discussion_thread_april_27th_2021/gw17s1h/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619546416.0
    },
    {
        "author": "ThisPomelo4",
        "body": "Your analysis is probably true for delta, but the problem with playing those names using vol is that the IV is higher. Options trading is most useful when you get the gamma cheap while also calling the direction right.\n\nI'm buying INTC 23Apr 70c because resistance at 65 has kept IV muted. My bet is that INTC will break through that resistance on 6Apr or 23Apr. I hate talking in terms of resistance in general, but looking at the long-term chart as well as price action in the morning after the Intel Unleashed event, it certainly seems like you'd need a big catalyst to justify a breakout beyond 65. I'd probably play those profits -- if any -- into AMD puts through to May, because I think hedge fund selling will take place when Lisa Su inevitably acknowledges the incorrectness of her prediction that supply \"tightness\" would clear up by 2H21.\n\nI also believe that the Archegos liquidation is another sign that correlated hedge fund losses will spell disaster for the market. We saw this already with GME and the other short-squeeze names. Chipmakers like to lay out their capex as close to production ramp-up as possible, which means that LRCX/AMAT/ASML/KLIC/KLAC/CAJ/etc won't book profits immediately even if billions of dollars are allocated to the roadmap. So I'm waiting for a big selloff this summer to get into those names as a long-term position. May try to play that selloff using hedgie favorites and names that have a lot of room to fall. ARKK, TSLA, TSM, NVDA come to mind. TSM seems counterintuitive but you get the added potential catalyst of Chinese brinkmanship as well as a deepening of the water supply woes.\n\nI mention CAJ because it gives a good read on DUV demand. Their equipment segment had a lot of profit growth last quarter. But it's not as good a play as the others because only a fifth of its revenue comes from that segment.",
        "created_utc": 1617331929,
        "id": "gt3qzmp",
        "permalink": "/r/options/comments/mi9kxb/playing_the_semiconductor_shortage/gt3qzmp/",
        "score": 1,
        "subreddit": "options",
        "created": 1617360729.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 28th of April\n\n\n\n## Upcoming events for Wednesday, April 28th\n\n - Expected earnings:\n\n  AAPL, ADP, AER, AFL, AGI, AKO.A, AKO.B, AKR, ALGN, ALIM, ALKS, ALRS, ALSN, ALTA, AM, AMED, APH, APLS, AR, ARCC, ASGN, ASH, ATOM, ATUS, AUY, AVB, AVT, AVTR, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BHE, BHLB, BLKB, BPOP, BRKL, BSMX, BSX, BXMT, CAKE, CAMT, CBTX, CCS, CDE, CHEF, CHX, CINF, CIT, CLR, CME, CMO, CNMD, CNO, CONE, CPF, CPSS, CREE, CSTM, CUBI, CYH, DAN, DISCA, DISCB, DISCK, DMRC, DRE, DRVN, DX, EAT, EBAY, ECHO, EQIX, ESI, ESRT, ETR, EVA, EVR, EXR, EXTR, F, FARO, FB, FCNCA, FISI, FIX, FORM, GD, GIB, GRMN, GRUB, GSK, GTY, HBNC, HELE, HES, HESM, HNI, HOLX, HT, HUM, IART, ICAD, ICLR, INOV, INVH, IPG, IR, IRT, ISBC, JAKK, JBSS, JOE, KALU, KNL, KRA, KRC, LC, LFUS, LIVN, LOGI, LXU, MAA, MAS, MC, MCO, MCRI, MDXG, MEOH, MGM, MGRC, MHH, MHO, MKL, MLCO, MLP, MN, MOH, MORN, MPX, MSA, MSC, MTDR, MTH, MUSA, MXL, MYRG, NBR, NGVT, NLY, NOA, NOVA, NOW, NSC, NTB, OBNK, OC, OI, OII, OIS, OPK, ORLY, ORN, OSK, OVV, PAG, PB, PDM, PEGA, PGRE, PI, PPC, PSA, PTC, QCOM, R, RBBN, RE, RES, RJF, RNR, ROK, ROL, RWT, SAIA, SC, SGC, SHOO, SHOP, SIGI, SIRI, SIX, SJW, SLAB, SLGN, SMED, SNY, SONY, SP, SPOK, SPOT, SRDX, SREV, SRI, SSB, SWK, SXC, TDOC, TDY, TECK, TEVA, TKR, TNL, TR, TROX, TTEK, TTMI, TWOU, TYL, UCTT, UFI, UMC, URI, UVE, UVSP, VET, VKTX, VNE, VRT, VRTS, VSEC, VVV, WCN, WELL, WERN, WH, WHG, WING, WNC, WRE, WWW, YNDX, YUM\n\n - Ex-div:\n\n  BPMP, BSRR, CFG, FRC, ITUB, KEN, KNOP, MAIN\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.416M)\n    - Crude Oil Inventories (consensus: 0.659M, previous: 0.594M)\n    - Cushing Crude Oil Inventories (previous: -1.318M)\n    - Distillate Fuel Production (previous: -0.088M)\n    - EIA Refinery Crude Runs  (previous: -0.286M)\n    - EIA Weekly Distillates Stocks (consensus: -0.648M, previous: -1.074M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 1.0%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - Gasoline Inventories (consensus: 0.508M, previous: 0.086M)\n    - Gasoline Production (previous: -0.229M)\n    - Goods Trade Balance (previous: -87.07B)\n    - Heating Oil Stockpiles (previous: 0.563M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 8.6%)\n    - MBA Purchase Index (previous: 295.5)\n    - Mortgage Market Index (previous: 724.8)\n    - Mortgage Refinance Index (previous: 3,219.9)\n    - Retail Inventories Ex Auto (previous: 1.2%)\n    - U.S. President Biden Speaks\n    - Wholesale Inventories (previous: 0.6%)\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARD, ARES, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLMN, BMRN, BMY, BPMC, BSIG, BSVN, BTU, BVN, BWB, BY, BZH, CACC, CARR, CASA, CAT, CBRE, CBZ, CCBG, CCOI, CCXI, CFFN, CFR, CFX, CG, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COR, COWN, CPLP, CPT, CQP, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CURO, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DRQ, DVA, DVD, DXCM, EBC, EBS, ECOL, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, ERIE, ERII, ERJ, ETH, EVBN, EVLO, EVTC, EXLS, EXPO, FBHS, FBIZ, FBRX, FCN, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FSP, FTAI, FTNT, FTV, FWRD, GEO, GFF, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GOL, GPI, GRA, GSHD, GWB, HAYN, HGV, HP, HSY, HTGC, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INDT, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBAI, LBPS, LEVL, LFVN, LH, LIND, LKQ, LLNW, LMAT, LPLA, LTC, LTRX, LYG, MA, MATW, MBIN, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MNOV, MO, MPW, MRK, MRLN, MSTR, MTLS, MTRN, MTSI, MVIS, NATI, NDLS, NEM, NIO, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, OCFC, OFC, OMCL, ONEW, ONTO, OPI, OPOF, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCG, PCSB, PEB, PH, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RCL, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SAND, SCX, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SNDR, SNP, SO, SPGI, SPSC, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TPX, TREE, TROW, TRS, TRTN, TRUP, TUSK, TW, TWTR, TXRH, TXT, ULBI, ULH, USAK, USM, VC, VCRA, VICI, VIRC, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PLBC, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SLG, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 49B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 5.0%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n## Upcoming events for Friday, April 30th\n\n - Expected earnings:\n\n  ABBV, AON, AROC, AROW, ASIX, AVNT, AZN, B, BCPC, BRID, BSAC, CBOE, CCLP, CHTR, CL, CLX, CRI, CVEO, CVX, CWBC, DCOM, E, EEX, ESXB, FSBW, GT, GWW, HRC, HUN, IMO, IRMD, ITCB, ITW, JCI, JELD, LAZ, LFC, LHX, LSBK, LYB, MGP, MOG.A, MOG.B, NWHM, NWL, OFIX, OIIM, PBI, PFS, PIPR, PNM, POR, PSX, PSXP, QSR, SBFG, SHLX, SLCA, SPCB, WETF, WPC, WY, XOM\n\n - Ex-div:\n\n  AON, ASRV, BX, C, CARR, CASY, CBAN, CLB, CMCO, CNBKA, CZNC, DGICA, DGICB, DMLP, ELP, EVTC, EWBC, FAT, HAS, HEP, HESM, HFBL, KOF, KRP, LCUT, LYTS, MCI, NRG, NSEC, O, OHI, ORRF, PBCT, PEBO, PNW, SBNY, SBS, SGU, SPFI, SXT, SYF, TKC, TXN, WABC\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.4K)\n    - CFTC Copper speculative net positions (previous: 42.9K)\n    - CFTC Corn speculative net positions (previous: 522.7K)\n    - CFTC Crude Oil speculative net positions (previous: 500.0K)\n    - CFTC Gold speculative net positions (previous: 181.5K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.1K)\n    - CFTC Natural Gas speculative net positions (previous: -50.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -52.2K)\n    - CFTC Silver speculative net positions (previous: 41.7K)\n    - CFTC Soybeans speculative net positions (previous: 243.2K)\n    - CFTC Wheat speculative net positions (previous: 21.0K)\n    - Chicago PMI (consensus: 65.3, previous: 66.3)\n    - Core PCE Price Index (consensus: 0.3%, previous: 0.1%)\n    - Core PCE Price Index (consensus: 1.8%, previous: 1.4%)\n    - Dallas Fed PCE (previous: 1.80%)\n    - Employment Benefits (previous: 0.60%)\n    - Employment Cost Index (consensus: 0.7%, previous: 0.7%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.70%)\n    - Michigan Consumer Expectations (previous: 79.7)\n    - Michigan Consumer Sentiment (consensus: 87.4, previous: 86.5)\n    - Michigan Current Conditions (previous: 97.2)\n    - Michigan Inflation Expectations (previous: 3.7%)\n    - PCE Price index (previous: 1.6)\n    - PCE price index (previous: 0.2%)\n    - Personal Income (consensus: 20.3%, previous: -7.1%)\n    - Personal Spending (consensus: 4.1%, previous: -1.0%)\n    - Real Personal Consumption (previous: -1.2%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 344)\n    - U.S. Baker Hughes Total Rig Count (previous: 439)\n\n^^^^2021-04-28",
        "created_utc": 1619604015,
        "id": "gw5lmui",
        "permalink": "/r/RobinHood/comments/n0bei1/daily_discussion_thread_april_28th_2021/gw5lmui/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619632815.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 26th of April\n\n\n\n## Upcoming events for Monday, April 26th\n\n - Expected earnings:\n\n  ACI, AGNC, AIN, AMG, AMKR, AMP, ARE, ARLP, AXTA, BCLI, BOH, BRO, CATY, CBU, CCB, CDNS, CHKP, CNI, CVLG, DGICA, DGICB, DHIL, DORM, EBTC, EFSC, FBK, FBP, FCAP, FIX, FLXS, FNCB, FRAF, FRBA, HBT, HLX, HMST, HONE, HSII, HSTM, HTLF, IBTX, ILPT, JBT, JJSF, KOF, KREF, LII, LKFN, LXFR, LXRX, MASI, MEDP, MEDS, MKSI, MPB, MRBK, MSB, NBTB, NRIM, NTP, NWBI, NXPI, OMF, OTIS, OVBC, PCH, PEBK, PHG, PKG, PKX, PRK, PW, RBB, RMBI, RRC, SANM, SBAC, SCCO, SEB, SFBC, SSBI, SSD, SSNC, SUI, SVBI, TBI, TCF, TNET, TOWN, TSLA, TV, UHS, UHT, WIRE, WRI\n\n - Ex-div:\n\n  AZZ, CVLY, QIWI, SPNS\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.152%)\n    - 3-Month Bill Auction (previous: 0.025%)\n    - 5-Year Note Auction (previous: 0.850%)\n    - 6-Month Bill Auction (previous: 0.040%)\n    - Core Durable Goods Orders (consensus: 1.6%, previous: -0.9%)\n    - Dallas Fed Mfg Business Index (previous: 28.9)\n    - Durable Goods Orders (consensus: 2.5%, previous: -1.2%)\n    - Durables Excluding Defense (previous: -0.8%)\n    - Goods Orders Non Defense Ex Air (consensus: 1.5%, previous: -0.9%)\n    - Investing.com Gold Index (actual: 52.0%, previous: 48.9%)\n    - Investing.com S&amp;P 500 Index (actual: 33.1%, previous: 39.6%)\n\n## Upcoming events for Tuesday, April 27th\n\n - Stock splits:\n\n    - NSPR @ **1:15**\n\n - Expected earnings:\n\n  AAN, AAT, ABB, ABG, ACCO, ACGL, ACH, ADM, AHC, AJRD, AKO.A, AKO.B, AMD, AMGN, AMX, APAM, ARAY, ARVN, ATEN, ATNI, ATRC, AUDC, AWI, AWRE, BFST, BP, BSBR, BUSE, BXP, BYD, CAC, CALX, CASH, CB, CEQP, CHE, CHRW, CNC, COF, CROX, CRSP, CSGP, CYBE, CZWI, DTE, EBMT, ECL, EGP, EHC, EIX, ENPH, ENTG, EQR, ESBK, ESS, FBNC, FCF, FCPT, FELE, FEYE, FFIC, FFIV, FFNW, FFWM, FIBK, FISV, FRST, FSV, FTI, GE, GFF, GLW, GOOD, GOOG, GOOGL, GPK, HA, HAFC, HAS, HBCP, HEES, HFBL, HIW, HOPE, HRZN, HSBC, HUBB, HVT, HVT.A, IBA, IBCP, IEX, ILMN, IRBT, IVZ, JBLU, JNPR, KNSA, KTCC, LBC, LBRT, LDL, LECO, LLY, MANH, MATX, MDLZ, MKL, MMC, MMM, MRC, MSCI, MSFT, MSTR, MVBF, MXIM, NAVI, NCR, NOV, NVS, NXRT, ODT, OKE, OLN, OMAB, OPRA, OXSQ, PCAR, PFG, PHM, PII, PINS, PJT, PPBI, PPD, PROV, PSB, PTSI, QCRH, QTS, RCKY, RNDB, RNST, ROIC, ROP, RRD, RTX, RXN, SAN, SBUX, SCL, SFST, SHW, SMIT, SPFI, SQNS, SSTK, ST, SYF, SYK, SYX, TENB, TER, TFII, TKC, TPB, TRMK, TRMT, TRU, TSBK, TX, TXN, UBS, UDR, UMBF, UPS, USNA, V, VALE, VBTX, VET, VIST, WDR, WM, WNEB, WSBC, WSBF, WW, YUMC\n\n - Ex-div:\n\n  AM, ATR, BK, CALM, ENTG, IFS, QADA, QADB, VSEC\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 1.300%)\n    - API Weekly Crude Oil Stock (previous: 0.436M)\n    - CB Consumer Confidence (consensus: 113.0, previous: 109.7)\n    - Dallas Fed Services Revenues (previous: 21.6)\n    - House Price Index (previous: 1.0%)\n    - House Price Index (previous: 12.0%)\n    - House Price Index (previous: 316.7)\n    - Redbook (previous: -17.2%)\n    - Redbook (previous: 13.5%)\n    - Richmond Manufacturing Index (previous: 17)\n    - Richmond Manufacturing Shipments (previous: 22)\n    - Richmond Services Index (previous: 16)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 11.7%, previous: 11.1%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.1%, previous: 1.2%)\n    - Texas Services Sector Outlook (previous: 28.9)\n\n## Upcoming events for Wednesday, April 28th\n\n - Expected earnings:\n\n  AAPL, ADP, AER, AFL, AGI, AKR, ALGN, ALRS, ALSN, ALTA, AM, AMED, APH, AR, ARCC, ASGN, ATOM, ATUS, AUY, AVB, AVT, AVTR, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BHLB, BLKB, BPOP, BRKL, BSMX, BSX, BXMT, CAKE, CAMT, CBTX, CCS, CDE, CHEF, CHX, CINF, CIT, CLR, CME, CMO, CNMD, CNO, CONE, CPF, CSTM, CUBI, CYH, DAN, DISCA, DISCB, DISCK, DMRC, DRE, DX, EBAY, ECHO, EQIX, ESI, ESRT, ETR, EVA, EVR, EXR, EXTR, F, FARO, FB, FCNCA, FISI, FNF, FORM, GD, GIB, GRMN, GRUB, GSK, GTY, HBNC, HELE, HES, HESM, HNI, HOLX, HT, HUM, IART, ICAD, ICLR, INOV, INVH, IPG, IRT, ISBC, JAKK, KALU, KNL, KRA, KRC, LC, LFUS, LIVN, LOGI, LXU, MAA, MAS, MC, MCO, MCRI, MEOH, MGM, MGRC, MHH, MHO, MLP, MN, MOH, MORN, MPX, MSVB, MTDR, MTH, MUSA, MXL, NBR, NGVT, NLY, NOA, NOVA, NOW, NSC, NTB, NYCB, OBNK, OC, OI, OII, OIS, ORLY, ORN, OSK, OVLY, OVV, PAG, PB, PDM, PEGA, PGRE, PI, PPC, PSA, PTC, QCOM, R, RBBN, RE, RES, RJF, RNR, ROK, ROL, RWT, SAIA, SC, SGC, SHOO, SHOP, SIGI, SIRI, SIX, SJW, SLAB, SLGN, SMED, SNY, SONY, SP, SPOT, SRDX, SREV, SRI, SSB, SWK, SXC, TDOC, TDY, TECK, TEVA, TKR, TNL, TR, TROX, TTEK, TTMI, TWOU, TYL, UCTT, UFI, UMC, URI, UVE, UVSP, VNE, VRT, VRTS, VSEC, VVV, WCN, WELL, WERN, WH, WING, WNC, WRE, WWW, YNDX, YUM\n\n - Ex-div:\n\n  BPMP, BSRR, CFG, FRC, ITUB, KEN, KNOP, MAIN\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.416M)\n    - Crude Oil Inventories (previous: 0.594M)\n    - Cushing Crude Oil Inventories (previous: -1.318M)\n    - Distillate Fuel Production (previous: -0.088M)\n    - EIA Refinery Crude Runs  (previous: -0.286M)\n    - EIA Weekly Distillates Stocks (consensus: -0.956M, previous: -1.074M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.7%, previous: 1.0%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision\n    - Gasoline Inventories (consensus: 0.464M, previous: 0.086M)\n    - Gasoline Production (previous: -0.229M)\n    - Goods Trade Balance (previous: -87.07B)\n    - Heating Oil Stockpiles (previous: 0.563M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 8.6%)\n    - MBA Purchase Index (previous: 295.5)\n    - Mortgage Market Index (previous: 724.8)\n    - Mortgage Refinance Index (previous: 3,219.9)\n    - Retail Inventories Ex Auto (previous: 1.2%)\n    - Wholesale Inventories (previous: 0.6%)\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALGT, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARES, ARW, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLDR, BLMN, BMRN, BMY, BSIG, BSVN, BVN, BWB, BY, BZH, CARR, CASA, CAT, CBNK, CBRE, CBZ, CCOI, CDNA, CENX, CFR, CFX, CG, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COP, COR, COWN, CPT, CQP, CRAI, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CURO, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DVD, DXCM, EBC, EBS, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, ERIE, ERII, ERJ, ETH, EVBN, EVTC, EXLS, EXPO, FBC, FBHS, FCN, FDUS, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FSP, FTAI, FTNT, FTV, FWRD, GEO, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GPI, GRA, GSHD, GT, GWB, HAYN, HGV, HIG, HP, HSY, HTGC, HUBG, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INSM, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBAI, LBPS, LEVL, LFVN, LH, LKQ, LLNW, LMAT, LOCO, LPLA, LTC, LTRX, LYG, MA, MATW, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MO, MRK, MRLN, MTLS, MTRN, MTSI, MTZ, NATI, NDLS, NEM, NIO, NLSN, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, OCFC, OFC, OMCL, ONEW, ONTO, OPI, OPOF, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCB, PCG, PCSB, PEB, PFPT, PH, PMBC, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SCX, SF, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SMMF, SNDR, SNP, SO, SPGI, SPSC, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TPL, TPR, TPX, TREE, TROW, TRS, TRTN, TRUP, TW, TWTR, TXRH, TXT, UBSI, ULBI, ULH, USAK, USM, UTL, VC, VCRA, VICI, VIRC, VKTX, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 49B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 4.7%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n^^^^2021-04-26",
        "created_utc": 1619431217,
        "id": "gvww79d",
        "permalink": "/r/RobinHood/comments/myu6ia/daily_discussion_thread_april_26th_2021/gvww79d/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619460017.0
    },
    {
        "author": "beesemode",
        "body": "Yes, TSMC, Intel, Micron, etc all buy Equipment from Amat, LRCX, KLA, etc. You literally cannot make a chip without equipment from Amat and LRCX. Anytime a fab is built, equipment is bought from those companies. Hope that helps",
        "created_utc": 1617295444,
        "id": "gt1qm4o",
        "permalink": "/r/stocks/comments/m1orcz/does_tsmc_rely_on_lrcx_amat_klac_etc/gt1qm4o/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617324244.0
    },
    {
        "author": "kkInkr",
        "body": "There are bunch of chip companies, why just focus on AMD, NVDA, INTC, TSM.\n\nADI, AMAT, ASML, ATEYY, AVGO, KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI, QCOM, QRVO, SIMO, SWKS, TER.\n\nThere's also some small ones: Pixelworks, Himax.\n\nThere's also the design part: CDNS, SNPS.",
        "created_utc": 1617547643,
        "id": "gtcnpap",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtcnpap/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617576443.0
    },
    {
        "author": "GearheadGaming",
        "body": "Serious answer though, I'm not big on fabless semi companies, and at current valuations Himax is a little pricey, even for a semi.\n\n[Full disclosure, I sold my TSM at $124, and all I've got left in it at the moment is some call spreads](https://imgur.com/a/1NTT3Ag)\n\nI much prefer pure play foundry's, integrated companies, or front-end equipment makers.  That means TSM, INTC, MU, TSEM, Samsung, and TXN as your semi stocks, ASML, AMAT, KLAC, LRCX as your front end capital guys.  I also like AMKR and ICHR, even though they aren't technically on the front end side of things, and maybe 3-6 months from now I'll perk up on companies like KLIC.\n\nI'm not big on HIMAX's short term prospects, because I think the semi shortage will hurt them as much as help them, and I'm not big on their long-term prospects because I think it's only a matter of time before a bigger fabless company acquires one of Himax's direct competitors.",
        "created_utc": 1617548106,
        "id": "gtcokeu",
        "permalink": "/r/wallstreetbets/comments/mjwtjr/buyyyyy_himx_to_the_mar/gtcokeu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617576906.0
    },
    {
        "author": "Investing8675309",
        "body": "Someone else got ASML which is the correct answer and the fab tool granddaddy since they build litho, the most complex process.\n\nPartial credit answers are other tool makers in wet etch/rinse like Tokyo Electron. I pasted a list below. You can also get the specialty chem makers like Hitachi chemical, Fujifilm, etc though that is a much more indirect play and wouldn’t go that route. Just get ASML.\n\nTool makers: Falcon Process Systems, Inc., Cleaning Technologies Group, Solid State Equipment, Screen Holdings Co., Ltd., Tokyo Electron Limited, Kla Tencor Corp., Yield Engineering Systems, Inc., FSI International, Semsysco GmbH, and Modutek Corporation.",
        "created_utc": 1618652087,
        "id": "gutp8tf",
        "permalink": "/r/stocks/comments/msl1js/alternative_semiconductor_stocks/gutp8tf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618680887.0
    },
    {
        "author": "Floppytodd",
        "body": "AMAT and KLA, but it’s fairly baked in",
        "created_utc": 1617991686,
        "id": "gtyh1ff",
        "permalink": "/r/RobinHood/comments/mngdhp/computer_chip_shortage_plays/gtyh1ff/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1618020486.0
    },
    {
        "author": "TheMailmanic",
        "body": "I think at this point you have to look at ntm EPS growth... companies with solid growth will likely see the returns follow suit.   Some multiple compression is possible as interest rates rise but the underlying business is solid in many of these names (tsm, klac, asml, lrcx, nvda, amd, etc)",
        "created_utc": 1618875856,
        "id": "gv565dr",
        "permalink": "/r/investing/comments/mu454g/future_outlook_for_semiconductor_manufacturing/gv565dr/",
        "score": 1,
        "subreddit": "investing",
        "created": 1618904656.0
    },
    {
        "author": "JhoLow_1MDB",
        "body": "Suppliers are better picks.  LCRX, AMAT, KLAC.\n\nAMAT is a monster.",
        "created_utc": 1617582922,
        "id": "gteig5c",
        "permalink": "/r/wallstreetbets/comments/mk3mcj/what_are_your_moves_tomorrow_april_05_2021/gteig5c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617611722.0
    },
    {
        "author": "JhoLow_1MDB",
        "body": "TSM beat in their latest earnings. Of note is that TSM revised CAPEX upwards by about 20% for 2021.  Calls on semi equipment suppliers.  AMAT, KLAC, ASML, LRCX.  This is surprise spending.  ASML, AMD, and LRCX also report very soon.  Start of a potential run.",
        "created_utc": 1618483780,
        "id": "guladt2",
        "permalink": "/r/wallstreetbets/comments/mrbmfj/daily_discussion_thread_for_april_15_2021/guladt2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618512580.0
    },
    {
        "author": "wearahat03",
        "body": "TSM is down probably because revenue guidance is flat and margin guidance is down.\n\nCapex is up big but it's not going to generate revenue anytime soon.\n\nTSM is more a 2+ year play, as they said it's in 2023 is when they can offer more capacity and supply will be less tight.\n\nThe more immediate semi players and biggest winners this year are semiconductor materials (AMAT, ASML, LRCX and KLAC). They are getting their revenue boost sooner as TSMC, Samsung etc. add capacity.",
        "created_utc": 1618497199,
        "id": "gulx348",
        "permalink": "/r/stocks/comments/mrb95v/rstocks_daily_discussion_options_trading_thursday/gulx348/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618525999.0
    },
    {
        "author": "HazardousMako",
        "body": "Interesting to see what this does to semiconductors seeing how most of them like AMAT, LRCX, KLAC, TSM, etc. all make most of their money in Asia.\n\nhttps://www.bbc.com/news/business-56685136",
        "created_utc": 1617939194,
        "id": "gtw4arh",
        "permalink": "/r/wallstreetbets/comments/mn04vf/what_are_your_moves_tomorrow_april_09_2021/gtw4arh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617967994.0
    },
    {
        "author": "Dematsa",
        "body": "AMAT, LRCX, AMD, KLAC, TSM",
        "created_utc": 1617574171,
        "id": "gte2qpz",
        "permalink": "/r/stocks/comments/mjrul6/long_term_stocks/gte2qpz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617602971.0
    },
    {
        "author": "ThisPomelo4",
        "body": "Your analysis is probably true for delta, but the problem with playing those names using vol is that the IV is higher. Options trading is most useful when you get the gamma cheap while also calling the direction right.\n\nI'm buying INTC 23Apr 70c because resistance at 65 has kept IV muted. My bet is that INTC will break through that resistance on 6Apr or 23Apr. I hate talking in terms of resistance in general, but looking at the long-term chart as well as price action in the morning after the Intel Unleashed event, it certainly seems like you'd need a big catalyst to justify a breakout beyond 65. I'd probably play those profits -- if any -- into AMD puts through to May, because I think hedge fund selling will take place when Lisa Su inevitably acknowledges the incorrectness of her prediction that supply \"tightness\" would clear up by 2H21.\n\nI also believe that the Archegos liquidation is another sign that correlated hedge fund losses will spell disaster for the market. We saw this already with GME and the other short-squeeze names. Chipmakers like to lay out their capex as close to production ramp-up as possible, which means that LRCX/AMAT/ASML/KLIC/KLAC/CAJ/etc won't book profits immediately even if billions of dollars are allocated to the roadmap. So I'm waiting for a big selloff this summer to get into those names as a long-term position. May try to play that selloff using hedgie favorites and names that have a lot of room to fall. ARKK, TSLA, TSM, NVDA come to mind. TSM seems counterintuitive but you get the added potential catalyst of Chinese brinkmanship as well as a deepening of the water supply woes.\n\nI mention CAJ because it gives a good read on DUV demand. Their equipment segment had a lot of profit growth last quarter. But it's not as good a play as the others because only a fifth of its revenue comes from that segment.",
        "created_utc": 1617331929,
        "id": "gt3qzmp",
        "permalink": "/r/options/comments/mi9kxb/playing_the_semiconductor_shortage/gt3qzmp/",
        "score": 1,
        "subreddit": "options",
        "created": 1617360729.0
    },
    {
        "author": "beesemode",
        "body": "Yes, TSMC, Intel, Micron, etc all buy Equipment from Amat, LRCX, KLA, etc. You literally cannot make a chip without equipment from Amat and LRCX. Anytime a fab is built, equipment is bought from those companies. Hope that helps",
        "created_utc": 1617295444,
        "id": "gt1qm4o",
        "permalink": "/r/stocks/comments/m1orcz/does_tsmc_rely_on_lrcx_amat_klac_etc/gt1qm4o/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617324244.0
    },
    {
        "author": "kkInkr",
        "body": "There are bunch of chip companies, why just focus on AMD, NVDA, INTC, TSM.\n\nADI, AMAT, ASML, ATEYY, AVGO, KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI, QCOM, QRVO, SIMO, SWKS, TER.\n\nThere's also some small ones: Pixelworks, Himax.\n\nThere's also the design part: CDNS, SNPS.",
        "created_utc": 1617547643,
        "id": "gtcnpap",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtcnpap/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617576443.0
    },
    {
        "author": "GearheadGaming",
        "body": "Serious answer though, I'm not big on fabless semi companies, and at current valuations Himax is a little pricey, even for a semi.\n\n[Full disclosure, I sold my TSM at $124, and all I've got left in it at the moment is some call spreads](https://imgur.com/a/1NTT3Ag)\n\nI much prefer pure play foundry's, integrated companies, or front-end equipment makers.  That means TSM, INTC, MU, TSEM, Samsung, and TXN as your semi stocks, ASML, AMAT, KLAC, LRCX as your front end capital guys.  I also like AMKR and ICHR, even though they aren't technically on the front end side of things, and maybe 3-6 months from now I'll perk up on companies like KLIC.\n\nI'm not big on HIMAX's short term prospects, because I think the semi shortage will hurt them as much as help them, and I'm not big on their long-term prospects because I think it's only a matter of time before a bigger fabless company acquires one of Himax's direct competitors.",
        "created_utc": 1617548106,
        "id": "gtcokeu",
        "permalink": "/r/wallstreetbets/comments/mjwtjr/buyyyyy_himx_to_the_mar/gtcokeu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617576906.0
    },
    {
        "author": "Floppytodd",
        "body": "AMAT and KLA, but it’s fairly baked in",
        "created_utc": 1617991686,
        "id": "gtyh1ff",
        "permalink": "/r/RobinHood/comments/mngdhp/computer_chip_shortage_plays/gtyh1ff/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1618020486.0
    },
    {
        "author": "JhoLow_1MDB",
        "body": "Suppliers are better picks.  LCRX, AMAT, KLAC.\n\nAMAT is a monster.",
        "created_utc": 1617582922,
        "id": "gteig5c",
        "permalink": "/r/wallstreetbets/comments/mk3mcj/what_are_your_moves_tomorrow_april_05_2021/gteig5c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617611722.0
    },
    {
        "author": "JhoLow_1MDB",
        "body": "TSM beat in their latest earnings. Of note is that TSM revised CAPEX upwards by about 20% for 2021.  Calls on semi equipment suppliers.  AMAT, KLAC, ASML, LRCX.  This is surprise spending.  ASML, AMD, and LRCX also report very soon.  Start of a potential run.",
        "created_utc": 1618483780,
        "id": "guladt2",
        "permalink": "/r/wallstreetbets/comments/mrbmfj/daily_discussion_thread_for_april_15_2021/guladt2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618512580.0
    },
    {
        "author": "kkInkr",
        "body": "There are bunch of chip companies, why just focus on AMD, NVDA, INTC, TSM.\n\nADI, AMAT, ASML, ATEYY, AVGO, KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI, QCOM, QRVO, SIMO, SWKS, TER.\n\nThere's also some small ones: Pixelworks, Himax.\n\nThere's also the design part: CDNS, SNPS.",
        "created_utc": 1617547643,
        "id": "gtcnpap",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtcnpap/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617576443.0
    }
]