[
    {
        "author": "greensymbiote",
        "body": "This is not entirely correct. They said they are projecting 11% based on the entire fintech market at large.  They said they are doing this to be conservative, excluding M&amp;A plans and iGaming growth potential in the US.  Also, other fintechs that have much higher multiples, have slower or similar growth.  For example, Shift4 reported only 4% y-o-y grwoth, Fiserv projects only 5% CAGR going forward while GPN's growth projection is on par with  Paysafe's. Meanwhle Paysafe's margins are growth faster than competitors like PayPal.",
        "created_utc": 1617228474,
        "id": "gsyq052",
        "permalink": "/r/stocks/comments/mhgcil/psfe_paysafe_the_most_undervalued_fintech_play_on/gsyq052/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1617257274.0
    },
    {
        "author": "tms2004",
        "body": "My dark horse for this is ASZ- Foley’s group bought a decent portion of Fiserv, which was started by Jeff Yabuki (who is now Chairman at sportradar). Foley and Yabuki had overlap on Fiserv board and Foley has Vegas connections and NHL connections. Own ASZ and SRNG",
        "created_utc": 1614714587,
        "id": "gpg8oim",
        "permalink": "/r/SPACs/comments/lw8g4e/source_sportradar_reaches_deal_to_go_public_via/gpg8oim/",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1614743387.0
    },
    {
        "author": "nunastig",
        "body": "If you want suggestions, take a look at some pharma. REGN looks like a good long term value play. Other than that take a look at FISV if you’re interested. Good luck going forward.",
        "created_utc": 1615131443,
        "id": "gq3rwb1",
        "permalink": "/r/stocks/comments/lzspkk/long_term_investor/gq3rwb1/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615160243.0
    },
    {
        "author": "Valens_Research",
        "body": "Sounds very close to a report my firm writes for investment managers every month.\n\nThe biggest difference is rather than buying momentum in terms of price (which also has great academic support as a factor), we are looking for longer-term solutions for clients, so focus on business growth measured by asset growth.\n\nWe also follow a scorecard approach, scoring on a company’s ROA, asset growth, and P/E, rather than just screening alone. We’ve seen that using this scorecard actually works in the long-run. The screen of the top 50 names measured by the Quality, Growth, and Valuation (QGV) scorecard has outperformed the market over the last twenty years. It highlights the value of looking at these kinds of metrics when doing idea generation - they can provide powerful signals.\n\nI can’t give out the full 50, but wanted to share the top 5 from the most recent month:\n\nCompany Name|Ticker|ROA|Asset Growth|Earnings Yield\n:--|:--|:--:|:--:|:--:\nTexas Pacific Land Trust|TPL|139%|94%|7.0%\nPrestige Consumer Healthcare|PBH|46%|192%|6.6%\nFederated Hermes|FHI|66%|29%|10.6%\nCommScope|COMM|49%|42%|7.0%\nFiserv|FISV|86%|129%|4.5%\n\nThe one important thing to point out on the above is that our firm is focused on accounting adjustments, and cleaning up bad traditional accounting under GAAP (listen to anything Buffett, Klarman, etc. have to say on the matter…) so the factors we look at are different than what is found on something like Yahoo Finance. I just wanted to point that out since the numbers above won’t quite match something from Bloomberg etc.\n\nThese names are also less covered (or at least some are less covered) than the traditional names one sees as hot stocks today.\n\nGreat idea to start having discussions about how to find great undiscovered names, and what screens/ratios/scorecards/factors are the best for finding alpha.",
        "created_utc": 1614717984,
        "id": "gpggmro",
        "permalink": "/r/investing/comments/lvr5rl/list_of_stocks_ranking_highest_in_momentum/gpggmro/",
        "score": 1,
        "subreddit": "investing",
        "created": 1614746784.0
    },
    {
        "author": "ComradeMoneybags",
        "body": "Retention is an on-going concern and lots of the recent plays, while not desperate, feel like go-big-or-go home plays. I don’t blame them—the main Square ecosystem isn’t revolutionary. \n\nI have some $SQ, but a lot more in $FISV.",
        "created_utc": 1616949273,
        "id": "gslcuxy",
        "permalink": "/r/stocks/comments/mdkurp/rstocks_daily_discussion_fundamentals_friday_mar/gslcuxy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1616978073.0
    },
    {
        "author": "ContestImpressive",
        "body": "I really hope he reads these when he gets home after a long hard day of shilling for the hedgies and his overlords over at Melvin and Citadel.  \n\nImagine Cry Bitch Jimmy Cramer walking into his home, throwing his suit jacket over the back of the couch.  He shuffles into the kitchen and reaches for the $SJM to make his favorite PBJ sandwich. Pops a cold $BUD and heads to the couch where he pops open his $IBM toughbook, opens up $MSFT Internet Explorer and pecks his was to WSB to see what his favorite retards are up to AH. He can't help but to search the subreddit for his name.  As he sorts by trending he hears the muffled moans of orgasmic euphoria echoing from his bedroom.  He rolls his eyes as he realizes he'll be sleeping on the couch tonight since his wife's boyfriend is sleeping over tonight. He continues scrolling through WSB reading every retarded post about him he can find.  He begins to feel sadness and a lump in his throat and he thinks about his 401k being down 2.5 points on the day.  Tears swelling in his eyes as he hears the unmistakable sound of a hand slapping and smacking his wife's bare ass as she moans in pleasure as her boyfriend rails her for the fifth time tonight. Jimmy knows he will never be able to satisfy his wife the way her boyfriend can.  He closes WSB as the tears of disappointment and rage roll down his face.  How dare these selfish retail traders, who know nothing about investing, question me and CNBC!  How dare they make money! MONEY IS FOR HEDGIES ONLY! he exclaims. He navigates to his bookmarks to find his favorite cuck porn help him relieve the swelling rage, anger, and fear that have been building within him over the past two months.  How much more of this can I take he wonders and he manually stimulates himself to cuck porn while his wife and her boyfriend begin round six in the next room over, all the while tears streaming down his face.  Finally after several hours he achieves a sweet release however his anger still remains balled up inside him.  In a fit of rage he throws his $IBM toughbook to the floor and pulls out his $T $AAPL iPhone and heads over to $TWTR where he goes on an 18 tweet rant about the retards on WSB before he finally passes out after his 9th $BUD.",
        "created_utc": 1614723261,
        "id": "gpgst0e",
        "permalink": "/r/wallstreetbets/comments/lw6p1r/rkt_on_cnbc_already_gratz_guys_you_can_sell_now/gpgst0e/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1614752061.0
    },
    {
        "author": "JLECVICTORY",
        "body": "You have the option to either take the dividend in cash or take it in shares, which is called a dividend reinvestment program (DRIP).\n\nIf you are taking cash with your IBM example, IBM pays a dividend of $1.63 for every share you have once a quarter. So if IBM keeps the dividend at $1.63 for every quarter, that means you get $6.52 ($1.63 * 4) a year for every share you own. \n\nSo if you want to get $20k a year from IBM alone, you would need to have about 3,067 shares. You get $6.52 a year for every share times 3,067 which equals about $20k. IBM currently trades for about $120 a share, so it would require you to $368,040 worth of stock in order to get $20k a year. \n\nHope this helps!",
        "created_utc": 1614735134,
        "id": "gphgeh0",
        "permalink": "/r/stocks/comments/lw4sut/to_the_people_who_are_cashing_out_their_102030/gphgeh0/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1614763934.0
    },
    {
        "author": "Doctor-Feelgood",
        "body": "Decent earnings, good guidance, daily rsi is over sold territory, institutional inflow, partnerships (IBM, 3M), TITAN (Anduril+PLTR+USArmy).... that said, strike/date/size is up to you depending on your risk/reward",
        "created_utc": 1614724126,
        "id": "gpgumt3",
        "permalink": "/r/wallstreetbets/comments/lwdvpf/pltr_yolo/gpgumt3/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614752926.0
    },
    {
        "author": "YEET_THE_VOTE",
        "body": "IBM developing COVID multi pass for NY - https://www.governor.ny.gov/news/governor-cuomo-announces-pilot-program-testing-excelsior-pass-madison-square-garden-and",
        "created_utc": 1614709101,
        "id": "gpfvuel",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpfvuel/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614737901.0
    },
    {
        "author": "JimJamSquatWell",
        "body": "I know you are getting flack for this but I think you have a point - look at palisamo/ginetty at IBM buying back shares to hit their arbitrary EPS metric promise.\n\nThe company is the definition of stagnation so buy backs were a way to influence that metric.\n\nI worked at IBM during that time and it was and still is a terrible place for 75% of the employees, that money did nothing to change IBMs ability to be competitive in the market.\n\nI don't think buy backs are always negative but they are certainly a lever to pull and companies can pull that lever too much.",
        "created_utc": 1614705228,
        "id": "gpfmxzr",
        "permalink": "/r/investing/comments/lw3v1m/warren_buffett_says_berkshires_apple_investment/gpfmxzr/",
        "score": 2,
        "subreddit": "investing",
        "created": 1614734028.0
    },
    {
        "author": "ilinula",
        "body": "IBM generates plenty of cash to cover its high dividend as well as share buy backs. What does that have to do with their ability to be competitive in the market? Free cash flow yield is a completely different metric, and it returns more value to shareholders for a company that is stagnating or declining. It's perfectly reasonable for them to buy back shares instead of sit on cash. I would prefer to hold a company like this than one that continually is able to be 'competitive in the market' but doesn't generate any cash so it has to issue shares year-over-year in order to supplement it's growth",
        "created_utc": 1614707972,
        "id": "gpft96t",
        "permalink": "/r/investing/comments/lw3v1m/warren_buffett_says_berkshires_apple_investment/gpft96t/",
        "score": 2,
        "subreddit": "investing",
        "created": 1614736772.0
    },
    {
        "author": "ianyboo",
        "body": "&gt;  I basically only own dividend stocks (around 5 that aren't). I currently get little less than 20k a year in divs\n\nI'm quite new to this and only recently learned about dividends, I have one $120ish IBM stock and I think the dividend is 1.63 in order to get 20k in year from dividends how much IBM would someone need? I'm trying to wrap my head around the math but failing miserably. :)",
        "created_utc": 1614733563,
        "id": "gphddbq",
        "permalink": "/r/stocks/comments/lw4sut/to_the_people_who_are_cashing_out_their_102030/gphddbq/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614762363.0
    },
    {
        "author": "acppanday",
        "body": "IBM - it’s the hottest stock on the market",
        "created_utc": 1614711556,
        "id": "gpg1lp2",
        "permalink": "/r/wallstreetbets/comments/lw9kxm/a_picture_is_worth_a_thousand_words_next_stop_65/gpg1lp2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614740356.0
    },
    {
        "author": "cypressfunk",
        "body": "All depends on how many shares of said company. I don't own IBM, but I am assuming that is a quarterly dividend.  So that would be 1.63x4= $6.52 per share per year. 20,000/6.52= 3,067 shares.  \n\nThere is so much better value out there besides IBM. I work in IT and IBM stopped being creative and are a redhat (paid to much for it) and Mainframe shop. I still think LUMN is way undervalued and plays a great div. Also think Kroger is super undervalued when you look at other grocery suppliers. Oil is still sort of cheap and pays a good div.",
        "created_utc": 1614735451,
        "id": "gphh0kn",
        "permalink": "/r/stocks/comments/lw4sut/to_the_people_who_are_cashing_out_their_102030/gphh0kn/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614764251.0
    },
    {
        "author": "laughffyman",
        "body": "That is more of an indictment on IBM, not the practice of buying back shares.",
        "created_utc": 1614721580,
        "id": "gpgp2eb",
        "permalink": "/r/investing/comments/lw3v1m/warren_buffett_says_berkshires_apple_investment/gpgp2eb/",
        "score": 1,
        "subreddit": "investing",
        "created": 1614750380.0
    },
    {
        "author": "YEET_THE_VOTE",
        "body": "IBM developing COVID multi pass for NY - https://www.governor.ny.gov/news/governor-cuomo-announces-pilot-program-testing-excelsior-pass-madison-square-garden-and",
        "created_utc": 1614709101,
        "id": "gpfvuel",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpfvuel/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614737901.0
    },
    {
        "author": "JimJamSquatWell",
        "body": "I know you are getting flack for this but I think you have a point - look at palisamo/ginetty at IBM buying back shares to hit their arbitrary EPS metric promise.\n\nThe company is the definition of stagnation so buy backs were a way to influence that metric.\n\nI worked at IBM during that time and it was and still is a terrible place for 75% of the employees, that money did nothing to change IBMs ability to be competitive in the market.\n\nI don't think buy backs are always negative but they are certainly a lever to pull and companies can pull that lever too much.",
        "created_utc": 1614705228,
        "id": "gpfmxzr",
        "permalink": "/r/investing/comments/lw3v1m/warren_buffett_says_berkshires_apple_investment/gpfmxzr/",
        "score": 2,
        "subreddit": "investing",
        "created": 1614734028.0
    },
    {
        "author": "ilinula",
        "body": "IBM generates plenty of cash to cover its high dividend as well as share buy backs. What does that have to do with their ability to be competitive in the market? Free cash flow yield is a completely different metric, and it returns more value to shareholders for a company that is stagnating or declining. It's perfectly reasonable for them to buy back shares instead of sit on cash. I would prefer to hold a company like this than one that continually is able to be 'competitive in the market' but doesn't generate any cash so it has to issue shares year-over-year in order to supplement it's growth",
        "created_utc": 1614707972,
        "id": "gpft96t",
        "permalink": "/r/investing/comments/lw3v1m/warren_buffett_says_berkshires_apple_investment/gpft96t/",
        "score": 2,
        "subreddit": "investing",
        "created": 1614736772.0
    },
    {
        "author": "acppanday",
        "body": "IBM - it’s the hottest stock on the market",
        "created_utc": 1614711556,
        "id": "gpg1lp2",
        "permalink": "/r/wallstreetbets/comments/lw9kxm/a_picture_is_worth_a_thousand_words_next_stop_65/gpg1lp2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614740356.0
    },
    {
        "author": "Thomjones",
        "body": "Right. Is there any economic factors and market algorithms and behind the curtain stuff to explain why AMD has barely gone up in months? Noooo, it hasn't gone up because investor sentiment about Intel improved. Has clean energy gone crazy because they are pumping out products and making mad money? Nooooo, it's because the public THINKS it's going to pump out products and make mad money. Why did this stock spike today? \"Well, you see, this and that  and that and this\" Noooo, it's going up for no fucking reason. They just like the stock.",
        "created_utc": 1614752245,
        "id": "gpia4fk",
        "permalink": "/r/stocks/comments/lw5fn3/serious_question_if_99_of_firsttime_day_traders/gpia4fk/",
        "score": 23,
        "subreddit": "stocks",
        "created": 1614781045.0
    },
    {
        "author": "AFmedic9919",
        "body": "Halting the stock is good...intel tells us people wants to jump in!!!!",
        "created_utc": 1614716898,
        "id": "gpge28w",
        "permalink": "/r/wallstreetbets/comments/lw6hoh/rkt_megathread_for_march_2nd_2021/gpge28w/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614745698.0
    },
    {
        "author": "wine_o_clock",
        "body": "Not as a meme, is NOK a good 5G play? They’re one of the biggest owners of 5G patents. And I know “quality over quantity” is important in this regard, but they’re also a leader in patent “value” according to a few studies. Sources below:\n\nPatent quantity https://www.iam-media.com/who-leading-5g-patent-race-0\n\nThe Patent Power Index takes into account:\n\n&gt;growth, impact, generality and originality of communication patents\n\nSlide 11 https://www.ipwatchdog.com/wp-content/uploads/2019/07/SLIDE-DECK-apple-intel-07-30-2019-FINAL.pdf\n\nPatent value https://spectrum.ieee.org/static/interactive-patent-power-2017\n\nThoughts?",
        "created_utc": 1614751131,
        "id": "gpi8ma9",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpi8ma9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614779931.0
    },
    {
        "author": "vaultboy1963",
        "body": "I hope so, although part of me hopes it continues to slide to a reasonable reentry point.  I sold all my AMD a couple weeks ago, but I still believe in company.  It's got a great CEO, who was executing a good plan on all cylinders and taking advantage of Intel stepping on their own dicks.",
        "created_utc": 1614747820,
        "id": "gpi3thc",
        "permalink": "/r/options/comments/lwlowk/amd_analysis/gpi3thc/",
        "score": 3,
        "subreddit": "options",
        "created": 1614776620.0
    },
    {
        "author": "dunkaroo55",
        "body": "Life must suck with a half empty outlook. Do more DD. This would be very unexpected based on all available intel",
        "created_utc": 1614739110,
        "id": "gpho3ot",
        "permalink": "/r/wallstreetbets/comments/lw6hoh/rkt_megathread_for_march_2nd_2021/gpho3ot/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614767910.0
    },
    {
        "author": "RaguSpidersauce",
        "body": "Headline123,\n\nIronically, I am in the tech field and I'm weighted lower in tech.  Odd..  I've never thought about it.\n\nI am boring:\n\nIndex funds = 62%\n\nMaterial = 0%\n\nIndustrial = 11% (my employer's sector)\n\nFinancial (BRKB) = 2%\n\nEnergy (CVX) = 2%\n\nConsumer Discretionary (EXPE, IAC, LYV, MTCH, etc.)= 4%\n\nInformation Technology (CSCO, INTC) = 2%\n\nCommunications Services (DIS) = 4%\n\nReal Estate (O) = 4%\n\nHealth Care (JNJ, PFE) = 2%\n\nConsumer Staple (HD, WMT) = 6%\n\nUtility (PNW) = .6%",
        "created_utc": 1614727554,
        "id": "gph1nq2",
        "permalink": "/r/stocks/comments/lwcut9/is_it_necessary_to_diversify_out_of_tech/gph1nq2/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1614756354.0
    },
    {
        "author": "fifacb",
        "body": "I hate to say this on this sub, but you do realize that providing credible intel that makes people money is a great way to get them to believe you the next time. Both things can be true. RKT is an incredible opportunity, and the same posts may be trying to get you to dump your GME shares to get in. HF's etc aren't stupid and, if you believe in the shilling, they know retail only has a limited amount of capital. I am not telling anyone what to do, and I am holding my GME. That said, both things can be true.",
        "created_utc": 1614740873,
        "id": "gphrlt1",
        "permalink": "/r/wallstreetbets/comments/lwik1s/gme_vs_rkt_squeeze_comparison/gphrlt1/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614769673.0
    },
    {
        "author": "JamesBond88888",
        "body": "Trades at a 18 p/e much cheaper than INTC and more market share and tech",
        "created_utc": 1614770289,
        "id": "gpitw3x",
        "permalink": "/r/wallstreetbets/comments/lwqjlb/well_shit_looks_like_i_was_right_rkt_to_100_next/gpitw3x/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614799089.0
    },
    {
        "author": "GregTradPlWthWS",
        "body": "Look at INTC calls...very cheap and the US wants to go away from Taiwan Semi.....",
        "created_utc": 1614715185,
        "id": "gpga373",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpga373/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614743985.0
    },
    {
        "author": "mozebyc",
        "body": "I made some option calls for INTC\n\nSlight bad news, and I expect a dip, but they have announced GPUs and new flash storage.  I can see INTC around 87$ by april 16th",
        "created_utc": 1614720841,
        "id": "gpgnd8i",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpgnd8i/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614749641.0
    },
    {
        "author": "DowGoldRatio",
        "body": "Price targets are useless.  Own the stock as long as you believe in it.  Understand that once you do your due diligence to buy it, your DD never stops.  You are continuing to do DD as long ad you hold it.\n\nA perfect example was a client I had thst put about $20k in Dell the year they first went public.  He believed in their model of selling PCs they built to business customers.  He followed the company religiously.  \n\nThen years later, all of a sudden the company decided to get on the low margin business of selling TVs to retail customers.  Dell never built their own TVs sonthey were just another reseller.\n\nThis caused my client to decide to sell his now $1 million in Dell.  And he lived happily ever after. \n\nSo hold uour Intel until you believe they aren't innovating and growing like you think they should and move on to your next position.",
        "created_utc": 1614717429,
        "id": "gpgfbrq",
        "permalink": "/r/stocks/comments/lwaq49/how_long_of_a_hold_is_msft/gpgfbrq/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614746229.0
    },
    {
        "author": "Bl00D79",
        "body": "The chip crisis funding is going to help intel more.  They have US based facilities.",
        "created_utc": 1614747835,
        "id": "gpi3u8k",
        "permalink": "/r/wallstreetbets/comments/lwlohr/amd_analysis/gpi3u8k/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614776635.0
    },
    {
        "author": "ThisPomelo4",
        "body": "you got what you wished for two weeks ago. Gelsinger started in mid Feb. I like INTC here; I think it will outperform AMD due to the fab tightness/shortage at TSMC that affects AMD more heavily than Intel.",
        "created_utc": 1614766843,
        "id": "gpiqaxw",
        "permalink": "/r/options/comments/ipmvw9/leaps_on_intc/gpiqaxw/",
        "score": 1,
        "subreddit": "options",
        "created": 1614795643.0
    },
    {
        "author": "HandsyBad",
        "body": "INTC \n\nintel down on taiwan chip shortages and biden executive order.\n\nSHOULD BE SUPER UP!\n\nONLY SMALL LITHOGRAPHY DOMESTIC CHIP MAKER!\n\nWHEN IT MAKES SENSE MY BET IS GOES THROUGH THE ROOF!\n\nnonsense eventually gets realized.",
        "created_utc": 1614707912,
        "id": "gpft3xo",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpft3xo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614736712.0
    },
    {
        "author": "wilhelm96",
        "body": "INTC isn’t losing as much market share as projected.. yet",
        "created_utc": 1614706573,
        "id": "gpfq106",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpfq106/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614735373.0
    },
    {
        "author": "JRshoe1997",
        "body": "I would hold. Me personally I am invested in INTC and not AMD, but I believe that semiconductor companies will be huge and way bigger in the future.",
        "created_utc": 1614706197,
        "id": "gpfp67c",
        "permalink": "/r/stocks/comments/lvty8u/reddits_favorite_stocks_by_alphabet/gpfp67c/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614734997.0
    },
    {
        "author": "heyheymustbethemoney",
        "body": "What I hate about owning the Qs is there are some garbage names around the top holdings... specifically Intel.   \n\n\nOP. Both are at great prices right now, and I would split it in half and buy them now. No need to wait. There may be a little short term pain, but you will be good if its an actual investment.",
        "created_utc": 1614709118,
        "id": "gpfvvrm",
        "permalink": "/r/stocks/comments/lvuk88/what_would_you_do_with_5k/gpfvvrm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614737918.0
    },
    {
        "author": "yerawizardIMAWOTT",
        "body": "Miles ahead is a bit of an exaggeration. Intel 10 nm is going to catch up but it is weird seeing AMD ahead for once.",
        "created_utc": 1614703649,
        "id": "gpfjbdi",
        "permalink": "/r/stocks/comments/lvz0ry/rstocks_daily_discussion_technicals_tuesday_mar/gpfjbdi/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614732449.0
    },
    {
        "author": "ComfortMailbox",
        "body": "you are correct but why has the stock done what is it doing . IDK i think its a good comp owned by Intel (30% i believe) , the group holds 184 patents and patents pending and numerous IP licenses in the Video Eye wear field. On January 25, the company announced that it has partnered with the  overseas subsidiaries of KDDI Group, one of Asia’s largest  telecommunications providers, in order to provide its smart glasses to  customers in Asia.  Also February 4, Vuzix said it had completed the first phase of development  with a US medical partner to build a customized head-mounted display  system for assisted cancer surgery. So, it does look like its going in the right direction (for me anyways) and also i tried their product once and i quite liked it so there is also that.",
        "created_utc": 1614720245,
        "id": "gpgm0dl",
        "permalink": "/r/stocks/comments/lw5ejc/vuzi_long_term_hold/gpgm0dl/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614749045.0
    },
    {
        "author": "Everyman_B",
        "body": "2.. So a midcap stock for ntm. AMD? INTC?",
        "created_utc": 1614725711,
        "id": "gpgxy78",
        "permalink": "/r/options/comments/lwdy0j/cheap_option_calls/gpgxy78/",
        "score": 1,
        "subreddit": "options",
        "created": 1614754511.0
    },
    {
        "author": "Kobeissi2",
        "body": "Honestly. Their Ryzen line is miles ahead of Intel and their RX 6XXX series are getting closer to Nvidia. It never seems to go up.",
        "created_utc": 1614700899,
        "id": "gpfd47m",
        "permalink": "/r/stocks/comments/lvz0ry/rstocks_daily_discussion_technicals_tuesday_mar/gpfd47m/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614729699.0
    },
    {
        "author": "DrBix",
        "body": "Picked up some INTC Jan 21 2022 60 Call on Monday.  Not cheap, but could pay out huge.  Might pick up more on the dip tomorrow.",
        "created_utc": 1614721205,
        "id": "gpgo7hw",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpgo7hw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614750005.0
    },
    {
        "author": "PetulantWaffle",
        "body": "Intel is told to pay $2.18 billion after losing a patent trial. Yesterday. Look it up.",
        "created_utc": 1614751629,
        "id": "gpi9aly",
        "permalink": "/r/pennystocks/comments/lo4jjc/nlst_netlist_inc_vs_google_google_lost_and_now_is/gpi9aly/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1614780429.0
    },
    {
        "author": "cartertown11",
        "body": "NLST broke 1.50 today a new high. 🚀🚀🚀\nAfter the hynix and google trial finish this will explode. Intel lost to VSLI today for patent infringement for 2.18 billion. NLST on deck",
        "created_utc": 1614721933,
        "id": "gpgpvkw",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpgpvkw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614750733.0
    },
    {
        "author": "iamfromatlanta",
        "body": "Compute Health Acquisition $750MM SPAC raised by Intel Chairman and backed by Medtronic, next big thing but needs time for a proper acquisition. Keep it on your radar.\n\nhttps://markets.businessinsider.com/news/stocks/intel-chairman-raises-750-million-compute-health-spac-backed-medtronic-2021-1-1029986635",
        "created_utc": 1614713158,
        "id": "gpg5dot",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpg5dot/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614741958.0
    },
    {
        "author": "DowGoldRatio",
        "body": "Go to [Stockcharts.com](https://Stockcharts.com)  It's free unless you want to save and keep your charts.  \n\nEnter this symbol     AAPL:INTC   which will show you a ratio chart of the two.  I use ratio charts all the time to pick between two positions, (stocks or ETFs) that I may like.  \n\nIf the chart is going up, the first symbol is outperforming the second.\n\nIf the chart is falling, the second symbol is outperforming\n\nIf the chart is going sideways, they are doing about equally well.\n\nSee if you can change the time period to ten years.\n\nWhat you will see is that AAPL and INTC pretty much performed the same until 2020 when AAPL took off and clobbered INTC&gt;\n\nBUT around January 1 2021, that relationship changed.  Change the time period to year to date.\n\nYear to date AAPL is down about 5% while INTC is up about 25%.  \n\nI would go with the one what's going up the mostest.  That's Intel.\n\nYou can do the same with SPY:QQQ and see that QQQ has clobbered the S&amp;P since 2013.\n\nQQQj:QQQ shows QQQJ is the one going up the most.\n\nBut if you want to see the one blowing virtually everything else out of the water, use FNGU as the first symbol and substitute any thing else for the second one.   Make your chart three years as FNGU has only been out that long.",
        "created_utc": 1614713341,
        "id": "gpg5syo",
        "permalink": "/r/stocks/comments/lvuk88/what_would_you_do_with_5k/gpg5syo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614742141.0
    },
    {
        "author": "PetulantWaffle",
        "body": "Intel is told to pay $2.18 billion after losing a patent trial. Yesterday. Look it up.",
        "created_utc": 1614751687,
        "id": "gpi9dje",
        "permalink": "/r/pennystocks/comments/lo4jjc/nlst_netlist_inc_vs_google_google_lost_and_now_is/gpi9dje/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1614780487.0
    },
    {
        "author": "ockuts",
        "body": "Almost bought intc....talked myself out of it",
        "created_utc": 1614707716,
        "id": "gpfsnj9",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpfsnj9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614736516.0
    },
    {
        "author": "getmoneyTb",
        "body": "Intc looks decent rn",
        "created_utc": 1614725793,
        "id": "gpgy4cb",
        "permalink": "/r/options/comments/lwdy0j/cheap_option_calls/gpgy4cb/",
        "score": 1,
        "subreddit": "options",
        "created": 1614754593.0
    },
    {
        "author": "PingPongPeco",
        "body": "The day I finally buy INTC FD's again they get slapped a 2b fine.. ok.",
        "created_utc": 1614746145,
        "id": "gpi15d2",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpi15d2/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1614774945.0
    },
    {
        "author": "the_ukes",
        "body": "Ahh ok! Appreciate the intel 🙏 I will hope the market contains to stay relatively low for anither day or so and go into a Bank to set up a Direct Investing/Trading Account. \nI believe TD is the frontrunner when it comes to that..",
        "created_utc": 1614710010,
        "id": "gpfxyir",
        "permalink": "/r/CanadianInvestor/comments/lvzh8n/daily_discussion_thread_for_march_02_2021/gpfxyir/",
        "score": 0,
        "subreddit": "CanadianInvestor",
        "created": 1614738810.0
    },
    {
        "author": "Aikmero",
        "body": "Yes. The tech sector will drop. It's over valued anyways, and I want a better entry for TSM and INTC. \n\nCheck the industrial stocks during the 2000 pop. Oil will be fine if silicon valley implodes, I'm betting on it, so I hope it plays out similarly. \n\nI also whole hearted believe the US will be in a balance sheet recession like Japan was.\n\nInflation will not actually manifest in a meaningful way and it will baffle people like it baffled economists in Japan for 30 years.",
        "created_utc": 1614755847,
        "id": "gpielqq",
        "permalink": "/r/options/comments/lwfsl5/help_me_find_a_5_stock_with_weekly_options/gpielqq/",
        "score": 0,
        "subreddit": "options",
        "created": 1614784647.0
    }
]