[
    {
        "author": "notherday11",
        "body": "As we all know, the early pioneers of mobile phones like Blackberry, Palm, Motorola and Nokia are all top contenders within the space today /s",
        "created_utc": 1621547844,
        "id": "gyviejt",
        "permalink": "/r/stocks/comments/ngvmrw/rstocks_daily_discussion_options_trading_thursday/gyviejt/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1621576644.0
    },
    {
        "author": "bungholio99",
        "body": "Not a financial advisor but i like Lenovo and UBS does to.\nGrown to biggest P.C manufacturer, while being cheap compared to (&gt; 10 HKD) DELL and HP, even wins marketshare during Chip Crisis.\n\nMany mergers (IBM,Fujitsu,Motorola) great JV Netapp, Absolute Software, Instore\n\nInvestor and supplier of NIO.\n\nPays dividend",
        "created_utc": 1619975375,
        "id": "gwompkh",
        "permalink": "/r/ValueInvesting/comments/n3ada1/what_is_a_company_where_you_personally_have/gwompkh/",
        "score": 8,
        "subreddit": "ValueInvesting",
        "created": 1620004175.0
    },
    {
        "author": "Jagrmeister27",
        "body": "I worked for them back when three year contracts were a thing... the amount of stories I could tell... My favourite was one where a young girl who was no older than sixteen had somehow used her phone without registering on her devices data that she used 20 gbs of data. So I call in and say “look dude, there’s gotta be a mistake, she has a blackberry curve and they didn’t take SIM cards so unless she switched IMEIs (something she would have to have done over the phone or online and would have left a paper trail) in the last couple weeks this didn’t happen”. The other guy (we have to call in to Telus office from the store) proceeds to argue with me and say he can’t do anything. She basically got saddled with (I think) a $1700 phone bill and Telus wouldn’t do anything despite it being obvious the mistake was theirs. We also all knew when we sold you garbage, such as the Motorola keyboard phone, the Blackberry Storm, and several other hot garbage devices that were defective as fuck.\n\nAlso, they were charged pay and talk clients to add features and minutes (.25 a minute) when they called the number, charging for things like automatic texts and honestly as a rep, I felt like it was my job in the end to protect the customer from my employer. I will say it has gotten better, and out of the three carriers, I trust Telus more than the other two.",
        "created_utc": 1620401373,
        "id": "gxa7x5h",
        "permalink": "/r/CanadianInvestor/comments/n6wz3q/telus_reports_operational_and_financial_results/gxa7x5h/",
        "score": 6,
        "subreddit": "CanadianInvestor",
        "created": 1620430173.0
    },
    {
        "author": "zxc123zxc123",
        "body": "*\"Weren't we silly for thinking those auto companies had a shot? They were the Nokia, Blackberry, and Motorola. Turns out Tesla wasn't Yahoo, but Apple plus crypto and actually going to mars. On the plus side, now GM/Toyota/BMW are now meme stocks that do specialized mechanical engineering infrastructure rather than cars.\"*",
        "created_utc": 1620081403,
        "id": "gwu7jxn",
        "permalink": "/r/wallstreetbets/comments/n3w3t6/apollo_buys_yahoo_and_yahoofinance_from_verizon/gwu7jxn/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620110203.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  5th of May\n\n\n\n## Upcoming events for Wednesday, May  5th\n\n - Stock splits:\n\n    - BRGGF @ **1:10**\n    - FRSB @ **105:100** (Payable date: 05/20/2021)\n\n - Expected earnings:\n\n  AAWW, ABC, ABEO, ABIO, ABUS, AC, ACAD, ACCD, ACR, ADMA, ADPT, ADT, ADTN, ADXN, AEGN, AEIS, AEL, AERI, AEZS, AFIN, AINC, ALB, ALCO, ALG, ALGM, ALL, ALLO, ALSK, ALTM, AMEH, AMOT, AMPE, AMPY, AMYT, ANAB, ANSS, AOSL, APA, APT, AQUA, ARAV, ARLO, ARNA, ASC, ASM, ASTE, ASYS, ATAX, ATLO, ATO, ATSG, ATTO, AVA, AVID, AVNW, AXGN, BAND, BBSI, BBU, BCOR, BCSF, BDC, BE, BFAM, BFS, BHR, BKNG, BLX, BRKR, BWA, BXRX, CCMP, CCRN, CCU, CDAY, CDNA, CDW, CENT, CENTA, CENX, CERN, CF, CFBK, CFMS, CIM, CKPT, CLDX, CLH, CLLS, CLNC, CLVS, CLW, CMLS, CMRE, CNDT, CNHI, CPA, CPE, CPSS, CRD.A, CRD.B, CRTO, CSGS, CSTE, CTSH, CUB, CUTR, CW, CXW, CYBR, DAR, DCP, DFIN, DGII, DHC, DHX, DIN, DLHC, DMAC, DNB, DNN, DNOW, DOC, DRTT, EAF, ECPG, EDIT, EFC, ELA, EMKR, EMR, EPM, EPR, EQH, EQT, EQX, ESTA, ESTE, ETSY, EVH, EVRI, EXC, EYEG, EYPT, FATE, FDP, FICO, FLEX, FLMN, FLOW, FLT, FMC, FMS, FNV, FORR, FOX, FOXA, FPAY, FRT, FSLY, FTS, FUN, FUNC, FVE, GAU, GBT, GDDY, GDOT, GEL, GFL, GFN, GGB, GIL, GKOS, GLAD, GLRE, GM, GMAB, GMRE, GNK, GOEV, GOLD, GPL, GRP.U, GSS, GSX, GTHX, HARP, HAYW, HBB, HCC, HDSN, HEAR, HFC, HLT, HMTV, HNGR, HPP, HR, HRTG, HRTX, HSON, HUBG, HUBS, HZNP, IEC, IIPR, IMXI, INMB, INMD, INSG, IO, IONS, ISEE, IVC, IVR, JLL, JRVR, KALA, KE, KIDS, KLIC, KRO, KTOS, KVHI, KW, LBTYA, LBTYB, LBTYK, LCI, LESL, LHCG, LILA, LILAK, LL, LMRK, LNC, LNSR, LOPE, LPI, LUMN, LUMO, MCS, MDCA, MDU, MDWD, MELI, MET, MFC, MG, MGPI, MGY, MLR, MLVF, MNKD, MNR, MOR, MRO, MTG, MTW, MYO, NBIX, NC, NEO, NESR, NGD, NHTC, NI, NL, NLTX, NMFC, NNA, NODK, NOTV, NP, NRZ, NUS, NUVA, NVEC, NVO, NVRO, NVST, NWN, NYT, OCDX, OCUL, ODP, OM, OMI, OPTN, ORA, ORCC, OSUR, PACE, PARR, PASG, PDCE, PEG, PEI, PETQ, PFGC, PFIE, PFLT, PGEN, PING, PLMR, PLYA, PNNT, PNW, PRA, PRI, PRIM, PRTA, PSN, PSNL, PTVE, PWFL, PYPL, QLYS, QNST, QRVO, QTRX, QTWO, QUOT, QURE, RCII, RCKT, RDFN, RDWR, REYN, RGLD, RGNX, RGR, RIGL, RKT, RLJ, RNGR, ROCK, ROOT, RPT, RSG, RUN, RYI, RYN, SAFT, SAR, SB, SBBP, SBGI, SBOW, SBRA, SCU, SGRY, SGU, SIMO, SITE, SJ, SJI, SKT, SLF, SLNG, SLRC, SMG, SMP, SMSI, SNEX, SNR, SPKE, SPR, SPWR, SRC, SRE, SRPT, SSSS, SSYS, STAA, STAY, STKL, STLA, STN, SUNS, SUP, SUPN, SWM, SYN, TALO, TCON, TCPC, TGB, TLND, TNDM, TPC, TPTX, TPVG, TRMB, TRNO, TT, TTGT, TUP, TVTY, TWLO, TWO, TXG, UBER, UFCS, UGI, UIHC, UNM, UPLD, USDP, UTHR, VAC, VAPO, VBIV, VCEL, VGR, VNDA, VRTV, VYGR, WAT, WHD, WLL, WMC, WRK, WTRG, WW, WYNN, XEC, XNCR, XPER, YELL, ZIXI, ZNGA\n\n - Ex-div:\n\n  AWI, CATC, CCK, ETR, FELE, FSBW, HMLP, IBTX, KBH, LSTR, MATX, NBN, NEP, NWBI, OFED, OMF, OPBK, SIMO, STBA, TX, VBTX, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 800K, previous: 517K)\n    - Chicago Fed President Evans Speaks\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: 1.218M)\n    - Crude Oil Inventories (consensus: -2.346M, previous: 0.090M)\n    - Cushing Crude Oil Inventories (previous: 0.722M)\n    - Distillate Fuel Production (previous: 0.071M)\n    - EIA Refinery Crude Runs  (previous: 0.253M)\n    - EIA Weekly Distillates Stocks (consensus: -1.120M, previous: -3.342M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.5%, previous: 0.4%)\n    - FOMC Member Mester Speaks\n    - FOMC Member Rosengren Speaks\n    - Gasoline Inventories (consensus: -0.652M, previous: 0.092M)\n    - Gasoline Production (previous: 0.243M)\n    - Heating Oil Stockpiles (previous: -0.175M)\n    - ISM NY Business Conditions (previous: 37.2%)\n    - ISM Non-Manufacturing Business Activity (consensus: 69.5, previous: 69.4)\n    - ISM Non-Manufacturing Employment (previous: 57.2)\n    - ISM Non-Manufacturing New Orders (previous: 67.2)\n    - ISM Non-Manufacturing PMI (consensus: 64.3, previous: 63.7)\n    - ISM Non-Manufacturing Prices (previous: 74.0)\n    - ISM-New York Index (previous: 804.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.17%)\n    - MBA Mortgage Applications (previous: -2.5%)\n    - MBA Purchase Index (previous: 281.4)\n    - Markit Composite PMI (previous: 62.2)\n    - Mortgage Market Index (previous: 706.6)\n    - Mortgage Refinance Index (previous: 3,185.3)\n    - Services PMI (previous: 63.1)\n\n## Upcoming events for Thursday, May  6th\n\n - Expected earnings:\n\n  AAOI, AAON, ABEV, ACET, ACIW, ACMR, ACOR, ACRS, ADAP, ADCT, ADNT, AE, AES, AGEN, AGLE, AGM, AGO, AGS, AHCO, AIG, AIRG, AIV, AJX, AL, ALBO, ALDX, ALE, ALTR, AMBC, AMC, AMH, AMN, AMPH, AMRK, AMRS, ANGI, ANIK, APLE, APPN, APRN, APTV, AQN, ARDX, ARPO, ARTNA, ARW, ASMB, ASRT, AT, ATEC, ATER, ATHX, ATNX, ATRI, ATRO, ATRS, AUMN, AUPH, AUTL, AUTO, AVD, AVLR, AVRO, AVXL, AVYA, AXDX, AXLA, AXNX, AXON, AY, AZUL, BAP, BBD, BBDO, BCC, BCRX, BCYC, BDSI, BDX, BECN, BHB, BILL, BIOL, BIP, BKD, BKI, BL, BLCM, BLD, BLDR, BLL, BRBR, BRT, BTN, BUD, BV, BWMX, BYND, CABO, CAH, CALA, CARG, CARS, CDK, CDR, CDXC, CDXS, CDZI, CECE, CELC, CEMI, CERC, CERT, CGNX, CHMA, CHRS, CHT, CHUY, CIA, CKX, CLBS, CLGX, CLI, CLNE, CLNY, CLRB, CLXT, CMBM, CMMB, CMRX, CNP, CNQ, CNXN, COLD, COLL, COMM, CORE, CORT, CPLG, CQP, CRAI, CSII, CSOD, CTHR, CTIC, CTLP, CTMX, CTOS, CTRE, CTT, CUE, CVET, CVNA, CWEN, CWEN.A, CWK, CYTK, CZNC, DBX, DDOG, DEN, DIOD, DLA, DLX, DMLP, DOCN, DRH, DRNA, DVAX, DWSN, EB, ECOM, ECOR, ED, EGAN, EGLE, EIGR, ELOX, ELY, ENDP, ENG, ENTA, ENV, EOG, EPAM, EPC, EPIX, EPZM, ERII, ESGR, ET, ETTX, EURN, EVC, EVFM, EVOP, EVRG, EXEL, EXPE, EXPI, FARM, FBRX, FCRD, FDUS, FET, FIS, FIXX, FLDM, FLGT, FLIR, FLXN, FND, FNF, FNKO, FOCS, FOUR, FOXF, FPI, FRG, FRGI, FROG, FSTX, FTDR, FULC, FVRR, GBLI, GDEN, GDP, GDYN, GEOS, GH, GLOG, GLOP, GLPG, GNE, GNL, GOGO, GOLF, GOVX, GPMT, GPRO, GPX, GRA, GRPN, GRTS, GSAT, GSBD, GSIT, GTIM, GTS, GWRS, HAIN, HBIO, HCAT, HCI, HII, HIMX, HL, HMHC, HMPT, HSKA, HTA, HWCC, HWM, HZN, IAC, IBOC, ICL, ICPT, ICUI, IDCC, IGMS, IHC, IHRT, IIVI, IMKTA, IMMR, IMRA, INDT, INFU, INOD, INSM, INSW, INVE, IOVA, IRM, IRTC, IRWD, ISDR, ITCI, JOBS, JYNT, K, KDMN, KIQ, KL, KRP, KRTX, KTB, KURA, KWR, KZR, LADR, LASR, LAUR, LAZY, LBPS, LCTX, LCUT, LEE, LIN, LND, LNT, LOCO, LODE, LPCN, LPTH, LQDT, LRMR, LXRX, LYV, MACK, MAIN, MCHP, MCK, MDGL, MEIP, MFA, MGA, MGEE, MGTA, MGTX, MIDD, MIRM, MITO, MITT, MKTY, MMS, MNOV, MNPR, MNRL, MNST, MNTX, MP, MRAM, MRIN, MRNA, MRTX, MSI, MSON, MT, MTBC, MTD, MTX, MTZ, MUR, MYE, NATR, NBRV, NBY, NCLH, NEPH, NET, NFG, NGS, NGVC, NH, NINE, NJR, NKSH, NKTR, NLSN, NMRK, NNBR, NOMD, NRG, NRP, NSIT, NTCT, NTLA, NTRA, NTUS, NUZE, NVCN, NVMI, NWS, NWSA, NXTC, NYMT, OCSL, OCUP, OEC, OGE, OLED, OLP, ONCT, OPCH, OPGN, OPRT, OPRX, ORTX, OTEX, OTIC, OTRK, OUST, OVID, OYST, PAE, PAHC, PAYS, PBA, PBH, PBPB, PBYI, PCTI, PCTY, PDEX, PDFS, PENN, PFSI, PGNY, PHI, PHX, PK, PLM, PLNT, PLUG, PMT, PODD, POST, PPL, PRAA, PRDO, PRLB, PRMW, PRQR, PRVB, PTGX, PTMN, PTON, PWR, PZG, PZZA, QDEL, RC, REFR, REG, REGN, REPH, RETA, REZI, RGA, RGS, RMAX, ROKU, RPD, RVLV, SALM, SATS, SBH, SBR, SCM, SCOR, SCX, SEAS, SEEL, SELB, SEM, SFE, SFM, SGA, SHAK, SHYF, SIC, SIGA, SKM, SLDB, SMTS, SNCY, SNDX, SPH, SPLP, SPPI, SPRO, SPXC, SQ, SRLP, SRRA, SRRK, SRTS, SSRM, STFC, STMP, STOR, STWD, SUN, SUNW, SVMK, SVRA, SWX, SXI, SYNA, SYRS, TACT, TBIO, TCDA, TCX, TDAC, TDC, TDS, TECH, TEF, TEN, THS, TIPT, TMST, TMX, TPIC, TPL, TPR, TRGP, TRHC, TRIN, TRIP, TRUE, TRVI, TRVN, TSE, TTOO, TVTX, TWI, TWST, TXMD, UBX, UEIC, UEPS, UFS, UIS, UMH, UNIT, URGN, USCR, USM, USPH, UTI, VCTR, VEL, VER, VG, VHI, VIAC, VIACA, VIR, VIRX, VNRX, VNT, VNTR, VRAY, VRCA, VSTM, VSTO, VTVT, VWTR, VYNE, W, WBT, WCC, WD, WFCF, WFG, WLDN, WPG, WPM, WPRT, WRLD, WRN, WSTG, WTRH, XERS, XFOR, XHR, XLRN, XONE, XRAY, XTNT, XXII, Y, YELP, YMAB, YTRA, ZGNX, ZIOP, ZTS, ZYME\n\n - Ex-div:\n\n  AFB, AMSWA, ARLP, ARTNA, BKEP, BP, BPFH, BPRN, CADE, CBD, CEQP, CFFN, CIT, CMS, CVCY, DAN, FCBC, FCF, FE, FFWM, FHI, FRAF, FRBA, GPP, HCC, HOPE, HSII, INTC, JBHT, LAD, LBAI, LBC, LEVI, LW, MAC, MMLP, MMP, MPLX, NSC, NYCB, PCB, PCTI, PFC, PFE, PH, PKOH, PNFP, PPBI, PVBC, RBB, SIRI, SMBK, WAB, WAFD, WFC, WMT, WSFS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.000%)\n    - 4-Week Bill Auction (previous: 0.000%)\n    - Challenger Job Cuts (previous: 30.603K)\n    - Continuing Jobless Claims (consensus: 3,620K, previous: 3,660K)\n    - Initial Jobless Claims (consensus: 540K, previous: 553K)\n    - Jobless Claims 4-Week Avg. (previous: 611.75K)\n    - Natural Gas Storage (previous: 15B)\n    - Nonfarm Productivity (consensus: 4.3%, previous: -4.2%)\n    - Unit Labor Costs (consensus: -0.8%, previous: 6.0%)\n    - Wholesale Inventories (previous: 1.4%)\n\n^^^^2021-05-05",
        "created_utc": 1620208816,
        "id": "gx0cgk0",
        "permalink": "/r/RobinHood/comments/n5cbu5/daily_discussion_thread_may_5th_2021/gx0cgk0/",
        "score": 4,
        "subreddit": "RobinHood",
        "created": 1620237616.0
    },
    {
        "author": "urk_the_red",
        "body": "When an engineering company starts letting go of employees that’s never a good sign. That engineering experience is much harder to replace than slick haired business types realize. \n\n\nIf the disconnect between the engineers and the business types is too great it leads to short term decision making and an inability to compete in very short order. Just look at what happened to Motorola or IBM or any other company that forgets it’s an engineering company and just treats everything like interchangeable business widgets.",
        "created_utc": 1621812771,
        "id": "gz7sy2n",
        "permalink": "/r/pennystocks/comments/njfmcy/the_most_comprehensive_amount_on_info_with/gz7sy2n/",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1621841571.0
    },
    {
        "author": "Navas16",
        "body": "I prefer the safety of my mom’s basement...gambling meme stocks on my Motorola flip phone and eating leftover Domino’s",
        "created_utc": 1622161543,
        "id": "gzpabys",
        "permalink": "/r/wallstreetbets/comments/nmg57b/what_are_your_moves_tomorrow_may_28_2021/gzpabys/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622190343.0
    },
    {
        "author": "Confirmative",
        "body": "A buddy of mine bought the [Motorola StarTAC](http://en.wikipedia.org/wiki/Motorola_StarTAC) when it came out in 1996 and the instruction manual had a special note: \"The battery cover is not food, do not eat the battery cover.\" Personal responsibility has been dead for decades.",
        "created_utc": 1620240692,
        "id": "gx24wij",
        "permalink": "/r/stocks/comments/n5ikkk/peloton_recalls_treadmills_after_safety_warnings/gx24wij/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620269492.0
    },
    {
        "author": "SulkyVirus",
        "body": "Most companies that do CPUs only do CPUs. There are a number of companies that do GPUs, coolers, motherboards, fans, and other components. MSI is one, Corsair is another. There are a few bigger name ones that do pretty much everything you would need minus a CPU and a PSU (though some do PSUs).",
        "created_utc": 1621867998,
        "id": "gza18wl",
        "permalink": "/r/stocks/comments/njtw5g/rstocks_daily_discussion_monday_may_24_2021/gza18wl/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1621896798.0
    },
    {
        "author": "timmyv0814",
        "body": "His Motorola razr makes that difficult.",
        "created_utc": 1621616612,
        "id": "gyyo9kb",
        "permalink": "/r/wallstreetbets/comments/nhoua8/daily_discussion_thread_for_may_21_2021/gyyo9kb/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1621645412.0
    },
    {
        "author": "StonksInvesteur",
        "body": "Don’t buy on BestBuy. Go Amazon and get that MSI gs66 stealth rtx3000 series",
        "created_utc": 1620829198,
        "id": "gxutsvo",
        "permalink": "/r/wallstreetbets/comments/nal19o/daily_discussion_thread_for_may_12_2021/gxutsvo/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620857998.0
    },
    {
        "author": "Reasonable-Fig4061",
        "body": "I heard their new product is going to put a serious hurt on palm pilot and Motorola flip phones.",
        "created_utc": 1622503185,
        "id": "h04tk5b",
        "permalink": "/r/wallstreetbets/comments/npbyt0/what_are_your_moves_tomorrow_june_01_2021/h04tk5b/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622531985.0
    },
    {
        "author": "Jonm79",
        "body": "Tesla is the leader just like Apple for phones and google for search engines. They are the best, plain and simple. You don’t ask Jeeves or own a Motorola cell phone, do you?  Buy the Tesla stock but hold and don’t panic.",
        "created_utc": 1620932153,
        "id": "gy0eguq",
        "permalink": "/r/stocks/comments/nbm8lq/investing_25k_in_tesla_stock/gy0eguq/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620960953.0
    },
    {
        "author": "Saborizado",
        "body": "Corsair in my opinion is just another gaming hardware company that doesn't have any competitive advantage. They offer exactly the same as Razer, MSI, ASUS, Logitech, Alienware. People care who has the most powerful components and equipment, regardless of brand.",
        "created_utc": 1621843010,
        "id": "gz91wdd",
        "permalink": "/r/ValueInvesting/comments/nj8b6e/is_corsair_both_a_growth_and_value_stock/gz91wdd/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1621871810.0
    },
    {
        "author": "notimpressedimo",
        "body": "Shut your whore mouth I'm on a fucking Motorola DynaTAC",
        "created_utc": 1621727917,
        "id": "gz3ymih",
        "permalink": "/r/wallstreetbets/comments/ni1fw5/weekend_discussion_thread_for_the_weekend_of_may/gz3ymih/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1621756717.0
    },
    {
        "author": "Zachjsrf",
        "body": "Motorola Razr the old one",
        "created_utc": 1622069773,
        "id": "gzkmimk",
        "permalink": "/r/wallstreetbets/comments/nlq1js/what_are_your_moves_tomorrow_may_27_2021/gzkmimk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622098573.0
    },
    {
        "author": "WolfDog06",
        "body": "Simple my guy\n●Retail investors In 2020 have increased by a fuck ton compared to 1900\n● Coca cola is a consumer product. People need drinks and they are dominant in that market. People have always needed the demand for drinks for 100 of years. If you notice most food and beverage  companies have been around for 100 years but it's not the same for tech. Many tech companies have fallen off after a few years of growth( IBM, Motorola and many other companies)\n● If the demand for the products of a company simply reduces then the growth of thay company also reduces. This is a cycle we cannot measure and it is purely based off what the company  and its competitors can please its customers  for.\n● I agree companies will have growth for 20 years too but it's not all companies. It's only a fraction of the companies that will have growth in the next 20 years and they will get exhausted too once the company has no new products to offer which will meet the demands of its customer. The company share prices either declines or offer a good dividend to attract investors.",
        "created_utc": 1621280897,
        "id": "gyhfpgp",
        "permalink": "/r/investing/comments/nekops/who_said_that_cocacola_was_basically_done_growing/gyhfpgp/",
        "score": 1,
        "subreddit": "investing",
        "created": 1621309697.0
    },
    {
        "author": "Pnotebluechip",
        "body": "Back in 1991 I bought a Motorola bag phone, then became a bag holder of the stock. It took 20 years for everyone to \"need\" a cell phone. Change takes way longer than you think.",
        "created_utc": 1619958360,
        "id": "gwnjyqz",
        "permalink": "/r/investing/comments/n1zsic/ford_needs_to_rethink_their_strategy/gwnjyqz/",
        "score": 1,
        "subreddit": "investing",
        "created": 1619987160.0
    },
    {
        "author": "HackingTooMuchTime",
        "body": "Taiwan is cool af with me.  Bunvh of MSI and AMD parts in my computer.  They build good shit",
        "created_utc": 1621396566,
        "id": "gynneg8",
        "permalink": "/r/wallstreetbets/comments/nfklff/what_are_your_moves_tomorrow_may_19_2021/gynneg8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621425366.0
    },
    {
        "author": "PM_UR_FRUIT_GARNISH",
        "body": "You're missing the gaming demographic if you're trying to compare to TD and Fry's. Like Radio Shack, they catered too much to the hobbyist crowd, and essentially turned into a glorified RC car shop. GameStop has a chance with adding Razer, Corsair, Thermaltake, EVGA, MSI, and ASUS gear that appeals to a much wider audience. Hell, they could make themselves the best brick and mortar for liquid cooling, which is something that's sorely lacking even considering Microcenter. \n\nI don't think they should focus on stocking every component for every use case, but I think it would go a long way for them if they essentially browsed r/buildapc and kept popular products around while they're popular. Like the 011 Dynamic XL cases everyone has nowadays. A limited selection of AMD/Intel cpus + compatible, typical use case motherboards. Toss in some gamer branded ram like GSkill and a small selection of 650-850W psus, and they're a quick stop for console gamers and pc gamers alike.",
        "created_utc": 1620085342,
        "id": "gwufwhp",
        "permalink": "/r/stocks/comments/n3uk2j/gamestop_completes_voluntary_early_redemption_of/gwufwhp/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620114142.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  6th of May\n\n\n\n## Upcoming events for Thursday, May  6th\n\n - Expected earnings:\n\n  AAOI, AAON, ABEV, ACET, ACIW, ACMR, ACOR, ACRS, ADAP, ADCT, ADNT, AE, AES, AGEN, AGLE, AGM, AGO, AGS, AHCO, AIG, AIRG, AIV, AJX, AL, ALBO, ALDX, ALE, ALTR, AMBC, AMC, AMH, AMN, AMPH, AMRK, AMRS, ANGI, ANIK, APLE, APPN, APRN, APTV, AQN, ARDX, ARPO, ARW, ASMB, ASRT, AT, ATEC, ATER, ATHX, ATNX, ATRI, ATRO, ATRS, AUMN, AUPH, AUTL, AUTO, AVD, AVLR, AVRO, AVXL, AVYA, AXDX, AXLA, AXNX, AXON, AY, AZUL, BAP, BBD, BBDO, BCC, BCRX, BCYC, BDSI, BDX, BECN, BHB, BILL, BIOL, BIP, BKD, BKI, BL, BLCM, BLD, BLDR, BLL, BRBR, BRT, BTN, BUD, BV, BWMX, BYND, CABO, CAH, CALA, CARG, CARS, CDK, CDR, CDXC, CDXS, CDZI, CECE, CELC, CEMI, CERC, CERT, CGNX, CHMA, CHRS, CHUY, CIA, CKX, CLBS, CLGX, CLI, CLNE, CLNY, CLRB, CLXT, CMBM, CMMB, CMRX, CNP, CNQ, CNXN, COLD, COLL, COMM, CORE, CORT, CPLG, CRAI, CSII, CSOD, CTHR, CTIC, CTLP, CTMX, CTOS, CTRE, CTT, CUE, CVET, CVNA, CWEN, CWEN.A, CWK, CYTK, CZNC, DBX, DDOG, DEN, DIOD, DLA, DLX, DMLP, DOCN, DRH, DRNA, DVAX, EB, ECOM, ECOR, ED, EGLE, EIGR, ELOX, ENDP, ENG, ENTA, ENV, EOG, EPAM, EPC, EPIX, EPZM, ERII, ESGR, ET, ETTX, EURN, EVC, EVFM, EVOP, EVRG, EXEL, EXPE, EXPI, FARM, FCRD, FDUS, FET, FIS, FIXX, FLDM, FLGT, FLIR, FLXN, FND, FNF, FNKO, FOCS, FOUR, FOXF, FPI, FRG, FRGI, FROG, FSTX, FTDR, FULC, FVRR, GBLI, GDEN, GDP, GDYN, GEOS, GH, GLOG, GLOP, GLPG, GNE, GNL, GOGO, GOLF, GOVX, GPMT, GPRO, GPX, GRA, GRPN, GRTS, GSAT, GSBD, GSIT, GTIM, GTS, GWRS, HAIN, HBIO, HCAT, HCI, HII, HIMX, HL, HMHC, HMPT, HSKA, HTA, HWCC, HWM, HZN, IAC, IBOC, ICL, ICPT, ICUI, IDCC, IGMS, IHC, IHRT, IIVI, IMKTA, IMMR, INDT, INFU, INOD, INSM, INSW, INVE, IOVA, IRM, IRTC, IRWD, ISDR, JOBS, JYNT, K, KARO, KDMN, KIQ, KL, KRP, KRTX, KTB, KURA, KWR, KZR, LADR, LASR, LAUR, LAZY, LBPS, LCUT, LEE, LIN, LND, LNT, LOCO, LODE, LPCN, LPTH, LQDT, LRMR, LSEA, LXRX, LYV, MACK, MAIN, MCHP, MCK, MDGL, MEIP, MFA, MGA, MGEE, MGTA, MGTX, MIDD, MIRM, MITO, MITT, MKTY, MMS, MNOV, MNPR, MNRL, MNST, MNTX, MP, MRAM, MRIN, MRNA, MRTX, MSI, MSON, MT, MTBC, MTD, MTX, MTZ, MUR, MYE, NATR, NBRV, NBY, NCLH, NEPH, NET, NFG, NGS, NGVC, NH, NINE, NJR, NKSH, NKTR, NLSN, NMRK, NNBR, NOMD, NRG, NRP, NSIT, NTCT, NTLA, NTRA, NTUS, NUZE, NVCN, NVMI, NWS, NWSA, NXTC, NYMT, OCSL, OCUP, OEC, OGE, OLED, OLP, ONCT, OPCH, OPGN, OPRT, OPRX, ORTX, OTEX, OTRK, OUST, OVID, OYST, PACK, PAE, PAHC, PAYS, PBA, PBH, PBPB, PBYI, PCTI, PCTY, PDEX, PDFS, PENN, PESI, PFSI, PGNY, PHI, PHX, PK, PLM, PLNT, PLUG, PMT, PNTG, PODD, POST, PPL, PQG, PRAA, PRDO, PRLB, PRMW, PRQR, PRVB, PTMN, PTON, PWR, PZG, PZZA, QDEL, RC, REFR, REG, REGN, REPH, RETA, REZI, RGA, RGS, RMAX, ROKU, RPD, RVLV, SALM, SATS, SBH, SBR, SCM, SCOR, SCX, SEAS, SEEL, SELB, SEM, SFE, SFM, SGA, SHAK, SHYF, SIC, SIGA, SKM, SLDB, SMTS, SNCY, SPH, SPLP, SPPI, SPRO, SPXC, SQ, SRLP, SRRA, SRRK, SRTS, SSRM, STFC, STMP, STOR, STWD, SUN, SUNW, SVMK, SVRA, SWX, SXI, SYNA, SYRS, TACT, TBIO, TCDA, TCX, TDAC, TDC, TDS, TDW, TECH, TEF, TEN, THS, TIPT, TMST, TMX, TPIC, TPL, TPR, TRGP, TRHC, TRIN, TRIP, TRUE, TRVI, TRVN, TSE, TTOO, TVTX, TWI, TWST, TXMD, UBX, UEIC, UEPS, UFS, UIS, UMH, UNIT, URGN, USCR, USM, USPH, UTI, VCTR, VEL, VER, VG, VHI, VIAC, VIACA, VIR, VIRX, VNRX, VNT, VNTR, VRAY, VRCA, VSTM, VSTO, VTVT, VWTR, VYNE, W, WBT, WCC, WD, WFCF, WFG, WLDN, WPG, WPM, WPRT, WRLD, WRN, WSTG, WTRH, XERS, XFOR, XHR, XLRN, XRAY, XXII, Y, YELP, YMAB, YTRA, ZGNX, ZIOP, ZTS, ZYME\n\n - Ex-div:\n\n  AFB, AMSWA, ARLP, ARTNA, BKEP, BP, BPFH, BPRN, CADE, CBD, CEQP, CFFN, CIT, CMS, CVCY, DAN, FCBC, FCF, FE, FFWM, FHI, FRAF, FRBA, GPP, HCC, HOPE, HSII, INTC, JBHT, LAD, LBAI, LBC, LEVI, LW, MAC, MMLP, MMP, MPLX, NSC, NYCB, PCB, PCTI, PFC, PFE, PH, PKOH, PNFP, PPBI, PVBC, RBB, SIRI, SMBK, WAB, WAFD, WFC, WMT, WSFS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.000%)\n    - 8-Week Bill Auction (previous: 0.010%)\n    - Challenger Job Cuts (previous: 30.603K)\n    - Continuing Jobless Claims (consensus: 3,620K, previous: 3,660K)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Kaplan Speaks\n    - FOMC Member Mester Speaks\n    - FOMC Member Williams Speaks\n    - ISM NY Business Conditions (previous: 37.2%)\n    - ISM-New York Index (previous: 804.5)\n    - Initial Jobless Claims (consensus: 540K, previous: 553K)\n    - Jobless Claims 4-Week Avg. (previous: 611.75K)\n    - Natural Gas Storage (consensus: 64B, previous: 15B)\n    - Nonfarm Productivity (consensus: 4.3%, previous: -4.2%)\n    - Unit Labor Costs (consensus: -0.8%, previous: 6.0%)\n    - Wholesale Inventories (previous: 1.4%)\n\n## Upcoming events for Friday, May  7th\n\n - Stock splits:\n\n    - FXBY @ **1:5**\n\n - Expected earnings:\n\n  ABR, AENZ, AMCX, AMRX, ANIP, AP, ASLE, ATH, AUD, AVNS, AXL, BATRA, BATRK, BBDC, BPY, BWEN, CCJ, CI, CIO, CLMT, CLSK, CLVR, CNK, CNTY, CRON, CVE, DKNG, DS, DSKE, DXPE, ELAN, ENB, ERF, ESNT, FF, FLR, FWONA, FWONK, GATO, GCI, GLP, GVA, HCHC, HE, HSON, HSTO, IBP, IEP, INTT, ITT, JOUT, KOP, LBRDA, LBRDK, LEA, LSXMA, LSXMB, LSXMK, LTRPA, LTRPB, LXP, MD, MGI, MMI, MODV, MSGN, NFE, NKLA, NOG, NPO, OCGN, OSG, PAYA, PFSW, PLYM, QLGN, QRTEA, QRTEB, RDUS, RMR, ROAD, RUTH, SAMG, SIFY, SII, SMLP, SPB, SR, SSP, STNG, SVC, TGLS, TILE, TIXT, TRP, TTCF, TU, UNVR, UUUU, VIVO, VRS, VTR, XPL, ZEUS\n\n - Ex-div:\n\n  AAPL, AB, ACC, AEP, AGCO, ALTA, ALX, AMP, APOG, AROC, BCBP, BRO, CDR, CLAR, CLR, CSV, CWBC, CWT, DHI, DKL, DVD, ECC, EIC, FBIZ, FBK, FBMS, FCBP, GABC, GLOP, GLP, GROW, GWW, HAFC, HBCP, IBM, ISBC, ISNS, LAZ, LGI, LSBK, MATW, MC, MPB, MPX, MRBK, MRLN, MWA, NATI, NS, OCFC, OLN, PEAK, PPG, PPR, RBNC, ROL, RUSHA, RUSHB, SC, SFBC, SJW, SON, STND, VNO, WMK, WVFC, X\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: -0.4%, previous: 4.2%)\n    - Average Hourly Earnings (consensus: 0.1%, previous: -0.1%)\n    - Average Weekly Hours (consensus: 34.9, previous: 34.9)\n    - CFTC Aluminium speculative net positions (previous: 3.4K)\n    - CFTC Copper speculative net positions (previous: 49.3K)\n    - CFTC Corn speculative net positions (previous: 521.6K)\n    - CFTC Crude Oil speculative net positions (previous: 489.7K)\n    - CFTC Gold speculative net positions (previous: 170.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -7.8K)\n    - CFTC Natural Gas speculative net positions (previous: -59.6K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 2.3K)\n    - CFTC Silver speculative net positions (previous: 42.8K)\n    - CFTC Soybeans speculative net positions (previous: 250.6K)\n    - CFTC Wheat speculative net positions (previous: 29.7K)\n    - Consumer Credit (consensus: 20.00B, previous: 27.58B)\n    - Government Payrolls (previous: 136.0K)\n    - Manufacturing Payrolls (consensus: 55K, previous: 53K)\n    - Nonfarm Payrolls (consensus: 978K, previous: 916K)\n    - Participation Rate (previous: 61.5%)\n    - Private Nonfarm Payrolls (consensus: 893K, previous: 780K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 343)\n    - U.S. Baker Hughes Total Rig Count (previous: 438)\n    - U6 Unemployment Rate (previous: 10.7%)\n    - Unemployment Rate (consensus: 5.8%, previous: 6.0%)\n    - Wholesale Trade Sales (consensus: 1.0%, previous: -0.8%)\n\n^^^^2021-05-06",
        "created_utc": 1620295215,
        "id": "gx4sxig",
        "permalink": "/r/RobinHood/comments/n63rzx/daily_discussion_thread_may_6th_2021/gx4sxig/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1620324015.0
    },
    {
        "author": "Tp_for_my_cornholio",
        "body": "You might be right that it’s hype, but the same things were said about Apple/Steve jobs. Amazon didn’t make a profit for 10 years...now they print money. You might be right about tsla and it is definitely richly valued, but as the future moves to a greener future, I expect the tides to turn pretty quickly. I expect tsla to get a bigger piece of that pie than most. You might want to buy a Ford Mach E over a Tesla and that’s fine. There will be a lot of others that think the same way. It reminds me of when LG and Motorola had their “iPhone killer”phones 15 years ago and I had to hear about people telling me how Apple was doomed. Same for amazon being a joke of a company bc they couldn’t make a profit for a decade.",
        "created_utc": 1620003560,
        "id": "gwqb7fl",
        "permalink": "/r/stocks/comments/n392a4/twitter_twtr_has_done_basically_nothing_in_its/gwqb7fl/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620032360.0
    },
    {
        "author": "quaybles",
        "body": "He convinced me grab a ton of MSI a couple years ago.",
        "created_utc": 1621302870,
        "id": "gyiq4nl",
        "permalink": "/r/wallstreetbets/comments/nenzge/michael_burry_reals_530_million_bet_against_tsla/gyiq4nl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621331670.0
    },
    {
        "author": "recongold",
        "body": "My 50 dollar Motorola does everything I need a phone to do",
        "created_utc": 1621480585,
        "id": "gys37kw",
        "permalink": "/r/wallstreetbets/comments/ngfh4g/what_are_your_moves_tomorrow_may_20_2021/gys37kw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621509385.0
    },
    {
        "author": "JohnnyBoyJr",
        "body": "I think most Americans assume that a Motorola is going to be an American phone, and also because it has software made by Google. Nope.  \nI just don't understand why the American gov't is so vehemently opposed to Huawei, but ZTE and Lenovo are perfectly OK, especially considering that ZTE is partially owned by the CCP.",
        "created_utc": 1619891730,
        "id": "gwke6tq",
        "permalink": "/r/wallstreetbets/comments/n1r62l/telecom_italia_looking_to_drop_huawei_from_italy/gwke6tq/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1619920530.0
    },
    {
        "author": "ninkorn",
        "body": "motorola, nokia, sony erricsson",
        "created_utc": 1620015605,
        "id": "gwqvpmy",
        "permalink": "/r/wallstreetbets/comments/n3ekxx/what_are_your_moves_tomorrow_may_03_2021/gwqvpmy/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1620044405.0
    },
    {
        "author": "_arjav",
        "body": "They won't repair it for free, and they deliberately make it harder for consumers and third-party vendors to repair it. Things like gluing the battery to the board, not allowing people to replace it using software (users will get a \"unable to verify if this a genuine battery\" error, which is straight bullshit. If you call a rep to discuss repairs, their go-to policy is to convince you to just buy a new item. \n\nThat isn't an argument against the quality of Apple products though. In general, they have pretty good build quality (although 2018 MacBooks with their butterfly keyboards would beg to differ, and unfortunately I have one of these).\n\nFurthermore, their shitty policies encourage other companies to do the same. It seems that Apple sets the bar for what is acceptable (removing headphone jack, not shipping chargers, etc), and since consumers are enamoured with their products, they accept this change. This in turn emboldens everyone else to do the same, which normally would have gotten them burnt, but since Apple normalized it they remain unscathed.\n\nAlso, your Dell/MSI laptops were probably significantly cheaper. You're paying a premium to have higher quality products, which is a fair trade. Paying a premium to own less of the physical thing you just bought (software blocks), and then defending the company that does that is just shooting yourself in the foot. It's possible to enjoy something and still be able to criticize it and expect better.",
        "created_utc": 1620349465,
        "id": "gx7ywi7",
        "permalink": "/r/stocks/comments/n65x7r/i_started_investing_in_february_2021_how_do_i/gx7ywi7/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1620378265.0
    }
]