[
    {
        "author": "Ramsgiving",
        "body": "Your classmates will probably all pick lame stuff like TSLA and AAPL.\n\nI would probably pick TXN if I had this project. It's one of my favorite companies and everyone knows it",
        "created_utc": 1629843556,
        "id": "ha7w1l8",
        "score": 58,
        "subreddit": "ValueInvesting",
        "created": 1629872356.0
    },
    {
        "author": "Tattooed_Moose",
        "body": "Yup, Tesla and Apple were both picked already haha.\nI’ll consider TXN, thanks!",
        "created_utc": 1629844310,
        "id": "ha7xril",
        "score": 16,
        "subreddit": "ValueInvesting",
        "created": 1629873110.0
    },
    {
        "author": "indigoismyfavourite",
        "body": "How’s it going for Texas Instruments?",
        "created_utc": 1628205641,
        "id": "h7vc3qn",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1628234441.0
    },
    {
        "author": "doubledoppelganger",
        "body": "Texas instruments?",
        "created_utc": 1630039520,
        "id": "haip11a",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630068320.0
    },
    {
        "author": "SantiaguitoLoquito",
        "body": "Ha, I looked up what TXN was and was delighted to learn that it was TI.  I actually worked as a temp in their consumer products division warehouse for six months in the late 80s after I graduated from college and was trying to find a \"real\" job.  My job was to sort all the returned and defective products and put them into bins, then take them over to the repair people who refurbished them.  I have fond memories of that place.",
        "created_utc": 1629895349,
        "id": "haaaiuz",
        "score": 4,
        "subreddit": "ValueInvesting",
        "created": 1629924149.0
    },
    {
        "author": "shinystacks",
        "body": "From my portfolio, in order of highest div yield to lowest: AVGO (2.89%), JPM, BX, DAC, TXN, CG, HD, TROW, ALLY, QCOM, NEE, TGT, UNH, TSM, ACN, CARR, MSFT, COST, EL (.62%).\n\nI chose these positions as I felt they had a good blend of company growth, dividend growth, and current yield.",
        "created_utc": 1630434246,
        "id": "hb36hwn",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630463046.0
    },
    {
        "author": "usuarioDF",
        "body": "I like MU. Holder for 10 years now.\n\nIntel, Texas Instruments and Taiwan Semiconductor too.",
        "created_utc": 1628438683,
        "id": "h86jqbb",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1628467483.0
    },
    {
        "author": "PinnySkeenus",
        "body": "$TXN calls and $TGT calls if it tanks after earnings. Maybe $AAPL calls cause why not",
        "created_utc": 1629258984,
        "id": "h9dfag2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629287784.0
    },
    {
        "author": "ff005",
        "body": "I'd go for dividend paying stocks, some growth &amp; some value. You can find dividend stocks in many different sectors. Dual income. \n\nTech\n$AVGO\n$TXN\n$MSFT\n$CSCO\n\nIndustrials\n$CAT\n$HON\n$BA\n$MMM\n\nRetail\n$WMT\n$TGT\n$COST\n$HD\n\nHealthcare\n$PFE\n$JNJ\n$MRK\n$ABBV\n\nTelecom\n$T\n$VZ\n$CCI\n$AMT",
        "created_utc": 1629021640,
        "id": "h90jn6a",
        "score": 2,
        "subreddit": "options",
        "created": 1629050440.0
    },
    {
        "author": "obviousname117",
        "body": "I sold my Texas instruments shares. I thought domestic supply investment would trend with the acquisition of micron but there is more money to be made elsewhere in the market.",
        "created_utc": 1629914721,
        "id": "habkmgc",
        "score": 2,
        "subreddit": "investing",
        "created": 1629943521.0
    },
    {
        "author": "Draiko",
        "body": "Oh for fuck's sake... [the Lehi fab was equipped for 3D Xpoint, not DDR production.](https://www.anandtech.com/show/16800/micron-sells-lehi-3d-xpoint-fab-to-texas-instruments-for-900m)\n\nComputer demand is skyrocketing, fool. It's going to continue to grow for the next 5+ years too. Computers need RAM and, I'll say this again, all of the chipsets launching at the end of 2021 and beyond are all going ***DDR5-only.***\n\nDude, you need to do some damned research.",
        "created_utc": 1628873710,
        "id": "h8swras",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628902510.0
    },
    {
        "author": "aurora4000",
        "body": "Semiconductors are diverse, and are in cars, phones, appliances, laptops, gaming systems, cameras, etc. Each semi category is quite different and needs to be analyzed by someone who understand that category, industry and chipmaker. \n\nChipmakers include: AAPL, GOOG, MRVL, MU, AMD, NVDA, INTC, TXN, LRCX. \n\nGood analysts include Bofa Securities - they published an amazing piece on NVDA last month. I'd link to it except that the mods might smite my post.",
        "created_utc": 1628698293,
        "id": "h8jruyu",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1628727093.0
    },
    {
        "author": "xXPFOXx",
        "body": "Texas Instruments. TXN. Not talked about often but super solid company",
        "created_utc": 1629171919,
        "id": "h98x6wx",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1629200719.0
    },
    {
        "author": "rhythmdev",
        "body": "Aapl brk.b pepsico (or cocacola), mmm, txn are solid companies.",
        "created_utc": 1628200991,
        "id": "h7v214u",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628229791.0
    },
    {
        "author": "BossGandalf",
        "body": "btw does anyone know which broker i can use in europe to invest every month in an ETF composed of several Integrated Circuits and AI companies? I would like to invest in one of this list:\n\n* SOXX (iShares Semiconductor ETF)\n* SMH (VanEck Vectors Semiconductor ETF)\n* SOXL (Direxion Daily Semiconductor Bull 3x Shares)\n* PSI (Invesco Dynamic Semiconductors ETF)\n* USD (ProShares Ultra Semiconductors)\n\nyou can consult the reports/data of these various ETFs [here](https://etfdb.com/etfs/industry/semiconductors/).\n\nI really believe that in the long run it will give me a lot of profits, ie integrated circuits, cpus, gpus, sensors and hardware accelerators are our past, present and will be our future !! These ETFs have shares of AMD, Nvidia, Xilinx, NXP, Microchip, Texas Instruments, Maxim Integrated, ASML, TSMC, qorvo, STMicroeletronics...",
        "created_utc": 1628889342,
        "id": "h8u0bno",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1628918142.0
    },
    {
        "author": "Celetus",
        "body": "TXN might merit some interest as well for sure. Yes they have higher margins, but their level of growth and their valuation does not really merit a place in my semiconductor portfolio. Frankly, there are so many good companies in this industry that it is incredibly hard to limit yourself to a handful.\n\nIn regards to the fund, Intel is also making a play for it (see link). I think come within 10 years there is a real chance that Intel might become a real contender again as they seek to take on AMD, NVDA and TSM at the same time.\n\nhttps://www.nasdaq.com/articles/intel-is-positioning-itself-to-make-the-comeback-of-the-century-2021-08-25",
        "created_utc": 1630067860,
        "id": "hajry4x",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630096660.0
    },
    {
        "author": "samuelj264",
        "body": "Depends on the type of account for 1. If its a qualified account (401k, IRA, Roth IRA) that is non-taxable so you dont have to worry about capital gains.\n\nIf its an Individual, Joint, Trust, etc. that means its taxable. Any sales you make you'll have to pay taxes on.\n\nMy personal advice is to leave it in $VTI and dont look at it for 5/10 years. If you want to play around and trade some money. See how much in taxes it would cost to sell $10k and then use that 10k as \"fun money\" you have to be prepared to loose all of it. At your age let the VTI stay invested and get compounded returns. If you want to learn about trading and investments, read some more here, watch educational videos about economics, trading, and long term investing. Start small with Blue Chip names (AAPL, CAT, TXN, MSFT, HD, JPM, etc.) then build your way up to more risky names as you become more comfortable.",
        "created_utc": 1628544082,
        "id": "h8c1ivr",
        "score": 1,
        "subreddit": "investing",
        "created": 1628572882.0
    },
    {
        "author": "aero2000_vega",
        "body": "If spx for borrowing, max loss is established at start of trade and is the difference between the executed price and the width of the strikes. 4500-4000 strikes width is 500. Mid of say 495 means max loss is 5. $100 a point for spx. Interest cost of your loan is $500.\n\nBox spread to make profit? Don't bother. Early assignment and txn costs not worth. 1ronyman etc etc",
        "created_utc": 1628899208,
        "id": "h8umhjf",
        "score": 1,
        "subreddit": "options",
        "created": 1628928008.0
    },
    {
        "author": "TheWings977",
        "body": "All this talk about AMD, NVDA, TWMC, and Intel but not TXN ;(",
        "created_utc": 1629934339,
        "id": "hacvxwo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629963139.0
    },
    {
        "author": "ComfortableFarmer",
        "body": "How about Texas Instruments Incorporated (TXN)?",
        "created_utc": 1630065240,
        "id": "hajn8dy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630094040.0
    },
    {
        "author": "dahliatree",
        "body": "is intel a foundry? texas instruments? idk",
        "created_utc": 1629960979,
        "id": "hae9mtf",
        "score": 1,
        "subreddit": "investing",
        "created": 1629989779.0
    },
    {
        "author": "jmlinden7",
        "body": "Texas Instruments makes plenty of chips in the US for automotive and other purposes (microcontrollers, etc).",
        "created_utc": 1630341010,
        "id": "hay28ue",
        "score": 1,
        "subreddit": "investing",
        "created": 1630369810.0
    },
    {
        "author": "Arkansasmyundies",
        "body": "Stick with TXN. NVDA may very well outperform, but TXN will be less volatile and, as you say pay a dividend",
        "created_utc": 1630246664,
        "id": "hat03n9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630275464.0
    },
    {
        "author": "___P0LAR___",
        "body": "I'm a thumb twiddling idiot not an expert, but I imagine they'll be worthless. I'd rather not take the risk especially when there's companies like APPL, CHWY, TXN, JNJ, literally a butt ton of American stocks that are good and not subject to that nonsense. Better to stick with something safe than not.",
        "created_utc": 1630198431,
        "id": "haqzgk4",
        "score": 1,
        "subreddit": "investing",
        "created": 1630227231.0
    },
    {
        "author": "tloffman",
        "body": "You are fooling yourself. I have been trading for 40 years and have lived through many huge drops. If you want to sell puts, fine, but sell a vertical spread. Your \"it won't happen to me\" arrogance will lead to your eventual financial demise in the market. It's just a matter of time. \n\nI will give you an example of an actual trade that I am in now. A couple of weeks ago TXN had a 5% drop after earnings were released. It settled near 185, and had been at that level previously and recovered. So, I sold the Aug 20 182.5 put, and bought the 180 put. I took in .87 premium, or $87 per spread, minus commissions. TXN has since recovered and is now near 192-3, and the spread is at .12. If TXN stays about 182.5 on 8/20 the puts will expire worthless. If the market tanks my risk is limited to $163 per spread. If I were only short the 182.5 put my risk would be unlimited. Many hedge funds have been wiped out selling naked puts, so don't kid yourself into thinking it won't happen to you. Risk management is the key to surviving stock market trading.",
        "created_utc": 1628271066,
        "id": "h7yj1p5",
        "score": 0,
        "subreddit": "options",
        "created": 1628299866.0
    },
    {
        "author": "tloffman",
        "body": "I am telling you about the dangers because I have \"been there, done that\". I have wiped out a million dollars a couple of times. \n\nI can tell from your comments that you are new to trading. When you sell a naked put, how many do you sell? Can you define your risk?\n\nHere's how I decide how many put spreads to sell. Let's say my account size is 10k. I want to risk no more than 2% in a worse case scenario. So, the spread (in my case TXN) is to sell the 182.5 put and buy the 180 put. The spread is 2.5 pts or $250. I take (did take in) .87, or $87 per spread. My risk is $250-87, or $163. For 10k risking 2% that's $200 of risk, so I can sell 1 TXN spread. I have taken in $87, and set aside $200 for the trade - that's 43.5% for a 4 week holding period. Not a bad gain. \n\nThe problem with naked put selling is you don't know your max potential risk, so you don't know how many to sell. With a vertical put spread you do know you max potential loss so you can easily calculate exactly how many spreads to sell. \n\nFor full disclosure I am short 23 of the TXN spreads.",
        "created_utc": 1628283743,
        "id": "h7zc9gd",
        "score": 0,
        "subreddit": "options",
        "created": 1628312543.0
    },
    {
        "author": "TheWings977",
        "body": "I’ll stick to $TXN thank you very much.",
        "created_utc": 1629475857,
        "id": "h9oej2f",
        "score": 0,
        "subreddit": "stocks",
        "created": 1629504657.0
    },
    {
        "author": "MonoDun",
        "body": "Peaks are the most dangerous positions to be at.....and we are at the Mother. Of. All. Peaks. ^tm or M.O.A.P.S in **everything.** The sentiment called greed can trigger a engineered crash where the whales can crash it, make money on the way up/down. Apple will turn into something like Ford, Intel, Texas Instruments, Coca Cola with a few ER misses, it's a generational guarantee, my best guess is in about two years. Why ? its called 'Brand Fatigue'.",
        "created_utc": 1630200720,
        "id": "har3w19",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1630229520.0
    },
    {
        "author": "rhythmdev",
        "body": "AAPL, TXN, MMM, KO, PEP, BRK.b, V",
        "created_utc": 1630243824,
        "id": "hasu6dg",
        "score": 0,
        "subreddit": "investing",
        "created": 1630272624.0
    },
    {
        "author": "TheWings977",
        "body": "Looking to pick up new stocks in my Roth. Currently have $TXN, $MSFT, $KO, $VOO, $SCHD, $FIW, $DIS. Any suggestions?",
        "created_utc": 1628970427,
        "id": "h8y4083",
        "score": 0,
        "subreddit": "stocks",
        "created": 1628999227.0
    }
]