[
    {
        "author": "high_roller_dude",
        "body": "nope. more like next ibm as bear case. and next csco as best bull case.",
        "created_utc": 1636078417,
        "id": "hjd6nvt",
        "score": 46,
        "subreddit": "stocks",
        "created": 1636107217.0
    },
    {
        "author": "wy51uwv",
        "body": "Intel is basically like Cisco. Great company to start with but sleeping for last decade with close to 0 innovation.",
        "created_utc": 1636192667,
        "id": "hjj6qwn",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1636221467.0
    },
    {
        "author": "Dadd_io",
        "body": "Nvidia is a meme stock at this point -- Cisco from 2000.  But that doesn't make Intel a buy (and I bought some at 48).",
        "created_utc": 1636051103,
        "id": "hjbcz4u",
        "score": 15,
        "subreddit": "investing",
        "created": 1636079903.0
    },
    {
        "author": "VotedOut",
        "body": "In the last 6 trading days Tesla has added roughly 300B market cap to its 900B high (900B to 1.2T).\n\nThis 300B market cap added in 6 days is more than the entire value of:\n\nToyota (249B)\n\nVolkswagen (149B)\n\nGM + Ford (80B + 71B)\n\nCisco (236B)\n\nIntel (200B)\n\nAdobe (almost) (304B)\n\nalmost 2x AMD (151B x2)",
        "created_utc": 1635801030,
        "id": "hixjrgm",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1635829830.0
    },
    {
        "author": "INukeMyAccountDaily",
        "body": "Cisco is even worse than that… They come out with products they call innovative yet they are all trash and subpar to almost every other company out there offering networking solutions",
        "created_utc": 1636203867,
        "id": "hjjns09",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1636232667.0
    },
    {
        "author": "MaintenanceCall",
        "body": "Cyber is an enormous sector. Lots of room, but there are tons of companies. Okta, DocuSign, BlackBerry now, Fortinet, CrowdStrike, Zscaler, Mimecast, Arqit, Palo Alto, Rapid7, Cisco, . . . The list is long. And then the are all the private ones, too. \n  \nETFs like HACK is probably a better way to go.",
        "created_utc": 1636291838,
        "id": "hjo60i1",
        "score": 8,
        "subreddit": "SPACs",
        "created": 1636320638.0
    },
    {
        "author": "mrTang5544",
        "body": "To be fair, Cisco is pushing to rebrand themselves as a \"software\" tech company and updating their brand and innovation. This is obvious from the amount of startups they have snapped up over the past couple of years (source: company was bought by Cisco for $1B)",
        "created_utc": 1636233199,
        "id": "hjliepq",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636261999.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "I posted about the McDonalds deal last week, a few people are talking about them.😉\n\n&gt;most big companies spinoff apart of their business because well it’s to unload all the garbage debt that the parent company (IBM owns). So all bad debt now going to that spinoff company\n\nThe real problem is that IBM has a longstanding, very successful managed IT services division. 30 years ago that was high margin, but now it is low margin. And now they're more focused on cloud services. These units are directly competing. And it creates confusion for existing customers. By spinning off the old-school part of the IT consulting services, they clarify things a lot. It can be awkward to negotiate contracts when you're competing with yourself. And the industry has moved strongly to \"hybrid cloud,\" with multi-vendor support, so they can get more money from the managed infrastructure clients in the spinoff, where those clients might choose some other cloud provider. And IBM can stay focused on being a cloud and AI provider.\n\nKyndryl isn't full of debt it is just low-margin and contains a lot of harmful redundancy that may thrive separately.\n\nIBM has been doing major partnerships for almost 100 years, they're not the sort of company that creates a bunch of debt they can't pay and have to stuff in a suitcase. Check their credit rating.\n\nThe Palo Alto deal sounds really good, that could be a big winner for both. The Cisco deal will likely be irrelevant unless Cisco finds a better angle for a 5G play. The Boston Dynamics thing may be pretty good, but it is always hard to tell with BD if it is just going to result in nice videos. The Raytheon thing is good for Raytheon in the short term, and in the very-unlikely event that quantum computing actually impacts computer security in the next 100 years, it will help them both to have a working relationship in place.\n\nIBM has a lot of other stuff going on too. They recently signed a deal to take over Honda's European finance and procurement operations. They've been \"global allies\" with Deloitte for over 20 years are going to offer a new AI-backed anti-fraud service to governments, for example to identify tax fraud.\n\nMost of what they do flies under the radar, but they've got a lot going on, and the extra free cash flow they'll get from spinning off the legacy IT will really help them.",
        "created_utc": 1635918453,
        "id": "hj465l7",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1635947253.0
    },
    {
        "author": "Due-Cryptographer",
        "body": "The stock is in a massive bubble, larger than Cisco in 1999. When this happens, it is what you call a ticking time bomb and floats around until it inevitably finds a pin to pop it.",
        "created_utc": 1636307969,
        "id": "hjp89hn",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636336769.0
    },
    {
        "author": "RoPrime12",
        "body": "Look at all the dotcom stocks. Microsoft and Amazon are the few that reached new highs (after 15years for microsoft). Many of the highfliers went bankrupt or still didn't reach it's high after 20+ years (Cisco, Intel, Microstrategy, Yahoo). \n\nPrice matters and the company has a P/S of 120. Plug their numbers into a DCF (using their non-Gaap earnings, and assume an annual EPS of $0,12). Using 100% growth the first five years and 50% from year 5-10, a PE of 30 and a target rate of return of 15%, we arrive at a maximum price of $216,24.  The company increased revenue 50% a year tho, so using 50% growth for the 10 years, we arrive at a price of $51,31. \n\nLooking at the FAANG stocks, not a single one could increase revenue 50%+ for a decade. \n\nSo even if everything goes perfectly for Cloudflare and 50% growth for a decade, you loose heavily. If they grow 100% a year (which they don't even do now), you have an upside of less than 8%.",
        "created_utc": 1636104087,
        "id": "hje7xw5",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636132887.0
    },
    {
        "author": "peachezandsteam",
        "body": "Twitter?  I don’t understand how they are not one of the biggest companies in the world given the ubiquity of their product.\n\nHow about the “old” and forgotten tech stocks like INTC, CSCO, CTXS, ORCL, etc?",
        "created_utc": 1636121322,
        "id": "hjf095r",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636150122.0
    },
    {
        "author": "JonathanBeuys",
        "body": "I think Cisco was at around $200B in 1999 and is at $241B now.",
        "created_utc": 1636127566,
        "id": "hjffx0a",
        "score": 3,
        "subreddit": "investing",
        "created": 1636156366.0
    },
    {
        "author": "jessejerkoff",
        "body": "You're looking at from too close. Step back a bit!\n\nIaas will go the way of legacy infrastructure. Case in point: networking in the 90s used to be next big thing to eat the world, everything will be connected (iot correctly predicted) and networking is always the problem, and Cisco is so ahead of everything else.... And even if not, Palo alto and juniper and Cisco will split the world between each other!\n\nDo you see the parallels yet?\n\nCisco was prophesied (and I think at one brief moment also was) the biggest company in the world.\n\nMargins will be run into the ground and even without the tech bubble those grandiose predictions would not have come true. And technology will be leapfrog this current paradigm.",
        "created_utc": 1636324805,
        "id": "hjqepk2",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636353605.0
    },
    {
        "author": "yeppersbruh",
        "body": "This is one of the most moronic comments I've seen in a while.\n\nCisco's market cap was like $500B back in 2000. Then the stock fell by 80%. 20 years later today, Cisco has a market cap of $250B. It never reached the valuation it had back then.\n\nThis can happen to any stock. But you know what? The moment you see monetary tightening people will stop dreaming and punish the shit out of this stocks valuation. Just like what we saw in the beginning of 2021 when everyone was missing and shitting themselves because of inflation and higher rates.\n\nTeslas stock is going to collapse. I won't make/lose money by going long, I won't make/lose money by going short because the risk/reward is skewed and market participants have completely lost their minds. But I'm convinced that this thing will collapse at some point. And then, like always, everybody will not only hate the stock but also hate the stock market. Which is when I'm going to buy in big. :)",
        "created_utc": 1635851141,
        "id": "hizx1mo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635879941.0
    },
    {
        "author": "Bigghead1231",
        "body": "It is pretty wild isn't it? I don't blame them though; when this is all you've known to be true, it's hard to want to look at other arguments against your position.\n\nHuman psychology never changes and makes us repeat the same behaviors. Every generation has their own version of Cisco/AOL",
        "created_utc": 1635921093,
        "id": "hj49o1s",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635949893.0
    },
    {
        "author": "bloppingzef",
        "body": "Yeah Cisco made a interesting comeback recently imo",
        "created_utc": 1636112656,
        "id": "hjej6ie",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636141456.0
    },
    {
        "author": "Financial-Angle8703",
        "body": "CSCO does not know how to. I was in countless meetings there where execs said 'let's sell boxes, it's what makes us money' whenever moves to cloud services were discussed.",
        "created_utc": 1636260900,
        "id": "hjn2xdf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636289700.0
    },
    {
        "author": "Rothiragay",
        "body": "Vmware and Cisco. When grandpa is in charge of the future chances are its going to look a lot like the past. The companies where the first of its kind yet completely stopped innovating 5 years ago. Vmware used to be the biggest cloud computing company. Now everyone uses Azure and AWS instead.",
        "created_utc": 1636011704,
        "id": "hj98ugv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636040504.0
    },
    {
        "author": "AlienStrain",
        "body": "It took 22 years for Cisco Systems to recover its market bubble price. Wake up.",
        "created_utc": 1635846294,
        "id": "hizr1vj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635875094.0
    },
    {
        "author": "JRshoe1997",
        "body": "Yeah and they were one out of the many companies that didnt go bankrupt during the internet bubble. Only Apple, Microsoft, Qualcomm, and Amazon are higher then what they were at the peak. Cisco, and Intel still havent recovered and the rest went bankrupt. People investing in Tesla are justifying their valuations on what they think they are going to do and EVs are going to change the world. EVs are not going to change the world. You wanna know what really changed the world forever? The internet, it changed the way we live, how we communicate, and how we live our lives, and how we think. Yet many companies involved in it crashed and went bankrupt.",
        "created_utc": 1636244286,
        "id": "hjm6r98",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1636273086.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "I would vote for luckiest.  Few had that kind of foresight.  Tech was the Cat's Meow in 99 and the Untouchable from 2002 onward.  Remember NASDAQ lost near 80% of its value and did not recover until late 2014/2015.  So Tech was dead for over 14 years.  Heck Cisco just regained its mid 2000 value this past year and it is a very strong and long term successful Tech company.  So that is 21 years under water.",
        "created_utc": 1636295912,
        "id": "hjoeg52",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636324712.0
    },
    {
        "author": "AlienStrain",
        "body": "Cisco was essential in building the infrastructure of the early internet and was a good company. It's almost impossible to know who the winners of the future will be without hindsight.",
        "created_utc": 1635846716,
        "id": "hizrjfc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635875516.0
    },
    {
        "author": "TeenageDirtbagBaby",
        "body": "Jim Cramer's Charitable Trust Portfolio holdings\n\nAbbott Labs (ABT)\nAdvanced Micro Devices (AMD)\nAlphabet (GOOGL)\nAmazon (AMZN)\nAmerican Eagle Outfitters (AEO)\nApple (AAPL)\nBoeing (BA)\nBroadcom (AVGO)\nCisco Systems (CSCO)\nCostco (COST)\nDisney (DIS)\nDuPont (DD)\nEli Lilly (LLY)\nEstee Lauder (EL)\nFord (F)\nHoneywell (HON)\nLinde (LIN)\nMarvell Technology (MRVL)\nMastercard (MA)\nMeta Platforms (FB)\nMicrosoft (MSFT)\nMorgan Stanley (MS)\nNortonLifeLock(NLOK)\nNucor (NUE)\nNvidia (NVDA)\nPayPal (PYPL)\nSalesforce (CRM)\nUnion Pacific (UNP)\nUnited Parcel Service (UPS)\nWalmart (WMT)\nWells Fargo (WFC)\nWynn Resorts (WYNN)\n\nNote: This table will be updated as the trust makes changes to its portfolio.",
        "created_utc": 1635966988,
        "id": "hj6qcpv",
        "score": 1,
        "subreddit": "investing",
        "created": 1635995788.0
    },
    {
        "author": "Bigghead1231",
        "body": "Cisco/aol/yahoo would like to say hi. Read up",
        "created_utc": 1635986833,
        "id": "hj82tjy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636015633.0
    },
    {
        "author": "VisualMod",
        "body": "&gt;Key Companies Reporting Over the Next 2 Weeks\n$PYPL $DIS $TSN $HD $WMT $NVDA $CSCO $LOW $TGT https://t.co/fxjWJA0Flm\n\n^\\*Walter ^Bloomberg ^[@DeItaone](http://twitter.com/DeItaone) ^at ^2021-11-06 ^18:09:51 ^EDT-0400",
        "created_utc": 1636236601,
        "id": "hjlpzwp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636265401.0
    },
    {
        "author": "HinduHamma",
        "body": "Lmaoo if you think nvda and amd growth is priced in. \n\nYou foolish man. Nvda is gonna be worth fucking trillions. They have LAPPED the competition and it’s not even close. No one in 10 years is running anything with intel garbage in it , even if it’s free.\n\nThey have lost the war. And they will NOT catch up. No bright young engineers want to go and work for that dinosaur of a company intel. It’s the same story as Cisco and IBM . They are the intel of their sector. Who comes out of college screaming “I pray to land a job at IBM! Intel! GE!”\n\nIntel is dead as an investment for the foreseeable future. Strictly inferior products across the board. Yes they will still make plenty of money but the growth is non existent. \n\nLook at amd and nvdas growth they are only doing bettter and better every year and intel is not and will not.",
        "created_utc": 1636048651,
        "id": "hjb6ra9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636077451.0
    },
    {
        "author": "qqqchaser",
        "body": "Cisco and pets.com are nowhere close, don’t understand how you’ve compared them to Tesla…\n\nI have conviction so hopefully it’ll work out.",
        "created_utc": 1635783252,
        "id": "hiwcgpk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635812052.0
    },
    {
        "author": "ExtremeSlow5088",
        "body": "&gt;makes them a competitor to vmware, dell, cisco, etc. in the on-prem virtualization spa\n\nAgree, there is too much competition in this space and while some YoY growth is possible, I don't see this stock doing great in general",
        "created_utc": 1636210825,
        "id": "hjk2sn4",
        "score": 1,
        "subreddit": "investing",
        "created": 1636239625.0
    },
    {
        "author": "RoPrime12",
        "body": "Look at Microsoft from the dotcom bubble or cisco. Those didn't just go down a bit, they went down 80%+. Those companies also expanded like crazy. It is not about the business itself. Those businesses were and still are great. The problem was that the valuation got so extreme (just like with Tesla now), that there is no way that they will ever grow into it. The cult is there because the company just went up until now. It will turn just as fast against it.",
        "created_utc": 1635835683,
        "id": "hizfga3",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1635864483.0
    },
    {
        "author": "Scribble2thefloor",
        "body": "But where should we expect TSLA to be? Comparing Amazon and Tesla earnings is like comparing a F1 car to a goat with a saddle. I can honestly see Tesla struggling to live up to the impossible hype as more players enter the market, and the stock to behave similar to Cisco or IBM.",
        "created_utc": 1635845486,
        "id": "hizq513",
        "score": 1,
        "subreddit": "investing",
        "created": 1635874286.0
    },
    {
        "author": "Time_Kaleidoscope",
        "body": "Look at boomer ass CSCO having itself a day",
        "created_utc": 1635875664,
        "id": "hj1e5iv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635904464.0
    },
    {
        "author": "androideris",
        "body": "cisco is legacy company. It should rather die. cisco is joke compared to net",
        "created_utc": 1635846349,
        "id": "hizr476",
        "score": 0,
        "subreddit": "stocks",
        "created": 1635875149.0
    },
    {
        "author": "Gunner2022",
        "body": "$CAT has a lot of international exposure. With China slowing, the net effect may be small.\n\nIs there a Mid-cap (US only) that does what CAT does?\n\nThis infrastructure bill also builds out high speed internet.  \nHow about Cisco?",
        "created_utc": 1636267291,
        "id": "hjnbmbr",
        "score": 0,
        "subreddit": "investing",
        "created": 1636296091.0
    },
    {
        "author": "androideris",
        "body": "I am not arguing against that. I am saying that cisco is bad and not innovative. If you invested in it, then it was your fault to begin with. That means you did not do enough research (especially trying to grasp their vision). This is the new age of investing, driven by visionary company. Forget that old crap",
        "created_utc": 1635846627,
        "id": "hizrfn8",
        "score": 0,
        "subreddit": "stocks",
        "created": 1635875427.0
    },
    {
        "author": "shortyafter",
        "body": "You're betting that Tesla will become the next Apple or Amazon.\n\nCisco was viewed that way too.  [Pets.com](https://Pets.com).  It doesn't always work out like you want it to.",
        "created_utc": 1635783092,
        "id": "hiwc3el",
        "score": -1,
        "subreddit": "stocks",
        "created": 1635811892.0
    }
]