[
    {
        "author": "r0b0tAstronaut",
        "body": "Reasonably priced at 48x earnings? I'll concede that its PE is lower than similar companies like Ansys, Dassault, or PTC. Still seems high overall though.",
        "created_utc": 1622742693,
        "id": "h0gsdem",
        "score": 18,
        "subreddit": "stocks",
        "created": 1622771493.0
    },
    {
        "author": "Flow390",
        "body": "OKTA—$271 price target\nDDOG—$107 price target \nANSYS—$309 price target \n\nJust 3 competitors of BB that have some worse fundamentals in some areas (some they are better than BB) but it doesn’t justify BB’s ~$15 price when others are putting up numbers somewhat similar to BB and are priced over $100. I get BB isn’t taking in billions of dollars every quarter, but seriously it’s undervalued when put up against other companies in the same segment.",
        "created_utc": 1623696161,
        "id": "h1rdbzy",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1623724961.0
    },
    {
        "author": "rygo796",
        "body": "Computer Aided Engineering, CAE.\n\nHard to say if there's any particular standouts.  Entire industry with solid growth and \\*gasp\\* profitability.\n\nPTC, ADSK, ANSS are some of the big ones.  CDNS and SNPS for EDA.",
        "created_utc": 1624455090,
        "id": "h2rl01y",
        "score": 3,
        "subreddit": "stocks",
        "created": 1624483890.0
    },
    {
        "author": "hendrix_srv",
        "body": "MSFT 1yr Rev Gr: 15%; PE 12.  Of course MSFT has 1yr EPS growth: 22%.\n\nSome companies w/ 15-20% 3yr Rev Growth and PS &gt; 10:\n\nTWTR; CPRT; ANSS; STOR; QLYS; DLR; ASML; ALGN; PEN; WK",
        "created_utc": 1624327824,
        "id": "h2lvrjk",
        "score": 1,
        "subreddit": "investing",
        "created": 1624356624.0
    },
    {
        "author": "Dadd_io",
        "body": "Were you working in 2000?  If you were, you know that it is very much like today.  We had etoys, which sold toys on line to have them delivered via UPS to your house.  We had Intel, Intel, Dell, and Microsoft providing computers.  We had AOL providing network access and internet content for $25 a month.  One thing we didn't have was a large stock quite as overpriced as Tesla.  Tesla is a $50-$100 company trading at $600.  Cisco only had a PE of 110, not 600 like Tesla.  Companies were laying fiber in the ground like there was no tomorrow (which was sort of true). We had [pets.com](https://pets.com) instead of Chewy.  We had webvan instead of Instacart.   Ariba did b2b.    \n\n\nThe only thing that was different is rates haven't started going up yet.  If that inflation gets bad or sticks around a while forcing the Fed to raise rates, tech stocks will absolutely tank.  Nvidia doesn't get to keep an 80 PE when rates and inflation are at 4%.  It drops by 75%.  Intel was an amazing company in 2000 and it still makes loads of money, yet it still hasn't hit its 2000 high.  Back to Tesla -- I believe it will never see the $900 stock price again.  Ever.",
        "created_utc": 1623997702,
        "id": "h26kq8a",
        "score": 19,
        "subreddit": "investing",
        "created": 1624026502.0
    },
    {
        "author": "WoodpeckerAlarmed239",
        "body": "All I have is a Roth IRA and can only put in $6,000 a year. I've been at it for 6 years now and it's doing pretty well. I don't make a whole lot of money so it's a perfect set up for me. I max it out, buy some solid names at good prices and try to hold them.\n\nThe plan is obviously retirement. But if anything comes up before then, I can take out money with no penalties and do what I need to do, maybe a down payment on a house one day.\n\nIf there's one thing I wish I did more, was take some risks for high returns. But I don't think now is the time for that. I hate holding a stock with no dividend and just watching it bounce around so I go with dividend payers. \n\nMy positions are: SWKS, LMT, AAPL, CSCO, QCOM, KLIC, INTC, KMI. A bit tech heavy but I know they will be relevant for years to come.\n\nI also have a problem buying a stock \"early\" and selling it before it really takes off. Broadcom and Align technologies are the two that come to mind.",
        "created_utc": 1623017818,
        "id": "h0uda6p",
        "score": 9,
        "subreddit": "investing",
        "created": 1623046618.0
    },
    {
        "author": "cdude",
        "body": "Yes, go all-in on Yahoo, AOL and Cisco. It's the 2000s baby, gonna be a good decade!",
        "created_utc": 1624142055,
        "id": "h2db2mg",
        "score": 9,
        "subreddit": "investing",
        "created": 1624170855.0
    },
    {
        "author": "TurbineClimber",
        "body": "Lot of people said the same things about GE, Exxon, Nokia, Cisco, etc in 2000. Don't get too attached to a stock.",
        "created_utc": 1624017898,
        "id": "h278dnl",
        "score": 8,
        "subreddit": "stocks",
        "created": 1624046698.0
    },
    {
        "author": "anonrs99",
        "body": "Imagine being in a 20+ year coma and just waking up hearing about the massive bull market. Then going to check how your Cisco and Pets.com stocks are doing",
        "created_utc": 1624140299,
        "id": "h2d7yc6",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1624169099.0
    },
    {
        "author": "swahappycat",
        "body": "I did it with a hundred dollars into CSCO back in 2008. I logged back in in 2021 and found two hundred dollars waiting for me! So to answer your question, it's a sure way to double your money every 13 years. Can't beat that.",
        "created_utc": 1623467378,
        "id": "h1h8mnm",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1623496178.0
    },
    {
        "author": "greytoc",
        "body": "Crowdstrike is primarily known for endpoint protection which are software solutions to protect computers (workstations, laptops, servers) known as NGAV (next gen antivirus) and EDR (endpoint detect and response). They also offer a type of managed service known in the industry as MDR. Their customers will range across all industries and their solutions are appropriate for small to large enterprises. It's actually a pretty crowded market imo. There aren't a lot of comparables in the public market but you may be able to check out Sentinel 1 when they IPO. There are rumors of Cybereason IPO as well. \n\nFireye has an EDR solution but I imagine it's a tiny part of their business. And no one really would bring up Fireeye when talking about endpoint protection. Fireeye/Mandiant is most known for their incident response and forensic products and services. They are usually on top of most people's list to call whenever there is a security breach. \n\nBoth Palo Alto and Fortinet started off as security networking companies competing with traditional firewall companies like Netscreen and Cisco. In fact, the founders of both companies are former Netscreen execs iirc. Both companies have expanded their product and service offerings over the years to support security operations solutions. You tend to see Palo Alto and Fortinet used in larger enterprises who need holistic network security solutions. Normally, if a security team is looking at a Palo Alto solutions, they are probably also comparing it Fortinet and vice-versa. \n\nGenerally speaking - cyber-security industry is very broad. You are not likely to find a single company that would cover the entire gamut of security needs for an enterprise. So if your interest is in broad industry exposure - an ETF is probably a better solution.",
        "created_utc": 1622907981,
        "id": "h0p3r3o",
        "score": 6,
        "subreddit": "investing",
        "created": 1622936781.0
    },
    {
        "author": "KawhiLeonardIsSenpai",
        "body": "Depends. You want lower dividend yield + growth: MSFT, JPM, AAPL, VERIZON (currently not growth, but I think  price will  go higher due to 5G hype)\n\nYou want higher dividend yield, but little to no growth: P&amp;G, 3M, CSCO (should have been growth if the CEO wasn't a moron), COSTCO, HOME DEPOT, RAYTHEON, KIMBERLY CLARK, B&amp;G, IRON MOUNTAIN, ALTRIA, ABBVIE (some say it's growth, but I don't trust biotech/pharma growth as compared to tech growth)",
        "created_utc": 1623525612,
        "id": "h1jmy2i",
        "score": 5,
        "subreddit": "stocks",
        "created": 1623554412.0
    },
    {
        "author": "krisolch",
        "body": "This isn't necessarily true. Why would you hold a stock that is clearly overvalued? At a certain point it makes sense to sell even with the tax hit.\n\nWould you hold cisco in 2001 dot com peak?",
        "created_utc": 1624298887,
        "id": "h2k9czb",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1624327687.0
    },
    {
        "author": "us3r001",
        "body": "LYRA CAH DDOG ZM CSCO MIME PINS  went all down in 2020 the day of addition. There wasn't any spike despite the massive volume. I don't have the complete 2020 additions list to research better. LYRA seems to have been a comparable ticker.",
        "created_utc": 1624153187,
        "id": "h2du6bz",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1624181987.0
    },
    {
        "author": "G1G1G1G1G1G1G",
        "body": "Early 2000s it was big box stores, large commerce, and oil. Mid 2000s most good deals were tech and IT development, late 2000-2010 ecommerce - amzn!, 2010-present a mix of social media, financial tech, growing ecommerce, etc. These were the main themes which I invested in AFTER companies proved themselves profitable and continuing profit growth. Though I’ve always tried to find a diverse group of businesses across multiple sectors. The big winners are obvious - amzn, apple, and the like. And some loosers like cisco and being late on xom. \n\nReturns overall about 15% if we exclude covid era which skews the return higher and is a bit nuts. That also includes minor margin use and occasional options use but generally just buy and hold.",
        "created_utc": 1624317145,
        "id": "h2lc347",
        "score": 3,
        "subreddit": "stocks",
        "created": 1624345945.0
    },
    {
        "author": "Life_Whereas_3789",
        "body": "Oh summer child. \n2011 CSCO trades was was the first Cyclical stock on WSB. Introduced me to options and I lost my ass. \n\nAs for commodity tanker gang *exists*.",
        "created_utc": 1623363093,
        "id": "h1c1juy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1623391893.0
    },
    {
        "author": "bungholio99",
        "body": "This makes no sense, i hope only your gains decrease, cause if not you would have bought in way to close to the top...\nI mean yes Cisco and Coca Cola for example are losing today but you didn’t buy it yesterday.",
        "created_utc": 1623432803,
        "id": "h1fco2t",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1623461603.0
    },
    {
        "author": "shamops",
        "body": "you seem to be incredibly certain but history is filled with large companies that no longer exist or are trading below their ATH 15 years later. \n\ni encourge you to read up what people were saying about cisco during the dotcom bubble and see if you can spot some similarities to what you are saying right now: https://www.bizjournals.com/sanjose/stories/2000/03/20/story2.html",
        "created_utc": 1624255968,
        "id": "h2ief49",
        "score": 2,
        "subreddit": "stocks",
        "created": 1624284768.0
    },
    {
        "author": "Dadd_io",
        "body": "AOL was a massive cash cow in 2000.  Their business model broke.  Internet email and content went from $25 a month to free, and  internet connectivity got way cheaper.  Intel is still a great company, but underpriced due to a low growth rate.   \nCisco is still a huge company, but their products got somewhat commoditized.  \n\nNVidia is priced crazy right now -- if someone steps in and offers a product like theirs, their stock is 50-75% overpriced. If something happens to crypto mining, they drop 25% the next day. Netflix is trading with a PE of 50 and they are basically a movie studio with a streaming product that costs over twice Disney+.  There is no way it should be as high as it is.  Telsa is more ridiculous than anything from the dot-com era -- its PE is 600.\n\nIf rates go up to 4%, which could happen if inflation sticks around, all your tech stocks will cut in half with literally nothing else changed.",
        "created_utc": 1623998305,
        "id": "h26lhdo",
        "score": 2,
        "subreddit": "investing",
        "created": 1624027105.0
    },
    {
        "author": "SportTheFoole",
        "body": "Yep. And bags can get VERY heavy (just look at CSCO: if you bought in 2000/2001, you are still underwater and that’s not even counting inflation).\n\nPlaying meme stocks is fine. But don’t join “movements”. Those people are going to get destroyed and a lot of them are not playing with fun money.",
        "created_utc": 1623073814,
        "id": "h0wpuj0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623102614.0
    },
    {
        "author": "LiqCourage",
        "body": "Well it can be a lot worse than that which is why I am cautioning you to pay attention to them.  When I was your age GE would have been at the top of any list like you made.  Cisco would also have been on that list.  Neither of those would have made you happy as long term holds as both managed to lose their way… GE almost ran themselves into the ground. Just a case for why Every individual stock deserves quarterly reevaluation … and I see nothing wrong with the near term prospects of any of those companies you mentioned, you just don’t know what will change over a long time",
        "created_utc": 1624050411,
        "id": "h295z1i",
        "score": 2,
        "subreddit": "investing",
        "created": 1624079211.0
    },
    {
        "author": "Dadd_io",
        "body": "Microsoft was one of the overpriced ones back in 2000.  And there was EBay and Webvan (online groceries), eToys (Amazon for toys), Napster (Spotify), AOL (internet access plus content), Pet.com (Chewy), Intel (NVidia).  2000 didn't have Tesla and its 600 PE in the top 10 companies, but it had Cisco at 110 PE.  The fact that you don't know the parallels is more alarming than me comparing them.",
        "created_utc": 1623249776,
        "id": "h15pgoi",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1623278576.0
    },
    {
        "author": "jokull1234",
        "body": "Look at the top 10 qqq weighted companies from 1999-2001 compared to the top 10 today. The only glaringly overvalued one today is Tesla (and they still have huge revenues) \n\nMeanwhile the companies in 2000 include Cisco (probably more overvalued back then than Tesla is today), world com (lol), dell, Ericsson, and oracle. You can’t say with a straight face that the companies back then are anywhere close to as high quality as the top 10 today.",
        "created_utc": 1623433515,
        "id": "h1feaug",
        "score": 2,
        "subreddit": "investing",
        "created": 1623462315.0
    },
    {
        "author": "jeanneLstarr",
        "body": "SOFI.   ILMN.  CScO.  CRM",
        "created_utc": 1622599595,
        "id": "h09kq2t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622628395.0
    },
    {
        "author": "WoodpeckerAlarmed239",
        "body": "$KMI: an oil pipeline that I recommend for sure. Up about 38% YTD. Great dividend so you might be interested.\n\n$KLIC: a small semi conductor equipment manufacturer based in Singapore, up about 58% YTD. It's been on a nice run and I see more growth coming. It seems like everyone is trying to make their own chips now a days so these guys might see some growth for a while. It's been on a hell of a run but the P/E is still just 22. And earnings are growing fast. \n\n$CSCO- It's also been doing good for me this year. up about 20% YTD. Businesses are starting to update their networks now that people are getting back to it. I also have a feeling a lot of hacker sensitive businesses will need to make their own secure networks completely isolated from the www. This is just my theory for a big run. Even if they don't get that drastic they will still see growth for a while.",
        "created_utc": 1622657816,
        "id": "h0cci2c",
        "score": 2,
        "subreddit": "investing",
        "created": 1622686616.0
    },
    {
        "author": "greytoc",
        "body": "Because of the fast recovery of the market crash in 2020, I suspect that many inexperienced retail investors may think that's how all crashes work. Plus there really hasn't been a significant correction that I recall in the last 10 years. An investor really has to look much further back to at least '87 to see how trading and investing has evolved. Plus - there have been significant changes in market mechanics since the late 80's.  \n\nI don't necessarily disagree with your overall sentiment. But I think that an informed investor should worry if their choice of investments drops in value. I agree that short-term fluctuations shouldn't be a concern. But macro issues do matter. \n\nI saw that you cited Enron as an example. But it's not just outright management fraud that can cause a slow decline or even a slow recovery from an initial crash. Companies like Sunbeam, Cisco, GE, Kodak, etc. can all be interesting examples and counter-arguments to why someone shouldn't ignore systemic risk.   \n\nIf a portfolio isn't risk balanced for the investors profile - they should worry. Someone in their 50's with 50% of their net-worth tied up in meme stocks probably should worry. As should someone in their 20's with a large chunk of their savings in a money market who is not seeing a raise in their net worth.",
        "created_utc": 1624129031,
        "id": "h2cmvzs",
        "score": 2,
        "subreddit": "investing",
        "created": 1624157831.0
    },
    {
        "author": "LeoBarca-10",
        "body": "I am heavily invested in Fortinet. As for the “why” do your DD and just look at the growth in that last 1 year. It’s competitors are the likes of Cisco and paloalto and fortinet is starting to have majority of some markets. Targets for the stock are $350+ usd. This is not financial advice.",
        "created_utc": 1622768599,
        "id": "h0iej60",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1622797399.0
    },
    {
        "author": "Devilnutz2651",
        "body": "Anything Cisco is always good to know. Learn the firewall shit and you'll be good to go",
        "created_utc": 1623127140,
        "id": "h0zwf4g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623155940.0
    },
    {
        "author": "kynzo88",
        "body": "Csco",
        "created_utc": 1623359380,
        "id": "h1btc89",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623388180.0
    },
    {
        "author": "Introduction_Deep",
        "body": "Exactly, I buy 1.5 to 2 times my cash balance depending on how confident I am in my predictions.  About 1/3 is stable(ish) dividend plays with no options. 1/3 in further OTM calls on blue chips. 1/3 ATM calls on shorter term plays. I almost never touch meme stocks. \n\nI scan for higher IV on stocks like VZ, AAPL, T, CSCO, BAC... If I'm a bag holder these are generally good companies that will recover.",
        "created_utc": 1623613303,
        "id": "h1njywi",
        "score": 1,
        "subreddit": "options",
        "created": 1623642103.0
    },
    {
        "author": "Dadd_io",
        "body": "Hahaha I don't care if I get downvoted.  And I don't expect sideways until August.  The June inflation and payroll expense numbers will continue taking out the pure speculation tech stocks because people will start to realize the Fed will HAVE to raise rates and they're floating on debt.  Then the next month, small and midcap growth take the hit and the record leverage will start getting called.  When it does, the whole 8+ years of speculative gains will unravel.  This is exactly like 2000.  Last time it was the internet ... this time it's blockchain and cloud computing. Last time it was Janus and Van Wagoner and this time it's ARK.  Last time it was AOL, Cisco, and Intel .. this time it'll be Apple and Tesla and Nvidia.  . They are all good companies, but they are highly overpriced.  I'm counting on value and international stocks holding up like last time.  If I'm wrong, well they are still going up for now and I'm sleeping fine.",
        "created_utc": 1623216620,
        "id": "h14c8c4",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1623245420.0
    },
    {
        "author": "exaltedgod",
        "body": "&gt; Cause their phones failed, they’ve moved onto cyber security and their stock hasn’t adjusted to that change yet.\n\nGonna get downvoted for this because I am going against the hive.... As someone in the cybersecurity field and tracks that space, there is nothing to reflect. BB bought up a mediocre antivirus tool (Cylance) busted their butts to get it on the same playing field as other EDR products (endpoint detection and response, think AV software amped up and without all the false positives) but they are still bottom of the pack (review the Gartner quadrant [here](https://www.microsoft.com/security/blog/2021/05/11/gartner-names-microsoft-a-leader-in-the-2021-endpoint-protection-platforms-magic-quadrant/)).\n\n&gt; Similar companies in the industry are priced around $40-60 mark but I think they have a lot more potential imo. \n\nEDR vendors that be competitors to Black Berry are as follows:  \n\n* CrowdStrike - $216\n* SentinelOne - Private Company\n* Microsoft Defender - $245\n* VMware Carbon Black - $159\n* Broadcom Symantec ATP - $23\n* Malwarebytes - Private Company\n* Cisco AMP - $54\n\nWhoever you are listening too on BlackBerry and \"cybersecurity\" needs to do some basic research. The Cylance product (and the functions it brings) they bought is basically dead and has zero room for growth. That is 1/3 of their entire offering. Other services and capabilities by BlackBerry aren't used by large firms any more. Companies like FireEye, Mandiant, CrowdStrike, etc have better IR and forensic services.",
        "created_utc": 1622803222,
        "id": "h0jvjii",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622832022.0
    },
    {
        "author": "Devilnutz2651",
        "body": "It's just the one office, but I have like 6 APs. I was using Cisco APs, but switched to Ubiquiti last year and they're a million times better. The Cisco ones would keep losing their group membership/connection to the controller and I was constantly having to reset them and re add them. Was a pain in the ass",
        "created_utc": 1623126753,
        "id": "h0zvtl8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623155553.0
    },
    {
        "author": "thehokage7th",
        "body": "Cisco and Netgear are going to the moon, has anyone looked at the charts",
        "created_utc": 1623431633,
        "id": "h1f9zgy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623460433.0
    },
    {
        "author": "Actual-Investor",
        "body": "I mean artificial intelligence (AI) and internet of things (IoT). A couple of companies I like are for instance Cisco and Qualcomm :).",
        "created_utc": 1623488286,
        "id": "h1hypj5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1623517086.0
    },
    {
        "author": "Hircania",
        "body": "Hello people,\n\nI was looking up SP500 financial statements the other day and came across CISCO 2021 Q3 report. How is this possible since we are only in June?\n\nthanks",
        "created_utc": 1623308552,
        "id": "h194n6h",
        "score": 1,
        "subreddit": "investing",
        "created": 1623337352.0
    },
    {
        "author": "nebulausacom",
        "body": "2019 yaaaaa. and also look at Cisco upside potential to 2000.",
        "created_utc": 1623345352,
        "id": "h1aw90z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623374152.0
    },
    {
        "author": "BigBrianBrand",
        "body": "I would be curious to know how profitable Cisco and Motorola were in Asia. If they were really that successful then their growth wouldn’t have slowed as rapidly. Google for reference only has 45% of their revenue for its ad business come from the US…Europe and Asia combined make up more. \n\nApple and Netflix are overpriced stocks. Apple hasn’t innovated in the last 7 years (flat revenue since 2015) and Netflix doesn’t have a big moat + decelerating subscribers. \n\nMy comment was directed towards Microsoft/Amazon/Google. Yes, there can always be disruptive tech that threatens established businesses that have to be monitored for. But until then the only threat to these 3 are government regulatory pressures.\n\nEdit: I doubt Microsoft, Intel, Cisco and Dell in 2000 made up 27% of the S&amp;P 500 like FAAMG currently does",
        "created_utc": 1623219384,
        "id": "h14fy8d",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1623248184.0
    },
    {
        "author": "WavRider1969",
        "body": "Yes, CSCO is fine.  Recommended on CNBC many times.  Do I have to buy when the DOW is up 600 pts though:)  Ha.  Will look at it when/if we drop to the S&amp;P 4135 area :) later this week.  Lets Roll",
        "created_utc": 1624300227,
        "id": "h2kccah",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624329027.0
    },
    {
        "author": "happierdayz4me3",
        "body": "How does it go from a mover back to Cisco? There's so much they're doing and it's nestled way below where it should be. I cant really play today so I have a cheap strangle but it would nice to not see both ends be ITM and only one.",
        "created_utc": 1623413061,
        "id": "h1e6lkl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623441861.0
    },
    {
        "author": "ModernBuddha1",
        "body": "Blackberry has EDR and XEDR. Why didn’t the US military and DoD go with Cisco? Kasperky? Comodo? Etc? \n\nJust to break the news to, none of the companies u listed have DODiN or NSA certification!",
        "created_utc": 1623627531,
        "id": "h1obh9h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623656331.0
    },
    {
        "author": "Joghobs",
        "body": "CSCO too",
        "created_utc": 1623693707,
        "id": "h1r7yqq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623722507.0
    },
    {
        "author": "LiqCourage",
        "body": "CSCO had billions in the bank.  it still hasn't recovered its all time high from 2000.  It went down 90% during the bear market.",
        "created_utc": 1623774681,
        "id": "h1v4btw",
        "score": 1,
        "subreddit": "investing",
        "created": 1623803481.0
    },
    {
        "author": "BigBrianBrand",
        "body": "Intel and Cisco in 2000 aren’t comparable to FAAMG.\n\nHigher interest rates, less globalization, and weaker business models compared to big tech now.",
        "created_utc": 1623217283,
        "id": "h14d5ki",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1623246083.0
    },
    {
        "author": "Dadd_io",
        "body": "See Intel and Cisco in 2000.  They are still  great companies only now they are value stocks and still haven't hit their 2000 peaks.",
        "created_utc": 1623217229,
        "id": "h14d2w9",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1623246029.0
    },
    {
        "author": "dapperKillerWhale",
        "body": "Crypto could also crash at any moment (but do buy after if it happens); I’d recommend Ethereum over BTC these days.\n\nI’ll echo what the other guy said about dividend-paying value stocks. My plays there have been MO, ORCL, CSCO, and the etf VYM. MO doubles as a long-term weed play imo, so room for growth too, and I like boomer tech companies bc I think that although they’re value stocks, they also have room to grow, as more companies modernize and shift work remotely. VYM is nice because it’s diverse and balances the sector composition of my particular portfolio.",
        "created_utc": 1623009225,
        "id": "h0tv1hg",
        "score": 1,
        "subreddit": "investing",
        "created": 1623038025.0
    },
    {
        "author": "Quasimo11",
        "body": "u/theleveragedsellout  I agree with what you are saying.  I see a lot of comments from people believing that Apple can do no wrong and that their sales and share price will always go up with minimal comments about valuation.  I think Apple is overvalued at this point in time and believe that investing in the company right now is risky.  Share price could easily trade sideways for a few years (like Walmart from 2000 to 2010) to allow earnings to catch up with price or it could correct to the downside (like Cisco from 2000 to 2001).  I view any upside to be very limited and not at a favorable risk to reward ratio.",
        "created_utc": 1622775071,
        "id": "h0irs75",
        "score": 1,
        "subreddit": "investing",
        "created": 1622803871.0
    },
    {
        "author": "redderper",
        "body": "My point is that history has shown that buying the dip doesn't always work, even if it's a good company. A lot of the times you'll try to catch a falling knife that way. Look at the dotcom bubble, very extreme example, but even the greatest tech companies didn't reach a new high until around 10 years in. Companies like Cisco have never reached a new high. 99% of tech companies from that period went bankrupt most likely.\n\nIf you diversify the majority of your portfolio over value stocks and ETF's and have a smaller part in tech stocks/etf's you'll make much more steady and safer gains. It's a solid strategy. People in this thread are acting like OP is an idiot for rotating to value stocks while that isn't a bad idea IMO, even if you lose some short term gains.",
        "created_utc": 1624051259,
        "id": "h297qc6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624080059.0
    },
    {
        "author": "BigBrianBrand",
        "body": "My valuations are based on 10 year earnings per share projections. \n\nYour comment lists random “what ifs” without explaining what moves they’re making to capture future market share. The only innovative moves in the last few years are service based - the m1 chip, watch, and airpods. There’s the credit card as well in the fintech space. \n\nIf you look at their balance sheet you’ll see earnings per share has only doubled from $2.40 to $4.60 for a $130 stock… also the dividend has 1.5x’ed going from $0.50 to $0.82. I would be willing to bet the downvoters above have never taken a look at apples balance sheet\n\nYou can have a great business and an overvalued stock - see Microsoft, Cisco, and Intel in 2000. I’m not saying Apple is guaranteed to crash massively (I doubt it), I’m saying that there is healthy skepticism regarding future growth at the current stock price when service, complementary features to the phone are the only money making moves I’m seeing. Unless the m1 chip will significantly reduce iPhone costs causing profit margins to soar.",
        "created_utc": 1624240476,
        "id": "h2hqigl",
        "score": 0,
        "subreddit": "investing",
        "created": 1624269276.0
    },
    {
        "author": "Joghobs",
        "body": "Did CSCO just announce something big? Cause uhhh...",
        "created_utc": 1623707168,
        "id": "h1s1l63",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1623735968.0
    },
    {
        "author": "WoodpeckerAlarmed239",
        "body": "All I have is a Roth IRA and can only put in $6,000 a year. I've been at it for 6 years now and it's doing pretty well. I don't make a whole lot of money so it's a perfect set up for me. I max it out, buy some solid names at good prices and try to hold them.\n\nThe plan is obviously retirement. But if anything comes up before then, I can take out money with no penalties and do what I need to do, maybe a down payment on a house one day.\n\nIf there's one thing I wish I did more, was take some risks for high returns. But I don't think now is the time for that. I hate holding a stock with no dividend and just watching it bounce around so I go with dividend payers. \n\nMy positions are: SWKS, LMT, AAPL, CSCO, QCOM, KLIC, INTC, KMI. A bit tech heavy but I know they will be relevant for years to come.\n\nI also have a problem buying a stock \"early\" and selling it before it really takes off. Broadcom and Align technologies are the two that come to mind.",
        "created_utc": 1623017818,
        "id": "h0uda6p",
        "score": 9,
        "subreddit": "investing",
        "created": 1623046618.0
    },
    {
        "author": "swahappycat",
        "body": "I did it with a hundred dollars into CSCO back in 2008. I logged back in in 2021 and found two hundred dollars waiting for me! So to answer your question, it's a sure way to double your money every 13 years. Can't beat that.",
        "created_utc": 1623467378,
        "id": "h1h8mnm",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1623496178.0
    },
    {
        "author": "greytoc",
        "body": "Crowdstrike is primarily known for endpoint protection which are software solutions to protect computers (workstations, laptops, servers) known as NGAV (next gen antivirus) and EDR (endpoint detect and response). They also offer a type of managed service known in the industry as MDR. Their customers will range across all industries and their solutions are appropriate for small to large enterprises. It's actually a pretty crowded market imo. There aren't a lot of comparables in the public market but you may be able to check out Sentinel 1 when they IPO. There are rumors of Cybereason IPO as well. \n\nFireye has an EDR solution but I imagine it's a tiny part of their business. And no one really would bring up Fireeye when talking about endpoint protection. Fireeye/Mandiant is most known for their incident response and forensic products and services. They are usually on top of most people's list to call whenever there is a security breach. \n\nBoth Palo Alto and Fortinet started off as security networking companies competing with traditional firewall companies like Netscreen and Cisco. In fact, the founders of both companies are former Netscreen execs iirc. Both companies have expanded their product and service offerings over the years to support security operations solutions. You tend to see Palo Alto and Fortinet used in larger enterprises who need holistic network security solutions. Normally, if a security team is looking at a Palo Alto solutions, they are probably also comparing it Fortinet and vice-versa. \n\nGenerally speaking - cyber-security industry is very broad. You are not likely to find a single company that would cover the entire gamut of security needs for an enterprise. So if your interest is in broad industry exposure - an ETF is probably a better solution.",
        "created_utc": 1622907981,
        "id": "h0p3r3o",
        "score": 6,
        "subreddit": "investing",
        "created": 1622936781.0
    },
    {
        "author": "KawhiLeonardIsSenpai",
        "body": "Depends. You want lower dividend yield + growth: MSFT, JPM, AAPL, VERIZON (currently not growth, but I think  price will  go higher due to 5G hype)\n\nYou want higher dividend yield, but little to no growth: P&amp;G, 3M, CSCO (should have been growth if the CEO wasn't a moron), COSTCO, HOME DEPOT, RAYTHEON, KIMBERLY CLARK, B&amp;G, IRON MOUNTAIN, ALTRIA, ABBVIE (some say it's growth, but I don't trust biotech/pharma growth as compared to tech growth)",
        "created_utc": 1623525612,
        "id": "h1jmy2i",
        "score": 5,
        "subreddit": "stocks",
        "created": 1623554412.0
    },
    {
        "author": "Life_Whereas_3789",
        "body": "Oh summer child. \n2011 CSCO trades was was the first Cyclical stock on WSB. Introduced me to options and I lost my ass. \n\nAs for commodity tanker gang *exists*.",
        "created_utc": 1623363093,
        "id": "h1c1juy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1623391893.0
    },
    {
        "author": "bungholio99",
        "body": "This makes no sense, i hope only your gains decrease, cause if not you would have bought in way to close to the top...\nI mean yes Cisco and Coca Cola for example are losing today but you didn’t buy it yesterday.",
        "created_utc": 1623432803,
        "id": "h1fco2t",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1623461603.0
    },
    {
        "author": "SportTheFoole",
        "body": "Yep. And bags can get VERY heavy (just look at CSCO: if you bought in 2000/2001, you are still underwater and that’s not even counting inflation).\n\nPlaying meme stocks is fine. But don’t join “movements”. Those people are going to get destroyed and a lot of them are not playing with fun money.",
        "created_utc": 1623073814,
        "id": "h0wpuj0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623102614.0
    },
    {
        "author": "Dadd_io",
        "body": "Microsoft was one of the overpriced ones back in 2000.  And there was EBay and Webvan (online groceries), eToys (Amazon for toys), Napster (Spotify), AOL (internet access plus content), Pet.com (Chewy), Intel (NVidia).  2000 didn't have Tesla and its 600 PE in the top 10 companies, but it had Cisco at 110 PE.  The fact that you don't know the parallels is more alarming than me comparing them.",
        "created_utc": 1623249776,
        "id": "h15pgoi",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1623278576.0
    },
    {
        "author": "jokull1234",
        "body": "Look at the top 10 qqq weighted companies from 1999-2001 compared to the top 10 today. The only glaringly overvalued one today is Tesla (and they still have huge revenues) \n\nMeanwhile the companies in 2000 include Cisco (probably more overvalued back then than Tesla is today), world com (lol), dell, Ericsson, and oracle. You can’t say with a straight face that the companies back then are anywhere close to as high quality as the top 10 today.",
        "created_utc": 1623433515,
        "id": "h1feaug",
        "score": 2,
        "subreddit": "investing",
        "created": 1623462315.0
    },
    {
        "author": "jeanneLstarr",
        "body": "SOFI.   ILMN.  CScO.  CRM",
        "created_utc": 1622599595,
        "id": "h09kq2t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622628395.0
    },
    {
        "author": "WoodpeckerAlarmed239",
        "body": "$KMI: an oil pipeline that I recommend for sure. Up about 38% YTD. Great dividend so you might be interested.\n\n$KLIC: a small semi conductor equipment manufacturer based in Singapore, up about 58% YTD. It's been on a nice run and I see more growth coming. It seems like everyone is trying to make their own chips now a days so these guys might see some growth for a while. It's been on a hell of a run but the P/E is still just 22. And earnings are growing fast. \n\n$CSCO- It's also been doing good for me this year. up about 20% YTD. Businesses are starting to update their networks now that people are getting back to it. I also have a feeling a lot of hacker sensitive businesses will need to make their own secure networks completely isolated from the www. This is just my theory for a big run. Even if they don't get that drastic they will still see growth for a while.",
        "created_utc": 1622657816,
        "id": "h0cci2c",
        "score": 2,
        "subreddit": "investing",
        "created": 1622686616.0
    },
    {
        "author": "LeoBarca-10",
        "body": "I am heavily invested in Fortinet. As for the “why” do your DD and just look at the growth in that last 1 year. It’s competitors are the likes of Cisco and paloalto and fortinet is starting to have majority of some markets. Targets for the stock are $350+ usd. This is not financial advice.",
        "created_utc": 1622768599,
        "id": "h0iej60",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1622797399.0
    },
    {
        "author": "Devilnutz2651",
        "body": "Anything Cisco is always good to know. Learn the firewall shit and you'll be good to go",
        "created_utc": 1623127140,
        "id": "h0zwf4g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623155940.0
    },
    {
        "author": "kynzo88",
        "body": "Csco",
        "created_utc": 1623359380,
        "id": "h1btc89",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623388180.0
    },
    {
        "author": "Introduction_Deep",
        "body": "Exactly, I buy 1.5 to 2 times my cash balance depending on how confident I am in my predictions.  About 1/3 is stable(ish) dividend plays with no options. 1/3 in further OTM calls on blue chips. 1/3 ATM calls on shorter term plays. I almost never touch meme stocks. \n\nI scan for higher IV on stocks like VZ, AAPL, T, CSCO, BAC... If I'm a bag holder these are generally good companies that will recover.",
        "created_utc": 1623613303,
        "id": "h1njywi",
        "score": 1,
        "subreddit": "options",
        "created": 1623642103.0
    },
    {
        "author": "Dadd_io",
        "body": "Hahaha I don't care if I get downvoted.  And I don't expect sideways until August.  The June inflation and payroll expense numbers will continue taking out the pure speculation tech stocks because people will start to realize the Fed will HAVE to raise rates and they're floating on debt.  Then the next month, small and midcap growth take the hit and the record leverage will start getting called.  When it does, the whole 8+ years of speculative gains will unravel.  This is exactly like 2000.  Last time it was the internet ... this time it's blockchain and cloud computing. Last time it was Janus and Van Wagoner and this time it's ARK.  Last time it was AOL, Cisco, and Intel .. this time it'll be Apple and Tesla and Nvidia.  . They are all good companies, but they are highly overpriced.  I'm counting on value and international stocks holding up like last time.  If I'm wrong, well they are still going up for now and I'm sleeping fine.",
        "created_utc": 1623216620,
        "id": "h14c8c4",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1623245420.0
    },
    {
        "author": "exaltedgod",
        "body": "&gt; Cause their phones failed, they’ve moved onto cyber security and their stock hasn’t adjusted to that change yet.\n\nGonna get downvoted for this because I am going against the hive.... As someone in the cybersecurity field and tracks that space, there is nothing to reflect. BB bought up a mediocre antivirus tool (Cylance) busted their butts to get it on the same playing field as other EDR products (endpoint detection and response, think AV software amped up and without all the false positives) but they are still bottom of the pack (review the Gartner quadrant [here](https://www.microsoft.com/security/blog/2021/05/11/gartner-names-microsoft-a-leader-in-the-2021-endpoint-protection-platforms-magic-quadrant/)).\n\n&gt; Similar companies in the industry are priced around $40-60 mark but I think they have a lot more potential imo. \n\nEDR vendors that be competitors to Black Berry are as follows:  \n\n* CrowdStrike - $216\n* SentinelOne - Private Company\n* Microsoft Defender - $245\n* VMware Carbon Black - $159\n* Broadcom Symantec ATP - $23\n* Malwarebytes - Private Company\n* Cisco AMP - $54\n\nWhoever you are listening too on BlackBerry and \"cybersecurity\" needs to do some basic research. The Cylance product (and the functions it brings) they bought is basically dead and has zero room for growth. That is 1/3 of their entire offering. Other services and capabilities by BlackBerry aren't used by large firms any more. Companies like FireEye, Mandiant, CrowdStrike, etc have better IR and forensic services.",
        "created_utc": 1622803222,
        "id": "h0jvjii",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622832022.0
    },
    {
        "author": "Devilnutz2651",
        "body": "It's just the one office, but I have like 6 APs. I was using Cisco APs, but switched to Ubiquiti last year and they're a million times better. The Cisco ones would keep losing their group membership/connection to the controller and I was constantly having to reset them and re add them. Was a pain in the ass",
        "created_utc": 1623126753,
        "id": "h0zvtl8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623155553.0
    },
    {
        "author": "thehokage7th",
        "body": "Cisco and Netgear are going to the moon, has anyone looked at the charts",
        "created_utc": 1623431633,
        "id": "h1f9zgy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623460433.0
    },
    {
        "author": "Actual-Investor",
        "body": "I mean artificial intelligence (AI) and internet of things (IoT). A couple of companies I like are for instance Cisco and Qualcomm :).",
        "created_utc": 1623488286,
        "id": "h1hypj5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1623517086.0
    },
    {
        "author": "Hircania",
        "body": "Hello people,\n\nI was looking up SP500 financial statements the other day and came across CISCO 2021 Q3 report. How is this possible since we are only in June?\n\nthanks",
        "created_utc": 1623308552,
        "id": "h194n6h",
        "score": 1,
        "subreddit": "investing",
        "created": 1623337352.0
    },
    {
        "author": "nebulausacom",
        "body": "2019 yaaaaa. and also look at Cisco upside potential to 2000.",
        "created_utc": 1623345352,
        "id": "h1aw90z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623374152.0
    },
    {
        "author": "BigBrianBrand",
        "body": "I would be curious to know how profitable Cisco and Motorola were in Asia. If they were really that successful then their growth wouldn’t have slowed as rapidly. Google for reference only has 45% of their revenue for its ad business come from the US…Europe and Asia combined make up more. \n\nApple and Netflix are overpriced stocks. Apple hasn’t innovated in the last 7 years (flat revenue since 2015) and Netflix doesn’t have a big moat + decelerating subscribers. \n\nMy comment was directed towards Microsoft/Amazon/Google. Yes, there can always be disruptive tech that threatens established businesses that have to be monitored for. But until then the only threat to these 3 are government regulatory pressures.\n\nEdit: I doubt Microsoft, Intel, Cisco and Dell in 2000 made up 27% of the S&amp;P 500 like FAAMG currently does",
        "created_utc": 1623219384,
        "id": "h14fy8d",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1623248184.0
    },
    {
        "author": "happierdayz4me3",
        "body": "How does it go from a mover back to Cisco? There's so much they're doing and it's nestled way below where it should be. I cant really play today so I have a cheap strangle but it would nice to not see both ends be ITM and only one.",
        "created_utc": 1623413061,
        "id": "h1e6lkl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623441861.0
    },
    {
        "author": "ModernBuddha1",
        "body": "Blackberry has EDR and XEDR. Why didn’t the US military and DoD go with Cisco? Kasperky? Comodo? Etc? \n\nJust to break the news to, none of the companies u listed have DODiN or NSA certification!",
        "created_utc": 1623627531,
        "id": "h1obh9h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623656331.0
    },
    {
        "author": "Joghobs",
        "body": "CSCO too",
        "created_utc": 1623693707,
        "id": "h1r7yqq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623722507.0
    },
    {
        "author": "BigBrianBrand",
        "body": "Intel and Cisco in 2000 aren’t comparable to FAAMG.\n\nHigher interest rates, less globalization, and weaker business models compared to big tech now.",
        "created_utc": 1623217283,
        "id": "h14d5ki",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1623246083.0
    },
    {
        "author": "Dadd_io",
        "body": "See Intel and Cisco in 2000.  They are still  great companies only now they are value stocks and still haven't hit their 2000 peaks.",
        "created_utc": 1623217229,
        "id": "h14d2w9",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1623246029.0
    },
    {
        "author": "dapperKillerWhale",
        "body": "Crypto could also crash at any moment (but do buy after if it happens); I’d recommend Ethereum over BTC these days.\n\nI’ll echo what the other guy said about dividend-paying value stocks. My plays there have been MO, ORCL, CSCO, and the etf VYM. MO doubles as a long-term weed play imo, so room for growth too, and I like boomer tech companies bc I think that although they’re value stocks, they also have room to grow, as more companies modernize and shift work remotely. VYM is nice because it’s diverse and balances the sector composition of my particular portfolio.",
        "created_utc": 1623009225,
        "id": "h0tv1hg",
        "score": 1,
        "subreddit": "investing",
        "created": 1623038025.0
    },
    {
        "author": "Quasimo11",
        "body": "u/theleveragedsellout  I agree with what you are saying.  I see a lot of comments from people believing that Apple can do no wrong and that their sales and share price will always go up with minimal comments about valuation.  I think Apple is overvalued at this point in time and believe that investing in the company right now is risky.  Share price could easily trade sideways for a few years (like Walmart from 2000 to 2010) to allow earnings to catch up with price or it could correct to the downside (like Cisco from 2000 to 2001).  I view any upside to be very limited and not at a favorable risk to reward ratio.",
        "created_utc": 1622775071,
        "id": "h0irs75",
        "score": 1,
        "subreddit": "investing",
        "created": 1622803871.0
    }
]