[
    {
        "author": "SirWatson221",
        "body": "$WDC and $UPST",
        "created_utc": 1626120784,
        "id": "h4yj81p",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626149584.0
    },
    {
        "author": "IdiotTetris",
        "body": "So you're saying go all in on $WDC?",
        "created_utc": 1625238841,
        "id": "h3ta9ai",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625267641.0
    },
    {
        "author": "skilliard7",
        "body": "If you're investing in dividends for \"reliable\" income, diversification is crucial. Companies can and do cut their dividend, sometimes even when they can still afford to pay it. For example, Western Digital suspended their dividend in March 2020 to focus on reducing debt and investing back in the company, and it remains suspended even as their profits have resumed.\n\nOwning a fund like VYM and/or VIG provides significant diversification. That way during recessions you might see a 25% reduction in dividend income if things are really bad, vs if you invested in a single stock you might see a 100% reduction.",
        "created_utc": 1626024531,
        "id": "h4tsr56",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626053331.0
    },
    {
        "author": "BanquetDinner",
        "body": "$WDC no longer pays a dividend.",
        "created_utc": 1626095859,
        "id": "h4x0uxv",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1626124659.0
    },
    {
        "author": "peaceinpieces",
        "body": "I like WDC more than Micron at the moment pending the Kioxia IPO being targeted for September. They’re about the same size in the NAND market and they produce it through their joint venture. If Kioxia IPOs at $30B (multiple datapoints for this valuation, including acquisition bids), then $WDC is a steal at current prices since they also have a hard drive business.",
        "created_utc": 1625239243,
        "id": "h3tb7dn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625268043.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "my top 10 favorite stocks to invest in weekly  that always yield me positive returns by EOW\n\n1. COP\n2. TSLA\n3. WFC\n4. AAPL\n5. ENPH\n6. XOM\n7. VIAC\n8. CAT\n9. MGM\n10. RTX\n\n&amp;#x200B;\n\nMy top 10 day trade stocks to trade by EOD\n\n1. AMC\n2. BB\n3. CLOV\n4. WDC\n5. ULTHF\n6. AABB\n7. GME\n8. MVIS\n9. WISH\n10. OCGN",
        "created_utc": 1626113134,
        "id": "h4y2zj0",
        "score": -8,
        "subreddit": "wallstreetbets",
        "created": 1626141934.0
    },
    {
        "author": "MVST_100_OR_BUST",
        "body": "Just to be open and because I care more about y'all more than myself or Vogel I do want to mention that there has been a change in the lockup. Not good or bad just changed.\n\nIt's been all over the place since last year between Vogel and Wu. But this is the final iteration it seems.\n\nThe last iteration was\nWu: 25% locked for 1 year unless above $15 for 20 days. 75% two year locked \n\nOther Microvast shareholders: 6 months\n\nVogel/Tuscan: \n50% is locked for 1 year, unless it trades above $12.50 for 20 days. The other 50% is locked for 2 years.\n\n\n\n**Now it is**\nWu: 25% locked for 1 year unless above $15 for 20 days. 75% two year locked. (Yes unchanged)\n\nOther Microvast shareholders: 6 months\n\nVogel/Tuscan:\n**READ THIS CAREFULLY**\n \nOf 75% of shares, 67% of the shares are locked for 1 year unless above $12.50 for 20 days. The other 33% is locked for 1 year regardless of price. \n\nOf the other 25% of shares, 50% is locked for 1 year unless it trades over $12 for 20 days. The other 50% is locked for 1 year unless it trades over 15. However he will lose his shares if none of these conditions are met.\n\nThese lockups are fairly similar (e.g 67% of 75% is 50%). I don't know if he's fucking with me or I'm just stupid). In summarize it's leaning more positive in my opinion that Vogel got himself a poor man's \"FDs\" and is either bullish or likes to gamble. Can slightly sell more now if it goes up, but will forfeit ownership to them for $0 if it doesn't.",
        "created_utc": 1625260642,
        "id": "h3upv5h",
        "score": 61,
        "subreddit": "SPACs",
        "created": 1625289442.0
    },
    {
        "author": "f1_manu",
        "body": "I've used it. Very good fees, good platform and pretty darn quick. It's up there with Remitly for me.\n\nMy ranking is:\n\n1. Remitly/Wise\n2. Western Union\n3. Xoom\n\nHaving said that, their market is dependent on ease of use and low fees and they don't really have a loyal customer base. So realistically any company could take over in 3-5 yrs time.",
        "created_utc": 1625665787,
        "id": "h4cqcgl",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625694587.0
    },
    {
        "author": "TheDudeAbidesFarOut",
        "body": "Wu-Tang forever....muthafukah!",
        "created_utc": 1625594349,
        "id": "h49fzp2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625623149.0
    },
    {
        "author": "Doctor_Profits",
        "body": "After I graduated college in 1998, I moved to a city and got a job for a company that had a ESPP.  The plan was that on the last day of each quarter, I could buy FDC stock at a 15% discount based on the stock price on the 1st day of the quarter, or the last day of the quarter, whichever was lower.  Over several years I accumulated almost 1000 shares of FDC.  8 years after I started working there, they spun off WU stock (which I sold soon after) and a few months after that they were bought by a private equity company and taken private.",
        "created_utc": 1625510024,
        "id": "h45jj2w",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1625538824.0
    },
    {
        "author": "llennacs",
        "body": "Step into The Wu, Wu-tang financial.",
        "created_utc": 1625410581,
        "id": "h411f6d",
        "score": 1,
        "subreddit": "investing",
        "created": 1625439381.0
    },
    {
        "author": "12stolmylicenseplate",
        "body": "https://youtu.be/aRICiN0t2LY It’s Wu mothafukas Wutang Mothafukas",
        "created_utc": 1625348715,
        "id": "h3ymjie",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625377515.0
    },
    {
        "author": "Accurate_Station7458",
        "body": "Why does western union have $5.6billion in revenue. Other added advantages is traffic through website, currency fees, and interest on interim cash.",
        "created_utc": 1625581044,
        "id": "h48mu62",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625609844.0
    }
]