[
    {
        "author": "Former-Light4284",
        "body": "That or maybe she will br hail as its greatest savior for backing innovative tech that ushered in a new age. Time will tell but right now her investments are solid in my opinion. She doesnt just buy into facebook, amazon and miscrsoft like everyone elsr she looks for future growth or innovation. My opinion...",
        "created_utc": 1633549517,
        "id": "hfn54om",
        "score": 15,
        "subreddit": "SPACs",
        "created": 1633578317.0
    },
    {
        "author": "soulstonedomg",
        "body": "You only get so many uses over a period of time. Republicans have the democrats stalled out on their major agenda items (the kind of stuff democrats would want to use BR on) and instead have them using their time staving off a non-partisan disaster and using partisan ammunition to do so.",
        "created_utc": 1633555624,
        "id": "hfnjh2a",
        "score": 13,
        "subreddit": "stocks",
        "created": 1633584424.0
    },
    {
        "author": "Xehanz",
        "body": "I'm not from the US, but I assume it works just like our extreme cases down here in South America. Wuppose ylu pay something over 48 months and each payment does not get adjusted to inflation, you are effectively paying a little bit less each month. \n\nNow, in a country with a 30% inflation rate average each year that won't help because they alredy take that into account and bump up the prices of everything by a lot if you want a payment plan instead of paying up front. But in the US where the inflation is not always present in everybody's mind you might br able to save a little bit with payment plan sjch as buying a house, etc,since eachpenny is worth a little bit less each months. Of course, that's assuming both salaries and your investments do not lose to inflation, wich is a pretty damn big if.",
        "created_utc": 1634088269,
        "id": "hgfgrtp",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1634117069.0
    },
    {
        "author": "GeorgeWashingtonTFP",
        "body": "Hey u/Thick-Acanthaceae sooo you [remember this?](https://www.reddit.com/r/wallstreetbets/comments/q5sih9/daily_discussion_thread_for_october_11_2021/hg8a8s3?utm_medium=android_app&amp;utm_source=share&amp;context=3) haha how's it feel? To br wrong ya know?",
        "created_utc": 1634001047,
        "id": "hgarhi1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634029847.0
    },
    {
        "author": "cyberfyed",
        "body": "I disagree.  Principle bidding across the spectrum is how it should be done.  Im one person though as seeing how many downvotes I get for arguing to be a decent human many disagree I guess.  To each their own though as I will argue for decency and fair 0rices across the spectrum as thats how I do sidework etc.\n\nNow dont get me wrong there is an industry standard for pricing of certain jobs/trades.  My point is if you would do it for 10k and obviously you were making a profit you were comfortable with by doing so, padding like 5k ok whatever to the guy doing 4th br but this guy is 5xing the cost which is an 500% increase ... thats just wrong imo.",
        "created_utc": 1633993007,
        "id": "hgaav5u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634021807.0
    },
    {
        "author": "BarTendiesss",
        "body": "Good luck trying to sleep tonight bulls.\nDon't slam that F5 button too hard.",
        "created_utc": 1633904817,
        "id": "hg5q8pw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633933617.0
    },
    {
        "author": "VisualMod",
        "body": "&gt;F5 Completes Acquisition of Threat Stack to Enhance Cloud Security Portfolio\n$FFIV\n\n^\\*Walter ^Bloomberg ^[@DeItaone](http://twitter.com/DeItaone) ^at ^2021-10-04 ^09:00:53 ^EDT-0400",
        "created_utc": 1633352463,
        "id": "hfcgms8",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1633381263.0
    },
    {
        "author": "Shaun8030",
        "body": "ETFs \n\nQQQ\nVGT\nQQQJ\nARKW\nSMH \nTQQQ\nBTC \n\nStocks\n\nApple \nAmzn \nGOOG \nMSFT\nFB\nMA\nDis\nAdbe\nQCOM\nShop \nSquare\nPayPal \nAmd\nTsm\nTsla\nNvda",
        "created_utc": 1633183599,
        "id": "hf3l348",
        "score": 5,
        "subreddit": "stocks",
        "created": 1633212399.0
    },
    {
        "author": "panic_hand",
        "body": "Somebody put together a montage of every event that Musk has promised Fully autonomous as being only a year or less away, promising people that their cars would soon become income generating capital for them. Basically the montage goes back for years. \n\nElon made PayPal. Aside from that, he's just a very smooth car salesman. I mean the kind you avoid cus they try to upsell you on everything.",
        "created_utc": 1633255683,
        "id": "hf7iztr",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633284483.0
    },
    {
        "author": "mrpanda350",
        "body": "PYPL",
        "created_utc": 1633114507,
        "id": "hf09xj9",
        "score": 2,
        "subreddit": "options",
        "created": 1633143307.0
    },
    {
        "author": "californianotter",
        "body": "In terms of unrealized gain, it wiped out ~200k.  PYPL and Steel Stocks really took a hard hit.  I also took a big loss on BGFV that I harvested for tax purposes.",
        "created_utc": 1633112111,
        "id": "hf04f6x",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633140911.0
    },
    {
        "author": "Shaun8030",
        "body": "ETFs\n\nQQQ VGT QQQJ ARKW SMH TQQQ BTC\n\nStocks\n\nApple Amzn GOOG MSFT FB MA Dis Adbe QCOM Shop Square PayPal Amd Tsm Tsla Nvda\n\nDiversified enough ? Thoughts for minimum 5 years.",
        "created_utc": 1633183769,
        "id": "hf3lfmy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633212569.0
    },
    {
        "author": "ebaley",
        "body": "That same paper that has:\n\n&gt;The steady addition of a constant amount of new coins is analogous to gold miners expending resources to add gold to circulation.\n\nBut I don't care what it says. The white paper was not a manifesto. I see the design of Bitcoin and it resembles a digital gold, not a Paypal or Visa.",
        "created_utc": 1633223465,
        "id": "hf63htt",
        "score": 1,
        "subreddit": "investing",
        "created": 1633252265.0
    },
    {
        "author": "cats-with-mittens",
        "body": "Fintech seems super crowded right now with PayPal, Square, Stripe, Klarna, Robinhood, Affirm, Chime, Petal, and Public.com.",
        "created_utc": 1633339273,
        "id": "hfbyi7y",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633368073.0
    },
    {
        "author": "LovelySalientDreams",
        "body": "I saw a mod say SQ is better than PYPL so you can smoke that",
        "created_utc": 1633091988,
        "id": "heyvni5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633120788.0
    },
    {
        "author": "Inspector-toTheMoon",
        "body": "I will pay with paypal but ist doesn‘t work. :/",
        "created_utc": 1633177155,
        "id": "hf38qtv",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1633205955.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "MasterCard, Amazon, ETSY. You’ll win.\n\nYou gotta think you only have three months and people will be anticipating holiday shopping and the stocks will price that in before earnings. You could throw in Target but it’s been trending downward. PayPal could be a good call too.",
        "created_utc": 1633298666,
        "id": "hfa2ny5",
        "score": 0,
        "subreddit": "StockMarket",
        "created": 1633327466.0
    },
    {
        "author": "Fart_Huffer_",
        "body": "So you don't believe which part? Weird you guys cant specify. \n\nDo you think he's not an Apartheid trust fund baby? Are you saying his ex wife lied? He named a kid syntax error for christ sake lol. You can still look up the lawsuits from his little PayPal clone scam. Basically they were targeting small accounts they thought couldn't take legal action and just pocketing the cash. There wasn't much they could do anyway as x.com wasn't FDIC insured. X.com was notorious for fraud to begin with. It was one of the early havens for CC scammers.\n\nIts crazy the shit Muskavites believe. The hyperloop err I guess just loop was a lolcow. Watching that first presentation where he went on about how easy it is to make a vacuum powered train and compared it to an air hockey table was fucking hilarious. Dumbfucks believed him too thats really the best part. Now he says he'll have a Mars base by 2024 and you lot of smooth brains eat it up.\n\nIts crazy how something that was just financial news 20 years ago is now a conspiracy. But then again you kids wouldnt remember. Learn to do some DD. It will help you out a lot.",
        "created_utc": 1633174755,
        "id": "hf34zle",
        "score": -2,
        "subreddit": "stocks",
        "created": 1633203555.0
    },
    {
        "author": "Fart_Huffer_",
        "body": "What about the current state of Germany though. They just boned landlords. I give that Tesla factory a year before its shut down. Elon sells a cult of personality. Also has a heap of dirt thats slowly seeping out. From his paypal knockoff blatantly pocketing money and shutting down accounts to him being a serial domestic abuser its really looking bad for him. I cant imagine the type of scumbag that would support a child abuser for some profits in the stock market. A the Grimes situation melts down its sure to shed a new light on Elons past. Im sure well start seeing articles about how he abused his ex wife for mourning their child dying of SIDS and similar issues with Elon. Its only a matter of time before his bubble pops. He probably should have kept his face out of Teslas business.",
        "created_utc": 1633152715,
        "id": "hf2cpp9",
        "score": -20,
        "subreddit": "stocks",
        "created": 1633181515.0
    },
    {
        "author": "mrpanda350",
        "body": "PYPL",
        "created_utc": 1633114507,
        "id": "hf09xj9",
        "score": 2,
        "subreddit": "options",
        "created": 1633143307.0
    },
    {
        "author": "californianotter",
        "body": "In terms of unrealized gain, it wiped out ~200k.  PYPL and Steel Stocks really took a hard hit.  I also took a big loss on BGFV that I harvested for tax purposes.",
        "created_utc": 1633112111,
        "id": "hf04f6x",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633140911.0
    },
    {
        "author": "LovelySalientDreams",
        "body": "I saw a mod say SQ is better than PYPL so you can smoke that",
        "created_utc": 1633091988,
        "id": "heyvni5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633120788.0
    }
]