[
    {
        "author": "631Zach",
        "body": "has potential but it’s pending a merger with xlnx. Been back and forth for months now but if the merger goes through and earnings are strong can definitely break out. AMD has so much going for them with their technology and chips in xbox, ps5, samsung phones, teslas. And if you know anything about cpus for computers the sentiment in the gaming world is intel=bad amd=good. Will reflect in market share in the long run.",
        "created_utc": 1624305418,
        "id": "h2knr51",
        "score": 81,
        "subreddit": "stocks",
        "created": 1624334218.0
    },
    {
        "author": "blanketknabber",
        "body": "Everybody knows AMD is a massively undervalued stock right now. The Xilinx merger has been putting a ton of pressure on them and has been keeping the stock trading sideways. If that is approved soon (which some articles say it is only a few weeks away) then this could be one of the biggest plays of the year. I have played AMD a few times and gotten burnt, but I think I may hop on some long $100 calls with you this time.",
        "created_utc": 1624381636,
        "id": "h2o63d0",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1624410436.0
    },
    {
        "author": "Upticks1",
        "body": "Well let’s see the stock went from $2 to $100 over the past 9 years or so. \n\nMarket cap is nearing 100B and with the XLnX acq likely in the 150+B range?\n\nGive it time to grow into its’s market cap. I have no doubts it’s headed to 200B market cap but who knows if it’s 2 years or 5 years from now. \n\nAMD is a buy and forget stock.\n\nInsiders and China are just taking profits in AMD",
        "created_utc": 1623290592,
        "id": "h18c8ln",
        "score": 43,
        "subreddit": "stocks",
        "created": 1623319392.0
    },
    {
        "author": "BubbleTeaExtraSweet",
        "body": "AMD is being held back by the XLNX acquisition. Once the deal is done. It’s no longer a moon trip but a Mars trip! Trust in Mama Su ![gif](emote|free_emotes_pack|money_face)",
        "created_utc": 1623563369,
        "id": "h1lesco",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1623592169.0
    },
    {
        "author": "Combat-Medic",
        "body": "What the fuck is this DD?!? You didn’t even mention the merger with Xilinx which is the biggest reason AMD would hit $100",
        "created_utc": 1624381720,
        "id": "h2o6a28",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1624410520.0
    },
    {
        "author": "littlered1984",
        "body": "Importance of Xilinx acquisition is being completely overblown on reddit and other places. A great company and great add, sure. But anyone with experience in the industry knows that FPGAs are not the next big thing.",
        "created_utc": 1624988396,
        "id": "h3gog5l",
        "score": 22,
        "subreddit": "stocks",
        "created": 1625017196.0
    },
    {
        "author": "FunkMetal804",
        "body": "AMD is currently trading at a discount and ready for lift off after the XLNX merger is wrapped up. The average analyst price target is $104.34. AMD has strong leadership, proven growth with billions in revenue and earnings, and they've been successfully competing and taking market share from larger companies. Strong buy and hold apes...",
        "created_utc": 1623871097,
        "id": "h20457u",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1623899897.0
    },
    {
        "author": "zethras",
        "body": "I bought around the $83.\n\nThe stock has been trading sideways since the last drop (to around $71). It has recover a lot already. It seems that a lot of the growth is already priced in plus, there is the merger thingy going on.\n\nIt seems that the merger is holding the stock back. Because AMD bought XLNX with shares, XLNX extra share will dilute the AMD share. So if the merger doesnt happen, AMD shares will go up and XLNX will go crashing down.\n\nAlso, AMD share will not go up until the merger is finalized. For me, I wont break even until 1 or 2 more Q earnings. Last earnings, the AMD stock went up to $88.",
        "created_utc": 1623295483,
        "id": "h18lruf",
        "score": 14,
        "subreddit": "stocks",
        "created": 1623324283.0
    },
    {
        "author": "kedstar99",
        "body": "AMD is in the process of acquiring Xilinx, a major designer of FPGAs and dedicated accelerator cards.\n\nXilinx own Solarflare which has huge market penetration in fintechs and CDNs for their low-latency NICs (think 50+%).\n\nThey own Alveo which is their AI accelerator cards.\n\nThey own smartstorage which is getting adoption.\n\nWith the acquisiton Xilinx/AMD will own the data-center with a one-stop solution for networking, storage, bespoke accelerators, x86 or GPUs.\n\nThat doesn't even take into account 5g/security/automotive.",
        "created_utc": 1625080241,
        "id": "h3leazw",
        "score": 14,
        "subreddit": "stocks",
        "created": 1625109041.0
    },
    {
        "author": "BAMaverick",
        "body": "Love this play $AMD, and can't wait till the xilinx deal goes through...watch it soar!!!",
        "created_utc": 1624466731,
        "id": "h2sa7yu",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1624495531.0
    },
    {
        "author": "RockEmSockEmRabi",
        "body": "Xilinx merger arbitrage",
        "created_utc": 1625078625,
        "id": "h3lao4i",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1625107425.0
    },
    {
        "author": "filthy-peon",
        "body": "AMD has a lot going for it. First and foremost serious Data center growth, the CPU dominance, the new GPUs finally being high end competition. They are also winning Supercomputing contracts all the time which is just a little cherry on top. Xilinx will help them increase their TAM and aquire good talent.\n\nIntel has been telling lies regarding their 10nm progress for so many years that I think its crazy how people believe them when they talk about 7nm progress. 10nm really arrived now in 2021, I think thats 5 years late. It they screw up only half as much on 7NM while doubling down on their own fabs they might be doomed. \n\nThey may also manage to turn it around. Anyway TSMC has the money to stay at the very least competitive with Intel amd this takes away Intels competitive advantage it enjoyed for so long a thing of the past. Bidens American Billion subsidies can't help intel. The problem of Intel has never been financial. They had enough money to buy back stock like crazy and they still have a shit-ton of money.\n\nAMD has been underlromising and overdelivering. I would expect this to continue. Even though their Guidance is already ambitious.\n\nI LIKE THE STOCK",
        "created_utc": 1623702885,
        "id": "h1rs4x2",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1623731685.0
    },
    {
        "author": "Kind-Relationship559",
        "body": "I’m bullish on AMD. It’s a turtle stock but def. will hit 100 end of the year when the Xilinx deal gets done. 260 shares @76.2",
        "created_utc": 1622645486,
        "id": "h0bibno",
        "score": 11,
        "subreddit": "stocks",
        "created": 1622674286.0
    },
    {
        "author": "JustAnotherFKNSheep",
        "body": "Amd partnering with samsung for mobile chips. They gonna try to expand aggressively and xilinx is the perfect company to do that with",
        "created_utc": 1624517566,
        "id": "h2uyy5p",
        "score": 10,
        "subreddit": "investing",
        "created": 1624546366.0
    },
    {
        "author": "iyioi",
        "body": "AMD MERGER WITH XILINX APPROVED IN EU.\n\nChina you next. Let’s fucking go. Approve this shit.",
        "created_utc": 1625067403,
        "id": "h3kkjx1",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625096203.0
    },
    {
        "author": "DQBIII",
        "body": "Can't stress this enough. AMD $180 EoY. Mark it. XLNX merger 7/7 my best guess. Earnings end of July! gonna be cray cray.",
        "created_utc": 1625077351,
        "id": "h3l7rq0",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1625106151.0
    },
    {
        "author": "Bouvill",
        "body": "That's not surprising, and not really important. What matters on the stock market is how a company is growing. AMD have been and will be for at least 1,5 year a fast growing company. AMD is in NVDA's shadow, but for how long? When the stock market will realize Intel is in deep sh!t for at least 2 years, AMD will rise, especially with the Xilinx merger.",
        "created_utc": 1624896033,
        "id": "h3c002i",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1624924833.0
    },
    {
        "author": "bifburger",
        "body": "I really like AMD. \n\nIt was total BS how WS collapsed the SP after the last earnings...justified by the Xilinx deal and \"arbitrage.\" But, I guess arbitrage doesn't matter anymore...\n\nThen when Lisa announced the share buyback those pricks still knocked this down.\n\nTotal horseshit but it looks like now WS is back to pumping.\n\nTo the fucking moon!",
        "created_utc": 1624586959,
        "id": "h2y76r2",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1624615759.0
    },
    {
        "author": "Ace_McCloud1000",
        "body": "Especially with Xilinx and the Share Buy-back program.",
        "created_utc": 1625058109,
        "id": "h3k0kn9",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625086909.0
    },
    {
        "author": "MrJumblez",
        "body": "AMD should go to 3 digits after the xlnx merger approval from the EU (early July)",
        "created_utc": 1624166120,
        "id": "h2eejpl",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1624194920.0
    },
    {
        "author": "HomerrJFong",
        "body": "Everyone is rattling of chart analysis but it's trading sideways because the merger with xlnx is a pure share acquisition. There was a detailed DD on this sub for it but the fast version is the hedges short the company acquiring, then they buy the company being acquired. \n\nThis causes AMD to go down (or in this cause sideways because of strong support). Once the merger is through a significant source of selling pressure will be lifted.",
        "created_utc": 1624473352,
        "id": "h2sphq4",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1624502152.0
    },
    {
        "author": "papabri",
        "body": "Lots of sentiment out there that the stock should be trading closer to $100 but due to the Xilinx acquisition (due to close before EOY) that the price is being suppressed while some hedge funds make money with something called [arbitrage](https://www.investopedia.com/terms/a/arbitrage.asp).",
        "created_utc": 1622777485,
        "id": "h0iwlok",
        "score": 8,
        "subreddit": "stocks",
        "created": 1622806285.0
    },
    {
        "author": "Infinityaero",
        "body": "My biggest holding but I'm not helping the cause much right now; I've been buying XLNX since it's at a 10+% discount to AMD.",
        "created_utc": 1623187164,
        "id": "h12s22t",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1623215964.0
    },
    {
        "author": "DQBIII",
        "body": "AMD Mars.\n\nEU Approval this morning\n\nUK Approval yesterday\n\nWaiting on China. They likely have already signed off and we just don't know. No freedom of information laws.\n\nBoA PT increase from $110 to $120\n\nStill 85 million shares short.\n\nXLNX deal will close early July and Earnings end of July.\n\n$120 End of July, $180 End of year.",
        "created_utc": 1625056990,
        "id": "h3jylf7",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1625085790.0
    },
    {
        "author": "Ypres",
        "body": "People who are buying xilinx for the arbitrage before the merger.",
        "created_utc": 1622693911,
        "id": "h0egr5i",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1622722711.0
    },
    {
        "author": "nerfyies",
        "body": "The xilinx deal is essentially a good earnings base for amd. If you look at the revenue is 2020 vs 2019 you will see the huge transformation amd has gone through. The question is can amd keep beating earnings estimates. I'm betting that after a few good earnings it will go over 100 and surpass 52 week high either this quarter or 3rd quarter. Note they don't have to be blow out results as they only need to show investors that the downside risk is very low. \n\nIt's a wrap in the server space. One unique feature which is huge in new amd chips is the hyperviser security which essentially is specifically made for virtual containers made for cloud provider like Google cloud. The gaming market, especially the higher end is a kill too, but this is a very small business for amd.",
        "created_utc": 1624351661,
        "id": "h2mrqjn",
        "score": 7,
        "subreddit": "stocks",
        "created": 1624380461.0
    },
    {
        "author": "chrisumafp",
        "body": "They have been consoliding in a range between 73-87.  I believe it’s a good time to accumulate\n\nThey have also announced a $4 billion share repurchase program to increase returns for shareholders.  It’s also a good sign, they have reached a deal with Google.\n\nI think once the merger with XLNX goes through to help meet their ever increasing demand.  I think we should see triple digits on the share price fairly soon\n\nDisclaimer: not financial advice",
        "created_utc": 1624311814,
        "id": "h2l1l7w",
        "score": 7,
        "subreddit": "stocks",
        "created": 1624340614.0
    },
    {
        "author": "zethras",
        "body": "PE ratio is only 35. Lots of reason for it to go up but when there is uncertainty in a stock, people doesnt want to jump in just yet and that uncertainty is the merger.\n\nRemember that AMD stocks will be diluted with Xilinx stocks. So if the merger doesnt happen, AMD will go up a lot and Xilinx share will drop because it went up a lot due to AMD merger news. If the merger does AMD will go up but just a slight amount.\n\nAlso, the stock has gone up a lot since last year. Maybe it needs 1 or 2 more earnings proving that AMD is the future and Intel is something of the past for it to reach $90-100.",
        "created_utc": 1624516112,
        "id": "h2ux8gx",
        "score": 7,
        "subreddit": "stocks",
        "created": 1624544912.0
    },
    {
        "author": "M-3X",
        "body": "Oh boy, you didn't touch FPGAs for soo soo long.\n\nNow the Xilinx FPGA contains ARM cores and they are extremely powerful for low-latency big data stuff. ASICs are getting more and more expensive to develop.",
        "created_utc": 1622827863,
        "id": "h0l9v11",
        "score": 7,
        "subreddit": "stocks",
        "created": 1622856663.0
    },
    {
        "author": "jonmon7891",
        "body": "I would love to see it get to hundred by July 16 but I’m really doubtful. The merger coming up is a catalyst for the stock. When it was announced amd was buyin Xilinx, stock sold off. So let’s hope approval doesn’t bash us to hard",
        "created_utc": 1624894192,
        "id": "h3bvw5x",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1624922992.0
    },
    {
        "author": "Boomtown626",
        "body": "With a 5-year timeline and minimal tolerance for dips more than about 10-15 percent, AMD at its current valuation gives you a very solid upside imo, and it should treat you perfectly well. \n\nThere's a 100% chance that hindsight will reveal plays that could have been more profitable, but using what we know now to make a risk-reward assessment, I think AMD is on a solid path, and the XLNX acquisition finalizing at the end of this year only boosts that projection.",
        "created_utc": 1622771343,
        "id": "h0ik00p",
        "score": 6,
        "subreddit": "stocks",
        "created": 1622800143.0
    },
    {
        "author": "Olthar6",
        "body": "AMD is a potentially decent one. \n\nGeneral consensus is that it's undervalued right now, but it's trading in channel between 79.5 and 82.5. Buy around 80 and then sell 83 weeklies. It's broken below the 78 support line twice in the last few months but it doesn't stay below it for too long. I'd love to say it'll break that pattern soon, but until XLNX merger gets all the approvals it doesn't matter how many positive things happen because the market wants to see the major merger get approved or rejected. That also makes the catalyst for breaking that channel somewhat predictable. \n\nAlso, while WSB loves it, they don't have the power to move it.",
        "created_utc": 1623523406,
        "id": "h1jipsi",
        "score": 6,
        "subreddit": "options",
        "created": 1623552206.0
    },
    {
        "author": "JimCramersCoke",
        "body": "I have held both for years and intend to hold them for a long time. I prefer AMD at the moment due to valuation, pending xilinx merger, and constantly improving tech - it’s a fun company to watch. I think their ARM based chip could generate quite a bit of buzz when they announce more details. AMD is making waves in the server chip business. \n\nNVDA is awesome and has more of a moat and specific strategy. If they somehow acquire ARM, they are on the road to 1000 sp. Their ARM based server chip has me interested.\n\ntldr; I am long both and TSM",
        "created_utc": 1624624765,
        "id": "h2zm60q",
        "score": 6,
        "subreddit": "stocks",
        "created": 1624653565.0
    },
    {
        "author": "Boomtown626",
        "body": "They have published revenue projections which make this year's stagnant share price perfectly predictable. Those same projections, along with the projections of XLNX, tell us that the next 3-5 years make AMD stock a perfectly respectable play. \n\nIn the current chip shortage environment, I personally foresee minimal stock price impact, with the only potential for deviation being toward the side of higher price for higher demand and limited supply, similar to what we've seen with lumber over the last 6-8 months. \n\nBottom line: AMD shareholders need to be in it for another few years, and they/we will be happy. \n\n(DISCLOSURE: I closed my AMD position within the last couple months for reasons specific to my personal strategy and portfolio makeup, but re-entry into AMD is absolutely on the front of my mind between now and the end of the year.)",
        "created_utc": 1622770680,
        "id": "h0iipbr",
        "score": 6,
        "subreddit": "stocks",
        "created": 1622799480.0
    },
    {
        "author": "gnocchicotti",
        "body": "XLNX is a lower growth, established company. That and supply constraints made it painfully obvious that AMD's growth is capped - but only in the short term. It's a great buy to hold for at least 2 years but a shit short term trade I think.",
        "created_utc": 1624370571,
        "id": "h2ni0ui",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1624399371.0
    },
    {
        "author": "bigpalmdaddy",
        "body": "Can confirm. Xilinx tech is legit.",
        "created_utc": 1624591221,
        "id": "h2yf55o",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1624620021.0
    },
    {
        "author": "MrObviouslyRight",
        "body": "Xilinx was announced last year. It will complete this year. AMD was at $99 a couple of months back. But it has been trading sideways, consolidating a new base.\n\nNow, with the recent clients, events, products, technologies, it is expected to breakout once again. The consensus analysts target for year-end is $110, although I expect it to be $130.\n\nThe revenue growth for 2021 was adjusted in April, after the $110 target price was reached.\n\nTo summarize, it will go up with or without Xilinx.",
        "created_utc": 1624309012,
        "id": "h2kvmq9",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1624337812.0
    },
    {
        "author": "littlered1984",
        "body": "I've seen lots of AMD posts the last week or so across all the investing subreddits. AMD's story has not changed in the last 3-6 months. No one is waiting for XLNX approval - it is expected to go through. The resulting merger has already been priced in (33B current XLNX valuation vs 35B purchase price).",
        "created_utc": 1624543688,
        "id": "h2vx71q",
        "score": 5,
        "subreddit": "stocks",
        "created": 1624572488.0
    },
    {
        "author": "TheTendilorian",
        "body": "But AMD and Xilinx are both US based companies, I mean they will definitely battle us over chip shortages but will have no control over the merger…. Unless I’m missing something.",
        "created_utc": 1624583003,
        "id": "h2xzx05",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1624611803.0
    },
    {
        "author": "P33L_R",
        "body": "God damn AMD! So fucking glad I've stuck with it this whole time. This stock going places. Gonna smash earnings on 7/27 too. Xilinx BO approval from China gonna send this thing into space whenever it happens",
        "created_utc": 1625062801,
        "id": "h3k9zkd",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625091601.0
    },
    {
        "author": "MrObviouslyRight",
        "body": "Hey there,\n\nNear term catalysts are:\n\n\\- Fidelity FX Super Resolution to be presented next week (June 22nd). Tons of people are hoping for a strong showing, as the technology can literally make people obtain from 30% to 200% better FPS from GPU products.\n\n\\- Q2 financials reporting to be released on the last week of July (specific date not announced yet). I'm expecting a beat here, as they raised their guidance during the Q1 results... and likely their execution is exceeding their own expectations.\n\n\\- 5700G and 5600G APUs to be released for sale in early August\n\n\\- Q3 results sometime in October 2021. Again, I expect a beat vs. their 50% sales increase guidance. Mostly as new products will begin ramping to deal with the Q4 holiday season (e.g. Valve handheld).\n\n\\- Before the end of the year, the Xilinx deal should be closing.\n\n\\- Sometime in early December, there should be news on the Samsung S22 (High-end Galaxy mobile line-up), which will bring AMD graphics and is expected to clean the floor on the mobile industry. This is VERY important... as if they have a great showing, many more mobile players may license AMD technology.\n\n\\- Mid-December, there should be more clarity on the release of Zen3 stacked Cache technology, which will provide an extra 15% performance average to FPS boost. Consumers are very excited with this technology, as the cache would go up drastically.\n\n\\- Before the X-mas holidays, Valve should be release their portable handheld device. It is expected to have AMD hardware (likely an APU) which should be more powerful than Nintendo's Switch and likely take the crown in the portable gaming arena.\n\n\\- Lastly, Zen4 and RDNA3 are planned for 2022. The leaks so far are just incredible, but there should be more info towards the end of 2021. Some leaks have already indicated that Zen4 will have 128 cores (256 threads). This is just ludicrous!!!... but AMD is used to increasing cores and leaving Intel in the dust. RDNA3 on the other hand is expected to have 2.8x performance vs. the 6900XT... which is a GIGANTIC LEAP in performance that is simply unheard of. Never has a new GPU architecture brought so much performance vs. a prior generation. This is mostly thanks to MCM design (multichip).\n\nKeep in mind that neither of these products will be cheap... they are enthusiast or workstation products, but the push the boundaries of technology quite radically.\n\nHope that provides some color on the upcoming events, product launches and financial reporting. In any case, I plan on writing a new article in a couple of weeks, with updates.",
        "created_utc": 1623703355,
        "id": "h1rt52i",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1623732155.0
    },
    {
        "author": "Boomtown626",
        "body": "Learn as much as you can about both. This could be a very good example of Buffett’s “great company at a fair price is better than a fair company at a great price.”\n\nHowever, I also think that the XLNX acquisition is going to improve AMD significantly, and based on revenue projections and price multiples, the share price stands to have a solid, market-beating upward push over the 2022-2024 time frame. (This is the same math I used to predict its 2021 would leave something to be desired.)",
        "created_utc": 1625008129,
        "id": "h3hwqza",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625036929.0
    },
    {
        "author": "Esteef",
        "body": "Wow. I was bullish on AMD hard but your views are indeed spot on. What about the AMD Xilinx Merger??",
        "created_utc": 1624345262,
        "id": "h2ml209",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1624374062.0
    },
    {
        "author": "squathammer",
        "body": "The point is that with FPGAs alongside CPUs you (or the system really via daemons that monitor performance and repetitive/defined tasks) can reconfigure the programmable gate arrays (actually not logic gates, but RAM-based Look-up Tables or LUTs) to implement logical functions as \"hardware\", accelerating by 2-3 orders of magnitude their execution. You can then have an on-demand co-processor for the specific application that is hogging resources from the CPU, such as graphics processing (GPUs), for example. \n\nIn the absence of ideas what to use the FPGA for, you can instantiate a soft processor core (soft-core, hihi) on-demand ,such as the Xilinx Microblaze (hihi again), to off-load processing from the hard-cores (hihi once again). This means that you don't need to have 8 core CPUs any more with 6 cores idle. Rather, you can have a 2-core processor that scales as needed.",
        "created_utc": 1624596951,
        "id": "h2yo97o",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1624625751.0
    },
    {
        "author": "JonathanL73",
        "body": "If I were to buy Xilinx Call options before the merge would they turn into AMD call options?",
        "created_utc": 1623962958,
        "id": "h24upcd",
        "score": 5,
        "subreddit": "stocks",
        "created": 1623991758.0
    },
    {
        "author": "midocelli",
        "body": "(not financial advice)\n\nAMD has the (provisional)deadline for the EU approval for the Xilinx deal coming up on June 30th (UK july 6th), and I would assume that the recent run up in price is related to the assumption that this approval goes through. \n\nThe biggest hurdle to this acquisition is imo China, but if they allow it I would be amazed to see AMD under 100.  This approval  is expected roughly by the end of the year ish, so if you want to play AMD safely, leaps are the way to go (imo).\n\nPosition(s): shares, 07/16 105c (that I bought in April and are currently worthless, I didn't take into account the shorting of AMD for Xilinx share value post merger like an idiot), and 06/17/2022 110c",
        "created_utc": 1624909503,
        "id": "h3cv125",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1624938303.0
    },
    {
        "author": "uselessadjective",
        "body": "AMD is growing at a 30% rate avg and is acquiring XLNX too ... I don't see any reason",
        "created_utc": 1625081837,
        "id": "h3lhwoo",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625110637.0
    },
    {
        "author": "isellamdcalls",
        "body": "AMD has an imminent merger with xilinx and a 4 billion dollar buyback buy puts if you really want to lose money",
        "created_utc": 1624316241,
        "id": "h2lacei",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1624345041.0
    },
    {
        "author": "WetwulfDTF",
        "body": "Waiting for China to approve AMD and Xilinx merger. \nAdded a pretty big position today.",
        "created_utc": 1624998150,
        "id": "h3havun",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625026950.0
    },
    {
        "author": "VaultBoy3",
        "body": "Buy AMD and XLNX, pretty much the same stock now anyways, but that merger will make them boom.",
        "created_utc": 1624839267,
        "id": "h39n94n",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1624868067.0
    },
    {
        "author": "MastersParadox",
        "body": "AMD 🚀 Xilinx merger is gonna be huge for them!!!",
        "created_utc": 1625000824,
        "id": "h3hh0u0",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625029624.0
    },
    {
        "author": "DQBIII",
        "body": "Forget INDI, AMD broke out above the 200 MA and just got UK approval for the XLNX deal. EU is likely tomorrow which just leaves China. More than likely, China has already approved the XLNX deal and we just don't know it given their lack of freedom of information. I think the deal closes on or prior to 7/7 and ER is 7/26.![gif](emote|free_emotes_pack|money_face)",
        "created_utc": 1624971314,
        "id": "h3fn65z",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625000114.0
    },
    {
        "author": "TheMadBeaker",
        "body": "Between news of this merger being allowed to go through, and Google announcing they are going to use AMD for some new cloud computing offering... Today has been a good day for $AMD going up 5.55% and $XLNX up 4.88%.",
        "created_utc": 1623964713,
        "id": "h24youp",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623993513.0
    },
    {
        "author": "onezerozeroone",
        "body": "If AMD doesn't pay me back for all the money it's stolen with this bullshit Xilinx thing I'm gonna...gonna...I'm...gonna keep buying AMD products and stay mad.",
        "created_utc": 1624407934,
        "id": "h2pp4qd",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1624436734.0
    },
    {
        "author": "wbnext",
        "body": "AMD looks great, it survived when its cpu was not competitive and AMD had less cash. Now with better cpu product and more cash, growing server market shares is a sure thing to happen. With Xilinx, not surprising if it’s price is over 100 in next few months.",
        "created_utc": 1622688090,
        "id": "h0e6ccl",
        "score": 3,
        "subreddit": "stocks",
        "created": 1622716890.0
    },
    {
        "author": "EnginThis",
        "body": "Agree, Xilinx is stop sign for AMD to grow. I’m waiting for AMD chips for AI, they will boost stock price significantly.",
        "created_utc": 1623321661,
        "id": "h19j9u1",
        "score": 3,
        "subreddit": "stocks",
        "created": 1623350461.0
    },
    {
        "author": "iopq",
        "body": "I bought XLNX because I think merger goes through and I make out easy money",
        "created_utc": 1623751681,
        "id": "h1tz8m1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1623780481.0
    },
    {
        "author": "vxibhxv",
        "body": "@jjd1226 can you do DD on Xilinx too?",
        "created_utc": 1623386255,
        "id": "h1d92ds",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1623415055.0
    },
    {
        "author": "TheTendilorian",
        "body": "Thanks! Trying to read about what xilinx does was so far above my head lol",
        "created_utc": 1624585177,
        "id": "h2y3usx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624613977.0
    },
    {
        "author": "OlyBomaye",
        "body": "Any strong feelings on that AMD DD with regard to Xilinx deal closing?  Those 7/16 $90c's were a 3 bagger if bought yesterday.  I bought today for a little over a buck, now up  25%.  Not the goal obviously but a nice start.",
        "created_utc": 1624561661,
        "id": "h2x1kkf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624590461.0
    },
    {
        "author": "BetweenThePosts",
        "body": "There’s arbitrage in the xlnx merger that includes shorting amd. Be informed before you sling out insults",
        "created_utc": 1624374498,
        "id": "h2nqau4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624403298.0
    },
    {
        "author": "Bouvill",
        "body": "Good old AMD play. EU should approve AMD and Xilinx merger this week. +3% incoming again. What would be amazing is to have China approval soon, but let's keep it step by step. It'll go to $105",
        "created_utc": 1625001989,
        "id": "h3hjobg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625030789.0
    },
    {
        "author": "FrankCastle2020",
        "body": "AMD is struggling because its being shorted. It is being shorted because its being hedged against XILINX, its being hedged against XILINX because it is acquiring XILINX. So, until that merger goes through, expect this stock to be a source of frustration. Maybe buy long dated calls instead.",
        "created_utc": 1623261475,
        "id": "h16ik6s",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1623290275.0
    },
    {
        "author": "MrObviouslyRight",
        "body": "I believe in $105 to $110 around August... shortly after Q2 is reported.\n\n$130 once the Xilinx deal is closed, other Tesla's are being reviewed with PS5 power and Q3 is released.",
        "created_utc": 1623597636,
        "id": "h1mo7ns",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1623626436.0
    },
    {
        "author": "snkbrdng",
        "body": "AMD is hugely undervalued. 34 pe vs NVDA 84 pe. \n\nEvery measure of the business is crushing it.\n\nToday google just announced their newest cloud instances uses EPYC and it has performance benefits/$ that beat MSFT+Intel and AWS+ARM\n\nI’ve got $110,000 in AMD LEAPs 65c-85c. \nI think it is possible we see a rise prior to XLNX merger complete in November.",
        "created_utc": 1623939782,
        "id": "h23bukf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1623968582.0
    },
    {
        "author": "ElectricalGene6146",
        "body": "It’s definitely a positive. I would argue that Xilinx has limited growth ahead though…FPGAs are an expensive tech to manufacture compared to ASICs. As it gets easier and easier to build and manufacture ASICs (with the help of a Fab), there’s less of a need for some of their customers to go with FPGAs. I don’t see them going away ever, but I’m just not sure what sort of growth has been modeled in already into their valuation. I’m also not too sure if there is any real synergy with AMD- to me, it mainly seems like another diversified revenue stream.",
        "created_utc": 1624366228,
        "id": "h2n9w7g",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624395028.0
    },
    {
        "author": "Brlala",
        "body": "No, I think you understand it wrongly. The merger is an all-stock merger being done by issuing new shares. It means if the merger goes through, the current available shares for AMD will increase by roughly 24% that’s why the AMD share is being “held down”. It’s a stock dilution and is bad for existing share holders.\n\nImagine a company is worth $10 and there are 10 shares, so each share is worth $1. The company suddenly announce they will issue 10 more shares, so the share that used to worth $1 is now worth $10/20=$0.5.\n\nXilinx shares will be converted to AMD in a 1:1.7 shares ratio. People are already pricing in the value of AMD after the merging. If the merger fails, the value of AMD will/should shoot back up.",
        "created_utc": 1624595542,
        "id": "h2ym3yu",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624624342.0
    },
    {
        "author": "Tay_Tay86",
        "body": "I liked the pricing of AMD options better and $AMD is described as the ones owning most of the xlnx shares moving forward",
        "created_utc": 1624374510,
        "id": "h2nqbqn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624403310.0
    },
    {
        "author": "DQBIII",
        "body": "1. 52 million share buyback plan. \n2. Probably close to 90 million shares short. \n3. XLNX deal due to close in the UK July 6th. Probably be finalized mid July. \n4. ER July 26th. \n5. Down 9% this year. \n6. 82.50 Sept calls bought last week like crazy. \n7. Flagging on the daily. \n8. Volume has been drying up, leading to an easy run. \n9. Semis are the new oil in product demand. \n10. P/E stands at 31 while NVDA stand at 85. \n\nI haven’t even started talking about their growth, overtaking Intel, or even their product line. \n\nIt’s time to boom boom.",
        "created_utc": 1623722489,
        "id": "h1swdsb",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1623751289.0
    },
    {
        "author": "Investinwaffl3s",
        "body": "Arbitrage and dilution from the XLNX acquisition.",
        "created_utc": 1625073073,
        "id": "h3kxkoh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625101873.0
    },
    {
        "author": "Boomtown626",
        "body": "Except news of this broke last October, and AMD shareholders who pay attention have already been planning on XLNX revenue being accountable to AMD by the end of the year. \n\nIn the SEC form filed by both companies, they both submitted revenue projections for both companies over the next several years. According to the people most invested in this merger, AMD's revenue called for a stagnant 2021, followed by multiple yeas of significant growth. \n\nToday's news just reminded the markets at large that AMD's not done. But this regulatory hurdle changes nothing for anyone who did half-assed DD 8 months ago.",
        "created_utc": 1625012547,
        "id": "h3i5l82",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625041347.0
    },
    {
        "author": "MrObviouslyRight",
        "body": "My name alone?... just look at the rest of the names....\n\nSamsung Galaxy, Tesla/Elon, Valve, Sony, Microsoft Xbox, Xilinx....\n\nWe're talking billions... start packing those bananas!... we're leaving the galaxy... \n\n...And we ain't comin' back! :D",
        "created_utc": 1623598505,
        "id": "h1mpw7b",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1623627305.0
    },
    {
        "author": "ErikBart23",
        "body": "The basic gist is that AMD bought Xilinx for 35 B in an all stock deal. This means a sort of dilution for AMD when it occurs, The deal as it stand would mean that for every share of Xilinx the holder will get 1.7 shares of AMD when it it done. If AMD keeps going up it would mean that AMD is no longer paying an effective 35 B, and they will be paying more. Thus the Arbitrage would be to short AMD to lower the price so AMD gets cheaper deal but also buy Xilinx so you will get more AMD for less. The sus part about this was that if you look at the volume, the amount of sales in AMD does not equal the Xilinx purchasing. So it's a lot of AMD shorting by big funds. If Lisa comes out July 27th earnings and says that the merger is done because EU said it's good on June 30th and UK said it's good on July 6th, AND she says it's retroactive to July 15th it means that the shorts will be caught with their pants down because the merger price and share count is now one, so big funds will push in because its a 30 PE ratio as Nvidia is 80, and growing at 50% even after a covid year. It's a secular growth story and only growing with Tesla (EV infotainment) and Data center growth. Shorts need to cover as fast as possible or get wrecked. People who are holding will just raise their sell limits higher and it's recipe for a 15% moon to at least touch 100$ at all time highs. Then we can start an Nvidia climb of our own!",
        "created_utc": 1624755794,
        "id": "h35xx18",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624784594.0
    },
    {
        "author": "oldprecision",
        "body": "Is this really waiting for $xlnx to close before moving up?  It’s been stuck here since august.",
        "created_utc": 1624308423,
        "id": "h2kuc7w",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624337223.0
    },
    {
        "author": "snrthomas",
        "body": "I would suspect the news of it would help. There was also news of the Xilinx merger last week maybe getting approved by the EU. It seems that tech is strong overall and it baffles me that AMD isn’t breaking out. I chart it every day several times thinking it gonna pop… then it doesn’t.",
        "created_utc": 1624570393,
        "id": "h2xjur6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624599193.0
    },
    {
        "author": "beauchh",
        "body": "Super bullish... Xilinx is the de-facto targeted environment of licensed IP (like catalogs of code) which is what 95% of FPGA dev uses. Unless it’s generic IP but even then",
        "created_utc": 1624596556,
        "id": "h2ynnst",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624625356.0
    },
    {
        "author": "WeReallyOutHere420",
        "body": "Xilinx.  The hedges are shorting AMD and long xilinx prior to merger as an arbitrage play.  After merger AMD will have a higher market cap than Xilinx and AMD combined most likely based on past history. Of similar well perceived aquisitions.  AMD 120+ next year very possible.\n\nNot financials advise",
        "created_utc": 1622943136,
        "id": "h0qzk8k",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622971936.0
    },
    {
        "author": "Incendras",
        "body": "XLNX close, and earnings beat Q2 combo will push.",
        "created_utc": 1623703170,
        "id": "h1rsqx9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623731970.0
    },
    {
        "author": "snkbrdng",
        "body": "It’s gonna rip through $100 closer to Xilinx acquisition in November. It has easy potential to be $200 in next 6 month (currently NVDA pe 84 vs AMD pe 33)",
        "created_utc": 1623855540,
        "id": "h1z3msp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623884340.0
    },
    {
        "author": "Brlala",
        "body": "Isn't the price of AMD being held down due to the merger? If the merger falls through(fail) we should expect AMD price to shoot up short term. However, if the merger is successful, then AMD could be a long term play(stocks will go up assuming the acquisition of Xilinx is strategic).",
        "created_utc": 1624592101,
        "id": "h2ygsaa",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624620901.0
    },
    {
        "author": "Electronic_Thanks885",
        "body": "Sitting on a 3/2022 $90c. Once the XLNX merger goes through AMD is gonna rocket. Basically every analyst has a price target of $110 or higher for AMD. Merger is the only thing holding it back.",
        "created_utc": 1624320323,
        "id": "h2li0nu",
        "score": 2,
        "subreddit": "stocks",
        "created": 1624349123.0
    },
    {
        "author": "LawrenceOfMeadonia",
        "body": "I wonder if XLNX has more potential to grow with the merger announcement if it comes. It seems more volatile",
        "created_utc": 1624306769,
        "id": "h2kqoyh",
        "score": 2,
        "subreddit": "stocks",
        "created": 1624335569.0
    },
    {
        "author": "starfirer",
        "body": "So you're saying Xlnx merger is catalyst for next leg up on AMD? I'm not quite following your rationale. How does the merger positively affect AMD?",
        "created_utc": 1624413648,
        "id": "h2q02iw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624442448.0
    },
    {
        "author": "Bouvill",
        "body": "EU+UK should approve merger with Xilinx within two weeks + good results expected in end of months earnings. Also Samsung should present its new mobile GPU based on mRDNA2",
        "created_utc": 1624803962,
        "id": "h37q7wz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624832762.0
    },
    {
        "author": "Amusablesiren",
        "body": "Amd is a very strong company IMO. \n\nWith their purchase of Xilinx earlier this year I think the long term bull thesis looks strong",
        "created_utc": 1624824053,
        "id": "h38uasj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624852853.0
    },
    {
        "author": "LiquidSquids",
        "body": "https://www.gov.uk/cma-cases/advanced-micro-devices-inc-slash-xilinx-inc-merger-inquiry#history",
        "created_utc": 1624971203,
        "id": "h3fmzej",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625000003.0
    },
    {
        "author": "dudevinnie",
        "body": "2 weeks? Doubt it, post xilinx merge yeah. Ive been holding 10k+ in 100c for ~6 months",
        "created_utc": 1625065324,
        "id": "h3kfpl1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625094124.0
    },
    {
        "author": "MrObviouslyRight",
        "body": "Look, it is scratching $90 right now. If it crosses $94... it will overshoot to $106.\n\nThe reasons are simple:\n\n1- analysts are bullish on the stock.\n\n2- Xilinx acquisition is being greenlit by all regulators (US, UK, etc.).\n\n3- It reports earnings in less than 30 days (end of July). They will beat, almost certainly.\n\n4- We enter 2nd half of 2021 with the Delta variant. Home Entertainment will be huge.\n\nSo yes, I expect a stock price of 3 digits soon.",
        "created_utc": 1625011756,
        "id": "h3i40p9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625040556.0
    },
    {
        "author": "McSupergeil",
        "body": "Both... both is good\n\nWith nvidia getting arm  ( still waiting for approval)\n\nAnd amd  xilinx ( just got approved )\n\n\nBoth have vers bright futures imo and i own both..\n\nIts almost a duopoly  just like with airbus and boeing which i also own.\n\nMaybe intel can be a play here to for the future groth of gpu accelerated products and  new wafer production centers",
        "created_utc": 1625070560,
        "id": "h3ks4em",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625099360.0
    },
    {
        "author": "SaltyKrew",
        "body": "What's your rationale for AMD doubling in share price when they acquire XLNX? That I don't get.\n\nAlso, it hasn't started? From Feb to now, it had increased nearly 30%. There is bound to be some profit taking before Xilinix deal goes through. I can see 100-110 but then mini-correction.",
        "created_utc": 1625069635,
        "id": "h3kpwcg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625098435.0
    },
    {
        "author": "RadiologisttPepper",
        "body": "If we can break the $100 line and maintain support I think the stock can hit $120. Everything I’ve read tells me this stock has been undervalued for a while. There’s also the Xilinx deal to consider if/when it goes through. Between $100-120 is where I see AMD living hopefully by EOY.\n\nI don’t have any financials to back this up and am just a stupid ape.",
        "created_utc": 1625074721,
        "id": "h3l1inh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625103521.0
    },
    {
        "author": "SaysTheGamerWord",
        "body": "I guess my comment was more directed towards the general sentiment I’m seeing in this thread and others where people say “AMD has more room to grow” because they both make GPUs and that’s all there is to it.\n\nAMD is already a &gt;$100B market cap company and I don’t see what their strategy is to grow significantly beyond that in the long run, never mind Nvidia’s (admittedly expensive) level today. For instance, they recently acquired Xilinx, an FPGA company. Do FPGAs make a lot of money? Are FPGAs deployed in data centers and used in AI training/inference today? No. Could that change? Maybe, but the last decade of Intel’s Altera acquisition and the lack of FPGA solutions in the ML space shows otherwise. Never mind the programming nightmare that they are.\n\nHaving said all that, I think in the short term AMD could still grow from the momentum of their CPU and gaming business, but they need to demonstrate some alternative markets/revenue streams to justify any real comparison to Nvidia. I do hold some AMD for this reason and would recommend some AMD exposure for this reason, but Nvidia is still my dream FAA**N**G company.",
        "created_utc": 1625097372,
        "id": "h3mffwi",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625126172.0
    },
    {
        "author": "Red_Sea_Pedestrian",
        "body": "Gotta wait till the Xilinx deal is approved by government",
        "created_utc": 1624025712,
        "id": "h27n54o",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624054512.0
    },
    {
        "author": "West_Valuable_7146",
        "body": "Amd will grow just need patience once the deal with Xilinx is done we will see 100+ in the matter of time 😉",
        "created_utc": 1623030944,
        "id": "h0v27so",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623059744.0
    },
    {
        "author": "holdsap",
        "body": "Imo AMD will start going up once again after the XLNX merger is closed.. you have time to accumulate",
        "created_utc": 1623414221,
        "id": "h1e8hm6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623443021.0
    },
    {
        "author": "snkbrdng",
        "body": "Yeah I think the Xilinx acquisition is ok it will add $3.3B in annual revenue at attractive gross margin (x 70% vs amd 45%) &amp; give AMD access to aerospace, defense and telecom markets.",
        "created_utc": 1623757430,
        "id": "h1u67bj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623786230.0
    },
    {
        "author": "MrObviouslyRight",
        "body": "Mr. EffUtube,\n\nIntel can barely compete with AMD on the CPU front. They are getting trashed in the DataCenter. Just read about Epyc servers and see how they absolutely STOMP Xeons.\n\nIn the latest Intel report, they admitted that they aren't growing in Datacenter... while AMD grew double digits. That's because they are eating Intel's lunch.\n\nOn the consumer front, just look at the Amazon sales stats: [https://www.amazon.com/Best-Sellers-Computers-Accessories-Computer-CPU-Processors/zgbs/pc/229189](https://www.amazon.com/Best-Sellers-Computers-Accessories-Computer-CPU-Processors/zgbs/pc/229189)\n\nNvidia is buying ARM cause they want to get into the CPU world.\n\nNvidia and AMD compete in the EV space (as AMD won Tesla, after Nvidia lost them).\n\nOn the GPU front and parallel accelerators, it is AMD vs NVIDIA.\n\nNvidia overtook Intel in Market Cap this year... they are the dog to beat.\n\nAMD took over consoles (overtaking Nvidia) and now they took EV, while aiming to acquire Xilinx and solidify their position.\n\nSo yeah, do your diligence. AMD and NVIDIA compete on parallel processing (GPU &amp; Graphics). This means Ampere and Turing (from Nvidia) compete against Big Navi (AMD). Try to find a RTX 3080 or a 6800XT at MSRP.... GOOD LUCK with that!\n\nThey also compete in software, e.g. Fidelity FX Super Resolution (AMD) vs. Deep Learning Super Sampling (DLSS from Nvidia).\n\nThey both have outsourced production (Fabless) and they both compete to manufacture through TSMC.\n\nThe truth is, Nvidia and AMD are the real fight. Intel is trying to get back in the fight.",
        "created_utc": 1623596663,
        "id": "h1mmdk2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623625463.0
    },
    {
        "author": "Budfox89",
        "body": "I approve I’m sitting on 1000 shares . Just look how far up NVDA went in such short amount of time. AMD is next in line especially after that Xilinx acquisition and taking market share from Intel. AMD isn’t so little anymore.",
        "created_utc": 1623372558,
        "id": "h1ck4ep",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623401358.0
    }
]