[
    {
        "author": "alexg554",
        "body": "Which HP stock would be worth investing in. Seems like HPQ is the HP printers and hardware we know, but HPE is more cloud servicing? I’d assume HPQ is better value but just curious on if you think HPE is worth a deeper look?",
        "created_utc": 1638374084,
        "id": "hmt3qnm",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638402884.0
    },
    {
        "author": "hshamza",
        "body": "I lost my worn out leather wallet at a ARK conference, so I walked up to Cathie and asked her to please leave the room.\n\nShe said, \"that makes sense, less people should make it easier to find\".\n\nI replied, \"it's more because every time I catch a glimpse of your skin I think I found it\".",
        "created_utc": 1638347157,
        "id": "hmrw4sx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375957.0
    },
    {
        "author": "TheTechnicalTrader",
        "body": "It could also be done by going to the casino and putting everything on black. You’re forgetting the part where he would have to risk all of his money to make these kind of returns, most likely ending up losing everything.",
        "created_utc": 1638348653,
        "id": "hmrxx6o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638377453.0
    },
    {
        "author": "Interfecto",
        "body": "Nope, I was listening to a podcast and the host mentioned the doc, so I watched it and now I’m sad 🏎☹️",
        "created_utc": 1638348666,
        "id": "hmrxxt3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377466.0
    },
    {
        "author": "NatureTripsMe",
        "body": "I don’t know what you’re trying to say. It was more a covid thing since demand shrank 3%. Of course production had to shrink if you want to make money as a producer. And it did by 5%.  I look at data from EIA to determine production and then subtract consumption. This is really some standard stuff here. Not sure why you’re being weird about it. I found a Forbes piece from a chemical engineer whom has worked in the oil industry who describes a similar approach but is way better at describing the nuances:\nhttps://www.google.com/amp/s/www.forbes.com/sites/rrapier/2021/11/14/is-the-us-energy-independent/amp/",
        "created_utc": 1638346851,
        "id": "hmrvr62",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638375651.0
    },
    {
        "author": "ChiseledTwinkie",
        "body": "$PRTY is failing me. I bought the dip, it dipped more. Bought the dip. Dipped more. Bought some more dip today, let's hope it recovers. Omicrons a nothingburger",
        "created_utc": 1638348372,
        "id": "hmrxkvx",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1638377172.0
    },
    {
        "author": "No-Version-2123",
        "body": "Morning swaps it was a painful day to say the least",
        "created_utc": 1638348275,
        "id": "hmrxgsq",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1638377075.0
    },
    {
        "author": "McRich1",
        "body": "Last year, many WSB members were holding PLTR Dec calls.  All of them lost their money.  This year on Dec 2021. It would be #Wish.",
        "created_utc": 1638349140,
        "id": "hmryhu2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377940.0
    },
    {
        "author": "Frank_Boobtitsky",
        "body": "It shrinks?",
        "created_utc": 1638349199,
        "id": "hmrykb6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377999.0
    },
    {
        "author": "No-Negotiation-3128",
        "body": "Yes why not ;)\nLook:\n\n Evofem Biosciences, Inc. EVFM announced that it has entered into a definitive agreement with Keystone Capital Partners (\"Keystone Capital\") providing for the issuance and sale of an aggregate of 10,000 shares of Series B Convertible Stock in a registered direct offering for a purchase price of $1,000.00 per share.\n\nhttps://www.google.com/amp/s/finance.yahoo.com/amphtml/news/evofem-biosciences-announces-10-million-103100774.html",
        "created_utc": 1638349622,
        "id": "hmrz23z",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1638378422.0
    },
    {
        "author": "Upper-Equivalent3651",
        "body": "thanks.\n\nHope they are not there as crazy as here when it comes to debts",
        "created_utc": 1638345675,
        "id": "hmru9oo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374475.0
    },
    {
        "author": "ThatsHonestlyWildBro",
        "body": "TQQQ gonna absolutely moon in the morning ....back to where it was 1 week ago",
        "created_utc": 1638346102,
        "id": "hmrutcp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374902.0
    },
    {
        "author": "OogdayAyday",
        "body": "I've always wanted to try this, so today is the day I do it.\n\n\"FIRST\"",
        "created_utc": 1638346105,
        "id": "hmruti8",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638374905.0
    },
    {
        "author": "rolfie13",
        "body": "If you need to ask us, you're not ready. That being said, if you do decide to make this trade you're absolutely going to need to do two things beforehand. \n\n-Set a stop loss. Options are very volatile. What happens if you wake up one day and this call is down 30%? You won't know how you'll feel until it happens, and you won't be in the right frame of mind to make decisions after it has. This could very easily turn into a trade where you lose 100%. Pick a point, say 50% or whatever you're comfortable with so you can live to die another day.\n\n-Determine where you're going to take profits. This can go the other way too. You wake up to check on your option and it's up 100% just a couple weeks after opening the position. You're once again in a position where you aren't able to make unbiased decisions, and it can just as well go to zero still. These ones are the most demoralizing.\n\nWrite both your stop loss and take-profit point down on a physical piece of paper. It's more effective when it's staring you in the face. Good luck.",
        "created_utc": 1638345880,
        "id": "hmruj5x",
        "score": 1,
        "subreddit": "options",
        "created": 1638374680.0
    },
    {
        "author": "sgalligan17",
        "body": "It just has to do slightly worse than last month 🤷‍♂️",
        "created_utc": 1638346437,
        "id": "hmrv8iq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375237.0
    },
    {
        "author": "bitt3n",
        "body": "what's the advantage of buying it back before the end of the year?",
        "created_utc": 1638348558,
        "id": "hmrxt0j",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1638377358.0
    },
    {
        "author": "Electrical_Raisin_93",
        "body": "I was trading spy daily as well, it's hard and full of traps, nothing to rely on it, change your strategy",
        "created_utc": 1638348559,
        "id": "hmrxt17",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377359.0
    },
    {
        "author": "Rothiragay",
        "body": "BABA is surely going to be targeted by tax loss harvesting. Almost everyone who bought this year is holding it at a loss.",
        "created_utc": 1638349527,
        "id": "hmryy91",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638378327.0
    },
    {
        "author": "badasschap",
        "body": "It means GOLDMAN SACHS - MARKET HAS NOW PRICED IN A MAMMOTH C.7 MB/D NEGATIVE DEMAND HIT OVER THE NEXT THREE MONTHS, WITH NO OFFSETTING OPEC+ RESPONSE",
        "created_utc": 1638346283,
        "id": "hmrv1l7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375083.0
    },
    {
        "author": "Hot-Context8284",
        "body": "Just buy low, sell high. Don’t make it complicated",
        "created_utc": 1638346799,
        "id": "hmrvorf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638375599.0
    },
    {
        "author": "PeekingPotato",
        "body": "that sucks mate, but I´m sure it will go up again",
        "created_utc": 1638347746,
        "id": "hmrwtts",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638376546.0
    },
    {
        "author": "Upper-Equivalent3651",
        "body": "Well, the QE fucked a lot of things up, wouldnt you say?\n\nJust taking a look at treasuries and you cry. There was a time when you got interests for the risk you are taking the loaner goes bust. Now it seems all rules are out of the window.\n\nOne look at treasuries of Greece and my eyes go blank.\n\nNot even talking about sanctions. Fucked a lot of things up too. Or when people just do their own sanction thing (yes, clearstream, euroclear and whatever you call yourselves, I am talking to YOU!)\n\nAh well. You win one, you lose one.",
        "created_utc": 1638347943,
        "id": "hmrx2bm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376743.0
    },
    {
        "author": "Ozzy4253",
        "body": "Quantum computing stonk. Decades-long play.\n\nHigh risk high reward. But I'd it pulls off what it intends, it will impact virtually every city. Our science fiction stories of the future would be impossible without a QC at million qubits.",
        "created_utc": 1638345601,
        "id": "hmru65t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374401.0
    },
    {
        "author": "FoodCooker62",
        "body": "Do not listen to them. Nvidia at the current valuation is one of the biggest bubbles in the market. It should be $150 max and even then it's overvalued.",
        "created_utc": 1638345622,
        "id": "hmru77h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638374422.0
    },
    {
        "author": "MrMeeseeks987",
        "body": "Disney dropping to $100? It was around $100 when covid happened. I can’t see it going that low",
        "created_utc": 1638347840,
        "id": "hmrwxy0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638376640.0
    },
    {
        "author": "DenuvoSuks",
        "body": "He's timing was definitely not the best. We knew a long time this was coming, but announcing it when the covid was starting to make people nervous makes no sense. It could make it crash so hard he had to postpone it.",
        "created_utc": 1638348175,
        "id": "hmrxcf5",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638376975.0
    },
    {
        "author": "yaboiRich",
        "body": "as if sensing my presence it let out a big bellow. I said eeeeasy there big fella!",
        "created_utc": 1638348183,
        "id": "hmrxcsr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376983.0
    },
    {
        "author": "xcheezeplz",
        "body": "That's what oil does, it's not algos, the price is literally influenced by a cartel deciding what it should be. Now mix in market uncertainties and what else would you expect? \n\nUsually it only takes 2 times getting fucked trading oil before people swear it off.",
        "created_utc": 1638348207,
        "id": "hmrxdt7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377007.0
    },
    {
        "author": "DontWantUrSoch",
        "body": "Haha I love that..\n\nI understand this product seems exclusive/vanity for the very top 1% or perhaps it comes off as a reality to people in a distant future like 2050..however, just to explain, if they can take me from lower Brooklyn to any NYC airport in under an hour for 200usd or less I think that would make it worth it for so many people around the world, not just your average decently well of New Yorker. An Uber/cab would be around that price and it would slower… the train could be an option for some but it can be crowded, unreliable, and 100% disgusting.\n\nI say all these EvToad companies are overpriced, and many will not exist in the future but I do want the tech to enter our cityscape and soon.",
        "created_utc": 1638348219,
        "id": "hmrxebq",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638377019.0
    },
    {
        "author": "Phantom_Journey",
        "body": "Yeah, I sold a ton of VIX calls Wednesday at 20. I bough puts at 24 and 28. Didn’t cashed out when 5K up. I closed it flat. Now I’m back in for a month this time, waiting for some change. It’s.. fucking annoying.",
        "created_utc": 1638348966,
        "id": "hmryanq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377766.0
    },
    {
        "author": "InsertCatchyUserHere",
        "body": "I appreciate your thoughts in this section in particular:\n\n&amp;#x200B;\n\n&gt;What if my focus is entirely on rolling the short leg for credit? A completely different and legit way to think of a PMCC is that the long is something I expect to recoup for 0 net gain, it's just there to anchor the short legs...\n\n&amp;#x200B;\n\nI've recently been diving into PMCCs and have taken this outlook. I'm not particularly buying a LEAPS expecting it to be profitable when expiry comes around, I'm buying it for the privilege of selling CCs against it and extracting my profit from it one contract at a time. Any value still remaining near/at expiry is just an added bonus.",
        "created_utc": 1638348979,
        "id": "hmryb6h",
        "score": 1,
        "subreddit": "options",
        "created": 1638377779.0
    },
    {
        "author": "Fun-Marionberry-2540",
        "body": "Haha, alright. Fair enough.\n\nI guess I said what I said because I wanted to convey that I'm offsetting the interest payment with a short call. And if somehow that was novel or not, but I understand that you're saying the interest payment is for some other asset not the option, but in my mind it works differently because of the action path I've taken.\n\nSo Ok, \"Leveraged PMCC with Interested on Loan for other securities covered Strategy!\"",
        "created_utc": 1638345872,
        "id": "hmruisg",
        "score": 1,
        "subreddit": "options",
        "created": 1638374672.0
    },
    {
        "author": "AlwaysBlamesCanada",
        "body": "If it flies, floats, or fucks rent it, don’t buy it.",
        "created_utc": 1638346353,
        "id": "hmrv4og",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375153.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because it was either DD or Discussion and not a text post.",
        "created_utc": 1638350070,
        "id": "hmrzkmn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638378870.0
    },
    {
        "author": "werewere223",
        "body": "Jesus what I don't understand is why it has over a 40% short ratio",
        "created_utc": 1638350009,
        "id": "hmrzi68",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638378809.0
    },
    {
        "author": "Gadshill",
        "body": "It would be pretty funny if that was the catalyst for the next bull trap.   Falling for the same trick for the same reason two days in a row.",
        "created_utc": 1638352424,
        "id": "hms29ew",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638381224.0
    },
    {
        "author": "thethrifter",
        "body": "Wash sales are a bitch. Better to daytrade in an IRA or HSA.\n\nIts easy to get your earnings wiped out by taxes if you overtrade and dont account for wash sales rules. It makes it so your wins get taxed but losses cannot be deducted.\n\nIt is possible with wash sales to LOSE money in your taxable account AND owe taxes at the end of the year.\n\nGood luck",
        "created_utc": 1638350880,
        "id": "hms0huq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379680.0
    },
    {
        "author": "mrtmra",
        "body": "OP probably goes plenty green, he just gets greedy and sells too late and when it is red, he panics and sells too early",
        "created_utc": 1638351719,
        "id": "hms1g66",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638380519.0
    },
    {
        "author": "rioferd888",
        "body": "Motherfucker had a 50/50 chance on each option and got it right 3 times.",
        "created_utc": 1638353393,
        "id": "hms3dfw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638382193.0
    },
    {
        "author": "Namejamie",
        "body": "Thank god we recovered with futures. I swear this thread is so ducking special when the gbears come out with their trash takes and people upvote it and buy into the fear. Legit has happened 20 times already this year. Don’t know why we have to keep doing it. Proves to me humans are infinitely stupid",
        "created_utc": 1638354152,
        "id": "hms48t9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638382952.0
    },
    {
        "author": "Super_NiceGuy",
        "body": "Well it does look like a bubble but it is impossible to say if it is and if that is the case then when it will pop. There are just so much going on right now that it can be pumped for many different reasons, some legitim and some retardness. I think it is way over priced but on the other hand my knowledge fits in a pinch.",
        "created_utc": 1638352321,
        "id": "hms256p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638381121.0
    },
    {
        "author": "Miyazasteinn",
        "body": "BB is juicy rn, just stacking it",
        "created_utc": 1638354025,
        "id": "hms43fx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638382825.0
    },
    {
        "author": "AutoModerator",
        "body": "Your submission was removed because it is a short post. Any self-post below 400 characters in the body will be removed.  Please refer to rule 6 and make sure your post meets our standards of effort. Automod evasion will be met with a lengthy ban. Do not post just an article; highlight the parts of the article you find relevant or offer some commentary surrounding the article. Self-posts that offer some simple thoughts or questions like \"what do you think\", \"here's my thoughts\", etc. belong as comments to existing posts or the [Daily Advice Thread](https://www.reddit.com/r/investing/about/sticky?num=2).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
        "created_utc": 1638354044,
        "id": "hms448e",
        "score": 1,
        "subreddit": "investing",
        "created": 1638382844.0
    },
    {
        "author": "7991sushi",
        "body": "So when is it a good price to buy robinhood",
        "created_utc": 1638354828,
        "id": "hms51rs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383628.0
    },
    {
        "author": "Stupidnames04",
        "body": "I bought gas the other day.  It was at 1.45 a litre.  Right after I bought gas it went from 1.45 to 1.35 in a few hours, no matter what I fucking buy the price drops right after.",
        "created_utc": 1638354861,
        "id": "hms539j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383661.0
    },
    {
        "author": "Kanye_IsMy_President",
        "body": "Daily dose of Bloomberg FUD. “According to sources familiar with the matter” articles never have any substance. They don’t have news so they are literally making it up as they go",
        "created_utc": 1638352302,
        "id": "hms24dr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638381102.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because was too short. Please make it a comment if it's not worth expounding on.",
        "created_utc": 1638353084,
        "id": "hms30ir",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638381884.0
    },
    {
        "author": "immibis",
        "body": "The thing about leverage is it goes both ways. I hope they have limited liability.",
        "created_utc": 1638353116,
        "id": "hms31vr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638381916.0
    },
    {
        "author": "TruncateReed",
        "body": "waiting for a dip is like waiting until your school sweetheart is getting a divorce to get it after all. if you had the balls back then, you wouldn't have to wait now. never look back, never regret missed opportunities: because while you regret them, you are already missing new ones.",
        "created_utc": 1638353909,
        "id": "hms3ym0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638382709.0
    },
    {
        "author": "AutoModerator",
        "body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
        "created_utc": 1638352148,
        "id": "hms1xva",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638380948.0
    },
    {
        "author": "Brief-Garbage",
        "body": "I think they are in a bubble, but can see an actual use case for them in e.g. licencing or gaming.\n\nRight now though, there are a whole bunch of gaming tokens being released for games that haven't been released yet and have 0 users. This is peak bubble, speculating that this game is going to actually have users, and that the users will want items in it badly enough to pay $10k for in game items. \n\nThey also need to deal with existing games made by all the best developers, and that are free to play. Why on earth would a game that requires everyone to buy $1000 items take off if 99.9% would rather play Fortnite or COD for free? These NFTs are in for 99.9999% drops to come close to regular games if they want mass market appeal.",
        "created_utc": 1638352173,
        "id": "hms1yv7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638380973.0
    },
    {
        "author": "deevee12",
        "body": "Anti-Covid pills will be the real way we get back to normal.\n\nIf people don't want to get vaccines and vaccines aren't enough to stop the spread, then make it so sick people don't go to the hospital and die.\n\nPeople inherently trust a pill more than an injection so it'll probably sell even better than the vaccines.",
        "created_utc": 1638353017,
        "id": "hms2xq8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638381817.0
    },
    {
        "author": "icbmdash",
        "body": "Hell yeah! I’ve got 700 shares @ $32ish cost basis. I’m loving the free $ from covered calls. I also do cash secured puts when it dips hard too.",
        "created_utc": 1638353889,
        "id": "hms3xsy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638382689.0
    },
    {
        "author": "sinncab6",
        "body": "Lol created in January but right you have other accounts but you must just use this one for WSB?\n\nEither way dont try bullshitting everyone like you are some elite old school wall street bets guy when you like 90% of the people on here now myself included found out about this sub then.  The difference is I used GME for what it was worth a quick pump and dump, and not a social cause that the shittiest ran company on the planet towards customers and employees alike was going to cause the great proletariat uprising and usher in a utopian society like you Jim Jones following kool aid kids believe.",
        "created_utc": 1638351183,
        "id": "hms0u9p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379983.0
    },
    {
        "author": "vizk0sity",
        "body": "Does AMD have cuda ? Sorry to say, but NVDA is almost synonymous to deep learning these days. Hell they even spent 500k to train a BERT model for weeks on AWS. Their tools are well integrated for deep learning and AI. AMD will not be able to make it. It is Nvda’s game to lose - just like it was Intel’s game to lose",
        "created_utc": 1638351100,
        "id": "hms0qsx",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638379900.0
    },
    {
        "author": "Some_Bus",
        "body": "I agree with the second statement. But if you want winter handling, you don't need [N] wheel drive, you need winter tires. My family survived using a 1998 Corolla in Canadian winters using a winter set of tires and driving not stupidly when it snowed",
        "created_utc": 1638352913,
        "id": "hms2tgd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638381713.0
    },
    {
        "author": "Skadooooodle",
        "body": "Rotation from riskier to safier stocks. It seems the safiest stock in the market at the moment is Apple.",
        "created_utc": 1638353807,
        "id": "hms3ufw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638382607.0
    },
    {
        "author": "hshamza",
        "body": "If retail starts pumping into Apple and institutions are already permanently holding it.. \n\nMarket is still flooded with cash. Crypto has a market cap close to Apple which is a joke since an Apple crypto would dominate just by being on every iPhone.",
        "created_utc": 1638351254,
        "id": "hms0x5b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638380054.0
    },
    {
        "author": "Freestyle7674754398",
        "body": "Come to the conclusion that the only way to play options is to literally just play the most liquid / biggest names. \n\nSolely trading SPY / QQQ / AAPL / NVDA / SHOP / AMZN / IWM has worked out so much better for me than playing anything else. You're able to be so much more consistent. \n\nAlso as someone with less than 25k in an account, I've started only ever buying plays that I think are high risk at the end of the day. That way it takes emotion out of it with regards to day trades. \n\nthanks for reading my blog.",
        "created_utc": 1638351268,
        "id": "hms0xpt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638380068.0
    },
    {
        "author": "Xer_",
        "body": "Probably stare blankly to my port especially if it goes down, up or sideways",
        "created_utc": 1638352013,
        "id": "hms1sar",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638380813.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. You submitted a Gain/Loss/YOLO that didn't look like it included **large** positions. Please read the rules. This check will fire if you included unnecessary pictures that don't show positions. Repost with the useless pictures omitted if you did that.",
        "created_utc": 1638354402,
        "id": "hms4jgh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383202.0
    },
    {
        "author": "OpposableThumbMagic",
        "body": "SOFI git it git it",
        "created_utc": 1638350565,
        "id": "hms052n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379365.0
    },
    {
        "author": "Sandwich8080",
        "body": "It's anecdotal, sure, but my late 20s-mid 30s peers with kids and without are all about Marvel and Star Wars. \"Baby Yoda\" alone is a huge merchandise seller with a wide demographic. While people say that Disney's gradual conglomeration of IPs is a bad thing, theoretically the more they buy the more they can provide. I agree they need to work on some originals that aren't in the same old wheelhouse but for the customers looking for classics, Netflix is losing options while Disney+ is slowly but surely gaining them.\n\nI remember talks at a time of having a separate Disney streaming service that is more adult oriented, and I'm not sure if it's the best move to split services but it definitely shows that the people at the top recognize they need to appeal to new audiences. I suppose time will tell if those plans come to fruition.",
        "created_utc": 1638351818,
        "id": "hms1k9y",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638380618.0
    },
    {
        "author": "CamSlam2902",
        "body": "No the growth stocks in this market are based revenue projections and what their potential to grow into is. This constant complaining about the market is just draining. In the last round of earnings it’s been shown for the growth stocks that if there’s a miss on revenue or concerns about meeting growth in revenue there is sharp drops in stock price to reflect. Nvda and amd are no different to this a miss in revenue would tank the stock. If you want to value invest and your valuation tells you that intel is under priced you go for it. But intel isn’t for me could even hit targets last earnings while demand for semiconductors is high while just about every other companies makes fat bags. Any how su bae guiding us what’s the worst that can happen will have bigger problems if the market collapses.",
        "created_utc": 1638354454,
        "id": "hms4lom",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638383254.0
    },
    {
        "author": "borgLMAO01",
        "body": "Baba, I short it, makes good money",
        "created_utc": 1638353195,
        "id": "hms356m",
        "score": 1,
        "subreddit": "options",
        "created": 1638381995.0
    },
    {
        "author": "Appropriate_Snow_742",
        "body": "In what?? I have no idea what I just read? … \n\nmostly because I didn’t read it and just looked at the pics.",
        "created_utc": 1638353207,
        "id": "hms35qu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638382007.0
    },
    {
        "author": "Squamsk",
        "body": "Someone asked if it was young or old dolly parton....Kind of in the middle but much closer to present day. Dump came down, dongus came up, and it was wearing a wristwatch",
        "created_utc": 1638354276,
        "id": "hms4e45",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383076.0
    },
    {
        "author": "Gadshill",
        "body": "It was very transient.   Less than 24 hours.   Or is that joke already retired?",
        "created_utc": 1638353411,
        "id": "hms3e6f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638382211.0
    },
    {
        "author": "mrtmra",
        "body": "Man probably bought it when it was squeezing and just kept holding thinking it'll bounce back 🤣",
        "created_utc": 1638353744,
        "id": "hms3rsn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638382544.0
    },
    {
        "author": "Phaeax",
        "body": "Those futes candles seem quite healthy. Greens with trickles of reds to keept it real. Continue channeling upward.",
        "created_utc": 1638353756,
        "id": "hms3s9w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638382556.0
    },
    {
        "author": "Zulek",
        "body": "Ah thank you, strange. I only seem to see it in wsb",
        "created_utc": 1638353777,
        "id": "hms3t4z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638382577.0
    },
    {
        "author": "Heim23",
        "body": "how is it official?",
        "created_utc": 1638354639,
        "id": "hms4tng",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383439.0
    },
    {
        "author": "Gadshill",
        "body": "I forgot about all that.   Have you not seen futures?   It is tearing!",
        "created_utc": 1638354651,
        "id": "hms4u5o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383451.0
    },
    {
        "author": "Kzooanimal",
        "body": "Yes what you're referring to is known as tax loss harvesting, as you seem to be aware it must be performed within the same year, and other than triggering a wash sale (which you won't as you do not intend on buying back in)\n\nCongratulations!",
        "created_utc": 1638349151,
        "id": "hmryias",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638377951.0
    },
    {
        "author": "arsenal1887",
        "body": "but it can stay fake longer than you think it can",
        "created_utc": 1638349163,
        "id": "hmryit9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377963.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because it was either DD or Discussion and not a text post.",
        "created_utc": 1638349499,
        "id": "hmryx20",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638378299.0
    },
    {
        "author": "Breezytrigga1",
        "body": "Stay away from the most solid company in China, when you’re getting it at a discount. Great logic, thanks for the advice. I’m sure you graduated top of your class sport",
        "created_utc": 1638349550,
        "id": "hmryz74",
        "score": 1,
        "subreddit": "options",
        "created": 1638378350.0
    },
    {
        "author": "BIGBRAINBUYER",
        "body": "bad Rivian press? believe it or not? 1T market cap EOY",
        "created_utc": 1638350382,
        "id": "hmrzx9s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379182.0
    },
    {
        "author": "Mj_6o4",
        "body": "I wouldn't be so certain! Truth is the only reason the USD has any leverage is due to the oil embargo, times have changed. With the rise of the European union, the United Arab Emirates, the BRICS. There is really nothing stopping these super powers from trading in their native currencies. \n\n\nNone of these other nations are 30T in debt. China for example is growing at a tremendous rate.. I give it 1-3 years before Chinas GDP passes the US.\n\n\nWith rapid deflation, a massive debt, and no longer being the world's largest economy.. that piece of paper (the oil embargo) is pretty much the last thing holding this gong show together.  \n\n\nWhen all these nations start trading amongst eachother in a different currency, and start offloading the deflated dollars it will most likely crash the US economy.\n\n\nIts going to happen in our lifetime and a lot sooner than you expect. Heres a reminder -\n\n\nUsdebtclock.org",
        "created_utc": 1638350931,
        "id": "hms0jym",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379731.0
    },
    {
        "author": "jedielfninja",
        "body": "Indeed serious towing trucks are diesel even on the light to mid duty range. Gas trucks are very light duty compared to a diesel engine.\n\nMy theory is that gasoline cars and trucks will slowly disappear over the next few decades. Then there will be a predominant amount of semi trucks in warm climates that are battery EV. \n\nBut ice road truckers will be diesel for just about forever until some kind of nuclear or fusion generator takes over all energy sectors. Lithium just doesn't work well in cold temperatures. Perhaps in such a scale as a truck we could see it work but I doubt it. Diesel trucks are just so good and reliable in any condition I doubt we will lose them anytime soon.",
        "created_utc": 1638351247,
        "id": "hms0wv9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638380047.0
    },
    {
        "author": "I_FEEL_LIKE_POGBA",
        "body": "What a legendary bear trap this could turn out to be.\n\nOr it could end up being a bull trap.",
        "created_utc": 1638351268,
        "id": "hms0xqn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638380068.0
    },
    {
        "author": "RumHam1",
        "body": "How's your risk/reward appetite?  Baba is in a huge downtrend and has had lots of bad press.  You trying to time the bottom of a year long slaughter or are you willing to hold if it gets cut in half again?",
        "created_utc": 1638351514,
        "id": "hms17ux",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638380314.0
    },
    {
        "author": "EspacioBlanq",
        "body": "It will magically bounce back again",
        "created_utc": 1638351798,
        "id": "hms1jf5",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638380598.0
    },
    {
        "author": "RewiredInvestor",
        "body": "Isn’t it a bit too simplistic to cast a general opinion that the whole country and its biggest companies? I think we need to really understand what is going on. The issue isn’t their numbers, it’s been government regulatory changes. You should base your risk on that reality and not some unknown concept like “maybe their numbers are dodgy”.",
        "created_utc": 1638352040,
        "id": "hms1tga",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638380840.0
    },
    {
        "author": "MakeOSUGreatAgain63",
        "body": "TSLA up 1.33% Pre-Market \n\nWow. That’s crazy. Almost like again, it has no effect 🧠",
        "created_utc": 1638349351,
        "id": "hmryqxa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638378151.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "&gt;How is this not all over the newswires\n\nIt is.\n\nBut you're falling victim to irrational hyperbole and exaggeration.\n\nMany of us have been saying since the start of this bull market that when the inflows stopped, there would be a correction, so be ready for that.\n\nTheir job is not to keep the market trading mostly-sideways, their job is to support the real economy. Now that companies are doing better, getting strong revenues... it doesn't really matter if the market does a hard correction. It isn't needed for there to have been a \"mistake.\" They communicate what is necessary to try to keep people calm, until the time comes for a change, and then the change is made. There is nothing in \"promote effectively the goals of maximum employment, stable prices, and moderate long-term interest rates\" about stonks always going up. If they had tapered a year ago, as you seem to be suggesting, before employment had recovered then companies might not have done the same amount of hiring. That was the goal all along, and they've been saying that all along. If you've been listening to them. A lot of people have been responding with continuous cynicism, instead of listening, and those people are less prepared to rotate their investments on time.\n\nIt is up to each of us, as traders and investors, to be prepared for things like this, and to make sane choices.",
        "created_utc": 1638349358,
        "id": "hmryr70",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638378158.0
    },
    {
        "author": "Cookiesnap",
        "body": "Imo that is the point of their strategy. As a non habitual nintendo customer i find myself very often waiting half a year or a year to get a pretty high discount on PC and PS4 games. If i want to play a nintendo game instead, i just buy it because i know that it won’t be discounted much after 2-3 years.",
        "created_utc": 1638349390,
        "id": "hmrysiv",
        "score": 1,
        "subreddit": "investing",
        "created": 1638378190.0
    },
    {
        "author": "vladanHS",
        "body": "Ha, just realized why they kept AGIL above $10, there's going to be stock offering soon, they just filled it.",
        "created_utc": 1638349391,
        "id": "hmrysk3",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638378191.0
    },
    {
        "author": "ModernSmith",
        "body": "Buy and HODL. Seriously. Trading may not be for you. I would also look at how many fees you've eaten this year and it may surprise you.",
        "created_utc": 1638350277,
        "id": "hmrzsys",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379077.0
    },
    {
        "author": "hshamza",
        "body": "How to get rich as fuck: \n\nApple March 18 2022 180 Call\n\nHold it the entire way. Apple breaks $200 and runs and you retire.",
        "created_utc": 1638350533,
        "id": "hms03pg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379333.0
    },
    {
        "author": "yaboiRich",
        "body": "I blame it on alcohol and cocaine",
        "created_utc": 1638350811,
        "id": "hms0f1t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379611.0
    },
    {
        "author": "jeebus224",
        "body": "Beets are underrated.  I had a lemon chicken beet rap a few weeks ago and it was bussin",
        "created_utc": 1638350831,
        "id": "hms0fwh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379631.0
    },
    {
        "author": "Miserable-Fact-6668",
        "body": "**JPOW before being Re-nominated:**\n\nSenator: is inflation running hot?  \nJPOW: TRANSITORY  \nSenator: When will we start TAPER?  \nJPOW: That word does not exist\n\nWSB: JPOW is GOD\n\n**JPOW after being Re-nominated:** \n\nSenator: Is inflation is Transitory?  \nJPOW: We are going to retire that word, it no longer exist.  \nSenator: When will we start TAPER?  \nJPOW: We will be discussing plans to crash the market in December\n\nWSB: JPOW is SATAN",
        "created_utc": 1638351136,
        "id": "hms0sc5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379936.0
    },
    {
        "author": "badasschap",
        "body": "“Yeah real impressive buddy you got lucky and predicted this but literally anyone saw it coming” \n\n\nHmmmmm….. yet you and everyone else didn’t act on it? Do you hate money?",
        "created_utc": 1638351143,
        "id": "hms0smy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379943.0
    },
    {
        "author": "ILikuhTheTrade",
        "body": "But why you gotta say it like a Buzzfeed headline...",
        "created_utc": 1638349274,
        "id": "hmrynm0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638378074.0
    },
    {
        "author": "tortoisepump",
        "body": "ATVI a steaming pile of shit right now. Currently $58.  Worth a some calls if it hits $52 which was their March 2020 low? Or is this dumpster fire beyond saving?",
        "created_utc": 1638349655,
        "id": "hmrz3gn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638378455.0
    },
    {
        "author": "vizk0sity",
        "body": "Intel was notorious for the MBA sorta CEO who cut and disrespected engineers who are *grasp* responsible for innovations and products in order to improve the bottom line. They ventured into 5G and lost, sold the mobile unit to Apple for 1billion. They got beaten in every venture they come in, bar data centers. They underpaid their engineers severely when compared to other top semiconductor companies. None of my colleague really wants to work for intel at all. They failed in their process node roadmap. In short, they shot themselves in the foot to bring up some bottom line while having a non technical CEO for a while. New CEO is promising, but they haven’t had any real big breakthrough still. Worse, Apple designed M1 chip and it will eat into their lunches further. Data centers are the only saving grace currently. Even so, it’s been flat recently",
        "created_utc": 1638350794,
        "id": "hms0eci",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638379594.0
    },
    {
        "author": "claytondpark",
        "body": "An island top still can form here in the future sometime if it doesn't breakout",
        "created_utc": 1638351283,
        "id": "hms0yby",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638380083.0
    },
    {
        "author": "RedditPropagandaTool",
        "body": "I've speculated (I purposefully don't use the word investing) with a very small sum in EUR P2P lending since 2019. After Covid, my losses are about equal to the profits, and even worse if you count taxes. Right now, I'm withdrawing everything.\n\nHow it works is that you basically just send money to some Latvian bank account, there is no regulation, and there is no guarantee that you will ever get any of your money back. It's all hopes and promises.\n\nThe buyback obligation is false advertising, because it counts for nothing if the company defaults (which happens all the time).\n\nWorst of all, when there is a crisis, everything stops, and right when you need the money to invest in the stock market (in bear market), you instead have your cash tied up in some Eastern European account.",
        "created_utc": 1638351299,
        "id": "hms0z0i",
        "score": 1,
        "subreddit": "investing",
        "created": 1638380099.0
    },
    {
        "author": "AutoModerator",
        "body": "Your submission was removed because it is a short post. Any self-post below 400 characters in the body will be removed.  Please refer to rule 6 and make sure your post meets our standards of effort. Automod evasion will be met with a lengthy ban. Do not post just an article; highlight the parts of the article you find relevant or offer some commentary surrounding the article. Self-posts that offer some simple thoughts or questions like \"what do you think\", \"here's my thoughts\", etc. belong as comments to existing posts or the [Daily Advice Thread](https://www.reddit.com/r/investing/about/sticky?num=2).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
        "created_utc": 1638351650,
        "id": "hms1dcz",
        "score": 1,
        "subreddit": "investing",
        "created": 1638380450.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. You submitted an image I've already seen recently.                        If you're submitting a position screenshot use Gain/Loss/YOLO flair or it'll be duplicate checked.\n                        If you submitted something and then immediatley deleted it... don't do that next time.\n\nhttps://finance.yahoo.com/news/shareholder-alert-pomerantz-law-firm-180600197.html",
        "created_utc": 1638352185,
        "id": "hms1zcy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638380985.0
    },
    {
        "author": "Ziggus",
        "body": "Say it Jerome, TRANSITORY",
        "created_utc": 1638375584,
        "id": "hmt7g3h",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1638404384.0
    },
    {
        "author": "WeekendInteresting13",
        "body": "Who else thinks it takes a shit at open?",
        "created_utc": 1638362615,
        "id": "hmsfpg6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638391415.0
    },
    {
        "author": "krzen",
        "body": "It wasn’t involved in the process?",
        "created_utc": 1638358421,
        "id": "hms9k08",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638387221.0
    },
    {
        "author": "Xanax107",
        "body": "It already spiked tremendously it's priced in",
        "created_utc": 1638377634,
        "id": "hmtcncn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638406434.0
    },
    {
        "author": "whiskytangofoxtrot08",
        "body": "im not joking, the literal NANOSECOND i buy puts it starts to go up",
        "created_utc": 1638384666,
        "id": "hmtuqpj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638413466.0
    },
    {
        "author": "Jrecondite",
        "body": "This market use to rip every dip now it is limp. What gives?",
        "created_utc": 1638385267,
        "id": "hmtwaxh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638414067.0
    },
    {
        "author": "WhiteWhenWrong",
        "body": "Okay is it priced in yet? Don't even care what \"it\" is I just want it priced in okay?",
        "created_utc": 1638388732,
        "id": "hmu59x5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638417532.0
    },
    {
        "author": "rioferd888",
        "body": "Jpow turning off the printer boys.   \n\n\nGrab your cash and hold it tight. Buying puts might not be the answer because the kangaroo will stomp your ass too",
        "created_utc": 1638390901,
        "id": "hmuazxv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638419701.0
    },
    {
        "author": "DrifterDA",
        "body": "What the fuck did you guys do while I was away.\n\nI was up 12K this morning now it looks like my Portfolio has ran into Kyle Rittenhouse.",
        "created_utc": 1638390936,
        "id": "hmub3f1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638419736.0
    },
    {
        "author": "NKisAlive",
        "body": "I just bought a put to get out of a put I sold and it just canceled them both out.\n\nBut what if one excersizes? It gave me all my collateral back.",
        "created_utc": 1638390774,
        "id": "hmuanse",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638419574.0
    },
    {
        "author": "Gaston44",
        "body": "Apple took almost a year to break out only to lose it all in one day",
        "created_utc": 1638453401,
        "id": "hmxjiyt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638482201.0
    },
    {
        "author": "TheOriginalRK",
        "body": "I’m at a loss of words on how to even play the market right now. The way it dies or flies in seconds. Jesus Christ",
        "created_utc": 1638461976,
        "id": "hmy3ieg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638490776.0
    },
    {
        "author": "z33tec",
        "body": "It do go down",
        "created_utc": 1638460557,
        "id": "hmxzylr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638489357.0
    },
    {
        "author": "Sudafed_Yum",
        "body": "If we all manifest the spy jumping 50% then maybe we can do it",
        "created_utc": 1638461381,
        "id": "hmy20fo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638490181.0
    },
    {
        "author": "More_Advertising_383",
        "body": "It is 11am and SPY has gone up $6, then fell $4, and is now back up $4. Wtf the fuck kinda kangaroo shit is this?",
        "created_utc": 1638461499,
        "id": "hmy2ay0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638490299.0
    },
    {
        "author": "dvdr1029",
        "body": "Yo some dude wants to bet that SPY will go below $450 and I def don’t think it will and it’s $10k, thing is… I do not have 10k what do I do",
        "created_utc": 1638460180,
        "id": "hmxz0p0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638488980.0
    },
    {
        "author": "d-scan",
        "body": "Buy my book on how to lose 40% of your contract's value only 15 minutes after buying it",
        "created_utc": 1638460000,
        "id": "hmxykky",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638488800.0
    },
    {
        "author": "JayRoo83",
        "body": "\"GmE iS uP 35% In TwO wEeKs, I dArE yOu tO sHoRt It\"",
        "created_utc": 1638458701,
        "id": "hmxvf2h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638487501.0
    },
    {
        "author": "ILikuhTheTrade",
        "body": "It went up to 170 yesterday, if they didn't sell there they can't be helped.",
        "created_utc": 1638455219,
        "id": "hmxndqr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638484019.0
    },
    {
        "author": "Swagsung",
        "body": "I loveeee when I buy a call and it instantly goes down....not rage inducing at all!",
        "created_utc": 1638375070,
        "id": "hmt66ip",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638403870.0
    },
    {
        "author": "thesippycup",
        "body": "That's it. I'm cumming right now and there's nothing you can do to stop me",
        "created_utc": 1638375082,
        "id": "hmt67ml",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638403882.0
    },
    {
        "author": "phreedomx",
        "body": "Is it safe to start buying dips or do I wait?",
        "created_utc": 1638389549,
        "id": "hmu7eqf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638418349.0
    },
    {
        "author": "Davidkanye",
        "body": "Fuckin 4K loss in 4 days pretty much all of it, I been sleeping in",
        "created_utc": 1638399815,
        "id": "hmuy1ky",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638428615.0
    },
    {
        "author": "cbass1980",
        "body": "SPY gonna close flat isn't it... super normal, super organic market movement .. nothing to see here",
        "created_utc": 1638391612,
        "id": "hmucx8r",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638420412.0
    },
    {
        "author": "rcp_5",
        "body": "Now that my puts are down a solid 50%, is it time to buy more of them????",
        "created_utc": 1638466782,
        "id": "hmyg117",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638495582.0
    },
    {
        "author": "blahblahranger",
        "body": "When I worked out yesterday the market tanked, im about to do it again...so puts.",
        "created_utc": 1638468811,
        "id": "hmylb0t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638497611.0
    },
    {
        "author": "trpkchkn",
        "body": "Why does nobody in the media talk about Omicron symptoms ? It’s only BREAKOUT CASES.  \n\nSo what ? It’s a fucking cold. Do we get daily reports on how many colds there are in Oslo ? It doesn’t matter.",
        "created_utc": 1638449739,
        "id": "hmxcl9t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638478539.0
    },
    {
        "author": "hitzelsperger",
        "body": "I think it dropped to 10.6 but volume is super low for CFVI",
        "created_utc": 1638448143,
        "id": "hmx9xzv",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1638476943.0
    },
    {
        "author": "stonks-always-go-up",
        "body": "It fucking better",
        "created_utc": 1638445160,
        "id": "hmx5l1b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638473960.0
    },
    {
        "author": "GregoryOlinovich",
        "body": "Everyone's so sure the markets going down short term (omicron, inflation, billionaires selling, etc) AND that the market will be relatively flat in the next year+....\n\nCould it really be that obvious? Idk I can't get myself to be a 🌈🐻",
        "created_utc": 1638418601,
        "id": "hmw4a5v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638447401.0
    },
    {
        "author": "IveLurkedWSB2long",
        "body": "WSB screaming rug pull?\n\nCalls it is.",
        "created_utc": 1638458020,
        "id": "hmxtsnr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638486820.0
    },
    {
        "author": "mpoozd",
        "body": "For the last days when SPY QQQ up 1.5% while Cathie ETF down -1.6%\n\nLast week she had a brilliant idea to bet against major stock ..   \nIt looks like she's testing it ![img](emote|t5_2th52|4271)",
        "created_utc": 1638378472,
        "id": "hmter3e",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638407272.0
    },
    {
        "author": "davidbigham",
        "body": "We did it . 170 Tim apple.   Next stop 180",
        "created_utc": 1638375668,
        "id": "hmt7nm8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638404468.0
    },
    {
        "author": "SoullessArt",
        "body": "Threw in pocket change on spy the other day and turned $122 into $540…and I was so close to putting in $800 but my phone died and I wasn’t home and I forgot about it later that day",
        "created_utc": 1638376298,
        "id": "hmt990q",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638405098.0
    },
    {
        "author": "dvdr1029",
        "body": "If SPY is still green why does it feel so red? Oh that’s right because theta",
        "created_utc": 1638386103,
        "id": "hmtygcs",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638414903.0
    },
    {
        "author": "geltance",
        "body": "so it will go either up or down?",
        "created_utc": 1638357024,
        "id": "hms7qng",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638385824.0
    },
    {
        "author": "TheRootOfMostEvil",
        "body": "Umm, excuse me waiter?  I ordered a Shrek dick.  This isn’t it.",
        "created_utc": 1638377982,
        "id": "hmtdjlm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638406782.0
    },
    {
        "author": "kft99",
        "body": "Got some commons yesterday as it was nearly risk free. Did not expect it to get noticed so soon lol. Calls still cheapish so I got a small lotto size position too.",
        "created_utc": 1638381421,
        "id": "hmtmbjt",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1638410221.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Media is just hammering it like crazy",
        "created_utc": 1638376019,
        "id": "hmt8jl1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638404819.0
    },
    {
        "author": "tyloner",
        "body": "Just got my dna tested and it wasn’t dna.. it was usa",
        "created_utc": 1638385773,
        "id": "hmtxlut",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638414573.0
    },
    {
        "author": "Not99Percent",
        "body": "Omicron is just another variant that's gonna save the market crash, FED's gonna postpone it to Feb",
        "created_utc": 1638386102,
        "id": "hmtyg9e",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638414902.0
    },
    {
        "author": "MichaelS10",
        "body": "It has begun",
        "created_utc": 1638430111,
        "id": "hmwn8gh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638458911.0
    },
    {
        "author": "Hellmale",
        "body": "No. I have 6 of them just hold it.",
        "created_utc": 1638392290,
        "id": "hmues4o",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638421090.0
    },
    {
        "author": "animositisomina35",
        "body": "AMC only needs to drop another $29 for it to be fairly valued.",
        "created_utc": 1638389325,
        "id": "hmu6tq1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638418125.0
    },
    {
        "author": "WaluigiOFBO",
        "body": "It should be sub 50",
        "created_utc": 1638388014,
        "id": "hmu3enm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638416814.0
    },
    {
        "author": "t65789",
        "body": "No, I saw it this morning as I was about to go into a meeting. 😔 will tune in though when people leave my calendar alone.",
        "created_utc": 1638407541,
        "id": "hmvffn0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638436341.0
    },
    {
        "author": "luthervandrosss",
        "body": "We are about to see a really, really great buying opporunity. Can't say how long it will take, but some really nice deals are coming up in the future. Just have to be patient.",
        "created_utc": 1638395389,
        "id": "hmumyxk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638424189.0
    },
    {
        "author": "Zuko2001",
        "body": "Let’s be real not just Cathie’s way but toward ALL retail’s way. Retail has never been this overly aggressive and over leveraged in the equities markets. If this shit crashes it will lead to a depression that makes 08’ look like child’s play. I don’t think Powell really has a choice at this point unless he wants the blame to fall on him. He has to support the markets whichever way possible",
        "created_utc": 1638394101,
        "id": "hmujkrm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638422901.0
    },
    {
        "author": "hshamza",
        "body": "I lost my worn out leather wallet at a ARK conference, so I walked up to Cathie and asked her to please leave the room.\n\nShe said, \"that makes sense, less people should make it easier to find\".\n\nI replied, \"it's more because every time I catch a glimpse of your skin I think I found it\".",
        "created_utc": 1638347157,
        "id": "hmrw4sx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375957.0
    },
    {
        "author": "TheTechnicalTrader",
        "body": "It could also be done by going to the casino and putting everything on black. You’re forgetting the part where he would have to risk all of his money to make these kind of returns, most likely ending up losing everything.",
        "created_utc": 1638348653,
        "id": "hmrxx6o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638377453.0
    },
    {
        "author": "Interfecto",
        "body": "Nope, I was listening to a podcast and the host mentioned the doc, so I watched it and now I’m sad 🏎☹️",
        "created_utc": 1638348666,
        "id": "hmrxxt3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377466.0
    },
    {
        "author": "NatureTripsMe",
        "body": "I don’t know what you’re trying to say. It was more a covid thing since demand shrank 3%. Of course production had to shrink if you want to make money as a producer. And it did by 5%.  I look at data from EIA to determine production and then subtract consumption. This is really some standard stuff here. Not sure why you’re being weird about it. I found a Forbes piece from a chemical engineer whom has worked in the oil industry who describes a similar approach but is way better at describing the nuances:\nhttps://www.google.com/amp/s/www.forbes.com/sites/rrapier/2021/11/14/is-the-us-energy-independent/amp/",
        "created_utc": 1638346851,
        "id": "hmrvr62",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638375651.0
    },
    {
        "author": "ChiseledTwinkie",
        "body": "$PRTY is failing me. I bought the dip, it dipped more. Bought the dip. Dipped more. Bought some more dip today, let's hope it recovers. Omicrons a nothingburger",
        "created_utc": 1638348372,
        "id": "hmrxkvx",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1638377172.0
    },
    {
        "author": "No-Version-2123",
        "body": "Morning swaps it was a painful day to say the least",
        "created_utc": 1638348275,
        "id": "hmrxgsq",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1638377075.0
    },
    {
        "author": "McRich1",
        "body": "Last year, many WSB members were holding PLTR Dec calls.  All of them lost their money.  This year on Dec 2021. It would be #Wish.",
        "created_utc": 1638349140,
        "id": "hmryhu2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377940.0
    },
    {
        "author": "Frank_Boobtitsky",
        "body": "It shrinks?",
        "created_utc": 1638349199,
        "id": "hmrykb6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377999.0
    },
    {
        "author": "No-Negotiation-3128",
        "body": "Yes why not ;)\nLook:\n\n Evofem Biosciences, Inc. EVFM announced that it has entered into a definitive agreement with Keystone Capital Partners (\"Keystone Capital\") providing for the issuance and sale of an aggregate of 10,000 shares of Series B Convertible Stock in a registered direct offering for a purchase price of $1,000.00 per share.\n\nhttps://www.google.com/amp/s/finance.yahoo.com/amphtml/news/evofem-biosciences-announces-10-million-103100774.html",
        "created_utc": 1638349622,
        "id": "hmrz23z",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1638378422.0
    },
    {
        "author": "Upper-Equivalent3651",
        "body": "thanks.\n\nHope they are not there as crazy as here when it comes to debts",
        "created_utc": 1638345675,
        "id": "hmru9oo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374475.0
    },
    {
        "author": "ThatsHonestlyWildBro",
        "body": "TQQQ gonna absolutely moon in the morning ....back to where it was 1 week ago",
        "created_utc": 1638346102,
        "id": "hmrutcp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374902.0
    },
    {
        "author": "OogdayAyday",
        "body": "I've always wanted to try this, so today is the day I do it.\n\n\"FIRST\"",
        "created_utc": 1638346105,
        "id": "hmruti8",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638374905.0
    },
    {
        "author": "rolfie13",
        "body": "If you need to ask us, you're not ready. That being said, if you do decide to make this trade you're absolutely going to need to do two things beforehand. \n\n-Set a stop loss. Options are very volatile. What happens if you wake up one day and this call is down 30%? You won't know how you'll feel until it happens, and you won't be in the right frame of mind to make decisions after it has. This could very easily turn into a trade where you lose 100%. Pick a point, say 50% or whatever you're comfortable with so you can live to die another day.\n\n-Determine where you're going to take profits. This can go the other way too. You wake up to check on your option and it's up 100% just a couple weeks after opening the position. You're once again in a position where you aren't able to make unbiased decisions, and it can just as well go to zero still. These ones are the most demoralizing.\n\nWrite both your stop loss and take-profit point down on a physical piece of paper. It's more effective when it's staring you in the face. Good luck.",
        "created_utc": 1638345880,
        "id": "hmruj5x",
        "score": 1,
        "subreddit": "options",
        "created": 1638374680.0
    },
    {
        "author": "sgalligan17",
        "body": "It just has to do slightly worse than last month 🤷‍♂️",
        "created_utc": 1638346437,
        "id": "hmrv8iq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375237.0
    },
    {
        "author": "bitt3n",
        "body": "what's the advantage of buying it back before the end of the year?",
        "created_utc": 1638348558,
        "id": "hmrxt0j",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1638377358.0
    },
    {
        "author": "Electrical_Raisin_93",
        "body": "I was trading spy daily as well, it's hard and full of traps, nothing to rely on it, change your strategy",
        "created_utc": 1638348559,
        "id": "hmrxt17",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377359.0
    },
    {
        "author": "Rothiragay",
        "body": "BABA is surely going to be targeted by tax loss harvesting. Almost everyone who bought this year is holding it at a loss.",
        "created_utc": 1638349527,
        "id": "hmryy91",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638378327.0
    },
    {
        "author": "badasschap",
        "body": "It means GOLDMAN SACHS - MARKET HAS NOW PRICED IN A MAMMOTH C.7 MB/D NEGATIVE DEMAND HIT OVER THE NEXT THREE MONTHS, WITH NO OFFSETTING OPEC+ RESPONSE",
        "created_utc": 1638346283,
        "id": "hmrv1l7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375083.0
    },
    {
        "author": "Hot-Context8284",
        "body": "Just buy low, sell high. Don’t make it complicated",
        "created_utc": 1638346799,
        "id": "hmrvorf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638375599.0
    },
    {
        "author": "PeekingPotato",
        "body": "that sucks mate, but I´m sure it will go up again",
        "created_utc": 1638347746,
        "id": "hmrwtts",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638376546.0
    },
    {
        "author": "Upper-Equivalent3651",
        "body": "Well, the QE fucked a lot of things up, wouldnt you say?\n\nJust taking a look at treasuries and you cry. There was a time when you got interests for the risk you are taking the loaner goes bust. Now it seems all rules are out of the window.\n\nOne look at treasuries of Greece and my eyes go blank.\n\nNot even talking about sanctions. Fucked a lot of things up too. Or when people just do their own sanction thing (yes, clearstream, euroclear and whatever you call yourselves, I am talking to YOU!)\n\nAh well. You win one, you lose one.",
        "created_utc": 1638347943,
        "id": "hmrx2bm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376743.0
    },
    {
        "author": "Ozzy4253",
        "body": "Quantum computing stonk. Decades-long play.\n\nHigh risk high reward. But I'd it pulls off what it intends, it will impact virtually every city. Our science fiction stories of the future would be impossible without a QC at million qubits.",
        "created_utc": 1638345601,
        "id": "hmru65t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374401.0
    },
    {
        "author": "FoodCooker62",
        "body": "Do not listen to them. Nvidia at the current valuation is one of the biggest bubbles in the market. It should be $150 max and even then it's overvalued.",
        "created_utc": 1638345622,
        "id": "hmru77h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638374422.0
    },
    {
        "author": "MrMeeseeks987",
        "body": "Disney dropping to $100? It was around $100 when covid happened. I can’t see it going that low",
        "created_utc": 1638347840,
        "id": "hmrwxy0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638376640.0
    },
    {
        "author": "DenuvoSuks",
        "body": "He's timing was definitely not the best. We knew a long time this was coming, but announcing it when the covid was starting to make people nervous makes no sense. It could make it crash so hard he had to postpone it.",
        "created_utc": 1638348175,
        "id": "hmrxcf5",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638376975.0
    },
    {
        "author": "yaboiRich",
        "body": "as if sensing my presence it let out a big bellow. I said eeeeasy there big fella!",
        "created_utc": 1638348183,
        "id": "hmrxcsr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376983.0
    },
    {
        "author": "xcheezeplz",
        "body": "That's what oil does, it's not algos, the price is literally influenced by a cartel deciding what it should be. Now mix in market uncertainties and what else would you expect? \n\nUsually it only takes 2 times getting fucked trading oil before people swear it off.",
        "created_utc": 1638348207,
        "id": "hmrxdt7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377007.0
    },
    {
        "author": "DontWantUrSoch",
        "body": "Haha I love that..\n\nI understand this product seems exclusive/vanity for the very top 1% or perhaps it comes off as a reality to people in a distant future like 2050..however, just to explain, if they can take me from lower Brooklyn to any NYC airport in under an hour for 200usd or less I think that would make it worth it for so many people around the world, not just your average decently well of New Yorker. An Uber/cab would be around that price and it would slower… the train could be an option for some but it can be crowded, unreliable, and 100% disgusting.\n\nI say all these EvToad companies are overpriced, and many will not exist in the future but I do want the tech to enter our cityscape and soon.",
        "created_utc": 1638348219,
        "id": "hmrxebq",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638377019.0
    },
    {
        "author": "Phantom_Journey",
        "body": "Yeah, I sold a ton of VIX calls Wednesday at 20. I bough puts at 24 and 28. Didn’t cashed out when 5K up. I closed it flat. Now I’m back in for a month this time, waiting for some change. It’s.. fucking annoying.",
        "created_utc": 1638348966,
        "id": "hmryanq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377766.0
    },
    {
        "author": "InsertCatchyUserHere",
        "body": "I appreciate your thoughts in this section in particular:\n\n&amp;#x200B;\n\n&gt;What if my focus is entirely on rolling the short leg for credit? A completely different and legit way to think of a PMCC is that the long is something I expect to recoup for 0 net gain, it's just there to anchor the short legs...\n\n&amp;#x200B;\n\nI've recently been diving into PMCCs and have taken this outlook. I'm not particularly buying a LEAPS expecting it to be profitable when expiry comes around, I'm buying it for the privilege of selling CCs against it and extracting my profit from it one contract at a time. Any value still remaining near/at expiry is just an added bonus.",
        "created_utc": 1638348979,
        "id": "hmryb6h",
        "score": 1,
        "subreddit": "options",
        "created": 1638377779.0
    },
    {
        "author": "Fun-Marionberry-2540",
        "body": "Haha, alright. Fair enough.\n\nI guess I said what I said because I wanted to convey that I'm offsetting the interest payment with a short call. And if somehow that was novel or not, but I understand that you're saying the interest payment is for some other asset not the option, but in my mind it works differently because of the action path I've taken.\n\nSo Ok, \"Leveraged PMCC with Interested on Loan for other securities covered Strategy!\"",
        "created_utc": 1638345872,
        "id": "hmruisg",
        "score": 1,
        "subreddit": "options",
        "created": 1638374672.0
    },
    {
        "author": "AlwaysBlamesCanada",
        "body": "If it flies, floats, or fucks rent it, don’t buy it.",
        "created_utc": 1638346353,
        "id": "hmrv4og",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375153.0
    },
    {
        "author": "Murky-Plankton7469",
        "body": "As a person wanting to buy Tesla stock but knowing its grossly overvalued I thought the recent Musk debacle would be an opportunity for a real correction... How stupid was I?! \n \nEven at its lowest point it still stayed above 1k and I was hoping for something around 800-900 max.",
        "created_utc": 1638358348,
        "id": "hms9ghe",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638387148.0
    },
    {
        "author": "Redditsome22",
        "body": "[Pie graph](https://ibb.co/wwc9QhN?fbclid=IwAR1z1gj0gQ7T8nUUHXUVERiWjmndFdjXWnYv6Y-Y_BAsgDVGgiYFoKHRegU)\n\n&amp;#x200B;\n\nI have done a lot of repositioning into positions currently on what I considered a discount all of those flew high, too fast and burnt to the ground and beyond. went deep into BABA - currently 178avg and PYPL 211 avg - currently sadly sitting at an unrealized xx% loss. Also loaded on what was a speculative position last year with higher conviction now - bought quite a few CRSP at what I believe to be the bottom at the 78 range - currently avg at 102+-.{Not even mentioning my stupid PLTR,BB position - gambles going wrong atm, believing in the hype and the reason I bought hasnt changed still hence why i havent sold}\r  \n\r  \nAlthough I have sizeable losses here these positions have elevated my positions amazingly.\r  \n\r  \nHolding a sizeable position with xxx% returns on AMD and NIO and very bullish on SE - recently added to my position at 280\r  \n\r  \nbought into the AMC hype with a 14 avg and sold of 80% at around the 60 mark\r  \n\r  \n\r  \n\r  \nSquare shouldve been scalped and rebought 205-280 range and back is ridiculous but oh well\r  \n\r  \nsold JD into strenght to buy into my weaker positions - had a big position before. still bullish but seeing more upside elsewhere atm.\r  \n\r  \nI dont have any us mega caps- I know winners stay winners usually but I am looking for hopefully bigger returns albeith I run risk of big losses, clearly, as well - such as sizeble position in a clinical trial biotech AGTC - currently at a big loss aswell but that was expected. Lets see what happens here. stock at all time lows.\r  \n\r  \n\r  \n\r  \nfor example although im sitting at a 10avg with my SKLZ position the downside is limited here imo, and potential huge hence why I have been adding to my position lately a lot bellow 10\r  \n\r  \n\r  \n\r  \nI do recommend people look into CPNG and let me know their thoughts. I am torn between adding to this position or keeping it small.",
        "created_utc": 1638358232,
        "id": "hms9b17",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638387032.0
    },
    {
        "author": "Agitated-Savings-229",
        "body": "I guess the money i earned came hard... last year's drop taught me just to be patient. I was down almost a millions dollars but sat and waited and it all came back. Something options don't typically afford.",
        "created_utc": 1638359061,
        "id": "hmsafju",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387861.0
    },
    {
        "author": "Bossmoss599",
        "body": "Even in the under developed world there’s still vaccine misinformation. The polio vaccine in Northern Africa had to overcome misinformation like it was haram because it would make you sterile and was made with pork products.",
        "created_utc": 1638359085,
        "id": "hmsagpl",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638387885.0
    },
    {
        "author": "GoodellsMandMs",
        "body": "My sportsbook has the ability to set deposit limits and you can also lock yourself or of it forever\n\nIt's this not something you think they should be a doing? \n\nIf my gambling app has measures put in place to protect me why shouldn't my investment app?",
        "created_utc": 1638360058,
        "id": "hmsbtmf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638388858.0
    },
    {
        "author": "trail34",
        "body": "Ugh. I see this a lot, but it makes no sense. What’s better…\n\n1) profiting $1000 and paying $350 in taxes, netting you $650?\n\n2) profiting $1000 and purposely losing $1000, paying $0 in taxes, and netting you $0?\n\n3) profiting $1000 and purposely losing $2000, getting a $350 tax refund but you’re now at -$750 net?\n\n\nPeople are always so afraid of paying taxes. But I’d rather pay taxes and still have a profit than negate all my winnings by purposely selling stuff for less than I paid.",
        "created_utc": 1638360073,
        "id": "hmsbuca",
        "score": 1,
        "subreddit": "investing",
        "created": 1638388873.0
    },
    {
        "author": "Medz_For_Headz",
        "body": "So is it safe to buy the dip? or is the dip going to keep dipping??",
        "created_utc": 1638361098,
        "id": "hmsdbx1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389898.0
    },
    {
        "author": "Slow-Throat-1458",
        "body": "UTMA is a regular taxable account. It just has the minor listed as the beneficiary of the funds. No tax benefits. The trade off is that they can be used for anything, not just education.",
        "created_utc": 1638361546,
        "id": "hmse034",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638390346.0
    },
    {
        "author": "Wealth_Reasonable",
        "body": "it coming alive",
        "created_utc": 1638361602,
        "id": "hmse38d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390402.0
    },
    {
        "author": "_sillycibin_",
        "body": "just behind the number of money enthusiasts in the world.  which is what really most people who are in crypto are in it for.  they could give a shit about the narrative, feel good, change the world bs.  it's a speculative asset and they'll profit and gtfo when there are whiffs of trouble.  long term I think there are enough stupid people globally with growing interest to keep pushing btc up.",
        "created_utc": 1638362768,
        "id": "hmsfyma",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638391568.0
    },
    {
        "author": "ymi2f",
        "body": "Yeah but only chicks will buy it.   It's the new Jetta",
        "created_utc": 1638362789,
        "id": "hmsfzxs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391589.0
    },
    {
        "author": "Mister_Titty",
        "body": "The answer is experience and education. It IS possible to make good returns without getting your ass kicked, consistently, but only if you know what you're doing. And you won't find that education the easy way. It takes time; you will have to make mistakes and learn from them; you will have to educate yourself. Think of this as a wake-up call - you can either take investing seriously and devote a significant chunk of your time towards learning for the next ... however long it takes, or you can settle for the same returns and same risk as everyone else.",
        "created_utc": 1638362872,
        "id": "hmsg50f",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638391672.0
    },
    {
        "author": "eternalrefuge86",
        "body": "The SPY has been doing literally the same thing since Friday. So easy easy to play. Up? Buy puts. Down? Buy calls. Works til it doesn’t",
        "created_utc": 1638363788,
        "id": "hmshq8c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392588.0
    },
    {
        "author": "zth25",
        "body": "The profit motivation is not a genuine argument not to get vaccinated, is what I'm saying. Governments would buy the vaccine if it costs 10 or 20 or 100 bucks per shot because there is no alternative. Yet the cost for a shot is a reasonable 20 bucks. \n\nWe live in a free market society. Do we have to take the \"muh freedom\" crowd seriously when they use \"profit making\" as an excuse? They happily spend money on ivermectin, vitamin pills and moon crystals. \n\nOr blame \"big pharma\" when many gigantic pharma companies tried and failed to create a vaccine, and the most successful vaccines are made by start-up companies with cutting edge technology that use their profits to fund research into cancer, malaria and flu vaccines? Those are the literal heroes, not the villains.",
        "created_utc": 1638359211,
        "id": "hmsan0t",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638388011.0
    },
    {
        "author": "AutoModerator",
        "body": "This submission has been automatically removed because it may be a frequently asked question.  Please check our [wiki FAQ section](https://www.reddit.com/r/options/wiki/index) or re-post your question to the weekly [Options Questions Safe Haven](https://www.reddit.com/r/options/wiki/faq/subreddit_resources) thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/options) if you have any questions or concerns.*",
        "created_utc": 1638363037,
        "id": "hmsgf74",
        "score": 1,
        "subreddit": "options",
        "created": 1638391837.0
    },
    {
        "author": "WontQuitNow",
        "body": "In a world of uncertainty and volatility it makes a lil sense. Yes? No? ![img](emote|t5_2th52|4263)",
        "created_utc": 1638358222,
        "id": "hms9akb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387022.0
    },
    {
        "author": "Smithmonster",
        "body": "Missed that at first, thought you were joking at a dollar tent four loss. Don’t worry it will all bounce back tomorrow, or maybe next week. I sold all my shit waiting for the real dip to go long term, this market is Fukd.",
        "created_utc": 1638359518,
        "id": "hmsb2bu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388318.0
    },
    {
        "author": "aborack6",
        "body": "I only need it to open this high so I can dump my calls on another degen",
        "created_utc": 1638359546,
        "id": "hmsb3qi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388346.0
    },
    {
        "author": "msupz",
        "body": "Dare I say it? Ber r ___?",
        "created_utc": 1638361320,
        "id": "hmsdnuh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390120.0
    },
    {
        "author": "StarmanRick",
        "body": "Yea I looked into that one I think the warrants are 1/3. Also the presentation deck is out if you haven't seen it. \n\nhttps://www.sec.gov/Archives/edgar/data/0001838697/000121390021062704/ea151435ex99-2\\_broadscale.htm",
        "created_utc": 1638361841,
        "id": "hmsegpz",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638390641.0
    },
    {
        "author": "WeekendInteresting13",
        "body": "Who else thinks it takes a shit at open?",
        "created_utc": 1638362615,
        "id": "hmsfpg6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638391415.0
    },
    {
        "author": "krzen",
        "body": "It wasn’t involved in the process?",
        "created_utc": 1638358421,
        "id": "hms9k08",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638387221.0
    },
    {
        "author": "geltance",
        "body": "so it will go either up or down?",
        "created_utc": 1638357024,
        "id": "hms7qng",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638385824.0
    },
    {
        "author": "hshamza",
        "body": "I lost my worn out leather wallet at a ARK conference, so I walked up to Cathie and asked her to please leave the room.\n\nShe said, \"that makes sense, less people should make it easier to find\".\n\nI replied, \"it's more because every time I catch a glimpse of your skin I think I found it\".",
        "created_utc": 1638347157,
        "id": "hmrw4sx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375957.0
    },
    {
        "author": "TheTechnicalTrader",
        "body": "It could also be done by going to the casino and putting everything on black. You’re forgetting the part where he would have to risk all of his money to make these kind of returns, most likely ending up losing everything.",
        "created_utc": 1638348653,
        "id": "hmrxx6o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638377453.0
    },
    {
        "author": "Interfecto",
        "body": "Nope, I was listening to a podcast and the host mentioned the doc, so I watched it and now I’m sad 🏎☹️",
        "created_utc": 1638348666,
        "id": "hmrxxt3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377466.0
    },
    {
        "author": "NatureTripsMe",
        "body": "I don’t know what you’re trying to say. It was more a covid thing since demand shrank 3%. Of course production had to shrink if you want to make money as a producer. And it did by 5%.  I look at data from EIA to determine production and then subtract consumption. This is really some standard stuff here. Not sure why you’re being weird about it. I found a Forbes piece from a chemical engineer whom has worked in the oil industry who describes a similar approach but is way better at describing the nuances:\nhttps://www.google.com/amp/s/www.forbes.com/sites/rrapier/2021/11/14/is-the-us-energy-independent/amp/",
        "created_utc": 1638346851,
        "id": "hmrvr62",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638375651.0
    },
    {
        "author": "ChiseledTwinkie",
        "body": "$PRTY is failing me. I bought the dip, it dipped more. Bought the dip. Dipped more. Bought some more dip today, let's hope it recovers. Omicrons a nothingburger",
        "created_utc": 1638348372,
        "id": "hmrxkvx",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1638377172.0
    },
    {
        "author": "No-Version-2123",
        "body": "Morning swaps it was a painful day to say the least",
        "created_utc": 1638348275,
        "id": "hmrxgsq",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1638377075.0
    },
    {
        "author": "McRich1",
        "body": "Last year, many WSB members were holding PLTR Dec calls.  All of them lost their money.  This year on Dec 2021. It would be #Wish.",
        "created_utc": 1638349140,
        "id": "hmryhu2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377940.0
    },
    {
        "author": "Frank_Boobtitsky",
        "body": "It shrinks?",
        "created_utc": 1638349199,
        "id": "hmrykb6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377999.0
    },
    {
        "author": "No-Negotiation-3128",
        "body": "Yes why not ;)\nLook:\n\n Evofem Biosciences, Inc. EVFM announced that it has entered into a definitive agreement with Keystone Capital Partners (\"Keystone Capital\") providing for the issuance and sale of an aggregate of 10,000 shares of Series B Convertible Stock in a registered direct offering for a purchase price of $1,000.00 per share.\n\nhttps://www.google.com/amp/s/finance.yahoo.com/amphtml/news/evofem-biosciences-announces-10-million-103100774.html",
        "created_utc": 1638349622,
        "id": "hmrz23z",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1638378422.0
    },
    {
        "author": "Upper-Equivalent3651",
        "body": "thanks.\n\nHope they are not there as crazy as here when it comes to debts",
        "created_utc": 1638345675,
        "id": "hmru9oo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374475.0
    },
    {
        "author": "ThatsHonestlyWildBro",
        "body": "TQQQ gonna absolutely moon in the morning ....back to where it was 1 week ago",
        "created_utc": 1638346102,
        "id": "hmrutcp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374902.0
    },
    {
        "author": "OogdayAyday",
        "body": "I've always wanted to try this, so today is the day I do it.\n\n\"FIRST\"",
        "created_utc": 1638346105,
        "id": "hmruti8",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638374905.0
    },
    {
        "author": "rolfie13",
        "body": "If you need to ask us, you're not ready. That being said, if you do decide to make this trade you're absolutely going to need to do two things beforehand. \n\n-Set a stop loss. Options are very volatile. What happens if you wake up one day and this call is down 30%? You won't know how you'll feel until it happens, and you won't be in the right frame of mind to make decisions after it has. This could very easily turn into a trade where you lose 100%. Pick a point, say 50% or whatever you're comfortable with so you can live to die another day.\n\n-Determine where you're going to take profits. This can go the other way too. You wake up to check on your option and it's up 100% just a couple weeks after opening the position. You're once again in a position where you aren't able to make unbiased decisions, and it can just as well go to zero still. These ones are the most demoralizing.\n\nWrite both your stop loss and take-profit point down on a physical piece of paper. It's more effective when it's staring you in the face. Good luck.",
        "created_utc": 1638345880,
        "id": "hmruj5x",
        "score": 1,
        "subreddit": "options",
        "created": 1638374680.0
    },
    {
        "author": "sgalligan17",
        "body": "It just has to do slightly worse than last month 🤷‍♂️",
        "created_utc": 1638346437,
        "id": "hmrv8iq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375237.0
    },
    {
        "author": "bitt3n",
        "body": "what's the advantage of buying it back before the end of the year?",
        "created_utc": 1638348558,
        "id": "hmrxt0j",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1638377358.0
    },
    {
        "author": "Electrical_Raisin_93",
        "body": "I was trading spy daily as well, it's hard and full of traps, nothing to rely on it, change your strategy",
        "created_utc": 1638348559,
        "id": "hmrxt17",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377359.0
    },
    {
        "author": "Rothiragay",
        "body": "BABA is surely going to be targeted by tax loss harvesting. Almost everyone who bought this year is holding it at a loss.",
        "created_utc": 1638349527,
        "id": "hmryy91",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638378327.0
    },
    {
        "author": "badasschap",
        "body": "It means GOLDMAN SACHS - MARKET HAS NOW PRICED IN A MAMMOTH C.7 MB/D NEGATIVE DEMAND HIT OVER THE NEXT THREE MONTHS, WITH NO OFFSETTING OPEC+ RESPONSE",
        "created_utc": 1638346283,
        "id": "hmrv1l7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375083.0
    },
    {
        "author": "Hot-Context8284",
        "body": "Just buy low, sell high. Don’t make it complicated",
        "created_utc": 1638346799,
        "id": "hmrvorf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638375599.0
    },
    {
        "author": "PeekingPotato",
        "body": "that sucks mate, but I´m sure it will go up again",
        "created_utc": 1638347746,
        "id": "hmrwtts",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638376546.0
    },
    {
        "author": "Upper-Equivalent3651",
        "body": "Well, the QE fucked a lot of things up, wouldnt you say?\n\nJust taking a look at treasuries and you cry. There was a time when you got interests for the risk you are taking the loaner goes bust. Now it seems all rules are out of the window.\n\nOne look at treasuries of Greece and my eyes go blank.\n\nNot even talking about sanctions. Fucked a lot of things up too. Or when people just do their own sanction thing (yes, clearstream, euroclear and whatever you call yourselves, I am talking to YOU!)\n\nAh well. You win one, you lose one.",
        "created_utc": 1638347943,
        "id": "hmrx2bm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376743.0
    },
    {
        "author": "Ozzy4253",
        "body": "Quantum computing stonk. Decades-long play.\n\nHigh risk high reward. But I'd it pulls off what it intends, it will impact virtually every city. Our science fiction stories of the future would be impossible without a QC at million qubits.",
        "created_utc": 1638345601,
        "id": "hmru65t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374401.0
    },
    {
        "author": "FoodCooker62",
        "body": "Do not listen to them. Nvidia at the current valuation is one of the biggest bubbles in the market. It should be $150 max and even then it's overvalued.",
        "created_utc": 1638345622,
        "id": "hmru77h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638374422.0
    },
    {
        "author": "MrMeeseeks987",
        "body": "Disney dropping to $100? It was around $100 when covid happened. I can’t see it going that low",
        "created_utc": 1638347840,
        "id": "hmrwxy0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638376640.0
    },
    {
        "author": "DenuvoSuks",
        "body": "He's timing was definitely not the best. We knew a long time this was coming, but announcing it when the covid was starting to make people nervous makes no sense. It could make it crash so hard he had to postpone it.",
        "created_utc": 1638348175,
        "id": "hmrxcf5",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638376975.0
    },
    {
        "author": "yaboiRich",
        "body": "as if sensing my presence it let out a big bellow. I said eeeeasy there big fella!",
        "created_utc": 1638348183,
        "id": "hmrxcsr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376983.0
    },
    {
        "author": "xcheezeplz",
        "body": "That's what oil does, it's not algos, the price is literally influenced by a cartel deciding what it should be. Now mix in market uncertainties and what else would you expect? \n\nUsually it only takes 2 times getting fucked trading oil before people swear it off.",
        "created_utc": 1638348207,
        "id": "hmrxdt7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377007.0
    },
    {
        "author": "DontWantUrSoch",
        "body": "Haha I love that..\n\nI understand this product seems exclusive/vanity for the very top 1% or perhaps it comes off as a reality to people in a distant future like 2050..however, just to explain, if they can take me from lower Brooklyn to any NYC airport in under an hour for 200usd or less I think that would make it worth it for so many people around the world, not just your average decently well of New Yorker. An Uber/cab would be around that price and it would slower… the train could be an option for some but it can be crowded, unreliable, and 100% disgusting.\n\nI say all these EvToad companies are overpriced, and many will not exist in the future but I do want the tech to enter our cityscape and soon.",
        "created_utc": 1638348219,
        "id": "hmrxebq",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638377019.0
    },
    {
        "author": "Phantom_Journey",
        "body": "Yeah, I sold a ton of VIX calls Wednesday at 20. I bough puts at 24 and 28. Didn’t cashed out when 5K up. I closed it flat. Now I’m back in for a month this time, waiting for some change. It’s.. fucking annoying.",
        "created_utc": 1638348966,
        "id": "hmryanq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377766.0
    },
    {
        "author": "InsertCatchyUserHere",
        "body": "I appreciate your thoughts in this section in particular:\n\n&amp;#x200B;\n\n&gt;What if my focus is entirely on rolling the short leg for credit? A completely different and legit way to think of a PMCC is that the long is something I expect to recoup for 0 net gain, it's just there to anchor the short legs...\n\n&amp;#x200B;\n\nI've recently been diving into PMCCs and have taken this outlook. I'm not particularly buying a LEAPS expecting it to be profitable when expiry comes around, I'm buying it for the privilege of selling CCs against it and extracting my profit from it one contract at a time. Any value still remaining near/at expiry is just an added bonus.",
        "created_utc": 1638348979,
        "id": "hmryb6h",
        "score": 1,
        "subreddit": "options",
        "created": 1638377779.0
    },
    {
        "author": "Fun-Marionberry-2540",
        "body": "Haha, alright. Fair enough.\n\nI guess I said what I said because I wanted to convey that I'm offsetting the interest payment with a short call. And if somehow that was novel or not, but I understand that you're saying the interest payment is for some other asset not the option, but in my mind it works differently because of the action path I've taken.\n\nSo Ok, \"Leveraged PMCC with Interested on Loan for other securities covered Strategy!\"",
        "created_utc": 1638345872,
        "id": "hmruisg",
        "score": 1,
        "subreddit": "options",
        "created": 1638374672.0
    },
    {
        "author": "AlwaysBlamesCanada",
        "body": "If it flies, floats, or fucks rent it, don’t buy it.",
        "created_utc": 1638346353,
        "id": "hmrv4og",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375153.0
    },
    {
        "author": "Murky-Plankton7469",
        "body": "As a person wanting to buy Tesla stock but knowing its grossly overvalued I thought the recent Musk debacle would be an opportunity for a real correction... How stupid was I?! \n \nEven at its lowest point it still stayed above 1k and I was hoping for something around 800-900 max.",
        "created_utc": 1638358348,
        "id": "hms9ghe",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638387148.0
    },
    {
        "author": "Redditsome22",
        "body": "[Pie graph](https://ibb.co/wwc9QhN?fbclid=IwAR1z1gj0gQ7T8nUUHXUVERiWjmndFdjXWnYv6Y-Y_BAsgDVGgiYFoKHRegU)\n\n&amp;#x200B;\n\nI have done a lot of repositioning into positions currently on what I considered a discount all of those flew high, too fast and burnt to the ground and beyond. went deep into BABA - currently 178avg and PYPL 211 avg - currently sadly sitting at an unrealized xx% loss. Also loaded on what was a speculative position last year with higher conviction now - bought quite a few CRSP at what I believe to be the bottom at the 78 range - currently avg at 102+-.{Not even mentioning my stupid PLTR,BB position - gambles going wrong atm, believing in the hype and the reason I bought hasnt changed still hence why i havent sold}\r  \n\r  \nAlthough I have sizeable losses here these positions have elevated my positions amazingly.\r  \n\r  \nHolding a sizeable position with xxx% returns on AMD and NIO and very bullish on SE - recently added to my position at 280\r  \n\r  \nbought into the AMC hype with a 14 avg and sold of 80% at around the 60 mark\r  \n\r  \n\r  \n\r  \nSquare shouldve been scalped and rebought 205-280 range and back is ridiculous but oh well\r  \n\r  \nsold JD into strenght to buy into my weaker positions - had a big position before. still bullish but seeing more upside elsewhere atm.\r  \n\r  \nI dont have any us mega caps- I know winners stay winners usually but I am looking for hopefully bigger returns albeith I run risk of big losses, clearly, as well - such as sizeble position in a clinical trial biotech AGTC - currently at a big loss aswell but that was expected. Lets see what happens here. stock at all time lows.\r  \n\r  \n\r  \n\r  \nfor example although im sitting at a 10avg with my SKLZ position the downside is limited here imo, and potential huge hence why I have been adding to my position lately a lot bellow 10\r  \n\r  \n\r  \n\r  \nI do recommend people look into CPNG and let me know their thoughts. I am torn between adding to this position or keeping it small.",
        "created_utc": 1638358232,
        "id": "hms9b17",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638387032.0
    },
    {
        "author": "Agitated-Savings-229",
        "body": "I guess the money i earned came hard... last year's drop taught me just to be patient. I was down almost a millions dollars but sat and waited and it all came back. Something options don't typically afford.",
        "created_utc": 1638359061,
        "id": "hmsafju",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387861.0
    },
    {
        "author": "Bossmoss599",
        "body": "Even in the under developed world there’s still vaccine misinformation. The polio vaccine in Northern Africa had to overcome misinformation like it was haram because it would make you sterile and was made with pork products.",
        "created_utc": 1638359085,
        "id": "hmsagpl",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638387885.0
    },
    {
        "author": "GoodellsMandMs",
        "body": "My sportsbook has the ability to set deposit limits and you can also lock yourself or of it forever\n\nIt's this not something you think they should be a doing? \n\nIf my gambling app has measures put in place to protect me why shouldn't my investment app?",
        "created_utc": 1638360058,
        "id": "hmsbtmf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638388858.0
    },
    {
        "author": "trail34",
        "body": "Ugh. I see this a lot, but it makes no sense. What’s better…\n\n1) profiting $1000 and paying $350 in taxes, netting you $650?\n\n2) profiting $1000 and purposely losing $1000, paying $0 in taxes, and netting you $0?\n\n3) profiting $1000 and purposely losing $2000, getting a $350 tax refund but you’re now at -$750 net?\n\n\nPeople are always so afraid of paying taxes. But I’d rather pay taxes and still have a profit than negate all my winnings by purposely selling stuff for less than I paid.",
        "created_utc": 1638360073,
        "id": "hmsbuca",
        "score": 1,
        "subreddit": "investing",
        "created": 1638388873.0
    },
    {
        "author": "Medz_For_Headz",
        "body": "So is it safe to buy the dip? or is the dip going to keep dipping??",
        "created_utc": 1638361098,
        "id": "hmsdbx1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389898.0
    },
    {
        "author": "Slow-Throat-1458",
        "body": "UTMA is a regular taxable account. It just has the minor listed as the beneficiary of the funds. No tax benefits. The trade off is that they can be used for anything, not just education.",
        "created_utc": 1638361546,
        "id": "hmse034",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638390346.0
    },
    {
        "author": "Wealth_Reasonable",
        "body": "it coming alive",
        "created_utc": 1638361602,
        "id": "hmse38d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390402.0
    },
    {
        "author": "_sillycibin_",
        "body": "just behind the number of money enthusiasts in the world.  which is what really most people who are in crypto are in it for.  they could give a shit about the narrative, feel good, change the world bs.  it's a speculative asset and they'll profit and gtfo when there are whiffs of trouble.  long term I think there are enough stupid people globally with growing interest to keep pushing btc up.",
        "created_utc": 1638362768,
        "id": "hmsfyma",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638391568.0
    },
    {
        "author": "ymi2f",
        "body": "Yeah but only chicks will buy it.   It's the new Jetta",
        "created_utc": 1638362789,
        "id": "hmsfzxs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391589.0
    },
    {
        "author": "Mister_Titty",
        "body": "The answer is experience and education. It IS possible to make good returns without getting your ass kicked, consistently, but only if you know what you're doing. And you won't find that education the easy way. It takes time; you will have to make mistakes and learn from them; you will have to educate yourself. Think of this as a wake-up call - you can either take investing seriously and devote a significant chunk of your time towards learning for the next ... however long it takes, or you can settle for the same returns and same risk as everyone else.",
        "created_utc": 1638362872,
        "id": "hmsg50f",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638391672.0
    },
    {
        "author": "eternalrefuge86",
        "body": "The SPY has been doing literally the same thing since Friday. So easy easy to play. Up? Buy puts. Down? Buy calls. Works til it doesn’t",
        "created_utc": 1638363788,
        "id": "hmshq8c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392588.0
    },
    {
        "author": "zth25",
        "body": "The profit motivation is not a genuine argument not to get vaccinated, is what I'm saying. Governments would buy the vaccine if it costs 10 or 20 or 100 bucks per shot because there is no alternative. Yet the cost for a shot is a reasonable 20 bucks. \n\nWe live in a free market society. Do we have to take the \"muh freedom\" crowd seriously when they use \"profit making\" as an excuse? They happily spend money on ivermectin, vitamin pills and moon crystals. \n\nOr blame \"big pharma\" when many gigantic pharma companies tried and failed to create a vaccine, and the most successful vaccines are made by start-up companies with cutting edge technology that use their profits to fund research into cancer, malaria and flu vaccines? Those are the literal heroes, not the villains.",
        "created_utc": 1638359211,
        "id": "hmsan0t",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638388011.0
    },
    {
        "author": "AutoModerator",
        "body": "This submission has been automatically removed because it may be a frequently asked question.  Please check our [wiki FAQ section](https://www.reddit.com/r/options/wiki/index) or re-post your question to the weekly [Options Questions Safe Haven](https://www.reddit.com/r/options/wiki/faq/subreddit_resources) thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/options) if you have any questions or concerns.*",
        "created_utc": 1638363037,
        "id": "hmsgf74",
        "score": 1,
        "subreddit": "options",
        "created": 1638391837.0
    },
    {
        "author": "WontQuitNow",
        "body": "In a world of uncertainty and volatility it makes a lil sense. Yes? No? ![img](emote|t5_2th52|4263)",
        "created_utc": 1638358222,
        "id": "hms9akb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387022.0
    },
    {
        "author": "Smithmonster",
        "body": "Missed that at first, thought you were joking at a dollar tent four loss. Don’t worry it will all bounce back tomorrow, or maybe next week. I sold all my shit waiting for the real dip to go long term, this market is Fukd.",
        "created_utc": 1638359518,
        "id": "hmsb2bu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388318.0
    },
    {
        "author": "aborack6",
        "body": "I only need it to open this high so I can dump my calls on another degen",
        "created_utc": 1638359546,
        "id": "hmsb3qi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388346.0
    },
    {
        "author": "msupz",
        "body": "Dare I say it? Ber r ___?",
        "created_utc": 1638361320,
        "id": "hmsdnuh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390120.0
    },
    {
        "author": "StarmanRick",
        "body": "Yea I looked into that one I think the warrants are 1/3. Also the presentation deck is out if you haven't seen it. \n\nhttps://www.sec.gov/Archives/edgar/data/0001838697/000121390021062704/ea151435ex99-2\\_broadscale.htm",
        "created_utc": 1638361841,
        "id": "hmsegpz",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638390641.0
    },
    {
        "author": "Inquisitor1",
        "body": "I mean it did come back to 14$, then it went to 24 from there. Then it dipped pre-earnings, then it went to 24.",
        "created_utc": 1638361856,
        "id": "hmsehlo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638390656.0
    },
    {
        "author": "barelyrolling42069v2",
        "body": "I know some of you retards have had to deal with this before. Kitty ran away on Saturday and I really can't think about anything else. I took all the steps to increase chances of his return and sitting on my hands waiting here is brutal. How to stop thinking about it? He is an expert hunter so I think he's still kicking as long as he found a warm spot to hunker down during the cold nights",
        "created_utc": 1638362999,
        "id": "hmsgctj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391799.0
    },
    {
        "author": "muchcoinmuchfun",
        "body": "I think it does at some point today after a rally but I’m holding puts and biassed.  I have one set of calls",
        "created_utc": 1638363447,
        "id": "hmsh4vp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392247.0
    },
    {
        "author": "WhoLickedMyDumpling",
        "body": "well apparently Goldman Sachs are the ones giving fidelity the information on shares available to short... so the question is, was it on purpose and to what end?",
        "created_utc": 1638358617,
        "id": "hms9tr6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387417.0
    },
    {
        "author": "taimusrs",
        "body": "Don't wanna jinx it but, today seems like a good day",
        "created_utc": 1638359403,
        "id": "hmsawl3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638388203.0
    },
    {
        "author": "tomis8",
        "body": "How to fix my banbet?  I placed a banbet, and visualmod said it wasn't accepted because I placed text after the time token.  Fixed the problem, but submitted a banbet with an incorrect price.  I edit the banbet immediately, but visualmod accepted the incorrect price.",
        "created_utc": 1638360105,
        "id": "hmsbvy4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388905.0
    },
    {
        "author": "Clay_2000lbs",
        "body": "Sounds like it was a typo…",
        "created_utc": 1638360149,
        "id": "hmsby6q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388949.0
    },
    {
        "author": "PrincPaco",
        "body": "The best way to combat COVID is to stop handling dirty money. Credit &amp; Debit cards are able to be sanitized after each use and added benefit, it helps my calls print and will send my kids to college. \n\n*Not medical or financial advice but forreal, stop selling payment processing stocks. Please and thank you",
        "created_utc": 1638361241,
        "id": "hmsdjk8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390041.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot. This Meme does not look like it has generated enough approval to stay on /r/wallstreetbets.                                        We algorithmically cull certain submission flairs whose response is not above a certain threshold to try and keep the page clean.",
        "created_utc": 1638361709,
        "id": "hmse98o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390509.0
    },
    {
        "author": "KorbenDallassssS",
        "body": "....and yet somehow you think after jpow's public retraction of the transitory narrative means that he'll somehow be ultra-bullish the very next day....\n\nThat transitory bullshit was the only reason anyone felt good about the charade continuing.  Jpow is too smart to drop the entire nuke in one meeting, will be slow dripping it over the next ~year, frog in boiling water style.",
        "created_utc": 1638362543,
        "id": "hmsfl6c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391343.0
    },
    {
        "author": "SalmonTheSalesman",
        "body": "Lmao they killed all the apes. Why was everyone bullish on it anyway?",
        "created_utc": 1638359803,
        "id": "hmsbgkm",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1638388603.0
    },
    {
        "author": "SenorDiablo",
        "body": "Good shit man! Bought some when you called it out but it took off before I could load the boat. Hope we see a modest gain today. Thanks again!",
        "created_utc": 1638360944,
        "id": "hmsd3kj",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638389744.0
    },
    {
        "author": "Aerotyne69",
        "body": "Happy December. If you been losing money, it can turn around. Don’t give up!",
        "created_utc": 1638361472,
        "id": "hmsdvzg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390272.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because was too short. Please make it a comment if it's not worth expounding on.",
        "created_utc": 1638361479,
        "id": "hmsdweu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390279.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. You submitted a Gain/Loss/YOLO that didn't look like it included **large** positions. Please read the rules. This check will fire if you included unnecessary pictures that don't show positions. Repost with the useless pictures omitted if you did that.",
        "created_utc": 1638362276,
        "id": "hmsf5ij",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391076.0
    },
    {
        "author": "derprondo",
        "body": "That won’t do shit, need to convert it to crack first.",
        "created_utc": 1638362310,
        "id": "hmsf7hl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391110.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. You submitted an image I've already seen recently.                        If you're submitting a position screenshot use Gain/Loss/YOLO flair or it'll be duplicate checked.\n                        If you submitted something and then immediatley deleted it... don't do that next time.\n\nhttps://i.redd.it/2ripvfukex281.jpg",
        "created_utc": 1638362412,
        "id": "hmsfdgp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391212.0
    },
    {
        "author": "offensiveniglet",
        "body": "You should avoid swimming, you're too dense for it. I'm impressed you managed to setup a brokerage account. YTD is January to today, otherwise known as a time period encompassing the current year. It can also refer to fiscal year start to current day but it is usually referring to calendar year.",
        "created_utc": 1638360890,
        "id": "hmsd0oi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638389690.0
    },
    {
        "author": "contrejo",
        "body": "But I don't like setting the limit because I fear that I will set it too low and at this point I'm not sure what amount of comfortable with. I have also set it too high",
        "created_utc": 1638360912,
        "id": "hmsd1uv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389712.0
    },
    {
        "author": "Smurf_Crime_Scene",
        "body": "Because there are so many mutations the vaccine is expected to be as effective OR LESS with \"less\" being a real possibility.\n\nYou are correct that it doesn't mean that the virus is in itself more lethal. It could be more lethal. Or less. We just don't know yet.",
        "created_utc": 1638361996,
        "id": "hmseph6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390796.0
    },
    {
        "author": "Inquisitor1",
        "body": "If you don't think a stock is going up why are you even holding it? You might be wrong when you think it's going up, but you don't know the future yet. If you have shit investments you don't believe in, you should have sold yesterday regardless if it's tax season or not.",
        "created_utc": 1638362035,
        "id": "hmserok",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638390835.0
    },
    {
        "author": "nalden",
        "body": "Title says it all! Luh mau",
        "created_utc": 1638362628,
        "id": "hmsfq5s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391428.0
    },
    {
        "author": "GlitteringEar5190",
        "body": "Yes buy calls with Jan/Feb expiry. Before their next earning. It will pay off.",
        "created_utc": 1638362633,
        "id": "hmsfqgl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391433.0
    },
    {
        "author": "JackWorthing",
        "body": "Same except 12/1 … it IS tempting to hold for a bit",
        "created_utc": 1638363403,
        "id": "hmsh224",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392203.0
    },
    {
        "author": "AmeriMan2",
        "body": "Yes. My roommate has 2 cats. I've let one escape before but it came back after a night of the litter box outside.\n\nIt's their *toilet*",
        "created_utc": 1638363416,
        "id": "hmsh2xj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392216.0
    },
    {
        "author": "Responsible-Fuel7725",
        "body": "Worst case scenario you are down .73%. That’s nothing. Wait until you see a 50% drop and it takes out hundreds of thousands of dollars from your account. Keep it in and wait. DCA your money. This is the way.",
        "created_utc": 1638358761,
        "id": "hmsa0sw",
        "score": 1,
        "subreddit": "investing",
        "created": 1638387561.0
    },
    {
        "author": "Weak-Pudding-322",
        "body": "6 &amp; 7 felt like a stretch. Not saying you’ve never seen it but to say it’s a regular thing? I don’t even know what you’re talking about",
        "created_utc": 1638359957,
        "id": "hmsbocs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388757.0
    },
    {
        "author": "BenRobNU",
        "body": "That sweater is fucking terrible. Let the GF take it as a parting gift.",
        "created_utc": 1638359985,
        "id": "hmsbprz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388785.0
    },
    {
        "author": "0005AD99",
        "body": "everyone so bullish is making me nervous. My NDX calls are up 100% do I sell before bell or let it ride? (before any ape calls me retard, yes we can trade CFDs in the pre market)",
        "created_utc": 1638360299,
        "id": "hmsc5tl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389099.0
    },
    {
        "author": "vladanHS",
        "body": "Where you got $300 number, at me it says $100?",
        "created_utc": 1638360301,
        "id": "hmsc5x0",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638389101.0
    },
    {
        "author": "contrejo",
        "body": "That guy sounds shady. The fact they don't want to give the formula for what's supposed to be a terrible pandemic further solidifies My belief that the pharmaceutical industry wants us to maintain our sickness and not cure it.",
        "created_utc": 1638360337,
        "id": "hmsc7qp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389137.0
    },
    {
        "author": "Diamondhands4dagainz",
        "body": "I can’t bet on it because I don’t know when the rates will rise. JPOW could come in today and say “Fuck it we’re gunna raise rates next week”. Cunt is a loose cannon now",
        "created_utc": 1638361190,
        "id": "hmsdgqw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389990.0
    },
    {
        "author": "AdmirableActuator",
        "body": "GOEV. Got it, sold for. 20% profit and it continued up.",
        "created_utc": 1638361663,
        "id": "hmse6mu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638390463.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because was too short. Please make it a comment if it's not worth expounding on.",
        "created_utc": 1638362492,
        "id": "hmsfi6u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391292.0
    },
    {
        "author": "bitstream_baller",
        "body": "IT guy here. Cisco is running 4-6 months out for a LOT of switches and gear. It hurts.",
        "created_utc": 1638362722,
        "id": "hmsfvx5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391522.0
    },
    {
        "author": "VisualMod",
        "body": "I am a bot from /r/wallstreetbets. Your submission was removed because was too short. Please make it a comment if it's not worth expounding on.",
        "created_utc": 1638363211,
        "id": "hmsgq2a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392011.0
    },
    {
        "author": "SlothInvesting1996",
        "body": "It will be down again",
        "created_utc": 1638363230,
        "id": "hmsgr8c",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638392030.0
    },
    {
        "author": "justsomeitguyhere",
        "body": "yes, I would buy all of the stocks, doesn't matter if it goes down any more.",
        "created_utc": 1638363237,
        "id": "hmsgrpi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392037.0
    },
    {
        "author": "big3n05",
        "body": "No one has made an electric airplane that is a viable passenger transport, much less the much less efficient VTOL (e.g., helicopter) type. Will it work eventually? I'm sure it will. But, we'll need the battery breakthroughs we are all hoping for first. More capacity, lighter weight, etc. It'll never work until then. Even when that is solved you are looking at probably 15 years or so for type certification at a minimum. The Honda Jet took about that long and that is a company with massive resources who is making small improvements to a form factor that is extremely well known.",
        "created_utc": 1638359010,
        "id": "hmsacyu",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638387810.0
    },
    {
        "author": "AutoModerator",
        "body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
        "created_utc": 1638359019,
        "id": "hmsadex",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387819.0
    },
    {
        "author": "TheTallestDwarf",
        "body": "Short answer: no. If there was such a method everybody would be doing it. \n\nThe risk to reward ratio is always increasing, and reducing risk always reduces potential rewards.",
        "created_utc": 1638359647,
        "id": "hmsb8rc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638388447.0
    },
    {
        "author": "Public-Angle82",
        "body": "Does anyone else feel like maybe rich folks just get together and decide to raise prices and blame it on inflation.",
        "created_utc": 1638359686,
        "id": "hmsbao1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388486.0
    },
    {
        "author": "abigailwimbleu",
        "body": "Do yourself a favor &amp; sell when it gets back up to $26-$27. Love PLTR but it’s been disappointing to hold to say the least",
        "created_utc": 1638360716,
        "id": "hmscrk5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389516.0
    },
    {
        "author": "Berto_",
        "body": "Burn it",
        "created_utc": 1638360748,
        "id": "hmsct88",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389548.0
    },
    {
        "author": "AutoModerator",
        "body": "Your submission was removed because it is a short post. Any self-post below 400 characters in the body will be removed.  Please refer to rule 6 and make sure your post meets our standards of effort. Automod evasion will be met with a lengthy ban. Do not post just an article; highlight the parts of the article you find relevant or offer some commentary surrounding the article. Self-posts that offer some simple thoughts or questions like \"what do you think\", \"here's my thoughts\", etc. belong as comments to existing posts or the [Daily Advice Thread](https://www.reddit.com/r/investing/about/sticky?num=2).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*",
        "created_utc": 1638362089,
        "id": "hmseur7",
        "score": 1,
        "subreddit": "investing",
        "created": 1638390889.0
    }
]