[
    {
        "author": "Powerful_Stick_1449",
        "body": "MSFT.... their cloud growth is exponential, they have no anti-trust heat right now, and their gaming segment is making acquisition after acquisition.",
        "created_utc": 1635798955,
        "id": "hixeoo5",
        "score": 1285,
        "subreddit": "stocks",
        "created": 1635827755.0
    },
    {
        "author": "lSoosl",
        "body": "1500 AAPL &amp; 1500 MSFT",
        "created_utc": 1635798193,
        "id": "hixcroo",
        "score": 452,
        "subreddit": "stocks",
        "created": 1635826993.0
    },
    {
        "author": "qwerkya",
        "body": "They matter in the grand scheme of things. \n\nBecause no one can predict what happens short term, but long term fundamentals will matter on whether the stock goes up or recover if they drop in short term\n\nLike i would probably still be happy to hold msft or goog if they drop 50%, but not Rivian",
        "created_utc": 1636888920,
        "id": "hkkr5fa",
        "score": 432,
        "subreddit": "investing",
        "created": 1636917720.0
    },
    {
        "author": "InquisitorCOC",
        "body": "$AAPL, $GOOG, $MSFT, Semiconductors, and $TSLA are doing well regardless of COVID",
        "created_utc": 1637993407,
        "id": "hm8v04m",
        "score": 300,
        "subreddit": "stocks",
        "created": 1638022207.0
    },
    {
        "author": "Fwellimort",
        "body": "MSFT.\n\nThe future is Computer Science.\n\nWhat computer do vast majority of people use to learn a skill? Windows (MSFT)\n\nWhere do people code? VS Code (MSFT)\n\nWhere do people upload code? Github (MSFT)\n\nWhere do people find jobs after learning to code? LinkedIn (MSFT)\n\nWhere do people use office tools at work? Office 365 Word/Excel/PowerPoint/Outlook (MSFT)\n\nWhat device do people use after work? XBox (MSFT)\n\nWhat game do young kids play while their parents are at work? Minecraft (MSFT)\n\nThere is a reason why most hedge funds have MSFT in their portfolio. It's a phenomenal company. It's also one of the two ONLY companies in the US to have AAA rating from Moody's. Not even Google or Apple has this rating. Just Microsoft and Johnson &amp; Johnson and Johnson &amp; Johnson might lose its AAA rating in the near future.\n\nThe other moat to me is Google. All these 'autonomous vehicle' or whatever use Google Maps. And everyone lives and breathes on Youtube (Google) or Twitch (Amazon).",
        "created_utc": 1637602871,
        "id": "hlnv1mm",
        "score": 242,
        "subreddit": "stocks",
        "created": 1637631671.0
    },
    {
        "author": "foxcorp26",
        "body": "1800 MSFt and 1200 AAPL\nBut yes",
        "created_utc": 1635802973,
        "id": "hixofyn",
        "score": 217,
        "subreddit": "stocks",
        "created": 1635831773.0
    },
    {
        "author": "Ozzy4253",
        "body": "Bill Gates would be worth $1.2 trillion if he still had his Microsoft shares.\n\nInstead, he became best friends with Warren Buffett and decided to diversify his portfolio.\n\nHe is worth only $136 billion today.\n\nDiversification is for pussies.",
        "created_utc": 1635971117,
        "id": "hj7126u",
        "score": 183,
        "subreddit": "wallstreetbets",
        "created": 1635999917.0
    },
    {
        "author": "ktempo",
        "body": "VTI! I only got NVDA and AMD because of how obsessed I am with computers, and when I built my first computer back in 2015 I learned about NVDA + AMD and just how powerful / great they could be. Other than NVDA, only MSFT and AAPL are the only other singular stocks I own. For now, at least.",
        "created_utc": 1637185259,
        "id": "hl1gtrl",
        "score": 179,
        "subreddit": "stocks",
        "created": 1637214059.0
    },
    {
        "author": "QuantityAccording750",
        "body": "Msft. Their price increase will be taking effect shortly",
        "created_utc": 1635799546,
        "id": "hixg5g9",
        "score": 175,
        "subreddit": "stocks",
        "created": 1635828346.0
    },
    {
        "author": "ALL_GRAVY_BABY",
        "body": "They missed CRM (Salesforce). Missed Cyber Security (Palo Alto, others). Missed cloud (Amazon, Microsoft) They appear to be making some inroads in AI, but to be determined. \n\nThey got bamboozled by Bill Gates into giving up on software. Company hasn't been top shelf for 25 years.",
        "created_utc": 1636001300,
        "id": "hj8vo21",
        "score": 161,
        "subreddit": "stocks",
        "created": 1636030100.0
    },
    {
        "author": "ffsudjat",
        "body": "MSFT will definitely go up; or down, or sideway.",
        "created_utc": 1635789495,
        "id": "hiwrfe1",
        "score": 159,
        "subreddit": "investing",
        "created": 1635818295.0
    },
    {
        "author": "P9812015",
        "body": "This is a really poor decision by Microsoft. Some of us care not to share information with the FB data thieves.",
        "created_utc": 1636756596,
        "id": "hke0lwv",
        "score": 146,
        "subreddit": "stocks",
        "created": 1636785396.0
    },
    {
        "author": "someonesaymoney",
        "body": "Slow and safe grind up.  I sleep well with a very large portion of my net worth in MSFT.  It's like a mini-ETF unto itself.  Pays a healthy dividend too if you're into that.\n\nCEO's great.  He doesn't try to start shit like the Zuck or Timmy Apple.  He single handedly took the crap that Balmer left him and turned the ship around with his vision.\n\nAzure still has room to grow, which is insane to comprehend if you're not in the industry.\n\nUbiquitous use of the largest suite of productivity SW in the world.\n\nThey haven't even really started with any big gaming moves so anticipate some news there eventually.\n\nWhat's not to love?  This jump after last earnings was insane and has blown past my own expectations to the point I let some shares get called away with some covered calls I wrote.  It's almost like meme stock movement, but with the GDP equivalent movement greater than that of small countries.",
        "created_utc": 1637115102,
        "id": "hkxp1xt",
        "score": 145,
        "subreddit": "ValueInvesting",
        "created": 1637143902.0
    },
    {
        "author": "high_roller_dude",
        "body": "growth stocks. esp mid cap tech, before they moon. \n\nFeb of 2020, my account was at $300k at the peak. then covid happened and things went to hell in March 2020. at the trough my account dipped to $200k.\n\nas of today my account is north of $900k. how did i get there? mix of mega cap (msft) and a basket of mid cap tech (net, crwd, se, mdb, etc)\n\nalways be on the look out for promising young companies whose market cap is less than $20B. barbell that with some safe assets like msft. \n\nembrace risk, and learn to live with volatility. that is what i can tell you. good luck",
        "created_utc": 1635815916,
        "id": "hiyhs1v",
        "score": 143,
        "subreddit": "stocks",
        "created": 1635844716.0
    },
    {
        "author": "stevejobswasmurdered",
        "body": "the market is so disoriented right now. it's insane how casually we're throwing around 100B valuations. Tesla is a great company that has a strong future but it is not worth $1 Trillion+, almost a HALF of AAPL and MSFT that sell hundreds of millions of product/services a year with disgusting margins.",
        "created_utc": 1636835998,
        "id": "hkhyr2i",
        "score": 140,
        "subreddit": "stocks",
        "created": 1636864798.0
    },
    {
        "author": "congmingdexigua",
        "body": "I bet my white mini Schnauzer that there won't be hyper inflation in 2022... please check what that word actually means.\n\nTo your question: Apple if you love the car and chip story, nvidea, msft and meta if you believe the meta story. In short: Same as last year and the year before. \nAmazon will probably also do something where people stare.\n\n Ironically, I don't own any of them as individual stock as my idiot brain thinks they are overpriced.",
        "created_utc": 1636810389,
        "id": "hkge4yv",
        "score": 124,
        "subreddit": "stocks",
        "created": 1636839189.0
    },
    {
        "author": "Gobra_Slo",
        "body": "$1500 per share is almost 5 times what it's worth now, that would make NVidia a **$4 trillion** company. That's a bit less that Microsoft and Apple combined (with their current valuations).\n\n$1000 a share will be about tripling, making NVidia as big as Apple or Microsoft. So far earnings (Q3 2021): NVidia $7.1B, Microsoft $41.7B, Apple $83.4.\n\nHow much do you expect NVidia to grow and in what areas specifically?",
        "created_utc": 1637522429,
        "id": "hljmhw6",
        "score": 122,
        "subreddit": "stocks",
        "created": 1637551229.0
    },
    {
        "author": "babydragon89",
        "body": "both AAPL and MSFT.\n\nAAPL f*cks up all other ad platforms from ios 14 and now their ad revenue increase by 3x. \n\nMSFT is just a beast, just steadily increasing..",
        "created_utc": 1635803097,
        "id": "hixoqgx",
        "score": 117,
        "subreddit": "stocks",
        "created": 1635831897.0
    },
    {
        "author": "creamonyourcrop",
        "body": "Market cap is so high, Rivian would have to become the third largest automobile company in a relatively short period for this to be relevant.  What would it take for that to happen?  \nMicrosoft was transformative in a new industry, Wallmart took advantage of a massive change in how we purchase.  Electric cars are not so different from electric cars, every car company is already working on electrics, just not seeing the end of this coming out that rosy for Rivian.",
        "created_utc": 1637084569,
        "id": "hkvmql5",
        "score": 114,
        "subreddit": "stocks",
        "created": 1637113369.0
    },
    {
        "author": "Keudn883",
        "body": "Isn't that true for any emerging market stock? Much different from say an established company like Microsoft or Walmart.",
        "created_utc": 1637083029,
        "id": "hkvirpo",
        "score": 108,
        "subreddit": "stocks",
        "created": 1637111829.0
    },
    {
        "author": "WOW_SUCH_KARMA",
        "body": "Not wrong, but $SPY is being propped up by like 5 or 6 tickers while the vast, vast majority of individual companies have been blood red for the past few weeks-months. Large cap bloat is very, very real right now.\n\nTaking out just $TSLAs 'performance' this quarter and $SPY is somewhere in the $450 range. Take out $NVDA and it's down another $10. Traders who have been picking individual stocks outside of $TSLA, $NVDA, $MSFT and $AAPL have absolutely been getting murdered for a while now. Which is a lesson in itself that $SPY truly is one of the best buy and hold investments you can make.",
        "created_utc": 1637769255,
        "id": "hlwvl67",
        "score": 108,
        "subreddit": "stocks",
        "created": 1637798055.0
    },
    {
        "author": "DuCWulf",
        "body": "I second MSFT. They are the wfh software solution for business and consumers. Plus tackle gaming too.",
        "created_utc": 1637995920,
        "id": "hm8ypab",
        "score": 108,
        "subreddit": "stocks",
        "created": 1638024720.0
    },
    {
        "author": "ThePartyLeader",
        "body": "AAPL for shorter investment. They are making good use of design updates and Apple silicon should continue to be good IMO.\n\nMSFT for long long hold. They have the best diversity of projects and I think therefore the best growth opportunity.\n\nFB will benefit from Meta brand short term but there company seems to be imploding at times so I just wouldn't personally.",
        "created_utc": 1635797899,
        "id": "hixc0sj",
        "score": 105,
        "subreddit": "stocks",
        "created": 1635826699.0
    },
    {
        "author": "Banabak",
        "body": "There is so much carnage in high flying tech stocks holy shit \n\nZillow and peloton down 75% from all time high this year \n\nPayPal -38% I think ? \n\nTelodoc -60%\n\nDraft kings , palantir , zoom , Twitter , snap , chewy, lift \n\nYou wouldn’t know if you just followed where index prices are because market as whole  and large cap tech having a fantastic year \n\nIf you ever wonder why a lot of people say “ just buy VTI” it’s Because of years like this where last year hot  trades can go out of favor with the same speed they run up\n\nTotal market index up 25% \n\nMsft 55%\n\nApple 24.75%\n\nFor comparison",
        "created_utc": 1637729786,
        "id": "hlv4gkr",
        "score": 105,
        "subreddit": "investing",
        "created": 1637758586.0
    },
    {
        "author": "TellYaMotha",
        "body": "FB  \n\nAAPL  \n\nGOOGL  \n\nMSFT  \n\nAMZN  \n\nNFLX  \n\nWith our powers combined we are FAGMAN!",
        "created_utc": 1637357308,
        "id": "hlb2wa6",
        "score": 103,
        "subreddit": "wallstreetbets",
        "created": 1637386108.0
    },
    {
        "author": "SirNamesAlotx",
        "body": "I started out with $500, I picked Tesla and Microsoft, got to almost 5k, then I picked calls for snap, sq, pltr, wen, and now baba, I have $4 left in my account.\n\nFuck everything",
        "created_utc": 1637242768,
        "id": "hl4ah71",
        "score": 102,
        "subreddit": "wallstreetbets",
        "created": 1637271568.0
    },
    {
        "author": "EtadanikM",
        "body": "Makes sense, Apple's primary business is phones, computers, and other electronics, and in case you haven't noticed, there's a serious chip supply chain issue at the moment.\n\nMicrosoft and Google, by contrast, are mostly software companies - their electronics are a side business.",
        "created_utc": 1636162591,
        "id": "hjhw0z0",
        "score": 98,
        "subreddit": "stocks",
        "created": 1636191391.0
    },
    {
        "author": "Terbmagic",
        "body": "You are following my exact portfolio.\n\nI have a mix of\n\n 20% nvidia\n\n20% amd\n\n10% Microsoft \n\n10% apple\n\n40% VOO\n\nI've been adding every month for the past 5 years.",
        "created_utc": 1637187574,
        "id": "hl1meic",
        "score": 98,
        "subreddit": "stocks",
        "created": 1637216374.0
    },
    {
        "author": "ProteinEngineer",
        "body": "A bit ridiculous to think Apple is specifically targeting Facebook as opposed to all third party apps. \n\nI do think the metaverse concept seems like a terrible video game and Facebook is much more vulnerable to competitors than Amazon, Microsoft, google, and Apple.",
        "created_utc": 1635804256,
        "id": "hixrhai",
        "score": 89,
        "subreddit": "SecurityAnalysis",
        "created": 1635833056.0
    },
    {
        "author": "SpaceBollzz",
        "body": "Most traders lose money, if you invest long term probably most of us make money\n\nI've done a few short term trades but nearly everything I have goes into growth stocks, and it's shares so you never really lose any money unless you sell at a loss or the company goes bust\n\nSorry to hear of your situation, I'd advise staying away from trading options and instead buy shares in something like MSFT and watch the money increase slowly and collect a few dollars in dividends. I know it's boring but I think boring sounds good for you right now",
        "created_utc": 1636671273,
        "id": "hk9g2jm",
        "score": 84,
        "subreddit": "stocks",
        "created": 1636700073.0
    },
    {
        "author": "high_roller_dude",
        "body": "winners will keep winning. \n\nNVDA, SE, NET, CRWD, MSFT, ADBE, CRM, NOW are absolute studs. \n\nI personally hold large positions in all of above except NVDA. Been watching NVDA for several yrs but never got in and the stock has run away from me.\n\nReally hated and dumped on stocks that have decent upside potential once sentiment turns around: PINS, TDOC. I am a bagholder in these 2 lol",
        "created_utc": 1637802312,
        "id": "hlz4rbz",
        "score": 82,
        "subreddit": "stocks",
        "created": 1637831112.0
    },
    {
        "author": "meta-cognizant",
        "body": "It was definitely a better time. It also wasn't just pure memes that made the front page prior to then. There was solid DD on solid plays, like anything related to GAN, JNUG, MU $100c, MSFT $200c, and SPY puts in April 2020.",
        "created_utc": 1637726139,
        "id": "hluxjte",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1637754939.0
    },
    {
        "author": "SirGlass",
        "body": "I am usually in favor of spin offs; however I do not know much about this to have an opinion.\n\nMy very un-popular opinion is Amazon should be split between AWS and everything else. My main reasoning is Amazon on the retail side just competes with too many businesses , retail, shipping, logistics, grocery , media . \n\nMany companies looking for cloud computing may not want to give money to a competitor and may opt to go with MSFT or another provider, not really because they may or may not be a better service but you just don't want to throw money at your competition and amazon is competing with a whole lot of other businesses",
        "created_utc": 1636478918,
        "id": "hjyj186",
        "score": 80,
        "subreddit": "investing",
        "created": 1636507718.0
    },
    {
        "author": "Gooch204",
        "body": "AMZN, GOOG, MSFT, NVDA",
        "created_utc": 1637603550,
        "id": "hlnwsjd",
        "score": 79,
        "subreddit": "stocks",
        "created": 1637632350.0
    },
    {
        "author": "mistaowen",
        "body": "I think Pinterest has potential to be a sleeper giant.  They aren’t social media but rather a search engine like google where ads are for what YOU actually want.  They aren’t impacted by apple iOS ad policy update. They’re in the beginning stages of learning how to monetize their users.  Solid companies like Microsoft and PayPal have done some legit investigations into acquiring them so they know the potential for what they can become.  They’re very beaten up currently but I think they’ll balance out soon and go back up once WS understands their financials better.",
        "created_utc": 1637865199,
        "id": "hm29mz6",
        "score": 72,
        "subreddit": "stocks",
        "created": 1637893999.0
    },
    {
        "author": "xAragon_",
        "body": "3000 MSFT and 0 AAPL but yes",
        "created_utc": 1635806931,
        "id": "hixxmae",
        "score": 71,
        "subreddit": "stocks",
        "created": 1635835731.0
    },
    {
        "author": "el_dude_brother2",
        "body": "Doesn’t seem like a smart move by Microsoft. Why let Meta into your infrastructure, what do they gain from that?",
        "created_utc": 1636770878,
        "id": "hkeuao3",
        "score": 69,
        "subreddit": "stocks",
        "created": 1636799678.0
    },
    {
        "author": "Mysterious----",
        "body": "Best part is you can’t say market isn’t built on only speculation when MSFT quarterly growth in EPS Was less than 4% but it’s share price is up 17% quarter over quarter and its revenue is down. It’s all cash injected growth from the fed pumping market prices. Inflation hasn’t even hit Main Street. Wait until the 2.5x leveraged markets deleverage and the money hits. Add on the great resignation and worker shortages which will eat into corporations margins, supply chain issues, and the housing market crisis slowly unfolding. There is no way the SPY doesn’t hit $500 EOY.",
        "created_utc": 1635921358,
        "id": "hj4a0ru",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1635950158.0
    },
    {
        "author": "r2002",
        "body": "Microsoft for sure.\n\n* It is the number two cloud company in the world.\n* People have to use Office regardless if they're in the office or working from home.\n* Companies need cybersecurity. \n* Companies need automation of repetitive office tasks. Microsoft is developing software to compete against software robot firms.\n* Gaming via Xbox.\n* Microsoft has a military contract for development of Augmented Reality glasses (kinda small just $480 million).\n* Microsoft cloud is helping companies build better manufacturing processes. \n\nMicrosoft has the added advantage of cross-selling. Once you buy their cloud, you will be enticed to buy their cybersecurity, and then maybe their automation software, and then maybe their CRM software, or their online meeting package, etc. Neither Amazon or Google has this \"foot in the door\" advantage.\n\nUnlike Amazon who needs to spend lots of money on their cut-throat retail business, most of Microsoft's products are delivered via the cloud.",
        "created_utc": 1637994494,
        "id": "hm8wml8",
        "score": 68,
        "subreddit": "stocks",
        "created": 1638023294.0
    },
    {
        "author": "Banabak",
        "body": "No one talks that rates are at the floor , where else you will put money if you investor ? 10 year at 1.6% or let’s say msft with high PE but paying dividend , doing buybacks and still growing business? \n\nDiscount rate on NR of the most important driving factors Bevause all asset classes compete with each other",
        "created_utc": 1636039726,
        "id": "hjajmrw",
        "score": 66,
        "subreddit": "stocks",
        "created": 1636068526.0
    },
    {
        "author": "FinndBors",
        "body": "People retire, people have to liquidate. Almost everyone can't hold forever.\n\nAnd you are mentioning individual stocks like Microsoft and Apple. Yeah they are killing it right now. But they won't be forever. Just look at top companies throughout the decades. In 30 years, Apple might deteriorate into a Kodak. Microsoft might deteriorate into an IBM.",
        "created_utc": 1636651614,
        "id": "hk8434j",
        "score": 66,
        "subreddit": "stocks",
        "created": 1636680414.0
    },
    {
        "author": "corgi_on_a_treadmill",
        "body": "$70,000 in MSFT, $10,000 in SPY, ended the day +$1.00. Time to hit Dollar Tree 😎\n\nAlso fly Delta fly. Save my dumbass 1/21 60C.",
        "created_utc": 1636143111,
        "id": "hjgkotd",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1636171911.0
    },
    {
        "author": "bearhunter429",
        "body": "Just fucking delist everything besides FAANG + MSFT + TSLA + NVDA + AMD already.",
        "created_utc": 1637269404,
        "id": "hl63xfn",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1637298204.0
    },
    {
        "author": "B1llythk1d",
        "body": "I can't help like feeling this will end badly. Maybe not with Microsoft, but eventually.",
        "created_utc": 1637787582,
        "id": "hly66wm",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1637816382.0
    },
    {
        "author": "MustNotFapBruh",
        "body": "Lol I think Microsoft alone can handle most of these potential",
        "created_utc": 1637182873,
        "id": "hl1azk1",
        "score": 54,
        "subreddit": "investing",
        "created": 1637211673.0
    },
    {
        "author": "Frunk2",
        "body": "Microsoft is embedded into every office and every house with both software and hardware protected by layers and layers of code. It may not grow fast but it is very unlikely that it will lose market dominance in the near future",
        "created_utc": 1637112883,
        "id": "hkxjybu",
        "score": 54,
        "subreddit": "ValueInvesting",
        "created": 1637141683.0
    },
    {
        "author": "-Sliced-",
        "body": "The counter argument is that in comparison to some of its tech counterparts, the numbers look much worse.\n \nLet's do a quick comparison against GOOGL (Google on the left):\n\n- P/E: 28.49 vs 37.98. Google win (is priced more cheaply)\n- YoY Revenue growth: 41% vs 22%. Google win (has been growing consistently faster) \n- Operating Margin: 30.3% vs 42%. Google win (very similar companies, Google has more room to improve its margins, while MSFT is already at a very high level and in alignment with FB)\n- Moat: Google has search, Android and YouTube with very strong moats (i.e. 20 years horizon). Microsoft has already been losing market share on Windows. office suites, and gaming for a while. On Azure it's growing at a similar rate to Google Cloud for the past couple of years. Overall Google wins with a far stronger hold on its market\n- Innovative upside: Google has a few bets in its arsenal that could potentially become huge such as self-driving cars, drone delivery, and even the hardware business (e.g. the new Pixel lineup is finally considered competitive vs the iPhone, which could become a huge business as Apple has proven). Microsoft has been consistently failing to expand to new areas.\n- Regulatory risk: That's the only place where a Microsoft investment is better position vs Google, precisely because of Google's strong hold of its markets.\n\nI'm happy to hear counter arguments, but overall it's hard for me to find MSFT as a more attractive investment than Google on almost all fronts. This is a clear sign for me that MSFT is (relatively) overvalued for what it offers right now.",
        "created_utc": 1637125374,
        "id": "hkyadta",
        "score": 53,
        "subreddit": "ValueInvesting",
        "created": 1637154174.0
    },
    {
        "author": "midlifedisaster",
        "body": "Fuckin Pelosi.  She just stands out with her and hubby buying Microsoft right before they announced that Microsoft got a big govt contract. Or the fed presidents get busted for trading on inside information. They say sorry and retire.  \n\nFuck every last one of them.",
        "created_utc": 1636229190,
        "id": "hjl9ebk",
        "score": 53,
        "subreddit": "stocks",
        "created": 1636257990.0
    },
    {
        "author": "UnObtainium17",
        "body": "GOOGL MSFT AAPL are probably the only 3 companies i've never regreted buying at ATH.",
        "created_utc": 1636039065,
        "id": "hjahx8h",
        "score": 49,
        "subreddit": "stocks",
        "created": 1636067865.0
    },
    {
        "author": "Khatib22",
        "body": "Just wanted to share my experience too. I fully agree - after seeing all the gains on this sub from FDs (weeklies) it's kind of hard not to feel like \"F it, I wanna make some money too\" and YOLO your money in - VERY BAD DECISION. It would be hard for me to pay attention at work and school since my mind would just be focused on trying to chase gains and praying that my portfolio wouldn't be red. Then, I eventually lost like $4k in total. It was initially hard to stomach the loss but I had to just accept it as a learning lesson. \n\nI also just wanted to say I fully agree with you on the LEAPS in safe companies. 80% of my portfolio is stocks and 20% LEAPS. LEAPS are great ways to control more of a stock with less money and I make sure to only buy LEAPS on great fundamental companies (NVDA and AMD) but am planning to buy some SPY GOOGL and MSFT LEAPS that you mentioned as well.\n\nI just want to say that I actually sleep better now and my quality of life is MUCH better. I realized I just couldn't handle the stress of 90%+ swings in my portfolio without being glued to it or worrying \"IS IT TIME TO SELL?\" LEAPS and shares remove all of that because they don't really have an \"expiration.\" Shares are unlimited and LEAPS are like 2-3 years out so there's no rush to feel like: THE STOCK HAS TO RALLY 20% in a day, all you have to do is choose companies you have high conviction in and let them naturally make their way up.",
        "created_utc": 1636154484,
        "id": "hjhds40",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1636183284.0
    },
    {
        "author": "UltimateTraders",
        "body": "I wish you can just buy and forget but I'd say at least 4x each year a stock should be checked again...after each earnings report..\n\nHindsight is 20/20 and everyone can say aapl, goog, Amazon, FB it isnt meta yet, msft...but we have to look forward\n\nSo for retirement if you are passive I'd say split your money in 3 ETFs\n\nSp500, NASDAQ 100 and Russell 1000\n\nIf it has to be stocks if say aapl, goog and msft",
        "created_utc": 1636162846,
        "id": "hjhwkov",
        "score": 48,
        "subreddit": "stocks",
        "created": 1636191646.0
    },
    {
        "author": "ShaquilleMobile",
        "body": "Lol it's so weird for me as a lawyer to hear how people talk about tax lawyers. \n\nIn our field, tax lawyers are like rockstars... And I'm saying this as a criminal defender.\n\nThey often have really exciting slogans and branding, Tom Cruise played a tax lawyer in *The Firm,* tax lawyers are always these guys who have \"the look\" (i.e. Tom Cruise in *The Firm*), they make tons of money, and they deal with high-flying corporate clients. \n\nIronically, this interaction with huge MNCs often means that they are strictly prohibited from investing any money whatsoever in single stocks due to insider trading rules.\n\nMy buddy is a tax lawyer at one of the biggest accounting/financial companies in the world, and he is always saying he wishes he could tell me what is going on with some companies, and it drives me nuts. I'm literally shaking when he says this stuff, worried I'm going to lose my ass on MSFT or something insane like that.\n\nAnyway, he is very savvy with money, but he is one of the people who definitely does *not* do what an accountant does. Mostly tries to find ways for gigantic corporations to exploit unfair laws and avoid liability, or high stakes tax litigation. Maybe your ex was different, but this stuff is not overlooked among my fellow lawyers.",
        "created_utc": 1636823898,
        "id": "hkh6cyk",
        "score": 48,
        "subreddit": "investing",
        "created": 1636852698.0
    },
    {
        "author": "hexydes",
        "body": "This is *exactly* why you invest in infrastructure and innovative industries during the good times. We need our computer/Internet revolution of the 21st-century. We ran into this in the 1970s-80s too, where inflation was high, wage growth was low, and economic activity was treading water. Then we had the computer revolution with Microsoft, Apple, Cisco, Intel, and about 100 other players that pulled us through the 80s when rates were hiked way up. Then rates came back down to something reasonable (i.e. not 0%) and we had the Internet revolution with Amazon, AOL (lol I know), Google, Facebook, and others.\n\nBut *all of that* was made possible because we made big investments during the 40s-60s in things like computers, transistors, Arpanet, etc. These things take time to pay off, some of them don't pan out, but that's why you:\n\n1. Invest.\n2. Diversify.\n\nOver the last 40 years, the investment in infrastructure and basic research has been whittled away by the Republican party. They constantly gripe about \"socialism...or communism...one of them\" and not spending money. Then they turn around and spend $1 trillion on the War on Drugs and $3 trillion on wars in the Middle East. That's $4 trillion that could have gone to infrastructure investments. And then when the Democratic party tries to get $2 trillion in new infrastructure investments over a decade, suddenly it's back to \"THAT'S COMMUNISM AND WE CAN'T AFFORD IT!\"\n\nWe should be absolutely pouring resources into clean energy infrastructure, broadband access, and biomedical technology right now. And yet we have to sit here and watch Republicans (and two Democrats) sit on their hands and scream about \"NO COMMUNISM! TOO MUCH MONEY!\"\n\nClock is ticking for the US...",
        "created_utc": 1636390986,
        "id": "hjtnx3f",
        "score": 47,
        "subreddit": "investing",
        "created": 1636419786.0
    },
    {
        "author": "newnoisenetwork",
        "body": "NVDA had earnings in ‘15 and I saw it was an A-plus company, watched it climb from $19 to $30 and bought in. Only wish I had Jamie Dimon access to low-interest cash to have bought more. \n\nAMD was shakier, way back when, was $45, fell all the way to below $2, peps bought on the rumor it would be acquired. Then Lisa Su did her magic, and I bought in, but didn’t have the same conviction. I should have held esp after it climbed to $13 when it was added to the S&amp;P 500 index. &lt;~~~ that is a tell-tale sign to buy in.\n\nI hold the same conviction about MSFT and AAPL, both are trillion dollar co today. I can see CRSP being the future though it might require a more equal, robust society that could afford the tech in the first place. Too many financial terrorists keeping interest rates below zero for any price discovery or real growth to occur.",
        "created_utc": 1636603700,
        "id": "hk5v6xa",
        "score": 47,
        "subreddit": "stocks",
        "created": 1636632500.0
    },
    {
        "author": "Washedup11",
        "body": "Apple. Google. Microsoft.\n\nThey out budget everyone in R&amp;D. If a smaller company has some innovation they (AAPL, GOOG, MSFT) value - they often acquire them.\n\nThey’ll continue to dominate every in computers, phones, software, wearables, head phones, chrome books (schools won’t STOP giving students chromebooks), etc.",
        "created_utc": 1635993555,
        "id": "hj8hn82",
        "score": 47,
        "subreddit": "stocks",
        "created": 1636022355.0
    },
    {
        "author": "daynightcase",
        "body": "This. And whats even more mind boggling is TSLA is $1.3T and NVDA is $800B. So these are not a small cap companies. When you see absurd P/E of something like SQ, SHOP or even ZOOM. Those are tiny companies and even though its absurd, can still possible to grow. But being a trillion $ companies. How big can you even grow? At this rate either they are overpriced or MSFT, GOOG, AMZN and AAPL are underpriced. Because those 4 behemoth are generating 100s of million in revenue each quarter.",
        "created_utc": 1636045382,
        "id": "hjayccv",
        "score": 47,
        "subreddit": "stocks",
        "created": 1636074182.0
    },
    {
        "author": "kidcrumb",
        "body": "Even fundamentally GameStop is worth more than this. \n\nNFT.marketplace could generate hundreds of millions in revenue for GameStop (very conservative.estimate considering the success of open Sea.)\n\nIf GameStop uses their platform to buy/sell NFTs from reputable companies like Microsoft, Blizzard, Sony, etc. Then they'll generate a ton of value over the dumb meme avatars you get on open Sea. Pay 2 eth for an 8 bit drawing of a monkey is so stupid.",
        "created_utc": 1636053832,
        "id": "hjbjwxc",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1636082632.0
    },
    {
        "author": "cheesenuggets2003",
        "body": "If I had to go all in on one tech company it would be Google.\n\nMy e-mail address is with Google.  \nGoogle is the only company to which I pay a monthly subscription for non-gaming entertainment (YouTube Premium).  \nGoogle Maps is how I navigate.  \nGoogle Calendar is how I create my schedule.  \nGoogle Chrome is how I access my brokerage accounts, Reddit, Investopedia, and every other website for that matter.\n\nI'm not saying that Google is eternal, and any company can be valued too highly, but I just can't think of any other tech company which has changed my life so greatly since Microsoft.",
        "created_utc": 1637722102,
        "id": "hlup7uh",
        "score": 47,
        "subreddit": "ValueInvesting",
        "created": 1637750902.0
    },
    {
        "author": "slimkay",
        "body": "MSFT is more diversified than either FB or AAPL and is also more antitrust proof than them.\n\nNo brainer if you ask me...",
        "created_utc": 1635798064,
        "id": "hixcfv7",
        "score": 46,
        "subreddit": "stocks",
        "created": 1635826864.0
    },
    {
        "author": "masterfox72",
        "body": "I had this internal debate last year. I picked 100% AAPL. MSFT ended up better 😢",
        "created_utc": 1635813133,
        "id": "hiyblzd",
        "score": 46,
        "subreddit": "stocks",
        "created": 1635841933.0
    },
    {
        "author": "MustNotFapBruh",
        "body": "I love Microsoft and all my homies love Microsoft.",
        "created_utc": 1635806334,
        "id": "hixw9de",
        "score": 46,
        "subreddit": "stocks",
        "created": 1635835134.0
    },
    {
        "author": "Entire-Astronomer-86",
        "body": "Thank God I own Microsoft",
        "created_utc": 1637865542,
        "id": "hm2agso",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1637894342.0
    },
    {
        "author": "Blueasman",
        "body": "Go for solid companies that have been in business for long, are known names with solid results. Google, apple, Microsoft etc. Don’t go into the flavor of the week or month meme stocks. Keep a small portion for some newer upcoming companies.\n\nSo with that in mind, I say read up on the various suggestions on Reddit. There are some stocks that you’ll find are recommended again and again. Then look at Motley, MarketBeat or US news lists, yahoo finance on ‘top 10 stocks for “x reasons”. Example top 10 stocks to buy during inflation/ EV stocks/ growth stocks etc. You will find many listed are commonly recommended across all the sites. Same goes for ETFs. \nI started noting down the commonly recommended ones, and invest in those when opportunity arises.",
        "created_utc": 1636920021,
        "id": "hkmmy45",
        "score": 45,
        "subreddit": "stocks",
        "created": 1636948821.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "These threads are always people mentioning the stocks they're bagholding\n\nThe next great tech stock probably is already a great tech stock like MSFT, FB, GOOGL, TEAM, CRM... but that will become even bigger and better\n\nNobody knows if U, AZPN, ASTS, IONQ is gonna be the next big think or the next money loser for WSB people and \"super smart investors\" like we are, the nerds that spent all day scrolling on Reddit",
        "created_utc": 1637406764,
        "id": "hldh89u",
        "score": 45,
        "subreddit": "stocks",
        "created": 1637435564.0
    },
    {
        "author": "oarabbus",
        "body": "Holy shit, you were not kidding. \n\nIs this the largest % gain of any stock in the last 50 years? \n\nApple and MSFT are ~400,000% return since their IPO. Home Depot is 4x that. Truly staggering",
        "created_utc": 1637729437,
        "id": "hlv3tyg",
        "score": 43,
        "subreddit": "stocks",
        "created": 1637758237.0
    },
    {
        "author": "Actually-Yo-Momma",
        "body": "Buy the dip on big stocks like Microsoft i completely agree with. You have to evaluate the company you’re buying the dip on i guess lol",
        "created_utc": 1636417613,
        "id": "hjvgpsm",
        "score": 41,
        "subreddit": "stocks",
        "created": 1636446413.0
    },
    {
        "author": "EmbiidWeTrust",
        "body": "Seriously asked a dude I work with what his financial advisor buys for him. He said Amazon, MSFT and stuff like that… I was shocked someone gets paid for common sense buying or blue chip stocks",
        "created_utc": 1636765784,
        "id": "hkejymq",
        "score": 41,
        "subreddit": "stocks",
        "created": 1636794584.0
    },
    {
        "author": "Brief-Garbage",
        "body": "PayPal, Activision, SoFi, more MSFT, more GOOGL. Go long until I give you the signal.",
        "created_utc": 1637776036,
        "id": "hlxcrze",
        "score": 40,
        "subreddit": "stocks",
        "created": 1637804836.0
    },
    {
        "author": "ScareOffEverything",
        "body": "Yeah I still think Tesla is like the Microsoft story of 1999-2000. Great company. Great tech. Disruptive technology. Change the world. 20 years of growth already priced in and when the market realizes it, the stock will drop 50% and not reach ATH for another 15 years, making the shareholders bag holders.\n\nJust because it’s a great company with great technology that changes the world, doesn’t mean the stock price is right.\n\nThat said, I’m not shorting it. I’ve seen what happens. I see these cultists out here with their stimulus checks and their $15 an hour Wendy’s checks paying no rent in their wife’s boyfriends house. I’m not playing that game. I’m not a gay bear.\n\nBut that said, good luck with this $2000 Tesla price you think is coming or whatever. Hope you do get rich, really. But I’m too old not to see the Microsoft all over this stock.",
        "created_utc": 1636601546,
        "id": "hk5qs8a",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1636630346.0
    },
    {
        "author": "aids333333",
        "body": "Apple, Microsoft, Google. \nIt’ll take nuclear fallout for them to stop growing",
        "created_utc": 1637611392,
        "id": "hlogggi",
        "score": 39,
        "subreddit": "stocks",
        "created": 1637640192.0
    },
    {
        "author": "Competitive_Ad498",
        "body": "I always have fb and Msft calls when the market is bullish. It’s a no brainer play.",
        "created_utc": 1636769176,
        "id": "hkeqthx",
        "score": 37,
        "subreddit": "stocks",
        "created": 1636797976.0
    },
    {
        "author": "AMGsoon",
        "body": "No. Look at Apple, Microsoft, Google. Much bigger companies yet still grow like crazy.",
        "created_utc": 1637264205,
        "id": "hl5qq3e",
        "score": 36,
        "subreddit": "stocks",
        "created": 1637293005.0
    },
    {
        "author": "123archer",
        "body": "This is a tricky question. I own the usual suspects AAPL MSFT GOOG AMZN etc. But I wouldn't call them value today. Given they are already at trillions in valuation, I think the upside is limited in the short term. What I mean by that is that I don't expect AAPL to double to 320 in the next 2 to 3 years. \n\nSo with that, here are my 5 I consider to be value *today*. These are not the hold for rest of your life, but I think have decent upside or downside protection for the next 3 to 5 or so years. I don't expect any to be a 10 bagger or anything like that any time soon. \n\nAlso, I have been wrong before and there is a fair chance, I am wrong with one or all of these. :) Would love to hear your thoughts.  \n\nVIAC: I think this is severely undervalued. Sure cable is dying, but I believe the speed at which is overestimated. VIAC has strong content; many of the top TV shows are VIAC. Nickelodeon is must have for kids with Paw Patrol, Blues Clues, SpongeBob etc. Pluto TV is expected to bring in 1 billion dollars in 2021. They are selling hard assets and I think getting ready to be acquired. \n\nFor fun, read about Archegos if you don't know. \n\nT: this one is an odd ball. I think it is what Burry would call an ick investment. Almost made me hold my nose when I bought some last week. T has lagged the market for many years. Their dividend cut after Warner spinoff didn't sit well with existing shareholders. But I think T offers good downside protection at today's prices. Partly due to the spin off of Warner where T stock holders will get 71% of the new co. I think in terms of content DISC + Warner can compete with NFLX and Disney. \n\nVRTX: I will start by acknowledging that there is always a lot of uncertainty with bio tech companies. VRTX has a strong monopoly in cystic fibrosis and it is growing (although at a slower rate), it has strong free cash flow and has a rock solid balance sheet, and has a decent pipeline. VRTX focuses on rare diseases, so the pipeline drugs are longshot. But thats the risk. The market is currently discounting the pipeline all together it seems. If any one is successful, this has the potential to go to the moon (as they say). Patience is the name of the game with VRTX though. It will be 2023 to 2024 for any of the pipeline drugs to be successful. \n\nLMT: Solid industrial play. Good dividend.  They had a poor Q3, causing a price drop. This is a buying opportunity in my opinion. \n\nMKL: I only recently learned about this. I have a very small position, but I am reading and understanding them more. In short, they have been called mini Berkshire. The management has said all the right things and follow the Buffet investing philosophy in my opinion. Not many know about this company, so adding it to the list. \n\nWould love to hear your thoughts about these.",
        "created_utc": 1637550001,
        "id": "hlldjdq",
        "score": 36,
        "subreddit": "ValueInvesting",
        "created": 1637578801.0
    },
    {
        "author": "animositisomina35",
        "body": "🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡\n\nYahoo refused to buy Google for $1 million in 1998\n\nYahoo refused to buy Facebook for $1.1 billion in 2006\n\nYahoo refused to sell itself to Microsoft for $44.6 billion in 2008\n\nVerizon acquired Yahoo for $4.6 billion in 2017\n\n🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡",
        "created_utc": 1637550144,
        "id": "hlldtsl",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1637578944.0
    },
    {
        "author": "Shulgin46",
        "body": "Aren't you concerned that the bulk of their rapid growth has already happened? I can see them as being relatively safe, as a company, but further big growth might be challenging for them to do. Don't get me wrong, I think MSFT has been a great investment and is a good hold, but it's a bit pricey for me to see value in buying in right now. \n\nTSLA is a hard no for me right now. Very cool company and I hope they do really well in the long term, but the current value of their stock won't realistically match the value of the company for a long time. I think there is too much potential downside at this price.",
        "created_utc": 1638023587,
        "id": "hm9zha5",
        "score": 35,
        "subreddit": "stocks",
        "created": 1638052387.0
    },
    {
        "author": "porncrank",
        "body": "You missed the point of the timeline — the private sector (Apple, Microsoft, Cisco, Intel) was made possible by decades of government investments that were not directly profitable at the time (computers, transistors, arpanet). The relationship played out again with NASA and SpaceX — there would be no market for SpaceX if NASA hadn’t spent millions creating a viable market for satellites.\n\nSo what unprofitable endeavor is the government putting money into now that will pay off for the country in 20 years? The private sector can not and will not work unprofitably on such a long timeline, which is what government spending is all about.",
        "created_utc": 1636393265,
        "id": "hjttoe2",
        "score": 35,
        "subreddit": "investing",
        "created": 1636422065.0
    },
    {
        "author": "gnnr25",
        "body": "Apple was part of the old guard (IBM, Microsoft, Solaris, Novell, etc)",
        "created_utc": 1637178084,
        "id": "hl0z2a7",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1637206884.0
    },
    {
        "author": "Proffesssor",
        "body": "No doubt. And associating your brand with a toxic company. Really got me concerned about continuing to hold so much microsoft.",
        "created_utc": 1636785255,
        "id": "hkfj07b",
        "score": 34,
        "subreddit": "stocks",
        "created": 1636814055.0
    },
    {
        "author": "UnObtainium17",
        "body": "My thought was sell all of it and split into NVDA, AMD, AAPL, MSFT. and sleep well.",
        "created_utc": 1637462423,
        "id": "hlgo3fd",
        "score": 34,
        "subreddit": "stocks",
        "created": 1637491223.0
    },
    {
        "author": "blissrunner",
        "body": "Ever since ARKX in 2021... I'm beginning to doubt even in a pragmatic/thematic level. By far the worst ETF by Cathie (there was the SPCE deals... and since there's no space stocks, it's just defense)\n\nAnyways... ARKK (-33%)/G(-42%)/W(-25%)/F(-25%) is suffering since:\n\n* the flagship \"K\" was heavy on TDOC, ZM, Z, PLTR + Genomics... that went bad/dumped in 2021; and surprisingly Wood keeps averaging down (buy high, sell low) while it continues to go REDDD..\n   * Not enough stable value &amp; growth stocks like FANG+ which is rocking\n   * And also a lot of weird picks... like: TWTR, SNAP, why robinHOOD?\n* This is notice-able with ARKQ suffering the least at -16%:\n   * It has the most TSLA... with quality value/growth picks like Trimble, Unity, Deere, Caterpillar, Intuitive Surgical, Google finally, BYD etc.\n\nAnyways... I'm surprised thematically Cathie doesn't make an **ARKV (Virtual Reality) with a V** (a lot more pragmatic than ARKX).\n\n* Idk why she doesn't hold FANG+ like it's a sin or something. Holding the big four GOOGL, AAPL, MSFT, Meta and supporting's like AMD, NVDA, Unity, TSM, Samsung etc would've  been better (although in hindsight)",
        "created_utc": 1637765456,
        "id": "hlwmg8p",
        "score": 33,
        "subreddit": "stocks",
        "created": 1637794256.0
    },
    {
        "author": "Misaiato",
        "body": "MSFT Azure is a very serious threat to AWS.",
        "created_utc": 1636896079,
        "id": "hkl2av9",
        "score": 32,
        "subreddit": "stocks",
        "created": 1636924879.0
    },
    {
        "author": "ManPearTwig",
        "body": "I can't wait for that moment. The ultimate Black Friday.  \nMy first purchases would be MSFT, NVDA and GOOGL. They would be forming the core of my portfolio. Right now they are overpriced.",
        "created_utc": 1637412018,
        "id": "hldo24b",
        "score": 32,
        "subreddit": "ValueInvesting",
        "created": 1637440818.0
    },
    {
        "author": "ModernBuddha1",
        "body": "so why is the US gov, DoD, dept of commerce and treasury switching to BB Ai Cybersec after solarwind and not the US based companies like microsoft, crwd, S1, etc? \n\nAnd yes, in what sense is BB behind compared to the companies you stated. Be specific. The BB Ai Engine is the MOST mature off all their competition (7th Gen) and it prevents any ransomware attack while competition is reactive. \n\nThanks.",
        "created_utc": 1636224796,
        "id": "hjkzec8",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1636253596.0
    },
    {
        "author": "wearahat03",
        "body": "&amp;#x200B;\n\n||PE RATIO|Recent REV GROWTH|\n|:-|:-|:-|\n|PYPL|44.7|13%|\n|AAPL|25.9|29%|\n|MSFT|39.1|22%|\n|GOOGL|28|41%|\n|FB|23.5|35%|\n|AMZN|80|15%|\n|V|34.9|29%|\n|MA|44|29%|\n\nPYPL is too expensive versus their growth rate. Their PE ratio is AFTER they've dropped.\n\nNot only are they more expensive than FAAMG but also more expensive than V and MA.\n\nOnly AMZN is more expensive and might correct in the future.",
        "created_utc": 1636821939,
        "id": "hkh1rf0",
        "score": 31,
        "subreddit": "stocks",
        "created": 1636850739.0
    },
    {
        "author": "DiabolicToaster",
        "body": "Right now subscriptions are worth for convenience, but it might get interesting once the investors stop basically subsidizing the losses. Of all the big ones only like Microsoft has the cash to bleed (it also isn't their main income too) through it. However that's not counting how their subscription is a mixture of already existing from basically the start of the century and not really being forced to have some better incentives like original content (although they are showing effort like using cahs to buy out studios).\n\nSome people can afford stuff like delivery, but that's only people with the money. That's not touching of labor issues are starting to pop up due to the workers realizing they are losing more than they gain.",
        "created_utc": 1636571048,
        "id": "hk3qat0",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1636599848.0
    },
    {
        "author": "holding-light",
        "body": "So when Tesla is a 5-10 T market cap company what will google, Microsoft, apple, and Amazon be at?",
        "created_utc": 1635809691,
        "id": "hiy3vl8",
        "score": 30,
        "subreddit": "stocks",
        "created": 1635838491.0
    },
    {
        "author": "Tiktoor",
        "body": "AAPL, MSFT, NVDA, COST, TGT, DIS",
        "created_utc": 1637805619,
        "id": "hlzc73q",
        "score": 30,
        "subreddit": "stocks",
        "created": 1637834419.0
    },
    {
        "author": "BannerlordAdmirer",
        "body": "Mark Benioff was selling CRM nonstop, but it's risen like 20% since the bulk of his sales. No AAPL or MSFT insider has bought their stock in a billion years.\n\nIt doesn't really mean anything, market can decide to run up the stock regardless. That being said, Elon's little stunt might just do the trick.",
        "created_utc": 1636264122,
        "id": "hjn7qx6",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1636292922.0
    },
    {
        "author": "carpitown",
        "body": "Started a position in MSFT yesterday, once it turned red. Added today. Probably add more tomorrow if it stays down",
        "created_utc": 1637689916,
        "id": "hlsl3fg",
        "score": 30,
        "subreddit": "stocks",
        "created": 1637718716.0
    },
    {
        "author": "ProteinEngineer",
        "body": "I have never had a VR experience that I think would increase work efficiency.  I think Zuckerberg is so far removed from what it's like working an actual job or living a normal life that he thinks it's a good idea.\n\nIn terms of facebook/instagram: It seems like every 5-10 years, a new app comes around that replaces the previously popular one.  Instagram is being replaced by Tik Tok with younger users. Nobody young wants to be on facebook anymore now that it's filled with geriatrics, so FB is much more instagram heavy than in the past for younger users, and reliant on some really politically controversial groups to extract money out of facebook. Yes, they currently have a stranglehold on social media advertising, but I think their \"moat\"  is nonexistent compared to companies like Amazon, Apple,  Google, and Microsoft. Apple, Amazon, and Google especially-those are three exceptionally innovative companies compared to FB.",
        "created_utc": 1635818595,
        "id": "hiynp75",
        "score": 29,
        "subreddit": "SecurityAnalysis",
        "created": 1635847395.0
    },
    {
        "author": "TheCivilian1",
        "body": "$2500 on MSFT and $500 on AAPL - none on shitty Facebook",
        "created_utc": 1635802207,
        "id": "hixml3a",
        "score": 29,
        "subreddit": "stocks",
        "created": 1635831007.0
    },
    {
        "author": "JMLobo83",
        "body": "Once he gets to 100 shares of MSFT he can sell covered calls, that's a less risky way of using derivatives.  For every guy on WSB who posts their million dollar gain porn, there are 100 if not a 1000 who lose.",
        "created_utc": 1636679790,
        "id": "hk9xuyu",
        "score": 29,
        "subreddit": "stocks",
        "created": 1636708590.0
    },
    {
        "author": "Ajemas",
        "body": "I am an Automation Consultant, built the largest Robotics Centre of Excellence in Europe and have many years of experience in the field, here is the insider view\n\nUiPath had been known as the leader in Automation for many years as can be shown in the Gartner Magic Quadrant for 2021\n https://www.uipath.com/resources/automation-analyst-reports/gartner-magic-quadrant-robotic-process-automation\n\nThe problems that UiPath are facing are internal leadership changes, push for more low code development platforms and stiff competition which is eating in to market share\n\nI went to the Head Quarters of their competitor Automation Anywhere and their strategy is far more robust and strategy more cutting edge. Blue Prism is also seeing growth in their AI Fabric for OCR. The biggest problem is the challenge from Microsoft who are shooting up the rankings. I have delivered Automations using their Microsoft Power Automate solution and it is far superior. Quicker low code development, better functionality and native integrations with other Microsoft Applications. If you want to Automate using Microsoft Excel, Power BI or  SharePoint you would obviously use Microsoft's Power Automate. \n\nAutomation started in FS where UiPath was the tool being chosen. Given the growth of Automation in the Public Sector recently, they prefer Power Automate instead of UiPath for security and integration reasons. UiPath is still a good business which I advise clients on but their market position is slipping which is reflected in the share price. Hope this helps",
        "created_utc": 1637885677,
        "id": "hm3hlgo",
        "score": 29,
        "subreddit": "stocks",
        "created": 1637914477.0
    },
    {
        "author": "After_Maximum4211",
        "body": "No doubt. But to the people making the purchasing decision at large companies, Teams just has to be good enough. Microsoft probably offers some pretty good deals for those that already pay for various licenses.",
        "created_utc": 1636661847,
        "id": "hk8tkx0",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1636690647.0
    },
    {
        "author": "Nearby_Being_2194",
        "body": "I like Google and MSFT vs other FAANG+ companies",
        "created_utc": 1637724807,
        "id": "hluuujm",
        "score": 29,
        "subreddit": "ValueInvesting",
        "created": 1637753607.0
    },
    {
        "author": "maz-o",
        "body": "always buy microsoft. never sell.",
        "created_utc": 1637613479,
        "id": "hlolmii",
        "score": 29,
        "subreddit": "stocks",
        "created": 1637642279.0
    },
    {
        "author": "PreparetobePlaned",
        "body": "Norton is a joke and has been for a long time. It was only ever a consumer grade solution as far as I remember. NLOK sold their enterprise division to Broadcom in 2019. They aren't even competing in the same space as MSFT.",
        "created_utc": 1637996536,
        "id": "hm8zkes",
        "score": 29,
        "subreddit": "stocks",
        "created": 1638025336.0
    },
    {
        "author": "doggy_lovers",
        "body": "not true. Microsoft was more valuable than apple in march of 2020 and also most of 2018-2019.",
        "created_utc": 1636158555,
        "id": "hjhn88n",
        "score": 28,
        "subreddit": "stocks",
        "created": 1636187355.0
    },
    {
        "author": "daboss144",
        "body": "I'm fully aware, but when the shitty half of a sector sells off, the good half does too. As far as I can tell, the only sector that is THAT ridiculously hyped right now is the EV market. I'd like examples of other things that are bad, but that's all that sticks out to me right now.\n\nYes, rising interest rates are going to kill growth stocks in general, and some of those companies are big parts of SPX. Companies that are relying on that easy money for survival are going to have a hard time, some might go under. It's still not even CLOSE to a dot-com situation.\n\n I'd agree that Tesla is FOR SURE the poster child of a dot-com-esque company in 2021. but honestly even the extreme example of Tesla isn't even that bad. Despite the insane valuation, Tesla is a profitable company. A ridiculous number of companies in dot-com era were non-profitable on low revenue, with no pathway to viability EVER.\n\nYahoo (one of the companies that actually SURVIVED), peaked at a valuation of $140 billion. The previous year they reported net earnings of $50 million on $200 million in revenue. That's a P/E of 2800. Tesla right now is sitting at a P/E in the 300s.\n\nMany of the companies in the Dotcom era were in SUBSTANTIALLY worse shape than Yahoo, and they were absolutely everywhere. Pets .com literally spent 20x their revenue on advertising. 90% of an entire sector was legitimately worthless. That's why Microsoft, Amazon, Cisco, etc sold off so hard. Not because they weren't viable businesses, but because they'd ridden the ride up as a secondary member of the Dotcom companies. Amazon actually makes money, and the reason their earnings aren't higher rn is largely because of Capex. If the shitty EV companies go under as a result of high interest rates or whatever, it's not like electric cars won't get made. GM, Ford, etc will be able to make them, preserving much of the utility of the companies that provide materials and infrastructure for the overvalued EV companies to operate.\n\nI'm not saying that everything in the market is fine or that interest rates aren't going to hurt some sectors pretty hard, but I think the post I originally replied to DRASTICALLY overstated companies' current valuations vs the Dotcom bubble. And remember, Yahoo was the google of the era, trading at a PE of 2800. Google, the google of our era, is trading at a PE of 28.\n\nI hope this provides some perspective.",
        "created_utc": 1637770709,
        "id": "hlwz6im",
        "score": 28,
        "subreddit": "investing",
        "created": 1637799509.0
    },
    {
        "author": "fooledbyvechain",
        "body": "GME a hedge against falling markets! 😂 \n\nHeard this BS so many times, and it is totally false. \nGME ALWAYS drops the hardest, on red market days.\nI’m long GME, TSLA, AMZN and MSFT.",
        "created_utc": 1637931457,
        "id": "hm5ewr6",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1637960257.0
    },
    {
        "author": "aka0007",
        "body": "Motorola and Nokia used to sell lots of phones.",
        "created_utc": 1636322258,
        "id": "hjq8p1v",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1636351058.0
    },
    {
        "author": "Beneficial_Sense1009",
        "body": "Sure thing, but who was making phones before Apple? Nokia, LG, Blackberry, Motorola, even Amazon, Sony, Ericsson… you get the picture.\n\nThey all sound a bit legacy don’t they?",
        "created_utc": 1636811671,
        "id": "hkggbxk",
        "score": 9,
        "subreddit": "stocks",
        "created": 1636840471.0
    },
    {
        "author": "DxDoctor",
        "body": "Honestly, I kind of fucking hate my Tesla. And lately, with the limitations they put on the car and plans to let other EVs charge at Tesla superchargers, I could easily see myself buying an Apple car in a few years time (even though it will probably cost a lot more). \n\nI’m sure Tesla fanboys and musk idol worshippers will downvote this but, where I used to think Tesla would enjoy absolute market supremacy indefinitely, I’m beginning to see how Apple could make a niche and ultimately become the industry leader. Tesla is where motorola used to be, before apple butt fucked it to death with the iPhone. Kind of hoping the same thing happens here with the apple car. Tesla deserves it lol",
        "created_utc": 1637271651,
        "id": "hl69inn",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1637300451.0
    },
    {
        "author": "Ditdr",
        "body": "Eh. I own all 3 stocks so I'm somewhat neutral. Amd won't catch nvda on the gpu front. Except for a few circumstances nvda always will outperform. It doesn't really matter how good an amd gpu is their driver support is terrible and if a 700 dollar gpu that performs like a 1500 dollar gpu sounds good, which it should but in reality it doesn't matter because the drivers are crap and real world performance always lags benchmarks. \n\nOn the cpu front. I'd only use amd cpus on a workstation. The higher core count per dollar is nice but my 5950 system with a 2080ti never ran as well on 2k as my 9900k system with the same gpu. Both have ram tailored for the system and adequate cooling using msi mobos. This is in cod warzone which is heavily cpu dependant. The 9900k is at 5ghz both use noctua 2 tower coolers. And 32gb of b die ram. The amd system has memory tailored to the infinity fabric frequency as well so don't give me that frequency crap. The issue with the 5950 is I get frequent stuttering and lag fps drops. Not network related. If I spin 360  between the downtown and airport runway while on the hill ill lose 50fps. Dropping from 150 to 100 around the time I'm looking at array. 1440p same settings as my 9900k but fir whatever reason my 9900k system doesn't have these stutters when replicating. \n\nI'm buying more intc for the long haul, alder lake might be good. Time will tell. I love amd as well but I think they'll be stretched thin trying to batter the monoliths of 2 industries.",
        "created_utc": 1636518353,
        "id": "hk13cnw",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636547153.0
    },
    {
        "author": "sr000",
        "body": "Just like the winners in the smartphone market were the established mobile phone makers like Nokia, Motorola, Sony-Ericsson right.\n\nMy opinion is most of the legacy auto companies will fail in EV except VW.",
        "created_utc": 1637027643,
        "id": "hkssdn6",
        "score": 6,
        "subreddit": "stocks",
        "created": 1637056443.0
    },
    {
        "author": "Yngstr",
        "body": "Big picture, I think today’s auto manufacturers go the way of Nokia, motorola, and Samsung…maybe they can find new niches but they are gone unless they can start thinking about selling robots instead of a better EV.\n\nWhen the iPhone first came out everyone focused on the size and shape instead of the implications. So competitors tried to copy the size and shape without really understanding where the world was heading under their nose.\n\nI think that analogy is playing out right now in autos. Every trad auto company still thinks the goal is to build a better EV than Tesla. The goal is to build a better robotic transportation device. A working EV is the bare bare minimum.",
        "created_utc": 1636062526,
        "id": "hjc5yau",
        "score": 6,
        "subreddit": "investing",
        "created": 1636091326.0
    },
    {
        "author": "DerelictPostman",
        "body": "&gt;Intel is rumoured to be coming out with entry level GPU for $179.\n\nI found the [source here](https://wccftech.com/intel-entry-level-arc-alchemist-gaming-graphics-cards-to-feature-up-to-8-xe-hpg-gpu-cores-6-gb-gddr6-memory-179-us-pricing/)\n\nArticle says performance will be somewhere around that of a GTX 1650....which is selling for around [$160 at Best Buy](https://www.bestbuy.com/site/gigabyte-nvidia-geforce-gtx-1650-4gb-gddr5-pci-express-3-0-graphics-card-black-gray/6409179.p?skuId=6409179).  This means it's also around the [AMD Radeon RX 5500.](https://www.bestbuy.com/site/msi-amd-radeon-rx-5500-xt-8gb-gddr6-pci-express-4-0-graphics-card-black-gray/6397797.p?skuId=6397797)..selling $205 at Best Buy.\n\nAll in all, I don't see this as a win for Intel.  Releasing a GPU that performs at the same level as 2 year old, 2-generation old NVDA graphics card for the same price doesn't seem that great.\n\nAlso, people aren't buying 16-series NVDA cards any more, they've moved on to the 30- series or at the very least the 20-series. [You can see the popularity of different GPUs](https://benchmarks.ul.com/compare/best-gpus?amount=0&amp;sortBy=POPULARITY&amp;reverseOrder=true&amp;types=MOBILE,DESKTOP&amp;minRating=0) here, no one's buying this stuff any more.\n\nTo me, this is just another example of INTC being woefully behind in the GPU space.  People want to buy the latest GPUs to play the latest games...and Intel with this move has shown that they aren't even in the stratosphere as NVDA/AMD.  Woof.",
        "created_utc": 1637687034,
        "id": "hlsdj7e",
        "score": 5,
        "subreddit": "stocks",
        "created": 1637715834.0
    },
    {
        "author": "Pokesaurus_Rex",
        "body": "He has no source and he is flat out wrong. The only price increase from MSRP is from board partners like ASUS and MSI and EVGA on their cards (at most $100 more) but with what the cards are going for right now it’s insignificant.",
        "created_utc": 1637196507,
        "id": "hl26hw2",
        "score": 5,
        "subreddit": "stocks",
        "created": 1637225307.0
    },
    {
        "author": "rasp215",
        "body": "They don’t have much competition in the GPU space. and it’s not nvidia selling GPUs for 2x msrp. It’s resellers and companies like MSI. Their growth is more applications for GPUs outside of gaming.",
        "created_utc": 1637601946,
        "id": "hlnsp16",
        "score": 5,
        "subreddit": "stocks",
        "created": 1637630746.0
    },
    {
        "author": "TechyGuy31",
        "body": "Logitech, steelseries, HyperX, Glorious to name a few, plus ASUS, Gigabyte, MSI. \n\nThat's not counting the numerous that go with high quality mechanical keyboards or real headphones.  \n\nIt's clear you haven't done much research into this.",
        "created_utc": 1637111083,
        "id": "hkxfw38",
        "score": 4,
        "subreddit": "stocks",
        "created": 1637139883.0
    },
    {
        "author": "overpwrd_gaming",
        "body": "Motorola razr probably...",
        "created_utc": 1637640552,
        "id": "hlq9ej5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1637669352.0
    },
    {
        "author": "Professional_Bad7922",
        "body": "Then why don’t we have the option to switch to a time based news feed. I use Reddit purely because I can choose how I want my news feed shown. If we aren’t given that option and only can abide buy their MSI algo for me it is dangerous.",
        "created_utc": 1637251501,
        "id": "hl4uetl",
        "score": 4,
        "subreddit": "ValueInvesting",
        "created": 1637280301.0
    },
    {
        "author": "flicter22",
        "body": "Because Tesla is the iPhone dude. Brand loyalty didn't matter for Nokia and Motorola",
        "created_utc": 1636034243,
        "id": "hja677z",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636063043.0
    },
    {
        "author": "Cdn_Wealth_Hacker",
        "body": "I borrowed to invest. Have been in ENB, Loblaw ($L), Suncor with some of the funds. Majority of the funds have been in an ETF called Global Dividend Global Split Corp. by Brompton funds. ($GDV on the TSX).\n\nPays $0.10/share monthly. Used to be over 10% yield, now it’s just under - closed at $12.52/share yesterday. Didn’t miss any payments during the pandemic.[GDV - Brompton Global Dividend ETF](https://www.bromptongroup.com/product/global-dividend-growth-split-corp/)\n\nI like the find because it gives global exposure, although mostly concentrated in North America. Hold diverse industry sectors and companies. The top 25 holdings include:\n\nMorgan Stanley\nTractor Supply Co\nASML Holding NV \nJPMorgan Chase &amp; Co\nMotorola Solutions Inc\nBank of America Corp \nApple Inc\nGoldman Sachs Group Inc \nMicrosoft Corp\nPaychex Inc\nSchneider Electric SE\nTexas Instruments Inc\nPower Corporation of Canada\nPrologis Inc\nNational Bank of Canada\nJohnson Controls International PLC\nCanadian Natural Resources Ltd\nTelus Corp\nSeagate Technology Holdings PLC\nRoyal Bank of Canada\nWalt Disney Co\n\nResearch and do heavy due diligence of your own if using borrowed funds, but I found this to be a solid foundation for my portfolio.",
        "created_utc": 1636464965,
        "id": "hjxmf8p",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1636493765.0
    },
    {
        "author": "Pokesaurus_Rex",
        "body": "No they are selling them at MSRP but the demand is so high for the 30 series cards especially for gamers (The most popular graphics card is a 10 series card mostly 1050-1070) that they sell out instantly. \n\nYou can argue that board partners like Asus and MSI increased MSRP but like that’s nothing compared to what they go for on ebay right now.",
        "created_utc": 1637196400,
        "id": "hl269lq",
        "score": 3,
        "subreddit": "stocks",
        "created": 1637225200.0
    },
    {
        "author": "rudiger13",
        "body": "Contemplating switching from Motorola to a Primeco phone. Thoughts?",
        "created_utc": 1636863253,
        "id": "hkjnz2p",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636892053.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  4th of November\n\n\n\n## Upcoming events for Thursday, November  4th\n\n - Expected earnings:\n\n  AAOI, AAON, AAU, ABC, ABNB, ABUS, ACET, ACIW, ACMR, ACR, ACRX, ADAP, ADMA, ADMS, ADVM, ADXN, AE, AERI, AES, AEZS, AFCG, AG, AGLE, AGO, AGS, AHCO, AIG, AINV, AIV, AJX, AKBA, AL, ALBO, ALE, ALEX, ALGS, ALHC, ALKT, ALLO, ALRM, ALTR, AMEH, AMH, AMN, AMPY, AMRK, AMYT, ANGI, ANIK, AOSL, APD, APLE, APPN, APR, APRE, APT, APTV, AQMS, ARC, ARDX, ARNA, ARQT, ARVN, ARW, ASMB, ASPS, ASRT, ATAX, ATEC, ATLO, ATNX, ATRA, ATRS, ATSG, ATUS, AUMN, AUTO, AVLR, AVRO, AXNX, BABA, BALY, BAP, BATRA, BATRK, BBD, BBDO, BBIO, BCE, BCLI, BCOR, BCYC, BDX, BE, BEPC, BFS, BGNE, BGS, BHF, BIGC, BILL, BKD, BL, BLCM, BLDR, BLFS, BLI, BLL, BLPH, BNGO, BPMP, BRG, BSBK, BSGM, BXRX, CABO, CAI, CALA, CARS, CBAY, CBIO, CC, CCOI, CDR, CDTX, CDXS, CDZI, CEMI, CFLT, CFX, CGNX, CHH, CHUY, CI, CIR, CLBS, CLDT, CLDX, CLFD, CLI, CLLS, CLNE, CLXT, CMBM, CMRX, CMT, CNCE, CNDT, CNHI, CNP, CNQ, CNXN, COLD, COLL, COMM, CPLG, CPLP, CRAI, CRDF, CRMD, CRON, CRY, CS, CTHR, CTLP, CTMX, CTSO, CTT, CTXS, CUBE, CVCO, CVET, CVNA, CVRX, CWEN, CWEN.A, CWK, CXP, CYBR, CYCN, CYRX, DBRG, DBX, DDOG, DEN, DHC, DIN, DISH, DK, DKL, DLX, DMLP, DNB, DNLI, DNN, DOCN, DRH, DRNA, DUK, DVAX, DWSN, DYN, EBS, ECOR, ED, EGLE, EIGR, ELOX, ENDP, ENG, EOG, EPAM, ERF, ERII, ESTE, ETTX, EURN, EVC, EWCZ, EXPE, FARM, FAT, FATBB, FATE, FCRD, FDUS, FIS, FLNT, FND, FNKO, FOCS, FOLD, FOR, FOXF, FROG, FRT, FSLR, FTNT, FULC, FVCB, FVE, FWONA, FWONK, GBT, GDOT, GDP, GDYN, GEL, GEO, GERN, GH, GIL, GKOS, GLPG, GMED, GNE, GNL, GOGO, GOLD, GOLF, GOVX, GPP, GPRE, GPRO, GRFS, GROW, GRTS, GSBD, GTN, GTN.A, GTYH, HALL, HASI, HBI, HEAR, HHC, HII, HIMX, HL, HMHC, HMPT, HRTG, HSKA, HTA, HWM, HZN, IAC, IBOC, IBP, ICL, IDCC, IDRA, IFRX, IGMS, IHC, IHRT, III, ILMN, IMH, IMMR, IMRA, IMUX, INDP, INDT, ING, INGN, INOD, INS, IOVA, IRM, IRTC, IRWD, ISDR, ISPC, ITP, ITRI, JNCE, JYNT, K, KALA, KBAL, KDMN, KDNY, KFFB, KIQ, KMPH, KOP, KRP, KRTX, KTB, KURA, KVHI, KWR, KYMR, KZR, LABP, LASR, LAUR, LAZY, LBRDA, LBRDK, LCUT, LFVN, LGF.A, LGF.B, LITE, LLNW, LND, LNG, LNT, LNTH, LOCO, LORL, LPTH, LSPD, LSXMA, LSXMB, LSXMK, LTHM, LTRPA, LTRPB, LXP, LYV, MACK, MAIN, MASS, MBUU, MCHP, MDGL, MDRX, MED, MELI, MGEE, MGLN, MGTA, MGTX, MITK, MITO, MLAB, MLCO, MNDT, MNST, MP, MRIN, MRNA, MSC, MSGM, MSI, MTBC, MTD, MTEM, MTSI, MTX, MTZ, MUR, MUX, MXC, MYE, NATR, NE, NEO, NEPH, NET, NFG, NH, NHC, NINE, NKLA, NKSH, NKTR, NLOK, NMM, NNBR, NNI, NOMD, NPTN, NREF, NRG, NS, NSIT, NTCT, NTLA, NTRA, NTUS, NVAX, NVMI, NWS, NWSA, NXTC, OBSV, OEC, OGE, OHI, OLED, ONCT, ONTO, OPCH, OPTN, ORGS, ORIC, ORLA, OTEX, OTRK, OUT, OXY, OYST, PAC, PAE, PALT, PASG, PBA, PBH, PBYI, PCOR, PCTI, PCTY, PDCE, PDEX, PECO, PEI, PENN, PESI, PFSI, PGNY, PH, PHI, PINS, PLM, PLNT, PLX, PMT, PODD, PPL, PRCT, PRDO, PRMW, PROF, PRTA, PRVB, PSNL, PTMN, PTON, PWFL, PWP, PWR, PZG, PZZA, QDEL, QRTEA, QRTEB, QTRX, RBA, RC, RCUS, RDFN, REFR, REG, REGN, REPL, REYN, REZI, RFP, RGA, RGLS, RGS, RKT, RLJ, RMAX, RNGR, RUN, RWAY, SALM, SATS, SELB, SEM, SFE, SFM, SGA, SGMO, SHAK, SHO, SHYF, SID, SIGA, SKM, SLDB, SLQT, SLRX, SMHI, SMLP, SNPO, SO, SPRO, SQ, SRLP, SRRA, SRTS, SSYS, STFC, STKS, STNE, STOR, STRA, STRO, SVC, SVM, SVRA, SWCH, SWKS, SWX, SXI, SYBX, SYNA, TAL, TCX, TDC, TDS, TDW, TEF, TFFP, TGH, TGNA, TGP, TGTX, THR, TIPT, TK, TMCI, TMST, TNK, TPL, TRGP, TRHC, TRIN, TTOO, TTSH, TUEM, TWI, UBER, UEIC, UFCS, UIHC, UNIT, UONE, UONEK, USM, USPH, USWS, VATE, VCTR, VG, VHI, VIA, VIAC, VIACA, VIAO, VIAV, VIR, VLDR, VMC, VNT, VRAY, VRRM, VSAT, VSTO, VTVT, VVI, W, WCC, WD, WELL, WFCF, WLDN, WLL, WMC, WMS, WPM, WSC, WSTG, WW, WWE, WYNN, XENE, XFOR, XLRN, XOMA, XONE, XRAY, XTNT, XXII, Y, YELP, YMAB, YTRA, ZBH, ZEUS, ZGNX, ZTS\n\n - Ex-div:\n\n  AFB, AMX, ARLP, BKEP, BMRC, BPRN, CEQP, CFFN, CMCO, CMS, CPLP, CVCY, DAN, DKL, ET, FBC, FCBC, FCF, FE, FFWM, FRAF, FRBA, GPP, HCC, HSII, HWKN, HWM, IBCP, ICBK, IDA, INTC, JBHT, LBAI, LBC, LVHD, LW, MMLP, MMP, NSC, NWBI, NWLI, NYCB, OHI, PFE, PNFP, RELL, SIRI, SRLP, STZ, STZ.B, SUN, TGP, UL, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Challenger Job Cuts (previous: 17.895K)\n    - Continuing Jobless Claims (consensus: 2,118K, previous: 2,243K)\n    - Exports (previous: 213.70B)\n    - Imports (previous: 287.00B)\n    - Initial Jobless Claims (consensus: 275K, previous: 281K)\n    - Jobless Claims 4-Week Avg. (previous: 299.25K)\n    - Natural Gas Storage (consensus: 63B, previous: 87B)\n    - Nonfarm Productivity (consensus: -3.0%, previous: 2.1%)\n    - OPEC Meeting\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n    - Unit Labor Costs (consensus: 7.0%, previous: 1.3%)\n\n## Upcoming events for Friday, November  5th\n\n - Expected earnings:\n\n  AAMC, AENZ, AMCX, AMR, AMRX, AREC, ATNM, AXL, AY, AYRO, BBU, BCH, BEP, BH, BH.A, BRK.A, BRK.B, CGAU, CGC, CKX, CLMT, CNK, CNTY, CQP, CRNX, CRT, CVR, CZNC, D, DKNG, DOC, DSEY, DTM, DXPE, DXYN, EAF, ECOL, ELAN, ENB, ENIC, ENLV, EPZM, ESGR, ESNT, FET, FLR, FTSI, GBL, GBNY, GCI, GLP, GOOS, GRPN, GSAT, GT, GTS, HE, HMC, HMTV, HRC, HSON, INTT, JCI, JCS, KFS, KIM, LFT, LMRK, MBIO, MFA, MGA, MITT, MMI, MODV, MOG.A, MOG.B, MOSY, MTNB, NATH, NEN, NMRK, NOG, NOVN, NPO, NTP, NVIV, NVO, NWLI, NWN, OCGN, OFIX, OFS, ONCY, PAYA, PFSW, PHVS, PLYM, PNW, PVL, RAND, RSLS, SAMG, SBR, SCYX, SII, SRE, SRNE, SSP, SYRS, TELL, TEN, TGS, THM, TILE, TIXT, TKC, TM, TPHS, TRP, TSE, TU, TUSK, UBOH, UFS, UI, UK, VHC, VRS, VST, VTR, VWTR, WRN, WTM, XELA, YORW\n\n - Ex-div:\n\n  AAPL, AB, ALX, AMP, ARTNA, ASRV, BCO, BSBR, CLAR, CLB, CWT, DHF, ENBL, FBIZ, FBK, FHI, FIBK, GLOP, GLP, GWW, HAFC, HBCP, HBT, JHG, LAZ, LPX, MC, MCI, MN, MRLN, MUSA, NATI, NMM, NS, NSEC, OCFC, PCTI, PEAK, PEBO, PETS, RUSHA, RUSHB, RWAY, SCHN, SHEN, SJW, SXI, VNO, WABC, WMK, WVFC, X, XLNX\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.9%, previous: 4.6%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.6%)\n    - Average Weekly Hours (consensus: 34.8, previous: 34.8)\n    - CFTC Aluminium speculative net positions (previous: 4.2K)\n    - CFTC Copper speculative net positions (previous: 37.3K)\n    - CFTC Corn speculative net positions (previous: 307.8K)\n    - CFTC Crude Oil speculative net positions (previous: 423.7K)\n    - CFTC Gold speculative net positions (previous: 214.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.3K)\n    - CFTC Natural Gas speculative net positions (previous: -138.2K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 96.5K)\n    - CFTC Silver speculative net positions (previous: 37.5K)\n    - CFTC Soybeans speculative net positions (previous: 43.2K)\n    - CFTC Wheat speculative net positions (previous: 0.8K)\n    - Consumer Credit (consensus: 15.90B, previous: 14.38B)\n    - Government Payrolls (previous: -123.0K)\n    - Manufacturing Payrolls (consensus: 27K, previous: 26K)\n    - Nonfarm Payrolls (consensus: 450K, previous: 194K)\n    - Participation Rate (previous: 61.6%)\n    - Private Nonfarm Payrolls (consensus: 400K, previous: 317K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 443)\n    - U.S. Baker Hughes Total Rig Count (previous: 542)\n    - U6 Unemployment Rate (previous: 8.5%)\n    - Unemployment Rate (consensus: 4.7%, previous: 4.8%)\n\n^^^^2021-11-04",
        "created_utc": 1636020014,
        "id": "hj9i3rw",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1636048814.0
    },
    {
        "author": "kamrali",
        "body": "That's not a very good comparison. Nokia and Motorola never had the brand loyalty that the legacy car makers have. On top of that, Apple already had strong brand loyalty well before the iPhone came out thanks to years of building up iMacs and iPods.\n\nComparing cell phones to a significantly more complicated and costly market like EV's is an apples or oranges comparison.",
        "created_utc": 1636035603,
        "id": "hja9bjx",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636064403.0
    },
    {
        "author": "TheDeHymenizer",
        "body": "I'm not going to read this but I'll assume it can be summarized as \"even if you assume this crazy number of cars sold TSLA is still overvalued by a massive amount\". Am I wrong? \n\nProblem is this is the wrong way of looking at TSLA. It'd be like looking at Apple in 2007 and saying \"ppfffttt look at how many phones motorola sells even if Apple sells 100% of the worlds phones then they can only reach X valuation\". Problem is smart phones opened whole new revenue streams that previously didn't exist for cell phone manufacturers. \n\nTSLA is similar. Either Tesla is going to find new ways to make money for a car company, such as charging for self driving, sell his AI chips, selling batteries to other manufacturers, etc etc or it'll crash down to earth. Only time will tell if they will succeed or not (I missed the boat on Tesla so I don't own any) but looking at the company's growth prospects as the number of cars they may or may not sell is missing the entire point.",
        "created_utc": 1636728415,
        "id": "hkc5qqb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636757215.0
    },
    {
        "author": "Trolli-lolli",
        "body": "a.) Eww Windows\n\nb.) Repairing it voids the warranty. They are the worst about right to repair shit. So if you find the right computer repair shop that won't brick your shit, sure it's repairable, but they literally design it not to be and get sued over programmed obsolescence like annually\n\nc.) My Motorola phone has been going strong for about 4 years with better battery life than my iPhone friends. Maybe you just don't know how to buy tech?",
        "created_utc": 1637473014,
        "id": "hlh6vod",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1637501814.0
    },
    {
        "author": "Systim88",
        "body": "Apple sells way less than Blackberry, Palm, Nokia and Motorola yet is worth more. \n\nIt’s about where things are going, not where they are dumb dumb. Check last quarter, all legacy OEM lost market share while Tesla gained and broke records. Not to mention 2-3x earnings of legacy OEMs during a chip shortage and climbing.\n\nThey will be top market share once Berlin and Texas ramp up. Also model 3 best selling car (not just EV or luxury) in Europe last month. Model Y on trajectory to be best selling car by revenue worldwide within 2 years. Do more research before posting cherry picked garbage.",
        "created_utc": 1635983148,
        "id": "hj7ugcm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636011948.0
    },
    {
        "author": "Immertired",
        "body": "Yeah, my last Samsung had an sd card and a replaceable battery and headphone Jack. Some of the new ones have none of the above, most still have sd cards though. I hate that on some Samsung and lg androids you get a whole package of bloat ware that makes it a little different than other android devices and then after a while you just stop getting updates. I really prefer Motorola flagship phones with a metal frame that come with a completely bone stock android meaning they’ll be the first to get updates. My last androids were from the Moto z series that worked with the moto mods, really wish they kept going with that experiment, the possibilities were endless. I bundle phone with home internet with Xfinity though and only so many phone options are supported. I even told the sales guy that someone could make a fortune selling iPhone cases (kinda like the charge cases) that had all the extra features people miss",
        "created_utc": 1635836988,
        "id": "hizgy90",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635865788.0
    },
    {
        "author": "mka5588",
        "body": "\"think logically, how could apple stock be worth more than Motorola, blackberry, AND Nokia?!\". \"Think logically, how could amazon!!! Be worth more than walmart and sears?! Makes no sense\". Lol gg",
        "created_utc": 1637191792,
        "id": "hl1w6qi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637220592.0
    },
    {
        "author": "V8sOnly",
        "body": "And so it begins. 10 yrs from now this will be the Motorola Razr of EV chargers.",
        "created_utc": 1637716820,
        "id": "hlue0ws",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637745620.0
    },
    {
        "author": "mechpaul",
        "body": "TL;DR:\n\n- First ever 100% silicon battery ever to market. Many other battery mfgers only have 3-5% silicon.\n\n- Enovix's first generation 100% silicon battery is 30-40% more efficient than any other battery. Imagine getting 30-40% more space in an iPhone and what a game changer that is. Or AR/VR glasses. Or any mobile devices.\n\n- Eventually capable of creating EV batteries by 2025.\n\n- Mobile device manufacturers speculated include SNAP, META, AAPL, HP, MSI. \n\n- Future customers could be the US DoD as silicon can be mined domestically and turned into batteries. The second the government labels batteries as critical infrastructure means Enovix will be in a prime spot to take advantage of that.\n\nJust the TL;DR",
        "created_utc": 1636738532,
        "id": "hkcuc6g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636767332.0
    },
    {
        "author": "jesperbj",
        "body": "You're entirely ignorant if you think that's the only thing they do. Like I said, the software will improve over time. The hardware is already stellar - also on the top end. \n\nEither way, the numbers don't like. The only phone OEMs who are growing are Chinese. Samsung is slipping. And the Chinese are growing fast.\n\nGuess who's doing entry level only these days? Nokia. Even Motorola, but they are also Chinese owned now.",
        "created_utc": 1636914788,
        "id": "hkm8rwl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636943588.0
    },
    {
        "author": "Auraaaaa",
        "body": "Tesla isn’t going to be worth much once traditional manufacturers take EVs and autonomous driving assist seriously. The Mercedes EQS is vastly superior in luxury and creature comforts than the Plaid, and is still cheaper . Look at Rivian. They are making vehicles that Americans want to buy (trucks and SUVs, that look like SUVs).\nHis future wealth is not going to be from Tesla. Tesla is like the Motorola of cell phones. They started out early in the game but everybody else is more refined",
        "created_utc": 1637076245,
        "id": "hkv1tyc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637105045.0
    },
    {
        "author": "tisgamebeterhavep0rn",
        "body": "Maybe it has something to do with the bullshit they pulled with MSI (the company, not the index) selling trash scam video cards to consumers that just got discovered yesterday.\n\nI think it's \"GamerNexus\" on YouTube or something, they have a whole video explaining it.",
        "created_utc": 1637658682,
        "id": "hlqzdnu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637687482.0
    },
    {
        "author": "DrOctopus-",
        "body": "Sticks and stones pal. The only competitors out there are the new EV companies. How many cigarette companies are successful in vape? None. How did Blackberry, Motorola, etc do against Apple? Not my job to educate you but please go ahead and short Tesla. Put your money where your mouth is.",
        "created_utc": 1636053104,
        "id": "hjbi2an",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636081904.0
    },
    {
        "author": "tesla365s",
        "body": "Most costly than blue diamond, pearls, and uranium. History being repeated my friend, what was reason for 1989 and 1999? Yup chip, what happened to Motorola and AMD after that? Yup, AMD went up 2700% in few months so did other chip manufacturing company. Time will show, 7 months from now you will be like wish i had listen to that man! \n(KEY WORD: Chip Shortage)",
        "created_utc": 1636160216,
        "id": "hjhqw3q",
        "score": 1,
        "subreddit": "options",
        "created": 1636189016.0
    },
    {
        "author": "down_up__left_right",
        "body": "&gt;\tNo one made much money making phones before Apple. \n\nNokia, Blackberry, Motorola, Samsung, and LG?\n\nApple didn’t invest the cell phone industry it just came in and took a bunch of market share from the incumbents.",
        "created_utc": 1636727903,
        "id": "hkc4liv",
        "score": 1,
        "subreddit": "investing",
        "created": 1636756703.0
    },
    {
        "author": "dadmakefire",
        "body": "I also heard that Apple is worth more than Nokia, Motorola, and Blackberry combined. Definite meme stock.",
        "created_utc": 1636543739,
        "id": "hk210ij",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636572539.0
    },
    {
        "author": "merlinsbeers",
        "body": "AMD fans spent several years after the ATI purchase in denial about the fact the company was totaled. They've never recovered a sense of proportion.\n\nIf Jim Keller and the coin miners hadn't come along AMD would be a distant memory, like Motorola.\n\nAnd if Intel hadn't stupidly failed to limit AMD's rights as a source of x86 chips, AMD wouldn't have made it out of the 90s.\n\nThey owe Intel everything, and can't stand knowing it.",
        "created_utc": 1636741244,
        "id": "hkd106c",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636770044.0
    },
    {
        "author": "SituationLive4406",
        "body": "Whole market is down today! I am thinking since that news came from an article and not a formal press release yet we could see some action if they issue a formal PR with Motorola.",
        "created_utc": 1637690493,
        "id": "hlsmlhi",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1637719293.0
    },
    {
        "author": "consultacpa",
        "body": "This.  They've had an inferior ISA since the Motorola 68000 came out in 1979, but they've still always came out ahead.  I wouldn't bet against Intel.",
        "created_utc": 1637612470,
        "id": "hloj4jf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1637641270.0
    },
    {
        "author": "tisgamebeterhavep0rn",
        "body": "That's old news, u/VisualMod\n\nI'm talking about the new msi/nvidia scam reported on yesterday.",
        "created_utc": 1637659569,
        "id": "hlr0d74",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637688369.0
    },
    {
        "author": "One_Psychology_6500",
        "body": "I think the idea is that these comparisons are like comparing how many phone Motorola and Apple were selling in 2009-10. \n\nQuestion is: is Tesla the apple of cars? Or is it the blackberry?",
        "created_utc": 1637156901,
        "id": "hkzj75f",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1637185701.0
    },
    {
        "author": "mark_the_narc",
        "body": "Glorious is only known for their mice and they dont sell headsets asus sure sells peripherals but thats not what theyre known for same thing with gigabyte and msi",
        "created_utc": 1637158437,
        "id": "hkzme8e",
        "score": 0,
        "subreddit": "stocks",
        "created": 1637187237.0
    },
    {
        "author": "tisgamebeterhavep0rn",
        "body": "Once again: did ppl checked the gamernexus video on Nvidia's / MSI current bullcrap?",
        "created_utc": 1637659230,
        "id": "hlqzzbn",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1637688030.0
    },
    {
        "author": "orockers",
        "body": "Let’s look 10 years into the future, are we just gonna see iPhones and Samsungs in everyone’s pocket?  Cause that’s what Apple is priced at.  As if Nokia, Motorola, Blackberry and literally everyone else won’t have phones as well.",
        "created_utc": 1636525697,
        "id": "hk1ezwu",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1636554497.0
    },
    {
        "author": "aka0007",
        "body": "Motorola and Nokia used to sell lots of phones.",
        "created_utc": 1636322258,
        "id": "hjq8p1v",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1636351058.0
    },
    {
        "author": "Ditdr",
        "body": "Eh. I own all 3 stocks so I'm somewhat neutral. Amd won't catch nvda on the gpu front. Except for a few circumstances nvda always will outperform. It doesn't really matter how good an amd gpu is their driver support is terrible and if a 700 dollar gpu that performs like a 1500 dollar gpu sounds good, which it should but in reality it doesn't matter because the drivers are crap and real world performance always lags benchmarks. \n\nOn the cpu front. I'd only use amd cpus on a workstation. The higher core count per dollar is nice but my 5950 system with a 2080ti never ran as well on 2k as my 9900k system with the same gpu. Both have ram tailored for the system and adequate cooling using msi mobos. This is in cod warzone which is heavily cpu dependant. The 9900k is at 5ghz both use noctua 2 tower coolers. And 32gb of b die ram. The amd system has memory tailored to the infinity fabric frequency as well so don't give me that frequency crap. The issue with the 5950 is I get frequent stuttering and lag fps drops. Not network related. If I spin 360  between the downtown and airport runway while on the hill ill lose 50fps. Dropping from 150 to 100 around the time I'm looking at array. 1440p same settings as my 9900k but fir whatever reason my 9900k system doesn't have these stutters when replicating. \n\nI'm buying more intc for the long haul, alder lake might be good. Time will tell. I love amd as well but I think they'll be stretched thin trying to batter the monoliths of 2 industries.",
        "created_utc": 1636518353,
        "id": "hk13cnw",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636547153.0
    },
    {
        "author": "Yngstr",
        "body": "Big picture, I think today’s auto manufacturers go the way of Nokia, motorola, and Samsung…maybe they can find new niches but they are gone unless they can start thinking about selling robots instead of a better EV.\n\nWhen the iPhone first came out everyone focused on the size and shape instead of the implications. So competitors tried to copy the size and shape without really understanding where the world was heading under their nose.\n\nI think that analogy is playing out right now in autos. Every trad auto company still thinks the goal is to build a better EV than Tesla. The goal is to build a better robotic transportation device. A working EV is the bare bare minimum.",
        "created_utc": 1636062526,
        "id": "hjc5yau",
        "score": 6,
        "subreddit": "investing",
        "created": 1636091326.0
    },
    {
        "author": "flicter22",
        "body": "Because Tesla is the iPhone dude. Brand loyalty didn't matter for Nokia and Motorola",
        "created_utc": 1636034243,
        "id": "hja677z",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636063043.0
    },
    {
        "author": "Cdn_Wealth_Hacker",
        "body": "I borrowed to invest. Have been in ENB, Loblaw ($L), Suncor with some of the funds. Majority of the funds have been in an ETF called Global Dividend Global Split Corp. by Brompton funds. ($GDV on the TSX).\n\nPays $0.10/share monthly. Used to be over 10% yield, now it’s just under - closed at $12.52/share yesterday. Didn’t miss any payments during the pandemic.[GDV - Brompton Global Dividend ETF](https://www.bromptongroup.com/product/global-dividend-growth-split-corp/)\n\nI like the find because it gives global exposure, although mostly concentrated in North America. Hold diverse industry sectors and companies. The top 25 holdings include:\n\nMorgan Stanley\nTractor Supply Co\nASML Holding NV \nJPMorgan Chase &amp; Co\nMotorola Solutions Inc\nBank of America Corp \nApple Inc\nGoldman Sachs Group Inc \nMicrosoft Corp\nPaychex Inc\nSchneider Electric SE\nTexas Instruments Inc\nPower Corporation of Canada\nPrologis Inc\nNational Bank of Canada\nJohnson Controls International PLC\nCanadian Natural Resources Ltd\nTelus Corp\nSeagate Technology Holdings PLC\nRoyal Bank of Canada\nWalt Disney Co\n\nResearch and do heavy due diligence of your own if using borrowed funds, but I found this to be a solid foundation for my portfolio.",
        "created_utc": 1636464965,
        "id": "hjxmf8p",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1636493765.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  4th of November\n\n\n\n## Upcoming events for Thursday, November  4th\n\n - Expected earnings:\n\n  AAOI, AAON, AAU, ABC, ABNB, ABUS, ACET, ACIW, ACMR, ACR, ACRX, ADAP, ADMA, ADMS, ADVM, ADXN, AE, AERI, AES, AEZS, AFCG, AG, AGLE, AGO, AGS, AHCO, AIG, AINV, AIV, AJX, AKBA, AL, ALBO, ALE, ALEX, ALGS, ALHC, ALKT, ALLO, ALRM, ALTR, AMEH, AMH, AMN, AMPY, AMRK, AMYT, ANGI, ANIK, AOSL, APD, APLE, APPN, APR, APRE, APT, APTV, AQMS, ARC, ARDX, ARNA, ARQT, ARVN, ARW, ASMB, ASPS, ASRT, ATAX, ATEC, ATLO, ATNX, ATRA, ATRS, ATSG, ATUS, AUMN, AUTO, AVLR, AVRO, AXNX, BABA, BALY, BAP, BATRA, BATRK, BBD, BBDO, BBIO, BCE, BCLI, BCOR, BCYC, BDX, BE, BEPC, BFS, BGNE, BGS, BHF, BIGC, BILL, BKD, BL, BLCM, BLDR, BLFS, BLI, BLL, BLPH, BNGO, BPMP, BRG, BSBK, BSGM, BXRX, CABO, CAI, CALA, CARS, CBAY, CBIO, CC, CCOI, CDR, CDTX, CDXS, CDZI, CEMI, CFLT, CFX, CGNX, CHH, CHUY, CI, CIR, CLBS, CLDT, CLDX, CLFD, CLI, CLLS, CLNE, CLXT, CMBM, CMRX, CMT, CNCE, CNDT, CNHI, CNP, CNQ, CNXN, COLD, COLL, COMM, CPLG, CPLP, CRAI, CRDF, CRMD, CRON, CRY, CS, CTHR, CTLP, CTMX, CTSO, CTT, CTXS, CUBE, CVCO, CVET, CVNA, CVRX, CWEN, CWEN.A, CWK, CXP, CYBR, CYCN, CYRX, DBRG, DBX, DDOG, DEN, DHC, DIN, DISH, DK, DKL, DLX, DMLP, DNB, DNLI, DNN, DOCN, DRH, DRNA, DUK, DVAX, DWSN, DYN, EBS, ECOR, ED, EGLE, EIGR, ELOX, ENDP, ENG, EOG, EPAM, ERF, ERII, ESTE, ETTX, EURN, EVC, EWCZ, EXPE, FARM, FAT, FATBB, FATE, FCRD, FDUS, FIS, FLNT, FND, FNKO, FOCS, FOLD, FOR, FOXF, FROG, FRT, FSLR, FTNT, FULC, FVCB, FVE, FWONA, FWONK, GBT, GDOT, GDP, GDYN, GEL, GEO, GERN, GH, GIL, GKOS, GLPG, GMED, GNE, GNL, GOGO, GOLD, GOLF, GOVX, GPP, GPRE, GPRO, GRFS, GROW, GRTS, GSBD, GTN, GTN.A, GTYH, HALL, HASI, HBI, HEAR, HHC, HII, HIMX, HL, HMHC, HMPT, HRTG, HSKA, HTA, HWM, HZN, IAC, IBOC, IBP, ICL, IDCC, IDRA, IFRX, IGMS, IHC, IHRT, III, ILMN, IMH, IMMR, IMRA, IMUX, INDP, INDT, ING, INGN, INOD, INS, IOVA, IRM, IRTC, IRWD, ISDR, ISPC, ITP, ITRI, JNCE, JYNT, K, KALA, KBAL, KDMN, KDNY, KFFB, KIQ, KMPH, KOP, KRP, KRTX, KTB, KURA, KVHI, KWR, KYMR, KZR, LABP, LASR, LAUR, LAZY, LBRDA, LBRDK, LCUT, LFVN, LGF.A, LGF.B, LITE, LLNW, LND, LNG, LNT, LNTH, LOCO, LORL, LPTH, LSPD, LSXMA, LSXMB, LSXMK, LTHM, LTRPA, LTRPB, LXP, LYV, MACK, MAIN, MASS, MBUU, MCHP, MDGL, MDRX, MED, MELI, MGEE, MGLN, MGTA, MGTX, MITK, MITO, MLAB, MLCO, MNDT, MNST, MP, MRIN, MRNA, MSC, MSGM, MSI, MTBC, MTD, MTEM, MTSI, MTX, MTZ, MUR, MUX, MXC, MYE, NATR, NE, NEO, NEPH, NET, NFG, NH, NHC, NINE, NKLA, NKSH, NKTR, NLOK, NMM, NNBR, NNI, NOMD, NPTN, NREF, NRG, NS, NSIT, NTCT, NTLA, NTRA, NTUS, NVAX, NVMI, NWS, NWSA, NXTC, OBSV, OEC, OGE, OHI, OLED, ONCT, ONTO, OPCH, OPTN, ORGS, ORIC, ORLA, OTEX, OTRK, OUT, OXY, OYST, PAC, PAE, PALT, PASG, PBA, PBH, PBYI, PCOR, PCTI, PCTY, PDCE, PDEX, PECO, PEI, PENN, PESI, PFSI, PGNY, PH, PHI, PINS, PLM, PLNT, PLX, PMT, PODD, PPL, PRCT, PRDO, PRMW, PROF, PRTA, PRVB, PSNL, PTMN, PTON, PWFL, PWP, PWR, PZG, PZZA, QDEL, QRTEA, QRTEB, QTRX, RBA, RC, RCUS, RDFN, REFR, REG, REGN, REPL, REYN, REZI, RFP, RGA, RGLS, RGS, RKT, RLJ, RMAX, RNGR, RUN, RWAY, SALM, SATS, SELB, SEM, SFE, SFM, SGA, SGMO, SHAK, SHO, SHYF, SID, SIGA, SKM, SLDB, SLQT, SLRX, SMHI, SMLP, SNPO, SO, SPRO, SQ, SRLP, SRRA, SRTS, SSYS, STFC, STKS, STNE, STOR, STRA, STRO, SVC, SVM, SVRA, SWCH, SWKS, SWX, SXI, SYBX, SYNA, TAL, TCX, TDC, TDS, TDW, TEF, TFFP, TGH, TGNA, TGP, TGTX, THR, TIPT, TK, TMCI, TMST, TNK, TPL, TRGP, TRHC, TRIN, TTOO, TTSH, TUEM, TWI, UBER, UEIC, UFCS, UIHC, UNIT, UONE, UONEK, USM, USPH, USWS, VATE, VCTR, VG, VHI, VIA, VIAC, VIACA, VIAO, VIAV, VIR, VLDR, VMC, VNT, VRAY, VRRM, VSAT, VSTO, VTVT, VVI, W, WCC, WD, WELL, WFCF, WLDN, WLL, WMC, WMS, WPM, WSC, WSTG, WW, WWE, WYNN, XENE, XFOR, XLRN, XOMA, XONE, XRAY, XTNT, XXII, Y, YELP, YMAB, YTRA, ZBH, ZEUS, ZGNX, ZTS\n\n - Ex-div:\n\n  AFB, AMX, ARLP, BKEP, BMRC, BPRN, CEQP, CFFN, CMCO, CMS, CPLP, CVCY, DAN, DKL, ET, FBC, FCBC, FCF, FE, FFWM, FRAF, FRBA, GPP, HCC, HSII, HWKN, HWM, IBCP, ICBK, IDA, INTC, JBHT, LBAI, LBC, LVHD, LW, MMLP, MMP, NSC, NWBI, NWLI, NYCB, OHI, PFE, PNFP, RELL, SIRI, SRLP, STZ, STZ.B, SUN, TGP, UL, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Challenger Job Cuts (previous: 17.895K)\n    - Continuing Jobless Claims (consensus: 2,118K, previous: 2,243K)\n    - Exports (previous: 213.70B)\n    - Imports (previous: 287.00B)\n    - Initial Jobless Claims (consensus: 275K, previous: 281K)\n    - Jobless Claims 4-Week Avg. (previous: 299.25K)\n    - Natural Gas Storage (consensus: 63B, previous: 87B)\n    - Nonfarm Productivity (consensus: -3.0%, previous: 2.1%)\n    - OPEC Meeting\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n    - Unit Labor Costs (consensus: 7.0%, previous: 1.3%)\n\n## Upcoming events for Friday, November  5th\n\n - Expected earnings:\n\n  AAMC, AENZ, AMCX, AMR, AMRX, AREC, ATNM, AXL, AY, AYRO, BBU, BCH, BEP, BH, BH.A, BRK.A, BRK.B, CGAU, CGC, CKX, CLMT, CNK, CNTY, CQP, CRNX, CRT, CVR, CZNC, D, DKNG, DOC, DSEY, DTM, DXPE, DXYN, EAF, ECOL, ELAN, ENB, ENIC, ENLV, EPZM, ESGR, ESNT, FET, FLR, FTSI, GBL, GBNY, GCI, GLP, GOOS, GRPN, GSAT, GT, GTS, HE, HMC, HMTV, HRC, HSON, INTT, JCI, JCS, KFS, KIM, LFT, LMRK, MBIO, MFA, MGA, MITT, MMI, MODV, MOG.A, MOG.B, MOSY, MTNB, NATH, NEN, NMRK, NOG, NOVN, NPO, NTP, NVIV, NVO, NWLI, NWN, OCGN, OFIX, OFS, ONCY, PAYA, PFSW, PHVS, PLYM, PNW, PVL, RAND, RSLS, SAMG, SBR, SCYX, SII, SRE, SRNE, SSP, SYRS, TELL, TEN, TGS, THM, TILE, TIXT, TKC, TM, TPHS, TRP, TSE, TU, TUSK, UBOH, UFS, UI, UK, VHC, VRS, VST, VTR, VWTR, WRN, WTM, XELA, YORW\n\n - Ex-div:\n\n  AAPL, AB, ALX, AMP, ARTNA, ASRV, BCO, BSBR, CLAR, CLB, CWT, DHF, ENBL, FBIZ, FBK, FHI, FIBK, GLOP, GLP, GWW, HAFC, HBCP, HBT, JHG, LAZ, LPX, MC, MCI, MN, MRLN, MUSA, NATI, NMM, NS, NSEC, OCFC, PCTI, PEAK, PEBO, PETS, RUSHA, RUSHB, RWAY, SCHN, SHEN, SJW, SXI, VNO, WABC, WMK, WVFC, X, XLNX\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.9%, previous: 4.6%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.6%)\n    - Average Weekly Hours (consensus: 34.8, previous: 34.8)\n    - CFTC Aluminium speculative net positions (previous: 4.2K)\n    - CFTC Copper speculative net positions (previous: 37.3K)\n    - CFTC Corn speculative net positions (previous: 307.8K)\n    - CFTC Crude Oil speculative net positions (previous: 423.7K)\n    - CFTC Gold speculative net positions (previous: 214.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.3K)\n    - CFTC Natural Gas speculative net positions (previous: -138.2K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 96.5K)\n    - CFTC Silver speculative net positions (previous: 37.5K)\n    - CFTC Soybeans speculative net positions (previous: 43.2K)\n    - CFTC Wheat speculative net positions (previous: 0.8K)\n    - Consumer Credit (consensus: 15.90B, previous: 14.38B)\n    - Government Payrolls (previous: -123.0K)\n    - Manufacturing Payrolls (consensus: 27K, previous: 26K)\n    - Nonfarm Payrolls (consensus: 450K, previous: 194K)\n    - Participation Rate (previous: 61.6%)\n    - Private Nonfarm Payrolls (consensus: 400K, previous: 317K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 443)\n    - U.S. Baker Hughes Total Rig Count (previous: 542)\n    - U6 Unemployment Rate (previous: 8.5%)\n    - Unemployment Rate (consensus: 4.7%, previous: 4.8%)\n\n^^^^2021-11-04",
        "created_utc": 1636020014,
        "id": "hj9i3rw",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1636048814.0
    },
    {
        "author": "kamrali",
        "body": "That's not a very good comparison. Nokia and Motorola never had the brand loyalty that the legacy car makers have. On top of that, Apple already had strong brand loyalty well before the iPhone came out thanks to years of building up iMacs and iPods.\n\nComparing cell phones to a significantly more complicated and costly market like EV's is an apples or oranges comparison.",
        "created_utc": 1636035603,
        "id": "hja9bjx",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636064403.0
    },
    {
        "author": "Systim88",
        "body": "Apple sells way less than Blackberry, Palm, Nokia and Motorola yet is worth more. \n\nIt’s about where things are going, not where they are dumb dumb. Check last quarter, all legacy OEM lost market share while Tesla gained and broke records. Not to mention 2-3x earnings of legacy OEMs during a chip shortage and climbing.\n\nThey will be top market share once Berlin and Texas ramp up. Also model 3 best selling car (not just EV or luxury) in Europe last month. Model Y on trajectory to be best selling car by revenue worldwide within 2 years. Do more research before posting cherry picked garbage.",
        "created_utc": 1635983148,
        "id": "hj7ugcm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636011948.0
    },
    {
        "author": "Immertired",
        "body": "Yeah, my last Samsung had an sd card and a replaceable battery and headphone Jack. Some of the new ones have none of the above, most still have sd cards though. I hate that on some Samsung and lg androids you get a whole package of bloat ware that makes it a little different than other android devices and then after a while you just stop getting updates. I really prefer Motorola flagship phones with a metal frame that come with a completely bone stock android meaning they’ll be the first to get updates. My last androids were from the Moto z series that worked with the moto mods, really wish they kept going with that experiment, the possibilities were endless. I bundle phone with home internet with Xfinity though and only so many phone options are supported. I even told the sales guy that someone could make a fortune selling iPhone cases (kinda like the charge cases) that had all the extra features people miss",
        "created_utc": 1635836988,
        "id": "hizgy90",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635865788.0
    },
    {
        "author": "DrOctopus-",
        "body": "Sticks and stones pal. The only competitors out there are the new EV companies. How many cigarette companies are successful in vape? None. How did Blackberry, Motorola, etc do against Apple? Not my job to educate you but please go ahead and short Tesla. Put your money where your mouth is.",
        "created_utc": 1636053104,
        "id": "hjbi2an",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636081904.0
    },
    {
        "author": "tesla365s",
        "body": "Most costly than blue diamond, pearls, and uranium. History being repeated my friend, what was reason for 1989 and 1999? Yup chip, what happened to Motorola and AMD after that? Yup, AMD went up 2700% in few months so did other chip manufacturing company. Time will show, 7 months from now you will be like wish i had listen to that man! \n(KEY WORD: Chip Shortage)",
        "created_utc": 1636160216,
        "id": "hjhqw3q",
        "score": 1,
        "subreddit": "options",
        "created": 1636189016.0
    }
]