[
    {
        "author": "SongOfTheFates",
        "body": "First off, any broad market valuation system that doesn't adjust for interest rates is 100% useless when the rates change as dramatically as they have.\n\nOn top of that, I haven't actually seen any of these posts bother adjusting for P/S either. Making an argument along the lines of Amazon = Pets.com on the basis of P/E is pretty damn silly.\n\nYes, there are companies like BLNK that are complete shit propped up by hype. People will go -90% on companies like this eventually. No, the market doesn't give a shit and will march forward on the back of actual companies like Microsoft that are insane cash cows.",
        "created_utc": 1610830793,
        "id": "gji5olq",
        "score": 485,
        "subreddit": "investing",
        "created": 1610859593.0
    },
    {
        "author": "Justforaminute12",
        "body": "Lol omg bruh I don’t mess with margins at all, not even on Microsoft word",
        "created_utc": 1610558854,
        "id": "gj4rjgl",
        "score": 404,
        "subreddit": "wallstreetbets",
        "created": 1610587654.0
    },
    {
        "author": "[deleted]",
        "body": "I have it on good authority that 2,189 of those Millionaire made Microsoft employees bled it all back to the market with GME and PLTR calls.",
        "created_utc": 1610033653,
        "id": "giflu4t",
        "score": 219,
        "subreddit": "wallstreetbets",
        "created": 1610062453.0
    },
    {
        "author": "CaptainLisaSu",
        "body": "MSFT",
        "created_utc": 1611033390,
        "id": "gjsu6rb",
        "score": 195,
        "subreddit": "investing",
        "created": 1611062190.0
    },
    {
        "author": "TitusSupremus",
        "body": "MSFT will be taken to the moon by GME 🚀🚀🚀🚀",
        "created_utc": 1610896667,
        "id": "gjljma7",
        "score": 177,
        "subreddit": "wallstreetbets",
        "created": 1610925467.0
    },
    {
        "author": "MousePuzzleheaded",
        "body": "BB recently won an IP dispute with FB. BB also has cyber security software in some 175 million cars. BB software is what will make the ever increasing tech world, especially self driving cars safe. They are just in my opinion an extremely undervalued stock because they are perceived as a failing smartphone manufacturer, when in reality they are one of the biggest cyber security firms in existence. It isn't a short play, but IMO I think BB is the next over 1k stock that stays that high indefinitely. They'll be the Microsoft of the self driving vehicle world and the autonomous machine world.",
        "created_utc": 1611770405,
        "id": "gkz8fxc",
        "score": 172,
        "subreddit": "wallstreetbets",
        "created": 1611799205.0
    },
    {
        "author": "pmalhotra96",
        "body": "- The stock was heavily shorted because their brick and mortar business model was pretty much going extinct and they were in debt. The short sellers, however, ignored some fundamental catalysts like the new console cycle and that ps5 and xbox one would work with game disks (correct me if I'm wrong here).\n\n- They also ignored the fact that GME's online sales had gone up quite significantly. All of this led some redditors early in the game to believe that this was a company that would not go bankrupt. They then had a deal with Microsoft which pumped the stock higher.\n\n- Enter Ryan Cohen. The founder of Chewy ($CHWY) saw the potential in GME and wrote an angry letter imploring them to find better ways of leveraging their popularity and shifting their business online. He has since upped his investment and has more comrades on board.\n\n- All of the above meant that GME was priced very low and was actually a value investment because of the good things coming up for this company. Institutions and retail investors started buying this stock and it kept going up.\n\n- There is evidence that the short sellers kept increasing their position hoping for a reversal that never came. Now their brokers are restricting short selling for GME and as the stock pumps higher, they are closer and closer to getting margin called.\n\n- When that happens, they will be forced to close their positions and buy shares. Creating a short squeeze. The catch here is that there are not enough shares available to buy and close their positions. Essentially, they would have to buy it from insiders or institutions who will most probably not be willing to sell their stake.\n\n- The above would create an infinite short squeeze which would make us all very rich if we could time our exit. \n\nSomeone from r/wallstreetbets correct me if I missed anything. Thanks!",
        "created_utc": 1611352960,
        "id": "gk8y0ps",
        "score": 165,
        "subreddit": "stocks",
        "created": 1611381760.0
    },
    {
        "author": "Mathewdm423",
        "body": "My \"friend\" in college was working on a software that was gamechanging in our opinions. In fact i won a grant award for $10k that we started with to bootstrap. \n\nWell she gave my postion to someone who had just graduated when i was in my senior year. I Cut ties\n\nGot the linked in notification that shes a software engineer for Microsoft. Nice to see her salary. I paint floors for $20 an hour lol",
        "created_utc": 1611092735,
        "id": "gjvk74w",
        "score": 163,
        "subreddit": "wallstreetbets",
        "created": 1611121535.0
    },
    {
        "author": "Unicorncorn21",
        "body": "GME will buy Microsoft by EOY",
        "created_utc": 1610906600,
        "id": "gjmk8i2",
        "score": 160,
        "subreddit": "wallstreetbets",
        "created": 1610935400.0
    },
    {
        "author": "soulnotsoldier",
        "body": "Microsoft or IBM were incredibly early movers and built actual monopolies. BB does well as a company, but the areas you mentioned aren't blue ocean growth, they're saturated with competitors.",
        "created_utc": 1611770637,
        "id": "gkz94nm",
        "score": 153,
        "subreddit": "wallstreetbets",
        "created": 1611799437.0
    },
    {
        "author": "annoyingbanana1",
        "body": "Not as old as msft 200c war but yeah. Fuck that guy",
        "created_utc": 1611874411,
        "id": "gl5r26v",
        "score": 150,
        "subreddit": "wallstreetbets",
        "created": 1611903211.0
    },
    {
        "author": "MedtnerOp27",
        "body": "Calls on $MSFT Word Art",
        "created_utc": 1610185228,
        "id": "gin4tf6",
        "score": 143,
        "subreddit": "wallstreetbets",
        "created": 1610214028.0
    },
    {
        "author": "kimscottpeyser",
        "body": "Lots of hedge funds are losing big so far this year. At some point this week or next week if  GME holds they will have to cover their short bets. Watch big cap stocks like APPL, MSFT, FB and Google etc. If thy keep going down large, that indicates that hedge funds are selling their big cap liquid stocks, once thy run out of the big names they will be forced to cover GME.",
        "created_utc": 1612118673,
        "id": "gli80xs",
        "score": 143,
        "subreddit": "wallstreetbets",
        "created": 1612147473.0
    },
    {
        "author": "pumapunch",
        "body": "Man baller was just so bad for Microsoft. Talk about a guy that took every wrong turn he could make. Thanks Christ for Nadella.",
        "created_utc": 1610762045,
        "id": "gjervd8",
        "score": 141,
        "subreddit": "investing",
        "created": 1610790845.0
    },
    {
        "author": "NoobTrader378",
        "body": "100% those places pretend like they're smart cuz there dumb and think buying MSFT on a dip is some excellent new groundbreaking strategy... We're retarded like rainman, and realize that when a company is significantly undervalued it = 🚀⛽",
        "created_utc": 1611371815,
        "id": "gkacbwx",
        "score": 134,
        "subreddit": "wallstreetbets",
        "created": 1611400615.0
    },
    {
        "author": "AzureWasHere",
        "body": "Microsoft 200c gang gang reporting in 🥲",
        "created_utc": 1611875242,
        "id": "gl5t0yv",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1611904042.0
    },
    {
        "author": "barista-chan",
        "body": "Unfortunately it’s a microsoft exclusive.\n\nI can do this all day, the prank calls never end.",
        "created_utc": 1612042044,
        "id": "glerikv",
        "score": 127,
        "subreddit": "wallstreetbets",
        "created": 1612070844.0
    },
    {
        "author": "Alone-Razzmatazz9309",
        "body": "They have a deal with Microsoft for a portion of all digital sales, they are creating a new digital market place that allows digital trade ins, esport leagues, up %300 in digital revenue last year. Those are just a few examples from their previous statement off the top of my head",
        "created_utc": 1610633770,
        "id": "gj8919m",
        "score": 123,
        "subreddit": "wallstreetbets",
        "created": 1610662570.0
    },
    {
        "author": "roywilliamsnephew",
        "body": "Major league plays: GME\n\n\nTriple A: AMC, BB, NOK\n\n\nDouble A: TSLA\n\n\nSingle A: AAPL, FB, MSFT",
        "created_utc": 1612130989,
        "id": "gliyos7",
        "score": 120,
        "subreddit": "wallstreetbets",
        "created": 1612159789.0
    },
    {
        "author": "mxmcharbonneau",
        "body": "You also have to consider that Microsoft kinda sucked under Steve Ballmer and traded mostly sideways for over a decade.",
        "created_utc": 1611195244,
        "id": "gk0m3zz",
        "score": 117,
        "subreddit": "investing",
        "created": 1611224044.0
    },
    {
        "author": "Beefstu409",
        "body": "Honestly if they have to liquidate to cover the market will crash. People don't get that. When hedge funds pull out of MSFT, it'll come down, algo trading will sell off more and there will be at least a flash crash. IF YOU ARE NEAR RETIREMENT AGE YOU NEED TO MOVE YOUR IRA MONEY TO BONDS IMMEDIATELY. Wait out the GME situation, if GME moons the market will crash and you can buy back in, if GME emptys all of our pockets then just buy back in. There's no risk to getting out now and sitting in bonds for 3 months.  Clear out your non-gme positions for bonds.",
        "created_utc": 1612029902,
        "id": "gle1n71",
        "score": 116,
        "subreddit": "wallstreetbets",
        "created": 1612058702.0
    },
    {
        "author": "edible_scissors",
        "body": "Similar to GME, everyone thought Nintendo was going under.  Sony and Microsoft had the gaming market cornered, and any dwindling market Nintendo had left was clearly for children.\n\nAlong came Reggie and his \"Blue Ocean\" strategy.  Turns out that if you can delight your customers, you'll capture all demographics.  They sold games to fucking everyone.\n\nYou know who else likes to delight his customers?  Ryan Cohen.  The fact that Cohen and Reggie are in the same company should terrify anyone trying to short this.",
        "created_utc": 1611213004,
        "id": "gk1f1r5",
        "score": 110,
        "subreddit": "wallstreetbets",
        "created": 1611241804.0
    },
    {
        "author": "idontlikeflamingos",
        "body": "Yeah the downside of being the first guy to be right is that you lose a lot of money while your prediction doesn't happen.\n\nHe's 100% right, Tesla will crash eventually. It's very reminiscent of MSFT and others in the .com bubble. But that doesn't mean there's not money to be made now. Just be aware of the risk.",
        "created_utc": 1610126978,
        "id": "gik73p5",
        "score": 102,
        "subreddit": "wallstreetbets",
        "created": 1610155778.0
    },
    {
        "author": "MC20177",
        "body": "MSFT 3/20 200C",
        "created_utc": 1610855508,
        "id": "gjjhjl1",
        "score": 101,
        "subreddit": "wallstreetbets",
        "created": 1610884308.0
    },
    {
        "author": "whowantscoffee",
        "body": "That Microsoft would really be better with a chocolatey hazelnut spread on top?",
        "created_utc": 1610119635,
        "id": "gijr6uq",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1610148435.0
    },
    {
        "author": "xsvfan",
        "body": "For a US example: during the dot com bubble burst Microsoft and Amazon both lost 50%+ and took years to recover",
        "created_utc": 1611192342,
        "id": "gk0gf2j",
        "score": 97,
        "subreddit": "investing",
        "created": 1611221142.0
    },
    {
        "author": "Rinzler-u007",
        "body": "Buy $MSFT?",
        "created_utc": 1610493049,
        "id": "gj1xsdx",
        "score": 95,
        "subreddit": "wallstreetbets",
        "created": 1610521849.0
    },
    {
        "author": "NoobSniperWill",
        "body": "I made more money from selling TSLA puts than my salary last year and I have been investing in TSLA since 2017/18. That being said, I also feel TSLA stock price has increased so much in a so short time period. Almost 2000% increase in one year. I am too young to experience dot com bubble, but I feel TSLA now is like Microsoft then, PC is booming, Internet is booming, everyone needs Microsoft OS, Microsoft is future, etc. I am still long TSLA but I will start to sell way OTM calls, if they are ITM, I will roll them over",
        "created_utc": 1610116020,
        "id": "gijk9de",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1610144820.0
    },
    {
        "author": "mrvile",
        "body": "JNJ, MSFT, AAPL, FB, and TSLA are like a third of my portfolio. Hopefully a lot more after next week 🚀",
        "created_utc": 1611382100,
        "id": "gkb2b8v",
        "score": 93,
        "subreddit": "StockMarket",
        "created": 1611410900.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "MSFT, AAPL, TSLA and FB earnings within 24 hours. Massive 24 hours!",
        "created_utc": 1611305972,
        "id": "gk5qgci",
        "score": 91,
        "subreddit": "wallstreetbets",
        "created": 1611334772.0
    },
    {
        "author": "Hologram0110",
        "body": "Market cap is a seriously terrible metric to look at here. That measures the 'size' of a single corporate entity, not an industry. Also, I think you are misinterpreting 'giant multinational corporations' as belonging to a specific country. That just isn't true. Microsoft and Google for example are headquartered in the US but have employees all over the world. \n\n\\- Canada actually does make cars there are a handful of major manufacturing plants in Ontario. There are also automotive research and design offices. Yes, the companies are headquartered in the US, but that doesn't mean they have no Canadian content. \n\n\\- Canada has a number of hardware companies. ATI which used to design graphics cards was Canadian until it got purchased by AMD. They still have offices in Canada and the graphics cards are competitive with the best made anywhere. I don't think any of the GPU manufacturing is actually in Canada, but lots of the R&amp;D is done here. \n\n\\- Canada does have a significant pharmaceutical industry, it is just small compared to the US where profits can be many times higher due to the high per-person healthcare spending in the US.  Often times viable products designed in Canada get purchased by larger American companies before they reach consumers so you don't realize the Canadian connection. Canada also has facilities to make vaccines, they just don't happen to be compatible with the new type of vaccine being used for COVID (mRNA). \n\n&amp;#x200B;\n\nThere have been some notable Canadian tech failures. Nortel for example was the world leader in advanced telecommunications technology. Unfortunately, it fell victim to a combination of incompetent management and corporate espionage where it had its designs stolen from competitors. BlackBerry is a bit similar in that it completely DOMINATED the world's smartphone market for well over a decade before Apple disrupted the market with the first-gen iPhone. The smartphone market eventually saw everyone else either make android phones or sell off the cellphone business. \n\n&amp;#x200B;\n\nCanadian companies often sell out to large multinational companies. They just have the resources such that it doesn't make sense for someone small to compete against them, it's better to join them.",
        "created_utc": 1611416464,
        "id": "gke2afl",
        "score": 90,
        "subreddit": "CanadianInvestor",
        "created": 1611445264.0
    },
    {
        "author": "bianceziwo",
        "body": "Tesla will be on 2 planets, msft will be on 1",
        "created_utc": 1610058295,
        "id": "gih4q4t",
        "score": 90,
        "subreddit": "wallstreetbets",
        "created": 1610087095.0
    },
    {
        "author": "Taz-erton",
        "body": "Who do you think campaigned so hard for extended lockdowns?  Google, Amazon, Facebook, Microsoft...Silicon Valley as a whole benefit immensely from everyone staying home.",
        "created_utc": 1611874783,
        "id": "gl5ry6g",
        "score": 84,
        "subreddit": "wallstreetbets",
        "created": 1611903583.0
    },
    {
        "author": "Yu-piter",
        "body": "This could be like Microsoft that sat on its azz for 10 years and then rocketed to the heavens",
        "created_utc": 1611193636,
        "id": "gk0ixrs",
        "score": 84,
        "subreddit": "wallstreetbets",
        "created": 1611222436.0
    },
    {
        "author": "Harudera",
        "body": "GME will either make people millionaires or it'll wipe out 90% of posters on here like PRPL gang, tanker gang, corn dudes, MSFT 200 by March, April 4/17 SPY 180 puts and all the other bullshit that's failed.\n\nFuck I doubt 1% of people in here know who Marty was. Funny thing is MU is now close to $90",
        "created_utc": 1611267457,
        "id": "gk40259",
        "score": 83,
        "subreddit": "wallstreetbets",
        "created": 1611296257.0
    },
    {
        "author": "razpotim",
        "body": "Yea fuck logic! a car maker producing half a million cars a year is clearly worth more than fucking Microsoft",
        "created_utc": 1610057756,
        "id": "gih3kvh",
        "score": 82,
        "subreddit": "wallstreetbets",
        "created": 1610086556.0
    },
    {
        "author": "ahungrylilsandwhich",
        "body": "Yes, I think 2 years from now their stock is 70$-80$ easy if not higher honestly. I have no idea what they have thought up for the future but we do have a glimpse of it and to me it seems like a great business model. People don't want to stop going to retail stores, it's just right now they have to, retail stores aside though their e-commerce sales this year went up some 800%. That's no joke and it appears they are currently redoing their online presence as well. My guess is they are going to make it feel VERY nice to use their website and I would imagine there will be perks involved also. \n\nhttps://news.microsoft.com/2020/10/08/gamestop-announces-multiyear-strategic-partnership-with-microsoft/\n\nThis is almost all I need to be on board long term. This is huge. \n\nAlso they are about to open PC stores is building stations. That is huge also. PC gaming is BLOWING up rn. I would be they have something in the works to be able to deliver very nice PCs for a very nice price. The competition for retail PC gaming would be low. Around me there's microcenter but they only have so many stores, i think less than 10. So the next one is best buy, but they barely carry gaming pc parts. It's mainly office computers and printers, boomer shit. Yeah you can get stuff online and delivered to your house. I personally am the guy who buys all the shit online and picks up at the store in case I need something extra or have questions. The idea of gamestop having all of this stuff and probably a pc specialist to help with builds is a huge green light. Imagine all the people that go home and build their pc alone with a youtube vid up would be replaced by just going in and building it with someone at gamestop (not sure if that's the plan but maybe?). \n\nAs far as the online goes, again their e-commerce went up 800% and now they have a possible ceo who grew a HUGE online brand and obviously knows that market well. Gamestop already has the branding they just need to convince people to switch to using them for their gaming needs which personally I'm going to put my money where my mouth is and start getting what I need from gamestop when I can. \n\nLots of it also comes down to just believing in RC. Which I have decided after his recent tweets I do. He wants this shit to work, and he turned millions into billions once already. Imagine what he can do with an already established gamestop. I honestly believe all it needs is the new ideas and outlook he and his buddies will bring to completely turn the company around. \n\nI'd love to see a fucking squeeze I'm the next week or so because my investment is pretty small. If there is a squeeze, my plan is reinvest all my profits back into gamestop after the price goes way down again or stabilizes to hold long term and then put my initial investment into bb immediately. Here's to hoping.",
        "created_utc": 1611095656,
        "id": "gjvqgl9",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1611124456.0
    },
    {
        "author": "daffy_faffy",
        "body": "Absolutely agree. Microsoft has been one of the best kept secrets when it comes to staying close to the true valuation. They will pop eventually and it has an easy 25-30% upside from current levels. Azure, Office 365, Dynamics 365, Teams integration, Power Platform etc are all hugely adopted as of 2020. I’m a huge proponent of their business and I’m buying them at current valuations and I recommend anyone to buy them while they’re still cheap.",
        "created_utc": 1610846772,
        "id": "gjj16v7",
        "score": 79,
        "subreddit": "investing",
        "created": 1610875572.0
    },
    {
        "author": "stevenconrad",
        "body": "A lot, actually. WSB is usually right, but timing can be way off. I've seen TSLA, GME, PLTR, BB, BBBY, MT, NVDA, AMD, MSFT, F, GE, etc. All with gains and losses,  but mostly through options. Miss time it, and you're fkd. Buy shares an you'll usually win, but with options you'll fly or fall.",
        "created_utc": 1610854798,
        "id": "gjjg80l",
        "score": 79,
        "subreddit": "wallstreetbets",
        "created": 1610883598.0
    },
    {
        "author": "llfruge",
        "body": "They're all titans of their specific industries and leaders in their sectors. I personally wouldn't sell any. MSFT hasn't moved much for a good portion of the year but their work in the cloud sector and Azure will change that soon. All are cash cows so if you wanted to sell some and buy others it wouldn't hurt you. If you do sell some, Apple would be the one to keep. Trading sideways is just a part of investing. It's almost a guarantee that you won't lose money with any of these stocks.",
        "created_utc": 1610540348,
        "id": "gj3t68o",
        "score": 77,
        "subreddit": "stocks",
        "created": 1610569148.0
    },
    {
        "author": "Noobmast3r69",
        "body": "don't sell your shares, on friday millions of options created months ago are getting expired, like last Friday and next Friday etc. Meaning the rocket gets every Friday bonus fuel. the fucking short selling hedge funds who profit on destroying businesses for betting against them, they have to cover, and if the price rises the get more and more fucked. massive insurance out there have then to carry out this crazy transactions.\n\ndon't get fooled by propaganda like some suspensions, trading stop from the SEC, White House, feds or dunno what. we are talking here about a market cut around 25-60n$ on gme. amazon, apple, microsoft, the play around 1trillion$. this is peanuts for the market.\n\nSO BUY IF YOU STILL CAN AND HOLD YOUR POSITIONS. don't give them any chance to cover their position for lower then 4269$. not only for your profit in $ but to show the world that an idea of making profit on betting against businesses, against dreams and lifes of individuals is not and should not be acceptable. we are writing history, everyone of us makes a difference.\n\nnever felt better for holding a stock.",
        "created_utc": 1611780621,
        "id": "gkzxu97",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1611809421.0
    },
    {
        "author": "japanyooooo",
        "body": "I’m HEAVY in MSFT long term. I just don’t ever see MSFT going anywhere.  It’s safe as shit long run and over the last 4 years has murdered for me.\n\n401k is straight equities but spread out obviously.\n\nThen I have my 10% play funds which are wild speculation.  The funny part is had I just gone straight MSFT in everything since beginning my career 5 years back I’d be wayyyyy more up",
        "created_utc": 1611808307,
        "id": "gl1rznk",
        "score": 75,
        "subreddit": "wallstreetbets",
        "created": 1611837107.0
    },
    {
        "author": "giomsan",
        "body": "i have wet dreams of msft announcing a shareholding of gme ala porsche with vw",
        "created_utc": 1611004556,
        "id": "gjrcmit",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1611033356.0
    },
    {
        "author": "four1six_",
        "body": "Wow my head cannon is messed up here, was 200c msft really before guh?\n\nLmao what a time it's been",
        "created_utc": 1611874891,
        "id": "gl5s7ao",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1611903691.0
    },
    {
        "author": "[deleted]",
        "body": "See my other comment. You won’t have the opportunity to invest in quantum computing for at least a year or two. All the major companies are either focusing on growth or have been absorbed by Google, Microsoft, Amazon, etc. It’s a real shame, too, because the companies that have acquired startups are focused on 1-5 year gains. Pressure, in this case leads to poor products or hype. The reality is that quantum computing is the most complicated engineering challenge man has ever faced. You think going from 20nm to 5 nm was tough, quantum computing is much harder but has the potential for gains that will rival what we have seen from the time of Turing to now.\n\nA ~52 logical qubit chip owned by Google achieved quantum supremacy (just Google “quantum supremacy Google”). We are aiming for 100-10000+ logical qubits in the near future. The computational capabilities of such systems will revolutionize drug design, materials and optimal portfolios 🙄.",
        "created_utc": 1611910041,
        "id": "gl7pml8",
        "score": 67,
        "subreddit": "wallstreetbets",
        "created": 1611938841.0
    },
    {
        "author": "SeeMontgomeryBurns",
        "body": "LOL that’s the funniest part to me. Stocks get halted after big moves all the time, but all of a sudden it’s a conspiracy. Shit GME was halted at $10 when the Microsoft news came out. Seems the price ended up fine after that. I’m jacked to the tits on GME but man I really don’t understand the need to make up stories.",
        "created_utc": 1611426507,
        "id": "gkf77vr",
        "score": 67,
        "subreddit": "stocks",
        "created": 1611455307.0
    },
    {
        "author": "men_molten",
        "body": "Microsoft sales platforms has historically been shite, and digital trade ins are the dumbest shit I've ever heard as digital goods are infinite and it would basically function the same as a sale.\n\nFight me.",
        "created_utc": 1610637408,
        "id": "gj8g6hw",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1610666208.0
    },
    {
        "author": "antiproton",
        "body": "&gt; I think we printed a bunch of money out of thin air,\n\n&gt; I think we have a permanent increase in value \n\nYou really believe there will be no consequences for the unbridled profligacy of the last year? You think Tesla is as valuable as Google and Microsoft and good for them? \n\nThe floor of expectations is sky high. \"The other shoe hasn't dropped, so it never will\". Ignore all economic markers because they don't matter. \n\nUntil they do.\n\nMarket valuations seems intrinsically tied to the value of the dollar. The market can go up forever. The dollar cannot go down forever. \n\nThis rollercoaster has no breaks. All we're doing is building more and more track in front of it as fast as possible to stay ahead.",
        "created_utc": 1610232003,
        "id": "gipa7e3",
        "score": 64,
        "subreddit": "investing",
        "created": 1610260803.0
    },
    {
        "author": "bennyllama",
        "body": "This is why when people are like, “just buy AAPL and MSFT, they aren’t going anywhere” I always think of IBM and GE lol",
        "created_utc": 1611271721,
        "id": "gk48lew",
        "score": 61,
        "subreddit": "investing",
        "created": 1611300521.0
    },
    {
        "author": "gorays21",
        "body": "Hold until you retire cause Microsoft is the safest stock on 🌍.\n\nWhen aliens 👽 invade Earth, people will panic sell stocks. And what do the aliens do? They BUY the dip on great stocks such as Microsoft.",
        "created_utc": 1609948749,
        "id": "gibb4f4",
        "score": 61,
        "subreddit": "stocks",
        "created": 1609977549.0
    },
    {
        "author": "ifisch",
        "body": "I feel like OP doesn’t actually know much about the gaming industry, to be honest. \n\nAny subscription model that gamestop offers can easily be destroyed by the console manufacturers themselves...and taking advantage of a Sony or microsoft subscription doesn’t require driving to a brick and mortar store or waiting for something to come in the mail. \n\nXbox ALREADY has such a subscription model, and it’s 100% digital. \n\nFurther, the cheaper new console SKUs don’t even have disk drives, cutting GameStop out entirely. In a couple years, this “new business model” would rely entirely on customers who chose to pay an extra $100 for a disk drive version of ps5 or xbox.",
        "created_utc": 1611124953,
        "id": "gjx5j7s",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1611153753.0
    },
    {
        "author": "maz-o",
        "body": "AAPL, MSFT, DIS",
        "created_utc": 1610050478,
        "id": "gignlo7",
        "score": 60,
        "subreddit": "stocks",
        "created": 1610079278.0
    },
    {
        "author": "Tsukune_Surprise",
        "body": "I’m getting really fucking tired of the all the newbs here copying and pasting the same tired shit to act they’re “in the know”.  \n\nThe worst one is that fucking wall of text that ends with that super fucking cringey outer space and rockets emoji picture.  \n\nI liked it better when this place was a wretched hive of scum and villainy and not a constant stream of “me too” Facebook reposts. \n\n\nFuuuuuck. \n\n(PS - hey newbs, I know I’m mean but I’ll let you in on a secret - MSFT $200c and JNUG calls)",
        "created_utc": 1612014727,
        "id": "gld7yvs",
        "score": 59,
        "subreddit": "wallstreetbets",
        "created": 1612043527.0
    },
    {
        "author": "Ickyhouse",
        "body": "Microsoft signed a partnership deal back in October for Xbox sales. Also, GME is looking to be a player in the custom PC build market. That combined with Cohen bringing E-commerce experience has made the stock a bull play. \n\nThis is all separate from the short squeeze happening currently. Totally fascinating IMO.",
        "created_utc": 1611420710,
        "id": "gkekm83",
        "score": 59,
        "subreddit": "investing",
        "created": 1611449510.0
    },
    {
        "author": "realmastodon2",
        "body": "Apple is one of the safest stock you can own. They are very strict in their financials. MSFT is another company as well.",
        "created_utc": 1611249989,
        "id": "gk2x860",
        "score": 57,
        "subreddit": "stocks",
        "created": 1611278789.0
    },
    {
        "author": "theguineapigssong",
        "body": "When I was in elementary school we learned that the stock market existed.  I came home and found my dad setting up our brand new computer.  I picked up the instruction manual for MS DOS, looked at it, and said \"Dad, you should buy stock in this!\".  He told me to go play outside.  It was 1987, MS stands for Microsoft, and those stocks we're about 37 cents a share that year.  I'd be mad, but I wouldn't take stock tips from a second grader either.",
        "created_utc": 1610369141,
        "id": "givhran",
        "score": 57,
        "subreddit": "wallstreetbets",
        "created": 1610397941.0
    },
    {
        "author": "TheMadBeaker",
        "body": "Imagine this time next year, nobody sells... Headlines read, \"GameStop to acquire Amazon, Google, Apple, and Microsoft.... WSB group rejoices!\"\n\nLMAO!!! I know, I know... Funny to think about though.",
        "created_utc": 1611934113,
        "id": "gl8vo39",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1611962913.0
    },
    {
        "author": "framesh1ft",
        "body": "That’s how Gabe Newell founded Valve and made Steam with his Microsoft money. Not many ppl know but GabeN was in a small group of ppl that ported Doom to windows from dos proving that Windows was a good gaming platform along with the birth of DirectX",
        "created_utc": 1610041556,
        "id": "gig3b3l",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1610070356.0
    },
    {
        "author": "brewvarlet",
        "body": "Instructions unclear; bought $MSFT",
        "created_utc": 1612062520,
        "id": "glfvh90",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1612091320.0
    },
    {
        "author": "PrefersDigg",
        "body": "This is what I own currently - MSFT is just a fantastic company.",
        "created_utc": 1611034066,
        "id": "gjsv63q",
        "score": 54,
        "subreddit": "investing",
        "created": 1611062866.0
    },
    {
        "author": "JamesBigam",
        "body": "The way I look at it is Gamestop is now teamed up with Microsoft so they are turning around no matter what. Even if I'm stuck holding shares, they will go back up eventually.",
        "created_utc": 1610741228,
        "id": "gjdnied",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1610770028.0
    },
    {
        "author": "Powellwx",
        "body": "\"***5 - Subscriptions - Here's where the MSFT deal is bigger than I think it's being talked about. MSFT did something interesting with their next-gen consoles. They had a deal where you paid 24.99 a month for 2 years for the new console and got a Gamepass subscription included.\"***\n\nHere is the $$$$ and the future. Download speeds are quick enough and on-line gaming is universal.\n\nRemember when we use to drive to Sears and buy a VHS copy of E.T. - Then we rented Rocky IV from Blockbuster - Now we stream movies from NetFlix.\n\nGamestop Servers + NextGen consoles (also PC gaming) and you can play ANY FUCKING game you want, whenever you want for just $24.99 / mo.\n\nThe Boomers keep saying this is Blockbuster.... **but it is really NetFlix**.",
        "created_utc": 1611193593,
        "id": "gk0iupp",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1611222393.0
    },
    {
        "author": "meekforce",
        "body": "Did you know MSFT has a multi-year strategic partnership with GME? Personally, I like the stock.  Both of them.",
        "created_utc": 1611820706,
        "id": "gl2axay",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1611849506.0
    },
    {
        "author": "campl0",
        "body": "was that 2019?  When some asshat said \"WE CONTROL THE STOCKS.  Everyone buy 200c of msft!\"",
        "created_utc": 1611875343,
        "id": "gl5t9f8",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1611904143.0
    },
    {
        "author": "Youwillbe_Youwillbe",
        "body": "**Wtf?** Why were all the news pundits saying there’s no fundamentals when they have a partnership with their childhood sweetheart, Microsoft.",
        "created_utc": 1612044422,
        "id": "glewe9q",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1612073222.0
    },
    {
        "author": "catsflippinbirds",
        "body": "https://news.microsoft.com/2020/10/08/gamestop-announces-multiyear-strategic-partnership-with-microsoft/",
        "created_utc": 1612044039,
        "id": "glevmk5",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1612072839.0
    },
    {
        "author": "djshotzz504",
        "body": "I think this goes beyond that. Microsoft has CRM and data analytics software. I guarantee that is included in the deal. Gamestop gets huge exclusive with Microsoft incorporating their software gathering data on how to better reach their customer basis.",
        "created_utc": 1611004121,
        "id": "gjrbr71",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1611032921.0
    },
    {
        "author": "euiv",
        "body": "I thought it was MSFT 220c? Man, so many people got fucked with that cause of the rona",
        "created_utc": 1611875405,
        "id": "gl5teph",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1611904205.0
    },
    {
        "author": "Platotalks",
        "body": "You’re an asshat. I bought GME proudly. I am buying AMC proudly. Fuck off with your discrimination. \n\nAMC is just as heavily shorted and the movies are as equally important as a common man institution as video game stores. And I have my fucking reasons you petulant fuckface. \n\n1. I love the fucking movies and I reject bankruptcy motivated short sellers who will kill the employment of thousands of people. I reject them, I reject them, I reject them.\n\n2. The principle behind GME is also an attack on inequality through a rejection of our current manipulative financial system. Short selling is not just 75% bullshit, during a pandemic it’s 150% blood-seeking. Does anyone really believe AMC was headed into immediate bankruptcy without the pandemic.\n\n3. I am an AMC member and continued paying my monthly rate even when AMC was shut down by the pandemic. Why? Because I support businesses I believe in.\n\nI buy Apple, Disney, Microsoft, and a whole bunch of businesses because I believe in them. I also buy AMC because I believe in it.\n\nI love the movies, AMC is near me, and I want it to remain in the area. \n\n4. I want PRIVATE CAPITAL to give a shit about SOCIAL CAPITAL. In 2008, the public bailed out Wall Street for absolute fraud. And then the banks made obscene money and delivered huge bonuses.\n\nSo why can major financial institutions invest in the things that will prop up businesses? Why shouldn’t they fucking want to? Why do we need to keep inflating our currency by printing money as a means to prop up the already wealthy?\n\nWhy can I scream right back in their face and say STOP BEING AMORAL FUCKS — and Bet On The Recovery that working people need. Bet directly on working people.\n\nThis is why I am LONG AMC AND GME.\n\nAnd fuck the op for his judgmental self-righteous ass-hattery. \n\n5. Most importantly, AMC is heavily invested in by the movement. You can suppprt it for be left behind. You are welcomed to join but don’t tell people not to who believe in the cause. If you do that, then you’re know better than CNBC that keeps reporting GME will lose steam, Jim Cramer who recommended that everyone just stop, or Robinhood who restricted my purchase of buying AMC just as much as GME purely because WE WERE WINNING.\n\nSo fuck you, 🚀🚀🚀🚀🚀🚀, this is just the beginning. LONG AMC.",
        "created_utc": 1612015717,
        "id": "gld9io3",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1612044517.0
    },
    {
        "author": "New_Courage1259",
        "body": "Known Vulnerabilities is exactly on point.\n\nI have a degree in Computer Science,  I’ve engineered systems that run on Windows, Unix, Linux, containers using Docker and Kubernetes.  Open source software will always have more known vulnerabilities because the code base is easily viewed.  Many people with diverse engineering backgrounds can view that code.  This leads to more vulnerabilities being found, but also to more of those vulnerabilities being fixed, and fixed faster than closed source operating systems.\n\nThere’s a reason why Black Hat hackers love to take advantage of organizations that use windows.  It’s not that Linux is impossible to hack but exploiting windows is easier by an order of magnitude.  Those people that hack for profit usually take the path of least resistance to profit.\n\nAs of macOS Catalina Apple removed all old NeXTSTEP(based on BSD Unix 4.4) code and the OS is now entirely based on FreeBSD Unix with some Apple custom written code on top of it.\n\nFreeBSD is an entirely open source operating system.  It has many contributors but not as many as Linux and is not as popular, it is still considered more secure by miles than the windows kernel.\n\nWindows makes some very stupid architectural decisions when it comes to security.  Couple that with the performance of the windows kernel  vs the Linux kernel and you now know why most cloud providers exclusively offer Linux.\n\nMicrosoft relies on “capturing” your business and making it difficult to use other technologies as integrating with a Microsoft ecosystem is more opaque than say integrating Linux systems with FreeBSD.  Hell even the majority of Azure Cloud instances are running some kind of linux.\n\nIntegration is the name of the game in tech the tech world at the moment.  Any company not moving to the cloud and away from Microsoft is frankly behind the curve.\n\nHow does this relate to blackberry?  Blackberry devices use two operating systems Blackberry 10 and Android.  Blackberry 10 Based on QNX shown in this chart had its last release three years ago in April and the company has moved to android as of 2019.  Like Microsoft and their Azure Cloud Platform  Blackberry sees that custom homegrown closed source operating systems are dying.  I have a feeling that before the end of the decade Microsoft Windows will either be defunct or will no longer use the closed source NT kernel and be a distribution of Linux or based on some kind of Unix.\n\nTech companies are seeing the writing on the wall folks the open source operating system revolution isn’t just a passing fad but a trend that’s been on the rise for years.  Don’t bet on the losers folks, bet on where the tech industry is innovating, open source software and platforms.\n\nAnyone telling you to buy BB based on Blackberry QNX is either ignorant to the latest trends in tech or are trying to pump the stock and make money off your ignorance.",
        "created_utc": 1611415845,
        "id": "gkdzgzd",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1611444645.0
    },
    {
        "author": "jberm123",
        "body": "Comparing Tesla to AOL is absolutely ridiculous. AOL was fundamentally structured to be incompatible with the Internet. Meanwhile Tesla is selling the physical product everyone else is fumbling over themselves to play catch up on, and will clearly play a critical role in the next 20 years. Leaps and bounds different. Even if the Tesla bubble pops, it’s the Amazon or Microsoft or Apple of 1999.",
        "created_utc": 1610026378,
        "id": "gif8f0i",
        "score": 48,
        "subreddit": "stocks",
        "created": 1610055178.0
    },
    {
        "author": "FPettersson",
        "body": "Low volume = good. Makes it harder for them to cover their short positions. It arguably suggests people are actually staying 💎👐\n\nJust google other stocks. NIO? Down. TSLA? Down. AAPL? Down. MSFT? Down. GOOG? Down.\n\nMy bet is that they’re pulling their money from other stocks to get ready for one last stand. \n\nI am confident that we are winning.\n\n💎👐\n\nThis is not financial advice, just my take on the situation.",
        "created_utc": 1611944781,
        "id": "gl9pira",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1611973581.0
    },
    {
        "author": "finitelite",
        "body": "Let them start shorting Microsoft by 350%",
        "created_utc": 1612035088,
        "id": "gleczh9",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1612063888.0
    },
    {
        "author": "zephyy",
        "body": "MSFT - doing everything right under Nadella, not only is Azure a cash cow but they're positioning themselves as the one-stop shop for development and devops for both Windows and Linux. Figure out how to consolidate GitHub and Azure Devops's overlapping roles and fill any holes missing in comparison to Jira and Atlassian has no reason to exist.\n\nNET - The only reasonably priced solution for non-enterprise CDN and WAF. Potential revenue growth in their seat based pricing model for user identify stuff to replace things like corporate VPNs.\n\nPLTR - i'll be honest, i just want a lotto ticket.",
        "created_utc": 1610086882,
        "id": "giilhqs",
        "score": 47,
        "subreddit": "investing",
        "created": 1610115682.0
    },
    {
        "author": "BreadTie_",
        "body": "Just got a free MSFT share for my friend making a RH account. Nice way to end green day.",
        "created_utc": 1609882588,
        "id": "gi876i4",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1609911388.0
    },
    {
        "author": "JimmyTango",
        "body": "Many retail investors don't understand this element of tech companies. When you hit the top the people you attract are looking for a job that gets them to retirement, not to burn the midnight oil innovating new solutions. A lot or people worship at the alter of Elon and Steve Jobs, but truly the most impressive business leaders are people like Satya Nadella who's made progress in culture at MSFT and has shifted their business in a matter of years without a total blood bath or without volatility in the share price. Tech titans can be just as if not more bureaucratic than the government a their worse.",
        "created_utc": 1611078724,
        "id": "gjup6ls",
        "score": 46,
        "subreddit": "investing",
        "created": 1611107524.0
    },
    {
        "author": "some_random_kaluna",
        "body": "Step 1. Go to your screensaver. \n\nStep 2: select the one that allows text on screen. \n\nStep 3: type F*CKING HOLD for the text. \n\nStep 4: adjust the wait period so your screensaver activates every 2 minutes. \n\nStep 5: profit while not giving a fuck. \n\nYou're welcome. Microsoft, hire my ass.",
        "created_utc": 1611863135,
        "id": "gl4wh50",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1611891935.0
    },
    {
        "author": "i_speak_gud_engrish",
        "body": "Thanks for the tip. I’m going to pick up a $GME share on Monday morning using Microsoft Word.",
        "created_utc": 1612098341,
        "id": "glh5tbz",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1612127141.0
    },
    {
        "author": "babagandu24",
        "body": "Why BlackBerry Stock Will Eventually Ride Much Higher\n\nBlackBerry's automobile and IT security products, along with its settlement with Facebook, will boost BB stock.\n\nThose who are bearish on BlackBerry (NYSE:BB) — including the many people who are short-selling the name — continue to vastly underestimate how much money the company can make. That’s because BlackBerry’s cybersecurity business is bolstering BB stock, with more upside on the horizon from connected vehicles and more. Basically, cybersecurity threats are becoming more prevalent as we advance technologically and this company stands to gain.\n\nM￼ore specifically, the BlackBerry naysayers have failed to take into account the strength of the company’s security products like Spark. And that’s not all — BlackBerry also has a very large payment in-store, which it’s likely to receive soon from social media giant Facebook (NASDAQ:FB).\n\nSo, here’s why BlackBerry will climb much higher in the future.\n\nBB Stock and Connected Cars\n\nMorgan StanleyÂ (NYSE:MS) embraced “the monetization of connected cars” this past November. Specifically, bank analyst Adam Jonas stated that “Tesla is on the verge of a profound model shift from selling cars to generating high margin, recurring software and services revenue […] [from] infotainment and performance upgrades.â\u0080\u009d But instead of focusing on Tesla (NASDAQ:TSLA) in the connected car space, I’d like to zero in on BB stock.\n\nBack in January 2018, I thought BlackBerry could make money by selling subscriptions through driverless cars. At the time, I wrote that it could sell “ads, data, extra security features, and apps” in the space. Now I believe that prospect is even more possible. The company can — through its highly secure QNX operating system (OS) — ultimately sell such products and services to the owners of all connected vehicles.\n\nYears ago, I noted something else, too: “BlackBerry can sell data that it obtains from consumers who use its self-driving operating system.” Now in 2021, the idea of collecting and selling data from drivers has become mainstream. Even the notion of selling extra car security features has been raised. In fact, only the thought of selling tracking systems and ads is less prevalent now. However, I still believe that the company will be able to sell such products.\n\nWhat BlackBerry Sells\n\nOne way to think about BlackBerry’s situation in connected cars is to compare it to Microsoft (NASDAQ:MSFT). Of course, that company sells operating systems for computers. But just as Microsoft has made money from software sales, BB can profit from selling OSs for our increasingly tech-advanced vehicles.\n\nSound odd? Well, Amazon’s (NASDAQ:AMZN) decision to work alongside the company to “develop and market BlackBerry’s Intelligent Vehicle Data Platform” validates these offerings even further. Even BaiduÂ (NASDAQ:BIDU) has gotten in on BlackBerry’s technology, opening up BB’s ability to meaningfully penetrate the Chinese auto market.\n\nMeanwhile, QNX has also been installed in other spaces, including applications in aerospace and defense, medical devices and “industrial automation.” With devices of all sorts now being connected to the internet, the number of endpoints that need the security BB provides will likely skyrocket.\n\nSpark Will Jump Start Revenue, Facebook Will Pay\n\nClearly, BlackBerry’s upside is not limited to the connected car space alone. To that end, in May 2020, the company announced Spark Suites. This new security product will provide companies and governments with “a range of tailored cybersecurity and endpoint management options.”\n\nMore specifically, BlackBerry has integrated “endpoint management, user authentication, and application and data encryption” from its original systems with “artificial intelligence (AI), machine learning (ML) and automation for improved cyber threat prevention and remediation.” Altogether, this new product is a comprehensive and competitive development.\nBecause of that, I believe that the strength of Spark will be able to meaningfully lift the company’s financial results over time.\n\nBut that’s not the only boon for BB stock. On. Jan. 15, BlackBerry also announced that it had settled its patent-infringement lawsuit with Facebook. The dispute involves patents on messaging technologies, which are quite vital to FB’s huge business.\n\nAs a result of the settlement, I expect BlackBerry to receive a large, multi-billion dollar payment from the social media giant. That’s sure to greatly boost BB stock, too.\n\nBottom Line\n\nIt’s true —Â right now, BlackBerry’s shares are very volatile. Why? The Reddit stock forum, Wall Street Bets (WSB), recently targeted it alongside other names in a massive short squeeze. That situation could continue for some time.\n\nBut I’m convinced that BB stock will climb much higher over the long term. Given these points, I recommend that long-haul growth investors buy shares of BlackBerry now. Investors should also be prepared to buy roughly the same number of shares again if BB pulls back meaningfully in the near-term.",
        "created_utc": 1611961888,
        "id": "glazbwr",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1611990688.0
    },
    {
        "author": "teslas_love_pigeon",
        "body": "Dude look at all the old boomer ass defense companies. Their software is literally decades in the past. Palantir has modern practices and modern sales techniques (SaaS). Reoccurring subscriptions is one of the best ways to get shareholder value. It's why companies like Disney (D+), Netflix, Amazon (Prime), and Microsoft (O365, Azure, Xbox live) gain massive value.\n\nNow imagine a defense company doing this to the US and its allies across the world.\n\nPalantir is absolutely a great bet.",
        "created_utc": 1610564628,
        "id": "gj54ohh",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1610593428.0
    },
    {
        "author": "nanmart",
        "body": "MSFT. I’m 100% a Mac user now.",
        "created_utc": 1611107459,
        "id": "gjwd902",
        "score": 44,
        "subreddit": "stocks",
        "created": 1611136259.0
    },
    {
        "author": "Dawgstradamus",
        "body": "Decided yesterday, after some considerable DD &amp; 9 drinks, to do the same on Tuesday.\n\n\nSelling all my Ark F&amp;G, NVDA, MSFT, etc.\n\nIt’s all going in BB.\n\nI’m done being in stocks that are trading at 40+ times earnings.\n\nBB is at 4.5 x earnings. It has the power of the meme. It has a real competitive advantage &amp; a value prop.\n\nIt’s already made me + 50% in my first 750 shares.\n\nLong live Cathy, long live Chen.\n\nRebalancing to 100% BB &amp; deleting my TD Ameritrade app.\n\nSee ya in a few years!🚀🚀🚀🚀",
        "created_utc": 1610938576,
        "id": "gjojcae",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1610967376.0
    },
    {
        "author": "treesandbeers",
        "body": "blah blah blah, none of these points takes into consideration Ryan Cohen now leading this franchise to an evolved e-commerce-based full-stop shop for everything gaming-related. ESports, Geek gear, Build-a-PC, rev share with MSFT, etc.",
        "created_utc": 1611259268,
        "id": "gk3hxyp",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1611288068.0
    },
    {
        "author": "Tyran_Scorpi",
        "body": "TSLA, T, AMD, PG, MSFT, ROKU, GE, SGMS\n\n 💎✋ GME\n\nGood luck with that.",
        "created_utc": 1612114435,
        "id": "glhym5l",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1612143235.0
    },
    {
        "author": "Misofire",
        "body": "Set Bing as your default search engine on whatever you use (Chrome, Edge, Firefox, etc). Every time you type literally anything into the search bar you get 5 credits. You can then go into Bing Rewards and claim stuff when you have enough credits. So there are 1, 3 and 6 month memberships, other prizes are gift cards to places like the Microsoft store, Starbucks, Amazon, Target, whatever else you can find on their website. It's the search engine  wars and Microsoft is literally paying you to use their engine.",
        "created_utc": 1611334463,
        "id": "gk7a2sw",
        "score": 43,
        "subreddit": "stocks",
        "created": 1611363263.0
    },
    {
        "author": "SPCEshipTwo",
        "body": "Even if the massive short squeeze doesn't happen this is a long play with Cohen (Chewy founder) on board, closing dead weight stores, making the most of their e-commerce (up over 300% for the holiday period), the deal with Microsoft to receive a share of digital revenue and the potential to stock more PC parts/have build a PC kiosks to rival Micro Centre with a more local footprint.",
        "created_utc": 1611265693,
        "id": "gk3w9io",
        "score": 43,
        "subreddit": "stocks",
        "created": 1611294493.0
    },
    {
        "author": "flannel_jackson",
        "body": "Do you not know what people thought of MSFT before nadella?",
        "created_utc": 1610119078,
        "id": "gijq2bf",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1610147878.0
    },
    {
        "author": "DBroker1997",
        "body": "Listen up tards, I don’t want to interpret more into it than it probably means. But the fact that the indices are selling off (especially tech on super duper huge fucking big cock earnings) might be a sign of rising nervousness and the liquidation of the short‘s other positions to meet margin requirements. Why else would Apple, Facebook and Microsoft sell off after basically their best reports ever.",
        "created_utc": 1611941212,
        "id": "gl9fj0p",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1611970012.0
    },
    {
        "author": "Revolant742",
        "body": "HOLD THE FUCKING LINE. If you're NOT BUYING the DIPS you're never going to beat the funds. Fuckers need to pay. We need make this stand now🚀 🚀 🚀🚀🚀🚀🚀🚀🚀🚀\n\n^aapl ^140c\n\n^msft ^to ^the ^moon",
        "created_utc": 1612128653,
        "id": "glitmbv",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1612157453.0
    },
    {
        "author": "brbcripwalking",
        "body": "Since market insider is a piece of shit and it crashed,\n\nI don’t know how pricing translates but here is Europe right meow. Keep in mind some of these could have changed while I was typing.\n\nTSLA is up 1.07%\n\nNVDA is up 0.71%\n\nAMD is up 0.46%\n\nAAPL is up 0.60%\n\nAMZN is up 0.68%\n\nGME is up 14.10%\n\nPYPL is up 0.35%\n\nRIOT is down 0.18%\n\nGM is up 0.24%\n\nNFLX is up 0.48%\n\nFB is up 1.86%\n\nMSFT is up 0.99%\n\nGOOG is up 0.51%\n\nNIO is up 0.62%\n\nBears are looking fuk",
        "created_utc": 1611041807,
        "id": "gjt55pa",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1611070607.0
    },
    {
        "author": "Beo1",
        "body": "I think MSFT makes Halo now, very bearish",
        "created_utc": 1610605630,
        "id": "gj7chpa",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1610634430.0
    },
    {
        "author": "Nicolas873",
        "body": "https://arstechnica.com/gaming/2020/10/microsoft-will-give-gamestop-a-share-of-xboxs-digital-revenues/",
        "created_utc": 1610907030,
        "id": "gjmlwco",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1610935830.0
    },
    {
        "author": "RollinggearsOT",
        "body": "My company is trying out Microsoft team. It has so many integration features over zoom. I think more company is going to use Team in 2021. I still like to use zoom alot. It makes our meetings so much easier last year.",
        "created_utc": 1610109469,
        "id": "gija4iw",
        "score": 40,
        "subreddit": "investing",
        "created": 1610138269.0
    },
    {
        "author": "cbus20122",
        "body": "I would probably be defined as a bear by most on here, but you still have to get time-frames correct. Until then, you might as well ride momentum.\n\n&gt; Vaccine is rolling out, interest rates are low for the next decade, a stable president is going into office, and trade war with China is finally coming to an end as China and US move towards friendship once again. \n\nFirst off, you're getting this stuff wrong. \n\n1. Biden has been very vocal that he will continue to work ***against*** China. Hence his support for Pompeo's labeling of genocide, and his reaction against China's sanctions against Trump's staff members. Thinking things are just going back to normal here is completely wishful thinking.\n2. Vaccine rollout is going, but it's hitting hiccups, and we're also facing potential new variants of the virus which are more contagious. Hard to say how much this does or doesn't matter, but it's something that the market does not seem to be pricing in right now.\n3. Interest rates being low is not necessarily as supportive as you may think. The market could easily view this through the lens of \"if we see another economic shock, there is no more ability to lower rates\". IE, removing the fed put to a degree. And yes, I know we can go negative, but that causes other problems and for now, the fed has been vocal about not wanting this. In other words, it would likely take a very significant shock for the fed to decide to go negative on rates. \n\n&amp;#x200B;\n\n**The Stuff You're Missing**\n\n1. Debt, debt, and lots of debt. Most financial crises are a product of debt in one way or another. And guess what the entire world has? Far more debt than we've ever had before. We also have worse demographics, and worse growth. Hence why the global economy has been propped up by central banks for the last few years, unable to transition back to ***not*** requiring QE / zero percent rates. \n2. The problem with the above is that now that everyone is at zero percent rates, there is a transition towards using more fiscal policy to stimulate. That's required because monetary policy is no longer as effective, we're already at zero percent rates, and it's just causing it's own problems. Fiscal policy typically causes inflation. Inflating over-indebted societies causes financial crises, generally speaking.\n3. We're still out of a ton of jobs. More than the GFC, more than any time since the depression. While some will come back upon reopening, a lot won't. That's a problem, especially if those people can't transition  back into working effectively. \n4. Long term interest rates keep rising with more promise for fiscal policy. This causes tightening in our economy that we simply can't handle. At some point, the market will start to price in rising long term interest rates as a big negative for risk assets, especially the high-p/e stocks that have been the major trade for most market participants over the last 4-5 years.\n5. Record speculative market activity typically mean-reverts at some point. We've seen a shit ton of speculation in the last few months especially, major call option yolo'ing tends to mean revert once the supply of $ to the people buying these items slows down. Those call options have done wonders in pushing markets upwards, but it will require a constant supply of purchasing to keep markets elevated. It's a supply-demand thing in reality, and the supply of buyers speculating in meme stocks is not going to stay at the current pace long-term. When that slows down, you'll likely get a move downward that's even sharper than the move upward.\n6. Zero percent rates push everyone into far more risky financial assets. This has two effects. First, it can push the market up by providing a bid for those risky assets. But on the other hand, it introduces more downside risk if things start moving the opposite way. In short, we get market support at the cost of increasing market fragility and the propensity to see large shocks downward when stuff breaks.\n7. Antitrust + less business friendly political environment. This is a risk that has been considered for a long time, but it's much more likely to happen now. Antitrust suits can take out market leaders ala Microsoft in 2000. Taking out market leaders = bad for markets as a whole. FWIW, I don't think Biden is going to make the environment \"bad\" for business, it's just that we're transitioning away from an administration that created the most favorable financial conditions for corporates in history.\n\nThere is more I can add. But there is **always** more stuff to worry about. Markets do climb a wall of worry, and in today's market structure, we tend to see grinding slow rides upwards with very sharp and sudden selloffs downwards. Markets can and do stay elevated far longer than most bears usually think possible. \n\nRegardless, there is ***plenty*** of very real and very noteworthy risk in the markets today. I would argue there is more now than almost ever before, but we also are getting more government support at a quicker rate than ever before. This prevents cascading impacts of negative economic shocks in a lot of ways, which then provides confidence for investors to speculate.",
        "created_utc": 1611241275,
        "id": "gk2e39k",
        "score": 40,
        "subreddit": "investing",
        "created": 1611270075.0
    },
    {
        "author": "Sayter",
        "body": "upcoming week.\n\nheavy rotation is AAPL/TSLA/MSFT\n\nlight rotation is GME/BB/PLTR\n\nwatching for the fucking rotations.\n\nit might save your account.",
        "created_utc": 1611458633,
        "id": "gkhlwum",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1611487433.0
    },
    {
        "author": "Bartonias",
        "body": "I don’t ever remember my account being frozen when I lost $50k on Microsoft 200c. Fuck these criminals.",
        "created_utc": 1611849387,
        "id": "gl3ufit",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1611878187.0
    },
    {
        "author": "CallinCthulhu",
        "body": "It took Microsoft 15 years to reach its Tech bubble valuation again.\n\nSo keep in mind it’s not as simple as “I’ll just hold forever, it will eventually reach the same price again”\n\nOpportunity cost will kill you doing that",
        "created_utc": 1610126762,
        "id": "gik6lw3",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1610155562.0
    },
    {
        "author": "veryforestgreen",
        "body": "1. Borrow rate isn't indicitive of short interest %. It's based on demand, rates jump up when there is large demand with respect to time. The greater the demand in the smaller amount of time, the higher the rates.\n2. People are comparing the END OF CYCLE NUMBERS to the start of the cycle. Comparing December numbers where there was massive lockdown where retailers left and right are closing stores is going to hurt GME. No SHIT SHERLOCK. With the difficulty  in procuring any gaming hardware in general, just look at PC hardware or PS5/Xbox Series X, of course sales will be down in general. Most of their business \"AT THE MOMENT\" is still retail, they're not going to post gang buster numbers in December. Instead what we'll most likely see is a spread out increase in their earnings over several quarters as opposed to all front loaded as they normally are in the holiday season.\n3. Their E-Commerce jumped 300% also same as 2. They are comparing literally end of cycle numbers, PANDEMIC lockdown, supply shortages and zero rev from Microsoft shared earnings are included in there. I thought the market is forward looking not backwards.\n4. Hedge funds are WRONG ALL THE FUCKEN TIME just look at TSLA. Only time will tell how high GME will go but at this price point you are dead fucken wrong. As for GME, these retards were at the fucken sleep at the wheel, when GME traded at 3$, any fucken person with a brain cell would of closed out their position after a 98% possible GAIN and put their capital elsewhere. These \"reputable hedge fund\" are fucken greedy pigs that are getting slaughtered.\n5. Except they're SPECIFICALLY SAID in their earnings THEY DO NOT NEED MONEY. Q3 earnings transcript THIS QUESTION WAS ASKED SPECIFICALLY, THEY SHOT BACK AND SAID THEY DO NOT NEED IT AT ALL. They are sitting on 500m CASH and paying back debt EARLY, they're going to be swimming in cash from the new console cycle, THEY HAVE 102m STILL ALLOCATED CASH TO STOCK BUYBACK. They'll issues shares when they squeeze those retard shorts when GME trades at 420.69$.\n\nFUCK YOU SHITRON.",
        "created_utc": 1611265109,
        "id": "gk3uysr",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1611293909.0
    },
    {
        "author": "Regenbooggeit",
        "body": "[https://www.fool.com/investing/2021/01/20/3-wildly-undervalued-stocks-to-buy-for-2021/](https://www.fool.com/investing/2021/01/20/3-wildly-undervalued-stocks-to-buy-for-2021/)  \n\n\n*1. GameStop*\n\n*Trading at just 0.4 times revenue, GameStop (NYSE:GME) is severely undervalued because, well, everyone seems to doubt it -- and not for unjustifiable reasons. In fact, over $1.36 billion of the company's $2.19 billion worth of shares are sold short. Many investors see no reason not to bet against a brick-and-mortar retailer that is still selling physical copies of video games when they are nearly universally available online.*\n\n*If this is your view, you may be surprised to learn that GameStop is still doing pretty well despite its fair share of challenges. During its nine-week holiday sale ended Jan. 2, the company managed to bring in $1.77 billion in revenue, a modest decline of 3.1% from the same period last year. But in the interim, management closed 11% of its stores for being unprofitable; after adjusting for that, sales for the remaining locations actually went up.*\n\n*GameStop now has a robust e-commerce segment -- it's growing at a stunning rate of 309% year over year, and it accounts for over a third of total revenue. Last year, management signed an agreement with Microsoft to update its stores with the tech giant's software and cloud data solutions. In return, GameStop will be eligible for a commission on all digital revenue (such as video game purchases) generated from Microsoft's Xbox platform.*\n\n*Ryan Cohen, a co-founder of online pet food retailer Chewy, joined GameStop's advisory board on Jan. 11. His venture capital firm now owns 13% of the company's outstanding shares.*\n\n*Given these catalysts, I expect GameStop to turn around its operations in no time. Over the past year, its stock is already up a whopping 683%. Even after an amazing run up, though, its market cap ($2.6 billion) is still less than half its annual revenue ($6.46 billion). That makes for a price-to-sales ratios (P/S) far lower than what most retailers are trading at. If you're looking for stocks with the potential to double over time, consider GameStop.*",
        "created_utc": 1611241284,
        "id": "gk2e3v1",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1611270084.0
    },
    {
        "author": "IndIka123",
        "body": "I agree. Gamestop needs to cater to PC gaming to be successful. There currently does not exist a business which specialises in turning console gamers into PC gamers. Twitch is growing, all the best streamers all these current kids growing up are watching play PC. it's all my god damn nephew's talk about. It's why microsoft pivoted to meld PC platform with xbox. It's brilliant. All these kids growing up that made all these youtube and twitch streamers millionaires are going to want PCs. Who's going to sell them those towers pre built? There is a legit business their and gamestop would be perfect.",
        "created_utc": 1611132131,
        "id": "gjxdla6",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1611160931.0
    }
]