[
    {
        "author": "EEolks",
        "body": "Yeah the gt3 is nice but is that a prius with a spoiler infront of it?",
        "created_utc": 1634501454,
        "id": "hh0wzqk",
        "score": 5511,
        "subreddit": "wallstreetbets",
        "created": 1634530254.0
    },
    {
        "author": "joeabauer",
        "body": "Holy shit, a 15 yr CAGR of -48%?! You really know how to lose money.\n\nFor those of you who can’t math, if he started with $1M, it would now be worth $54.",
        "created_utc": 1633357090,
        "id": "hfcpu45",
        "score": 3470,
        "subreddit": "wallstreetbets",
        "created": 1633385890.0
    },
    {
        "author": "WallStreetSewerGator",
        "body": "We don't, bro. We shitpost and tease each other about it as a coping mechanism.\n\nThey say never risk what you can't afford to lose, but the reality is nobody can really afford to lose anything.",
        "created_utc": 1633299966,
        "id": "hfa5o2u",
        "score": 3011,
        "subreddit": "wallstreetbets",
        "created": 1633328766.0
    },
    {
        "author": "DidYouReadThatThing",
        "body": "Yeah but Berkshire Hathaway sounds old as fuck, grandpa, tesla is new and trendy. All the cool kids are doing it!",
        "created_utc": 1635361084,
        "id": "hia63zw",
        "score": 2618,
        "subreddit": "wallstreetbets",
        "created": 1635389884.0
    },
    {
        "author": "killsforsporks",
        "body": "I've been putting $25 a week in an S&amp;P ETF for my almost three year old since the day he was born and he is destroying me when it comes to percentage gained over the last three years",
        "created_utc": 1635690634,
        "id": "hirmugq",
        "score": 2315,
        "subreddit": "stocks",
        "created": 1635719434.0
    },
    {
        "author": "Crownlol",
        "body": "Simply inherit ten million dollars and turn it into two million! Anyone can be a millionaire, why can't you?",
        "created_utc": 1634992974,
        "id": "hhqj8s9",
        "score": 2218,
        "subreddit": "wallstreetbets",
        "created": 1635021774.0
    },
    {
        "author": "Loan-Pickle",
        "body": "Word of practical advice. Don’t say another word about this or discuss investing with your mother in law any more. As you said she is happy with the performance of her portfolio and you disagree with it.  If you pressure her to change it and something goes wrong, your wife will blame you for messing up her mothers retirement.\n\nIt is best to not mix family and money.",
        "created_utc": 1633572744,
        "id": "hfojq79",
        "score": 2091,
        "subreddit": "investing",
        "created": 1633601544.0
    },
    {
        "author": "D35m0J03",
        "body": "He’s a true autist if you think about it..",
        "created_utc": 1633894093,
        "id": "hg50q1q",
        "score": 1947,
        "subreddit": "wallstreetbets",
        "created": 1633922893.0
    },
    {
        "author": "MajorJin",
        "body": "I think a better question would be, what is wrong with our hiring and employment practices? \n\nFor perspective, I am an operations manager for a Fortune 500 company, and I oversee around 300-350 employees on average who make between $30-40/hr with good benefits. \n\nIs the problem that corporations are holding too close to archaic wage, hiring, and management practices? Or is the real problem that \"Working Class\" people are fed up with either underpaid, undervalued, or having their sense of job security taken away. I mean honestly how dare the working class want something better. \n\nMost companies have not worked to create good company cultures. What I have seen over my working career in many industries is that employees are often undervalued by their managers and companies. Employees are not given clear paths for progression and have been beaten down with wage stagnation to protect and promote stock growth. Even at $40/hr our attrition rates are getting rough due to labor and wage practices.\n\nCurrent hiring practices are also to blame. Why do we have three interviews for a job that pays minimum wage? If you think that is bad, try applying for white collar or skilled jobs, where it takes not only multiple interviews, but MONTHS of waiting to find out if you got the job or not. Automated software is also to blame. It often removes dozens of valid candidates from the hiring lists in the attempt to find \"perfect\" candidates. \n\nThen comes 2020. Large sectors of the economy are labeled \"non-essential\" and are told to go home. In an instant, millions of people were told they are not an important part of the economy and their jobs could be taken away arbitrarily thus reducing their feelings of job security. \n\nAll of these factors and more have contributed to a massive amount of unfilled jobs. HR departments won't scrap non-working hiring practices, CEO's won't raise wages to attract talent, and our Government has yet make a concerted effort to regain public trust. \n\nDo I feel annoyed that people took the last few months to evaluate their participation in the workforce and aren't at Starbucks filling my order? Or do I understand that many took the time to create financial stability in other sectors and leave jobs where they were either undervalued, underpaid, or the government took their sense of job security?\n\n I do not feel sorry for companies that fail to recognize a shift in \"working class\" values. \n\nAlso, for the person who decided to make money off of investing and replaced their income, Good for you! I am glad you found a way to make income that you enjoy.",
        "created_utc": 1633834000,
        "id": "hg248xh",
        "score": 1771,
        "subreddit": "investing",
        "created": 1633862800.0
    },
    {
        "author": "ORBM1991",
        "body": "How did it take you 15 year to realize that?..",
        "created_utc": 1633356750,
        "id": "hfcp3bq",
        "score": 1732,
        "subreddit": "wallstreetbets",
        "created": 1633385550.0
    },
    {
        "author": "Sour_Smegmuh",
        "body": "You just need a disgusting amount of money in the first place, got it! 👍",
        "created_utc": 1635169847,
        "id": "hhzh4rz",
        "score": 1705,
        "subreddit": "wallstreetbets",
        "created": 1635198647.0
    },
    {
        "author": "NoDollarDamus",
        "body": "He should've owned that shit: \"dont know, dont care!  My analysts put some data in my face and I said BUY!!  The shit is *up*, Bob, get it?? Up START!!\"",
        "created_utc": 1634354138,
        "id": "hgtivpv",
        "score": 1617,
        "subreddit": "wallstreetbets",
        "created": 1634382938.0
    },
    {
        "author": "eliper3",
        "body": "We’re not laughing at you for buying $WISH at $4.70. We’re laughing at you for buying it at $7.86 😂.",
        "created_utc": 1633535631,
        "id": "hfm7w2l",
        "score": 1383,
        "subreddit": "wallstreetbets",
        "created": 1633564431.0
    },
    {
        "author": "amalgam_reynolds",
        "body": "Just for a little context, in case someone else needs it: GM sold [more than 2.5 million vehicles in 2020 in the USA alone,](https://www.best-selling-cars.com/usa/2020-full-year-usa-gm-sales-chevrolet-buick-cadillac-gmc/) whereas Tesla sold [less than 500,000 vehicles worldwide.](https://www.best-selling-cars.com/brands/2020-full-year-global-tesla-car-sales-worldwide/)",
        "created_utc": 1633235861,
        "id": "hf6rokg",
        "score": 1371,
        "subreddit": "wallstreetbets",
        "created": 1633264661.0
    },
    {
        "author": "liracobopu",
        "body": "Yes, over a long investment horizon, it is difficult to beat low-cost index funds. As Jack Bogle said, \"Don’t look for the needle in the haystack. Just buy the haystack.\"",
        "created_utc": 1635046306,
        "id": "hhtkgca",
        "score": 1300,
        "subreddit": "investing",
        "created": 1635075106.0
    },
    {
        "author": "StraightDollar",
        "body": "Everyone has known how bad Facebook is for years. Literally years. There has been CONSTANT negative press against Facebook since IPO. There has been a major blockbuster documenting what a weird cunt Zuck is. And time after time the FUD dissipates, there is zero new regulation, FB revenue and EBITDA flies up and we all move on with our lives \n\nThe reality with FB is that it is a business that is approaching the limit of the organic growth on its core business, is absolutely flush with cash, and is looking for the next big revenue driver to make it a 2tn company. Zuck believes it is the metaverse - that is not just rhetoric (you don’t hire 10,000 people to build it on a whim)\n\nThe big (and only) question you have to answer as a prospective investor is whether you agree with Zuck that meta is the next big thing or not",
        "created_utc": 1635455012,
        "id": "hifilwp",
        "score": 1300,
        "subreddit": "investing",
        "created": 1635483812.0
    },
    {
        "author": "Ratiocinor",
        "body": "Hey my wife's bf has some of these! What are they?\n\nHe tells me they're to keep his fingers clean while eating potato chips, then nudges my wife and they both laugh. But I'm not sure I believe him. Like how long does it take to eat a bag of chips! Sometimes they're in there all night",
        "created_utc": 1635709387,
        "id": "hisui4x",
        "score": 1253,
        "subreddit": "wallstreetbets",
        "created": 1635738187.0
    },
    {
        "author": "ma7994",
        "body": "I called the number and it was just someone telling me about my cars extended warranty",
        "created_utc": 1633192888,
        "id": "hf45psn",
        "score": 1219,
        "subreddit": "wallstreetbets",
        "created": 1633221688.0
    },
    {
        "author": "Keystoneptune",
        "body": "When I lost like 20k the first time it really really sucked and I was depressed. But right now I'm working my way to another 20k loss and its not so bad. You kinda get used to the pain.",
        "created_utc": 1633300270,
        "id": "hfa6cuk",
        "score": 1203,
        "subreddit": "wallstreetbets",
        "created": 1633329070.0
    },
    {
        "author": "TRUMPARUSKI",
        "body": "Following extensive research into the company, I can confidently conclude that it also “starts.”",
        "created_utc": 1634558200,
        "id": "hh3k0tu",
        "score": 1178,
        "subreddit": "wallstreetbets",
        "created": 1634587000.0
    },
    {
        "author": "Krahndaddy",
        "body": "A few things. Snapchat was a 100 billion dollar company making no money. If you ever logged onto snapchat the only way to see the ads is to watch the stories but majority of users only use snapchat to send each other snaps. Also the apple privacy rules were going to hit them hard and the market didn't react to it at all. 56% of all snapchat users are on iPhone. \nSnapchat also has a historically move of 17%. Yet the options chain was only pricing in a 10% move. So I knew is Snap missed earnings it would get hit hard. So I wasn't afraid of any IV crush",
        "created_utc": 1635122032,
        "id": "hhxh3gf",
        "score": 1162,
        "subreddit": "wallstreetbets",
        "created": 1635150832.0
    },
    {
        "author": "DamnStra1ght",
        "body": "One way to look at all these firms is that their primary job is not to make money, but to avoid losing it.  Their clients would be happier with lower returns if they can say that they have lower downside risk. \n\nWhich is fair if I had a few million or more, I'd  be a lot less willing to yolo my entire life savings on the market if I did not know how it worked.  Great post and very informative!",
        "created_utc": 1634042892,
        "id": "hgcjpku",
        "score": 1160,
        "subreddit": "stocks",
        "created": 1634071692.0
    },
    {
        "author": "I_am_Neuronaut",
        "body": "Wow dude knows Victoria's Secret models by name. He did the wise thing and kept jacking it to VS catalogues instead of diving into the depraved porn that ruined all of us. Now only midget loss porn gets me hard.",
        "created_utc": 1633711841,
        "id": "hfvgb2i",
        "score": 1142,
        "subreddit": "wallstreetbets",
        "created": 1633740641.0
    },
    {
        "author": "Organic_Current6585",
        "body": "This is exactly what I did today, I bought at open, got in for 120, then it halted twice.  During the second halt I sold at market price, and closed the deal for 160.  I was up $400 on the trade.\n\nStill I was down for the day because I also have an entire portfolio filled with Reddit meme stocks....",
        "created_utc": 1634936057,
        "id": "hho1qks",
        "score": 1131,
        "subreddit": "wallstreetbets",
        "created": 1634964857.0
    },
    {
        "author": "LkH64",
        "body": "Is it the stock market? Where all the shares are fake and the price doesn't matter?",
        "created_utc": 1633474203,
        "id": "hfjckg4",
        "score": 1107,
        "subreddit": "StockMarket",
        "created": 1633503003.0
    },
    {
        "author": "InterestingThought33",
        "body": "It is a cover up, typical Wall st behavior.",
        "created_utc": 1633871623,
        "id": "hg3lxwc",
        "score": 1100,
        "subreddit": "wallstreetbets",
        "created": 1633900423.0
    },
    {
        "author": "bocam5",
        "body": "Ah yes just needs to hit $50,000 per share and it will be in range of FB market cap. Probably get there today.",
        "created_utc": 1634903446,
        "id": "hhlxd3j",
        "score": 1022,
        "subreddit": "wallstreetbets",
        "created": 1634932246.0
    },
    {
        "author": "suna123",
        "body": "You think that's impressive? You could go from millionaire to sucking dick at Wendy's in only 1 bad trade, let me break it down. $3.1 M-&gt;$31(assume 0dte calls).",
        "created_utc": 1634746924,
        "id": "hhdm8hb",
        "score": 1015,
        "subreddit": "wallstreetbets",
        "created": 1634775724.0
    },
    {
        "author": "hxund",
        "body": "I bought in like 10 years ago and grabbed my shares at $34. We now hold about the same value but you did it in roughly 9 less years. Keep on running with it 🚀",
        "created_utc": 1635620132,
        "id": "hiobpw0",
        "score": 999,
        "subreddit": "wallstreetbets",
        "created": 1635648932.0
    },
    {
        "author": "Dan_inKuwait",
        "body": "If it drops.much more they'll just disable the sell buttons....",
        "created_utc": 1635346177,
        "id": "hi94ieo",
        "score": 984,
        "subreddit": "wallstreetbets",
        "created": 1635374977.0
    },
    {
        "author": "SnakeCharmer28",
        "body": "It should be impossible for people to be suprised by this.",
        "created_utc": 1635539349,
        "id": "hik4tt7",
        "score": 953,
        "subreddit": "wallstreetbets",
        "created": 1635568149.0
    },
    {
        "author": "icepck",
        "body": "Weird that this is the only post I see in WSB about it.",
        "created_utc": 1634848932,
        "id": "hhjcbdc",
        "score": 952,
        "subreddit": "wallstreetbets",
        "created": 1634877732.0
    },
    {
        "author": "dert-man",
        "body": "It will go up or maybe it will go down. Whichever way it goes, it will be a disaster.",
        "created_utc": 1634307675,
        "id": "hgqphb4",
        "score": 920,
        "subreddit": "wallstreetbets",
        "created": 1634336475.0
    },
    {
        "author": "feedmestocks",
        "body": "People that use the term hyperinflation don't know what it means or understand the scale of hyperinflation, we're talking buying a loaf of bread with a barrel full of money. The kind of situation needed for that to happen isn't going to happen as the globals banks will increase interest rates to control liquidity (the very liquidity that has allowed digital tokens he's shilling to exist). Jack Dorsey is basically gambling as Twitter has gone no where as a stock or monetisable entity and it gives Square its USP.",
        "created_utc": 1635026448,
        "id": "hhsfbio",
        "score": 886,
        "subreddit": "stocks",
        "created": 1635055248.0
    },
    {
        "author": "CadderlySoaring",
        "body": "This one cracks me up because a lot of us are going WTF on this DWAC shit. It came out of nowhere and made a lot of ppl rich (minus the Peaky Bagholders).\n\nImagine spending the year chasing after questionable plays like Wish, SDC, Clov, Sens and shit. \n\nAnd then you miss out on DWAC at $13 to $150 in 24 fuckin hours. \n\nRight Place, Wrong Time.",
        "created_utc": 1634948507,
        "id": "hhorcw6",
        "score": 878,
        "subreddit": "wallstreetbets",
        "created": 1634977307.0
    },
    {
        "author": "coffeejn",
        "body": "Horrible graph, this is all about **change** in debt-to-GDP.  Yes, we borrowed more in that period, but it does not reflect how much we actually owe.\n\nWhat is the actual debt level to GDP of each country?",
        "created_utc": 1634570673,
        "id": "hh491vc",
        "score": 877,
        "subreddit": "CanadianInvestor",
        "created": 1634599473.0
    },
    {
        "author": "Blackcameleopard",
        "body": "You don’t have the balls to do a same day call for + 50 past an all time high. That’s why you shop at Walmart instead of own it- Warren buffet",
        "created_utc": 1633738809,
        "id": "hfx6oiz",
        "score": 866,
        "subreddit": "wallstreetbets",
        "created": 1633767609.0
    },
    {
        "author": "Yardbird0311",
        "body": "Still rocking a comma though, it could always be worse",
        "created_utc": 1633369983,
        "id": "hfdlond",
        "score": 865,
        "subreddit": "wallstreetbets",
        "created": 1633398783.0
    },
    {
        "author": "211caused911",
        "body": "But if he holds it long enough he can take another screenshot. What is worth more: karma or money?",
        "created_utc": 1634911055,
        "id": "hhmcomp",
        "score": 860,
        "subreddit": "wallstreetbets",
        "created": 1634939855.0
    },
    {
        "author": "Knottylocks",
        "body": "People need to understand compounding. Like it only takes like 5 more 100% gains to be a millionaire. Why hold and lose that 70k. Go hit them licks for 100% gains. It ain't that hard. Just do the opposite of what I do. You'll be golden",
        "created_utc": 1635270975,
        "id": "hi54nsp",
        "score": 854,
        "subreddit": "wallstreetbets",
        "created": 1635299775.0
    },
    {
        "author": "Cryptgro",
        "body": "Traslation: just got lucky, will risk it all trying to dublicate it\n\nResult: replies with this comment",
        "created_utc": 1633302173,
        "id": "hfaalp0",
        "score": 820,
        "subreddit": "wallstreetbets",
        "created": 1633330973.0
    },
    {
        "author": "Mother-Possibility18",
        "body": "If it makes you feel any better, I would happily trade all my money to be 24 again.",
        "created_utc": 1635469041,
        "id": "higdl8l",
        "score": 811,
        "subreddit": "options",
        "created": 1635497841.0
    },
    {
        "author": "neothedreamer",
        "body": "Why buy it now when you can buy it for $0.10 on the dollar in 6 month or less when they go under.  Sharks smelling blood.",
        "created_utc": 1634348287,
        "id": "hgt89vz",
        "score": 804,
        "subreddit": "investing",
        "created": 1634377087.0
    },
    {
        "author": "NewToTradingStock",
        "body": "Most of my Chinese stocks are down 60%+.  Can’t blame them.  It was my fault",
        "created_utc": 1634242403,
        "id": "hgnj7ct",
        "score": 801,
        "subreddit": "wallstreetbets",
        "created": 1634271203.0
    },
    {
        "author": "irishdud1",
        "body": "Ok so selectively quoting your post:\n\n\"GME\" \"is an easy thing.\" \"Invest in\" \"a good business,\" \"become the next DFV\".\n\nGot it, buying more GME tomorrow morning. Thank you for the investment advice!",
        "created_utc": 1634196349,
        "id": "hgl3o50",
        "score": 760,
        "subreddit": "wallstreetbets",
        "created": 1634225149.0
    },
    {
        "author": "notthediz",
        "body": "It is her. Some guy posted the DD link a few comments down. In case anyone wants to do further DD the other girls L to R are Kelly Rohrbach and Erin Heatherton",
        "created_utc": 1633705522,
        "id": "hfv16ww",
        "score": 757,
        "subreddit": "wallstreetbets",
        "created": 1633734322.0
    },
    {
        "author": "QuikThinx_AllThots",
        "body": "Quick question OP.\n\nWhy did it take 15 years for you to arrive at the conclusion? \n\n1-3 years is like you're getting your feet wet, making rookie mistakes etc\n\n4-5 years, maybe you seek advice? Read a book, buy an etf?\n\n6-7 think maybe this isn't meant for me?\n\n8-15 what happened here?",
        "created_utc": 1633360252,
        "id": "hfcwy1r",
        "score": 745,
        "subreddit": "wallstreetbets",
        "created": 1633389052.0
    },
    {
        "author": "Dry_Dog_698",
        "body": "BABA’s valuation at $300 was based in large part on its 33% ownership of ANT.\n\nWhen ANT was ruined BABA lost 20% of its value.  \n\nSince then the CCP and Xi has come out against the consumer internet retail business model.  They have come out against video games.  They have come out against online education.  And it is believed - international investing.\n\nYou have a powerful central government coming out against the central business mode of big Chinese tech companies, that’s why people are leaving the trade.\n\nBABA was last permanently below $150 in 2017.  We don’t have selling pressure from traders or sector ETFs anymore.  This is an unwinding of long term investors.\n\nFinally: no one is 100% that the founder is even still alive.  Jack Ma has been sighted by humanity 6 times since Xi went to pound town and companies related to Ma lost a half trillion in market value.  The most verifiable by the west?  A Japanese billionaire claims that he and Jack Ma text every now and again, that Jack Ma has taken up painting, and the pictures he has seen are pretty good.",
        "created_utc": 1633267462,
        "id": "hf81ixb",
        "score": 741,
        "subreddit": "stocks",
        "created": 1633296262.0
    },
    {
        "author": "cronkamite",
        "body": "Most people that made money on GameStop are still using some of the earnings to invest in other assets. Robinhood could have crushed it if more people won and had money to put back into their platform",
        "created_utc": 1635342206,
        "id": "hi8vcgm",
        "score": 738,
        "subreddit": "wallstreetbets",
        "created": 1635371006.0
    },
    {
        "author": "peacemaker_420",
        "body": "I think I’m doing it wrong. I just don’t understand options or whatever.",
        "created_utc": 1635304125,
        "id": "hi7amyv",
        "score": 736,
        "subreddit": "wallstreetbets",
        "created": 1635332925.0
    },
    {
        "author": "BagofBabbish",
        "body": "The job market is fucking bonkers. I hope it stays like this for awhile. Ill be a managing director by the end of next year and making $200k at this rate!",
        "created_utc": 1633927369,
        "id": "hg6zdhn",
        "score": 725,
        "subreddit": "wallstreetbets",
        "created": 1633956169.0
    },
    {
        "author": "LovableContrarian",
        "body": "Seriously. This woman is fucking awful at trading. She had literally one big success, getting into TSLA early, and it was basically blind luck. Every move she has made since then has been horrible, and her fund has been endlessly bleeding all year long, in one of the strongest bull markets of all time.",
        "created_utc": 1633233230,
        "id": "hf6mze6",
        "score": 723,
        "subreddit": "wallstreetbets",
        "created": 1633262030.0
    },
    {
        "author": "jsntx",
        "body": "If clearinghouses and brokers can legally restrict a targeted group of non-institutional investors from making one side of the trade at a critical moment, it doesn't matter what the report says. It will say whatever it needs to say.\n\nWhether we believe in conspiracies or not, the markets are arguably not the same for regular investors. We are trying to argue a condition for which we don't have reliable sources. So I would stick to the business potential and what it's in the best interest to me individually; which is to hold.",
        "created_utc": 1634640596,
        "id": "hh7uzyc",
        "score": 723,
        "subreddit": "wallstreetbets",
        "created": 1634669396.0
    },
    {
        "author": "c3drewc",
        "body": "Say it with me homie \n\nYOU \nDO\nNOT\nBET\nAGAINST\nMEMES",
        "created_utc": 1635172984,
        "id": "hhznzcx",
        "score": 710,
        "subreddit": "wallstreetbets",
        "created": 1635201784.0
    },
    {
        "author": "JennItalia269",
        "body": "Can’t go tits up. The more it rises, the more you short. Sounds like a solid idea.",
        "created_utc": 1635537706,
        "id": "hik0mqs",
        "score": 693,
        "subreddit": "wallstreetbets",
        "created": 1635566506.0
    },
    {
        "author": "froggrip",
        "body": "I'm addicted to making money. Better make it illegal.",
        "created_utc": 1634731205,
        "id": "hhcnsx3",
        "score": 691,
        "subreddit": "wallstreetbets",
        "created": 1634760005.0
    },
    {
        "author": "Zealousideal_Diet_53",
        "body": "I think he gets off on it.  Dont kink shame Jpow.",
        "created_utc": 1634217604,
        "id": "hglw81g",
        "score": 689,
        "subreddit": "wallstreetbets",
        "created": 1634246404.0
    },
    {
        "author": "thegreatgumbini",
        "body": "A buddy of mine posted yesterday morning saying buy this shit now! It was at $13. I did not in fact, buy that shit. Now I fucking hate my life.",
        "created_utc": 1634915167,
        "id": "hhmmpke",
        "score": 684,
        "subreddit": "wallstreetbets",
        "created": 1634943967.0
    },
    {
        "author": "yougottawintogetlove",
        "body": "Really interested to see if it dumps heavy again today with the share lockup expired. Couldn't happen to a better company",
        "created_utc": 1635327951,
        "id": "hi8852j",
        "score": 681,
        "subreddit": "wallstreetbets",
        "created": 1635356751.0
    },
    {
        "author": "Sandvicheater",
        "body": "Think about how much further in life your parents would've gotten if they didn't have to shelter, feed, educate and love your ass? All that money for diapers and baby formula could've gotten into google or apple stock when it was trading at $2 a share.\n\nFast forward today, you're not gonna make the same mistake as your parents settling down and having wallet draining kids. Your ass is gonna yolo every dollar you make into the stock market until you're riding lambos with British butlers or your ass is selling handjobs behind a wendys.",
        "created_utc": 1634765521,
        "id": "hhex2ml",
        "score": 676,
        "subreddit": "wallstreetbets",
        "created": 1634794321.0
    },
    {
        "author": "lvdown",
        "body": "When the price hit 18.00 your sell order was then automatically placed. But in the few seconds it took to place and fill your order the price had crashed to 8.60. You got filled at 8.60. \n\nSet a limit order stop loss next time not a market order stop loss. This will prevent this from happening but your shares would not be sold at all. In the limit order case it would place your sell order at $18.00 when the price hits $18.00. The order will never fill because the price went below 18. The downside to this is that the price could have gone down further from $8.60 and you would still be holding.",
        "created_utc": 1634916841,
        "id": "hhmqvjq",
        "score": 665,
        "subreddit": "stocks",
        "created": 1634945641.0
    },
    {
        "author": "Nahid145",
        "body": "If I had to draw a line it would be very curved.",
        "created_utc": 1634930331,
        "id": "hhno2c8",
        "score": 634,
        "subreddit": "stocks",
        "created": 1634959131.0
    },
    {
        "author": "Getshorto",
        "body": "I would guess that there has always been corruption in the stock market. Now that we are able to share information that we uncover quickly through the internet it is all being exposed",
        "created_utc": 1633098493,
        "id": "hez8ypc",
        "score": 626,
        "subreddit": "stocks",
        "created": 1633127293.0
    },
    {
        "author": "Artistic_Data7887",
        "body": "And imagine if you’re retarded enough to make those gains through December, not set any aside for taxes, and keep yoloing the entire amount in January…only to lose it all. Then you’d be fuckeder",
        "created_utc": 1634748826,
        "id": "hhdr4aj",
        "score": 624,
        "subreddit": "wallstreetbets",
        "created": 1634777626.0
    },
    {
        "author": "MrDeSilva",
        "body": "I watched an investigative doco on chinese companies listed on the NYSE, they travelled to China and no shit  this was what it was like",
        "created_utc": 1633321881,
        "id": "hfbdb41",
        "score": 614,
        "subreddit": "wallstreetbets",
        "created": 1633350681.0
    },
    {
        "author": "DogeWeTrust",
        "body": "Oof. AMZN been flat for over a year. It started to break away slowly but back flat again.",
        "created_utc": 1635452012,
        "id": "hifb50a",
        "score": 607,
        "subreddit": "stocks",
        "created": 1635480812.0
    },
    {
        "author": "R50cent",
        "body": "Facebook will take a dip this week and then power up in the coming weeks.\n\nThey just let a million potential investors know that the thing that matters more to them between people and money... is money. As long as the government doesn't step in and do anything, it will be business as usual or better in the next few weeks.",
        "created_utc": 1633374692,
        "id": "hfdyel9",
        "score": 604,
        "subreddit": "stocks",
        "created": 1633403492.0
    },
    {
        "author": "UNCONGUY",
        "body": "if it were a day, no problem. but this is my trade life.",
        "created_utc": 1634645548,
        "id": "hh82byr",
        "score": 599,
        "subreddit": "wallstreetbets",
        "created": 1634674348.0
    },
    {
        "author": "lazyboat321",
        "body": "“Name of the company, Aerotyne international. It is a cutting edge, high tech firm out of the Midwest awaiting eminent patent approval….”",
        "created_utc": 1633335929,
        "id": "hfbv17b",
        "score": 592,
        "subreddit": "wallstreetbets",
        "created": 1633364729.0
    },
    {
        "author": "somelittlefella",
        "body": "If the shorts closed then why were there multiple runups after january. March it ran to 350 and in june it ran to 350. \n\nAlso take the volume. The volume has been sub 2million for months now. No media attention at all even though the whole board and company is being transformed along with no debt and over 1billion cash on hand",
        "created_utc": 1634643472,
        "id": "hh7z123",
        "score": 563,
        "subreddit": "wallstreetbets",
        "created": 1634672272.0
    },
    {
        "author": "attorneyatslaw",
        "body": "Hertz paid everyone in full because it turned out they weren't really bankrupt at all, so it wasnt really a restructuring of debt.   They filed because the market for used cars crashed at the beginning of Covid, so they got margin called on their credit lines (secured by their rental cars).  However, the used car market then spiked to all time highs, so the margin calls went away and they were able to go back to business as usual.  Hertz usually buys around 500,000 cars a year.  They just are moving their purchases from other brands to Tesla.",
        "created_utc": 1635519012,
        "id": "hiioz57",
        "score": 555,
        "subreddit": "wallstreetbets",
        "created": 1635547812.0
    },
    {
        "author": "despejado",
        "body": "it wasn't at 59  dollars pre split in 2019... 59 would be the post split price. not up 100x. went from 300 pre split price to what would be 5000 pre split price today, so up 15x  or so",
        "created_utc": 1635221838,
        "id": "hi2r31x",
        "score": 551,
        "subreddit": "investing",
        "created": 1635250638.0
    },
    {
        "author": "Cruzody333",
        "body": "Garbage is garbage and it doesn’t matter where it comes from",
        "created_utc": 1634240681,
        "id": "hgnf08a",
        "score": 543,
        "subreddit": "wallstreetbets",
        "created": 1634269481.0
    },
    {
        "author": "TangoKlass",
        "body": "\"When I sign the *Face Book* out of the Library, is it for two weeks or three?\"",
        "created_utc": 1633463224,
        "id": "hfinl6f",
        "score": 538,
        "subreddit": "wallstreetbets",
        "created": 1633492024.0
    },
    {
        "author": "WickedSensitiveCrew",
        "body": "Also noticed OP invested when COVID hit. It was easy making money in 2020. Pretty much every stock went up.",
        "created_utc": 1635516996,
        "id": "hiik2pu",
        "score": 536,
        "subreddit": "stocks",
        "created": 1635545796.0
    },
    {
        "author": "yoyoyoyooyoyoyoyoyo",
        "body": "I lost $54k in 2020 because I am a gay bear, so no, I don't miss it.",
        "created_utc": 1633479578,
        "id": "hfjnp3r",
        "score": 532,
        "subreddit": "wallstreetbets",
        "created": 1633508378.0
    },
    {
        "author": "RealmoftheRedWiings",
        "body": "Hold for 2 days, got it.",
        "created_utc": 1633360159,
        "id": "hfcwqg7",
        "score": 531,
        "subreddit": "wallstreetbets",
        "created": 1633388959.0
    },
    {
        "author": "Virtual-Zucchini9692",
        "body": "it was implied",
        "created_utc": 1635538314,
        "id": "hik272t",
        "score": 522,
        "subreddit": "wallstreetbets",
        "created": 1635567114.0
    },
    {
        "author": "Skwink",
        "body": "Honestly OP please do this. You’re gonna try to do it again and it’s not gonna work.",
        "created_utc": 1635635914,
        "id": "hipaeqn",
        "score": 521,
        "subreddit": "wallstreetbets",
        "created": 1635664714.0
    },
    {
        "author": "Mittenwald",
        "body": "We have a massive shortage of biotech workers in San Diego. My company is struggling to hire. When they lost out on a candidate to a startup our vice president told my co-worker he didn't understand why. She told him it's about money. And they offered much more plus stocks. Our executive team isn't getting the message that they need to raise wages. I've also been hearing our bonuses might not be anything this year because of one failed project. We all are be hounded by recruiters. Eventually the offers will be too good to pass up. Funny how companies love capitalism when it makes them profits but hate it when the workers can actually utilize it.",
        "created_utc": 1633839170,
        "id": "hg2e3yv",
        "score": 515,
        "subreddit": "investing",
        "created": 1633867970.0
    },
    {
        "author": "Supreme_Mediocrity",
        "body": "Sounds like it was Zillow just being stupid, I'd be worried if all the internet buying companies suddenly stopped as well",
        "created_utc": 1634605987,
        "id": "hh6h07i",
        "score": 508,
        "subreddit": "stocks",
        "created": 1634634787.0
    },
    {
        "author": "Sad_Bid_5113",
        "body": "Reading performance charts and looking at all those bullshit angles claiming \"this is where it will change\" will get you nowhere in investment banking. \n\nThat's for traders 15 years ago.\n\nMachines do that now.\n\nLearn how companies and industries work instead.\n\nThey're investment banking clients.",
        "created_utc": 1633545317,
        "id": "hfmv1w0",
        "score": 507,
        "subreddit": "investing",
        "created": 1633574117.0
    },
    {
        "author": "JerichoKaus809",
        "body": "I think Zucc is paid in company stock to avoid taxes on his income, then he just sells it.",
        "created_utc": 1633452278,
        "id": "hfhxdmp",
        "score": 500,
        "subreddit": "StockMarket",
        "created": 1633481078.0
    },
    {
        "author": "teteban79",
        "body": "Ask yourself - do I have conviction on a better opportunity in which to invest this money?\n\nThat's it.",
        "created_utc": 1635435115,
        "id": "hie44ib",
        "score": 498,
        "subreddit": "stocks",
        "created": 1635463915.0
    },
    {
        "author": "ObergrupenfuhrerChar",
        "body": "Yea I had to binge watch the entire thing due to the sudden WSB-Squidgame Memes. It was pretty good. Best thing to do with 38 M price money? 0dte calls on SPX?",
        "created_utc": 1633377825,
        "id": "hfe70nk",
        "score": 492,
        "subreddit": "wallstreetbets",
        "created": 1633406625.0
    },
    {
        "author": "reddit_1999",
        "body": "\"Its a big club, and you ain't in it!\" - George Carlin",
        "created_utc": 1633099779,
        "id": "hezbt84",
        "score": 491,
        "subreddit": "stocks",
        "created": 1633128579.0
    },
    {
        "author": "deaznutelanutz",
        "body": "I withdrew millions of won from my work place and gambled it all on risky derivatives",
        "created_utc": 1633193956,
        "id": "hf489km",
        "score": 491,
        "subreddit": "wallstreetbets",
        "created": 1633222756.0
    },
    {
        "author": "Sham-Wow_1337",
        "body": "Switch it to a logarithmic scale and then repost",
        "created_utc": 1633812804,
        "id": "hg0wgh1",
        "score": 480,
        "subreddit": "wallstreetbets",
        "created": 1633841604.0
    },
    {
        "author": "squench2000",
        "body": "For those wondering what to make of these 2 figures:\n\nIf you see a median and mean far apart like this, it means that outliers are pulling the mean away from center (in this case, upwards by high NW outliers), and that the median is a better representation of true central tendency.",
        "created_utc": 1634345109,
        "id": "hgt2dii",
        "score": 479,
        "subreddit": "StockMarket",
        "created": 1634373909.0
    },
    {
        "author": "The_Sandman32",
        "body": "I just found out from my dad that my grandpa bought 200 shares of Apple in 2002, and like a month later the stock split 7:1. He’s still holding it today.",
        "created_utc": 1635704635,
        "id": "hisj123",
        "score": 479,
        "subreddit": "stocks",
        "created": 1635733435.0
    },
    {
        "author": "ajmartin527",
        "body": "When I lived in vegas one of my clients owned an auto group that included a Rolls Royce/Bentley/Aston dealership. He said Floyd used to come in and buy his cars with cash. The first time it happened he bought multiple cars at once and Floyd’s bag man handed the owner a giant sack of cash and he was just stunned. He didn’t really have a workflow for taking multiple hundreds of thousands in cash as payment. Wasn’t sure how to count it or anything either and had to hire extra security to travel with it to deposit and shit.\n\nFloyd has bought tons of cars from him since and it’s always a bag of cash. Funny to hear him talk about it because the dude now sells Ferrari’s and Lambos too and no one else has ever paid cash in physical bills before, they usually just wire transfer it.\n\nEdit: also, Floyd only buys/drives white cars in Vegas. Black in California I believe. He sticks with one color for each of the states he has houses in lol such a dickhead but it’s hilarious.",
        "created_utc": 1635273022,
        "id": "hi59u3l",
        "score": 474,
        "subreddit": "wallstreetbets",
        "created": 1635301822.0
    },
    {
        "author": "ggjmoe",
        "body": "They’ve contained it for 13 years so we’ll be good until we’re not. 😛",
        "created_utc": 1634133195,
        "id": "hghecle",
        "score": 474,
        "subreddit": "wallstreetbets",
        "created": 1634161995.0
    },
    {
        "author": "not_creative1",
        "body": "It will move to india and m Vietnam.\n\n\nIndia is now pumping money into infrastructure. They just approved a plan to spend $1.3 trillion over next 10 years on domestic infrastructure. That’s a fuckton of money. Especially in India. They are on a construction spree. 60% of all highways existing in the country today was built in the last 10 years.\n\nThey are throwing tax breaks at companies that are moving manufacturing to the country. Already something like 20% of all iPhones sold worldwide are made in india. It’s only going to increase.\n\n\nThe fundamental problem of high labor costs in the west is not going away anytime soon. Especially now with worker shortages, talks about minimum wage hikes.",
        "created_utc": 1634538034,
        "id": "hh2vues",
        "score": 472,
        "subreddit": "investing",
        "created": 1634566834.0
    },
    {
        "author": "Gayfish350",
        "body": "Be careful dude. You really could have your whole financial future covered. As someone who grew up worried about money and struggled to build up some type of savings, BE SMART. You can still be a lil bit of a jackass(you're in HS after all) but it doesn't take 60k to o take a couple chances. \n\nNot having the burden of worrying about money on a real level, is the prize my dude. Tbh, I'm jealous af but super happy for you. \n\nDon't be like Lou Anne's bf and blow all your slipped in peepee on a truck",
        "created_utc": 1635622038,
        "id": "hiog6ow",
        "score": 467,
        "subreddit": "wallstreetbets",
        "created": 1635650838.0
    },
    {
        "author": "Guineapigrampage",
        "body": "There were several individuals \"in history\" who were a lot richer than he is. They always forget about people like Augustus (estimated 3-4trillion) who, per law, owned the entire Roman empire, or Mansa Musa who was so incredibly rich that no one ever manged to count it, while the pure fact that his journey to Mekka caused hyperinflation in egypt gives a brief introduction in his insane fortune.",
        "created_utc": 1635580336,
        "id": "himaku1",
        "score": 466,
        "subreddit": "wallstreetbets",
        "created": 1635609136.0
    },
    {
        "author": "swbevan",
        "body": "Ultra wealthy oil trillionaires no one knows about and they prefer to keep it that way",
        "created_utc": 1635573206,
        "id": "him1bpc",
        "score": 460,
        "subreddit": "wallstreetbets",
        "created": 1635602006.0
    },
    {
        "author": "muhammedali360",
        "body": "I previously used prosper and wouldn't recommend it, my returns were negative. People default left and right regardless of their credit score. This was long before covid, so it's probably even more risky now.",
        "created_utc": 1633200318,
        "id": "hf4n3ze",
        "score": 458,
        "subreddit": "investing",
        "created": 1633229118.0
    },
    {
        "author": "DevastatorBrand",
        "body": "Pffft. He's not one of us. He's using someone else's money to gamble. And he would have gotten away with it too if it wasn't for these pesky kids.",
        "created_utc": 1633519256,
        "id": "hflamim",
        "score": 458,
        "subreddit": "wallstreetbets",
        "created": 1633548056.0
    },
    {
        "author": "teuphilde",
        "body": "Delete your accounts. Gaining 170k and loosing it all due to greadiness is one thing, trying to make it back and loosing another 100k shows strong gambling addiction patterns.",
        "created_utc": 1634216801,
        "id": "hglumgx",
        "score": 450,
        "subreddit": "options",
        "created": 1634245601.0
    },
    {
        "author": "anon675981",
        "body": "Must be so subjective and difficult to calculate this number… how is it done?",
        "created_utc": 1634505453,
        "id": "hh16gs6",
        "score": 448,
        "subreddit": "stocks",
        "created": 1634534253.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "Target and MasterCard",
        "created_utc": 1633096863,
        "id": "hez5d46",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633125663.0
    },
    {
        "author": "Dmoan",
        "body": "We could drop as low as 412 which is 200 day MA before it finds its support and bounces back or breaks thru and falls lower.",
        "created_utc": 1633078639,
        "id": "heydtx6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633107439.0
    },
    {
        "author": "Seven11Eleven",
        "body": "I just need a ticker that just consistenly keeps ticking up, just like ma boy spy did but JP scaring me off :(",
        "created_utc": 1633099770,
        "id": "hezbsh2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633128570.0
    },
    {
        "author": "Warren_Guh_Buffet",
        "body": "Dude BABA was Xi trying to screaw Ma. It had nothing to do with America or politics, dude stop with the conspiracy theories. BABA being a $150 stock today is also because of uncertainty. No one in Wallstreet knows if Xi will simply break up the company. Wallstreet  again could care less about politics, you call me naive yet you reference YouTube as a place where you think anti Chinese sentiment is driving the equities markets. Are you listening to yourself? Wallstreet doesn't care what some random Youtuber with 200 subs feels about China. It's all about earnings reports and going through them with a fine tooth comb. However when a good company like BABA is being attacked by a whole ass country, smart money gets out and waits to see what shoe will drop next. No amount of great earnings reports can combat Xi deciding to simply shut down BABA. As far as you not wanting Chinese stocks in Western markets, be careful what you wish for, the only reason BABA's market cap is what it is today is because of Western money. If all Chinese stocks get delisted, they lose 95% of their value instantly. China alone will not be able to keep BABA's MC $500 bil+",
        "created_utc": 1633085592,
        "id": "heylqm5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633114392.0
    },
    {
        "author": "DiscePati44",
        "body": "413 ish. 150 ma is 423 which also so happens to be the next support line",
        "created_utc": 1633096079,
        "id": "hez3op1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633124879.0
    },
    {
        "author": "aero_kitten",
        "body": "You can use any MA you want, depending on what conclusion you prefer.",
        "created_utc": 1633099523,
        "id": "hezb8em",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633128323.0
    },
    {
        "author": "xavier8100",
        "body": "Engrish not ma furst languaee",
        "created_utc": 1633078722,
        "id": "heydx3e",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633107522.0
    },
    {
        "author": "option-trader",
        "body": "Oh, it'll definitely be difficult, but the trend since the start of September has been down and being held down by its 10 and 20-day ma. Right now, investors are selling every rally. $420 would be a stopping point, but if Spy was going to go for it, then $412 would be the ultimate target for this drop. That'll reset a lot of stocks and create the buying opportunity to take this to record levels.",
        "created_utc": 1633092840,
        "id": "heyx885",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633121640.0
    },
    {
        "author": "lohith15",
        "body": "How much is the current spy 200 MA ?",
        "created_utc": 1633096034,
        "id": "hez3lag",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633124834.0
    }
]