[
    {
        "author": "kkInkr",
        "body": "SMH, ADI, AMAT, ASML, ATEYY, AVGO, HIMX, INTT,  KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI,  PXLW, QCOM, QRVO, SIMO, SWKS, TER,\n\nbesides the usual AMD, INTC, NVDA, and TSM. Those 4 imo are outdated.  SMH is the ETF.\n\nCircuitry, CDNS, SNPS, ANSS, they are being ignored, but have dominant roles, imo.",
        "created_utc": 1619900068,
        "id": "gwkwyeo",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619928868.0
    },
    {
        "author": "seigy",
        "body": "Your best 1st order plays are the foundries like TSM and INTC.  Going one tier further, your 2nd order plays are specialty equipment suppliers like LRCX, AMAT, TER, and KLAC.  Going further really gets you into physical fab enviromentals like air purification and filteration.",
        "created_utc": 1620347368,
        "id": "gx7ut7j",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1620376168.0
    },
    {
        "author": "Annexeda",
        "body": "People give Buffet a lot of credit for someone who has underperformed the market for decades.\n\nObviously he's been incredibly successful in the past but he's not the oracle anymore.\n\nThis is the autist era.  His time has gone.",
        "created_utc": 1619978124,
        "id": "gwouuz3",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1620006924.0
    },
    {
        "author": "claytondpark",
        "body": "Boomer stocks only green stocks on my wl: plby, ibm, ups, orcl, jpm, bac, etc... 🤡",
        "created_utc": 1620147805,
        "id": "gwxf9z9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620176605.0
    },
    {
        "author": "MyNamePlusaNumber",
        "body": "When I opened my brokerage account, they asked if I care about ethical investing or not. (Vanguard apparently has funds that have shares of more environmental and ethical companies.) I thought that I wouldn't care what I'm investing in if it's making a profit. I was wrong (i. e. I can't bring myself to get excited about buying cigarette company shares or oil or a bank that charged people illegal overdraft fees.)\n\nSo, I hear you completely.\n\nI'm also so done with the daily quotes and blind worshipping of \"Oracle of Omaha.\" (Anyone interested in a different kind of investor can read Peter Lynch's book.) The Berkshire Hathaway address this week basically dismissed all retail investors as idiots.",
        "created_utc": 1620172401,
        "id": "gwyrtbl",
        "score": 6,
        "subreddit": "stocks",
        "created": 1620201201.0
    },
    {
        "author": "muchcoinmuchfun",
        "body": "In a surprise twist of events I’m calling it:  UWMC is going to hit earnings in 2 weeks.  You can screenshot and come back and laugh at me later or congratulate me as an oracle if I’m right",
        "created_utc": 1620247023,
        "id": "gx2k0cw",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620275823.0
    },
    {
        "author": "RobotArtichoke",
        "body": "Tag this man the Oracle of La Mancha",
        "created_utc": 1619978834,
        "id": "gwowuuz",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620007634.0
    },
    {
        "author": "DoorbellGnome",
        "body": "It's come to mean just on chain code. Think of Ethereum as a distributed computer that can run code and no-one can tamper those apps because it's distributed. It's to applications what Bitcoin is to money / gold.\n\nThe challenges the space is facing right now is scaling (high usage costs) and that the apps can't really communicate with the outside world in a very secure way, because of course that could be a single point of failure.\n\nThere are various scaling mechanics in the works and distributed oracle networks are solving the connectivity problem with relatively easy stuff, like price data being supplied to decentralized finance applications in a secure way, already online and securing billions of value.",
        "created_utc": 1619995849,
        "id": "gwpwzj5",
        "score": 4,
        "subreddit": "investing",
        "created": 1620024649.0
    },
    {
        "author": "plxnk",
        "body": "I am an Oracle at lossing money.",
        "created_utc": 1620065685,
        "id": "gwt7s6j",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620094485.0
    },
    {
        "author": "claytondpark",
        "body": "were likely going to see spx make new aths next week along with ndx heading back up to it's highs...\n\nIMO, rally will be lead by big caps, faang, boomer shit like financials, boomer tech like ibm/csco/orcl, shit like dow stocks, etc...\n\nGrowth stocks, spacs, evs, small caps, etc.. will bounce but won't sustain the rallies keeping them within a consolidation range until some catalyst breaks them out or breaks them down to their next support levels...",
        "created_utc": 1620335394,
        "id": "gx75gfg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620364194.0
    },
    {
        "author": "Icommandyou",
        "body": "SPY options. Just time them and good luck. \n\nYou will need a good oracle for that though",
        "created_utc": 1619924518,
        "id": "gwm9m53",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619953318.0
    },
    {
        "author": "PutsOnYourWife",
        "body": "A friend of mine told me to stick to oracle IBM and Cisco back in January 2021....\n\nI sticked to THCB, PLTR, EXPC, PLUG",
        "created_utc": 1620326569,
        "id": "gx6k0qz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620355369.0
    },
    {
        "author": "cplange1",
        "body": "Ooof!!!\n\nCrimson skies, crimson tides, everything is bleeding today.  Thankfully my ORCL calls are offsetting my AMD calls...ugh...",
        "created_utc": 1620136788,
        "id": "gwwobqh",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620165588.0
    },
    {
        "author": "ienjoycorgis",
        "body": "I don't disagree. You'd usually see companies outgrow quickbooks for netsuite as a first step. But if they are especially high growth or in certain industries, they might look at Workday Financials. \n\nAll these vendors have pros and cons with Core Financials and Planning depending on industry. Obviously, Energy and manufacturing tend to gear towards SAP and sometimes Oracle. Workday Financials absolutely crushes though it in certain industries with like Fintech, Software, Business Services + Insurance. \n\nAs with most business software, successful and thoughtful implementation is the key though. Plenty of companies buy software, hire a god-awful partner for implementation, and then think the software is the problem.",
        "created_utc": 1619889515,
        "id": "gwk8tce",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619918315.0
    },
    {
        "author": "JoeParrish",
        "body": "I'll throw out an unlikely one: Zeno of Citium, the ancient founder of Stoic philosophy.\n\nHe was a successful merchant who became wealthy through trades.  This was the closest someone could be to an investor in those days.  Stoic philosophy encouraged living in accord with Nature, which didn't simple mean the natural earth but also reality more broadly, that the key to escaping suffering is to live life with accurate expectations about Nature.  It's hard to imagine a Stoic who takes up investing not to be interested in things like the balance sheet.    Here's what Wikipedia says about him.\n\n*Diogenes reports that Zeno's interest in philosophy began when \"he consulted* [*the oracle*](https://en.wikipedia.org/wiki/Pythia) *to know what he should do to attain the best life, and that the god's response was that he should take on the complexion of the dead. Whereupon, perceiving what this meant, he studied ancient authors.\"*[*\\[5\\]*](https://en.wikipedia.org/wiki/Zeno_of_Citium#cite_note-6) *Zeno became a wealthy merchant. On a voyage from* [*Phoenicia*](https://en.wikipedia.org/wiki/Phoenicia) *to* [*Peiraeus*](https://en.wikipedia.org/wiki/Peiraeus) *he survived a shipwreck, after which he went to Athens and visited a bookseller. There he encountered* [*Xenophon*](https://en.wikipedia.org/wiki/Xenophon)*'s* [*Memorabilia*](https://en.wikipedia.org/wiki/Memorabilia_(Xenophon))*. He was so pleased with the book's portrayal of* [*Socrates*](https://en.wikipedia.org/wiki/Socrates) *that he asked the bookseller where men like Socrates were to be found. Just then,* [*Crates of Thebes*](https://en.wikipedia.org/wiki/Crates_of_Thebes)*, the most famous* [*Cynic*](https://en.wikipedia.org/wiki/Cynicism_(philosophy)) *living at that time in* [*Greece*](https://en.wikipedia.org/wiki/Greece) *happened to be walking by, and the bookseller pointed to him.*[*\\[6\\]*](https://en.wikipedia.org/wiki/Zeno_of_Citium#cite_note-FOOTNOTELa%C3%ABrtius1925%C2%A7_2%E2%80%933-7)\n\n*Zeno is described as a haggard, dark-skinned person,*[*\\[7\\]*](https://en.wikipedia.org/wiki/Zeno_of_Citium#cite_note-FOOTNOTELa%C3%ABrtius1925%C2%A7_1-8) *living a spare,* [*ascetic*](https://en.wikipedia.org/wiki/Ascetic) *life*[*\\[8\\]*](https://en.wikipedia.org/wiki/Zeno_of_Citium#cite_note-FOOTNOTELa%C3%ABrtius1925%C2%A7_26%E2%80%9327-9) *despite his wealth. This coincides with the influences of Cynic teaching, and was, at least in part, continued in his Stoic philosophy.*",
        "created_utc": 1619974350,
        "id": "gwok3zd",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620003150.0
    },
    {
        "author": "Erland_Brynjar",
        "body": "Tobacco investing has done very well, despite big names like the Oracle from Omaha not touching it (perhaps even because of it).",
        "created_utc": 1619985417,
        "id": "gwpc5bd",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1620014217.0
    },
    {
        "author": "metallica11",
        "body": "2021: the year of papa johns outdoor pizza parties, kellogs cornflake extravaganzas,  and cheesecake factory celebratory outings.\n\neveryone will be abandoning their tesla EV's for gas guzzlers to celebrate.\n\nmeanwhile, boomer SAP and ORACLE legacy database organization will remain king. who needs PLTR.",
        "created_utc": 1620332122,
        "id": "gx6xh7n",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620360922.0
    },
    {
        "author": "haight6716",
        "body": "Yeah, all sounds great and I understand the theory, but I can also understand why Buffet isn't loosing much sleep over it.  Only so much you can tie to the real world, and then oracles become an issue - what if it becomes worthwhile to co-opt the oracle you rely on for your insurance - say I corrupt the \"weather\" oracle to say -30 degrees for 5 minutes, just long enough to cash in my insurance policy.\n\nI'm curious what you actually use it for today?  Beyond speculation on digital assets.",
        "created_utc": 1619988157,
        "id": "gwphot5",
        "score": 2,
        "subreddit": "investing",
        "created": 1620016957.0
    },
    {
        "author": "I_am_the_movement",
        "body": "It may be worth noting that the \"Oracle of Omaha\" recently (within the last year) purchased into Barrick Gold company. Which he did after making multiple negative comments about investing in gold, for many years. Great DD!",
        "created_utc": 1620191700,
        "id": "gwzsh0g",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620220500.0
    },
    {
        "author": "dudetalking",
        "body": "Its a catch 22 in technology. Amazon and Alibabas model is to enter markets in anticipation of competition, even if its  loss leader.\n\nThis is why Buffett avoids technology, because its almost impossible to predict what technology business can sustain itself for decades, unlike say Coke or Gillette.\n\nApple was almost done in the 90s as a company, Microsoft had a lost decade. IBM ruled technology for 50 years, Cisco had its days, Oracle, Sun Microsystem, on and on.\n\nToo many people think FAANG will be around a decade from now, because they can't envision the next disruptor but that is precisely how tech works. The business that will disrupt FAANG will probably be created 2-3 years before they begin doing damage to them.\n\nYahoo was founded in 1994 it IPOed in 1996, and by 2000 was the number 1 internet site in the world.  Google did not go live until 1998, and did not IPO until 2004.",
        "created_utc": 1620137658,
        "id": "gwwqbkq",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620166458.0
    },
    {
        "author": "Grey_Patagonia_Vest",
        "body": "It’s worse with people who opened a trading account and got on Reddit this year alone because they saw GME gains. I love that more people are getting in the game but this is a long con and you can be successful for a very long time but that doesn’t make you an oracle and you can still lose everything in a minute. Every market crash and downturn was “unexpected” and “unprecedented” and “different than the last” to those that got so caught up in the bull market they didn’t see it coming.\n\n*sips black coffee and stares off into the distance with vivid flashbacks of 2008*",
        "created_utc": 1620004666,
        "id": "gwqd73e",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620033466.0
    },
    {
        "author": "djb25",
        "body": "Hit by a train while taking a shit. \n\nDude was an oracle. Just didn't believe in himself.",
        "created_utc": 1620223324,
        "id": "gx0zh8i",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620252124.0
    },
    {
        "author": "mannequit",
        "body": "Workday is more HRIS and less financials. Workday Adaptive doesn't compete as well with SAP or Oracle (Fusion or Netsuite) in financials or accounting.\n\nDepends on revenue, GL structure, etc etc but typically most companies outgrow QuickBooks for Netsuite even with oracle's reputation",
        "created_utc": 1619886982,
        "id": "gwk2qx8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619915782.0
    },
    {
        "author": "Pasttuesday",
        "body": "Yes people buy voting power.\n\nThink of crypto as a coordination machine. \n\nThe world exploded with the printing press (decentralization/censorship resistance as you can make copies of whatever dissent there is, no one can stop it.)\n\nAnd the world exploded with double entry book keeping as now new financial tools can be built. \n\nCrypto is like combining the two. Now people are making democratic corporations where anyone in the world can participate in. Many of forums and vote proposals. Some people’s full time jobs are working for daos. (Decentralized autonomous organizations). \n\nThese products can be anything you dream of. It’s like the internet. We have new tools, we have scarcity engines, we have coordination. \n\nCurrent ones are built in speculation in the market but keep in mind this is like year 3 of a brand new market. \n\nMark Cuban talks about having a decentralized insurance for his Mavericks games. There are crypto companies that act as “oracles” which translate real world data to blockchain. One oracle could pull data to say one if it’s under 30 degrees AND it’s this high humidity, then it’s snowing. And since it’s in Dallas, this kills the ticket sales of a game. If those conditions are met, then an automatic payout happens. This can happen with crop insurance too etc. \n\nErnst and young has been working hard on ethereum to develop supply chain tracking. This product is called baseline and Microsoft is their biggest partner on it. \n\nIt’s like how the internet wasn’t internet tv or internet radio. It’s internet everything you can dream of. Same with blockchain, and ethereum is Turing complete so it can do it all.",
        "created_utc": 1620149959,
        "id": "gwxkijq",
        "score": 1,
        "subreddit": "investing",
        "created": 1620178759.0
    },
    {
        "author": "Trenchcoat_Economics",
        "body": "I know it’s supposed to be impossible to time the market, that’s why I backed out before close. How confident I was made me feel like an absolute retard. I hit the last big steel rally in Nov with weeklies and the setup looked the same here\n\nI almost made a whole post on it, calling myself the oracle n shit. It just looked too ridiculous to post but yeah 2/2 absolute baggers would’ve actually done it 🤦‍♂️\n\nWorst part is I’m still retarded but also not rich",
        "created_utc": 1620171573,
        "id": "gwyq2v9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620200373.0
    },
    {
        "author": "Tarrifying",
        "body": "Will someone tell me why ORCL keeps going up?",
        "created_utc": 1620251433,
        "id": "gx2uecb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620280233.0
    },
    {
        "author": "anders9000",
        "body": "You’re right, the news is kind of nothing and there’s no reason I can see for it being this overvalued. You’re obviously an oracle, but I PROMISE YOU it has nothing to do with the cost of borrowing money to short the stock.\n\nAlso I hope you sold, because this is gonna come crashing down.",
        "created_utc": 1619877697,
        "id": "gwjhi14",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1619906497.0
    },
    {
        "author": "shepherd_boyz",
        "body": "Oracle = Cathie Wood",
        "created_utc": 1619978517,
        "id": "gwovz0t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620007317.0
    },
    {
        "author": "Wayneisthebatman",
        "body": "How is ORCL green? Should’ve accepted their offer in January.",
        "created_utc": 1620142699,
        "id": "gwx2iyr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620171499.0
    },
    {
        "author": "Complete_Break1319",
        "body": "Gonna go ahead and name you the oracle of whatever town your from... I'm really sensing your from kalamazoo.",
        "created_utc": 1620164827,
        "id": "gwybimy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620193627.0
    },
    {
        "author": "meatsaballz",
        "body": "ORCL green. Bear day confirmed.",
        "created_utc": 1620139211,
        "id": "gwwu0fp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620168011.0
    },
    {
        "author": "Strangerdanger8812",
        "body": "One of my favorite quotes from the Oracle",
        "created_utc": 1619905433,
        "id": "gwl9yq8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619934233.0
    },
    {
        "author": "muchcoinmuchfun",
        "body": "Don’t worry I’m not a trading oracle cause I’m still only using this trade to offset my UWMC loss and go slightly back green",
        "created_utc": 1620058994,
        "id": "gwsrsf3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620087794.0
    },
    {
        "author": "DelphiCapital",
        "body": "Salesforce? Oracle?",
        "created_utc": 1620001020,
        "id": "gwq6jyl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620029820.0
    },
    {
        "author": "Harisdrop",
        "body": "As senior developer it’s hard to change from cobol ibm to angular oracle. It can be done but what a pain. Most the time the rules and regulations get in the way.",
        "created_utc": 1619883299,
        "id": "gwju08q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619912099.0
    },
    {
        "author": "djb25",
        "body": "Uhhh… it was at 412 around noon. \n\nOooooh. \n\nYou think you’re like, an oracle or something and SPY is going to crash massively, huh? \n\nCould happen, I guess. \n\nGood luck with that.",
        "created_utc": 1620174331,
        "id": "gwyvvj5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620203131.0
    },
    {
        "author": "fleetmack",
        "body": "I don't have a concrete example and I'm lazy, but at a high level - they have cash, they buy up other companies, so their cash goes down. Bottom-liners see that instead of what it will create. This company will never be the next Oracle, but they are a massive driver of storage and consumption of unstructured and structured data.",
        "created_utc": 1620136904,
        "id": "gwwol83",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620165704.0
    },
    {
        "author": "kidkadian99",
        "body": "He is an Oracle",
        "created_utc": 1620211842,
        "id": "gx0fwec",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1620240642.0
    },
    {
        "author": "Classy_Canids",
        "body": "**Ancillary Plays on the Military Industrial Complex - Continued**\n\n**American Outdoor Brands - AOUT**\n\n**Dry &amp; Drab overview of AOUT:** American Outdoor Brands, Inc. provides outdoor products and accessories for rugged outdoor enthusiasts in the United States and internationally. The company offers hunting, fishing, camping, shooting, and personal security and defense products. Its products include shooting supplies, rests, vaults, and other related accessories; premium sportsmen knives and tools for fishing and hunting; land management tools for hunting preparedness; harvesting products for post-hunt or post-fishing activities; electro-optical devices comprising hunting optics, firearm aiming devices, flashlights, and laser grips; reloading, gunsmithing, and firearm cleaning supplies; and survival, camping, and emergency preparedness products. The company sells its products through e-commerce and traditional distribution channels under the Marksman, Defender, Harvester, and Adventure brand lanes. American Outdoor Brands, Inc. was incorporated in 2020 and is headquartered in Columbia, Missouri. [Source](https://www.marketbeat.com/stocks/NASDAQ/AOUT/)\n\n* Conglomerate of multiple business in the outdoor industry.\n\n* Spin off from Smith &amp; Wesson (SWBI).\n\n* AOUT does not sell firearms--IIRC this is why the AOUT-SWBI split was performed--the items most associated with firearms and/or the defense industry it sells are through Crimson Trace (scopes, red dot, lasers), Frankford Arsenal (reloading), Caldwell (ear protection, range gear, targets), and Tipton (gun cleaning and maintenance). Operates in the outdoor industry through Uncle Henry, Old Timer, and Schrade (knives), Meat! (meat processing), UST (camping supplies such as tents, sleeping bags, cookware, etc.), Bubba (fisherman’s gear for processing), among others. \n\n* Few publicly traded competitors in this outdoor recreational sector; Great American Outdoors Group owns Bass Pro Shops, Cabela's and recently acquired the previously publicly traded Sportsman's Warehouse. The only publicly traded competitors in this broad, overarching recreational category that I can think of are Vista Outdoors (VSTO), Dick's Sporting Goods (DKS), Gander Mountain (MM), and Academy Sports &amp; Outdoors (ASO).\n\n**Vista Outdoors - VSTO**\n\n**Dry &amp; Drab overview of VSTO:** Vista Outdoor Inc. designs, manufactures, and markets various consumer products in the outdoor sports and recreation markets in the United States and internationally. It has a portfolio of brands that provides consumers with a range of products for individual outdoor recreational pursuits. The company operates through two segments, Shooting Sports and Outdoor Products. The Shooting Sports segment offers ammunition products, including centerfire ammunition, rimfire ammunition, shotshell ammunition, and reloading components; hunting accessories comprising high-performance hunting arrows, game calls, hunting blinds, game cameras, decoys, and optics products; and shooting accessories, such as reloading equipment, clay targets, and premium gun care products, as well as holsters, duty gear, bags, and packs. The Outdoor Products segment offers sports protection products that include helmets, goggles, and accessories for cycling, snow sports, action sports, and powersports; outdoor cooking products, such as grills and stoves; golf products, which comprise laser rangefinders and other golf technology products; and hydration products, including hydration packs and water bottles. The company sells its products to outdoor enthusiasts, hunters, recreational shooters, athletes, law enforcement, and military professionals through various mass, specialty, and independent retailers and distributors, as well as directly to consumers through brand's website and third party e-tail websites. Vista Outdoor Inc. was incorporated in 2014 and is headquartered in Anoka, Minnesota. [Source](https://www.marketbeat.com/stocks/NYSE/VSTO/) \n\n* Large conglomerate of multiple business in the outdoor industry.\n\n* VSTO does not sell firearms, the items most associated with firearms and/or the defense industry it sells are through Alliant Powder (smokeless powder), CCI (ammo and primers), Hevi-Shot (shotgun ammo), Federal (ammo and reloading supplies), Remington (ammo), Speer (ammo and reloading supplies), Bushnell (scopes and optics), and RCBS (reloading tools). Operates in the outdoor industry through Bell (helmets), Blackburn (bike gear), Krash (kids helmets and scooters), Copilot (child bike carriers), Camelback (hydration), Bushnell Golf (really?), Eagle Industries (for the Gravy Seals amongst us), Primos (hunting gear), among others. \n\n* Few publicly traded competitors in this outdoor recreational sector; Great American Outdoors Group owns Bass Pro Shops, Cabela's and recently acquired the previously publicly traded Sportsman's Warehouse. The only publicly traded competitors in this broad, overarching recreational category that I can think of are American Outdoor Brands (AOUT), Dick's Sporting Goods (DKS), Gander Mountain (MM), and Academy Sports &amp; Outdoors (ASO).\n\n* Divested of it’s gun manufacturing subsidiaries, Savage Arms and Stevens, in 2019; so VSTO does not sell firearms. \n\n* Through bankruptcy proceedings in October 2020, VSTO will acquire Remington Arm’s ammunition manufacturing facility in Arkansas, and related intellectual property, including the Remington brand and trademarks, for $81.4 million.\n\n* Expect reactive stock moves to Federal rhetoric and legislature surrounding guns and ammo.\n\n* Expect reactive stock moves to Federal elections (POTUS and Congress).\n\n* Due to my experience in the firearms and outdoor industry and being fully aware of what's been happening the last 12-18 months within these sectors, I question their ability to sustain such dramatic growth related to ammunition and reloading components beyond calendar year 2021. \n\n\n**Microsoft - MSFT**\n\nMSFT isn’t that into aerospace and defense, but I’m including them because of the following notable contracts. \n\n**Dry &amp; Drab overview of MSFT:** Seriously!? If you're really asking then there's a tree stump out in the holler with a higher IQ.\n\n* $10B JEDI (Joint Enterprise Defense Initiative) contract - intended to provide the government with a cloud computing platform that would sit atop all other cloud deployments at the DoD and provide a general-purpose cloud environment; smaller, specific clouds — what the government called “fit for purpose” clouds — were only to be utilized on an as-needed basis. Contract has been riddled with controversy and litigation due to protests by Amazon and Oracle. DoD has taken actions that indicates that it may scrap the whole JEDI project due to delays as a result of protests and litigation. \n\n* $22B HoloLens contract over 10-years -  augmented reality headset for Army.\n\n**Uranium**\n\nFor an analysis of the uranium market, DD, and recommendations, I'm referring you apes to the Uranium Prophet himself, r/3STmotivation \n\nI personally consider r/3STmotivation to not only be the Uranium Prophet, but to be made of pure Gold-Titanium-Sulfur-Tellurium. Refer to their posts, specifically [this](https://www.reddit.com/r/UraniumSqueeze/comments/mo46cg/preservation_of_nuclear_power_and_the_green/), [this](https://www.reddit.com/r/investing/comments/kpjvhs/2021_will_be_an_unforgettable_year_for_uranium/), and [this](https://www.reddit.com/r/investing/comments/kt36if/answers_to_the_10_most_asked_questions_regarding/); 3STmotivation has indicated that most of his new content on uranium will be published [here.](https://www.patreon.com/contrariancodex) \n\nI'm not the most autistic ape out there, so at the moment, I'm not too sure how programs such as the Nuclear Triad will impact uranium stocks/ETFs; this topic needs further exploration.",
        "created_utc": 1620249400,
        "id": "gx2pqki",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1620278200.0
    },
    {
        "author": "yazoodd",
        "body": "OFC, if you are an oracle, you can just buy before it grows.",
        "created_utc": 1620143805,
        "id": "gwx593h",
        "score": -1,
        "subreddit": "stocks",
        "created": 1620172605.0
    }
]