[
    {
        "author": "Janto_2021",
        "body": "#boom boomer, who took the keys to my beemer",
        "created_utc": 1625260825,
        "id": "h3uq9gw",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625289625.0
    },
    {
        "author": "SPYfuncoupons",
        "body": "Good to hear. Just know that there’s no course or discord group out there with the perfect strategy or the “keys” to success, you can get just as far for free, learning from mistakes and doing your own research. All of us on this subreddit want to see each other do well!",
        "created_utc": 1625271169,
        "id": "h3vakc8",
        "score": 4,
        "subreddit": "options",
        "created": 1625299969.0
    },
    {
        "author": "Josh439",
        "body": "Good. First day of the month so had a lot of accounting shit to do. I actually had to work all day instead of browse reddit and youtube. The horror. \n\nOn Tuesday I got my car towed to a body shop to get fixed. The tow truck was supposed to pick it up at 1pm. I went home during lunch to give my keys to him. He didn't show up until 3. \n\nThe shop my car went to is about a 20 minute drive from my apartment. My contact at the repair place called me yesterday morning to confirm the car arrived. They said it showed up at 5...",
        "created_utc": 1625176697,
        "id": "h3qfe2v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625205497.0
    },
    {
        "author": "kinokonoko",
        "body": "Like cold bars and treasure sitting at the bottom of the ocean thought to be lost forever will one day be recovered thanks to the technological advancements of the day.\n\nDollars to donuts that as soon as quantum computing comes online, treasure hunters are going to be going after that dude's keys.",
        "created_utc": 1625311941,
        "id": "h3wssz5",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1625340741.0
    },
    {
        "author": "StinkweedMSU",
        "body": "Robinhood exists primarily because of their lax options policies. Most brokerages require some knowledge of options with multiple levels of requirements. Robinhood just gives you the keys to the house and says \"please don't burn it down.\" It's perfect for people that dump their entire accounts into lotto tickets.",
        "created_utc": 1625165316,
        "id": "h3ppbiv",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1625194116.0
    },
    {
        "author": "dancinadventures",
        "body": "Imagine you know for a fact that jPowell , Pelosi, Biden personally owns stock XYZ. \n\nDoes they make you more comfortable or less in XYZ?\n\nCompanies in China that has good relations w CCP basically have the keys to the China equivalent of Powell money printer.",
        "created_utc": 1625249731,
        "id": "h3u0w22",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625278531.0
    },
    {
        "author": "Pleasant_Plantain",
        "body": "i too was fukd by the fed pump.  ...quantative easing my ass... its almost as if the fed is fucking options with max pain.  or they gave the keys to a hedgefund. fuuuuuck me",
        "created_utc": 1625177745,
        "id": "h3qhmlc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625206545.0
    },
    {
        "author": "MiniatureEvil",
        "body": "Jokes on you I bought STX and not shit-tier meme stocks",
        "created_utc": 1626296252,
        "id": "h575gzy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626325052.0
    },
    {
        "author": "PivotRedAce",
        "body": "I wouldn't revenge invest immediately after losing a bunch of money. Stop your losses and give yourself a day to calm down so you can come back tomorrow more level-headed. \n\n&gt;!STX has been treating me well recently, however. Obviously do your DD but it might be worth looking into. If you are buying options on this stock or stocks in general make sure they are at least a month out to account for dips.!&lt;",
        "created_utc": 1626100910,
        "id": "h4xaxql",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626129710.0
    },
    {
        "author": "PivotRedAce",
        "body": "I've got calls in STX that have been treating me well, but YMMV obviously.",
        "created_utc": 1626098304,
        "id": "h4x5ntr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626127104.0
    },
    {
        "author": "The_Number_12",
        "body": "all in on TROW, PIPR, and fuck it, STX for the dividend",
        "created_utc": 1625165670,
        "id": "h3pq5hs",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1625194470.0
    }
]