[
    {
        "author": "Asbbbb",
        "body": "Apple is such a long term hold for me. No emotions come about regardless of the price.",
        "created_utc": 1627182096,
        "id": "h6fokru",
        "score": 1663,
        "subreddit": "stocks",
        "created": 1627210896.0
    },
    {
        "author": "nosalute",
        "body": "Aapl breaks out of mega range and this retard shorts it lol",
        "created_utc": 1625866186,
        "id": "h4mx4jb",
        "score": 956,
        "subreddit": "wallstreetbets",
        "created": 1625894986.0
    },
    {
        "author": "zdonowitz",
        "body": "Sell the profit so you are back to your initial investment. Do whatever u want with the profits. But i have to say, there’s really no reason to sell Apple or Microsoft ever",
        "created_utc": 1625526060,
        "id": "h46eiwq",
        "score": 743,
        "subreddit": "stocks",
        "created": 1625554860.0
    },
    {
        "author": "domomymomo",
        "body": "Is apple hold until you die or need the money",
        "created_utc": 1627180521,
        "id": "h6flyyj",
        "score": 732,
        "subreddit": "stocks",
        "created": 1627209321.0
    },
    {
        "author": "Pmmenakedbitcoin",
        "body": "AAPL IS 3% OFF IT\"S ALL TIME HIGH BRO. IT'S ALL OVER! /s",
        "created_utc": 1626700672,
        "id": "h5qzca5",
        "score": 663,
        "subreddit": "stocks",
        "created": 1626729472.0
    },
    {
        "author": "Ohdblue",
        "body": "I'm not sure I would say AAPL and MSFT are \"dropping fast\"",
        "created_utc": 1626696039,
        "id": "h5qrje0",
        "score": 582,
        "subreddit": "stocks",
        "created": 1626724839.0
    },
    {
        "author": "Trisolaran_arbitrage",
        "body": "Illumina (ILMN) - with the fall in cost to sequence a human's DNA, our world could potentially look a lot different in 10 years. The ability to detect early-stage cancer (Grail), as well as the fact that they own a huge amount of the worldwide market for sequencers is huge. They also sell the array kits, so they are like the Apple of gene-sequencing and testing. They basically sell all of the sequencing equipment and array kits to all of their competitors. \n\nThe CEO is also an Electrical Engineer and is pushing future opportunities for Genetic Data - the future is bright!",
        "created_utc": 1625691646,
        "id": "h4ecl95",
        "score": 499,
        "subreddit": "investing",
        "created": 1625720446.0
    },
    {
        "author": "msnebjsnsbek5786",
        "body": "There is no cap. Companies arent being valued as “largest, second largest, third largest” they're being valued as cash-flowing productive assets. \n\nIf aapl produced better earnings, it would increase in price because dividends and buybacks can increase. The potential dividends and buybacks create the floor on the asset. \n\nLet's say someone says “no way aapl could be worth $4 trillion!” what if they doubled revenue and earnings? If the price didn't change that means it would be trading at 16 p/e, and sub 3 p/s, which would make it firmly one of the cheapest blue chips on the market, everyone would be buying it. \n\nI remember seeing people say the same thing about aapl when it was the largest company in the world and the first to break $1T. Now it's doubled. There is little doubt in my mind we will see the first $10T in the next couple decades. I don't know if it will be aapl, but I think many companies will hit that market cap.",
        "created_utc": 1627107976,
        "id": "h6c90ko",
        "score": 442,
        "subreddit": "investing",
        "created": 1627136776.0
    },
    {
        "author": "Golden_Statue",
        "body": "I second this. Companies like Apple and MSFT are a long term hold no matter what. Don’t try to time the momentum of the market.\nPick a few stocks that you would be fine with holding for the next 10 years and allocate a smaller portion of your portfolio to speculative short term investments.",
        "created_utc": 1627194536,
        "id": "h6g68tm",
        "score": 383,
        "subreddit": "stocks",
        "created": 1627223336.0
    },
    {
        "author": "StrikePrice",
        "body": "The fed remains committed to printing unlimited money. Why would I short into unlimited money injection? You might be able to time some short term corrections, but I’d rather just keep buying my Apple 170 calls and be done with it.",
        "created_utc": 1625500859,
        "id": "h451fr7",
        "score": 324,
        "subreddit": "wallstreetbets",
        "created": 1625529659.0
    },
    {
        "author": "bchen270",
        "body": "Mastercard, Visa - are the dominators in their sector and something the world relies on daily\n\nApple &amp; Microsoft- are trading at a fair price and hasn't shot up irrationally\n\nETSY &amp; Amazon- I believe are going to continue to be the top e-commerce platforms\n\nI think everyone is saying the same thing so.......my post is pointless",
        "created_utc": 1626625588,
        "id": "h5nad1y",
        "score": 310,
        "subreddit": "stocks",
        "created": 1626654388.0
    },
    {
        "author": "Redwood21",
        "body": "I bought $2,000 of AAPL around 2001 and am still holding. Best decision I have ever made",
        "created_utc": 1627191275,
        "id": "h6g26l4",
        "score": 286,
        "subreddit": "stocks",
        "created": 1627220075.0
    },
    {
        "author": "kotsumu",
        "body": "People don't even consider those crashes which baffles me. Are they waiting to get into Apple at $1 a share?",
        "created_utc": 1625609460,
        "id": "h4ad96h",
        "score": 275,
        "subreddit": "stocks",
        "created": 1625638260.0
    },
    {
        "author": "Bender_is_Great42069",
        "body": "Just hold until they announce an Apple Watch that can detect a heart attack. Probably not this year but that would propel their stock price because health insurance companies would likely offer to pay for the watches in at risk populations.",
        "created_utc": 1627423886,
        "id": "h6rchvm",
        "score": 262,
        "subreddit": "StockMarket",
        "created": 1627452686.0
    },
    {
        "author": "FuzzyFox1",
        "body": "AAPL AMZN PG",
        "created_utc": 1625431329,
        "id": "h4279sd",
        "score": 243,
        "subreddit": "stocks",
        "created": 1625460129.0
    },
    {
        "author": "Maracuching",
        "body": "I sold my MSFT and AAPL calls to buy CLNE and SOFI. AMA",
        "created_utc": 1625710486,
        "id": "h4ffkg7",
        "score": 234,
        "subreddit": "wallstreetbets",
        "created": 1625739286.0
    },
    {
        "author": "TheStoicInvestor",
        "body": "Best advice every. I am holding AAPL since 2016.",
        "created_utc": 1627182664,
        "id": "h6fphjw",
        "score": 229,
        "subreddit": "stocks",
        "created": 1627211464.0
    },
    {
        "author": "dfreinc",
        "body": "i sold out of my apple leaps after 8 months friday slightly after open. +50% overall so lame as shit by wsb standards and 'opportunity cost' vultures will pick at the corpse of this comment but...\n\nthere's no way i did something right. 😂",
        "created_utc": 1626661912,
        "id": "h5phqrz",
        "score": 228,
        "subreddit": "wallstreetbets",
        "created": 1626690712.0
    },
    {
        "author": "KrypXern",
        "body": "To be fair, Intel's 10nm transistor density is pretty competitive with TSMC's latest 7nm nodes. They are behind for certain, but they are outputting nodes that are almost on par with what is being used in Ryzen processors.\n\nOnly really Apple is years ahead of the game in terms of putting TSMC's rarer/tighter nodes to use.",
        "created_utc": 1626982003,
        "id": "h65v3yo",
        "score": 198,
        "subreddit": "investing",
        "created": 1627010803.0
    },
    {
        "author": "Machiavelli127",
        "body": "My version of MAGA: MSFT, AMZN, GOOG, AAPL",
        "created_utc": 1625441999,
        "id": "h42qx94",
        "score": 183,
        "subreddit": "stocks",
        "created": 1625470799.0
    },
    {
        "author": "TorontoPolarBear",
        "body": "&gt; Apple stock was down 1% in extended trading.\n\nEvery time. WTF",
        "created_utc": 1627419727,
        "id": "h6r33fp",
        "score": 175,
        "subreddit": "CanadianInvestor",
        "created": 1627448527.0
    },
    {
        "author": "amg-rx7",
        "body": "Apple Amazon Microsoft Nvidia PayPal Square Costco Walmart plus a few good EFTs",
        "created_utc": 1625437049,
        "id": "h42i7nt",
        "score": 172,
        "subreddit": "stocks",
        "created": 1625465849.0
    },
    {
        "author": "mattalat",
        "body": "Don't even ask the question. The answer is yes, it's priced in. Think Amazon will beat the next earnings? That's already been priced in. You work at the drive thru for Mickey D's and found out that the burgers are made of human meat? Priced in. You think insiders don't already know that? The market is an all powerful, all encompassing being that knows the very inner workings of your subconscious before you were even born. Your very existence was priced in decades ago when the market was valuing Standard Oil's expected future earnings based on population growth that would lead to your birth, what age you would get a car, how many times you would drive your car every week, how many times you take the bus/train, etc. Anything you can think of has already been priced in, even the things you aren't thinking of. You have no original thoughts. Your consciousness is just an illusion, a product of the omniscent market. Free will is a myth. The market sees all, knows all and will be there from the beginning of time until the end of the universe (the market has already priced in the heat death of the universe). So please, before you make a post on wsb asking whether AAPL has priced in earpods 11 sales or whatever, know that it has already been priced in and don't ask such a dumb fucking question again.",
        "created_utc": 1627330648,
        "id": "h6mkf4x",
        "score": 165,
        "subreddit": "investing",
        "created": 1627359448.0
    },
    {
        "author": "NoInspection6247",
        "body": "Just understand that 90%+ of trading is momentum and algorithms. \n\nRight now, for the past 6 or so weeks, growth stocks (i.e. FAANG) has been on a tear relative to value stocks (i.e. financials, energy etc.). \n\nThis has been prompted by a fall in bond yields which suggests the bond market is not pricing in the hot inflation story that was the theme for the first half of 2021. \n\nThis is how the algos think:\n\nBond yields down -&gt; less inflation -&gt; sell value stocks to take profits, buy growth stocks to make more profits. \n\nSo it just means sell banks, sell energy stocks, buy Apple, Amazon and Google. \n\nYou're right that energy are criminally underrated investments right now by valuation metrics. \n\nBut the algos just don't care. And guess what? By doing this strategy of shorting banks, energy and going long growth stocks, they've made a killing the last 6 weeks. \n\nSo it's no surprise to me $SU et al are getting wrecked while SP500 is at or near all time highs.\n\nWatch 10yr\\30yr bond yields on the US treasury.\n\nIf they go up sustainably for a week or two, the algos will reverse and banks\\energy will become darlings and growth will be sold off.",
        "created_utc": 1626453539,
        "id": "h5exwam",
        "score": 158,
        "subreddit": "CanadianInvestor",
        "created": 1626482339.0
    },
    {
        "author": "msmysty",
        "body": "I lost 60k. That’s including the shop calls I sold for 9k profit and the Apple calls I sold for 5k profit. So I guess it’s a good thing I sold those while it was high or else it would be a lot worse.",
        "created_utc": 1626298843,
        "id": "h57b4qo",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1626327643.0
    },
    {
        "author": "jetimworks",
        "body": "Exactly. If we want to calculate that way, every adult back in early Apple days with over 1000$ to spare lost millions or billions.",
        "created_utc": 1626535243,
        "id": "h5iusov",
        "score": 143,
        "subreddit": "StockMarket",
        "created": 1626564043.0
    },
    {
        "author": "Fuelrod_son_of_Zippy",
        "body": "$NVDA, $JNJ, $AAPL",
        "created_utc": 1625434833,
        "id": "h42e3gv",
        "score": 138,
        "subreddit": "stocks",
        "created": 1625463633.0
    },
    {
        "author": "TheJoker516",
        "body": "I used to be a Tesla Bear, but I've changed my mind. I'm starting to see Teslas everywhere and the owners  adore them. It's almost like Apple loyalty and satisfaction, but for cars.   And of course there's Elon",
        "created_utc": 1627335143,
        "id": "h6muhd6",
        "score": 130,
        "subreddit": "stocks",
        "created": 1627363943.0
    },
    {
        "author": "donktastic",
        "body": "Yes people just look at the nm numbers and thats not the whole picture. The density of intels product is superior to what TSMC has going on but intel cant get their production to work without all the defects. I see it as a production issue not an R&amp;D one. \n\nAnother thing people kind of forget when it comes to TSMC is that Apple has secured the lion share of their production, which gives Apple too much leverage over TSMC and could be an issue as time moves on.",
        "created_utc": 1626982585,
        "id": "h65wey1",
        "score": 129,
        "subreddit": "investing",
        "created": 1627011385.0
    },
    {
        "author": "BrandedStrategy",
        "body": "I am not disagreeing with you but I would like to ask when do we consider a stock ethical? Here are a few examples...\n\nNike, Mars, Kraft, Apple, Google, Microsoft and Tesla (just to name a few) have all been accused and used child labour to keep operating costs low and profits high.\n\nTesla was accused of instigating a coup in Bolvia for their lithium.\n\nThe US government + energy companies invade countries, mine the oceans and frack the country to keep oil prices low.\n\nBig Pharma (in the US) monopolize life-saving drugs i.e. insulin, inhalers preventing many people from being able to afford healthcare. \n\nMcdonalds + Big sugar investing in studies to convince people that their products are not bad for you. Obesity is a huge problem, heart disease is one of the biggest killers.",
        "created_utc": 1625485732,
        "id": "h44caz7",
        "score": 115,
        "subreddit": "stocks",
        "created": 1625514532.0
    },
    {
        "author": "Recoil42",
        "body": "&gt;Another thing people kind of forget when it comes to TSMC is that Apple has secured the lion share of their production, which gives Apple too much leverage over TSMC and could be an issue as time moves on.\n\nI see the reverse dynamic: \n\nThere are plenty of other companies that would take up TSMC production, given the chance. Apple has **paid a premium** to take up the lion's share of production. They're now **fully materially invested** in TSMC, which means the world's most profitable, valuable tech company is now invested in their continued success and strengthening that relationship.\n\nThat politically makes the USA very interested in the further success and stability of Taiwan, which is also of massive benefit to TSMC.",
        "created_utc": 1626984881,
        "id": "h661ntm",
        "score": 114,
        "subreddit": "investing",
        "created": 1627013681.0
    },
    {
        "author": "Yukimor",
        "body": "This is why I’m buying shares in ME (23andMe)\n\nThey’ve got the world’s largest and probably most diverse genetic database, and of the 11 million samples they got, they’re allowed to use 8 million of it for pharmaceutical research. And it’s a household name. With cancer drugs in trials phase and billions to back their research.\n\nI’m interested to see where that company will be in 10 years.\n\nThis is about the earliest I can get in on it and I really hope this turns out to be a “well duh” purchase like NVDA and Apple should’ve been.",
        "created_utc": 1625431464,
        "id": "h427jdz",
        "score": 114,
        "subreddit": "wallstreetbets",
        "created": 1625460264.0
    },
    {
        "author": "thelastsubject123",
        "body": "I was told Apple had stagnated? Weird how every earnings they remind everyone why they're the goat",
        "created_utc": 1627418034,
        "id": "h6qzb7z",
        "score": 113,
        "subreddit": "stocks",
        "created": 1627446834.0
    },
    {
        "author": "Giorno-Giovanno",
        "body": "Based on what I’ve read, you have never invested into a solid company before. Pot stocks and gaming stocks should not be invested in with the thought of long term growth. You can try and get rich quick and be broke for life, or get rich over a long period of time and be much better off. I recommend when you buy stocks, you look at the P/E ratio. It’s price of the stock divided by earnings per share. It gives you a much better indication weather a stock is over valued or not. Don’t look at stock price or % growth, look at the P/E ratio. Right now apple is at 30. The S&amp;P average P/E is like 15. Higher P/E the more investors expect the stock to grow. Hold apple for 10 years and undoubtedly it will be worth more than it is today (not a financial advisor). Apple is a solid buy, and it will continue to grow undoubtedly. For reference amazons P/E is in the 80’s and Tesla is in the 600’s. Focus on solid companies like apple that have a competitive advantage and will continue to grow. I’d look into a S&amp;P 500 ETF. It’s the top 500 companies in the US. It automatically filters the bad companies out and the good companies in. Stop looking at share price and % growth, and instead look at P/E of a company that is established and has a history of growth( pot stocks will always rise and fall no matter what)",
        "created_utc": 1627181454,
        "id": "h6fnj5o",
        "score": 111,
        "subreddit": "stocks",
        "created": 1627210254.0
    },
    {
        "author": "CoffeeQID",
        "body": "Aapl is not some pump and dump weed stock. It’s a buy and hold forever type of stock. Only sell if you need the money",
        "created_utc": 1627181524,
        "id": "h6fnnaa",
        "score": 111,
        "subreddit": "stocks",
        "created": 1627210324.0
    },
    {
        "author": "International-Cut598",
        "body": "Apple is the gift that keeps on giving lol. Rn my entire portfolio is being dragged above water by Apple while the rest does its damndest to keep me in the red. (Guess this is what happens when you decide to stop dcaing into apple&amp; mcd to instead  lump sum purchase arkg near its ath)",
        "created_utc": 1626354295,
        "id": "h59r5up",
        "score": 100,
        "subreddit": "stocks",
        "created": 1626383095.0
    },
    {
        "author": "morenewsat11",
        "body": "A good start, but title makes it sound like the whole universe of shares is covered instead of just 13 issuers.  What you can buy:\n\n&amp;#x200B;\n\n&gt;In addition to Shopify, fractional shares are being offered in Royal Bank of Canada, Toronto Dominion Bank, Canadian National Railway Co., Apple Inc., Amazon.com, Inc., Google LLC, Microsoft Corp., Netflix, Inc., Tesla, Inc., Airbnb, Inc., Coinbase Global Inc., and Nvidia Corp.",
        "created_utc": 1626259108,
        "id": "h551xpn",
        "score": 100,
        "subreddit": "CanadianInvestor",
        "created": 1626287908.0
    },
    {
        "author": "dnndrk",
        "body": "Lol really? Have u tried Disney + prime apple or crave? Their interface sucks ass. Try to fast forward or rewind with any of those platforms and you will like Netflix a lot more. I think Netflix have the best interface compare to all its competitors",
        "created_utc": 1626960491,
        "id": "h64hnsc",
        "score": 99,
        "subreddit": "stocks",
        "created": 1626989291.0
    },
    {
        "author": "MikkelTMA",
        "body": "Time to place a 50x leveraged Apple put.",
        "created_utc": 1626092074,
        "id": "h4wujag",
        "score": 98,
        "subreddit": "wallstreetbets",
        "created": 1626120874.0
    },
    {
        "author": "Stormseekr9",
        "body": "Never sell Apple shares.",
        "created_utc": 1626106745,
        "id": "h4xosra",
        "score": 98,
        "subreddit": "options",
        "created": 1626135545.0
    },
    {
        "author": "cousingerard",
        "body": "thank u tim apple",
        "created_utc": 1625716295,
        "id": "h4fpykh",
        "score": 95,
        "subreddit": "wallstreetbets",
        "created": 1625745095.0
    },
    {
        "author": "therealnorthwild",
        "body": "What is a stock like AAPL doing in a place like this.",
        "created_utc": 1626345375,
        "id": "h59dlsd",
        "score": 95,
        "subreddit": "wallstreetbets",
        "created": 1626374175.0
    },
    {
        "author": "puterTDI",
        "body": "I bought my first share of apple in 2012.  It has gone up 600% since then.\n\nGo look at their stock ticker, set the time frame to max, and decide for yourself what the best option is.",
        "created_utc": 1627182846,
        "id": "h6fprwe",
        "score": 95,
        "subreddit": "stocks",
        "created": 1627211646.0
    },
    {
        "author": "d-ronthegreat",
        "body": "Completely anecdotal, but I actually know a couple people who have been long time Android loyalists that switched to Apple in recent times. \n\nTheir business model has changed, they used to be known as the overpriced company, now they’re almost unanimously agreed on by experts as having some of the very best products in their price range.",
        "created_utc": 1627422246,
        "id": "h6r8u66",
        "score": 91,
        "subreddit": "stocks",
        "created": 1627451046.0
    },
    {
        "author": "Un-Scammable",
        "body": "I'm a professional so I'm going to make a 20 minute YouTube video stating that AAPL will either go up or go down before, during, and after earnings.",
        "created_utc": 1627332727,
        "id": "h6mp4cn",
        "score": 90,
        "subreddit": "stocks",
        "created": 1627361527.0
    },
    {
        "author": "discovery999",
        "body": "VUG, VOO, AAPL, GOOGL, MA, IEP, MSFT, AMZN, FB",
        "created_utc": 1625432475,
        "id": "h429j4f",
        "score": 90,
        "subreddit": "stocks",
        "created": 1625461275.0
    },
    {
        "author": "Tucci_",
        "body": "6 years ago I came into quite a bit of money and immediately invested the majority of it into AMZN, AAPL, GOOG, FB, MSFT. These seemed like extremely obvious bets and it's safe to say I'm sleeping well at night currently. As for more recent bets, I bought into ILMN, SQ and NVDA over the last 2-3 years.",
        "created_utc": 1625696510,
        "id": "h4enwbh",
        "score": 89,
        "subreddit": "investing",
        "created": 1625725310.0
    },
    {
        "author": "gupbiee",
        "body": "Make it free is my general policy. But with stocks like AAPL and MSFT I'd just hold cuz at the moment they're kinda too big to fail (or tank for the immediate future)",
        "created_utc": 1625537450,
        "id": "h46z84g",
        "score": 87,
        "subreddit": "stocks",
        "created": 1625566250.0
    },
    {
        "author": "Chromosome46",
        "body": "I’ve been all in on MVIS since December with 15 avg now, hiring of drew Markham is no joke her literal job is specializing in mergers and acquisitions. She never works at a place longer than few months (and it’s very expensive to keep staff like this onboard)\n\nI’m 99.999% certain this things going to Mars triple digits this year big auto mobility show in sept where mvis finally makes the world bow down. Not to mention us army using Hololens 2 which the entire project was based on the “alien/miracle tech” of mvis. Ar is the future how much are these big tier 1s, Facebook msft apple gonna pay to stay ahead and to keep others at bay… revolution of mobility coming this decade with autonomous driving",
        "created_utc": 1626920912,
        "id": "h62xy31",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1626949712.0
    },
    {
        "author": "401TCW",
        "body": "It will depend on what you do\n\nIf you decide to sell your calls, Apple will go up\n\nIf you decide to keep your calls, Apple will go down\n\nPlease let us know what you decide",
        "created_utc": 1626655989,
        "id": "h5p5ziu",
        "score": 86,
        "subreddit": "wallstreetbets",
        "created": 1626684789.0
    },
    {
        "author": "dudeARama2",
        "body": "I gotta admit, I used to be a trader and it got to be a problem.. I finally reached a point where I admitted to myself and I got my head wrapped around the Buffett idea of thinking of stocks as businesses or assets to own.. so I disabled options trading from my account and started buying stocks to own for the long term, after I built up enough SPY.. and AAPL was one of the first individual stock holdings. That was 8 years ago and just buying and holding made me far more than trading ever did and is a whole lot less stressful.",
        "created_utc": 1627423577,
        "id": "h6rbtms",
        "score": 82,
        "subreddit": "stocks",
        "created": 1627452377.0
    },
    {
        "author": "npransom",
        "body": "LOL, APPLE will only keep going up, very under valued.",
        "created_utc": 1625866386,
        "id": "h4mxj4y",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1625895186.0
    },
    {
        "author": "reddit-is-sus666",
        "body": "TLDR: don't pay etf fees, buy and hold aapl &amp; msft",
        "created_utc": 1626913739,
        "id": "h62j7rc",
        "score": 80,
        "subreddit": "stocks",
        "created": 1626942539.0
    },
    {
        "author": "TAEJ0N",
        "body": "AAPL was $13 in 2009? That’s crazy to me. I remember they had Macs and iPods back then. This was before iPhone’s became as big as they are now. Sounds like a great deal to me even back then.",
        "created_utc": 1627193772,
        "id": "h6g5biy",
        "score": 78,
        "subreddit": "stocks",
        "created": 1627222572.0
    },
    {
        "author": "Anth916",
        "body": "For me, it would be very hard to buy AAPL, knowing it was $20 per share cheaper just a few weeks ago. Of course, this kind of thinking can get somebody in trouble. You kick yourself for not getting in on the deal earlier, so you don't get in on the deal at all, and then the stock goes on a tremendous run, and you kick yourself for kicking yourself twice, lol.\n\nThis happens with me and Nvidia all the time. \"I'd love to own it, but it's too expensive!\" (goes up another 20 percent)... \"Damn, I'd really like to own some shares, but it's so overvalued!\" (goes up another 20 percent)... \"Now, it's really, really, really overvalued... These people are crazy\" (goes up another 20 percent).... \"Where's a really tall building?\"",
        "created_utc": 1626622535,
        "id": "h5n2ugu",
        "score": 78,
        "subreddit": "stocks",
        "created": 1626651335.0
    },
    {
        "author": "StrikePrice",
        "body": "Tim Apple gonna f you hard dude.",
        "created_utc": 1625870786,
        "id": "h4n636j",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1625899586.0
    },
    {
        "author": "RGJ5",
        "body": "Wtf you make $20 and now you want to sell? Well if your going to sell maybe you can buy QQQ to diversify and still have some apple in your portfolio",
        "created_utc": 1627181996,
        "id": "h6foeuo",
        "score": 75,
        "subreddit": "stocks",
        "created": 1627210796.0
    },
    {
        "author": "not_creative1",
        "body": "Lol exactly\n\n\nInvesting in apple or something makes sense. It’s low risk and a solid company. But damn, el pollo loco is a very brave choice",
        "created_utc": 1625349545,
        "id": "h3yo1hm",
        "score": 75,
        "subreddit": "investing",
        "created": 1625378345.0
    },
    {
        "author": "Michealchiv",
        "body": "AAPL",
        "created_utc": 1626088334,
        "id": "h4wpc0t",
        "score": 74,
        "subreddit": "wallstreetbets",
        "created": 1626117134.0
    },
    {
        "author": "Karnes",
        "body": "And don't just let it sit in the 'default' if you have direction opportunities.  If you're young put it to work in the more aggressive options (these are still most likely still low risk, relatively).  Many plans default to 'safer' directions.  And the average annual percentage return over years will make a ton of difference.  \n\nAnd if you leave a company... don't cash it out, you'll just be giving the government a huge payday.  Keep 100% of the pie by rolling it over to an IRA/IRRA.  \n\nPlus once its in an IRA you'll be able to place your money in any investment direction you like... you want it on AAPL, etc. whatever suits your fancy.  Plus as long as you keep the money in the IRRA there's no such thing as tax consequences.  Hold X for 10 days, make a profit, cash out... move it all to the next the stock.  Taxes are only paid once you move cash out of the IRA, and then just at whatever your tax rate is at that time.  Makes no difference how that money was made during the life of the IRA.",
        "created_utc": 1626660046,
        "id": "h5pe57w",
        "score": 74,
        "subreddit": "stocks",
        "created": 1626688846.0
    },
    {
        "author": "VacationLover1",
        "body": "u/timthetoolmantayl0r said that if his Apple $120p for 7/30 prints he will buy the entire sub a chick fil a milkshake.. I’m not sure the definition of prints so if $120p opens green tomorrow even by 0.001% and he doesn’t buy everyone a milkshake he gets a 120 day ban",
        "created_utc": 1627423627,
        "id": "h6rbxj5",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1627452427.0
    },
    {
        "author": "thelastsubject123",
        "body": "A 50% crash is the greatest gift the market can give\n\nImagine being able to go back in time and buying apple at half the price. That's what a crash is.",
        "created_utc": 1625436891,
        "id": "h42hxbs",
        "score": 73,
        "subreddit": "stocks",
        "created": 1625465691.0
    },
    {
        "author": "TheGhostofBillHwang",
        "body": "CaNt BeLiEvE ChiPotLe iS WoRtH MoRe ThAn ApPlE",
        "created_utc": 1626812461,
        "id": "h5x16tr",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1626841261.0
    },
    {
        "author": "Minute-Wolverine-144",
        "body": "Never puts on Apple. Lesson learned my friend.",
        "created_utc": 1625609784,
        "id": "h4adxe1",
        "score": 72,
        "subreddit": "stocks",
        "created": 1625638584.0
    },
    {
        "author": "Turlututu_2",
        "body": "buy companies that you like with strong fundamentals\n\nmarket breadth is horrible right now. meaning a select few stocks (AAPL, MSFT) are keeping the indices afloat while everything else is dumping. i would say its a stealth crash. the market is very 'risk off' right now\n\n&amp;#x200B;\n\n&gt;Like many of the stocks I had on my watchlist took over a month to bounce back from May lows, but within a week are closer to where they were in May. Just seems like buying a falling knife. Finally, growth stocks just can't seem to find a bottom.\n\nwell yeah, but that's a pretty dang good time to buy, don't you think? especially if your horizon is &gt; 1 year (i know... this is reddit. everyone here buys and sells stocks based on 5 min candles). it's better than buying stuff at ATH when everyone is optimistic and shouting that they're going to the moon\n\nthere are many good stocks getting slaughtered right now for no real reason. fundamentally they haven't changed. i think it's important to remember that companies != their stock price",
        "created_utc": 1626326586,
        "id": "h58r68w",
        "score": 72,
        "subreddit": "stocks",
        "created": 1626355386.0
    },
    {
        "author": "hammong",
        "body": "$AAPL for sure.   People are nervous about it cresting near all-time highs, that it's overweight or overextended.   Reality is they're going to have a stellar earnings on July 27, 20-25% increase in iPhone 13 sales when iPhone 12 was gangbusters.  That alone will push this higher.   How high?    My PT $175.    Time will tell.",
        "created_utc": 1626611005,
        "id": "h5mg6k8",
        "score": 72,
        "subreddit": "stocks",
        "created": 1626639805.0
    },
    {
        "author": "StonksBoss",
        "body": "When the new iPhone comes out, the screen will be sold separately to increase profit. Now apple is a 3T company ![gif](emote|free_emotes_pack|give_upvote)",
        "created_utc": 1625893250,
        "id": "h4o6vn5",
        "score": 67,
        "subreddit": "wallstreetbets",
        "created": 1625922050.0
    },
    {
        "author": "dephira",
        "body": "Actually FAANG is an acronym based on strong stock performance, and Netflix is by **far** the best performing stock of the 2010-2020 decade, which is when the acronym was coined. The other companies don't even remotely compare in terms of their 10 year returns:\n\n&amp;#x200B;\n\n|Netflix|\\+5980%|\n|:-|:-|\n|Amazon|\\+2497%|\n|Apple|\\+1834%|\n|Facebook|\\+822%|\n|Microsoft|\\+525%|",
        "created_utc": 1626896986,
        "id": "h61irlf",
        "score": 67,
        "subreddit": "stocks",
        "created": 1626925786.0
    },
    {
        "author": "PeterDRasmussen",
        "body": "One small thing when using Google finance which has tricked me several times...\r  \n\r  \nSometimes you need to prefix the stocks with the exchange. I do not think this is much of an issue if you trade American stocks, but for some of us Europeans you can sometimes get the wrong price if you do not prefix. For example:\r  \n\r  \nNYSE:SIM vs CPH:SIM. These are two different stocks, one on the New york stock exchange and one on the Copenhagen stock exchange.\r  \n\r  \nApple as mentioned would be =GOOGLEFINANCE(\"NASDAQ:AAPL\").\r  \n\r  \nI made a post about this some years back, which I cannot link to due to low Karma :)\r  \n\r  \nI use Google sheets too and like it a lot, sadly some markets (Oslo) is not there.",
        "created_utc": 1625992757,
        "id": "h4sh8wa",
        "score": 66,
        "subreddit": "stocks",
        "created": 1626021557.0
    },
    {
        "author": "Terrible_Panic_1601",
        "body": "Suits say we have had 6 corrections this year so far.  They all seem to last a few days tops. If the market does crash it better for me tesla will be $300 apple $60 airlines $20 a freaking fire sale. No matter what I'm not leaving",
        "created_utc": 1627269931,
        "id": "h6jpmfr",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1627298731.0
    },
    {
        "author": "MVST_100_OR_BUST",
        "body": "As much hate as you will get for this you are correct. All it would take in 2023 is a filing and amendment. Not only that but 15 Billion is the highest I've ever seen in my trading career. Right now the company with the most outstanding shares only has 5B authorized. Apple pre split only had 12B authorized. Tesla also only has a few billion. 15 billion is too much, it makes it seem they anticipate share price being low and having to offer a lot of shares",
        "created_utc": 1627003043,
        "id": "h672xu2",
        "score": 64,
        "subreddit": "SPACs",
        "created": 1627031843.0
    },
    {
        "author": "SalamandersonCooper",
        "body": "Here’s a story I don’t really tell anyone:\n\nWhen I was 15 I inherited $10k from my grandmother. I asked my dad to open a brokerage account for me and put it all in Apple. This was in 2005 at about $45 a share so a little more than 200 shares. \n\nI didn’t really think much about it until years later when I asked about the account and was told that my dad sold it in 2006. I think about it almost every day.",
        "created_utc": 1626543452,
        "id": "h5jbzrd",
        "score": 64,
        "subreddit": "StockMarket",
        "created": 1626572252.0
    },
    {
        "author": "DevilFucker",
        "body": "&gt;“I think the valuation seems imminently reasonable,” the “Mad Money” host said. “If you want to speculate on a Chinese IPO, you’ve got my blessing to bet on Didi. I would try to get as many shares as you can.”\n\nI think you need to take what he says in context. He says buy this stock if you want to speculate. He says to buy if you want in on a Chinese IPO. He also calls it a bet, which further clarified that this was a bit of a gamble. \n\nThis was a play intended for at a certain type of investor with a certain risk tolerance who wanted to be in a certain sector. This was not general advice aimed at any person who happened to be watching the show. And as new information comes out, I think he has the right to adjust his opinion accordingly. \n\n\nWhen you’re listening to an analyst, it’s never a good idea to just blindly follow their buys and sells without looking at the underlying information the analyst is putting out and seeing if you agree with his or her opinion. Obviously Cramer has gotten a lot wrong but I’ve never had a bad experience buying a stock on his advice because I only buy when I agree with his investment thesis. Some of my biggest winners over the years have come from watching his show, which include apple, NVDIA, Amazon, Facebook and google. And that’s because I only bought a few stocks out of the thousands he talked about that I strongly agreed with his analysis. On a show where one man goes over hundreds of stocks per week it would be insane to think he could make the right calls on all them. Or even a majority. You gotta use your own brain to determine if what an analyst is saying makes sense and really understand the company before pulling the trigger on any investment.",
        "created_utc": 1625756556,
        "id": "h4hav87",
        "score": 64,
        "subreddit": "stocks",
        "created": 1625785356.0
    },
    {
        "author": "bodiddlysquat26",
        "body": "If AAPL somehow craters to below $130 again I'm throwing everything at it. Leaps/shares/pictures of Timothy. It doesn't matter.",
        "created_utc": 1627418567,
        "id": "h6r0hl7",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1627447367.0
    },
    {
        "author": "gpbuilder",
        "body": "Too many speculative stocks and not enough in blue chips. Your apple and Microsoft position should be much larger. All your speculative small caps can not move for years while the blue chips keep going up.",
        "created_utc": 1626304785,
        "id": "h57n8fg",
        "score": 63,
        "subreddit": "StockMarket",
        "created": 1626333585.0
    },
    {
        "author": "Time_Trade_8774",
        "body": "Most analysts say FB and AMD are a bit underpriced. But who knows, never bet against AAPL or MSFT.",
        "created_utc": 1626365413,
        "id": "h5afofd",
        "score": 63,
        "subreddit": "stocks",
        "created": 1626394213.0
    },
    {
        "author": "dfreinc",
        "body": "i looked at it like 'cutting my losses' at +50%. felt weak. still think i'm right. second guessing that i didn't hold for long term gains. plan to buy back into apple leaps. their products are crack for pretty white people.",
        "created_utc": 1626666005,
        "id": "h5pp2rx",
        "score": 62,
        "subreddit": "wallstreetbets",
        "created": 1626694805.0
    },
    {
        "author": "Jt0323",
        "body": "Aapl bought me my house. Sold half of my 1200 position at 130 last year, was in about 40k to start, now I own 621 shares, no debt, and a house. I’m keeping them for retirement",
        "created_utc": 1627424418,
        "id": "h6rdnch",
        "score": 62,
        "subreddit": "stocks",
        "created": 1627453218.0
    },
    {
        "author": "z_vazos1738",
        "body": "Lmao yeah spy is fucked if Apple tanks with Microsoft",
        "created_utc": 1627416300,
        "id": "h6qve23",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1627445100.0
    },
    {
        "author": "deadlyspawn187",
        "body": "Hold great blue chip stocks like apple. Better option imo",
        "created_utc": 1627424487,
        "id": "h6rdssd",
        "score": 60,
        "subreddit": "StockMarket",
        "created": 1627453287.0
    },
    {
        "author": "Amused-Observer",
        "body": "I wish I had multiple thousands of dollars in expendable income to make reckless decisions like **buying puts on fucking Apple**.",
        "created_utc": 1625666524,
        "id": "h4crurj",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1625695324.0
    },
    {
        "author": "Spiderman760",
        "body": "Just bought next year $150 calls for Apple, just going to hold until end of month for earnings",
        "created_utc": 1626715247,
        "id": "h5rvrkd",
        "score": 57,
        "subreddit": "stocks",
        "created": 1626744047.0
    },
    {
        "author": "b_fellow",
        "body": "If AAPL is being labeled as a meme stock, then robot algorithms are going to mass sell",
        "created_utc": 1626350935,
        "id": "h59lcm4",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1626379735.0
    },
    {
        "author": "Ryano3",
        "body": "I agree with AMZN. AAPL seems unlikely to me but them again Apple always outperforms peoples expectations.",
        "created_utc": 1625901720,
        "id": "h4ohc8k",
        "score": 56,
        "subreddit": "stocks",
        "created": 1625930520.0
    },
    {
        "author": "BennyDR",
        "body": "Apple, Disney, LMT, Palantir",
        "created_utc": 1625431562,
        "id": "h427qgt",
        "score": 55,
        "subreddit": "stocks",
        "created": 1625460362.0
    },
    {
        "author": "mrdhood",
        "body": "I'm holding a long term horizontal debit spread on Apple that has done pretty well so far. It's a relatively small position ($2,377) but it is more of a speculation position than I normally do:\n\n* \\+2 Sep 16 2022 $130 Calls\n* \\-2 Jan 21 2022 $150 Calls\n\nAverage price: $11.89\n\nI opened in February (150 days ago), I'm currently up $1,063 (44%). I plan to keep holding until the Feb 2022 chains open up and then I'm going to start pushing further out through next summer.",
        "created_utc": 1626102531,
        "id": "h4xed1f",
        "score": 55,
        "subreddit": "options",
        "created": 1626131331.0
    },
    {
        "author": "domonx",
        "body": "lol, a thread full of people thinking that buying ITM $AMZN + $AAPL leaps is some great insider info play.  Doesn't take a genius or insider info to be buying leaps on 2 of the biggest company in the world that had been trading sideway for a year.",
        "created_utc": 1625601241,
        "id": "h49vabh",
        "score": 54,
        "subreddit": "options",
        "created": 1625630041.0
    },
    {
        "author": "VoteNixon2024",
        "body": "Cathie dead 💀\n\n\nTech dead 💀\n\n\nBoomers dead 💀\n\n\nMemes dead 💀\n\n\nSPY dead 💀\n\n\n\nTim Apple is the only living human right now",
        "created_utc": 1626277736,
        "id": "h55zfz4",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1626306536.0
    },
    {
        "author": "Cleavse",
        "body": "Completely disagree with not that hard running a company like Apple. \n\nA bad CEO can ruin a company in a short time.",
        "created_utc": 1627222175,
        "id": "h6h47as",
        "score": 52,
        "subreddit": "stocks",
        "created": 1627250975.0
    },
    {
        "author": "bscirca1981",
        "body": "100 bagger? Sheesh. Throw a dart and hope it lands on some company you’ve never heard of that goes from 5m to 500m\n\nPart of the problem for retail today is how much private equity is in the market. Concept startups with no revenue are reaching massive valuations through VC’s and by the time the unicorns go public it’s at 20b+ .. Now if they’re the next Apple they can hit the 2T to become a 100 bagger but thats once or twice a generation and takes 30 years.\n\nBesides some weird biotech shit, or crazy AI play, the best bet might be a smaller non-sexy company like Dutch Bros Coffee, that grows into a starbucks and moves from 1.5b to 150b (again, takes 30 years and they’re still private for now, btw).",
        "created_utc": 1626240704,
        "id": "h54h1i2",
        "score": 52,
        "subreddit": "stocks",
        "created": 1626269504.0
    },
    {
        "author": "jinitoza14",
        "body": "Probably trade sideways until earnings, then sell off. Slowly creeps back up and then everyone says wtf Tim Apple did it again as it hits new ATHs. Like clockwork my friend",
        "created_utc": 1626646150,
        "id": "h5olful",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1626674950.0
    },
    {
        "author": "Dav1d13",
        "body": "AAPL/MSFT/GOOGL/AMZN and go back to my daily life, knowing that I am in good shape!",
        "created_utc": 1625160913,
        "id": "h3pf3j1",
        "score": 51,
        "subreddit": "stocks",
        "created": 1625189713.0
    },
    {
        "author": "Extremely-Bad-Idea",
        "body": "That's all true.  Perhaps I should have worded the question differently.  Since Branson and Bezos are so personally identified with their companies, what happens to the culture of their company, its level of innovation, and long term stock price if the founder is gone?  For example, Apple did not do well in the years immediately after Steve Jobs' death.  It took them about 5 years to get moving in the right direction again.",
        "created_utc": 1625940280,
        "id": "h4q3vc2",
        "score": 51,
        "subreddit": "stocks",
        "created": 1625969080.0
    },
    {
        "author": "Aids072",
        "body": "Apple blowout quarter incoming",
        "created_utc": 1627305663,
        "id": "h6l0uxa",
        "score": 51,
        "subreddit": "stocks",
        "created": 1627334463.0
    },
    {
        "author": "SweetPotatoStew",
        "body": "While there is something to be said about going all in on a small cap, I think it’s dangerous to say “low risk, solid company” would’ve been a better choice.\n\nHell, General Motors was described as that 5 years ago. \n\nOr, to avoid the low-hanging fruit, Lockheed is still considered a “low risk, solid company” today. But they haven’t outpaced the S&amp;P500 over the past 5 years. \n\nI think the lesson learned is Index the majority of your portfolio. Not, “you should’ve pick Apple”",
        "created_utc": 1625351761,
        "id": "h3yrycr",
        "score": 51,
        "subreddit": "investing",
        "created": 1625380561.0
    },
    {
        "author": "dynamojoe",
        "body": "They'll keep telling me about \"New Battery Stuns EV Market\" or \"Legend who bought AAPL at 1.43 says to buy this one stock\".",
        "created_utc": 1625436434,
        "id": "h42h2uy",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1625465234.0
    },
    {
        "author": "Ghause123",
        "body": "I don’t think anyone lost money on calls on AAPL today other than you. Great job retard, here’s ur upvote",
        "created_utc": 1626297549,
        "id": "h578bk7",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1626326349.0
    },
    {
        "author": "juiceology",
        "body": "Exactly, year long calls on AMZN at 3000 and AAPL at 100 is pretty much no risk gamble",
        "created_utc": 1625591097,
        "id": "h498onf",
        "score": 50,
        "subreddit": "options",
        "created": 1625619897.0
    },
    {
        "author": "LastInspiration",
        "body": "apple literally just broke out of huge resistance today and you short it?\n\na true retard indeed, you belong here. RIP on monday.",
        "created_utc": 1625876221,
        "id": "h4nf3x4",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1625905021.0
    },
    {
        "author": "SoftwareAggressive10",
        "body": "I have Apple CCs at $149 for 8/20. First time in my trading history I ever fat fingered. Meant $159. :/",
        "created_utc": 1627097697,
        "id": "h6bu4q3",
        "score": 49,
        "subreddit": "options",
        "created": 1627126497.0
    }
]