[
    {
        "author": "Ironleg01",
        "body": "I think you are looking at it from purely logical perspective and discounting geopolitics. Just to come back to Huawei for a second. US could have said we don't use your 5G equipment and that's final. But that's not all they did. They forbid Google licensing Android to them, they forbid everyone from selling chips from them, they even made a big fuss about Seagate selling HDDs to them. It wasn't just about 5G equipment. They destroyed the whole company just to spite China. Now, yes BABA probably don't care about spying on US but say if their cloud business really takes off, and there are these tensions with China and US really wants to damage China in any way they could just say BABA is selling software to Chinese military to enslave muslim minorities or some such bullshit and we would see all sorts of bans and sanctions. Certainly say goodbye to your ADRs. Logical? No. Makes sense to weaken your biggest rival in any way in geopolitical sense? Yea. I would not think something like that is impossible.",
        "created_utc": 1622758156,
        "id": "h0ht0we",
        "score": 10,
        "subreddit": "stocks",
        "created": 1622786956.0
    },
    {
        "author": "JoanOfSnarke",
        "body": "$MSFT is a good buy but doubt that huge market cap is gonna get moved that much by the gaming sector. \n\nI would find maybe smaller caps that are more focused on gaming. Some suggestions: STX, CRSR, BLIZZARD, WDC.",
        "created_utc": 1623427633,
        "id": "h1f0q6z",
        "score": 5,
        "subreddit": "options",
        "created": 1623456433.0
    },
    {
        "author": "Typical-Technician46",
        "body": "UH FELLOW APES? \n\nits me the sky, just letting you know, im pulling my panties to the side and ready to receive a rocket straight up the stink. \n\nonly WDC and stx permitted though.   \ntee hee",
        "created_utc": 1622727241,
        "id": "h0frb66",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622756041.0
    },
    {
        "author": "jetoak",
        "body": "I am considering investing for longer term gains in a personalized portfolio (and not pay too much attention day to day) and would like to get advice on if this is good or make any adjustments:\nFB, V, TGT, CVX , RVL, INMD, APPN, GS, PYPL, GNRC, DOCU, MSFT, NVDA, STX, FTNT\nThanks in advance",
        "created_utc": 1624907282,
        "id": "h3cpws5",
        "score": 2,
        "subreddit": "stocks",
        "created": 1624936082.0
    },
    {
        "author": "thekookreport",
        "body": "I used to own it.  It’s a duopoly with Seagate and both companies are great at capital allocation.  When The market consolidated, everything changed",
        "created_utc": 1624335841,
        "id": "h2m910a",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624364641.0
    },
    {
        "author": "cacy1800",
        "body": "You just guessed that this entire page is a trap for newbies I figured this out immediately and learned how to trade properly. Amd med stx are making me money you can to I would highly suggest amd.",
        "created_utc": 1624555049,
        "id": "h2wmm4o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624583849.0
    },
    {
        "author": "cacy1800",
        "body": "MED is showing a reversal and STX is about to reverse as well",
        "created_utc": 1624455848,
        "id": "h2rmgyw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624484648.0
    },
    {
        "author": "TheVision2020",
        "body": "Esgc!! Hot sector, largest Bollywood library, loads of institutional investors, way undervalued and operating under the radar so institutions can keep loading up. Your hidden gem. 2000x potential in 5 years easily attainable. if STX is able to streamline this merger... Buy out potential. consolidation occurring in streaming sector and everyone is trying to get a peace of the India pie.",
        "created_utc": 1624929457,
        "id": "h3e11sw",
        "score": 1,
        "subreddit": "investing",
        "created": 1624958257.0
    },
    {
        "author": "skilliard7",
        "body": "I've found I've had best luck with a balance of passive and active investing. I start with a portfolio of index funds based on factor investing(mostly chasing value premium),  and devote a small percentage of my portfolio to at most a few individual stocks where I'm confident they are undervalued.\n\nI've had a lot of luck with this strategy so far. What I've learned from my early mistakes is:\n\n1. Don't own anything unless you have a very good reason for owning it. If your reason is \"their dividend is good\", \"their business is booming\", or \"they seem like a sustainable business\", just stick with index funds. You need a compelling reason the market is not valuing them fairly, something that isn't priced in. When I bought SLV, it was because I knew it was a temporary liquidity crunch and that fed actions would drive inflation fears. When I bought LUMN, it was because I took a deep look into their financials and determined they were undervalued. When I bought Western Digital &amp; Seagate, it was because I saw the potential for Chia to boost their earnings.\n\n2. Buy as if you can't sell for 5 years. It's possible that after you buy, the price starts dropping and doesn't recover. If that happens, will you be comfortable holding it? If the answer is no, then either don't buy, or keep it to a very small position.\n\n3. Don't buy a ton individual stocks to \"diversify\". 1 stock you are confident in accounting for 5% of your portfolio and a broad market index like VTI for the remaining 95% is safer than 40 manually picked stocks each representing 2.5%.",
        "created_utc": 1623681657,
        "id": "h1qh3bt",
        "score": 1,
        "subreddit": "investing",
        "created": 1623710457.0
    },
    {
        "author": "randomizedasian",
        "body": "STX I might just all in.",
        "created_utc": 1624682863,
        "id": "h32r8ze",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624711663.0
    }
]