[
    {
        "author": "CrawfishSam",
        "body": "My advice to be less frazzled...\n\nPick 10 or 20 stocks\n\nBuy a little at a time. $500 day one. $500 another day, etc.\n\nBuy more when they are red, not when they are green.\n\nLately I look for ones with 25% upside potential. I usually look for ones 25% below where they have been in the past \\~2 years.\n\nLow debt\n\nPast growth, starting. to turn the corning again  on revenue - maybe hit by covid. \n\nIf they talk about the stock a lot on CNBC in the morning shows it is probably too late. In general CNBC only talks about large stocks so mid and small caps are generally what I end up with. Generally you can follow the trends they talk about Industrials, etc.\n\nPick what's next not what's happening now.\n\nMaybe pick up a couple Banks or Reits below book value - that are improving or their is a reason they will improve (opening economy)",
        "created_utc": 1614880068,
        "id": "gpod1p2",
        "permalink": "/r/StockMarket/comments/lxkou8/accepting_i_dont_have_the_temperamental_qualities/gpod1p2/",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1614908868.0
    },
    {
        "author": "Giantomato",
        "body": "Corning",
        "created_utc": 1615239582,
        "id": "gq9bw57",
        "permalink": "/r/stocks/comments/m0cz9v/rstocks_daily_discussion_monday_mar_08_2021/gq9bw57/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615268382.0
    },
    {
        "author": "Academic-Aside-9088",
        "body": "Lumen Technologies (NYE: LUMN) Expands Fiber Network Across U.S. and Europe\n\nProject uses Corning fiber to create largest ultra-low-loss fiber network in North America, substantially adding to significant fiber network.\n\nAs customer demand for extreme high-capacity, low-latency data transport continues to grow, Lumen Technologies is utilizing its global multi-conduit infrastructure to expand the company’s intercity network by 4.7 million miles of fiber, making it the largest ultra-low-loss fiber network in North America.\n\n“Our newly-built intercity fiber network, created with the latest optical technology, is another example of how our diverse fiber assets differentiate us from other network providers,” said Andrew Dugan, Lumen chief technology officer. “Our multi-conduit infrastructure has a significant amount of capacity for supporting the growing demand for fiber and will allow us to quickly and cost effectively deploy new fiber technology now and in the future. This uniquely positions Lumen to meet the needs of companies seeking highly reliable, low-latency network infrastructure designed to move massive amounts of data.”\n\nThe first phase of this overbuild fiber network, completed in June 2019, connects more than 50 major cities throughout the U.S. and represents another powerful asset in Lumen’s vast global fiber-optic network, which includes a purpose-built long-haul network and dense metro networks designed to stay ahead of the growing data demand. The second phase of this expansion will include areas in Europe and will be completed by early 2021. The expanded infrastructure, using the latest optical innovations from Corning Incorporated (NYSE: GLW), will enhance performance levels across Lumen’s network, benefiting businesses, government agencies and providers seeking fiber to build their own secure, scalable networks for demanding next-generation applications.\n\nThis project uses Corning’s SMF-28® ULL fiber and SMF-28® Ultra fiber in a hybrid Corning® SST-UltraRibbon™ cable. With a silica core design, SMF-28 ULL fiber offers the lowest loss of any terrestrial-grade optical fiber and will provide the CenturyLink network with a boost in optical signal-to-noise ratio (OSNR) which can extend optical reach at very high data rates. The added capacity will further improve the scalability of the network to meet the high bandwidth demands of emerging technologies and applications such as 5G, augmented reality, high-definition video streaming and the Internet of Things.\n\n“A next-generation network requires next-generation optical infrastructure, and we believe Corning's fiber and cable innovations will enable Lumen and its customers to unlock the opportunities presented by the Internet of Things and other transformative technologies\" said Dr. Bernhard Deutsch, vice president and general manager, Corning Optical Fiber and Cable. \"With the expanded optical reach and capacity provided by our ultra-low-loss fiber, Lumen will magnify the capabilities of their expansive, scalable fiber network.”\n\nLumen was able to quickly and cost effectively complete the first phase of the project using multi-conduit infrastructure already in place. The company is currently selling routes to large enterprise companies and content providers in the U.S. and will work with customers to add additional routes as needed.\n\nKey Facts:\n\nLumen is creating an extensive 4.7-million fiber mile intercity fiber network across the U.S. and parts of Europe.\nThe first phase, comprising 3.5 million fiber miles, was completed in June 2019.An additional 1.2 million fiber miles will be added by early 2021.\nLumen is currently selling fiber routes to large enterprise companies and content providers in the U.S.\nMulti-conduit infrastructure allows Lumen to quickly and economically deploy new fiber technology or    add network capacity as needed.\nThe expanded fiber network utilizes Corning’s SMF-28® ULL fiber and SMF-28® Ultra fiber, creating the largest ultra-low-loss fiber network in North America.\n\nAdditional Resources\n\n *See Lumen’s expanded intercity network map:  http://filecache.mediaroom.com/mr5mr_century_link/183014/FiberMap_Update0719_FINAL.jpg\n\n *Hear Andrew Dugan explain the benefits of the fiber network expansion: http://origin-qps.onstreammedia.com/origin/multivu_archive/MNR/Century_Link_Dark_Fiber_Andrew_Dugan_Proof_v4.mp4\n\n *Learn more about CenturyLink Dark Fiber:  http://www.centurylink.com/business/networking/dark-fiber.html\n\n *Learn more about Corning’s SMF-28® ULL fiber and SMF-28® Ultra fiber: https://www.corning.com/worldwide/en/products/communication-networks/products/fiber/smf-28-ull.html\n\nAbout Lumen Technologies \n\nLumen Technologies is the second largest U.S. communications provider to global enterprise customers. With customers in more than 60 countries and an intense focus on the customer experience, Lumen strives to be the world’s best networking company by solving customers’ increased demand for reliable and secure connections. The company also serves as its customers’ trusted partner, helping them manage increased network and IT complexity and providing managed network and cyber security solutions that help protect their business.\n\nAbout Corning Incorporated\n\nCorning (www.corning.com) is one of the world's leading innovators in materials science, with a more than 165-year track record of life-changing inventions. Corning applies its unparalleled expertise in glass science, ceramic science, and optical physics along with its deep manufacturing and engineering capabilities to develop category-defining products that transform industries and enhance people's lives. Corning succeeds through sustained investment in RD&amp;E, a unique combination of material and process innovation, and deep, trust-based relationships with customers who are global leaders in their industries.",
        "created_utc": 1614862451,
        "id": "gpnbrqm",
        "permalink": "/r/investing/comments/lnrpib/what_can_you_say_about_lumn_it_looks_like_a_stock/gpnbrqm/",
        "score": 1,
        "subreddit": "investing",
        "created": 1614891251.0
    },
    {
        "author": "MartinStan7997",
        "body": "Anyone interested in Corning $GLW? They're a huge materials tech company with ties to Qualcomm, Apple, Samsung, etc. Seem to be relatively good value and have been consistently buying back shares over the past few years.",
        "created_utc": 1614800606,
        "id": "gpkiru5",
        "permalink": "/r/stocks/comments/lwt9oz/what_stocks_do_you_believe_are_currently/gpkiru5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614829406.0
    },
    {
        "author": "YEET_THE_VOTE",
        "body": "IBM developing COVID multi pass for NY - https://www.governor.ny.gov/news/governor-cuomo-announces-pilot-program-testing-excelsior-pass-madison-square-garden-and",
        "created_utc": 1614709101,
        "id": "gpfvuel",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpfvuel/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614737901.0
    },
    {
        "author": "JimJamSquatWell",
        "body": "I know you are getting flack for this but I think you have a point - look at palisamo/ginetty at IBM buying back shares to hit their arbitrary EPS metric promise.\n\nThe company is the definition of stagnation so buy backs were a way to influence that metric.\n\nI worked at IBM during that time and it was and still is a terrible place for 75% of the employees, that money did nothing to change IBMs ability to be competitive in the market.\n\nI don't think buy backs are always negative but they are certainly a lever to pull and companies can pull that lever too much.",
        "created_utc": 1614705228,
        "id": "gpfmxzr",
        "permalink": "/r/investing/comments/lw3v1m/warren_buffett_says_berkshires_apple_investment/gpfmxzr/",
        "score": 2,
        "subreddit": "investing",
        "created": 1614734028.0
    },
    {
        "author": "ilinula",
        "body": "IBM generates plenty of cash to cover its high dividend as well as share buy backs. What does that have to do with their ability to be competitive in the market? Free cash flow yield is a completely different metric, and it returns more value to shareholders for a company that is stagnating or declining. It's perfectly reasonable for them to buy back shares instead of sit on cash. I would prefer to hold a company like this than one that continually is able to be 'competitive in the market' but doesn't generate any cash so it has to issue shares year-over-year in order to supplement it's growth",
        "created_utc": 1614707972,
        "id": "gpft96t",
        "permalink": "/r/investing/comments/lw3v1m/warren_buffett_says_berkshires_apple_investment/gpft96t/",
        "score": 2,
        "subreddit": "investing",
        "created": 1614736772.0
    },
    {
        "author": "acppanday",
        "body": "IBM - it’s the hottest stock on the market",
        "created_utc": 1614711556,
        "id": "gpg1lp2",
        "permalink": "/r/wallstreetbets/comments/lw9kxm/a_picture_is_worth_a_thousand_words_next_stop_65/gpg1lp2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614740356.0
    }
]