[
    {
        "author": "Ironleg01",
        "body": "I've noticed you mentioned HPE. They are doing some really cool stuff for sure. On top of that they are profitable, pay dividend and trade really cheap at least now. I'm hoping that my HPE shares will do Microsoft-like comeback someday. In 5 years time I will either look very smart or very stupid. We will see.",
        "created_utc": 1617492464,
        "id": "gtamk3s",
        "permalink": "/r/stocks/comments/migc3s/anybody_else_betting_large_on_midcap_tech/gtamk3s/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617521264.0
    },
    {
        "author": "VikingzTV",
        "body": "$HPE is my tried and true money printer with 14c weeklies 😂🚀",
        "created_utc": 1617632585,
        "id": "gtgfqzj",
        "permalink": "/r/wallstreetbets/comments/mkh463/daily_discussion_thread_for_april_05_2021/gtgfqzj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617661385.0
    },
    {
        "author": "suphater",
        "body": "I'm focusing on all of tech, but primarily companies I know. Even if Powell raises federal interest rates early and we have another setback, which he has said over and over he won't so I believe him, interest rates are going to be very low for a few years. \n\nFirst let me summarized why I believed the cycle was already on the verge of turning back to tech, posted earlier in the week in an Ark thread.\n\nDisclaimer, assume I have a position on every stock in this topic, even the retails.\n\nApple and Amazon started falling from their ATH quite awhile ago actually, before the rest of the tech correction. They bottomed out around 118 and 3000, both dipping below those marks even but not for long. Then they started to show resistance and basically trade sideways around 120 and 3050 while the rest of tech continued to sink, and finally early this week they were even rising and beating the market. This all showed a bottom out to me.\n\nDisney was my reopening stock, crushing it and breaking ATH. The news and this sub was all about DIS and other reopenings/retail/cyclicals. But then they started to fall back on positive earnings. They got a one hour bump from positive park news, the next time they got zero bump from positive park news, and they fell a good 10% from their ATH.\n\nBy the time Roku hit 300, Etsy below 200, SQ at 200, it was time to put all money possible in. Even if they keep going down, at that point I don't believe they can go too much farther, as they were at their prices from last Fall, much like Apple and Amazon had bottomed out there. These stocks are going to fall to summer prices while TGT soars indefinitely past its ATH high?  Fine I'll keep buying down, but I don't think so. Now we have lulu being shorted as soon as they beat earnings and there's nothing but positive news, the same thing that was happening to the companies like Apple a couple months ago.\n\nThe bond yields should climb some more and stabilize closer to 2, maybe even in the near future, so there might be some more choppiness ahead. I wouldn't be surprised if it's not even that bad and we already got most of that priced in though.\n\nFAANG of course is recommended, although I did think it was interesting Biden called out Amazon twice in the infrastructure speech and there may be bipartisan agreement against some of these companies. It's not like I see any major problems here, but I think their cash reserves will matter more in a year or so, so they're just buy as you can per usual.\n\nMy favorites are the household names or dependable tech stocks that are still way below their ATHs. I'm deep and long on Roku, just search the sub for the excellent DD about Roku if you don't really know what they're about. Their industry is mid-game, so room to grow, but also at a point where Roku has spent the money to secure their position, with an agreement with every major streaming service, pretty much every non-first or discount tier smart TV brand, and now their own advertisement company which is where their money flow will come, as they both help the streaming services make money while getting a cut. They crushed earnings and gave a better than expected outlook but fell $180, all I could post was to buy at point. They are not a gimmick, they are over 70% institutionally owned.\n\nSquare, PayPal, Zoom, Tesla, Etsy, Pinterest, pick your poison, there's more than I can think off the top of my head. I'm picking as many of these household tech stocks that have been around for years and will be around for years to come. I don't see a reason to get safer investments while these stocks are 50-75% from ATHs if you can ride it out long enough for them to climb again. I'll even throw out an Uber mention despite their bump in UK, because this is a household name product.  I hate apps, but I'm not deleting by Uber app anytime soon. Longevity and % of dip is what I'm focused on when it comes to taking on perceived risk.\n\nThen you can look at stocks I don't even like such as LMND and FSLY. Fastly is still almost 50% from its ATH, sure I'll take a small position there. A short time of rising with the rest of the market and one positive news story and they'll be back to at least $85 or $90, surely.\n\nPeople are over the semiconductor shortage by now after MU yesterday, right? Surely semiconductors, ev charging, clean energy, uranium, etc has room to climb even if they can't boom as fast as they did previously? \n\nSoftware companies? Sure. HPE was unaffected lately.check that chart. I guess it's because they pay dividends, all I know is they're working on every futuristic cloud and software idea. I won't even talk someone out of PLTR, we know it's going to continue being pumped daily on Reddit lol, but it's also by far the lowest Institutionally owned stock in this post I'm sure. MDB should be a good one again although it already got 8.5% since Thursday opening,it's 75% from its ATH and the company is going to be around for awhile.\n\nI don't know your companies, and I like to focus on what I know, but I will look into them too. I don't think this tech storm lasts too much longer, and regardless of how long it lasts I'm riding it out if I believe the company will be a well known name five years down the road.\n\nHappy day off everyone, hopefully the next quarter is good to you all. Just get SPY or something if you want to safely grow your money, I think that route will be very good to you this year and beyond as well.",
        "created_utc": 1617366410,
        "id": "gt4un4w",
        "permalink": "/r/stocks/comments/migc3s/anybody_else_betting_large_on_midcap_tech/gt4un4w/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617395210.0
    },
    {
        "author": "Abu-alassad",
        "body": "Hewlett-Packard",
        "created_utc": 1617288084,
        "id": "gt1acws",
        "permalink": "/r/wallstreetbets/comments/mhu8tg/gme_megathread_for_april_01_2021/gt1acws/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1617316884.0
    }
]