[
    {
        "author": "bonejohnson8",
        "body": "I'M WHITE WITH BLACK STRIPES.\n\nThat's the racist zebra.",
        "created_utc": 1627882602,
        "id": "h7ed0wy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1627911402.0
    },
    {
        "author": "illusiveab",
        "body": "The fuck is ZEBRA",
        "created_utc": 1628316181,
        "id": "h80zxyc",
        "score": 2,
        "subreddit": "options",
        "created": 1628344981.0
    },
    {
        "author": "Xzlk",
        "body": "Not even lying, this is the first day in my life where I’ve seen $ZBRA red. I know it’s been red before obviously but this is the first day I’ve seen it with own eyes. Kinda mad the streak was broken.",
        "created_utc": 1628271166,
        "id": "h7yjaec",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628299966.0
    },
    {
        "author": "Fox_Technicals",
        "body": "ZBRA GIDDY UP DAMMIT",
        "created_utc": 1628174182,
        "id": "h7t940b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628202982.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  3rd of August\n\n\n\n## Upcoming events for Tuesday, August  3rd\n\n - Expected earnings:\n\n  ACOR, ADCT, AENZ, AFG, AHH, AIZ, AKAM, ALNY, ALTO, AME, AMGN, ANDE, ANIX, APAM, APEN, APRN, APT, APTO, AQST, AQUA, ARC, ARNC, ARVN, ATEC, ATI, ATKR, ATOM, ATVI, AVID, AVNS, AY, AYX, BABA, BEN, BGFV, BHC, BHG, BKEP, BKH, BLD, BLKB, BNFT, BNL, BP, BRY, BXC, BYFC, CAR, CDEV, CDLX, CDXC, CECE, CEIX, CERS, CFBK, CGBD, CHCT, CHSCP, CIX, CLDT, CLSK, CLX, CMI, CNR, COHR, COP, COUR, CPE, CPSI, CPSS, CRD.A, CRD.B, CRIS, CRK, CRNC, CRSR, CRVL, CSLT, CTSO, CW, CWEN, CWEN.A, CWH, CZR, DCPH, DD, DEA, DEI, DENN, DISCA, DISCB, DISCK, DK, DKL, DNB, DS, DSKE, DSX, DVA, DVN, EC, EDU, ELVT, ENLC, EPZM, ESPR, ET, ETN, ETRN, EVTC, EXPD, EZPW, FCNCA, FI, FICO, FIS, FMC, FNF, FNHC, FOE, FRG, FSP, FSTR, GBL, GBT, GDOT, GECC, GHL, GIC, GLDD, GLRE, GLT, GLTO, GMRE, GNW, GRBK, GTE, H, HEES, HEP, HLF, HLI, HLNE, HPP, HSC, HSIC, HSKA, HST, HY, HZN, IAA, ICFI, ICHR, IDN, IDRA, IGT, INCY, INFN, INGR, INN, INSP, INVE, IOSP, IPGP, IT, ITIC, IX, J, JAX, JAZZ, JBGS, KAI, KAR, KFRC, KKR, KLDO, KNSA, KOPN, KTOS, KWR, LCII, LDI, LDOS, LEU, LGIH, LHX, LIND, LLY, LPG, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, LYV, MANT, MAR, MCHP, MCRB, MCY, MDNA, MDXG, MEC, MGRC, MGY, MIC, MIME, MKL, MNOV, MNR, MNTX, MRCC, MRCY, MTCH, MTRN, MUFG, MYGN, NBIX, NCR, NCSM, NDLS, NE, NEWR, NKLA, NMIH, NNN, NPO, NPTN, NR, NRC, NSA, NVST, NVT, NVTA, OAS, OCFT, OCN, OI, OKE, OMI, OMP, ONCR, OPCH, OPTN, OSUR, OXY, PAA, PACB, PAGP, PAYC, PBI, PCRX, PEAK, PEG, PERI, PKOH, POWL, PRIM, PRO, PRU, PSA, PSB, PSX, PSXP, PTRS, PUMP, PVAC, QTS, QUAD, RCKY, RCM, RDN, RGA, RHP, RIBT, RIGL, RL, RM, RMRM, RNG, ROCK, RPAI, RRD, RVPH, RYAM, RYTM, SABR, SAGE, SATS, SEB, SEE, SHO, SKLZ, SKT, SKY, SKYT, SLRC, SND, SONY, SPT, SPWR, SQNS, SRC, SRNE, STAR, STIM, STLA, SUN, SUNS, TACT, TALO, TBPH, TCS, TDG, TISI, TNC, TRTX, TSLX, TSQ, TTEC, TX, UA, UAA, UBOH, UFPT, UNM, USAC, USCR, UTL, VAL, VECO, VERI, VNTR, VREX, VRSK, VVNT, WAT, WBT, WEC, WEYS, WHLR, WK, WLK, WLKP, WLTW, WMC, WMG, WRN, WSR, WTI, WTTR, XFOR, XHR, XP, XPER, XYL, ZBH, ZBRA\n\n - Ex-div:\n\n  ATR, BBD, BBDO, BCBP, EIG, ETRN, HFWA, MKTX, NTIC, SHEN\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.000%)\n    - API Weekly Crude Oil Stock (previous: -4.728M)\n    - Durables Excluding Defense (previous: 1.0%)\n    - FOMC Member Bowman Speaks\n    - FOMC Member Clarida Speaks\n    - Factory Orders (consensus: 1.0%, previous: 1.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 54.3)\n    - Redbook (previous: 16.0%)\n    - Total Vehicle Sales (previous: 15.40M)\n\n## Upcoming events for Wednesday, August  4th\n\n - Expected earnings:\n\n  AAU, ABC, ABIO, AC, ACA, ACAD, ACEL, ACIU, ACLS, ACR, ADMA, ADPT, ADT, ADTN, AEIS, AERI, AFIN, AGL, ALB, ALE, ALG, ALIM, ALKT, ALL, ALLO, ALNA, ALRN, ALTM, AMED, AMOT, AMPE, AMPY, AMSC, ANGI, ANSS, APA, APO, ARLO, ARTNA, ASMB, ASTE, ASYS, ATO, ATRA, ATRC, ATTO, AVA, AXGN, BBSI, BCLI, BCOR, BCSF, BCYC, BDC, BDSI, BE, BFAM, BGCP, BKNG, BKTI, BLPH, BLUE, BNGO, BOOT, BRSP, BTG, BVH, BWA, CAMT, CCMP, CCRN, CCU, CDAY, CDW, CENT, CENTA, CENX, CFMS, CHNG, CIA, CIB, CIGI, CIM, CKPT, CLH, CLVS, CLW, CMLS, CMP, CPA, CPK, CPS, CRL, CRTO, CSGS, CSII, CSTE, CSWI, CUTR, CVGI, CVRX, CVS, CYAD, DAR, DCP, DFIN, DGII, DHC, DLHC, DMTK, DNOW, DOC, DOX, DRTT, DVAX, DXC, EA, ECPG, EDIT, EDRY, EGHT, ELF, EMKR, EMR, ENBL, EOG, EOLS, EQH, EQX, ERJ, ERO, ETR, ETSY, EVH, EVOP, EVRI, EXC, EXPI, EYPT, FATE, FCPT, FDP, FENC, FLMN, FLOW, FLT, FLXN, FOX, FOXA, FPI, FRGI, FRT, FSLY, FTDR, FUN, FVE, GDDY, GEL, GEO, GGB, GHC, GLAD, GLBZ, GM, GMED, GNK, GPRK, GRP.U, GRTS, GTHX, HARP, HBB, HCC, HDSN, HFC, HHC, HI, HMC, HNGR, HR, HRTX, HUBS, HWM, HYMC, HZNP, IAC, IAG, ICD, ICUI, IIPR, IMXI, INGN, INMB, INSG, IO, IONS, ISEE, ISSC, IVC, IVR, JACK, JLL, JRVR, KBAL, KE, KHC, KIN, KLIC, KRO, KRTX, KUKE, KW, KZR, LAND, LESL, LHCG, LILA, LILAK, LL, LMND, LMRK, LNC, LPI, LUMN, MAC, MASS, MAXR, MBI, MCK, MCS, MDCA, MDU, MED, MET, MFC, MGLN, MGM, MGPI, MIDD, MLR, MLVF, MNKD, MNRL, MNTV, MOD, MPC, MPLX, MRO, MTG, MTOR, MVIS, MWA, NC, NEPH, NESR, NEWT, NEX, NHTC, NI, NL, NMFC, NMR, NODK, NP, NSPR, NSTG, NTEC, NUS, NVRO, NWPX, NXST, NYT, OCDX, ODP, OESX, ONEM, OPRX, OR, ORA, ORCC, ORIC, OSPN, OTIC, OYST, PACE, PARR, PCSA, PDCE, PETQ, PFLT, PING, PIRS, PLMR, PLTK, PLUS, PLYA, PNNT, PROF, PSN, PSNL, PTVE, PW, QNST, QRVO, QTWO, QUIK, RCII, RCKT, RCL, REGI, RESN, RGR, RKT, RMAX, RMNI, RNWK, ROKU, RPD, RPT, RTLR, RVI, RVLV, RYI, RYN, SAFT, SALM, SANA, SBGI, SBOW, SBRA, SCU, SD, SENEA, SENEB, SGRY, SITE, SITM, SJI, SLCT, SLF, SLGL, SLNG, SMFG, SMG, SMP, SMSI, SPNS, SPR, SRDX, SRI, SRPT, SSRM, SSSS, STAA, STKL, STN, SUM, SUP, SUPN, SWM, TELL, TGB, TGI, TLC, TNDM, TPC, TPVG, TRC, TREC, TRMB, TRNO, TS, TSE, TT, TTGT, TUP, TVTY, TWNK, TWO, TXG, TXMD, UBER, UE, UFCS, UFI, UGI, UHAL, UIHC, ULCC, UMH, UPLD, URG, URGN, USDP, USWS, UTHR, UVV, VCEL, VIRT, VMC, VRCA, VRDN, VTOL, VVV, VWTR, VZIO, WCN, WDC, WLFC, WLL, WTS, WU, WYNN, XNCR, XPL, YELL, ZYME\n\n - Ex-div:\n\n  AWI, CATC, CCK, DKL, FELE, IBTX, IDA, KBH, MATX, NEP, NWBI, OFED, OPBK, SIMO, STBA, TGP, VBTX, VLO, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.000%)\n    - API Weekly Crude Oil Stock (previous: -4.728M)\n    - Durables Excluding Defense (previous: 1.0%)\n    - FOMC Member Bowman Speaks\n    - FOMC Member Clarida Speaks\n    - Factory Orders (consensus: 1.0%, previous: 1.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 54.3)\n    - Redbook (previous: 16.0%)\n    - Total Vehicle Sales (previous: 15.40M)\n\n^^^^2021-08-03",
        "created_utc": 1627984814,
        "id": "h7jaqb2",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1628013614.0
    },
    {
        "author": "jtmarlinintern",
        "body": "I am sure others have mentioned these already, no particular order\n\n&amp;#x200B;\n\nYou too can be a Stock market Genius - Joel Greenblatt\n\nCommon Stocks, Uncommon Profits - Phil Fischer\n\nMidas Touch - John Train\n\nZebra in Lion Country- Ralph Wanger\n\nOne Up on Wall Street- Peter Lynch\n\nNot a Value Book, but the Market Wizards and Also New Market Wizards are good reads about successful Traders and Managers i found enjoyable",
        "created_utc": 1627813690,
        "id": "h7asydr",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1627842490.0
    },
    {
        "author": "cuchiplancheo",
        "body": "&gt; The fuck is ZEBRA\n\nNo fucking clue. But, found more info: [ZEBRA stands for Zero Extrinsic Back Ratio, a term coined by Liz and Jenny in their TastyTrade show.](https://optionstradingiq.com/the-comprehensive-guide-to-the-zebra-strategy/)",
        "created_utc": 1628317203,
        "id": "h811bdj",
        "score": 1,
        "subreddit": "options",
        "created": 1628346003.0
    },
    {
        "author": "itachisasuked",
        "body": "A bit cautious don’t ever forget good house in Japan king loves music not only popcorn questions ready set talk under vet water yacht zebra.",
        "created_utc": 1627846268,
        "id": "h7chcaz",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1627875068.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  2nd of August\n\n\n\n## Upcoming events for Monday, August  2nd\n\n - Stock splits:\n\n    - GE @ **1:8**\n\n - Expected earnings:\n\n  ACHC, ADUS, AIV, ALX, AMRC, ANET, APPF, ARAV, ARCB, ARGO, ASLN, AWK, AWR, BCC, BRKR, BRX, BSBK, BSM, BVN, BWXT, CINR, CLAR, CLNN, CLR, CNA, COLM, CORR, CRNT, CSR, CSWC, CVI, CX, DAC, DBVT, DSPG, DZSI, EARN, EML, EMN, EVER, FANG, FNCB, FREY, FRPT, GAIA, GAIN, GOOD, GPN, GPP, GPRE, GSMG, HAYW, HLIT, HMN, HSBC, IMUX, IPI, ITUB, IVAC, JELD, KDNY, KMT, KNBE, KRG, L, LEG, LU, LUB, METC, MFIN, MG, MOS, NERV, NETI, NPK, NSP, NXPI, O, OGS, OHI, ON, OTTR, PBHC, PEBK, PLOW, PXD, RACE, RADA, RARE, REKR, REYN, RGCO, RIG, RMBL, RMBS, SANM, SBAC, SBT, SCM, SEDG, SFST, SGU, SIBN, SPG, SPNE, STRL, SYKE, TA, TCMD, TCPC, TGTX, TKR, TREX, TSEM, TTI, TTWO, UAN, UCTT, UIS, UNVR, USAU, UTI, VMD, VNO, VNOM, VRNS, VTVT, WILC, WMB, WMK, WWD, XTNT, ZI\n\n - Ex-div:\n\n  BANR, CAG, CAPL, CBAN, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, IGD, ITUB, LMRK, SAFM, SHLX, SPH, SRCE, SRLP, WBS, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.050%)\n    - 6-Month Bill Auction (previous: 0.050%)\n    - Construction Spending (consensus: 0.4%, previous: -0.3%)\n    - ISM Manufacturing Employment (previous: 49.9)\n    - ISM Manufacturing New Orders Index (previous: 66.0)\n    - ISM Manufacturing PMI (consensus: 60.9, previous: 60.6)\n    - ISM Manufacturing Prices (previous: 92.1)\n    - Investing.com Gold Index (actual: 58.5%, previous: 58.2%)\n    - Investing.com S&amp;P 500 Index (actual: 47.3%, previous: 42.2%)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 63.1, previous: 62.1)\n    - Total Vehicle Sales (previous: 15.40M)\n\n## Upcoming events for Tuesday, August  3rd\n\n - Expected earnings:\n\n  ACOR, ADCT, AENZ, AFG, AHH, AIZ, AJX, AKAM, ALNY, ALTO, AME, AMGN, ANDE, ANIX, APAM, APEN, APRN, APT, APTO, AQST, AQUA, ARC, ARNC, ARVN, ATEC, ATI, ATKR, ATOM, ATVI, AVID, AVNS, AY, AYX, BABA, BEN, BGFV, BHC, BHG, BKEP, BKH, BLD, BLKB, BNFT, BNL, BP, BRY, BXC, BYFC, CAR, CDEV, CDLX, CDXC, CECE, CEIX, CERS, CFBK, CGBD, CHCT, CHSCP, CIX, CLDT, CLSK, CLX, CMI, CNR, COHR, COP, COUR, CPE, CPSI, CPSS, CRD.A, CRD.B, CRIS, CRK, CRNC, CRSR, CRVL, CSLT, CTSO, CW, CWEN, CWEN.A, CWH, CZR, DCPH, DD, DEA, DEI, DENN, DISCA, DISCB, DISCK, DK, DKL, DNB, DS, DSKE, DSX, DVA, DVN, E, EC, EDU, ELVT, ENIA, ENLC, EPZM, ESPR, ET, ETN, ETRN, EVC, EVTC, EXPD, EZPW, FCNCA, FI, FICO, FIS, FMC, FNF, FNHC, FOE, FRG, FSP, FSTR, GBL, GBT, GDOT, GHL, GIC, GLDD, GLRE, GLT, GLTO, GMRE, GNW, GRBK, GTE, H, HEES, HEP, HLF, HLI, HLNE, HPP, HSC, HSIC, HSKA, HST, HY, HZN, IAA, ICFI, ICHR, IDN, IDRA, IGT, INCY, INFN, INGR, INN, INSP, INVE, IOSP, IPGP, IT, ITIC, IX, J, JAX, JAZZ, JBGS, KAI, KAR, KFRC, KKR, KLDO, KNSA, KOPN, KTOS, KWR, LCII, LDI, LDOS, LEU, LGIH, LHX, LIND, LLY, LPG, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, LYV, MANT, MAR, MCHP, MCRB, MCY, MDNA, MDXG, MEC, MGRC, MGY, MIC, MIME, MKL, MNOV, MNR, MNST, MNTX, MRCC, MRCY, MTCH, MTRN, MUFG, MYGN, NBIX, NCR, NCSM, NDLS, NE, NEWR, NKLA, NMIH, NNN, NPO, NPTN, NR, NRC, NSA, NVST, NVT, NVTA, OAS, OCFT, OCN, OI, OKE, OMI, OMP, ONCR, OPCH, OPTN, OSUR, OXY, PAA, PACB, PAGP, PAYC, PBI, PCRX, PEAK, PEG, PERI, PKOH, POWL, PRIM, PRO, PRU, PSA, PSB, PSX, PSXP, PTRS, PUMP, PVAC, QTS, QUAD, RCKY, RCM, RDN, RGA, RHP, RIBT, RIGL, RL, RM, RMRM, RNG, ROCK, RPAI, RRD, RVPH, RYAM, RYTM, SABR, SAGE, SEB, SEE, SHO, SKLZ, SKT, SKY, SKYT, SLRC, SND, SONY, SPT, SPWR, SQNS, SRC, SRNE, STAR, STIM, STLA, SUN, SUNS, SWI, TACT, TALO, TBPH, TCS, TDG, TISI, TNC, TRTX, TSLX, TSQ, TTEC, TX, UA, UAA, UBOH, UFPT, UNM, USAC, USCR, UTL, VAL, VECO, VERI, VNTR, VREX, VRSK, VVNT, WAT, WBT, WEC, WEYS, WHLR, WK, WLK, WLKP, WLTW, WMC, WMG, WRN, WSR, WTI, WTTR, WYNN, XFOR, XHR, XP, XPER, XYL, ZBH, ZBRA\n\n - Ex-div:\n\n  ATR, BBD, BBDO, BCBP, EIG, ETRN, HFWA, MKTX, NTIC, SHEN\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.000%)\n    - API Weekly Crude Oil Stock (previous: -4.728M)\n    - Durables Excluding Defense (previous: 1.0%)\n    - FOMC Member Bowman Speaks\n    - Factory Orders (consensus: 1.0%, previous: 1.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 54.3)\n    - Redbook (previous: 16.0%)\n\n## Upcoming events for Wednesday, August  4th\n\n - Expected earnings:\n\n  AAU, ABC, ABIO, AC, ACA, ACAD, ACEL, ACIU, ACLS, ACR, ADMA, ADPT, ADT, ADTN, AEIS, AERI, AFIN, AGL, ALB, ALE, ALG, ALIM, ALKT, ALL, ALLO, ALNA, ALRN, ALTM, AMED, AMOT, AMPE, AMPY, AMSC, ANGI, ANSS, ANVS, APA, APO, ARLO, ARNA, ARTNA, ASMB, ASTE, ASYS, ATO, ATRA, ATRC, ATTO, AVA, AXGN, BBSI, BCLI, BCOR, BCSF, BCYC, BDC, BDSI, BE, BFAM, BFIN, BGCP, BKNG, BKTI, BLPH, BLUE, BNGO, BOOT, BRSP, BTG, BWA, CAMT, CCMP, CCRN, CCU, CDAY, CDW, CENT, CENTA, CENX, CFMS, CHNG, CIA, CIB, CIGI, CIM, CKPT, CLH, CLLS, CLVS, CLW, CMLS, CMP, CPA, CPK, CPS, CRL, CRTO, CSGS, CSII, CSTE, CSWI, CUTR, CVGI, CVRX, CVS, CYAD, DAR, DCP, DFIN, DGII, DHC, DLHC, DMTK, DNOW, DOC, DOX, DRTT, DVAX, DXC, EA, ECPG, EDIT, EDRY, EGHT, ELF, EMKR, EMR, ENBL, EOG, EOLS, EQH, EQX, ERJ, ERO, ETR, ETSY, EVH, EVOP, EVRI, EXC, EXPI, EYPT, FATE, FCPT, FDP, FENC, FLMN, FLOW, FLT, FLXN, FOX, FOXA, FRGI, FRPH, FRT, FSLY, FTDR, FUN, FVE, GDDY, GEL, GGB, GHC, GLAD, GLBZ, GM, GMED, GNK, GPRK, GRP.U, GRTS, GTHX, HARP, HBB, HCC, HDSN, HFC, HHC, HI, HMC, HNGR, HR, HRTX, HUBS, HWM, HYMC, HZNP, IAC, IAG, ICD, ICUI, IIPR, IMXI, INGN, INMB, INSG, IO, IONS, ISEE, ISSC, IVC, IVR, JACK, JLL, JRVR, KBAL, KE, KHC, KIN, KLIC, KRO, KRTX, KUKE, KW, KZR, LAND, LESL, LEVL, LHCG, LILA, LILAK, LL, LMND, LMRK, LNC, LPI, LUMN, MAC, MASS, MAXR, MBI, MCK, MCS, MDCA, MDU, MED, MET, MFC, MGLN, MGM, MGPI, MIDD, MLR, MLVF, MNKD, MNRL, MNTV, MOD, MPC, MPLX, MRO, MTG, MTOR, MVIS, MWA, NC, NEPH, NESR, NEWT, NEX, NHTC, NI, NL, NMFC, NMR, NODK, NP, NSPR, NSTG, NTEC, NUS, NVRO, NWPX, NXST, NYT, OCDX, ODP, OESX, ONEM, OPRX, OR, ORA, ORCC, ORIC, OSPN, OTIC, OYST, PACE, PARR, PCSA, PDCE, PETQ, PFIE, PFLT, PING, PIRS, PLMR, PLTK, PLUS, PLYA, PNNT, PROF, PSN, PSNL, PTVE, PW, QNST, QRVO, QTWO, QUIK, RCII, RCKT, RCL, REGI, RESN, RGR, RKT, RMAX, RMNI, RNWK, ROKU, RPD, RPT, RTLR, RVI, RVLV, RYI, RYN, SAFT, SALM, SANA, SBGI, SBOW, SBRA, SCU, SD, SENEA, SENEB, SGMO, SGRY, SITE, SITM, SJI, SLCT, SLF, SLGL, SLNG, SMFG, SMG, SMP, SMSI, SPNS, SPR, SRDX, SRI, SRPT, SSRM, SSSS, STAA, STKL, STN, SUM, SUP, SUPN, SWM, TELL, TGB, TGI, TIPT, TLC, TNDM, TPC, TPVG, TRC, TREC, TRMB, TRNO, TS, TSE, TT, TTGT, TUP, TVTY, TWNK, TWO, TXG, TXMD, UBER, UE, UFCS, UFI, UGI, UHAL, UIHC, ULCC, UMH, UPLD, URG, URGN, USDP, USWS, UTHR, UVV, VCEL, VGR, VIRT, VMC, VRCA, VRDN, VTOL, VVV, VWTR, VZIO, WCN, WDC, WLFC, WLL, WTS, WU, XNCR, XPL, YELL, ZYME\n\n - Ex-div:\n\n  AWI, CATC, CCK, DKL, FELE, IBTX, IDA, KBH, MATX, NEP, NWBI, OFED, OPBK, SIMO, STBA, TGP, VBTX, VLO, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 700K, previous: 692K)\n    - Crude Oil Imports (previous: -0.616M)\n    - Crude Oil Inventories (previous: -4.089M)\n    - Cushing Crude Oil Inventories (previous: -1.268M)\n    - Distillate Fuel Production (previous: -0.163M)\n    - EIA Refinery Crude Runs  (previous: -0.132M)\n    - EIA Weekly Distillates Stocks (consensus: -0.435M, previous: -3.088M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.4%, previous: -0.3%)\n    - FOMC Member Clarida Speaks\n    - Gasoline Inventories (consensus: -0.916M, previous: -2.253M)\n    - Gasoline Production (previous: 0.649M)\n    - Heating Oil Stockpiles (previous: 0.108M)\n    - ISM Non-Manufacturing Business Activity (previous: 60.4)\n    - ISM Non-Manufacturing Employment (previous: 49.3)\n    - ISM Non-Manufacturing New Orders (previous: 62.1)\n    - ISM Non-Manufacturing PMI (consensus: 60.4, previous: 60.1)\n    - ISM Non-Manufacturing Prices (previous: 79.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.01%)\n    - MBA Mortgage Applications (previous: 5.7%)\n    - MBA Purchase Index (previous: 251.7)\n    - Markit Composite PMI (previous: 59.7)\n    - Mortgage Market Index (previous: 737.9)\n    - Mortgage Market Index (previous: 737.9)\n    - Mortgage Refinance Index (previous: 3,570.4)\n    - Services PMI (previous: 59.8)\n\n^^^^2021-08-02",
        "created_utc": 1627898416,
        "id": "h7evcd0",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1627927216.0
    },
    {
        "author": "ZeekLTK",
        "body": "Writing the same thing for every question is probably the best way to do it though (assuming it's a word/phrase that you will easily remember but no one else would think of).\n\nJust doing something like \"banana\" or \"zebra\" or whatever, then if anyone finds out any of your actual info they still won't be able to answer the security questions. \"What's your first pet's name?\" \"Pizza\" \"Mother's maiden name?\" \"Pizza\", \"Song from wedding?\" \"Pizza\". lol no one would ever \"guess\" that.",
        "created_utc": 1628275471,
        "id": "h7ytdqf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628304271.0
    },
    {
        "author": "PapaCharlie9",
        "body": "LOL. ZEBRA and PMCC are not *better* for new traders who wouldn't know a back ratio from a back stroke. Inherently, any multi-leg options trade is going to be more complicated than a single leg trade. Simplicity is good for beginners.",
        "created_utc": 1628348452,
        "id": "h828ond",
        "score": 1,
        "subreddit": "options",
        "created": 1628377252.0
    },
    {
        "author": "Gear_shifter",
        "body": "What the fuck is ZEBRA?",
        "created_utc": 1628317698,
        "id": "h811ysk",
        "score": 1,
        "subreddit": "options",
        "created": 1628346498.0
    },
    {
        "author": "Fox_Technicals",
        "body": "$ZBRA giddy up",
        "created_utc": 1628091414,
        "id": "h7osrbe",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628120214.0
    },
    {
        "author": "FreeAdministration34",
        "body": "I believe $PINS will be back to $75-$80 area, which is the area before last ER, very soon. Check the graph in May-June-July, it dropped to $54.5 and go over $80. Same thing is going to happen. I also put some side dishes, $AMAT, $MA, $ROKU.\r  \n\r  \n36500 shares of $PINS with avg cost of $57.18. Let we see our ride.",
        "created_utc": 1630524619,
        "id": "hb849y1",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1630553419.0
    },
    {
        "author": "dhpw2",
        "body": "**Main Portfolio:**  \nApple  \nMicrosoft  \nVisa  \nMastercard  \nFacebook  \nAlibaba  \nSquare  \nAMD  \n\n\n**Long shots/Play portfolio:**  \nPalantir  \nVirgin Galactic  \nGamestop  \nBlackberry  \nInvitae  \n\n\n**Looking to add in, in the future**  \nTaiwan Semiconductor  \nDisney  \nCostco  \nCoinbase  \nTesla  \nNvidia  \nJPMorgan  \nApplied Materials",
        "created_utc": 1630489444,
        "id": "hb62btv",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630518244.0
    },
    {
        "author": "captain_uranus",
        "body": "|Company|Ticker|% of Portfolio|\n:--|:--|:--|\n|Amazon|AMZN|7.34%|\n|ASML|ASML|7.00%|\n|DigitalOcean|DOCN|6.35%|\n|Paysafe|PSFE|5.95%|\n|Upstart|UPST|5.29%|\n|AMD|AMD|4.87%|\n|Cloudflare|NET|4.56%|\n|Square|SQ|4.50%|\n|Taiwan Semiconductor|TSM|4.50%|\n|Amkor Technology|AMKR|4.27%|\n|Apple|AAPL|4.18%|\n|Sofi|SOFI|4.17%|\n|MP Materials|MP|4.02%|\n|Palantir|PLTR|3.82%|\n|DraftKings|DKNG|3.61%|\n|Shopify|SHOP|3.20%|\n|Google|GOOG|3.06%|\n|Micron|MU|2.79%|\n|Chewy|CHWY|2.78%|\n|Thermo Fischer|TMO|2.33%|\n|Etsy|ETSY|2.27%|\n|Applied Materials|AMAT|1.99%|\n|AST Space Mobile|ASTS|1.53%|\n|Various Warrants|PSFE/WS, ALIT/WS, APPHW|1.41%|\n|Pinterest|PINS|1.40%|\n|Beam Therapeutics|BEAM|1.16%|\n|Nvidia|NVDA|0.86%|\n|Abbott|ABBT|0.78%|\n\nWould be curious to get some thoughts on my holdings.  \n\n\nJust going through it and typing everything out I never realized I'm up to 27 holdings nowadays, basically got an ETF on my hands. But on the other hand they're all spread out amongst 4 accounts (Brokerage, PCRA/Roth 401k, HSA Brokerage, and Roth IRA).  \n\n\nWould probably like to shed PINS and MU but will wait till maybe year end to re-evaluate. So far the only tickers I'm down on is my future growth stuff like SOFI, PSFE, MP (marginally), but I've got a 5+ year time horizon on these ones, and then PINS and MU round out the losers.",
        "created_utc": 1630502369,
        "id": "hb6mrcy",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630531169.0
    },
    {
        "author": "SofaKingStonked",
        "body": "Very familiar with Ichor and ultra clean and have respect for both companies. I personally went Amat and lrcx for my semi equipment plays a year ago but admittedly almost sold and rotated mid august into uctt which hindsight being 2020 I should have done lol",
        "created_utc": 1630535815,
        "id": "hb8ty1j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630564615.0
    },
    {
        "author": "SofaKingStonked",
        "body": "In order of expected returns;\n\nHimx - their qoq growth numbers look like some companies yoy numbers. They do various things but mostly known for display ic’s. (I want to mention micron in this same breath but momentum seems against it so I’m more aggressively pursuing himx)\n\nIndi - automotive infotainment asic semi company (also does other things but all automotive focused). Huge tier 1 backlog\n\nMrvl - my preferred 5G play\n\nAmd - I’m investing in cloud in multiple ways and see a lot of growth for Amd in server\n\nAmat - earlier in the year I would have had asml above Amat as my top semi equipment company but they’ve run really hard and fast ytd so I feel Amat is a better value with lrcx a close second.\n\nCree I like for their rf products and SiC wafer technology but my small position is not growing until they drop the led business officially.",
        "created_utc": 1631458994,
        "id": "hckisg9",
        "score": 11,
        "subreddit": "stocks",
        "created": 1631487794.0
    },
    {
        "author": "HTML_lovin",
        "body": "AMAT.",
        "created_utc": 1631256474,
        "id": "hca7w9v",
        "score": 10,
        "subreddit": "StockMarket",
        "created": 1631285274.0
    },
    {
        "author": "FreeAdministration34",
        "body": "I believe $PINS will be back to $75-$80 area, which is the area before last ER, very soon. Check the graph in May-June-July, it dropped to $54.5 and go over $80. Same thing is going to happen. I also put some side dishes, $AMAT, $MA, $ROKU.\r  \n\r  \n36500 shares of $PINS with avg cost of $57.18. Let we see our ride.",
        "created_utc": 1630524619,
        "id": "hb849y1",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1630553419.0
    },
    {
        "author": "buckster3257",
        "body": "I was invested in applied materials for a while but they seemed to have peaked in April and haven’t really done shit since then which is surprising considering how long this chip shortage has gone on for I would imagine their demand is through the roof",
        "created_utc": 1630952419,
        "id": "hbu49gy",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1630981219.0
    },
    {
        "author": "msnf",
        "body": "I agree a basket approach is a good idea here, but I don't want to pay 0.3-0 4% ER when I can track the industry close enough with a few individual stocks. Currently own:\n\nAMAT, AMD, ASML, LRCX, NVDA, MU, TSM as well as smaller players AMKR, ASX, UCTT with several others on my watchlist. Also, with the A-series and M-series chips AAPL is also a semiconductor company.",
        "created_utc": 1631278005,
        "id": "hcb0fka",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1631306805.0
    },
    {
        "author": "wildinterior",
        "body": "AMAT, LRCX",
        "created_utc": 1631443332,
        "id": "hcjr3lg",
        "score": 6,
        "subreddit": "stocks",
        "created": 1631472132.0
    },
    {
        "author": "balance007",
        "body": "KLAC- competitor to AMAT but much better\n\nAVGO- solid PE and dividend, great CEO\n\nQCOM- monopoly in 5g\n\nSWKS- picking up the scraps from QCOM\n\nSKYT- small cap foundry play could be big with bringing back semi production to USA",
        "created_utc": 1631477319,
        "id": "hcls716",
        "score": 6,
        "subreddit": "stocks",
        "created": 1631506119.0
    },
    {
        "author": "ClimbAndMaintain0116",
        "body": "ASML average over the last 5 years: 150% per year\nAMAT average over the last 5 years: 75% per year\nNVDA average over the last 5 years: 287%\n\nAMD average over the last 5 years: 340% per year\n\n\nLike I said…zoom out. You’re on the short sighted train.",
        "created_utc": 1631464077,
        "id": "hckuft4",
        "score": 5,
        "subreddit": "stocks",
        "created": 1631492877.0
    },
    {
        "author": "dhpw2",
        "body": "**Main Portfolio:**  \nApple  \nMicrosoft  \nVisa  \nMastercard  \nFacebook  \nAlibaba  \nSquare  \nAMD  \n\n\n**Long shots/Play portfolio:**  \nPalantir  \nVirgin Galactic  \nGamestop  \nBlackberry  \nInvitae  \n\n\n**Looking to add in, in the future**  \nTaiwan Semiconductor  \nDisney  \nCostco  \nCoinbase  \nTesla  \nNvidia  \nJPMorgan  \nApplied Materials",
        "created_utc": 1630489444,
        "id": "hb62btv",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630518244.0
    },
    {
        "author": "smokeyjay",
        "body": "I own LRCX.  Most recent added more at 600.  Sold off my TSM to consolidate my stock portfolio.\n\nI think AMAT &amp; KLAC are also good buys.  ASML is a good company but richly valued imo.\n\nHonestly a sector ETF might work for most ppl.  These are long term holds and not really WSB material.  I don't know how I feel about any positive short term trends - the whole world knows about chip shortages.",
        "created_utc": 1630687459,
        "id": "hbgrybc",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630716259.0
    },
    {
        "author": "puregoblinvomit",
        "body": "Yes! LRCX and AMAT have a huge growing business in their legacy 150nm and above semi equipment groups (what AMAT calls ICAPs) these are the chips that auto makers and tons of other companies are missing right now. The semi equipment makers will be the winners in the end as fabs and foundries are all localized around the globe!",
        "created_utc": 1631434642,
        "id": "hcjggxn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631463442.0
    },
    {
        "author": "apophisdagod",
        "body": "Can't go wrong with AMAT or LRCX they both make chip making machines along with touch screen machines etc. I work for a company that supplies both of them and we can't keep up with the orders. AMAT actually offered to buy the company to just make parts for them. So naturally I am in AMAT.",
        "created_utc": 1630690025,
        "id": "hbgy48u",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630718825.0
    },
    {
        "author": "tyrusrex",
        "body": "I've had etrade since my first job, since I was given a small stock vestmant for working with applied materials (Worth about $6k then about $13k now.)  it was through etrade that handled the stock, I've was mostly satisified but have become majorly dissatisfied.  They completely dropped the ball in giving me notifications.  I'm one of the GME/AMC cultists, and there were a few really important stock votes, which I was never notified about even after I complained and beg and pleaded that they notify me of upcoming votes.  They failed every time.  So as soon as I can, I plan to move to Fidelity or another brokerage,",
        "created_utc": 1631402062,
        "id": "hchtx6c",
        "score": 3,
        "subreddit": "stocks",
        "created": 1631430862.0
    },
    {
        "author": "SofaKingStonked",
        "body": "In order of expected returns;\n\nHimx - their qoq growth numbers look like some companies yoy numbers. They do various things but mostly known for display ic’s. (I want to mention micron in this same breath but momentum seems against it so I’m more aggressively pursuing himx)\n\nIndi - automotive infotainment asic semi company (also does other things but all automotive focused). Huge tier 1 backlog\n\nMrvl - my preferred 5G play\n\nAmd - I’m investing in cloud in multiple ways and see a lot of growth for Amd in server\n\nAmat - earlier in the year I would have had asml above Amat as my top semi equipment company but they’ve run really hard and fast ytd so I feel Amat is a better value with lrcx a close second.\n\nCree I like for their rf products and SiC wafer technology but my small position is not growing until they drop the led business officially.",
        "created_utc": 1631289247,
        "id": "hcbq6vg",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1631318047.0
    },
    {
        "author": "captain_uranus",
        "body": "|Company|Ticker|% of Portfolio|\n:--|:--|:--|\n|Amazon|AMZN|7.34%|\n|ASML|ASML|7.00%|\n|DigitalOcean|DOCN|6.35%|\n|Paysafe|PSFE|5.95%|\n|Upstart|UPST|5.29%|\n|AMD|AMD|4.87%|\n|Cloudflare|NET|4.56%|\n|Square|SQ|4.50%|\n|Taiwan Semiconductor|TSM|4.50%|\n|Amkor Technology|AMKR|4.27%|\n|Apple|AAPL|4.18%|\n|Sofi|SOFI|4.17%|\n|MP Materials|MP|4.02%|\n|Palantir|PLTR|3.82%|\n|DraftKings|DKNG|3.61%|\n|Shopify|SHOP|3.20%|\n|Google|GOOG|3.06%|\n|Micron|MU|2.79%|\n|Chewy|CHWY|2.78%|\n|Thermo Fischer|TMO|2.33%|\n|Etsy|ETSY|2.27%|\n|Applied Materials|AMAT|1.99%|\n|AST Space Mobile|ASTS|1.53%|\n|Various Warrants|PSFE/WS, ALIT/WS, APPHW|1.41%|\n|Pinterest|PINS|1.40%|\n|Beam Therapeutics|BEAM|1.16%|\n|Nvidia|NVDA|0.86%|\n|Abbott|ABBT|0.78%|\n\nWould be curious to get some thoughts on my holdings.  \n\n\nJust going through it and typing everything out I never realized I'm up to 27 holdings nowadays, basically got an ETF on my hands. But on the other hand they're all spread out amongst 4 accounts (Brokerage, PCRA/Roth 401k, HSA Brokerage, and Roth IRA).  \n\n\nWould probably like to shed PINS and MU but will wait till maybe year end to re-evaluate. So far the only tickers I'm down on is my future growth stuff like SOFI, PSFE, MP (marginally), but I've got a 5+ year time horizon on these ones, and then PINS and MU round out the losers.",
        "created_utc": 1630502369,
        "id": "hb6mrcy",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630531169.0
    },
    {
        "author": "Arok79",
        "body": "$AAPL finally broke out of its base.  Looking for a nice run in this play.  $AMAT is also another one I am in and adding calls on weakness.",
        "created_utc": 1630679175,
        "id": "hbg7ytn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630707975.0
    },
    {
        "author": "mist3rcoolpants",
        "body": "TSM, MSFT, GOOGL, AMAT, BRK.B, SHOP, JPM. I sleep very well with this portfolio",
        "created_utc": 1630762905,
        "id": "hbkfv5l",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630791705.0
    },
    {
        "author": "MovieMuscle25",
        "body": "And NVDA is up 71.40% in the last year, ASML up 71.77% the last year, AMAT up 57.52%.",
        "created_utc": 1631463073,
        "id": "hcks2v7",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631491873.0
    },
    {
        "author": "BurningOrangeHeaven",
        "body": "AMAT is 125b market cap and should be in here.",
        "created_utc": 1631273697,
        "id": "hcasv9v",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1631302497.0
    },
    {
        "author": "cptbrainbug",
        "body": "Somebody said all in AMAT?",
        "created_utc": 1631181518,
        "id": "hc5x2yv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631210318.0
    },
    {
        "author": "Dry_Dog_698",
        "body": "Started in April.  Have an stocks account up 24% and ETF account up 7%.\n\nThe stocks account was down by mid July made big losses on meme stocks(clov, clne, bb, mmed, ride, few other turds).\n\nCurrently I’m about 1/3 steel(+15ish%), 1/3 shipping(+60ish%), and 1/3 other assorted(cnr, net, panw, amat).\n\nAlthough stocks are boring, up around 100% on shipping options and down around 75% on steel and meme options.",
        "created_utc": 1631395830,
        "id": "hchf6uv",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1631424630.0
    },
    {
        "author": "Darzee2244",
        "body": "They're all pretty appealing tbh. But from that list, I'd say AMAT and AMD seem like good bets.",
        "created_utc": 1631514396,
        "id": "hcnuqto",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631543196.0
    },
    {
        "author": "phatpussykhat",
        "body": "I am heavy invested in AMD and see as long term hold. Have some Nividia, think it is best in class and will be adding more soon. QCOM troubles me and will be looking to unload shares near future. Amat looks promising.",
        "created_utc": 1631269117,
        "id": "hcamhod",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1631297917.0
    },
    {
        "author": "TrumpFamilySyndicate",
        "body": "anyone thinking AMAT is going to test $145?",
        "created_utc": 1631550401,
        "id": "hcph8xw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631579201.0
    },
    {
        "author": "SofaKingStonked",
        "body": "Very familiar with Ichor and ultra clean and have respect for both companies. I personally went Amat and lrcx for my semi equipment plays a year ago but admittedly almost sold and rotated mid august into uctt which hindsight being 2020 I should have done lol",
        "created_utc": 1630535815,
        "id": "hb8ty1j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630564615.0
    },
    {
        "author": "t33po",
        "body": "AMAT",
        "created_utc": 1631412588,
        "id": "hcig649",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631441388.0
    },
    {
        "author": "Ok_Relationship3096",
        "body": "Buy the SMH, semis rotate depending on need and innovation. LRCX,NVDA,AMD,AMAT. There are just too many to pick one. Amat makes the tools to manufacture as so others buy the SMH and cover all your bases.",
        "created_utc": 1631292009,
        "id": "hcbx31n",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1631320809.0
    },
    {
        "author": "thePebble13",
        "body": "My biggest holdings are SOFI in leap calls and AMAT in shares",
        "created_utc": 1631215603,
        "id": "hc7uzhs",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631244403.0
    }
]