[
    {
        "author": "Im_A_MechanicalMan",
        "body": "Hindsight can really kick your hind if you let it!\n\n&amp;#x200B;\n\nIf I had bought Amazon in 1999.\n\nIf I had bought Netflix a decade later.\n\nIf I had bought the gamestore at 4 dollars and sold at 480 dollars.  Then rebought at 50 dollars and sold at 250 dollars.\n\nIf I had bought AMD when it was 10 dollars.\n\nIf I had etc...\n\nBut I didnt, because it didn't make sense to me at the time.  It was a large risk in all these situations and I didn't have enough information to convince me otherwise.\n\nA thousand other things cratered that I could have bought into that I didn't.  But it is easier to focus, after the fact, on the few successful trades that would have worked out.",
        "created_utc": 1636403944,
        "id": "hjuk54r",
        "score": 603,
        "subreddit": "wallstreetbets",
        "created": 1636432744.0
    },
    {
        "author": "RajivChaudrii",
        "body": "It’s all about growth.  NVDA rev growth yoy ~55%, AMD rev growth yoy 65%.  Both are accelerating in high margin products.  Intel yoy rev growth -1%, with margins trending down.",
        "created_utc": 1637255963,
        "id": "hl55pxp",
        "score": 398,
        "subreddit": "stocks",
        "created": 1637284763.0
    },
    {
        "author": "djent_illini",
        "body": "I feel dumb buying at $45 then selling at $56. My coworker has been holding since $6!!! Glad AMD took off.",
        "created_utc": 1636392352,
        "id": "hjtrdcj",
        "score": 360,
        "subreddit": "stocks",
        "created": 1636421152.0
    },
    {
        "author": "SHAMUUUUUUU",
        "body": "NVDA and AMD have helped more students pay off  their debt than the federal government at this point",
        "created_utc": 1637361915,
        "id": "hlbe2ja",
        "score": 307,
        "subreddit": "wallstreetbets",
        "created": 1637390715.0
    },
    {
        "author": "FAQUA",
        "body": "I had bought AMD at $28 per share, I sold at like $40ish I thought I was so fucking smart lol!",
        "created_utc": 1636819941,
        "id": "hkgx6oy",
        "score": 265,
        "subreddit": "wallstreetbets",
        "created": 1636848741.0
    },
    {
        "author": "CoolHandHazard",
        "body": "Kinda sad I sold Friday at 139. Was thinking maybe it’d dip and I could buy back in later. AMD is a monster",
        "created_utc": 1636389781,
        "id": "hjtkuhg",
        "score": 234,
        "subreddit": "stocks",
        "created": 1636418581.0
    },
    {
        "author": "redlux03",
        "body": "Nvidia and AMD will probably bounce back fast again.",
        "created_utc": 1637919483,
        "id": "hm50bzl",
        "score": 194,
        "subreddit": "stocks",
        "created": 1637948283.0
    },
    {
        "author": "ktempo",
        "body": "VTI! I only got NVDA and AMD because of how obsessed I am with computers, and when I built my first computer back in 2015 I learned about NVDA + AMD and just how powerful / great they could be. Other than NVDA, only MSFT and AAPL are the only other singular stocks I own. For now, at least.",
        "created_utc": 1637185259,
        "id": "hl1gtrl",
        "score": 179,
        "subreddit": "stocks",
        "created": 1637214059.0
    },
    {
        "author": "BannerlordAdmirer",
        "body": "Intel under Paul Otellini is the ur-example of this. He focused completely on shutting down AMD for a good part of a decade, but completely missed the boat on the smartphone.",
        "created_utc": 1635998120,
        "id": "hj8qery",
        "score": 153,
        "subreddit": "stocks",
        "created": 1636026920.0
    },
    {
        "author": "No_Inspection649",
        "body": "LOL.  I sold my AMD calls an hour ago.",
        "created_utc": 1636389154,
        "id": "hjtj9ja",
        "score": 145,
        "subreddit": "wallstreetbets",
        "created": 1636417954.0
    },
    {
        "author": "r2002",
        "body": "**$IonQ**: High risk high reward\n\n* Might be like buying AMD at $20.\n* In NVDA's investor presentation this name popped up as one of the partners they're working with to calibrate Quantum Computing simulations. It was just a blip on the presentation deck, but then I've been seeing Redditors mentioning this stock so it's definitely intriguing play into Quantum.\n\n\n\n**$Qualcomm**: Low risk medium reward.\n\n* Their diversification plans seem pretty solid. Only 23 pe ratio and paying out 1.43 dividend. \n* Own lots of patents. Even if they don't make the chip they still get paid.",
        "created_utc": 1637394761,
        "id": "hld3e08",
        "score": 136,
        "subreddit": "stocks",
        "created": 1637423561.0
    },
    {
        "author": "synachromous",
        "body": "Hahha THIS is EXACTLY why I bought into AMD a while ago. Building computers I always loved AMD. Cause they were badass and cheaper. So when I got older and it was time to invest. No hesitation I bought a bunch of AMD. I did it because I like them. I held it because I believe in them.",
        "created_utc": 1636605034,
        "id": "hk5xrsh",
        "score": 130,
        "subreddit": "stocks",
        "created": 1636633834.0
    },
    {
        "author": "r2002",
        "body": "Netflix is something you can do without.\n\nAMD and NVIDIA design products for everything in your daily life.\n\nI like NVIDIA best because it is also going into software.",
        "created_utc": 1637248896,
        "id": "hl4nyn6",
        "score": 127,
        "subreddit": "stocks",
        "created": 1637277696.0
    },
    {
        "author": "cdmaloney1",
        "body": "$11.86 yes. I discovered AMD on this subreddit way back in the day....way before it was as mainstream as it is now. \n\n&amp;#x200B;\n\nBack then it was a lot easier to find the good stuff on here.",
        "created_utc": 1635969933,
        "id": "hj6xyv1",
        "score": 110,
        "subreddit": "wallstreetbets",
        "created": 1635998733.0
    },
    {
        "author": "just_jay88",
        "body": "sold off one of my ITM tesla leaps at 200% gain to purchase 4 OTM amd leaps. they are now ITM. it's been a good day.",
        "created_utc": 1636389218,
        "id": "hjtjfbw",
        "score": 107,
        "subreddit": "wallstreetbets",
        "created": 1636418018.0
    },
    {
        "author": "Terbmagic",
        "body": "You are following my exact portfolio.\n\nI have a mix of\n\n 20% nvidia\n\n20% amd\n\n10% Microsoft \n\n10% apple\n\n40% VOO\n\nI've been adding every month for the past 5 years.",
        "created_utc": 1637187574,
        "id": "hl1meic",
        "score": 98,
        "subreddit": "stocks",
        "created": 1637216374.0
    },
    {
        "author": "UWG-Grad_Student",
        "body": "Nvidia isn't worried about intel because intel isn't trying to take on the GPU space the same way AMD does. intel wants discrete graphics first then low power consumption stuff mostly for laptops. They won't get any real market share in server or dedicated graphics for a long time. NVDA is still a great buy n hold stock, but if you own it get AMD too. That way, when one falls, the other rises.",
        "created_utc": 1637927234,
        "id": "hm597qx",
        "score": 92,
        "subreddit": "stocks",
        "created": 1637956034.0
    },
    {
        "author": "dmitsuki",
        "body": "Well, the fact that you even had 400k shares of AMD means you were already a millionaire most likely, and now you just aren't a...mega millionaire.",
        "created_utc": 1636391013,
        "id": "hjtnzmi",
        "score": 90,
        "subreddit": "wallstreetbets",
        "created": 1636419813.0
    },
    {
        "author": "sweYoda",
        "body": "Or perhaps we think more long term. AMD is a great company, just like Intel, but I just think the valuation is too high. Just like Intel has had mistakes and some stagnation I think AMD will eventually stagnate a bit, while I do believe Intels new fabs, products and their foundry business will be pretty solid in 2025.",
        "created_utc": 1637276632,
        "id": "hl6lho6",
        "score": 88,
        "subreddit": "stocks",
        "created": 1637305432.0
    },
    {
        "author": "FreeEuropeYouCunts",
        "body": "Remember when according to many people AMD was \"way too overvalued\" at $115 and INTC was teh epic value play. Lmao",
        "created_utc": 1636390178,
        "id": "hjtlv18",
        "score": 82,
        "subreddit": "stocks",
        "created": 1636418978.0
    },
    {
        "author": "Data_Dealer",
        "body": "No the pop was from Instinct MI200 and the rest of the info this morning.  AMD firing on all cylinders in both CPU and GPU in data center now.",
        "created_utc": 1636393373,
        "id": "hjtty5d",
        "score": 82,
        "subreddit": "stocks",
        "created": 1636422173.0
    },
    {
        "author": "sethanthrowaway",
        "body": "first off it’s AMD, bitch doesn’t need news to move. second, majority of traders and investors were not around today and it moved a lot off light buying volume. just how the market works. everything goes up and goes down.",
        "created_utc": 1637811603,
        "id": "hlzp5q9",
        "score": 78,
        "subreddit": "StockMarket",
        "created": 1637840403.0
    },
    {
        "author": "officialbigrob",
        "body": "I used to have so much conviction in AMD but I paper handed at like 90 bucks a share",
        "created_utc": 1636389316,
        "id": "hjtjnvt",
        "score": 75,
        "subreddit": "wallstreetbets",
        "created": 1636418116.0
    },
    {
        "author": "Mugs_game",
        "body": "I had 32000 shares of AMD at 1.93.  I sold because it never moved.  Ever.  \n\nI have sold early so many times because I lost patience.",
        "created_utc": 1636562147,
        "id": "hk33adu",
        "score": 75,
        "subreddit": "stocks",
        "created": 1636590947.0
    },
    {
        "author": "esqualatch12",
        "body": "My take on stock investing in general is it really works in levels. You do not touch the higher levels of investing until you have a firm understanding and success at the lower. \nThe lowest level is ETF investing, easy to learn easy to toss money at and make returns. Also builds a strong base to work from\n\n The 2nd is individual stock, once you really learned to analyze investment data. You can also work on the emotional side of your investments in this area like not panicking during a selloff or becoming to elated in your gains not to sell.\n\nThe 3rd level is learning the various trading options such as limits, stop losses and margins. Really it can be bundled into the 2nd BUT these things are generally more important for traders rather Investors.\n\nFinally we get to options, if you don't have a firm grasp and decent experience with the above then you need to stay the hell away from options. They are the ultimate trap to newbie investors who see dipshits on WSB gambling away there entire savings. HOWEVER, a reasonable experienced investor whom can make sound decisions in there investments in the previous level can  infact benefit from limited option trading (can never recommend an all in). \n\nI for one am sitting on some delicious AMD 87.5 leap calls that don't expire til next June. I felt they were a reasonable investment as the XLNX merger was already know.",
        "created_utc": 1636682199,
        "id": "hka2zvj",
        "score": 74,
        "subreddit": "stocks",
        "created": 1636710999.0
    },
    {
        "author": "soAsian",
        "body": "1. x86 - AMD is now a fabless. all their resources goes to design\n\n2. foundry - Can Intel catch up with TSMC and Samsung? TSMC have 50% of the market share. its a pure play foundry with no conflict of interest unlike Intel. all TSMC's resources goes to foundry\n\n3. alternative chip - Apple shown us ARM is viable alternative to Intel's x86. AWS, Google and Alibaba is all in on design their own chip. \n\n\nCan Intel catch up?",
        "created_utc": 1635795519,
        "id": "hix63tc",
        "score": 71,
        "subreddit": "investing",
        "created": 1635824319.0
    },
    {
        "author": "hendo144",
        "body": "Just buy all three. I spent like 10k ea on amd and nvda in early october. Currently 55% up.",
        "created_utc": 1637247554,
        "id": "hl4ksme",
        "score": 70,
        "subreddit": "stocks",
        "created": 1637276354.0
    },
    {
        "author": "VeryUnscientific",
        "body": "AMD hasn't even dipped",
        "created_utc": 1637933870,
        "id": "hm5iq1a",
        "score": 69,
        "subreddit": "stocks",
        "created": 1637962670.0
    },
    {
        "author": "ForestFyre",
        "body": "NVDA AMD both swinging their big semiconductor cocks around this morning",
        "created_utc": 1636460642,
        "id": "hjxeqih",
        "score": 67,
        "subreddit": "wallstreetbets",
        "created": 1636489442.0
    },
    {
        "author": "sandwichsandwich69",
        "body": "did the exact same thing with AMD \n\nliterally held it for a two years and sold it just before last weeks ralley",
        "created_utc": 1637172903,
        "id": "hl0lx9i",
        "score": 65,
        "subreddit": "smallstreetbets",
        "created": 1637201703.0
    },
    {
        "author": "bearhunter429",
        "body": "Just fucking delist everything besides FAANG + MSFT + TSLA + NVDA + AMD already.",
        "created_utc": 1637269404,
        "id": "hl63xfn",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1637298204.0
    },
    {
        "author": "itsalliefersure",
        "body": "I got into doge and Bitcoin before the rallies, Nvidia, AMD, a bunch of solar and EV (Fcel, plug , GEVO, run), and recently I rode the Ocugen rally, still going on that one but might sell the news tomorrow not sure.",
        "created_utc": 1635869939,
        "id": "hj0zrqp",
        "score": 64,
        "subreddit": "StockMarket",
        "created": 1635898739.0
    },
    {
        "author": "zeebee098",
        "body": "That’s pretty retarded but…AMD",
        "created_utc": 1636158811,
        "id": "hjhnt6k",
        "score": 62,
        "subreddit": "wallstreetbets",
        "created": 1636187611.0
    },
    {
        "author": "werewere223",
        "body": "No, AMD is a great buy. They got a super bullish short term outlook. Merger with XLNX by the end of the year (Which is gonna hurt cash flow in the short-term, but long term it helps diversify cash flow), they got choosen by Meta to make their chips. All of this is bullish news and reason to buy AMD.",
        "created_utc": 1637603267,
        "id": "hlnw1y6",
        "score": 62,
        "subreddit": "stocks",
        "created": 1637632067.0
    },
    {
        "author": "ZiggyMan15",
        "body": "Im long on some AMD calls because I think the House of Rep will pass the CHIPS bill soon (hopefully) that gives 57 billion in funding to semis.",
        "created_utc": 1637920946,
        "id": "hm520qc",
        "score": 58,
        "subreddit": "options",
        "created": 1637949746.0
    },
    {
        "author": "A_Wizard1717",
        "body": "all in AMD imo",
        "created_utc": 1635766793,
        "id": "hivg26w",
        "score": 58,
        "subreddit": "investing",
        "created": 1635795593.0
    },
    {
        "author": "drmcbrayer",
        "body": "You realize nvidia and amd have both said they’re producing their planned quantities of SKUs but demand eclipsed their forecasts due to stay at home orders and such, right? TSMC just can’t keep up. They’re still reporting higher and higher revenue every quarter",
        "created_utc": 1637250105,
        "id": "hl4qx6i",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1637278905.0
    },
    {
        "author": "SnipahShot",
        "body": "I think you might not know the difference between insiders and institutions. Insiders are officers and directors of the companies. Institutions are hedge funds.\n\nRetail investors probably don't have the money to keep it going up, but hedges do.\n\nIt isn't that hard to check what he is saying about insiders selling. Insider selling means that they believe the current price is too high for their company, otherwise they would have kept the stocks.\n\nLook at a few companies and their insider activity -\n\nTesla: 10 shares were bought in the last 12 months. Almost 9.2mil shares sold in that time.\n\nAMD: 0 shares were bought in the last 12 months. Almost 3mil shares sold in that time.\n\nNvidia: 206k shares were bought in the last 12 months. Almost 1.5mil shares sold in that time.\n\nModerna: 0 shares were bought in the last 12 months. 13.6mil shares were sold in that time.\n\n&amp;#x200B;\n\nNow let's look at companies whose value didn't spike.\n\nAnalog Devices: 840k shares were bought in the last 12 months. 310k shares were sold in that time.\n\nIntel: 430k shares were bought in the last 12 months. 250k were sold in that time.\n\nNorwegian Cruise: 480k shares were bought in the last 12 months. 370k shares were sold in the last 3 months.\n\n&amp;#x200B;\n\nIt does not indicate whether the market will crash, but it indicates what insiders think of the valuation of the company they are part of.",
        "created_utc": 1637250704,
        "id": "hl4sf0s",
        "score": 58,
        "subreddit": "StockMarket",
        "created": 1637279504.0
    },
    {
        "author": "KingDongSixtyNine",
        "body": "Go half-half with NVDA and AMD. That way you won't kick yourself when one of them smashes it out of the park. AMD is better priced but is competing with Intel on CPU's. NVDA basically controls 90% of the GPU market, and this market will only grow because of the rise of AR/VR/Metaverse.",
        "created_utc": 1637253276,
        "id": "hl4yv5m",
        "score": 58,
        "subreddit": "stocks",
        "created": 1637282076.0
    },
    {
        "author": "pa1reddit",
        "body": "AMD to $200 🚀🚀",
        "created_utc": 1636390307,
        "id": "hjtm70v",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1636419107.0
    },
    {
        "author": "Fedorathesexplorer",
        "body": "I’ll make sure to buy AMD at its peak so I lose a lot of money.",
        "created_utc": 1636467375,
        "id": "hjxracj",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1636496175.0
    },
    {
        "author": "kevbot029",
        "body": "Nice!  Gratz.  I did the same thing with AMD over the last 6-8 months.. 2k to 32k.  Pretty much have it all sitting in LEAPS now so I don’t lose it on any risky bets.  Still play with a few k on short term plays, but it’s all about managing risk.  Cheers",
        "created_utc": 1637361803,
        "id": "hlbdsvm",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1637390603.0
    },
    {
        "author": "BeardlessPete",
        "body": "Secured puts can be used to enter a position. Let's say you want to go long AMD and it's at 150 you can sell a secured put for a strike of 149. If you get assigned then 1 you are entering in on the trade at a discount and 2 you're getting a small premium. \n\nIt's actually kind of cool because you get paid for entering a long trade. Ideally, if you're a long term investor and you're going to hold for many years, then entering trades with secured puts is a good idea because you'll always enter your positions below highs and you'll take a premium for doing so that you can use to buy more of the shares. You'll only get enough premium to get maybe 1 extra share if you sell a weekly CC, but if it's a stock like AMD that 1 share can do a lot of work.\n\nAnother thing is a lot of people will do the wheel by entering with CSP, but I'm not really a fan of that. You have to enter and exit every once in a while, and I feel like just holding for the long term is the best play.",
        "created_utc": 1637092179,
        "id": "hkw67et",
        "score": 55,
        "subreddit": "options",
        "created": 1637120979.0
    },
    {
        "author": "BiGGAYCAREBEAR",
        "body": "The market we live in goes like this,\n\nRumors NVDA is getting metaverse deal pumps like 20%, but AMD gets it instead, so that pumps 20% NVDA still pumps some more so why not.\n\n\nRumor about PINS getting bought out by PYPL, 3 days later LOLOLOLJKJKJK.\n\nTSLA and HRTZ we have a deal we don’t have a deal, meanwhile HRTZ can’t afford bikes let alone cars, but they’ll take 100,000 Tesla’s for full retail. Fuck it pump both 30%\n\nA 26 Billion Twitter poll?\n\nThis market is a fucking troll.",
        "created_utc": 1636424969,
        "id": "hjvwxqa",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1636453769.0
    },
    {
        "author": "oarabbus",
        "body": "AMD was \"too high\" at $15, and $30, and $50, and $75, and $100...",
        "created_utc": 1637611402,
        "id": "hloghep",
        "score": 53,
        "subreddit": "stocks",
        "created": 1637640202.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/Cautious-Virus-2724 (1/1) made a bet that AMD would go to 155.0 when it was 147.34 and it did, congrats you fuckin nerd.",
        "created_utc": 1637239493,
        "id": "hl44dpf",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1637268293.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "body": "AMD is not a manufacturer. They hire companies such as TSMC to make their chips for them.\n\nMuch of this funding plus possibly more in the future, seems likely to go to Intel (INTC).\n\nI dont think the US gov is interested in paying foreign companies to build in the US since it wont really help the US to be independent. eg. TSMC only builds factories for their inferior products outside of Taiwan since they are worried about their tech getting stolen in other locations.",
        "created_utc": 1636667772,
        "id": "hk97yg0",
        "score": 52,
        "subreddit": "stocks",
        "created": 1636696572.0
    },
    {
        "author": "FrenchCuirassier",
        "body": "Stop calling it crypto... Just call it ***PrimeNumberRaffleTickets (PNRT)***\n\nBy doing so, the stupid people can finally understand math and stop bothering the cryptographers to ask them \"should I invest in crypto dawg?\"\n\n\"b-b-but I bought all these nvidia and Amd graphics cards and rack servers with my mom's credit card, hope she doesn't check the energy bill... are you sure it's not the greatest thing since sliced bread?\"",
        "created_utc": 1636827631,
        "id": "hkhf78y",
        "score": 51,
        "subreddit": "investing",
        "created": 1636856431.0
    },
    {
        "author": "masteryyi",
        "body": "my stock experience so far\n\n\"wow it's at all time high, it's too risky to buy here\" -&gt; keeps going up anyways\n\nexamples: nvda, amd, tsla, goog\n\n\n\"wow this stock is down so much, it's a steal at this price\" -&gt; keeps going down\n\nexamples: tsm, amzn, pypl, dis\n\n\nnever lucky",
        "created_utc": 1636040298,
        "id": "hjal49a",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1636069098.0
    },
    {
        "author": "Hijacks",
        "body": "1. Buy leaps when AMD's stock price is at $90, for $0.98 a contract.  \n2. Watch AMD moon to $150\n3. ???\n4. Profit",
        "created_utc": 1636415608,
        "id": "hjvcap0",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1636444408.0
    },
    {
        "author": "ktempo",
        "body": "I sold my AMD back in the 30's and 40's and that's something I regret everyday lol. But it helps that I got in at around $4-5 so even though I sold so early, I still made money. Green is green as they say! That's part of what makes me hold NVDA so tightly, just the fact that this sector has so much potential that selling early can lead to regret very fast.",
        "created_utc": 1637188346,
        "id": "hl1o8lk",
        "score": 49,
        "subreddit": "stocks",
        "created": 1637217146.0
    },
    {
        "author": "paulc19802",
        "body": "Still plenty of market share left to take from Intel. Trending up strongly. Already overtaking in the desktop space. \n\nThey might even make a good GPU next year as they're beating Nvidia to the MCM game. \n\nI'm yet to add semiconductors long term to my portfolio. But to be honest it's such a cornered market I intend to just split my investment evenly between AMD, Intel and Nvidia when I eventually do. Basically a small semiconductor ETF of my own that automatically hedges itself because it contains all the competitors.",
        "created_utc": 1637519362,
        "id": "hljeixc",
        "score": 49,
        "subreddit": "stocks",
        "created": 1637548162.0
    },
    {
        "author": "Khatib22",
        "body": "Just wanted to share my experience too. I fully agree - after seeing all the gains on this sub from FDs (weeklies) it's kind of hard not to feel like \"F it, I wanna make some money too\" and YOLO your money in - VERY BAD DECISION. It would be hard for me to pay attention at work and school since my mind would just be focused on trying to chase gains and praying that my portfolio wouldn't be red. Then, I eventually lost like $4k in total. It was initially hard to stomach the loss but I had to just accept it as a learning lesson. \n\nI also just wanted to say I fully agree with you on the LEAPS in safe companies. 80% of my portfolio is stocks and 20% LEAPS. LEAPS are great ways to control more of a stock with less money and I make sure to only buy LEAPS on great fundamental companies (NVDA and AMD) but am planning to buy some SPY GOOGL and MSFT LEAPS that you mentioned as well.\n\nI just want to say that I actually sleep better now and my quality of life is MUCH better. I realized I just couldn't handle the stress of 90%+ swings in my portfolio without being glued to it or worrying \"IS IT TIME TO SELL?\" LEAPS and shares remove all of that because they don't really have an \"expiration.\" Shares are unlimited and LEAPS are like 2-3 years out so there's no rush to feel like: THE STOCK HAS TO RALLY 20% in a day, all you have to do is choose companies you have high conviction in and let them naturally make their way up.",
        "created_utc": 1636154484,
        "id": "hjhds40",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1636183284.0
    },
    {
        "author": "newnoisenetwork",
        "body": "NVDA had earnings in ‘15 and I saw it was an A-plus company, watched it climb from $19 to $30 and bought in. Only wish I had Jamie Dimon access to low-interest cash to have bought more. \n\nAMD was shakier, way back when, was $45, fell all the way to below $2, peps bought on the rumor it would be acquired. Then Lisa Su did her magic, and I bought in, but didn’t have the same conviction. I should have held esp after it climbed to $13 when it was added to the S&amp;P 500 index. &lt;~~~ that is a tell-tale sign to buy in.\n\nI hold the same conviction about MSFT and AAPL, both are trillion dollar co today. I can see CRSP being the future though it might require a more equal, robust society that could afford the tech in the first place. Too many financial terrorists keeping interest rates below zero for any price discovery or real growth to occur.",
        "created_utc": 1636603700,
        "id": "hk5v6xa",
        "score": 47,
        "subreddit": "stocks",
        "created": 1636632500.0
    },
    {
        "author": "doplitech",
        "body": "AMD hasn’t even begun to peak",
        "created_utc": 1637945679,
        "id": "hm66r4b",
        "score": 46,
        "subreddit": "stocks",
        "created": 1637974479.0
    },
    {
        "author": "SnipahShot",
        "body": "It is cheaper and faster to have an external company do it.\n\nEven companies that their entire business relies on chips like AMD and Nvidia don't create any chips but only design them.\n\nCar companies would suffer a lot less from TSMC issues than AMD and Nvidia, due to the fact that car chip designs are a decade old.",
        "created_utc": 1636669149,
        "id": "hk9b763",
        "score": 45,
        "subreddit": "stocks",
        "created": 1636697949.0
    },
    {
        "author": "QuantumIdeal",
        "body": "God this hurt me in my portfolio. I'm not down, but I'm not up either so I'm still stickin to my story. But I'm happy for everyone else making money. Let's hope it lasts...\n\nEdit: part of my portfolio is making some money (TSLA, AMD) but it's a smaller part",
        "created_utc": 1636130284,
        "id": "hjfmzv3",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1636159084.0
    },
    {
        "author": "JGlasken",
        "body": "Held a few hundred shares of AMD when they were down around $4. I bought them because I thought they might have some ground to gain after the whole bulldozer debacle. Unfortunately not a lot of DD, just knew they had a hit with the 64, and hoped they would hit it out of the park again, and be out in front albeit briefly. All gains are good gains. But…\n\nI sold at $18. \n\n…\n\nYeah.",
        "created_utc": 1636601639,
        "id": "hk5qz8x",
        "score": 44,
        "subreddit": "stocks",
        "created": 1636630439.0
    },
    {
        "author": "Euler007",
        "body": "Yup. Anyone blasting INTC usually has a post about AMD not far down their posting history.",
        "created_utc": 1636910071,
        "id": "hklwp4l",
        "score": 44,
        "subreddit": "stocks",
        "created": 1636938871.0
    },
    {
        "author": "b_fellow",
        "body": "NVDA mooning (with AMD not far behind) and people are still thinking of buying BABA and CLOV dips lol",
        "created_utc": 1637241085,
        "id": "hl4798n",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1637269885.0
    },
    {
        "author": "uselessadjective",
        "body": "Holding 5000 shares @ $25 avg. AMD is just getting started. Now people have started taking AMD seriously.\n\nThe way I see it NVDA will be over $700 in next 2 yra and AMD over $300 easily.",
        "created_utc": 1637538708,
        "id": "hlkpe2p",
        "score": 43,
        "subreddit": "stocks",
        "created": 1637567508.0
    },
    {
        "author": "fishheadsneak",
        "body": "That means they are losing tons of market share though. You could argue that the growth AMD is seeing could have been Intel's growth if they were competitive.",
        "created_utc": 1637274719,
        "id": "hl6gzrs",
        "score": 42,
        "subreddit": "stocks",
        "created": 1637303519.0
    },
    {
        "author": "GebMebSebWebbandTeg",
        "body": "I bought this in the mid 30s and rode it up to 150+. Unfortunately diamond handed a bit too long but was still lucky to get out at 105.\n\nI'm also an idiot who bought TSLA in 2014 and 2015 but took profits early. Also bought AMD at $11 but paper handed. LOL",
        "created_utc": 1636062332,
        "id": "hjc5gsr",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1636091132.0
    },
    {
        "author": "sugarbabysdaddy",
        "body": "Self made at least.  Was lucky enough to be a 5 % owner (first employee) in a tech start up.   When we sold I went all in AMD from reading the amd_stock subreddit.  It had me deep into understanding the tidal shift happening between AMD and Intel.  My dive into cannabis was meant to be temporary and I got caught for years.   I was confident AMD was on its way to 100. And kept watching it go up as my APHA was stuck after a short report.  \n\nOh well there will be others…",
        "created_utc": 1636393746,
        "id": "hjtuvv3",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1636422546.0
    },
    {
        "author": "jabootiemon",
        "body": "Very bullish on AMD NVDA and INTEL",
        "created_utc": 1636947968,
        "id": "hkofm9d",
        "score": 40,
        "subreddit": "StockMarket",
        "created": 1636976768.0
    },
    {
        "author": "raknor1981",
        "body": "all it means is the second hand market will be flooded with AMD cpus soon",
        "created_utc": 1636920369,
        "id": "hkmnvxd",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1636949169.0
    },
    {
        "author": "Fun-Journalist2276",
        "body": "AMD, TSLA, NVDIA, PLTR, SoFi, and FB.",
        "created_utc": 1637808646,
        "id": "hlziwyd",
        "score": 40,
        "subreddit": "stocks",
        "created": 1637837446.0
    },
    {
        "author": "That_Guuuy",
        "body": "Jesus Christ! And I thought my 60k AMD gains were massive",
        "created_utc": 1636056891,
        "id": "hjbrpxl",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1636085691.0
    },
    {
        "author": "Frogliza",
        "body": "Why do people sell a company that’s pretty much guaranteed to continue to go up like AMD?",
        "created_utc": 1636826740,
        "id": "hkhd4ay",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1636855540.0
    },
    {
        "author": "McSupergeil",
        "body": "Sold my nvda for 190% gain now.\n\nLove the company but i needed the money, and between amd and nvda id decided to keep riding my amd wave since i also use their hardware and love Su bae  i mean leather jacket guy is cool too but cmon",
        "created_utc": 1637284609,
        "id": "hl733wj",
        "score": 38,
        "subreddit": "stocks",
        "created": 1637313409.0
    },
    {
        "author": "RichieWOP",
        "body": "If you had put money into Nvidia and AMD every time there was a INTC pump post on this sub this year you may literally be up close to 100% on your money.",
        "created_utc": 1637429006,
        "id": "hlemk52",
        "score": 37,
        "subreddit": "stocks",
        "created": 1637457806.0
    },
    {
        "author": "cupnhandle",
        "body": "AMD $0.9B net income in Q3 (137% yoy growth) and $187B market cap\n\nNVIDIA $2.5B net income in Q3 (83% yoy grwoth) and $822B market cap\n\nMU $2.7B net income in Q3 (175% yoy growth) and $93B market cap\n\nEnough said.",
        "created_utc": 1637702359,
        "id": "hltgwyn",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1637731159.0
    },
    {
        "author": "Affectionate_Most509",
        "body": "$AMD",
        "created_utc": 1637398457,
        "id": "hld7pyz",
        "score": 36,
        "subreddit": "stocks",
        "created": 1637427257.0
    },
    {
        "author": "awesomedan24",
        "body": "If Intel could make their chips as small as this DD, they'd really get a leg up on AMD",
        "created_utc": 1636128779,
        "id": "hjfj2gg",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1636157579.0
    },
    {
        "author": "Khatib22",
        "body": "This has been tech earning in a nutshell LOL. Honestly, I think they will follow AMD - beat expectations but not move cause everyone already expected them to beat.",
        "created_utc": 1637154899,
        "id": "hkzferv",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1637183699.0
    },
    {
        "author": "TheChickening",
        "body": "Bought AMD at $6, was happy when I sold for $12. Ah well. Stories like these are a dime a dozen in the stock market world.",
        "created_utc": 1636062901,
        "id": "hjc6vm8",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1636091701.0
    },
    {
        "author": "yeti_man82",
        "body": "The big question is, should I use my AMD gains to get a stuffed crust pizza from the Hut?",
        "created_utc": 1636413697,
        "id": "hjv7zf5",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1636442497.0
    },
    {
        "author": "Hibiki_Kenzaki",
        "body": "I recommend AMD for now because NVIDIA and AMD have the same level of estimated EPS growth rate but AMD’s PE ratio is only half of NVIDIA. You can buy NVIDIA if it becomes cheaper later.",
        "created_utc": 1637250982,
        "id": "hl4t3ww",
        "score": 35,
        "subreddit": "stocks",
        "created": 1637279782.0
    },
    {
        "author": "spaxcundo",
        "body": "Both.\n\nAlso add TSMC cuz they make those NVIDIA &amp; AMD moneymakers 💸",
        "created_utc": 1637581968,
        "id": "hlmnm4b",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1637610768.0
    },
    {
        "author": "D_crane",
        "body": "AMD, NVDA, USD, ASML",
        "created_utc": 1638006818,
        "id": "hm9c686",
        "score": 35,
        "subreddit": "stocks",
        "created": 1638035618.0
    },
    {
        "author": "r2002",
        "body": "That sounds great! So are you still a pcmasterace person? What kind of tech stocks are you into that you think could be the next NVDA or AMD?",
        "created_utc": 1636598036,
        "id": "hk5j5pq",
        "score": 34,
        "subreddit": "stocks",
        "created": 1636626836.0
    },
    {
        "author": "A_Beautiful_Brain",
        "body": "I’m thinking NVDA and AMD are the future",
        "created_utc": 1636419290,
        "id": "hjvkd0e",
        "score": 34,
        "subreddit": "stocks",
        "created": 1636448090.0
    },
    {
        "author": "UnObtainium17",
        "body": "My thought was sell all of it and split into NVDA, AMD, AAPL, MSFT. and sleep well.",
        "created_utc": 1637462423,
        "id": "hlgo3fd",
        "score": 34,
        "subreddit": "stocks",
        "created": 1637491223.0
    },
    {
        "author": "blissrunner",
        "body": "Ever since ARKX in 2021... I'm beginning to doubt even in a pragmatic/thematic level. By far the worst ETF by Cathie (there was the SPCE deals... and since there's no space stocks, it's just defense)\n\nAnyways... ARKK (-33%)/G(-42%)/W(-25%)/F(-25%) is suffering since:\n\n* the flagship \"K\" was heavy on TDOC, ZM, Z, PLTR + Genomics... that went bad/dumped in 2021; and surprisingly Wood keeps averaging down (buy high, sell low) while it continues to go REDDD..\n   * Not enough stable value &amp; growth stocks like FANG+ which is rocking\n   * And also a lot of weird picks... like: TWTR, SNAP, why robinHOOD?\n* This is notice-able with ARKQ suffering the least at -16%:\n   * It has the most TSLA... with quality value/growth picks like Trimble, Unity, Deere, Caterpillar, Intuitive Surgical, Google finally, BYD etc.\n\nAnyways... I'm surprised thematically Cathie doesn't make an **ARKV (Virtual Reality) with a V** (a lot more pragmatic than ARKX).\n\n* Idk why she doesn't hold FANG+ like it's a sin or something. Holding the big four GOOGL, AAPL, MSFT, Meta and supporting's like AMD, NVDA, Unity, TSM, Samsung etc would've  been better (although in hindsight)",
        "created_utc": 1637765456,
        "id": "hlwmg8p",
        "score": 33,
        "subreddit": "stocks",
        "created": 1637794256.0
    },
    {
        "author": "Ja_Nee_Misschien",
        "body": "Intel is mainly behind because they failed to order a lot of EUV machines early unlike TSMC and Samsung. This can be fixed by spending a bigger share of the profits on capex and buying a lot of these advanced EUV machines themselves and that is exactly what they are going to do and what pissed of some investors. Intel announced they will be the first to receive the next iteration of even more advanced EUV machines soon.\n\nBy being a foundry Intel can use all their IP for their customers. This will give them an advantage over TSMC and Samson for a sizable chunk of the market. Simply because they can throw in this IP so customers can design product only intel can make. Their packaging techniques are not the same as those of TSMC and at least a sizable share of the market will benefit from these. I'm not going to claim they will steamroll TSMC but they will be able to take market share. It's a new market. It will be the same as AMD doubling their data center business by taking a few percentages of market share from Intel. In the foundry business TSMC will be like Intel and Intel will be like AMD.\n\nAs a foundry you can make whatever the client designs. Intel clearly stated they will go for a mix and match strategy where clients can combine external IP like ARM with Intel IP like packaging or networking. X86 will always have a place but Intel clearly accepted that it's not only x86 anymore and they are adapting.",
        "created_utc": 1635797782,
        "id": "hixbq51",
        "score": 32,
        "subreddit": "investing",
        "created": 1635826582.0
    },
    {
        "author": "skillz70001",
        "body": "I sold nvda at $120 pre split and sold amd at $13 :) I didn’t know anything about investing back then like 5-6 years ago lol",
        "created_utc": 1635798287,
        "id": "hixd08u",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1635827087.0
    },
    {
        "author": "rockinoutwith2",
        "body": "This news just *continues* to humiliate those who keep peddling INTC over AMD - including many nuts on this very sub.  Stop fighting the trend guys, and wake up to the reality that AMD is increasing its technological prowess over Intel on a daily basis.",
        "created_utc": 1636389966,
        "id": "hjtlbpp",
        "score": 32,
        "subreddit": "stocks",
        "created": 1636418766.0
    },
    {
        "author": "dafootballer",
        "body": "Because hindsight. AMD was a flat trade for years and years. Nvidia and Intel outclassed it by a mile. Lisa Su comes in, tons of hype. Bulldozer is mediocre but there’s some promise. I had AMD at like $12 and that shit didn’t move for a LOOONG time. No regrets getting out because it made sense at the time. I’m now making more on AMD calls now anyway.",
        "created_utc": 1636849314,
        "id": "hkituxy",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1636878114.0
    },
    {
        "author": "Cristian888",
        "body": "AMD!!!",
        "created_utc": 1636405256,
        "id": "hjunfqk",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1636434056.0
    },
    {
        "author": "Vi0lentByt3",
        "body": "You have to really watch and research the tickers you want to play with options, they can be simple but only if you put in a lot of work to identify the signals for when to make simple trades. It took me 2 years of watching and trying to play amd to finally know when to buy calls and puts and profit consistently. Always stick to what you know and research the shit out of anything new you want to get into.\nALSO the beauty of options is that you can always profit no matter whats happening to a stock. Up, down, flat, sharp price increase, slow burn down, any moves a stock is making there is always an effective strategy to provide th best chance of profit. NEVER lock yourself into a single option strategy otherwise you will severely diminish the companies and the timeframes you can trade. Start small and work up from there dont go chasing dragons after seeing those massive wsb gains",
        "created_utc": 1635871616,
        "id": "hj13za0",
        "score": 31,
        "subreddit": "options",
        "created": 1635900416.0
    },
    {
        "author": "FullTackle9375",
        "body": "He made up the name FAANG and always shilled them, NVDIA, Adobe, CRM, AMD etc for years.    \nHe also said buy Tesla during the fall 2019.     \nI would take his advice over the novices that started last year.",
        "created_utc": 1637801477,
        "id": "hlz2x2p",
        "score": 31,
        "subreddit": "stocks",
        "created": 1637830277.0
    },
    {
        "author": "vacathrowaway789",
        "body": "My longest holds are prob 6 or 7 years ago.\n\nNow that I think about it, I bought AMD, SHOP, and NFLX from recommendations from this sub, Stocks, and pre-meme WSB. So thanks for the tips, guys!",
        "created_utc": 1637864078,
        "id": "hm26zxw",
        "score": 31,
        "subreddit": "StockMarket",
        "created": 1637892878.0
    },
    {
        "author": "rockinoutwith2",
        "body": "Just from a few hours ago\n\n&gt; Intel Corp. ceded more than 2 percentage points of market share to Advanced Micro Devices Inc. in the third quarter, marking another setback for a chip pioneer that has lost some of its technology edge. \n\n\nhttps://www.bnnbloomberg.ca/intel-loses-ground-to-amd-as-demand-for-chromebook-chips-wanes-1.1677165",
        "created_utc": 1636078346,
        "id": "hjd6ikf",
        "score": 31,
        "subreddit": "stocks",
        "created": 1636107146.0
    },
    {
        "author": "UnObtainium17",
        "body": "I see AMD eventually at $500B. Maybe 3 -5 years from now. As long as Lisa Su is at the helm im holding on.",
        "created_utc": 1636392777,
        "id": "hjtsfz9",
        "score": 30,
        "subreddit": "stocks",
        "created": 1636421577.0
    },
    {
        "author": "Hot_Dog_Dudeson",
        "body": "I bought AMD back in April 2018 for 11$ a share watched it squeeze some shorts then had to sell in jan 2020 to put a down payment on my first home. I wish I’d have put down leas initially and held onto AMD now.",
        "created_utc": 1637824345,
        "id": "hm0boi6",
        "score": 29,
        "subreddit": "StockMarket",
        "created": 1637853145.0
    },
    {
        "author": "AdmonishedYouth",
        "body": "Lol at all the people still worshipping at the shrine of AMC while AMD and NVDA out here making people rich.",
        "created_utc": 1636107129,
        "id": "hjebhnw",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1636135929.0
    },
    {
        "author": "OmnipresentCPU",
        "body": "My AMD calls are on fire as well",
        "created_utc": 1637287126,
        "id": "hl78kfg",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1637315926.0
    },
    {
        "author": "bugtimtim",
        "body": "The costs to produce the chips are way too high. \n\nJust building a foundry to make semiconductors can run you up to 4 billion dollars, before you even buy the raw materials, or staff the foundry. \n\nIn order to make money, or even break even producing chips, you need to constantly push out product. And companies like ford or gm don't have the demand to warrant making their own product. \n\nEven companies like AMD, and Nvidia don't produce their own chips, and their sole business exists to sell them. \n\nThis is also the reason we haven't seen the semiconductors recover like we saw lumber recover earlier this year. \n\nLumber has a relatively short and cheap startup cost, so opening up more mills to produce higher quantities of lumber is profitable, quick, and relatively easy to do, in many cases, the mills already existed, but they were just running at low capacity. \n\nTo start up a new semiconductor foundry, you'd have to invest billions of dollars. Then you'd quickly catch up to demand, and you would be left with a billion+ dollar foundry that's not producing anything because demand went down.",
        "created_utc": 1636674674,
        "id": "hk9n88f",
        "score": 29,
        "subreddit": "stocks",
        "created": 1636703474.0
    },
    {
        "author": "TexasInvestor86",
        "body": "INTC earns more in EBITDA than AMD &amp; NVDA both generate in Revenue.. let that sink in, while INTC is 1/4 the market cap of NVDA. I love you retards creating this epic bubble. AMD and NVDA are going to get a massive hair cut and all of you dweebs will be panic selling. hahahahaha",
        "created_utc": 1636148373,
        "id": "hjgyk1b",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1636177173.0
    },
    {
        "author": "TacticalApproach555",
        "body": "Didn't meta just confirm purchasing from AMD for the new data centers?",
        "created_utc": 1637035743,
        "id": "hkta6di",
        "score": 28,
        "subreddit": "stocks",
        "created": 1637064543.0
    },
    {
        "author": "themostcanadianguy",
        "body": "It’s kinda funny that fidelity sends you these letters lol sorry to hear dude",
        "created_utc": 1636131956,
        "id": "hjfrcm3",
        "score": 2173,
        "subreddit": "wallstreetbets",
        "created": 1636160756.0
    },
    {
        "author": "The_Hindu_Hammer",
        "body": "Fidelity is like “Uhh you good bro?”",
        "created_utc": 1636134360,
        "id": "hjfxkwl",
        "score": 1001,
        "subreddit": "wallstreetbets",
        "created": 1636163160.0
    },
    {
        "author": "Not-a-Banker",
        "body": "out of curiosity what was he doing that he didnt feel that he offered a valuable service? if fidelity is considered risk averse and they want to help you protect/grow your assets, they are a major player in the retirement accounts game, and they stepped up in a lot of ways over the past year (things related to Covid, GME, etc), what was not valuable about what your brother in law was doing?",
        "created_utc": 1636138811,
        "id": "hjg979p",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1636167611.0
    },
    {
        "author": "whomcanthisbe",
        "body": "Tbh I still use Robinhood to check out the market Bc the UIUX is just miles ahead of everything else. I use fidelity to actually buy/sell.",
        "created_utc": 1635875572,
        "id": "hj1dx6h",
        "score": 113,
        "subreddit": "StockMarket",
        "created": 1635904372.0
    },
    {
        "author": "Splaishe",
        "body": "+1 for Fidelity, -1 for Robinhood",
        "created_utc": 1636039895,
        "id": "hjak2e7",
        "score": 106,
        "subreddit": "StockMarket",
        "created": 1636068695.0
    },
    {
        "author": "norwegianmorningw00d",
        "body": "Mate just download any app with fractional shares and buy Tesla from there \n\nFidelity Webull Stash M1 Sofi Robinhood Schwab CashApp",
        "created_utc": 1636037519,
        "id": "hjae0q7",
        "score": 81,
        "subreddit": "StockMarket",
        "created": 1636066319.0
    },
    {
        "author": "flibbidygibbit",
        "body": "I bought in after that. I only wish I had a crystal ball to average down when it hit the upper 30s in february. I averaged up once and down again.\n\nI've DRS'd most of my shares. I left a few in Fidelity for the Tendieman.",
        "created_utc": 1636059851,
        "id": "hjbzao5",
        "score": 67,
        "subreddit": "wallstreetbets",
        "created": 1636088651.0
    },
    {
        "author": "cdevon95",
        "body": "I was mainly referring to the fallacy of doing it again.  \nAll of sudden you're taking 20% out every week pretending you didn't get lucky this one time. Next thing you know you're opening a margin account with $8.67 in your bank account thinking \"this is it. This is the winner\". Now you owe Fidelity $54,000 and you're not sure how you got here.  because nobody seems to believe the first one is always free",
        "created_utc": 1636138224,
        "id": "hjg7nqf",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1636167024.0
    },
    {
        "author": "Firemanbets99",
        "body": "I have fidelity to hold my shares but I use robinhood for option trading. It’s far more simple than all the other apps and fidelity won’t even give me access to option trading",
        "created_utc": 1635817637,
        "id": "hiylkw8",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1635846437.0
    },
    {
        "author": "poolandapondforyou",
        "body": "Fidelity doesn’t have a fiduciary responsibility toward you either.   No broker does.",
        "created_utc": 1635829732,
        "id": "hiz7xr3",
        "score": 57,
        "subreddit": "wallstreetbets",
        "created": 1635858532.0
    },
    {
        "author": "tired_trotter",
        "body": "Yep, Fidelity does send these. I've lost 10k and got such a letter from them. Also they've stripped my options trading permissions lol",
        "created_utc": 1636154414,
        "id": "hjhdlxm",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1636183214.0
    },
    {
        "author": "throwatworkay",
        "body": "Until the legit brokers like TDA or Fidelity make a non boomer, easy to read and digest app, I'll stay with RH. \n\nI'll put big money in the legit brokers for a long hold, but RH is my meme/ what if account.",
        "created_utc": 1636045711,
        "id": "hjaz736",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1636074511.0
    },
    {
        "author": "horizons59",
        "body": "Fidelity and Schwab are .65 to open and zero to close for Fidelity under 1.00 per contract. \n\nFills on RH is how they give you free trades. You are just paying a fee with slow and crappy fills.",
        "created_utc": 1636256793,
        "id": "hjmvvhr",
        "score": 45,
        "subreddit": "options",
        "created": 1636285593.0
    },
    {
        "author": "Runner20mph",
        "body": "I have moved to Fidelity",
        "created_utc": 1635814925,
        "id": "hiyflad",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1635843725.0
    },
    {
        "author": "SetzerWithFixedDice",
        "body": "The weirdest shit just happened to me at Fidelity. \n\nOh, wait, no it didn’t, because it doesn’t fuck up like Robinhood.",
        "created_utc": 1635976145,
        "id": "hj7dzh3",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1636004945.0
    },
    {
        "author": "lucky5150",
        "body": "I do, everyday. In my defense I have more in Fidelity, But.. and in true WSB fashion, I can't leave RH until I pay off margin. And to do that I'd need to sell. And well. 💎🤚",
        "created_utc": 1635798593,
        "id": "hixds40",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1635827393.0
    },
    {
        "author": "Jangande",
        "body": "Say fidelity one more time",
        "created_utc": 1636081649,
        "id": "hjdddyw",
        "score": 36,
        "subreddit": "investing",
        "created": 1636110449.0
    },
    {
        "author": "FinalDevice",
        "body": "They almost certainly have called about margin calls in the past, only to be told not to call.\n\nWhile I don't have experience with Schwab, I know fidelity has picked up the phone to call me about much smaller amounts.",
        "created_utc": 1635818518,
        "id": "hiynj85",
        "score": 30,
        "subreddit": "options",
        "created": 1635847318.0
    },
    {
        "author": "ovomin",
        "body": "fidelity now has a beta option and it transforms the app into a better lookalike robinhood",
        "created_utc": 1635942106,
        "id": "hj50t1r",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1635970906.0
    },
    {
        "author": "gadzookery12",
        "body": "Fidelity",
        "created_utc": 1636199731,
        "id": "hjjgnyc",
        "score": 27,
        "subreddit": "StockMarket",
        "created": 1636228531.0
    },
    {
        "author": "Leroy--Brown",
        "body": "First off:\n\nCheck the cost of certificates for Disney stock that sell online. Not the value of the shares, but the paper certificates themselves. These are collectors items, and look into this first before you get rid of the certificates.\n\nSecondly, do you have a broker? Like, a real broker that isn't Robinhood? Contact Charles Schwab, vanguard, fidelity, or one of the many other real brokerages and see (if you have an account) how much these certs would be in real value today if redeemed, with dividends.",
        "created_utc": 1635911976,
        "id": "hj3vcba",
        "score": 27,
        "subreddit": "stocks",
        "created": 1635940776.0
    },
    {
        "author": "InsertCleverNameHur",
        "body": "I make a deposit into fidelity and I can make a trade 30 seconds later. Multiple brokerage accounts for different purposes.",
        "created_utc": 1636206082,
        "id": "hjjscla",
        "score": 24,
        "subreddit": "StockMarket",
        "created": 1636234882.0
    },
    {
        "author": "thisismyeighthtry",
        "body": "Fidelity has a beta app rn where they basically just lifted the RH UI. That's what I've been using",
        "created_utc": 1636050792,
        "id": "hjbc6hh",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1636079592.0
    },
    {
        "author": "JonathanL73",
        "body": "1.) High rate of accounts getting hacked, some even with 2FV enabled.\n\n2.) For the longest time they didn't even have a customer support phone number, they're difficult to get ahold of if a problem arises.\n\n3.) Unstable and unreliable app, RH became completely unusable, multiple times during the Covid March 2020 crash. When other brokers stayed operational\n\n4.) Payment for order flow. RH makes money buy selling your buy orders to high frequency trade hedge funds, who are then able to \"frontrun\" the stock, meaning they can buy the stock a milisecond before you do, thus raising the price your market orders get filled. So you're actually paying more for stocks on RH than if you used another broker.\n\n5.) Conflict of interest, RH primary customer, Citadel was caught illegally naked shorting meme stock. During the meme stock frenzy, RH users weren't allowed to buy shares of certain companies, whereas with other brokers you could.\n\n6.) RH has history of being fined by the SEC, and countless lawsuits regarding not having the best user's interest in mind.\n\n7.) Glitchy Options display. RH falsely displayed losses for a young options trader who was actually in the green. He ended up committing suicide because of it.\n\n8.) If you care about margin %, Interactive Brokers and M1 Finance both have cheaper margin %\n\n9.) Not good for buying Crypto. You don't have access to your wallet keys, and you're not allowed to transfer your crypto to anew wallet, so you're forced to liquidate it if you want to move it elsewhere, which creates a taxable event. Also questions have raised if RH really holds the crypto that you \"own\" on their app.\n\nAlso it's not 2019 anymore, it's 2021. Countless apps have clean simple UI. SoFi &amp; Fidelity Beta both have clean UI",
        "created_utc": 1636202763,
        "id": "hjjlpp6",
        "score": 20,
        "subreddit": "StockMarket",
        "created": 1636231563.0
    },
    {
        "author": "boskle",
        "body": "Perhaps, with enough people and if purchasing through Fidelity with IEX routing or directly from GameStop via its transfer agent, Computershare.",
        "created_utc": 1635999504,
        "id": "hj8srs1",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1636028304.0
    },
    {
        "author": "xanre_",
        "body": "Lol. I got denied for margin on my new fidelity account. Then i applied again but exaggerated my net worth/liquidity and i was instantly approved",
        "created_utc": 1635942871,
        "id": "hj5285g",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1635971671.0
    },
    {
        "author": "vanillagorillamints",
        "body": "Fidelity",
        "created_utc": 1636082871,
        "id": "hjdfr41",
        "score": 18,
        "subreddit": "investing",
        "created": 1636111671.0
    },
    {
        "author": "Is_ael",
        "body": "Now what do you do when you can’t be approved for options trading on fidelity?",
        "created_utc": 1636116532,
        "id": "hjepzmj",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1636145332.0
    },
    {
        "author": "Homesober",
        "body": "How do I make Fidelity let me buy 0dte options 😭😭",
        "created_utc": 1636150640,
        "id": "hjh4arl",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1636179440.0
    },
    {
        "author": "zentechinc",
        "body": "I'm a high up software dude at Fidelity.\n\nBest company I've ever worked at.\n\nCharismatic ceo, friendly staff, no yelling (been here a little while now and never heard anyone get snippy during a code release or troubleshooting issue).\n\nNot sure what your brother in laws issue was.",
        "created_utc": 1636162303,
        "id": "hjhvek5",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1636191103.0
    },
    {
        "author": "chicasparagus",
        "body": "Precisely why some people find it funny. \n\nBut sending these doesn’t help Fidelity in any way shape or form, so why else would they be doing it other than to warn a person. \n\nI mean you’re awfully cynical and nothing can change that, so you do you.",
        "created_utc": 1636137799,
        "id": "hjg6jlq",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1636166599.0
    },
    {
        "author": "Fog_Juice",
        "body": "I got into Robinhood after GME squeezed. It's just easier than Fidelity plus crypto. Applying for options took 30 seconds compared to 3 weeks.",
        "created_utc": 1636048541,
        "id": "hjb6ha3",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1636077341.0
    },
    {
        "author": "Poopdicks69",
        "body": "Only 54k in debt to fidelity? I would feel like a millionaire.",
        "created_utc": 1636143684,
        "id": "hjgm88v",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1636172484.0
    },
    {
        "author": "Rick420-",
        "body": "Fidelity Pro. This is the unreleased beta version so u wont be able to get it yet",
        "created_utc": 1636161759,
        "id": "hjhu8lo",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1636190559.0
    },
    {
        "author": "GoddamnRelapse",
        "body": "Was supposed to buy $3000 worth of AMC yesterday, but FUCKING FIDELITY can't settle money fast enough. 🤬",
        "created_utc": 1635887900,
        "id": "hj29x87",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635916700.0
    },
    {
        "author": "Big-Toe6215",
        "body": "Got my letter from Fidelity saying that I lost a lot of money.  My account gets restricted in 30 days without a signed consent to continue.\n\n&amp;#x200B;\n\nDon't they know that I'm in a trade that can 40X and I'll make it all back up and then some?",
        "created_utc": 1636031773,
        "id": "hja0tir",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1636060573.0
    },
    {
        "author": "gayforgoblin",
        "body": "If my account is 100% in CROX shares but it's split across my Fidelity, Vanguard, and Schwab accounts, am I diversified?\n\nSaw some guy named kevin o leary on youtube telling me to diversify so it's got me thinkin",
        "created_utc": 1635992727,
        "id": "hj8fwu8",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1636021527.0
    },
    {
        "author": "therealJcrusin",
        "body": "A list of buyers for this stock\n\nGoogle\nFidelity \nLockheed Martin \nKia\nHyundai \nBill Gates\nRobert Bosch\nSamsung \nMicheal Dell\nAmazon\nHewlett Packard\n\n\nStill not convinced? Look any of those up to see their investments.",
        "created_utc": 1636200537,
        "id": "hjjhy2e",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1636229337.0
    },
    {
        "author": "OuthouseBacksplash",
        "body": "Fidelity has a great new mobile app that had a beta Vue similar to RH. That is what I would look at.",
        "created_utc": 1636207035,
        "id": "hjjuc38",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1636235835.0
    },
    {
        "author": "onat_akosha_",
        "body": "So funny!!! Fidelity (mis) calculates all deposits as gains, so dumb - and don’t get me started on how they screw up margin calculations",
        "created_utc": 1636220063,
        "id": "hjkohgy",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1636248863.0
    },
    {
        "author": "Cow_Interesting",
        "body": "Fidelity all the way…. No I don’t work for them! How dare you",
        "created_utc": 1636059588,
        "id": "hjbyn03",
        "score": 10,
        "subreddit": "StockMarket",
        "created": 1636088388.0
    },
    {
        "author": "HiIAmFromTheInternet",
        "body": "I had been with Etrade for like…10 years? 7 digit account balance. Moved the whole fucking thing to Fidelity because they couldn’t DRS my shares in a timely manner. Fidelity did 5000 shares in 3 days, Etrade couldn’t do 3000 in 30 days. \n\nNot sure what the fuck up is on ETrades end, but oh man they are fucking up.",
        "created_utc": 1635805741,
        "id": "hixuw6m",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1635834541.0
    },
    {
        "author": "NoleScole",
        "body": "Idk what wells fargo has been doing but settled cash applies to all brokerages unless you have a margin account. You can’t set up market trade at any brokerages. You can set up a limit order. I think you might be saying you can’t buy or sell at market, after hours. With fidelity you have to sign up for after hours trading. Then you have to go to their website to trade after hours or pre market hours. It isn’t available in the app.\n\nI use fidelity for long term I’ve been with them for years. They’re not my favorite to navigate though. I prefer others for trading and watchlist.",
        "created_utc": 1636084489,
        "id": "hjdisue",
        "score": 9,
        "subreddit": "stocks",
        "created": 1636113289.0
    },
    {
        "author": "FreeEuropeYouCunts",
        "body": "[How I dress up before logging into Fidelity, knowing that TSLA had greater gains in one month than my portfolio's entire YTD](https://i.imgur.com/xEcrowX.jpg)",
        "created_utc": 1635805927,
        "id": "hixvbj9",
        "score": 9,
        "subreddit": "stocks",
        "created": 1635834727.0
    },
    {
        "author": "SnowInTheTundra",
        "body": "Brokerage firms should send you souvenirs and shit if you hit milestones in your investment. Like get a 100k net worth and Fidelity sends you a mug in the mail.",
        "created_utc": 1636153268,
        "id": "hjhau7z",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1636182068.0
    },
    {
        "author": "Jello_Available",
        "body": "People hate RH, because they restricted trading when it was profitable for retail investors like you and I. I didn’t personally invest in GME or AMC, but I moved the amount I had (10k) over to Fidelity, where I already have my 401k and Roth, on that principle alone. Can’t trust a brokerage that restricts trading when it’s convenient for them….the fact that people miss this HUGE red flag is alarming.",
        "created_utc": 1636055393,
        "id": "hjbnw5a",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1636084193.0
    },
    {
        "author": "cw8950",
        "body": "Good luck to all those who hold BTTX today!! Wanted to fomo in but fidelity doesn’t let me trade until 7am so looks like I missed the boat lol. Just curious what brokers allow trading for during early premarket?",
        "created_utc": 1635759657,
        "id": "hiv78eb",
        "score": 8,
        "subreddit": "SPACs",
        "created": 1635788457.0
    },
    {
        "author": "seb_a",
        "body": "WeBull too restricted trading just like RH. E*TRADE did as well. To Fidelity I went.",
        "created_utc": 1636043633,
        "id": "hjatslg",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1636072433.0
    },
    {
        "author": "Helpy-Mchelperton",
        "body": "I got a FED call during the Columbus day thing on fidelity and they let me take care of it myself instead of liquidating my stuff. Pretty cool of them. Just saying. 🤷‍♂️",
        "created_utc": 1636282543,
        "id": "hjns0qj",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1636311343.0
    },
    {
        "author": "MythrowawayAcc5678",
        "body": "I'm still with RH but not very much money is it in. for example, RH has a really nice and simple layout combined with the DRIP option, something webull doesn't have. on top of that, RH's graphs are super easy to read, and show all the info without it being cluttered. Fidelity doesn't live stream stocks meaning unlike with RH, you need to refresh every 5 seconds to see the price movements. \n\nI use fidelity for my Roth, RH for my second smaller portfolio, and webull for day trading and other stuff. Coinbase is for crypto. typically I find it better to separate portfolios and some layouts are better than others. you wouldn't use robinhood for extreme technical analysis and you wouldn't use webull for long term buy and hold.",
        "created_utc": 1635877167,
        "id": "hj1hz2x",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1635905967.0
    },
    {
        "author": "SnowInTheTundra",
        "body": "What can Robinhood or Fidelity even do if you get margin called? Do people go to court over this shit?",
        "created_utc": 1636072373,
        "id": "hjct4v8",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636101173.0
    },
    {
        "author": "Peelboy",
        "body": "I have been using Fidelity for a while now and love the customer service and there is a physical location a couple miles from me.  I'm in the process of moving all my random retirement and other accounts over there now.",
        "created_utc": 1636207456,
        "id": "hjjv92p",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636236256.0
    },
    {
        "author": "rotaercz",
        "body": "Everyone is using Fidelity because they didn't turn off buys during the GME sneeze.",
        "created_utc": 1636108670,
        "id": "hjedfq9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636137470.0
    },
    {
        "author": "sorengard123",
        "body": "Simple, quality of investor base. A CFO's dream is blue-chip long only funds like Fidelity and Wellington which buy and hold forever. Management doesn't want hedge funds grilling them every quarter over why the margin isn't 20bp higher or activists threatening to fire them. They want investors who trust them to run the business well over the long-term. There's a reason why Charter Communications is bullet proof. It has the highest institutional ownership on the Street and spends zero time courting investors or investment banks.",
        "created_utc": 1636084218,
        "id": "hjdibof",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1636113018.0
    },
    {
        "author": "trump2024_3312",
        "body": "If the fidelity app is right this isn't a bad dividend stock",
        "created_utc": 1636271020,
        "id": "hjnfnp4",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636299820.0
    },
    {
        "author": "wordyplayer",
        "body": "Weird.   Fidelity provides a great service.    What was his job there??",
        "created_utc": 1636161291,
        "id": "hjht7wt",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636190091.0
    },
    {
        "author": "Neo1331",
        "body": "I’m at about $8,000 in commissions in Fidelity and they told me to go pound sand…☹️",
        "created_utc": 1636260906,
        "id": "hjn2xok",
        "score": 7,
        "subreddit": "options",
        "created": 1636289706.0
    },
    {
        "author": "I_love_avocados1",
        "body": "It’s most payment processors, not just PayPal. Look what’s happening to old school competitors like $EEFT, $FIS, $FISV, $GPN, not to mention $MA, and $V.",
        "created_utc": 1635864325,
        "id": "hj0m8a9",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635893125.0
    },
    {
        "author": "hellohi1994",
        "body": "I kept buying and selling if you wanna see the trades I bought it’ll take me some work but look at my post I jus made, I kept half sent to fidelity still hodling",
        "created_utc": 1635978535,
        "id": "hj7jtoo",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1636007335.0
    },
    {
        "author": "Jonnydoo",
        "body": "Why didn't you just lie to fidelity to get higher options levels.",
        "created_utc": 1636149132,
        "id": "hjh0j7j",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636177932.0
    },
    {
        "author": "MrEwThatsGross",
        "body": "Robinhood to get fucked. Fidelity for SPY",
        "created_utc": 1635970820,
        "id": "hj709qw",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635999620.0
    },
    {
        "author": "McKoijion",
        "body": "There's a legit investing lesson here. I used to say that Robinhood had a well designed app UI, but a terrible back end infrastructure. Meanwhile, Vanguard, Fidelity, and Schwab have great back end infrastructure, but terrible, outdated UIs. I used to think what those companies did was the hard part, and Robinhood just put some paint on a pig. I joked it was a race to see who could fix themselves up faster. But it's been almost a year, and those old school websites are as bad as ever.\n\nVanguard's bad UI is somewhat on purpose, and Schwab bought TDA and Thinkorswim. But Fidelity is an embarrassment. Active Trader Pro is the single oldest and worst performing piece of software I've had the misfortune of interacting with in the past decade. Their mobile app is terrible as well, though I commend them for trying to introduce a nicer looking, but still barely functional Robinhood knockoff beta.\n\nBasically, good design is priceless. But since an investor's job is to put a price on things, I'll just say it's very valuable. Haters always said that Steve Jobs was just the pretty boy frontman, but there are a lot of computer companies and only one is the largest corporation on the planet by simply coasting on Jobs's designs. It's hard to write good code or build a brokerage, but it's almost impossible to create good design.\n\nBasically, leaps on $MLKN",
        "created_utc": 1636085115,
        "id": "hjdjwq9",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636113915.0
    },
    {
        "author": "havestickswilltravel",
        "body": "I am with Fidelity. Can I register thru them? Ape not smart.",
        "created_utc": 1636050755,
        "id": "hjbc39e",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636079555.0
    },
    {
        "author": "I_need_my_fix_damnit",
        "body": "Also on fidelity",
        "created_utc": 1635903489,
        "id": "hj3c863",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1635932289.0
    },
    {
        "author": "dahhb",
        "body": "I got a response from one of those guys on Twitter, CannaVestments, yesterday. \n\nI carefully searched for all Reddit posts about this tweet. The best response I have is this is not a big deal. My takeaway: it is unlikely that less conservative, larger brokers like TD and Fidelity will start to block MSO OTC trades due to it still being a schedule one drug.\n\nHere's the thread from yesterday:\n\nhttps://www.reddit.com/r/weedstocks/comments/qiyczy/daily\\_discussion\\_thread\\_october\\_30\\_2021/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3",
        "created_utc": 1635812675,
        "id": "hiyajy9",
        "score": 5,
        "subreddit": "weedstocks",
        "created": 1635841475.0
    },
    {
        "author": "BuffMaltese",
        "body": "Last bearish bet I made I lost 11k the next day and Fidelity sent me a letter.",
        "created_utc": 1636060922,
        "id": "hjc1z77",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636089722.0
    },
    {
        "author": "alexgalt",
        "body": "Still Robinhood for new people. Fidelity is fine, but there is a reason why Robinhood remains ultra popular with people who are just learning.",
        "created_utc": 1636053591,
        "id": "hjbjazv",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636082391.0
    },
    {
        "author": "hunter994",
        "body": "I'm pretty sure you need to be a high net worth individual and a customer of the brokerage firm that publishes them, alternatively independent analysts offer subscriptions I think. Fidelity and Robinhood usually have (what I assume to be automatically generated) reports that have comps and such, but they aren't that great. I'm sure the others do to, but I haven't checked them out. \n\nThis is mostly speculation based off what I see other people talking about, I'm not a high net worth individual, and I don't value analyst reports.",
        "created_utc": 1636140213,
        "id": "hjgcyq1",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1636169013.0
    },
    {
        "author": "TCB47",
        "body": "Fidelity.  And as a post below states, it's not margin when cash secured.",
        "created_utc": 1636151336,
        "id": "hjh61h4",
        "score": 5,
        "subreddit": "options",
        "created": 1636180136.0
    },
    {
        "author": "bigdogc",
        "body": "You need to get a rep. Ask them to match IBKR. I’m at 0.85% with fidelity",
        "created_utc": 1636226679,
        "id": "hjl3o3b",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636255479.0
    },
    {
        "author": "tebedam",
        "body": "Just move your money to Interactive Brokers, that's what I did. It takes about 10 business days, the process is automated. Whatever margin you already have will also transfer.\n\nI tried margin on Fidelity for a month, had ~$350k on margin and kept trying to negotiate a better deal with multiple phone calls. All I got in the end was 5.5%. After that I moved the account and now my blended rate is ~1.2%. \n\nI set up a PRO account on IBKR, you pay a few fees and commissions this way, but overall get massive value due to low margin rates.",
        "created_utc": 1636221615,
        "id": "hjks3e9",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636250415.0
    },
    {
        "author": "AutisticDravenMain",
        "body": "IIRC, there’s 5K minimum for margin. There’s also fees on options. I just use Fidelity for my long positions and IRA, if you want to play with options, there are better choices.",
        "created_utc": 1635826938,
        "id": "hiz3qxd",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635855738.0
    },
    {
        "author": "Sven1542",
        "body": "I have no used the TDA app, but fidelity is kind of a pain for an option novice.",
        "created_utc": 1636046691,
        "id": "hjb1q14",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636075491.0
    },
    {
        "author": "redbaronx",
        "body": "I’m on Fidelity, you have to agree to some terms to trade penny stocks tho.",
        "created_utc": 1635795103,
        "id": "hix52rn",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1635823903.0
    },
    {
        "author": "joethearchitect3",
        "body": "This 401k plan had a Brokerage link option where you could buy individual stocks. Fidelity and Merrill Lynch have this option, but not every company 401k plan gives you the brokerage link option. It’s a powerful tool for your retirement investment accounts if you’re an active investor",
        "created_utc": 1635938224,
        "id": "hj4udwi",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635967024.0
    },
    {
        "author": "Conscious-Soil9055",
        "body": "Webull (Their app and desktop program are by far the best I've used. they lack a couple of features but they release weekly updates)\n\nFidelity (They are by far the most conservative and least risky, they will frustrate you at times but its really to stop you from doing dumb things.) Fidelity is also nice because i manage 5 different retirement accounts there.\n\nE-Trade (I've heard great things, never used or seen, but people that do rave)\n\nI just opened an account with IBKR only for the low margin rate for my long term taxable account. It is very clunky. Fidelity's simple web version blows IBKR out of the water.",
        "created_utc": 1636206432,
        "id": "hjjt2kj",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636235232.0
    },
    {
        "author": "drwhiskeyscarn429",
        "body": "Fidelity has become a bunch of bitches lately…\n\nIt’s like they don’t understand option arbitrage",
        "created_utc": 1635935855,
        "id": "hj4qz23",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635964655.0
    },
    {
        "author": "dh4645",
        "body": "I like fidelity",
        "created_utc": 1636143164,
        "id": "hjgktu1",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636171964.0
    },
    {
        "author": "internet_humor",
        "body": "\"Hello Fucktard,\n\nYou good?\n\nIte, cool\"\n\n~Fidelity",
        "created_utc": 1636168475,
        "id": "hji88ha",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636197275.0
    },
    {
        "author": "code_man_",
        "body": "Fidelity has the zero expense ratio index mutual funds.\n\nBut most people tend to argue that the Vanguard equivalent ETFs are better because they are more liquid and proven over time.",
        "created_utc": 1635829242,
        "id": "hiz78qa",
        "score": 4,
        "subreddit": "stocks",
        "created": 1635858042.0
    },
    {
        "author": "positronicsubprocess",
        "body": "I am slowly moving to fidelity but I do love the simplicity of the interface. Also I made decent money in the post IPO pop/volatility by selling covered calls on my IPO allotment",
        "created_utc": 1635976466,
        "id": "hj7es6t",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636005266.0
    },
    {
        "author": "momofuku18",
        "body": "Yup!  Plus, OP, welcome to Fidelity!",
        "created_utc": 1635974766,
        "id": "hj7aiil",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1636003566.0
    },
    {
        "author": "CHERCK_FLOKI",
        "body": "Fidelity won't let me trade 0dte options. Wtf.",
        "created_utc": 1636130498,
        "id": "hjfnk2m",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636159298.0
    },
    {
        "author": "sockalicious",
        "body": "&gt; He said he couldn't stand taking peoples money and not really offering a valuable service.\n\nYeah, he got fired.  I've been with Fidelity for 25 years and they've been nothing but great.",
        "created_utc": 1636166131,
        "id": "hji3jwu",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636194931.0
    },
    {
        "author": "Banabak",
        "body": "Yea , ton of money directed into vanguard / fidelity in 401k/ iras every two weeks",
        "created_utc": 1636079340,
        "id": "hjd8lx7",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636108140.0
    },
    {
        "author": "Grundle_Monster",
        "body": "You know what fidelity didn’t do? Expose that capital to the kind of risk that you took to make $3k",
        "created_utc": 1635978557,
        "id": "hj7jvl5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636007357.0
    },
    {
        "author": "mandykayte",
        "body": "Fidelity as well. Just make sure you enable penny stocks.",
        "created_utc": 1635878104,
        "id": "hj1keuk",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1635906904.0
    },
    {
        "author": "GiveMeMyM0ney",
        "body": "3 minute conversation with fidelity. They will know why you are calling.",
        "created_utc": 1636079452,
        "id": "hjd8uqo",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636108252.0
    },
    {
        "author": "GaylrdFocker",
        "body": "Not all Fidelity 401Ks allow that, mine did not.  Your plan still needs to make that an option, it isn't by default because you're at Fidelity.  And there are a lot more 401K companies than Fidelity, they never said they were with Fidelity.",
        "created_utc": 1636081139,
        "id": "hjdcd7b",
        "score": 4,
        "subreddit": "investing",
        "created": 1636109939.0
    },
    {
        "author": "LonelyGirlNeedsLove",
        "body": "Mann the fidelity app is just.... 😂 everytime i click on my account the little circle will spin forever and my info can never seem to load. If only Robinghood wasn't sketchy.",
        "created_utc": 1635910464,
        "id": "hj3s7dq",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1635939264.0
    },
    {
        "author": "WeenisWrinkle",
        "body": "Fidelity, Schwab, Vanguard are my 3 favorite.",
        "created_utc": 1636129790,
        "id": "hjflofi",
        "score": 4,
        "subreddit": "investing",
        "created": 1636158590.0
    },
    {
        "author": "x11onMac",
        "body": "You forgot the $150 transfer fee Robinhood eats as you transfer to fidelity hence you’ll lose 100% 😂",
        "created_utc": 1636231411,
        "id": "hjlef1a",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636260211.0
    },
    {
        "author": "sirachah",
        "body": "Well, I’m happy today. I was watching live and I never saw anything above that on fidelity. Although I do see now there was a peak of 29.10, I’m not sure if that’s a price correction. Either way, thanks to OP for hooking us up! I’m looking forward to his next play.",
        "created_utc": 1635787336,
        "id": "hiwm5ln",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1635816136.0
    },
    {
        "author": "StarfishSpencer",
        "body": "Put money in my Fidelity account to buy some NMG last week, but the cash didn't clear in time. Price went up over fifty cents this morning before I could nab some, and then promptly dropped ten after I did so. Somehow it always seems to work out like this for me, lol.",
        "created_utc": 1635781945,
        "id": "hiw9gz2",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635810745.0
    },
    {
        "author": "MajorKeyBro",
        "body": "What am I faking? I have DRS shares in the pool, and Fidelity shares I bought via IEX. But im also a retard that buys calls before the big runs.",
        "created_utc": 1635799701,
        "id": "hixgj6y",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635828501.0
    },
    {
        "author": "DudelyMore",
        "body": "It's fine. And insured. Just keep using Fidelity for everything else and pretend it's not there for a decade. That said, they charged me zero to close an outside account and transfer to them, so get on the phone and talk to one of their support staff.",
        "created_utc": 1636006796,
        "id": "hj935e4",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636035596.0
    },
    {
        "author": "Praughfet",
        "body": "Depending on the trade and reserve capital,  if  iam out of settled funds and complete a trade for say $500 profit or more,  ill wire money right back in and take the 30 fee as cost of business to have those funds ready again in 15 minutes.\n\nGFV was tricky.. i did get pinged at first , which made no sense to me\n\n i had an hour long phone call with fidelity about the GFV and the guy could flat out not answer me..   For OTC you have to trade with settled funds, a GFV is a trade made without settled funds, so how can that be....after an hour back and forth with the lackey i finally got transferred to a senior broker and was told to look at my cash available to withdraw to gauge if a GFV is possible.  no further problems.",
        "created_utc": 1635976783,
        "id": "hj7fl2d",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1636005583.0
    },
    {
        "author": "LastPotato1214",
        "body": "$900m pipe... I might regret holding, but I wouldn't mind adding on any dip.   No anpan analysis, but these dudes look long...  Janus Henderson Investors, Fidelity, BlackRock, Neuberger Berman funds, and Goldman Sachs for 200m of it.",
        "created_utc": 1636061883,
        "id": "hjc4chq",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1636090683.0
    },
    {
        "author": "_hiddenscout",
        "body": "NRDS is available to buy on Fidelity. Still on the fence on this IPO.",
        "created_utc": 1636043719,
        "id": "hjau0s6",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636072519.0
    },
    {
        "author": "kft99",
        "body": "Fidelity is very quick.",
        "created_utc": 1635951385,
        "id": "hj5lbdj",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1635980185.0
    },
    {
        "author": "_Sgushonka",
        "body": "FISV",
        "created_utc": 1635880582,
        "id": "hj1qukn",
        "score": 8,
        "subreddit": "stocks",
        "created": 1635909382.0
    },
    {
        "author": "I_love_avocados1",
        "body": "It’s most payment processors, not just PayPal. Look what’s happening to old school competitors like $EEFT, $FIS, $FISV, $GPN, not to mention $MA, and $V.",
        "created_utc": 1635864325,
        "id": "hj0m8a9",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635893125.0
    },
    {
        "author": "noname45678",
        "body": "FISV",
        "created_utc": 1635892406,
        "id": "hj2lfrk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635921206.0
    }
]