[
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/surmoiFire (3/0) made a bet that ANET would go to 150.0 when it was 527.09 and it did, congrats autist.",
        "created_utc": 1637228594,
        "id": "hl3pl40",
        "permalink": "/r/wallstreetbets/comments/qw8udu/what_are_your_moves_tomorrow_november_18_2021/hl3pl40/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1637257394.0
    },
    {
        "author": "Investinwaffl3s",
        "body": "AMD 👀\n\nNot dipping pre market. Something's gotta be up. Might go for $130...\n\nEDIT:  \nOh god damn ANET major beat + buyback. Don't know how I missed that",
        "created_utc": 1635843332,
        "id": "hiznuci",
        "permalink": "/r/wallstreetbets/comments/qkmd3z/what_are_your_moves_tomorrow_november_02_2021/hiznuci/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635872132.0
    },
    {
        "author": "option-trader",
        "body": "call options ahead of earnings was light. I saw CAR and ANET this morning, and decided to research ANET instead of CAR. Boy did I take the wrong trade.",
        "created_utc": 1635890680,
        "id": "hj2h5ne",
        "permalink": "/r/wallstreetbets/comments/qlaurk/my_car_short_into_earnings_life_savings_and_some/hj2h5ne/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635919480.0
    },
    {
        "author": "leftysarepeople2",
        "body": "Arista is on a rocket this week",
        "created_utc": 1635952565,
        "id": "hj5oaxi",
        "permalink": "/r/stocks/comments/qlqsv6/rstocks_daily_discussion_wednesday_nov_03_2021/hj5oaxi/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635981365.0
    },
    {
        "author": "VisualMod",
        "body": "**Ban Bet Created:** **/u/surmoiFire** bet **ANET** goes from **527.09** to **150.0** before **2021-11-19 15:27:21.568467-05:00**",
        "created_utc": 1637180849,
        "id": "hl160ea",
        "permalink": "/r/wallstreetbets/comments/qvwu4g/daily_discussion_thread_for_november_17_2021/hl160ea/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1637209649.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  1st of November\n\n\n\n## Upcoming events for Monday, November  1st\n\n - Expected earnings:\n\n  ABIO, ADC, ADTN, ADUS, AKTS, ALX, AMC, AMG, AMRC, ANAT, ANET, APEN, APLS, AWR, BEN, BNL, BRKR, BRX, BWXT, CACC, CAR, CCLP, CEA, CHGG, CLDB, CLX, CNA, CORR, CPLP, CRNT, CRUS, CSR, CSWC, CURO, CVI, CWBC, DSPG, DSS, DZSI, EC, EEX, EGRX, ENBL, EPRT, EVER, FANG, FEDU, FGBI, FN, GAIA, GAME, GSS, GTE, GXO, HLIT, HNRG, HOLX, IPI, ISEE, IVAC, IVT, IX, JELD, KFRC, KLDO, KMT, KOF, L, LDI, LEG, LKCO, LTRN, LXU, MCK, MFIN, MGP, MNOV, MOS, MRBK, MVBF, NBIX, NERV, NRIM, NSP, NSSC, NTR, NXPI, O, OGS, OIS, ON, ONVO, OTTR, PCG, PDLB, PLOW, PSA, RHP, RIG, RMBS, RRX, RYAAY, SBAC, SBT, SKT, SMLR, SNDX, SOI, SPG, SUNW, SXC, TA, TKR, TRVG, TRVN, TTI, UAN, UNVR, VBIV, VNO, VNOM, VRNS, WBK, WLFC, WMB, WMK, WTRG, XENT, ZI\n\n - Ex-div:\n\n  AES, BANR, BKR, ETRN, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, HIHO, IGD, ITUB, LMRK, O, OMF, SHLX, SPH, SRCE, VER, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.055%)\n    - 6-Month Bill Auction (previous: 0.060%)\n    - Construction Spending (consensus: 0.4%, previous: 0.3%)\n    - ISM Manufacturing Employment (previous: 50.2)\n    - ISM Manufacturing New Orders Index (previous: 66.7)\n    - ISM Manufacturing PMI (consensus: 60.5, previous: 61.1)\n    - ISM Manufacturing Prices (consensus: 78.5, previous: 81.2)\n    - Investing.com Gold Index (actual: 59.9%, previous: 54.3%)\n    - Investing.com S&amp;P 500 Index (actual: 57.5%, previous: 47.2%)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 59.2, previous: 60.7)\n    - Total Vehicle Sales (previous: 9.66M)\n\n## Upcoming events for Tuesday, November  2nd\n\n - Expected earnings:\n\n  AAIC, ACH, ACOR, ACT, ADCT, ADXN, AFG, AGRX, AHH, AIZ, AKAM, AMCR, AME, AMED, AMGN, ANDE, APO, APPS, AQB, AQST, ARCB, ARGO, ARNC, AROC, ATVI, AVNS, AWK, AYX, BBGI, BCC, BFAM, BGFV, BHC, BKH, BLD, BLMN, BP, BRY, BSBR, BTG, BXC, CASA, CDK, CDLX, CEIX, CERS, CHCT, CHK, CIGI, CINR, CLNN, CLW, CMI, COP, COUR, CRK, CRSR, CRVL, CSLT, CTLT, CZR, DAR, DCO, DCP, DCPH, DD, DEA, DEI, DENN, DHT, DOX, DRRX, DS, DVN, EARN, EDU, EGHT, EIX, EKSO, EL, ELVT, ENLC, EOLS, EPD, ESPR, ETN, ETRN, EXAS, EXEL, EXLS, EXPD, EXTN, EXTR, FMC, FNF, FRG, FRSH, FSP, FSTR, GAIN, GIC, GLDD, GLT, GLYC, GNRC, GNW, GPN, GPOR, GRBK, HALO, HCC, HEES, HEP, HLF, HLNE, HRB, HSC, HSIC, HURN, HY, IAA, IART, ICD, ICFI, ICHR, IDXX, IEP, INCY, INFI, INGR, INSP, INTG, INVE, IOSP, IPGP, IT, JBGS, JRVR, KAI, KAMN, KAR, KKR, KOPN, KTCC, LCII, LDOS, LEA, LGIH, LILA, LILAK, LIND, LPI, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, MANT, MCY, MDLZ, MDXG, MEC, METC, MG, MGNX, MGY, MIME, MINM, MKL, MLM, MMP, MOD, MPC, MPLX, MRCC, MRCY, MTCH, MTRN, MYGN, NAUT, NCSM, NE, NETI, NMIH, NNN, NP, NR, NRC, NRZ, NSA, NXRT, NXST, NYMT, OCFT, OCN, OKE, OMCL, OMIC, ORTX, OSPN, OVV, PAA, PACB, PAGP, PAHC, PAYC, PEAK, PEG, PFE, PINC, PIRS, PKI, PKOH, PMTS, PRO, PRTS, PRU, PTRS, PUMP, QUAD, RACE, RAMP, RARE, RCKY, RCM, RDN, RGNX, RIGL, RL, RM, ROK, RRD, RRR, RYAM, RYTM, SABR, SAGE, SEB, SEDG, SEE, SEVN, SFST, SGRY, SHIP, SKY, SKYT, SMCI, SNCY, SPLP, SPT, SQNS, SRC, SRCL, SREV, SRG, SRT, STAR, STE, STRL, TCS, TECH, TMUS, TMX, TNC, TRC, TRI, TRNS, TRTX, TSLX, TSQ, TTM, TVTY, TX, UA, UAA, UBCP, UFPT, UIS, UNM, USAC, USDP, UTL, VAL, VECO, VMD, VOYA, VRSK, VRTX, WAT, WBT, WEC, WEYS, WFRD, WLK, WLKP, WTI, WTTR, WU, XHR, XPO, XYL, Z, ZBRA, ZG, ZYME\n\n - Ex-div:\n\n  ASML, BRO, CAPL, CBAN, DSX, HFWA, LUB, MCBS, MKTX, MTX, NTIC, SSBK, TACO, TRS, USDP, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.090%)\n    - API Weekly Crude Oil Stock (previous: 2.318M)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - Redbook (previous: 15.6%)\n\n## Upcoming events for Wednesday, November  3rd\n\n - Expected earnings:\n\n  AAWW, ACA, ACEL, ACLS, ACRE, ACRS, ADPT, AEE, AFIN, AGIO, ALB, ALL, ALTM, AMOT, AMRN, AMSC, ANAB, ANSS, ANVS, APA, ARAY, ARC, ARTL, ARTNA, ASC, ASTE, ASXC, ATEX, ATGE, ATH, ATRC, ATXI, ATY, AUPH, AUTL, AVA, AVNW, AXGN, BBSI, BCRX, BCSF, BDC, BDSI, BGCP, BGSF, BIP, BKCC, BKNG, BLKB, BLUE, BNFT, BR, BRSP, BVH, BWA, CAKE, CCRN, CCU, CDAY, CDEV, CDW, CDXC, CENX, CF, CFMS, CGBD, CHNG, CIA, CIM, CIO, CIX, CKPT, CLH, CLR, CLVS, CMLS, CMP, COHN, CORT, CPE, CPK, CPRI, CPS, CRL, CRTO, CSGS, CSTE, CSWI, CTRA, CTVA, CUTR, CVE, CVGI, CVS, CW, CWAN, CWH, CYTK, DFIN, DIOD, DISCA, DISCB, DISCK, DMAC, DNOW, DRTT, DXC, DXYN, EA, EAT, ECPG, EGY, ELA, ELF, EMR, EPR, EQH, EQIX, EQX, ES, ET, ETR, ETSY, EVA, EVH, EVOP, EVRG, EVRI, EXC, EXPI, EYPT, FDP, FLMN, FLT, FLXN, FNV, FOE, FORR, FOX, FOXA, FRGI, FRPH, FSLY, FSR, FUN, FYBR, GCP, GDDY, GDEN, GFL, GHC, GHL, GLBZ, GLRE, GMAB, GMRE, GNK, GRP.U, GTHX, H, HARP, HBB, HBIO, HBM, HBP, HDSN, HFC, HLMN, HMN, HOFV, HR, HRTX, HST, HUBS, HUM, HZNP, IAG, ICLR, ICPT, ICUI, IDN, IIPR, IMXI, INFN, INMB, INN, INSG, IO, IONS, IR, ITI, ITIC, ITT, ITUB, IVR, JLL, KE, KIDS, KL, KLTR, KNBE, KPTI, KRO, KTOS, KW, LAMR, LANC, LAND, LBTYA, LBTYB, LBTYK, LCI, LCTX, LEXX, LHCG, LIVN, LL, LNC, LPG, LUMN, LUMO, LYTS, MAC, MAR, MATX, MAXR, MCHX, MCS, MDU, MET, MFC, MGM, MGNI, MGPI, MGYR, MLNK, MLP, MLR, MNKD, MNRL, MPLN, MRO, MRTX, MTG, MTTR, MTW, NC, NCLH, NESR, NEXT, NFE, NHTC, NI, NL, NMFC, NODK, NRP, NUS, NVST, NYT, OAS, OCDX, ODP, OLP, OM, OMI, OMP, ONCT, ONEM, OPRT, ORA, ORCC, OSUR, OSW, OTIC, PARR, PBI, PBPB, PCRX, PEN, PETQ, PFIE, PING, PK, PLMR, PLTK, PLYA, PRAX, PRG, PRTA, PSN, PTC, PTGX, PTVE, PXD, QCOM, QGEN, QLYS, QMCO, QNST, QRVO, QTWO, QUOT, RADA, RC, RCII, RCKT, RDWR, REGI, RGLD, RGR, RMNI, RNWK, ROCC, ROKU, RPD, RPT, RTLR, RVI, RVLV, RVPH, RYI, RYN, SAFT, SANA, SAND, SBGI, SBOW, SBRA, SD, SENEA, SENEB, SGC, SGMO, SHOO, SITE, SITM, SJI, SKLZ, SLF, SLRC, SMG, SNSE, SPNS, SPNT, SPPI, SPR, SPWR, SPXC, SRDX, SRPT, SSRM, SSSS, STAA, STCN, STGW, STN, SUM, SUN, SUNS, SUP, SUPN, SWM, SWN, SYN, SYNH, TALO, TARS, TBPH, TCON, TCPC, TGB, TISI, TLK, TNDM, TPC, TPVG, TREC, TRMB, TRNO, TRUE, TRUP, TS, TSP, TT, TTGT, TTWO, TUP, TWNK, TXG, UBX, UE, UGP, UHAL, UMH, UPLD, VAPO, VEL, VGR, VIRT, VKTX, VMAR, VMEO, VNDA, VNTR, VRTV, VSH, VTOL, VVNT, VVV, WHD, WING, WK, WTS, YELL, ZD, ZY\n\n - Ex-div:\n\n  AWI, BBD, BBDO, BSMX, CATC, FELE, FMX, HESM, HOPE, NEP, STBA, WSFS\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 400K, previous: 568K)\n    - Crude Oil Imports (previous: 0.702M)\n    - Crude Oil Inventories (previous: 4.267M)\n    - Cushing Crude Oil Inventories (previous: -3.899M)\n    - Distillate Fuel Production (previous: 0.164M)\n    - Durables Excluding Defense (previous: -2.0%)\n    - EIA Refinery Crude Runs  (previous: 0.058M)\n    - EIA Weekly Distillates Stocks (consensus: -2.311M, previous: -0.432M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.3%, previous: 0.4%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Factory Orders (consensus: 0.1%, previous: 1.2%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Fed Interest Rate Decision (previous: 0.25%)\n    - Gasoline Inventories (previous: -1.994M)\n    - Gasoline Production (previous: 0.012M)\n    - Heating Oil Stockpiles (previous: -0.031M)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 62.3)\n    - ISM Non-Manufacturing Employment (previous: 53.0)\n    - ISM Non-Manufacturing New Orders (previous: 63.5)\n    - ISM Non-Manufacturing PMI (consensus: 62.1, previous: 61.9)\n    - ISM Non-Manufacturing Prices (previous: 77.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.30%)\n    - MBA Mortgage Applications (previous: 0.3%)\n    - MBA Purchase Index (previous: 275.6)\n    - Markit Composite PMI (consensus: 57.3, previous: 57.3)\n    - Mortgage Market Index (previous: 645.1)\n    - Mortgage Refinance Index (previous: 2,763.8)\n    - Services PMI (consensus: 58.2, previous: 58.2)\n    - Trade Balance (consensus: -80.30B, previous: -73.30B)\n\n^^^^2021-11-01",
        "created_utc": 1635760818,
        "id": "hiv8hui",
        "permalink": "/r/RobinHood/comments/qkan8y/daily_discussion_thread_november_1st_2021/hiv8hui/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635789618.0
    },
    {
        "author": "Investinwaffl3s",
        "body": "ANET beat, plus stock split, plus share buyback caused SOX to rip\n\nBut yeah NVDA at ATH, all day every day",
        "created_utc": 1635872110,
        "id": "hj157f3",
        "permalink": "/r/wallstreetbets/comments/ql0v5g/daily_discussion_thread_for_november_02_2021/hj157f3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635900910.0
    },
    {
        "author": "Galapagos_Tortoise",
        "body": "Fucking ANET, not sure why everyone is so quiet on this stock. Upcoming buyback and split this month. My calls are ripping rn.",
        "created_utc": 1636069246,
        "id": "hjclze9",
        "permalink": "/r/wallstreetbets/comments/qmt5z6/what_are_your_moves_tomorrow_november_05_2021/hjclze9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636098046.0
    },
    {
        "author": "jimjimsmess",
        "body": "My comments keep getting blocked.  I am not writing anymore tips and events if this doesn't go through.  I came here to get trading ideas as its impossible to discover every opportunity before its too late.  I wanted to contribute my discoveries before the events pass please give an upvote if you find value even if you have no use for the info.\nFirst stock spilt ANET coming soon, pricey stock, tech sector, exchanging 4 for 1.  Should be fun to watch even if there interest as its a lttle inflated already as expected.  Also hertz is having an ipo on nasdaq this morning at 930.am.  It was traded on the OTC markets as htzz is getting uplisted to nasdaq with there old symbol htz.  The otc close price was 32.62.  May have new interest with the uplisting especialy because 0 fee traders (like me) wont have to pay 6.95 to biy or sell it.",
        "created_utc": 1636464676,
        "id": "hjxluur",
        "permalink": "/r/stocks/comments/o7qld2/rstocks_discuss_overlooked_stocks_friday_jun_25/hjxluur/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636493476.0
    },
    {
        "author": "MensaManiac",
        "body": "How about Arista Networks...\n\nEverything is going to the cloud and backbone data transfer and switching is highly needed. Leader in switching, high growth path",
        "created_utc": 1637500191,
        "id": "hli7p4m",
        "permalink": "/r/StockMarket/comments/qyu2xk/how_to_complement_a_long_term_nvda_hold_while/hli7p4m/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1637528991.0
    },
    {
        "author": "Manfx_876",
        "body": "Are u talking about ANeT?  Hahaha I’m in the same bought. I fucked up on double checking volume and well, now I’m listing it .05-.10 below the Ask and hope someone bites. I started with about 100 different contracts Anticipating their great earnings and 4:1 split. Jokes me on. Lol no buyers.  I only have about 40 left, been seeing for a week or so. Goodluck.\n\n\nOh yea, it’s a learning lesson to be had. Don’t trade volumes with no volume.",
        "created_utc": 1637897474,
        "id": "hm43wnk",
        "permalink": "/r/StockMarket/comments/r1csbu/how_to_exit_vertical_spread_with_no_buyers/hm43wnk/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1637926274.0
    },
    {
        "author": "julukus",
        "body": "Damn ANET. Should have bought those calls . Fuck",
        "created_utc": 1635854318,
        "id": "hj01rqf",
        "permalink": "/r/wallstreetbets/comments/ql0v5g/daily_discussion_thread_for_november_02_2021/hj01rqf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635883118.0
    },
    {
        "author": "surmoiFire",
        "body": "!banbet ANET 150 2d",
        "created_utc": 1637180833,
        "id": "hl15ysz",
        "permalink": "/r/wallstreetbets/comments/qvwu4g/daily_discussion_thread_for_november_17_2021/hl15ysz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637209633.0
    },
    {
        "author": "jimjimsmess",
        "body": "Anet was a good deal.  Hertz completly robbed me of $100 trading my 10 $35 shares the day before and started the uplisting at $26. Thanks hertz,  I know to never trust a company being uplisted again.  $100 lesson I will never forget may save me thousands.",
        "created_utc": 1637313250,
        "id": "hl8h683",
        "permalink": "/r/stocks/comments/o7qld2/rstocks_discuss_overlooked_stocks_friday_jun_25/hl8h683/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1637342050.0
    },
    {
        "author": "BurnerBurnerBurns20",
        "body": "To be fair, they had a great article on Anet a few days before earnings that I ignored and had I gotten it would have made probably a 35-40% gain.",
        "created_utc": 1638270474,
        "id": "hmnep6j",
        "permalink": "/r/stocks/comments/r585l8/since_wsj_and_barrons_wrote_articles_on_now_being/hmnep6j/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1638299274.0
    },
    {
        "author": "surmoiFire",
        "body": "ANET just wow",
        "created_utc": 1635798323,
        "id": "hixd3hr",
        "permalink": "/r/wallstreetbets/comments/qkmd3z/what_are_your_moves_tomorrow_november_02_2021/hixd3hr/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1635827123.0
    }
]