[
    {
        "author": "Paul_Ostert",
        "body": "Very true.... Motorola,  xerox,  Kodak,  Ge, Gm , sears ... America is full of once great companies that become fat and happy and forget why they are in business.",
        "created_utc": 1635385402,
        "id": "hibsjrg",
        "score": 129,
        "subreddit": "stocks",
        "created": 1635414202.0
    },
    {
        "author": "sockalicious",
        "body": "Step 2:  Using comparators from other industries, while ignoring available data from representatives of the same industry such as Motorola, Texas Instruments, 3DFX, ATI, National Semiconductor, Rockwell Semi, TRW, VM Labs et cetera.",
        "created_utc": 1635142526,
        "id": "hhyg20t",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1635171326.0
    },
    {
        "author": "VeganFoodIsYummy",
        "body": "In 2011, Google wanted Nortel’s patents for 900M. But BB and others bought for $4.5B.\n\nGoogle then bought out Motorola for $12.5B.\n\nFast forward to 2016, BB looked other way when WhatsApp infringed on its patents.\n\n2018, BB sues FB (AND WINS!)\n\n“I checked my patents to see how they are doing. The one about WhatsApp’s starred messages was still alive and well. It has been cited by 109 patents including those by IBM, HP and Palantir. It is somewhat comforting to know that when the tree fell in the forest, it didn’t get uprooted entirely. Its roots still nurture new ideas. Maybe some bragging rights remain…”",
        "created_utc": 1634799619,
        "id": "hhgq17w",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1634828419.0
    },
    {
        "author": "bonafidetree",
        "body": "spy numbers refreshing like i’m on a motorola from 2006",
        "created_utc": 1633538125,
        "id": "hfme0a3",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633566925.0
    },
    {
        "author": "FlashyDisk1",
        "body": "Since the Motorola 68000 came out in 1979, Intel has always had an inferior ISA(instruction set architecture) but they just keep coming out ahead.  They even beat out all of the much faster RISC chips.  I wouldn't bet against them.",
        "created_utc": 1635184384,
        "id": "hi0ffls",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635213184.0
    },
    {
        "author": "Bobsky2",
        "body": "Take a closer look how iPhone replaced Norkia, BlackBerry, Motorola phones.\n\nIt's not about how many vehicles VW sold last year. It's about how many you can sell in the future and what kind of margin you get.",
        "created_utc": 1633218385,
        "id": "hf5s9wt",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633247185.0
    },
    {
        "author": "bungholio99",
        "body": "If you can check Lenovo, record growth discounted cause china stock.\nVery innovative and in several markets (Motorola is also Lenovo today and Fujitsu) own manufacturing so has priority during chip crisis.\nGood investments and JV (NIO, NEC,Netapp)\nBiggest Cloud Server Provider for Microsoft and SAP.\n\nIf semi-conducteur Qualcomm they are leading in Smartphone,Tablet and get used in further appliances.\n\nBaba or AMS/Flex for the risky ones and AMD/Texas Instruments/TSMC/Apple as the safe bets.\n\nAlways watch the SOX when buying Semi Conducteur\n\nhttps://www.marketwatch.com/investing/index/sox",
        "created_utc": 1634983743,
        "id": "hhq73ry",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635012543.0
    },
    {
        "author": "Paul_Ostert",
        "body": "Very true.... Motorola,  xerox,  Kodak,  Ge, Gm , sears ... America is full of once great companies that become fat and happy and forget why they are in business.",
        "created_utc": 1635385302,
        "id": "hibsbf6",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635414102.0
    },
    {
        "author": "Chippopotanuse",
        "body": "Volvo, BMW, Ford. \n\nBut at the end of the day they are making hardware (cars). I don’t know that they will trade at big multiples for just making cars. I don’t think Tesla trades at huge multiples based solely on its auto business. \n\nIt’s like investing in PC makers or cell phone makers. How is HP/Compaq/Dell/Motorola doing? Shitty probably. Or bankrupt. \n\nThe real money is in the tech and ecosystem control. \n\nAnd what ecosystem is Ford trying to build? Or Volvo? They are still just trying to make cars as far as I know. \n\nBut look to the tech giants:\n\n Facebook with its new Metaverse. \n\nAmazon with the cloud. \n\nApple with its App Store and super tightly controlled iPad/iPhone universe. \n\nAnd Tesla with its vertically integrated solar/energy storage. \n\nThose things are super scalable and provide annuity streams of income. \n\nTo the extent we get to truly autonomous cars, my guess is total auto production will drop through the floor. Why buy a car when you can rent one on demand?\n\nAnd with work from home lowering overall commutes, it will only put more downward pressure on car ownership. \n\nCars will be like cell phones in 20 years. They will be content delivery systems. With touch screens, AI, and self-driving capabilities. They will be consumer engagement devices and not just transportation.\n\nThat’s why Apple has been nibbling into autos. It fits right in to what they want - which is consumer engagement with their products for as long as possible each day so they can monetize as many interactions as possible.",
        "created_utc": 1634824147,
        "id": "hhhnw6n",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1634852947.0
    },
    {
        "author": "bananaj0e",
        "body": "Motorola could have been extremely successful in the CPU market. Their CISC 68k line of CPUs were huge, used in the Apple Macintosh, Amiga, all sorts of embedded applications... but they eventually lost the market to Intel when they took too long to develop its RISC successor. They tried to come back with the PowerPC along with IBM and Apple, but Apple was the only consumer product manufacturer to use it.",
        "created_utc": 1635426535,
        "id": "hidk8yx",
        "score": 4,
        "subreddit": "stocks",
        "created": 1635455335.0
    },
    {
        "author": "KingSurfer2001",
        "body": "TSLA longs should be also short the major automakers.\n\nThe only way to fit into the valuation is to crush and consolidate competition with Tesla being at the top.\n\nA lot like what happened in the cell phone arena i.e blackberry, nokia, Motorola etc",
        "created_utc": 1634706028,
        "id": "hhbsfpn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634734828.0
    },
    {
        "author": "Lucho358",
        "body": "I feel google market cap should be 3 or 4 times that of facebook. \n\nGoogle owns their search engine, gmail, chrome, android, youtube, stadia, google play store, google cloud, google drive, google meets, hangouts, duo, google maps, google translate, google tv, google lens, google home, google pay, google finance, adsense, adwords, google fi, pixel, webpass, google photos, motorola, nest, fitbit, waze, doubleclick, looker, deepmind, and more..\n\nFacebook owns their social media, their marketplace, messenger, whatsapp, instagram, oculus and not much more",
        "created_utc": 1634484251,
        "id": "hgzru6j",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1634513051.0
    },
    {
        "author": "mlamping",
        "body": "it’s very difficult to get a legacy company to switch to newer technology. If it were easy, aol, yahoo etc would have been google\n\nIntel would be arm or nvidia\n\nBlackberry would be Apple\n\nSony would be Samsung \n\nMotorola .., you get my point",
        "created_utc": 1633927691,
        "id": "hg6zwdh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633956491.0
    },
    {
        "author": "kookselslg",
        "body": "yeah like Motorola or blackberry. If the Automakers dont grow, they die. 3% growth annually is terrible",
        "created_utc": 1635618960,
        "id": "hio8w0h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635647760.0
    },
    {
        "author": "friendofoldman",
        "body": "Motorola flip phone was the first really popular cel phone in the US. \n\nThey sold tons of them.",
        "created_utc": 1635440608,
        "id": "hiei5cv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635469408.0
    },
    {
        "author": "Kind_Assistance2084",
        "body": "Just curious do you use stock charts indicators  like RSI MSI CSI MACD, any one of these would have told you to sell. However, firms are putting a buy on amc at 41$ with high volume",
        "created_utc": 1633102520,
        "id": "hezi4es",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633131320.0
    },
    {
        "author": "zxc123zxc123",
        "body": "&gt;intel benchmarks\n\nI love intel. I used their pentium processors as a kid. INTC is one of the first stocks that I bought as an investor. Held them since the early 2010's and added more over the years. But let's not joke. Anyone who knows anything knows that: \n\n#INTC benchmarks mean ABSOLUTELY NOTHING.\n\nINTC always has and still puts out inaccurate or non comparable benchmark test. All of the chip makers do tests in environment, in scenarios, selecting tasks, and hooked up to optimal settings for themselves.  https://wccftech.com/intel-real-world-performance-misleading-benchmarks-intel-core-vs-amd-ryzen-cpus/\n\nINTC isn't going back up until they catchup on the chip design, foundry, and manufacturing. Other chip designers are already finished with their 7/5nm and working on &lt;5/3nm. \n\nSaying INTC 10nms are faster than competitors would be like Motorola saying the Razr is better than the Ipod in 2010. It means literally nothing because Iphone 3 had basically killed all the dumb-smart phones and Motorola will be bought up by google in a year.",
        "created_utc": 1635365461,
        "id": "hiahgrl",
        "score": 1,
        "subreddit": "investing",
        "created": 1635394261.0
    },
    {
        "author": "tobesteve",
        "body": "My Motorola has fingerprint on the power button. The power button is on the side, so it's thin and doesn't take any room on front of the phone. Samsung S9 that I had, had the fingerprint on the back, so I had to pick up the phone if it was laying. Anyway, it's nice to not have to pick up the phone, and to not have it take room in front. Do there are still improvements being made.\n\nIt's not worth a new phone purchase, but I got it as a promo and my old phone was starting to get issues.",
        "created_utc": 1635683896,
        "id": "hirakgf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635712696.0
    },
    {
        "author": "whoareyouwhoisme",
        "body": "history\n\n1) When iphone started selling, they had sales much lower than the traditional Nokia, Motorola or blackberry. People were laughing at the pathetic sales compared to smartphone and traditional phones. Comments like “who wants to to swipe things, people want real keyboards”\n\n2) Gas cars are not the future, whatever sales they have today will continue to get reduced because there is a big push from all those countries who want less pollution. So your going to see more claims from countries of by X year no more gas cars. Look at cigarette industry as a perfect example. Back then you can smoke anywhere and now you got to smoke in designated sections. Is anybody saying let’s invest into this giant cigarette industries..they will be gone as soon as marijuana continues to be legalized. It’s not a matter of will, it’s when.\n\n3) anybody who doesn’t think autonomous driving isn’t our future…needs to group with the same people who said Apple iphone was doomed to fail. \n\nPeople who say Tesla is inflated doesn’t understand the multiple revenues it has enabled vs the traditional car companies. When people laughing about “Apple App Store”…..well between Google and Apple it enables $32 billion sales revenue just for Apps today and growing. If you understood Tesla multiple possible revenue streams (besides just selling cars and maintenance)…you can see they have multiple business programs that they declare that other car manufacturers can use. For example, maybe everyone may adopt Tesla own App system, autonomous driving in the future. \n\nThe is only competitor who has this same strategy and they are not based in USA. Nio.. However NIO strategy is really copying how Apple did it with the iPhone.\n\nWell you may say, Ford or Volvo or some other traditional car supplier can do the same.\n\nThose traditional car companies are very good at building and maintaining their cars but do you think those car companies can build an ecosystem like how the Iphone turned the phone handset industry upside down? That is why the valuation of Tesla is so high and that is why players like Apple are looking into this industry. They want that eco-system, that’s the meat of the revenues (high margin profits).\n\nAnyway…that’s my view.",
        "created_utc": 1633230976,
        "id": "hf6iscv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633259776.0
    },
    {
        "author": "Quirky-Suggestion865",
        "body": "Well no, not really. I think that’s a very broad oversimplification. Like saying bicycles are basically boats because they can both carry people.  But let’s just say yes. \nThe difference is that optical chips are currently very costly and labor intensive. Built one at a time, each requiring active alignment. POET can produce them at wafer scale, with existing  semiconductor foundry techniques. 100+- on each wafer meaning 1000’s per day. MSI would more likely end up being a customer( not saying they WILL be) rather than a competitor.",
        "created_utc": 1634740081,
        "id": "hhd5ise",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1634768881.0
    },
    {
        "author": "SupplyChainMuppet",
        "body": "The charts on my Motorola Mobile agree with you.",
        "created_utc": 1634780966,
        "id": "hhfv5dd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634809766.0
    },
    {
        "author": "xtow5",
        "body": "Lol at that Motorola acquisition. What a fuck up that was",
        "created_utc": 1635051708,
        "id": "hhttnpi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635080508.0
    },
    {
        "author": "gdren",
        "body": "Dude. Stop. I promise you EVs heat up faster.\n\nComparing 2021 EVs to a 2010 prius is like comparing your new iPhone to a Motorola razor.  Way different.",
        "created_utc": 1635258636,
        "id": "hi49qjv",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1635287436.0
    },
    {
        "author": "WallabyUpstairs1496",
        "body": "Very true.... Motorola, xerox, Kodak, Ge, Gm , sears ... America is full of once great companies that become fat and happy and forget why they are in business.",
        "created_utc": 1635453928,
        "id": "hiffxcn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635482728.0
    },
    {
        "author": "Gingerescapeplan",
        "body": "Betting on Volkswagen over Tesla right now is like betting on Motorola over Apple in 2007. It shows you have a poor understanding of what the company even does.",
        "created_utc": 1633886667,
        "id": "hg4imr3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633915467.0
    },
    {
        "author": "Cannonjat",
        "body": "Yall had iPhones before the upgrade? I had a Motorola 1 until I bought an iPhone 12 lol. All though I am a uni student.",
        "created_utc": 1635696468,
        "id": "hirzvlk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635725268.0
    },
    {
        "author": "pgaasilva",
        "body": "As a person who's followed the latest technology for a while, I have never seen much success from the internet. It reminds me a little of the Motorola dynaTAC, and I get that they aren't the same, and the initial experience with chat rooms can be mindblowing, but do people actually use these tools daily? [This just seems like one of the dumbest rebranding moves I've seen, so it makes me think there is some other rationale behind it.](https://www.youtube.com/watch?v=eAagtcAup0o)",
        "created_utc": 1635540189,
        "id": "hik6x09",
        "score": 0,
        "subreddit": "stocks",
        "created": 1635568989.0
    },
    {
        "author": "WolfPackWSB",
        "body": "So they basically take fiber optics and utilize it in small devices? Sounds like MSI to me for the past 4 years.. Know your company and it’s patented technology before rolling dice on Pinks",
        "created_utc": 1634707386,
        "id": "hhbuex9",
        "score": 0,
        "subreddit": "StockMarket",
        "created": 1634736186.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "You can't *think* cash holdings and proven consumer preference into existence. You can't *think* brand price premiums into existence.\n\nYour argument is that they're the Chinese Nokia, or the Chinese Motorola, not the Chinese Apple.",
        "created_utc": 1635112521,
        "id": "hhwxhrx",
        "score": 0,
        "subreddit": "StockMarket",
        "created": 1635141321.0
    },
    {
        "author": "sockalicious",
        "body": "The company is past its prime.  If Cramer hadn't pumped it a few months ago - while freely admitting he wasn't all that clear on what it does now that rappers and drug dealers don't use its core product anymore - no one on here would ever have heard of it, let alone bought calls.  \n\nI mean, Ericsson, Nokia, Motorola Mobility, VoiceStream Wireless.  Qwest.  Global Crossing.  It's a time that's passed.",
        "created_utc": 1634573137,
        "id": "hh4ewpx",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1634601937.0
    }
]