[
    {
        "author": "Chippopotanuse",
        "body": "One reason is that they aren’t static indexes. They are dynamic survivor bias indexes. What does that mean? \n\nIt means they replace losers with winners. Go look at the Dow or S&amp;P components from 1980 and see how the castoffs have fared. \n\nFor the Dow, changes used to be VERY rare. From 1959-1976 there were ZERO changes. \n\nNow? It changes its components several times\na year. \n\nIf it didn’t keep doing this, it wouldn’t “perform”\nNearly as well.\n\nLook at how shitty GE has done over the past three years. They used to be THE corporate bellwether of the US economy. But GE’s plunge didn’t hurt the Dow at all. It was removed as a component in the middle of 2018. \n\nIn March of 2015 the Dow added Apple to replace AT&amp;T (once so big and fearful it had to be busted up by regulators, but is now a dogshit dividend stock). That one change alone did wonders for the Dow average. \n\nIn Sept 2013, Nike, Goldman Sachs, and Visa replaced such dogs as Hewlett-Packard and Alcoa.\n\nIn 2009, Cisco Systems replaced GM.\n\nAnyways, you get the point. The Dow and S&amp;P, by definition, will always go up over time. They will simply drop dog sticks with no future and replace them with up and coming stalwarts. \n\nI’ve often looked, but have never found, a report that would show how the Dow and S&amp;P would have performed if they didn’t modify their components and always stack the decks. \n\nTLDR: the Dow and S&amp;P change the component stocks to always contain far more winners than losers. They will rise over time. They don’t reflect the more broad stock market as a whole, nor do they reflect how the average American family is doing economically. They just reflect a basket of “winning” stocks.",
        "created_utc": 1626608826,
        "id": "h5md3jc",
        "score": 47,
        "subreddit": "stocks",
        "created": 1626637626.0
    },
    {
        "author": "Extremely-Bad-Idea",
        "body": "HPQ has been disappointing investors for the last two decades.  Today's HPQ price is the same as was in April 2000.\n\nHPQ made several ill fated acquisitions over the years including Compaq, EDS, and 3Com.  HPQ always bought companies that looked promising on the surface, but consistently failed to deliver on the bottom line.  That pattern of bad decision making remains to this day.  Look how they failed to create two distinctive company names when they spun off HPE.  Both HPQ and HPE are named Hewlett Packard, LOL.  It is staggering how stupid their leadership is.\n\nHPQ is also married to its desktop, laptop, and printing businesses to the exclusion of almost everything else.  These are mature, low profit product lines.  It is not a growth business.  In short, HPQ has been dead money for 20 years and is going nowhere.",
        "created_utc": 1626498615,
        "id": "h5hhg1f",
        "score": 8,
        "subreddit": "stocks",
        "created": 1626527415.0
    },
    {
        "author": "DrakonIL",
        "body": "No, it's $HPE that won't print because the yellow is empty.",
        "created_utc": 1627407359,
        "id": "h6qaxfy",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1627436159.0
    },
    {
        "author": "FinndBors",
        "body": "&gt; This ain’t like 2000\n\nIn a ton of valuation metrics they are worse than any other time in history other than 2000. And when people think of 2000, they think of pets.com being ridiculous. Those shit companies were not in any index and pets.com was 300-400 million market cap at its peak (which it held for a very short time). You can equate pets.com to companies like NKLA which make gravity powered trucks. NKLA was ~ 30B market cap at its peak -- and it's still worth 5B+. Pets.com actually had a business / revenue, tons of SPACs are little more than post series A companies, all of them worth well over a billion.\n\nThe \"real\" megacap tech companies of 2000 were hewlett packard, microsoft, ibm, csco, intel, sun, compaq, etc. Their P/E ratios are much closer to the FAANGs of today. And most of the peak P/E ratios happened after a series of bad earnings.\n\nThe only thing that is legitimately different now than before is low interest rates. Which is why inflation / fed reaction is a genuine serious fear.",
        "created_utc": 1626571480,
        "id": "h5kueqq",
        "score": 4,
        "subreddit": "stocks",
        "created": 1626600280.0
    },
    {
        "author": "harderror",
        "body": "Jesus christ, I'm regretting the day I bought HPE in the high 15's like an idiot. Shit has been red ever since.",
        "created_utc": 1626208230,
        "id": "h52t57q",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1626237030.0
    },
    {
        "author": "SlowRyder",
        "body": "Thank you for the additional information.\n\n\\&gt;&gt;  *\"One million physical qubits is the minimum necessary to do Shor's algo. I advice investors to invest in qc AFTER such a breakthrough occurs, not BEFORE.\"*\n\nI've read before that most disagreements in investment threads are the result of the investors involved playing different games, and I fully agree. It sounds like you have a relatively conservative investment philosophy and prefer not to make big early stage bets (which is perfectly fine/logical).\n\nMeanwhile, Google, Amazon, Samsung, Lockheed Martin, Bosch, Hewlett Packard, Airbus, Softbank, Bill Gates, Michael Dell and numerous others are playing a different game and not heeding your advice to wait to invest until after such a milestone is met.\n\nThose waiting to buy into Tesla at or below their 2010 IPO-week low never got the chance (Tesla's valuation after the first trading day was $2.22bn...they had sold just 1,063 cars at that point and their critics/doubters were many). The returns for those who waited until they hit certain milestones were still decent, but they were orders of magnitude lower than those who got in during the week after IPO.",
        "created_utc": 1625506064,
        "id": "h45br9a",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1625534864.0
    },
    {
        "author": "LambdaLambo",
        "body": "&gt; Those shit companies were not in any index and pets.com was 300-400 million market cap at its peak (which it held for a very short time). You can equate pets.com to companies like NKLA which make gravity powered trucks. NKLA was ~ 30B market cap at its peak -- and it's still worth 5B+\n\nThat kinda helps my point though. NKLA tanked but it has no correlation to the overall stock market, and the whole stock market went up in fact. Same with the entire SPAC bubble. Yes it was a bubble, but it popped and the market moved on its way without missing a beat. \n\n&gt; The \"real\" megacap tech companies of 2000 were hewlett packard, microsoft, ibm, csco, intel, sun, compaq, etc. Their P/E ratios are much closer to the FAANGs of today. And most of the peak P/E ratios happened after a series of bad earnings.\n\nEven then the PE ratios are not the same. MSFT in it's peak in 1999 had a PE ratio of ~82, it now has a PE ratio of ~35. \n\nI'm not gonna say that *every* company today is fine. Many are not (including NKLA). But the 2000 was endemic throughout the market (i.e. say \"internet\" and stock 10x'd at ipo). Today the market is much more varied and plenty of companies trading at high multiples do so because they're growth is very real.\n\nSorta unrelated but I personally believe tech got an insane boost from covid which is/will be driving huge digitalization efforts and  accelerate growth for many saas/cloud centric companies.",
        "created_utc": 1626578182,
        "id": "h5l7hzl",
        "score": 2,
        "subreddit": "stocks",
        "created": 1626606982.0
    },
    {
        "author": "maybeex",
        "body": "Hewlett Packard. It was the largest tech company in the world then a few bad mistakes and tanked. Your thought process is not wrong but there is no way to predict future. Also AIG tanked as well in 2008. You can't compare now and 2008 but things can go south and it can tank fast. Always put a stop loss if you are investing in tech stocks. Good luck. \n\nJust fyi, I have Amazon and apple stocks in my portfolio.",
        "created_utc": 1625182380,
        "id": "h3qr3cv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625211180.0
    },
    {
        "author": "Only-Doctor6140",
        "body": "HPE , SENS , AAPL , NOK \n\nK go",
        "created_utc": 1625779669,
        "id": "h4iqoav",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625808469.0
    },
    {
        "author": "AMediocreWhiteGuy",
        "body": "Nokia, GE and Hewlett-Packard are some of my better stocks at the moment.",
        "created_utc": 1625503676,
        "id": "h4570td",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625532476.0
    },
    {
        "author": "Btwn3n20charachters",
        "body": "Yea I didn’t see anything that should’ve caused that spike. The chip industry has been a little crazy due to mass shortages and you have companies like NVDA and DELL on insane runs. As for HPE, check out the 5 year chart. I think the stagnation is just them returning to pre covid levels and flattening out.",
        "created_utc": 1626170850,
        "id": "h50rwg6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626199650.0
    },
    {
        "author": "TrymPet",
        "body": "Good. I like your theory. Nothing in financials correlates with the spike in March. Is this the basis on which you deduced your conclusion?\n\nHowever, I see both DELL and HPE have stagnated since March. Either all three companies were overvalued, or something else is affecting the sector (chip industry?).",
        "created_utc": 1626170393,
        "id": "h50reif",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626199193.0
    },
    {
        "author": "DynastyNA",
        "body": "I don’t think we are allowed to talk about this on this subreddit but I am obsesssed with $CWGYF (Carnegie clean energy)\n\nRealistically they probably won’t ever be shit but they are a renewable marine energy company based in Australia that developed a technology called CETO (which is a reference to some mythological figure) that uses machine learning to predict the strength/magnitude of tidal waves that will be arriving up to 30 seconds in the future. By accurately estimating the magnitude of the future tidal wave they can calibrate their CETO device to generate a lot more energy from the wave (I still don’t understand how that works)\n\nFor a micro cap penny stock I think their future outlook is actually pretty good. They have a contract to power one of Australia’s largest naval bases, they got a $50 million grant from Microsoft to help develop the CETO tech (and I think they get help from Microsoft’s ML devs too), and I know they have a contract with Hewlett-Packard. They also are debt free I am pretty sure and recently increased their cash reserves. \n\nI just love the fact I own 109k shares for like 200 dollars lol and the whole predicting future tidal waves thing I think is cool as fuck\n\nIf you wanna learn more about them this sub is very tiny but people talk about the company on r/CarnegieCleanEnergy",
        "created_utc": 1625897045,
        "id": "h4obvg7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625925845.0
    },
    {
        "author": "SmokedHamm",
        "body": "HPE is relatively cheap and has .48 dividend.  Been holding for 2 years.",
        "created_utc": 1627184921,
        "id": "h6ft2he",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627213721.0
    },
    {
        "author": "l3thaln3ss",
        "body": "CRSR, GE, and controversial/borderline ones: HPE and IBM.",
        "created_utc": 1627486677,
        "id": "h6uauht",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1627515477.0
    },
    {
        "author": "Only-Doctor6140",
        "body": "I’m getting completely sodomised on HPE &amp; SENS",
        "created_utc": 1625656429,
        "id": "h4cbiwx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625685229.0
    },
    {
        "author": "Ironleg01",
        "body": "They will resume dividends, but if you are after dividends there are plenty of low PE, high yield options. Many utilities have great dividends and are low PE, banks too are very low PE and high dividend. Heck you even have tech (legacy) trading at low PE and paying high dividend like HPQ, HPE, IBM, etc. I would think that GM is fairly priced and is not a bargain deal at the moment.",
        "created_utc": 1626814183,
        "id": "h5x589h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626842983.0
    }
]