[
    {
        "author": "smokeyjay",
        "body": "I own LRCX.  Most recent added more at 600.  Sold off my TSM to consolidate my stock portfolio.\n\nI think AMAT &amp; KLAC are also good buys.  ASML is a good company but richly valued imo.\n\nHonestly a sector ETF might work for most ppl.  These are long term holds and not really WSB material.  I don't know how I feel about any positive short term trends - the whole world knows about chip shortages.",
        "created_utc": 1630687459,
        "id": "hbgrybc",
        "permalink": "/r/wallstreetbets/comments/ph7zba/looking_for_chip_shortage_buys_here_are_the/hbgrybc/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630716259.0
    },
    {
        "author": "philosoraptor80",
        "body": "It's actually already more wide ranging. [Apple is moving some of the personal data of Chinese customers to a data center in Guiyang that is owned and operated by the Chinese government](https://www.cpomagazine.com/data-privacy/icloud-data-turned-over-to-chinese-government-conflicts-with-apples-privacy-first-focus/). \n\n&gt; Doing business in China usually means capitulation to the terms of the Chinese government, and foreign companies interested in this highly lucrative market generally do not push back much (if at all). Those terms include allowing the government access to any personal data that it wants that is stored on servers located within China. \n\nThe CCP is very concerned about dissent, and has already cracked down on powerful figures and companies that it sees as a potential threat. [See Jack Ma for example](https://www.abc.net.au/news/2021-08-02/chinas-war-on-everything-turns-towards-its-own-tycoons-verrender/100341464). Since cloud data has enormous information about potential dissent, I expect this to be an even bigger target in the future, and cloud companies will be targets.\n\nChina is also framing rules to ban internet firms whose data is deemed to pose a potential security risk from listing abroad. [Source](https://www.reuters.com/technology/china-targets-us-ipos-algorithms-cloud-latest-tech-takedown-2021-08-27/) I could forsee the CCP banning BABA from foreign listings. \n\nHere are two articles worth reading.\n\n[First article why to avoid Chinese stocks](https://www.fool.com/investing/2021/08/01/2-big-reasons-not-to-invest-in-chinese-stocks-now/)\n\n[Second article](https://www.fool.com/investing/2021/08/18/3-more-reasons-not-to-invest-in-chinese-stocks-now/)\n\nTo be honest I think there are just much safer investments, that are much more likely to pan out, in the US. US companies prioritize investors, often over their own workers. Chinese companies don't care so much about the investors in comparison, which is one of the many reasons company prices do not seem to reflect underlying value there. I'm still looking for a good explanation why FXI, basically China's Dow, hasn't risen since 2009.",
        "created_utc": 1630480361,
        "id": "hb5s25q",
        "permalink": "/r/wallstreetbets/comments/pfbqjy/teslas_market_cap_is_73033_billion_with_a/hb5s25q/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630509161.0
    }
]