[
    {
        "author": "Prestigious_Count_62",
        "body": "They said the same thing about the Motorola RAZR and Nextel flip phones back in the day.\n\nYou say that until a few years from now when you can have an eye augmentation and an ear implant and won’t need a phone anymore...",
        "created_utc": 1619313510,
        "id": "gvrs8rt",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1619342310.0
    },
    {
        "author": "bsthedog",
        "body": "Wait.. But QS isn't? They basically have an 8 year out production schedule on some battery tech. That's like if motorola said they were finally gonna release their first touch screen phone 8 years after the ipod touch came out. Sure, they're looking ahead of their competition, but the EV landscape is hardly even 8 years old to begin with. Plenty of shit could happen.",
        "created_utc": 1618523983,
        "id": "gunmcmj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618552783.0
    },
    {
        "author": "Risen_In_3",
        "body": "Motorola has one that attaches and is crystal clear",
        "created_utc": 1619512373,
        "id": "gw129ef",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619541173.0
    },
    {
        "author": "TennHenny520",
        "body": "\"I've seen this before\":\n\nThis company had beyond popular phones that lost market share due to trendier products entering the space. This resulted in a pivot to a software company that YOY beats the D&amp;J and NASDAQ. \n\nWhat is **Motorola?**\n\nNow is the time to buy BB as a long-term play IMO. Severely under-valued stock, just like Motorola after they no longer had a popular consumer product.",
        "created_utc": 1618932966,
        "id": "gv7no9x",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618961766.0
    },
    {
        "author": "v6r",
        "body": "I dont go on my laptop anymore I mostly use my phone. My laptop is a 9 year old msi laptop. It had good internal hardware for the price but the rest was cheaply made for sure",
        "created_utc": 1619559122,
        "id": "gw3ly75",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619587922.0
    },
    {
        "author": "FinndBors",
        "body": "Admittedly, I haven’t looked at Ford and other legacy automakers detailed financials, but when you have a large disruption in an industry (shift to EV), most of the incumbents typically fade to irrelevance.\n\nJust look at the shift to smartphones. Nokia, Motorola, etc were king of mobile phones. Now they are just a shadow of themselves. Arguably carmakers have it worse with their huge supply chain and capital investments that need to be shifted.\n\nI wouldn’t bet on any car maker right now, unless you have very high conviction that they will come out on top in the shift to EVs.",
        "created_utc": 1619712460,
        "id": "gwb6ynv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619741260.0
    },
    {
        "author": "SoapHorse69",
        "body": "Aircraft autopilot is different though, there’s a lot less aircraft in the sky than cars.  The average pilot has more training than the average driver, and (hopefully) none of them are intoxicated.\n\nI think autonomous driving is a serious technology.  It seems crazy now but I think only because it’s not widely adopted.  The more autonomous cars there are on the road, the better autonomous driving becomes.  More human drivers = more variables and unpredictability for computer to take into account.  If all or most cars are autonomous and talking to each other in real-time though, it’s a lot easier to react to road conditions and adapt accordingly.\n\nI’m not saying that cars nowadays are analog, but the perception is that they are.  The first iPhone technically didn’t do anything technologically revolutionary, but it did bundle all these existing digital technologies into one UI (tablets, MP3 players, GPS, etc), and off of that Apple was able to leverage their software capabilities.  I think saying Tesla = Ford = GM is like saying Apple = Nokia = Motorola.  No technology is new and we all stand on the shoulders of giants, but we need to look at how these existing technologies are being utilized or sold in new ways.",
        "created_utc": 1617468394,
        "id": "gt9d2e5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617497194.0
    },
    {
        "author": "mr_blockchain_",
        "body": "Yahoo “finance” (more yahoo than finance, if you ask me) just put a hit piece on MicroVision\n\nLuckily, I’ve been DD’ing the fuck out of this stock, and can tell you that the timing of this article is more than troubling\n\nMVIS is on a verge of a breakthrough announcement in not one, not two, but three different verticals:\n1. LiDAR + EV cooperation with either MSFT/AAPL/or WVAGY\n2. Giant, and I mean giant, patent moat that they are sitting on, as it’s gaining value, in billions (think Motorola being bought by Google for their patent moat)\n3. The $22 billion dollar (just the initial leg of this contract, probably hundreds of billions when all said and done, once other branches and UN follows suit, like they’ve done in the past) with MSFT for the IVAS (augmented reality unmanned drone control goggles, or simply - remote digits vision goggles)\n\nThe last point happened just two days ago, and will be officially confirmed only next week, while the other 2 points are having announcements in Mid April.\n\nSo why a hit piece based on “historical averages”? Why now?\n\nThis is a 5x bagger if you play straight stocks, and possible breakout 500x bagger if you know what you are doing with debit call spreads.\n\nPrice now is $15\nPrice target is $75 (with buyout announcement possibly taking it to $150-$200)\n\nRead the hit piece\nInverse the hit piece",
        "created_utc": 1617462134,
        "id": "gt919d2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617490934.0
    },
    {
        "author": "AlexMile",
        "body": "  Iron making ape salutes you. We also utilize horse, pig and dog sounds (but ape is most popular), especially if someone is not so quick to respond on motorola when his name is called.",
        "created_utc": 1617276203,
        "id": "gt0q76q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617305003.0
    },
    {
        "author": "oli-sonyeon",
        "body": "Custom Built. It has a msi H170a gaming pro motherboard. 16gb ram. And the gpu i already mentioned. And a i5-6500 3.2ghz\n\nI know its most likely time to just build a new system.",
        "created_utc": 1619067952,
        "id": "gveutvr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619096752.0
    },
    {
        "author": "mr_blockchain_",
        "body": "It's not about revenue, it's about patent value and acquisition price. Think Google buying Motorola for the patent moat.",
        "created_utc": 1617490899,
        "id": "gtajwwu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617519699.0
    },
    {
        "author": "roccnet",
        "body": "Motorola G series is 1/10th the price of an iphone and work just as well I'd not better with battery life of 24+ hours lol",
        "created_utc": 1619089909,
        "id": "gvfjh4t",
        "score": 1,
        "subreddit": "investing",
        "created": 1619118709.0
    },
    {
        "author": "onezerozeroone",
        "body": "&gt; Aol sold 800 patents, kodak sold 1,100 patents, Motorola sold 7,500 patents\n\nWhat happened to their prices immediately following the sales, though? \n\nDid it add those 100's of millions to their market cap overnight?",
        "created_utc": 1619403741,
        "id": "gvvwzys",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619432541.0
    },
    {
        "author": "NeitherMedicine4327",
        "body": "Who needs an ETF when Motorola is here. 🧐\nPlus low Volatility, Low margin maintenance.",
        "created_utc": 1617669271,
        "id": "gtilm6e",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1617698071.0
    },
    {
        "author": "usaf_photog",
        "body": "You’re now probably the majority share holder.",
        "created_utc": 1619309872,
        "id": "gvrlspz",
        "score": 4412,
        "subreddit": "wallstreetbets",
        "created": 1619338672.0
    },
    {
        "author": "officialjustinochoa",
        "body": "Now reality can be whatever I want it to be",
        "created_utc": 1619310648,
        "id": "gvrn6s9",
        "score": 2317,
        "subreddit": "wallstreetbets",
        "created": 1619339448.0
    },
    {
        "author": "DJchalupaBatman",
        "body": "I can tell you right now, if this thing goes back to $40 I’m gonna buy so many fucking shares...",
        "created_utc": 1619214569,
        "id": "gvm6c73",
        "score": 1102,
        "subreddit": "wallstreetbets",
        "created": 1619243369.0
    },
    {
        "author": "Scipion",
        "body": "So far I have, video game store that doesn't sell video games, a phone company that was never really popular, closed movie theaters, intangible currency, intangible dog currency, and now a laser company with 50 employees.",
        "created_utc": 1619622855,
        "id": "gw6i4v8",
        "score": 1060,
        "subreddit": "wallstreetbets",
        "created": 1619651655.0
    },
    {
        "author": "funksolebrotha",
        "body": "Whoever sold you these is refreshing their computer right now to make sure it's real and not a glitch.",
        "created_utc": 1619639996,
        "id": "gw7n9v3",
        "score": 771,
        "subreddit": "wallstreetbets",
        "created": 1619668796.0
    },
    {
        "author": "doubleknottedlaces",
        "body": "RIPPING THE FATTEST BOWL TO BEGIN THE PREGAME RIGHT NOW. LETS FUCKING GO",
        "created_utc": 1618604542,
        "id": "gurk1ja",
        "score": 551,
        "subreddit": "wallstreetbets",
        "created": 1618633342.0
    },
    {
        "author": "Bench-Smart",
        "body": "61 now. If they’re in, I’m in.",
        "created_utc": 1618519076,
        "id": "gunbg5t",
        "score": 549,
        "subreddit": "wallstreetbets",
        "created": 1618547876.0
    },
    {
        "author": "kernelle",
        "body": "I mean the fact he exercized is no surprise to anyone. But he bought 50k more at market. Now THAT is certified diamond balls.",
        "created_utc": 1618607059,
        "id": "gurppf1",
        "score": 520,
        "subreddit": "wallstreetbets",
        "created": 1618635859.0
    },
    {
        "author": "yamaha4fun",
        "body": "I was a millionaire once, didn't like it, sold everything at a loss. Now I am a poor, but I appreciate egg in my ramen!",
        "created_utc": 1619498892,
        "id": "gw0m6m5",
        "score": 487,
        "subreddit": "wallstreetbets",
        "created": 1619527692.0
    },
    {
        "author": "jasonpurdy17",
        "body": "Dang...now I want one",
        "created_utc": 1619309874,
        "id": "gvrlsuv",
        "score": 468,
        "subreddit": "wallstreetbets",
        "created": 1619338674.0
    },
    {
        "author": "realbeats",
        "body": "\"Final update\" The end of an era. Big thank you from all of us. Hopefully its clear to everyone that DFV can't post updates from here on in, if / when he sells any, the panic and mass sell off of retail following could be seen as influencing etc. This is a glorious end to the journey, now its up to us to decide where our own moons will be 🚀",
        "created_utc": 1618605373,
        "id": "gurlz8z",
        "score": 459,
        "subreddit": "wallstreetbets",
        "created": 1618634173.0
    },
    {
        "author": "Sometimes_Stutters",
        "body": "Let’s do some math here...Lets say AMC takes off, and against all odds reaches $26.55. Great! Theoretically you break even...Now let’s say AMC performs even better reaches $30. Your holdings would be worth approximately (30-26.55)x(120x100)=$41,400.\n\nAlternatively, you could invest your $18600 at around $10, and when it hits $30 your holdings would be worth $55,800. So really, this is a bad move.",
        "created_utc": 1619626794,
        "id": "gw6rn8v",
        "score": 419,
        "subreddit": "wallstreetbets",
        "created": 1619655594.0
    },
    {
        "author": "slash_sin_",
        "body": "I love DFV and wish he can keep on streaming after this. The man was legit streaming to a handful of people for hours. Now the whole world knows his name",
        "created_utc": 1618945091,
        "id": "gv8h4cd",
        "score": 397,
        "subreddit": "wallstreetbets",
        "created": 1618973891.0
    },
    {
        "author": "acceler8td",
        "body": "I hate when people have opposing views and now I, as someone who can't think for himself, don't know what to do",
        "created_utc": 1619605476,
        "id": "gw5n91a",
        "score": 395,
        "subreddit": "wallstreetbets",
        "created": 1619634276.0
    },
    {
        "author": "cjtaylor8281",
        "body": "I said it in the 80's and I'll say it now, the best investments are RadioShack, Toy's R Us, and K-Mart.",
        "created_utc": 1619657534,
        "id": "gw8pjmn",
        "score": 375,
        "subreddit": "StockMarket",
        "created": 1619686334.0
    },
    {
        "author": "tianavitoli",
        "body": "right now there's a hooker chugging a fat sour milk smelling cock looking up at your office window thinking \"*they lay off anymore people, there's gonna be more people out here sucking dick. it's gonna be a buyers market. i'm gonna have to start doing anal just to compete. a girl like me shouldn't have to do anal, my body's not built right for it. you gotta make sure to get enough fiber in your diet. you gonna have regular clients, you better stay regular in your ass pussy. gonna have to start doing squat thrusts, to strengthen up my shit pussy. you can't afford to get all loosy goosey in your ass pussy in a down economy.*\"\n\nsomething like that.",
        "created_utc": 1619640850,
        "id": "gw7pa7v",
        "score": 330,
        "subreddit": "wallstreetbets",
        "created": 1619669650.0
    },
    {
        "author": "thelastzionist0404",
        "body": "It means the amc is harder to catch than a greased up naked deaf guy now.",
        "created_utc": 1619560493,
        "id": "gw3oyr4",
        "score": 322,
        "subreddit": "wallstreetbets",
        "created": 1619589293.0
    },
    {
        "author": "Force_Professional",
        "body": "Wow, Apple is smoking it. Apple is raking in more than $1 billion revenue per day now and with a gross margin at 42.5%, that is almost $420 million per day, $17.5 million dollar per hour, almost $300k per minute, and $5k every second.",
        "created_utc": 1619646080,
        "id": "gw81kj5",
        "score": 298,
        "subreddit": "investing",
        "created": 1619674880.0
    },
    {
        "author": "sokpuppet1",
        "body": "Everyone needs to take a breath and digest what this means. \n\nOne of the biggest knocks against GameStop was its debt. Now that debt is gone. Wiped away. \n\nThe old management is out the door. Now comes the Cohen crew which has not been secretive about what they want—to make GameStop into a gaming powerhouse—online, console, mobile, esports. \n\nCan they do it? Cohen did it with Chewy, which somehow beat Amazon to the online pets everything market. \n\n At $300 a share this would be a 25 billion dollar company. That is not unreasonable if GameStop hits its ambitious goal. For comparison, Chewy has a market cap of 34 billion.",
        "created_utc": 1619485491,
        "id": "gvzysjr",
        "score": 284,
        "subreddit": "stocks",
        "created": 1619514291.0
    },
    {
        "author": "13thMasta",
        "body": "3 years ago I used to do the same thing, instead it was an addiction to substances. Now I'm hooked on healthy living and buying stocks, also watching hedgies bleed.",
        "created_utc": 1617990529,
        "id": "gtyee54",
        "score": 250,
        "subreddit": "wallstreetbets",
        "created": 1618019329.0
    },
    {
        "author": "StrikingHoneydew8420",
        "body": "Well that’s why RC stepped in. $GME has been a slush fund for Execs for year now, but it ends now. Power to the players! 🚀",
        "created_utc": 1618452927,
        "id": "guk7jnb",
        "score": 247,
        "subreddit": "wallstreetbets",
        "created": 1618481727.0
    },
    {
        "author": "DrEvil007",
        "body": "4 fucking dollars! Can you imagine how much money I'd have right now if I had gotten in on *then* instead of at $330?!?!?",
        "created_utc": 1618631458,
        "id": "gusz296",
        "score": 241,
        "subreddit": "wallstreetbets",
        "created": 1618660258.0
    },
    {
        "author": "Howie_Doohan",
        "body": "No worries scro! There are plenty of tards out there living really kickass lives. My first wife, was tarded. She's a pilot now.",
        "created_utc": 1619660329,
        "id": "gw8vdo3",
        "score": 236,
        "subreddit": "wallstreetbets",
        "created": 1619689129.0
    },
    {
        "author": "xMriLLeST",
        "body": "REMEMBER ALL THAT WE’VE BEEN THROUGH. Don’t be a fucking paperhand now. We’re going to the moon boys!",
        "created_utc": 1619472946,
        "id": "gvz96lt",
        "score": 220,
        "subreddit": "wallstreetbets",
        "created": 1619501746.0
    },
    {
        "author": "Chevysquid",
        "body": "Pretty much. Some buys were better than others. And added some more cash here and there. Also have to know that the last couple years were rough, was down under a dollar for quite a while and I bought more (against what was really good judgment). Paid off now though.",
        "created_utc": 1619497769,
        "id": "gw0kkhk",
        "score": 199,
        "subreddit": "wallstreetbets",
        "created": 1619526569.0
    },
    {
        "author": "Ego99",
        "body": "I would be shitting myself right now if I was shorting AMC",
        "created_utc": 1618456783,
        "id": "gukej3i",
        "score": 192,
        "subreddit": "wallstreetbets",
        "created": 1618485583.0
    },
    {
        "author": "FM98_GHIF",
        "body": "For those wondering why it’s the final update: \n\nIt probably means that he’s done because it’s up to all of us to hold now. There’s nothing else he can do. \n\nBasically maxed out on shares. He can’t post when he sells because that will be market manipulation. And it’s not really anyone else’s business how much he makes in the end. \n\nAll anyone can do now is buy what you can and hold. Just like him. \n\nHe’s just one of us now.",
        "created_utc": 1618605145,
        "id": "gurlgo7",
        "score": 187,
        "subreddit": "wallstreetbets",
        "created": 1618633945.0
    },
    {
        "author": "LightMeUpPapi",
        "body": "r/wsb used to be people who sorta understood investing doing dumb things\n\nNow it’s people who have no understanding of investing at all doing dumb things lol",
        "created_utc": 1619639710,
        "id": "gw7mlb2",
        "score": 184,
        "subreddit": "stocks",
        "created": 1619668510.0
    },
    {
        "author": "Imaginary-Jaguar662",
        "body": "Shit, I hose my own WP site every now and then without even meaning to",
        "created_utc": 1619296865,
        "id": "gvqx6a2",
        "score": 183,
        "subreddit": "wallstreetbets",
        "created": 1619325665.0
    },
    {
        "author": "HowlingCouch",
        "body": "Why is Shaw even for sale? Reducing competition to further the telecommunication monopoly , disgusting &amp; backwards. The internet &amp; mobile phones are essential for everyday life now. The internet should become a public utility.",
        "created_utc": 1619296258,
        "id": "gvqvzu3",
        "score": 177,
        "subreddit": "CanadianInvestor",
        "created": 1619325058.0
    },
    {
        "author": "ikefalcon",
        "body": "He can’t keep updating forever. So many people are following him, that any indication that he might sell, including a cessation of regular updates, would cause a huge price correction. I don’t think he is selling anytime soon, but he probably wants the option to sell at some point in the future without having to explain why the updates are stopping.\n\nHe has no more options, so it’s logical to stop the updates now.",
        "created_utc": 1618605427,
        "id": "gurm3oy",
        "score": 175,
        "subreddit": "wallstreetbets",
        "created": 1618634227.0
    },
    {
        "author": "IDKUThatsMyPurse",
        "body": "Whoa now....I think you're looking for r/investing",
        "created_utc": 1619017104,
        "id": "gvbw0ie",
        "score": 173,
        "subreddit": "wallstreetbets",
        "created": 1619045904.0
    },
    {
        "author": "Chevysquid",
        "body": "Most of it is in a 401k so Sam has to wait for now.",
        "created_utc": 1619498009,
        "id": "gw0kx5g",
        "score": 171,
        "subreddit": "wallstreetbets",
        "created": 1619526809.0
    },
    {
        "author": "mattstover83",
        "body": "Jokes on you, I took out the trash last night, I can watch this as many times as I want now \\*\n\n*boss walks by, sees me watching this meme over and over again while laughing like a donkey*\n\n^(\\* Turns out I still can't watch this as many times as I want.)",
        "created_utc": 1619207440,
        "id": "gvlr16o",
        "score": 167,
        "subreddit": "wallstreetbets",
        "created": 1619236240.0
    },
    {
        "author": "JayArlington",
        "body": "I am not going to speak to the why it is down, but I have done a few different DDs on the semiconductor industry and the OP is correct.  AMDs stock being below $90 right now is fucking stupid.  \n\nTheir earnings release showed just how deep they getting inside the data centers that Intel used to feast on.",
        "created_utc": 1619634459,
        "id": "gw7a4qt",
        "score": 163,
        "subreddit": "wallstreetbets",
        "created": 1619663259.0
    },
    {
        "author": "lookshee",
        "body": "This is not a \"YOLO Update\" like everyone's yolo updates now flooding the sub. It just just marked with the YOLO flair because the other flairs don't seem to fit? Also, from the rules for \"yolo\" posts, it fits the minimum capital requirements.\n\nThere is not a point at which I intend to close. Ever. So it would be impossible for me to do a gain/loss porn post.\n\nThese updates are sort of a continuation of the mathematical DD about the system itself.\n\nWhen I posted my thesis on how GameStop stock was either going to reflect the true value of the company - which I personally believe is much higher than what we are seeing right now, or (through a mathematical anomaly in options trading on artificially price-suppressed stocks) a retail investor could technically own the entire company in a matter of years simply starting with 1000 shares.\n\nIt got a bit more complicated than originally expected, due to the bizarre price movements, but it is worth showcasing that this is working or not working.\n\nOthers seem to be enjoying this journey; and it's not just here to show off gains or losses. I am explicitly tracking the growth in share count.\n\nWould it be better to mark these as DD moving forward?",
        "created_utc": 1619496654,
        "id": "gw0iw6s",
        "score": 151,
        "subreddit": "wallstreetbets",
        "created": 1619525454.0
    },
    {
        "author": "nams0",
        "body": "You would be correct, however 3.5 million shares is a drop in the bucket compared to the total shares and estimated short interest on the stock. The reason the price is going haywire after hours now is because there is no longer a threat of share dilution and the fact that the offering was done at MARKET value of $157 speaks volumes as well. There is only positive outlook moving forward for GME at this point.",
        "created_utc": 1619472461,
        "id": "gvz841r",
        "score": 148,
        "subreddit": "stocks",
        "created": 1619501261.0
    },
    {
        "author": "Shr00my78",
        "body": "Do I start jacking off now or later?",
        "created_utc": 1619465658,
        "id": "gvysla3",
        "score": 147,
        "subreddit": "wallstreetbets",
        "created": 1619494458.0
    },
    {
        "author": "ozarkaflash",
        "body": "Please stop posting anything good about Blackberry. It's finally green by +4% and now you're going to make it crash...",
        "created_utc": 1619631005,
        "id": "gw71uuj",
        "score": 142,
        "subreddit": "wallstreetbets",
        "created": 1619659805.0
    },
    {
        "author": "St_Bernardus",
        "body": "Wasn't I told they exited their gme position and now had a big rebound?",
        "created_utc": 1618000159,
        "id": "gtyzjs1",
        "score": 139,
        "subreddit": "wallstreetbets",
        "created": 1618028959.0
    },
    {
        "author": "Six_OneSS",
        "body": "Crustfuck is now my new favorite word.",
        "created_utc": 1619575559,
        "id": "gw4jh3k",
        "score": 135,
        "subreddit": "wallstreetbets",
        "created": 1619604359.0
    },
    {
        "author": "rmme32",
        "body": "These calls do not have to be in the money to be profitable though... IV for GME is low right now. If the price spikes like it did in March and Jan, these calls will easily 5-10x",
        "created_utc": 1619639932,
        "id": "gw7n49w",
        "score": 135,
        "subreddit": "wallstreetbets",
        "created": 1619668732.0
    },
    {
        "author": "heapsp",
        "body": "20k yolo into 36k - uncle joe says one sentence and now back to 26k again.",
        "created_utc": 1619113117,
        "id": "gvgvmj6",
        "score": 133,
        "subreddit": "wallstreetbets",
        "created": 1619141917.0
    },
    {
        "author": "SydricVym",
        "body": "Excuse me sir, the internet has promised me GME will be hitting $10,000/share any day now. OP is obviously an amazingly savvy investor.",
        "created_utc": 1619644754,
        "id": "gw7ykx7",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1619673554.0
    },
    {
        "author": "Jangande",
        "body": "Pennystocks complaining about crypto...now I've seen everything",
        "created_utc": 1618694963,
        "id": "guwj3c8",
        "score": 126,
        "subreddit": "pennystocks",
        "created": 1618723763.0
    },
    {
        "author": "Ditto_D",
        "body": "Final update because he has bought as much GME as he wanted. He can die happy now with his hoard of GME.",
        "created_utc": 1618605843,
        "id": "gurn11t",
        "score": 126,
        "subreddit": "wallstreetbets",
        "created": 1618634643.0
    },
    {
        "author": "inkslingerben",
        "body": "Is the state implying that it is illegal to trade at work, or it seems the state wants to find out if he broke the law by promoting Gamestop. There are literally thousands of other youtube videos and posts discussing stocks. So what happens now?",
        "created_utc": 1618536328,
        "id": "guoal4p",
        "score": 123,
        "subreddit": "wallstreetbets",
        "created": 1618565128.0
    },
    {
        "author": "Shandowarden",
        "body": "by \"old wsb\" you mean wsb 1-2-3 months ago? Cause \"old wsb\" means option plays and not 100% GME AMC BB spam, bullshit all ins and massive loss porn, not the crap now.",
        "created_utc": 1619391902,
        "id": "gvvbq5k",
        "score": 123,
        "subreddit": "wallstreetbets",
        "created": 1619420702.0
    },
    {
        "author": "daddyneedsmoohlah",
        "body": "Fun fact, bum ass chauvin was overheard telling his lawyer just now “it could be worse, I could also be a PLTR bagholder”..... sad state of affairs for all involved.",
        "created_utc": 1618955040,
        "id": "gv94xu7",
        "score": 123,
        "subreddit": "wallstreetbets",
        "created": 1618983840.0
    },
    {
        "author": "Bossmon25",
        "body": "John Tory speaking live now. Said that a lot of people are interested in returning to the office in Toronto. Also highlighted that Reddit choose Toronto for a Canadian office. Mentioned Uber and Shopify.  Said he's \"bullish on Toronto's future.\"",
        "created_utc": 1619556091,
        "id": "gw3f3c3",
        "score": 122,
        "subreddit": "CanadianInvestor",
        "created": 1619584891.0
    },
    {
        "author": "Swimming-Document152",
        "body": "board of directors (the 6 listed earlier)\n\ncompensation for directors (instead of $140k cash + $140K worth of stock will now be $200K worth of stock and no cash - Cohen has elected to receive no compensation)\n\nboring company stuff (ratify independent auditor)",
        "created_utc": 1619137461,
        "id": "gvie68t",
        "score": 121,
        "subreddit": "wallstreetbets",
        "created": 1619166261.0
    },
    {
        "author": "FreeHats4U",
        "body": "remember brother. if it's good enough to post, it's good enough to sell. collect those mf tendies NOW",
        "created_utc": 1619189016,
        "id": "gvkkwum",
        "score": 118,
        "subreddit": "wallstreetbets",
        "created": 1619217816.0
    },
    {
        "author": "Jrapin",
        "body": "I'm 62, suffered from crippling depression most of my adult life. I've been on ssri's in the past and they worked for some time, then stoped, then made things worse. About 10 years ago I was deep in it and was really done. I randomly tuned into an am radio station while driving that had the Thom Heartman show on and just when I tuned in he said, \"our next segment, magic mushrooms can cure depression\". The timing couldn't have been better. Listened to the story about the research Johns Hopkins had done and decided to turn around and try the one thing I hadn't. Long story short, after doing the recommend dose, 3.5 grms, I was amazed. The experience was incredible but more importantly I was better. I haven't had symptoms since, no more drugs, no more suicidal thoughts and feel everything more fully. Now I dose twice a year and have never felt better. \nI'm in on MNMD and will be holding.",
        "created_utc": 1619580942,
        "id": "gw4t8gj",
        "score": 112,
        "subreddit": "wallstreetbets",
        "created": 1619609742.0
    },
    {
        "author": "JellyBag_",
        "body": "Your initial YOLO post influenced me to research and purchase. So far it's working out as now I'm in with 169 shares at 10.56.  Hopefully, you got room on that rocket for me to the moon.",
        "created_utc": 1619041739,
        "id": "gvdhpwr",
        "score": 111,
        "subreddit": "wallstreetbets",
        "created": 1619070539.0
    },
    {
        "author": "ChrisOGone",
        "body": "He double he's positions at gme ( now holds 200.000 shares) and stop twitting he's secret twitts . We are at end game this is it MOON SOON ! ( 10 MILL FLOOR ) \n\nIM GOING TO MISS ALL OF THAT 🥺 \n\nsee ya to the 🌝",
        "created_utc": 1618948586,
        "id": "gv8pihf",
        "score": 109,
        "subreddit": "wallstreetbets",
        "created": 1618977386.0
    },
    {
        "author": "Mellowcane",
        "body": "Interest rate low=making money now is worthless.\n\nInterest rate high=making money now only thing that matters.",
        "created_utc": 1619022281,
        "id": "gvc84y6",
        "score": 109,
        "subreddit": "wallstreetbets",
        "created": 1619051081.0
    },
    {
        "author": "infinitelimits00",
        "body": "Your title is another way of phrasing “Dispersion Trading.”\n\nIf you thought of this strategy on your own (even if it’s not entirely refined), that means you are very smart. In fact these are the types of posts that I hope get on the top of r/options (I gave you an award - hopefully it pushes it up). Your post is a great post for people who are actually looking to learn more about options than just buying calls/puts. Half of the time I see posts that are just like “yolo into calls on stock xyz” or “should I get out of my position now or wait it out” etc. get to the top, which is sort of disappointing to me. I don’t have any issues with those posts, but they don’t offer the insight your post offers. \n\nWhat you described is a rough sketch of dispersion trading. You probably won’t be able to find much about it online but I’m sure there’s a few articles and research papers that you can find on Google (just type dispersion trading into Google). There’s also this on YouTube that gives you a brief intro: https://youtube.com/watch?v=32bVTQw7XDg. It’s a *true options* strategy and much more sophisticated than the ones you generally see here on Reddit of just buying calls or puts. I would guess it’s one of the core strategies almost all option trading firms make to generate profit. It’s almost impossible to do as a retail trader (your set-up you described in your post will be very costly and almost impossible to manage), but if you have like some complex system of algorithms + a bunch of quants helping you out, there is a way to pull off this trade so that you can *have a positive profit no matter how the stock market moves*. \n\nThink about it this way with a super simplistic example in SPY. SPY is a function of its 500 stocks. So there must be a relationship between these 500 stocks (or sector of stocks) and SPY. If this relationship gets off in either direction, you can take advantage. If Stock X and Stock Y have IVs of a and b, then the basket that is some weighted combination of Stock X and Y *must* have an IV of f(a, b) where it’s a *solvable function*. This means anytime it gets off, no matter how Stocks X and Y move, you can make money. \n\nAnyways that didn’t really answer your question in your post directly, but I’m giving some basic insight on the type of thinking you described in your post. As I said, I don’t think most people have the resources to pull it off, but given you can even think of this idea, that’s pretty impressive! And as I said, it’s a great post for people to learn more about more advanced option strategies than just buying calls/puts.",
        "created_utc": 1619112191,
        "id": "gvgtcsk",
        "score": 106,
        "subreddit": "options",
        "created": 1619140991.0
    },
    {
        "author": "FormerGameDev",
        "body": "&gt; Basically GME, the company, now has more revenue\n\nasset, not revenue.  they do not gain income from holding shares.",
        "created_utc": 1618442386,
        "id": "gujna6n",
        "score": 106,
        "subreddit": "wallstreetbets",
        "created": 1618471186.0
    },
    {
        "author": "Farmer_eh",
        "body": "That’s basically what escheatment is yeah. What’s yours is now ours.",
        "created_utc": 1619469410,
        "id": "gvz15kd",
        "score": 105,
        "subreddit": "stocks",
        "created": 1619498210.0
    },
    {
        "author": "_maplethorpe_",
        "body": "He was my CEO when I worked at Vail. Best time ever and he is exactly what AMC needs right now.",
        "created_utc": 1619575708,
        "id": "gw4jrmh",
        "score": 105,
        "subreddit": "wallstreetbets",
        "created": 1619604508.0
    },
    {
        "author": "manonymous_1994",
        "body": "For real. I’ve been here since 16. This place used to be hilarious. Incredibly smart people just acting like retards. Now it’s just retards calling each other apes. GME ruined this sub.",
        "created_utc": 1619393907,
        "id": "gvvfctw",
        "score": 102,
        "subreddit": "wallstreetbets",
        "created": 1619422707.0
    },
    {
        "author": "TheIncredibleNurse",
        "body": "I sold my shares when I saw the proxy for the annual meeting way back in march. Now wish I had kept them. Paperhanded like a little bitch",
        "created_utc": 1619584576,
        "id": "gw4yxqv",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1619613376.0
    },
    {
        "author": "Soft_Manufacturer_78",
        "body": "Just adding more to what's been said above....\n\nThis is big. As we draw closer to the delivery days, the number of open interest contracts should almost always fall as most players in the COMEX are speculators and do not have the silver nor have the interest to demand delivery so they would rather just close off and roll their contracts over to future months.\n\nThose contacts that remains are more likely serious participants who want delivery and are not just speculating. So if that total number of open interest contracts remains high when we hit the delivery day, that means more likely for more silver will be demanded from the COMEX and as it stands now, the COMEX stock is only at 24,000 contracts. If more than 24000 contracts demands delivery, they'll be out of stock.\n\nThe COMEX may have ways to increase their stock in the meantime. But silver is a limited commodity and if this keeps up month after month eventually something would have to break.",
        "created_utc": 1619066529,
        "id": "gvesvyr",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1619095329.0
    },
    {
        "author": "intheMIDDLEwityou",
        "body": "I’ve posted/lurked in wsb for about 3 years now (different user names) and I’ve loved hearing about all the ideas and plays and seeing the loss and gain porn. I adore all the degenerates here. I like the positions or ban requirement. Wsb was my intro to options. It told me about the jpow brrrr and the v-shaped recovery last year. I learned that TA is the best way to sound smart but be actually retarded. Wsb showed me that dividends and boomer stocks was for nerds. And it taught me how to lose money really fast and that I should always inverse myself. But in The last 3 months I’ve literally learned 5x what I knew from the past 3 years. Gme is the most interesting story of the year. This megathread was going to eventually and naturally be replaced as apes learn new plays and the gme story unfolds. It doesn’t make sense to make an executive unilateral decision to kill the thread and it just makes mods look sus af. Killing the thread only feeds the conspiracy/cultish mindset. Just like all the CNBC/motley fool/S3/etc... FUD proved to me that gme was a real threat. MODS: get a grip and use this growth as an opportunity to integrate a lot of beautiful minds so that we can collectively share the best ideas and the best gains and losses. Why shoot yourselves in the foot?",
        "created_utc": 1618590387,
        "id": "guqo6ce",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1618619187.0
    },
    {
        "author": "Oneangrygnome",
        "body": "He coulda paid DFV a year ago and we’d all be rich by now",
        "created_utc": 1618447937,
        "id": "gujxzt7",
        "score": 96,
        "subreddit": "wallstreetbets",
        "created": 1618476737.0
    },
    {
        "author": "NumbN00ts",
        "body": "You are missing the part where no one believed him at first. There are a lot of screenshots of people putting him down for it and him brushing it off. Those two viewers are probably far more rich now than anyone who got in Dec/Jan when it started to get the spotlight.\n\nNow, became it took off, they look at his view numbers as if they all were added in a two month span, months after release.",
        "created_utc": 1618625641,
        "id": "gusp49h",
        "score": 96,
        "subreddit": "wallstreetbets",
        "created": 1618654441.0
    },
    {
        "author": "BostonCEO",
        "body": "Now he’s off with Jimmy Hoffa somewhere… maybe we are living in a simulation.  A month does feel like a lifetime. 🚀",
        "created_utc": 1618536716,
        "id": "guobbwo",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1618565516.0
    },
    {
        "author": "FM98_GHIF",
        "body": "It probably means that he’s done because it’s up to all of us to hold now. There’s nothing else he can do. Basically maxed out on shares. He can’t post when he sells because that will be market manipulation. And it’s not really anyone else’s business how much he makes in the end. All anyone can do now is buy what you can and hold. Just like him. He’s just one of us now.",
        "created_utc": 1618605113,
        "id": "gurle2q",
        "score": 92,
        "subreddit": "wallstreetbets",
        "created": 1618633913.0
    },
    {
        "author": "Intelligent-Squash30",
        "body": "Guys, keep in mind that it's just another mind trick played by hedgies, huuuuge dips didn't work on apes and now they're trying this slow bleed tactic. \n\nWho knows, maybe it would work if they used it as their first weapon, maybe if the did it back in January they would simply shake us off, slowly, day by day... \n\nBut they didn't. Instead they tried to beat us with baseball bats, fast and brutal. But you know the story, the MONKE became just more retarded and hardened.\n\nNow their fuckin crowd control experts, 200iq professors of psychology from Oxford tier universities mother fuckers can't do anything, they've missed their opportunity. Now they have to fight full retarded battlescared zombie monkey, that came from 40$ deep grave and in respond to their super god tier mind manipulation techniques simple throwshit at them and make monke noises. \n\nGuys, i love you with my whole heart, let's fuck these financial leeches good. If you feeling like paper handing - just stop watching charts, come back tomorrow and now drink some water, call a friend, talk to your mom or walk a dog. Or eat some tendies :) \n\nAPES. TOGETHER. STRONG. 🦍 🦍🦍 🦍🦍 🦍",
        "created_utc": 1617899966,
        "id": "gtttdle",
        "score": 91,
        "subreddit": "wallstreetbets",
        "created": 1617928766.0
    },
    {
        "author": "Crilly90",
        "body": "Pretty sure the character was based on Prince who, now that I think about it,  is  basically straight Jehovah's Whitness lil Nas X.",
        "created_utc": 1619191641,
        "id": "gvkqyal",
        "score": 91,
        "subreddit": "wallstreetbets",
        "created": 1619220441.0
    },
    {
        "author": "throwaway127374884",
        "body": "This sub is basically a glorified p and d circle jerk now",
        "created_utc": 1619574850,
        "id": "gw4i2ys",
        "score": 91,
        "subreddit": "wallstreetbets",
        "created": 1619603650.0
    },
    {
        "author": "ohageek",
        "body": "Funny this was posted, robinhood has a survey now that discusses “meme stocks” and is close to this thread topic, I flat out accused robinhood of price altering as out of the 10 platforms I use. Robinhood is always +/- 3-8% different than any other reputable platform. I’ve always claimed that the big guys love getting us smaller guys money, than pulling the rug out from under our feet.. I hope someday it becomes public and these people get what’s coming to them..",
        "created_utc": 1618607869,
        "id": "gurrees",
        "score": 90,
        "subreddit": "pennystocks",
        "created": 1618636669.0
    },
    {
        "author": "anonkraken",
        "body": "Just told my wife that I would strike out less with randoms at the bar than I do with her.\n\n...aaaannnd now I’m on the couch.",
        "created_utc": 1619053846,
        "id": "gve6e9a",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1619082646.0
    },
    {
        "author": "ZachieChannnn",
        "body": "gme got me from 15k to 180k...now I need my 180k to a couple mill like that, congrats",
        "created_utc": 1619134457,
        "id": "gvi87uc",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1619163257.0
    },
    {
        "author": "Dan_inKuwait",
        "body": "Now, this is the kind of DD I come here for.\n\nNext you'll be telling me Lil' Yachty is cutting new tracks, too.",
        "created_utc": 1619517249,
        "id": "gw17eag",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1619546049.0
    },
    {
        "author": "SpecVengeance",
        "body": "It's funny that I saw this exact same post on another website with a click bate title now its here!",
        "created_utc": 1619096207,
        "id": "gvft70f",
        "score": 87,
        "subreddit": "pennystocks",
        "created": 1619125007.0
    },
    {
        "author": "2applepie",
        "body": "POV: you just bought COIN on release, got happy it rose to 420 thinking you're big brain, it sunk, and now you're on reddit contemplating your life choices. :(",
        "created_utc": 1618424994,
        "id": "guilo8i",
        "score": 86,
        "subreddit": "wallstreetbets",
        "created": 1618453794.0
    },
    {
        "author": "Kampizi",
        "body": "IF you have Crypto in Robinhood - now may be a good time to pull it out... You don't own it... they do, they will liquidate it.",
        "created_utc": 1618871022,
        "id": "gv4wdkz",
        "score": 86,
        "subreddit": "investing",
        "created": 1618899822.0
    },
    {
        "author": "NimbleSpirits",
        "body": "Called Nimble Dash. I am making it solo (a friend makes music tho). For mobile devices for now.",
        "created_utc": 1618998695,
        "id": "gvb1vki",
        "score": 86,
        "subreddit": "wallstreetbets",
        "created": 1619027495.0
    },
    {
        "author": "Invisible_hand_",
        "body": "A diversified portfolio. You can now work the mail room at Charles Schwab.",
        "created_utc": 1619297303,
        "id": "gvqy0p3",
        "score": 84,
        "subreddit": "wallstreetbets",
        "created": 1619326103.0
    },
    {
        "author": "0lamegamer0",
        "body": "Lol. There are dedicated subs now for these superstonk that are apparently in infinite loops of short squeezes. Even when company issues new shares - people still hope for a short squeeze.  Short interest goes to 10%- yes, short squeeze. Stock goes down- shorts are manipulating..squeeze is coming.",
        "created_utc": 1619640682,
        "id": "gw7ow5n",
        "score": 82,
        "subreddit": "stocks",
        "created": 1619669482.0
    },
    {
        "author": "TheAlbinoAmigo",
        "body": "Been on WSB for years and the speed that new tickers suddenly catapult to the top of this sub the last few months is insane.\n\nUWMC was the same. Couldn't go tits up. Went tits up immediately, then got hyped again and subsequently went tits up again lol\n\nSuper sus of CLOV just skyrocketing up here after *never* seeing it here. I *did* see CLOV being pushed by the media a few days back - now lo and behold there's posts here about it. \n\nI don't trust it.",
        "created_utc": 1618693487,
        "id": "guwg7aw",
        "score": 81,
        "subreddit": "wallstreetbets",
        "created": 1618722287.0
    },
    {
        "author": "hurndledurndle",
        "body": "Ok guys. **ALL GME TALK IS NOW MOVED TO THE DAILY DISCUSSION THREAD** .\napparently that will annoy them less to have us talk there",
        "created_utc": 1618586496,
        "id": "guqf36j",
        "score": 79,
        "subreddit": "wallstreetbets",
        "created": 1618615296.0
    },
    {
        "author": "marteney1",
        "body": "And now it's daily",
        "created_utc": 1618441735,
        "id": "gujm1yl",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1618470535.0
    },
    {
        "author": "Rufio330",
        "body": "All you gme haters awful quiet now",
        "created_utc": 1619471586,
        "id": "gvz650u",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1619500386.0
    },
    {
        "author": "Microtonal_Valley",
        "body": "Damn guess I've been having healthy days for like 3 months straight now lol",
        "created_utc": 1618936445,
        "id": "gv7w0a5",
        "score": 78,
        "subreddit": "stocks",
        "created": 1618965245.0
    },
    {
        "author": "Rrrrandle",
        "body": "&gt;I guess I’m an idiot. I don’t understand how this is legal.\n\nNothing inherently illegal in it.  If you have a company you can sell shares to anyone for whatever they're willing to pay for it.  You can't deceive them about the company or anything, but that's about it.\n\nNow, it looks pretty shady, so, yeah, there's probably an SEC or IRS investigation coming their way soon.",
        "created_utc": 1618518333,
        "id": "gun9q3d",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1618547133.0
    },
    {
        "author": "GooderThanAverage",
        "body": "I'm so fucking stoned right now. This is great we can chat and support each other taking on these crooks.\n\nI picked up another 100. This shit is awesome man. It's like we are in on a secret way to make many millions and everyone doubts us. \n\nOnce I get my payout I'm gonna give back to the world. Of course I'll get the obligatory Lambo, but I really am going to return to West Africa where I once volunteered and help as much as I can.",
        "created_utc": 1618518837,
        "id": "gunavwl",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1618547637.0
    },
    {
        "author": "artman3211",
        "body": "Been in since $2.70 and for several years! Their tech is the best , already in Hololens and now their lidar coming to cars is next big step. I believe they get bought out by Microsoft for $30s",
        "created_utc": 1619100339,
        "id": "gvg1eil",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1619129139.0
    },
    {
        "author": "Griffinhunters",
        "body": "If you bought 500 shares of GE in 1896 you’d be dead by now.",
        "created_utc": 1619121767,
        "id": "gvhg1j0",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1619150567.0
    },
    {
        "author": "competitivebunny",
        "body": "I heard you’re a dirty lurker now too 🤭",
        "created_utc": 1618884798,
        "id": "gv5nlam",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1618913598.0
    },
    {
        "author": "synt4xtician",
        "body": "Cramer called it a battleground. Potential big news promised by end of April, maybe a demo. Transparency from CEO is refreshing, disclosed they're looking for buyers of their company. Lidar space is really heating up right now. Finally, it's incredibly shorted, so potential for epic gamma squeeze with any news.",
        "created_utc": 1619128874,
        "id": "gvhwg9v",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1619157674.0
    },
    {
        "author": "Crapsdrkside",
        "body": "They were likely sold at market rates over the last few weeks. Anyone could have purchased them, you, me, institutional investors, hedge funds, etc. If they would have dumped 3.5 million shares on a single day, it would have dropped gme share prices substantially. Wonder why we were trading sideways for days? Now we know why.",
        "created_utc": 1619490751,
        "id": "gw08wsp",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1619519551.0
    },
    {
        "author": "Trevorrr4",
        "body": "“What you just said is one of the most insanely idiotic things I have ever heard. At no point in your rambling, incoherent response, we’re you even close to anything that could be considered a rational thought. Everyone in this room is now dumber for having listened to it. I award you no points, and may God have mercy on your soul.”",
        "created_utc": 1617830789,
        "id": "gtqii4r",
        "score": 75,
        "subreddit": "wallstreetbets",
        "created": 1617859589.0
    },
    {
        "author": "Bakedintheusa",
        "body": "Imagine starting a company and issuing 1 million shares to yourself as the sole owner. You sell 1 share to your dad for $10,000. Your company's now worth $10 billion dollars.",
        "created_utc": 1618531263,
        "id": "guo0uus",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1618560063.0
    },
    {
        "author": "Ackilles",
        "body": "Was surprised this was posted as if news now when it hit 6 hours ago. Then I realized this is /r/investing, did a 180 and was shocked it was being brought up in the same day",
        "created_utc": 1619500694,
        "id": "gw0oly5",
        "score": 73,
        "subreddit": "investing",
        "created": 1619529494.0
    },
    {
        "author": "generalz13",
        "body": "The same clowns that told me GME was gonna crash to $10 when it was at $40 are trying to say that it's going to $40 from $180. Lmao, like why the fuck would anyone listen to your shitty predictions now? Your puts are F U C K E D.",
        "created_utc": 1617650403,
        "id": "gthio55",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1617679203.0
    },
    {
        "author": "Half-Sole",
        "body": "Is this the new megathread now?",
        "created_utc": 1618604462,
        "id": "gurjuni",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1618633262.0
    },
    {
        "author": "tdp0907",
        "body": "I get it now. Thats why he sad on the earnings call and didn’t take questions. He can’t reap the profits from his shares.",
        "created_utc": 1618437254,
        "id": "gujd6op",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1618466054.0
    },
    {
        "author": "Squezeplay",
        "body": "Its good you learned it now with only $10k, instead of when your older with a few hundred grand. What you invest in now doesn't really matter, your savings rate matters. You need to build up capital. Once you have $100k+ earning 10% a year, that is more than your $10k every year, and your loss will feel like nothing.",
        "created_utc": 1618432153,
        "id": "guj208n",
        "score": 72,
        "subreddit": "stocks",
        "created": 1618460953.0
    },
    {
        "author": "Boomtown626",
        "body": "MRVL (5G), NXPI (car chips)",
        "created_utc": 1617735246,
        "id": "gtlnacf",
        "score": 3,
        "subreddit": "stocks",
        "created": 1617764046.0
    },
    {
        "author": "GearheadGaming",
        "body": "But that isn't really an EV thing.  You can have a touchscreen display in any car.\n\nAlso, this company is mainly about tablets, smartphones, that sort of stuff, right?  And the small chunk of revenue they get from touchscreens for cars is mainly as a supplier to Chinese companies, right?  So doesn't all that go tits up if we go trade war two, electric boogaloo?\n\nHIMX is not an EV play.  Not even close.  You want to do automotive chips, you want ON, IFNNY, NXPI, those sort of guys.  TXN would be my play in that space, though personally I'm waiting for their earnings report on the 20th before I make a move.",
        "created_utc": 1617559011,
        "id": "gtd9rd2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617587811.0
    },
    {
        "author": "gertje69-420",
        "body": "ASML, ASMI, NXPI",
        "created_utc": 1617637101,
        "id": "gtgpby0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617665901.0
    },
    {
        "author": "deSeingalt",
        "body": "  NXPI ADI MU",
        "created_utc": 1617884431,
        "id": "gtsvs97",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617913231.0
    },
    {
        "author": "I_like_to_build",
        "body": "Yep.  NVDA finally came back, took those profits.  Took rebound profits on AMAT, MU, LRCX, NXPI.\n\nGot lucky with PLTR finally printing today.  Maybe I get lucky before the correction and sell off and AMC and BB will print?  Still have a bit of ASO, NHCL, and CCL that printed and is still doing work for me.\n\nBut I'm about 85% cashed out waiting for the next sell of or correction.  Will be interesting to see how much more AMD can be driven down.\n\nGiven up home on UWMC, MVIS, APHA, turning green.\n\nI'm ready for these prices to get back down and unlike the last correction, now I've got a big ol pile of cash to throw at it.  Don't see what the catalyst will be.  Treasuries keep going down... earnings should be good this week.  Don't know what's it gonna be but I'm bout ready.",
        "created_utc": 1618378668,
        "id": "gughvy1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618407468.0
    },
    {
        "author": "NotaJRGenius",
        "body": "BAC CSCO GILD LDOS NXPI COR IIPR(PERSONAL FAVORITE) ENB EPD SMFG HTGC ARCC CC \nNMR (Good price after hedge fund fiasco)",
        "created_utc": 1617515604,
        "id": "gtbluju",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617544404.0
    },
    {
        "author": "Common-Worldliness-3",
        "body": "Check out $ASX. You’re welcome \n\nhttps://www.google.com/amp/s/seekingalpha.com/amp/article/4417169-ase-technology-vs-amkor-an-analysis-on-worlds-leading-osats\n\n“Strategic Alliance between ASE and TSMC\nASE is based in Taiwan, one of the leading centers for outsourced semiconductor and electronics manufacturing in the world. Its close geographical proximity allows the company to benefit from strong manufacturing activity. It has maintained a strategic alliance with TSMC since 1997, the largest dedicated foundry with a market share of 56% of the foundry market revenues. The alliance has made ASE the preferred provider of packaging and testing services for TSMC clients. This allows ASE to benefit by leveraging TSMC's clients of leading companies including Apple (AAPL), Qualcomm, Nvidia (NVDA), MediaTek (OTCPK:MDTKF), NXP Semiconductors (NXPI) as clients who account for nearly half of ASE's revenues. Apple, Qualcomm and MediaTek are major players in the smartphone processor market and are developing 5G chipsets that require advanced packaging capabilities which ASE can provide. Given the long-standing relationship between TSMC and ASE, we expect the alliance between both companies to continue as it enables them to provide a total semiconductor manufacturing solution and the close geographic advantage between both market leaders. This means that ASE should be able to continue counting on TSMC's clients of leading chipmakers.”",
        "created_utc": 1617409431,
        "id": "gt73vw3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617438231.0
    },
    {
        "author": "Craino",
        "body": " TL:DR - looking for feedback on a simple hi return stock screen and thoughts on how to rank results.\n\nEarly 60's, simple, diversified, buy and hold retirement portfolio approach my whole life. Looking at working probably another 5-10 years and starting to get a lot more active in my portfolio. Nothing crazy and I'm fundamentally a conservative+ investor, but I do not subscribe to moving 100% into ultra safe right before retirement. Portfolio size is low 7 figure for reference.\n\nOver the past few months I subscribed to a couple of authors on Seeking Alpha and have tried out a few strategies with minimal exposure and have a good idea of how to use some of the approaches in my portfolio. I want to develop my own screens because at least on Seeking Alpha, the authors I've found charge a small monthly fee for their updates. It's nothing huge, and for me at least has been worth seeing their approaches, but nothing I want to pay for the rest of my life.\n\nI'm going to put together a dividend screen/strategy and a \"better than cash\" parking lot strategy. Pretty basic and straightforward. I also just got started on putting together a screen to identify a more hi growth strategy - thought being on a monthly basis invest in the top 4 stocks that fall out of the screen. Would love some feedback on the screen (I'm stock knowledgeable, but certainly not an expert). When looking at the screen and giving feedback keep in mind my objective: not looking for the perfect approach or for mega returns, I'm an 80/20 kinda guy so looking for a decent, simple to execute strategy to reliably give back a growth-class return. (And using the Fidelity screener as that's where my portfolio is).\n\nScreen as it stand currently:\n\n* Tagging Energy, Health Care, Financials, Information Technology and Industrials sectors\n* Market cap down to Medium (as defined by Fidelity: 6-33B)\n* 13 week price performance down to 13%\n* 3 yr annualized Beta of 1.1 and up (conflicted on whether this really helps the screen)\n* Very Bullish or Bullish analyst recommendations (Summary score from StarMine)\n* Forward EPS 3-5 yrs high to very high (16.5% and up)\n* EPS growth Projected year versus last year high to very high (40% and up)\n\nAs an example, running that screen today resulted in a list of 7 stocks (sorry not allowed to link image or would give you a shot of the fundamentals):\n\n1. AMAT - Applied materials\n2. FANG - Diamondback Energy\n3. EOG - EOG Resources\n4. NXPI - NXP SemiConductor\n5. KKR - KKR &amp; Co\n6. LRCX - LAM Research Corp\n7. MU - Micron Technology\n\nSo the thought would be to run this first day of every month and put a set amount in the top 4 stocks in the filter. I would guess some stocks might stay in for months, some might rotate in and out quickly.\n\nMy question is basically around how to rank. So do I just pick a screening metric (or some other metric) and do a simple rank on that metric to determine top 4, or do I create a formula to weight and aggregate multiple metrics into an overall score and rank on that?\n\nSorry for the long post - thank you to those who stuck with it and are willing to share your thoughts.",
        "created_utc": 1617376794,
        "id": "gt5cmwk",
        "score": 1,
        "subreddit": "investing",
        "created": 1617405594.0
    },
    {
        "author": "Agood10",
        "body": "Didn’t most large cap semiconductor companies do really well yesterday? TSM is the only major one i see thats down. Intel, ON, and NXPI all did great",
        "created_utc": 1617699194,
        "id": "gtjt2j2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617727994.0
    },
    {
        "author": "Boomtown626",
        "body": "MRVL and NXPI have been my favorites lately.",
        "created_utc": 1617585093,
        "id": "gtema5b",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617613893.0
    },
    {
        "author": "Kashm11r",
        "body": " AMD MU NVDA TSM AMAT INTC AAPL AVGO QCOM MRVL TXN NXPI QRVO SWKS CRUS",
        "created_utc": 1617593046,
        "id": "gtezt1p",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617621846.0
    },
    {
        "author": "NrdRage",
        "body": "$ON\n$MRVL\n$NVDA\n$AMD\nNXPI\n$SWKS",
        "created_utc": 1617634447,
        "id": "gtgjjry",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617663247.0
    },
    {
        "author": "ttagpul_500won",
        "body": "Netherland got some most essential chip companies. I should’ve kept NXPI. sold out way too early :(",
        "created_utc": 1617574447,
        "id": "gte39e6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617603247.0
    },
    {
        "author": "Common-Worldliness-3",
        "body": "Check out $ASX. You’re welcome \n\nhttps://www.google.com/amp/s/seekingalpha.com/amp/article/4417169-ase-technology-vs-amkor-an-analysis-on-worlds-leading-osats\n\n“Strategic Alliance between ASE and TSMC\nASE is based in Taiwan, one of the leading centers for outsourced semiconductor and electronics manufacturing in the world. Its close geographical proximity allows the company to benefit from strong manufacturing activity. It has maintained a strategic alliance with TSMC since 1997, the largest dedicated foundry with a market share of 56% of the foundry market revenues. The alliance has made ASE the preferred provider of packaging and testing services for TSMC clients. This allows ASE to benefit by leveraging TSMC's clients of leading companies including Apple (AAPL), Qualcomm, Nvidia (NVDA), MediaTek (OTCPK:MDTKF), NXP Semiconductors (NXPI) as clients who account for nearly half of ASE's revenues. Apple, Qualcomm and MediaTek are major players in the smartphone processor market and are developing 5G chipsets that require advanced packaging capabilities which ASE can provide. Given the long-standing relationship between TSMC and ASE, we expect the alliance between both companies to continue as it enables them to provide a total semiconductor manufacturing solution and the close geographic advantage between both market leaders. This means that ASE should be able to continue counting on TSMC's clients of leading chipmakers.”",
        "created_utc": 1617409431,
        "id": "gt73vw3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617438231.0
    },
    {
        "author": "Craino",
        "body": " TL:DR - looking for feedback on a simple hi return stock screen and thoughts on how to rank results.\n\nEarly 60's, simple, diversified, buy and hold retirement portfolio approach my whole life. Looking at working probably another 5-10 years and starting to get a lot more active in my portfolio. Nothing crazy and I'm fundamentally a conservative+ investor, but I do not subscribe to moving 100% into ultra safe right before retirement. Portfolio size is low 7 figure for reference.\n\nOver the past few months I subscribed to a couple of authors on Seeking Alpha and have tried out a few strategies with minimal exposure and have a good idea of how to use some of the approaches in my portfolio. I want to develop my own screens because at least on Seeking Alpha, the authors I've found charge a small monthly fee for their updates. It's nothing huge, and for me at least has been worth seeing their approaches, but nothing I want to pay for the rest of my life.\n\nI'm going to put together a dividend screen/strategy and a \"better than cash\" parking lot strategy. Pretty basic and straightforward. I also just got started on putting together a screen to identify a more hi growth strategy - thought being on a monthly basis invest in the top 4 stocks that fall out of the screen. Would love some feedback on the screen (I'm stock knowledgeable, but certainly not an expert). When looking at the screen and giving feedback keep in mind my objective: not looking for the perfect approach or for mega returns, I'm an 80/20 kinda guy so looking for a decent, simple to execute strategy to reliably give back a growth-class return. (And using the Fidelity screener as that's where my portfolio is).\n\nScreen as it stand currently:\n\n* Tagging Energy, Health Care, Financials, Information Technology and Industrials sectors\n* Market cap down to Medium (as defined by Fidelity: 6-33B)\n* 13 week price performance down to 13%\n* 3 yr annualized Beta of 1.1 and up (conflicted on whether this really helps the screen)\n* Very Bullish or Bullish analyst recommendations (Summary score from StarMine)\n* Forward EPS 3-5 yrs high to very high (16.5% and up)\n* EPS growth Projected year versus last year high to very high (40% and up)\n\nAs an example, running that screen today resulted in a list of 7 stocks (sorry not allowed to link image or would give you a shot of the fundamentals):\n\n1. AMAT - Applied materials\n2. FANG - Diamondback Energy\n3. EOG - EOG Resources\n4. NXPI - NXP SemiConductor\n5. KKR - KKR &amp; Co\n6. LRCX - LAM Research Corp\n7. MU - Micron Technology\n\nSo the thought would be to run this first day of every month and put a set amount in the top 4 stocks in the filter. I would guess some stocks might stay in for months, some might rotate in and out quickly.\n\nMy question is basically around how to rank. So do I just pick a screening metric (or some other metric) and do a simple rank on that metric to determine top 4, or do I create a formula to weight and aggregate multiple metrics into an overall score and rank on that?\n\nSorry for the long post - thank you to those who stuck with it and are willing to share your thoughts.",
        "created_utc": 1617376794,
        "id": "gt5cmwk",
        "score": 1,
        "subreddit": "investing",
        "created": 1617405594.0
    }
]