[
    {
        "author": "Dnuts",
        "body": "The quality of new releases is horrrrrrrible.  For a time there was a non-stop cadence of must-watch shows. Now it’s c-level movies and teenage dramas.",
        "created_utc": 1618962454,
        "id": "gv9krx9",
        "permalink": "/r/stocks/comments/mv2e02/netflix_shares_fall_11_after_reporting_a_large/gv9krx9/",
        "score": 46,
        "subreddit": "stocks",
        "created": 1618991254.0
    },
    {
        "author": "HeyLookAGinger",
        "body": "Atleast make the cadence flow better if you are going to try to do that. That shit is embarrassingly low effort",
        "created_utc": 1617985479,
        "id": "gty2rnq",
        "permalink": "/r/wallstreetbets/comments/mnf6e4/gme_megathread_for_april_09_2021/gty2rnq/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1618014279.0
    },
    {
        "author": "in_C",
        "body": "this fuckin airbnb commercial the girl sings \"iiiiii will always love you\" in the wrong cadence and it tilts me so much",
        "created_utc": 1617300575,
        "id": "gt227c9",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt227c9/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617329375.0
    },
    {
        "author": "captainhaddock",
        "body": "&gt; Reports a monster quarter; stock is up double digits % and no one is talking about it LOL.\n\nIt's kind of a relief for me, because I had a bunch of stocks this week report monster quarters with guidance raises and then drop 5–10% in response. Cadence Design Systems, Starbucks, Pinterest, Masimo, etc. In my portfolio, only Shopify seems to be turning great results into share price growth. (And, God willing, Apple will see a boost as well.)",
        "created_utc": 1619662171,
        "id": "gw8z9w8",
        "permalink": "/r/stocks/comments/n0pel5/monster_earnings_by_shopify_shop_beating_all/gw8z9w8/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619690971.0
    },
    {
        "author": "big-black-dog",
        "body": "CDNS - great earnings, stock down 9%, stock market broken",
        "created_utc": 1619532022,
        "id": "gw1uevb",
        "permalink": "/r/stocks/comments/mzklc7/rstocks_daily_discussion_technicals_tuesday_apr/gw1uevb/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619560822.0
    },
    {
        "author": "excel958",
        "body": "I suppose in a sense you are correct, and I guess “ruin” isn’t the best word because I do actually like some of Coleman Barks version of things. Sometimes he writes Rumi with a particular cadence that is really nice to hear or read.\n\nIMO one way to put it would be that his words have the heart of Rumi but not the entirety of Rumi.",
        "created_utc": 1618466486,
        "id": "guksf3o",
        "permalink": "/r/wallstreetbets/comments/mqt06d/we_like_the_stock/guksf3o/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618495286.0
    },
    {
        "author": "marsvibes",
        "body": "IMO - add to low cost S&amp;P 500 index at a regular cadence - market up or down. Over the years, with compounding et al - it’ll be a good chunk - if past is any indication. Sleep well - no stress. For individual stocks, as long as it’s a long play with a well run business - same rule can apply. Although the risk profile is lower with a low cost S&amp;P ETF.\nNot a financial adviser",
        "created_utc": 1618808489,
        "id": "gv1rqtc",
        "permalink": "/r/stocks/comments/mtcntf/is_now_the_time_to_be_fearful/gv1rqtc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618837289.0
    },
    {
        "author": "Guzo116",
        "body": "This has the same cadence as Factual Factoids and this pleases me",
        "created_utc": 1619610540,
        "id": "gw5trd6",
        "permalink": "/r/wallstreetbets/comments/n09nzc/wall_street_has_no_idea_who_they_are_messing_with/gw5trd6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619639340.0
    },
    {
        "author": "wonkeybanana",
        "body": "&gt;, \n\nThank you.  I am a Questrade customer and used Passiv last year and was in there looking at my Target Portfolio amounts today, hence the question.  I'm always worried that I am doing something wrong and am going to screw something up somewhere.  I like the idea of micro adjustments on the risk amounts.  Passiv is the easy button here.  Thank you for confirming that.  I will continue with the 3 ETF method and get back into a monthly cadence on this.",
        "created_utc": 1617645842,
        "id": "gth8qhx",
        "permalink": "/r/CanadianInvestor/comments/mknjls/canadian_couch_potato_2021_rebalance/gth8qhx/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1617674642.0
    },
    {
        "author": "SetzerWithFixedDice",
        "body": "Simple. Have 100k and tell the broker you want the 1% gains (make sure to indicate a daily cadence) and then you get 1k a day.",
        "created_utc": 1617525661,
        "id": "gtbwa7b",
        "permalink": "/r/wallstreetbets/comments/mi3t1v/weekend_discussion_thread_for_the_weekend_of/gtbwa7b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617554461.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 26th of April\n\n\n\n## Upcoming events for Monday, April 26th\n\n - Expected earnings:\n\n  ACI, AGNC, AIN, AMG, AMKR, AMP, ARE, ARLP, AXTA, BCLI, BOH, BRO, CATY, CBU, CCB, CDNS, CHKP, CNI, CVLG, DGICA, DGICB, DHIL, DORM, EBTC, EFSC, FBK, FBP, FCAP, FIX, FLXS, FNCB, FRAF, FRBA, HBT, HLX, HMST, HONE, HSII, HSTM, HTLF, IBTX, ILPT, JBT, JJSF, KOF, KREF, LII, LKFN, LXFR, LXRX, MASI, MEDP, MEDS, MKSI, MPB, MRBK, MSB, NBTB, NRIM, NTP, NWBI, NXPI, OMF, OTIS, OVBC, PCH, PEBK, PHG, PKG, PKX, PRK, PW, RBB, RMBI, RRC, SANM, SBAC, SCCO, SEB, SFBC, SSBI, SSD, SSNC, SUI, SVBI, TBI, TCF, TNET, TOWN, TSLA, TV, UHS, UHT, WIRE, WRI\n\n - Ex-div:\n\n  AZZ, CVLY, QIWI, SPNS\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.152%)\n    - 3-Month Bill Auction (previous: 0.025%)\n    - 5-Year Note Auction (previous: 0.850%)\n    - 6-Month Bill Auction (previous: 0.040%)\n    - Core Durable Goods Orders (consensus: 1.6%, previous: -0.9%)\n    - Dallas Fed Mfg Business Index (previous: 28.9)\n    - Durable Goods Orders (consensus: 2.5%, previous: -1.2%)\n    - Durables Excluding Defense (previous: -0.8%)\n    - Goods Orders Non Defense Ex Air (consensus: 1.5%, previous: -0.9%)\n    - Investing.com Gold Index (actual: 52.0%, previous: 48.9%)\n    - Investing.com S&amp;P 500 Index (actual: 33.1%, previous: 39.6%)\n\n## Upcoming events for Tuesday, April 27th\n\n - Stock splits:\n\n    - NSPR @ **1:15**\n\n - Expected earnings:\n\n  AAN, AAT, ABB, ABG, ACCO, ACGL, ACH, ADM, AHC, AJRD, AKO.A, AKO.B, AMD, AMGN, AMX, APAM, ARAY, ARVN, ATEN, ATNI, ATRC, AUDC, AWI, AWRE, BFST, BP, BSBR, BUSE, BXP, BYD, CAC, CALX, CASH, CB, CEQP, CHE, CHRW, CNC, COF, CROX, CRSP, CSGP, CYBE, CZWI, DTE, EBMT, ECL, EGP, EHC, EIX, ENPH, ENTG, EQR, ESBK, ESS, FBNC, FCF, FCPT, FELE, FEYE, FFIC, FFIV, FFNW, FFWM, FIBK, FISV, FRST, FSV, FTI, GE, GFF, GLW, GOOD, GOOG, GOOGL, GPK, HA, HAFC, HAS, HBCP, HEES, HFBL, HIW, HOPE, HRZN, HSBC, HUBB, HVT, HVT.A, IBA, IBCP, IEX, ILMN, IRBT, IVZ, JBLU, JNPR, KNSA, KTCC, LBC, LBRT, LDL, LECO, LLY, MANH, MATX, MDLZ, MKL, MMC, MMM, MRC, MSCI, MSFT, MSTR, MVBF, MXIM, NAVI, NCR, NOV, NVS, NXRT, ODT, OKE, OLN, OMAB, OPRA, OXSQ, PCAR, PFG, PHM, PII, PINS, PJT, PPBI, PPD, PROV, PSB, PTSI, QCRH, QTS, RCKY, RNDB, RNST, ROIC, ROP, RRD, RTX, RXN, SAN, SBUX, SCL, SFST, SHW, SMIT, SPFI, SQNS, SSTK, ST, SYF, SYK, SYX, TENB, TER, TFII, TKC, TPB, TRMK, TRMT, TRU, TSBK, TX, TXN, UBS, UDR, UMBF, UPS, USNA, V, VALE, VBTX, VET, VIST, WDR, WM, WNEB, WSBC, WSBF, WW, YUMC\n\n - Ex-div:\n\n  AM, ATR, BK, CALM, ENTG, IFS, QADA, QADB, VSEC\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 1.300%)\n    - API Weekly Crude Oil Stock (previous: 0.436M)\n    - CB Consumer Confidence (consensus: 113.0, previous: 109.7)\n    - Dallas Fed Services Revenues (previous: 21.6)\n    - House Price Index (previous: 1.0%)\n    - House Price Index (previous: 12.0%)\n    - House Price Index (previous: 316.7)\n    - Redbook (previous: -17.2%)\n    - Redbook (previous: 13.5%)\n    - Richmond Manufacturing Index (previous: 17)\n    - Richmond Manufacturing Shipments (previous: 22)\n    - Richmond Services Index (previous: 16)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 11.7%, previous: 11.1%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.1%, previous: 1.2%)\n    - Texas Services Sector Outlook (previous: 28.9)\n\n## Upcoming events for Wednesday, April 28th\n\n - Expected earnings:\n\n  AAPL, ADP, AER, AFL, AGI, AKR, ALGN, ALRS, ALSN, ALTA, AM, AMED, APH, AR, ARCC, ASGN, ATOM, ATUS, AUY, AVB, AVT, AVTR, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BHLB, BLKB, BPOP, BRKL, BSMX, BSX, BXMT, CAKE, CAMT, CBTX, CCS, CDE, CHEF, CHX, CINF, CIT, CLR, CME, CMO, CNMD, CNO, CONE, CPF, CSTM, CUBI, CYH, DAN, DISCA, DISCB, DISCK, DMRC, DRE, DX, EBAY, ECHO, EQIX, ESI, ESRT, ETR, EVA, EVR, EXR, EXTR, F, FARO, FB, FCNCA, FISI, FNF, FORM, GD, GIB, GRMN, GRUB, GSK, GTY, HBNC, HELE, HES, HESM, HNI, HOLX, HT, HUM, IART, ICAD, ICLR, INOV, INVH, IPG, IRT, ISBC, JAKK, KALU, KNL, KRA, KRC, LC, LFUS, LIVN, LOGI, LXU, MAA, MAS, MC, MCO, MCRI, MEOH, MGM, MGRC, MHH, MHO, MLP, MN, MOH, MORN, MPX, MSVB, MTDR, MTH, MUSA, MXL, NBR, NGVT, NLY, NOA, NOVA, NOW, NSC, NTB, NYCB, OBNK, OC, OI, OII, OIS, ORLY, ORN, OSK, OVLY, OVV, PAG, PB, PDM, PEGA, PGRE, PI, PPC, PSA, PTC, QCOM, R, RBBN, RE, RES, RJF, RNR, ROK, ROL, RWT, SAIA, SC, SGC, SHOO, SHOP, SIGI, SIRI, SIX, SJW, SLAB, SLGN, SMED, SNY, SONY, SP, SPOT, SRDX, SREV, SRI, SSB, SWK, SXC, TDOC, TDY, TECK, TEVA, TKR, TNL, TR, TROX, TTEK, TTMI, TWOU, TYL, UCTT, UFI, UMC, URI, UVE, UVSP, VNE, VRT, VRTS, VSEC, VVV, WCN, WELL, WERN, WH, WING, WNC, WRE, WWW, YNDX, YUM\n\n - Ex-div:\n\n  BPMP, BSRR, CFG, FRC, ITUB, KEN, KNOP, MAIN\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.416M)\n    - Crude Oil Inventories (previous: 0.594M)\n    - Cushing Crude Oil Inventories (previous: -1.318M)\n    - Distillate Fuel Production (previous: -0.088M)\n    - EIA Refinery Crude Runs  (previous: -0.286M)\n    - EIA Weekly Distillates Stocks (consensus: -0.956M, previous: -1.074M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.7%, previous: 1.0%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision\n    - Gasoline Inventories (consensus: 0.464M, previous: 0.086M)\n    - Gasoline Production (previous: -0.229M)\n    - Goods Trade Balance (previous: -87.07B)\n    - Heating Oil Stockpiles (previous: 0.563M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 8.6%)\n    - MBA Purchase Index (previous: 295.5)\n    - Mortgage Market Index (previous: 724.8)\n    - Mortgage Refinance Index (previous: 3,219.9)\n    - Retail Inventories Ex Auto (previous: 1.2%)\n    - Wholesale Inventories (previous: 0.6%)\n\n## Upcoming events for Thursday, April 29th\n\n - Expected earnings:\n\n  AB, ABMD, ABTX, ACA, ACHC, ADS, AEM, AGCO, AGIO, AIMC, AIRC, AIT, AJG, ALEX, ALGT, ALNY, AMRN, AMSF, AMT, AMTB, AMZN, AOS, AQMS, ARES, ARW, ASPN, ASPS, ATGE, ATI, ATKR, ATR, AVEO, AX, BAX, BBD, BBDO, BBVA, BC, BCE, BGCP, BHB, BIO, BIO.B, BKCC, BLDR, BLMN, BMRN, BMY, BSIG, BSVN, BVN, BWB, BY, BZH, CARR, CASA, CAT, CBNK, CBRE, CBZ, CCOI, CDNA, CENX, CFR, CFX, CG, CHD, CHT, CLGX, CLS, CLVT, CMCSA, CMS, CNCE, CNOB, CNSL, CNX, CODI, COG, COHU, COLB, COLM, COOP, COP, COR, COWN, CPT, CQP, CRAI, CRS, CRUS, CRVS, CRY, CSLT, CTG, CTO, CTS, CTXS, CUBE, CURO, CUZ, CVA, CWST, CWT, CX, CXP, DAIO, DLR, DPZ, DVD, DXCM, EBC, EBS, EEFT, EGO, EHTH, EKSO, EME, EMN, ENVA, ERIE, ERII, ERJ, ETH, EVBN, EVTC, EXLS, EXPO, FBC, FBHS, FCN, FDUS, FHI, FIVN, FLIC, FLWS, FMBH, FMX, FSLR, FSP, FTAI, FTNT, FTV, FWRD, GEO, GHL, GIGM, GILD, GLPI, GNCA, GNRC, GNW, GPI, GRA, GSHD, GT, GWB, HAYN, HGV, HIG, HP, HSY, HTGC, HUBG, HWBK, ICE, IDA, IDRA, IKNX, IMAX, INSM, INT, IP, ISDR, ITGR, JHG, KBR, KDP, KEX, KHC, KIM, KLAC, KMPR, KNSL, KRG, KRNY, LAWS, LBAI, LBPS, LEVL, LFVN, LH, LKQ, LLNW, LMAT, LOCO, LPLA, LTC, LTRX, LYG, MA, MATW, MCD, MDC, MDP, MDRX, MERC, MFIN, MFNC, MGNX, MHK, MITK, MKTY, MMP, MMSI, MO, MRK, MRLN, MTLS, MTRN, MTSI, MTZ, NATI, NDLS, NEM, NIO, NLSN, NOC, NOK, NPTN, NREF, NTST, NVCR, NVT, OCFC, OFC, OMCL, ONEW, ONTO, OPI, OPOF, ORBC, ORC, OSIS, OSTK, PACB, PATK, PBF, PBFX, PCB, PCG, PCSB, PEB, PFPT, PH, PMBC, POWI, PRAH, PRFT, PRG, PRGO, PTEN, QUMU, RDS.A, RDS.B, RFP, RLGY, RMD, ROG, SAH, SAMG, SCX, SF, SFE, SGEN, SHBI, SHEN, SILC, SKYW, SM, SMMF, SNDR, SNP, SO, SPGI, SPSC, SRG, STAR, STM, STND, STRA, SWI, SWKS, SWN, SYNH, TACO, TAP, TAP.A, TBBK, TBNK, TDS, TEAM, TEX, TFSL, TFX, THG, THRM, TIGO, TMHC, TMO, TPL, TPR, TPX, TREE, TROW, TRS, TRTN, TRUP, TW, TWTR, TXRH, TXT, UBSI, ULBI, ULH, USAK, USM, UTL, VC, VCRA, VICI, VIRC, VKTX, VLY, VRNA, VRTX, WAB, WDC, WEX, WLTW, WRAP, WSC, WST, WTBA, X, XEL, ZEN\n\n - Ex-div:\n\n  ADC, AES, AGNC, ALLY, AOS, ARC, ASAI, ATLO, AVAL, BMRC, BRMK, CAG, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, FT, GEL, KFFB, KMI, LNT, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PNM, PRT, PSEC, PSXP, PZN, RELX, SCHL, SCM, SJT, SKT, SQM, STAG, STL, TRGP, UNB, UNM, VOC, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.005%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Continuing Jobless Claims (consensus: 3,614K, previous: 3,674K)\n    - Core PCE Prices (consensus: 2.40%, previous: 1.30%)\n    - Corporate Profits (previous: -3.3%)\n    - GDP (consensus: 6.1%, previous: 4.3%)\n    - GDP Price Index (consensus: 2.5%, previous: 1.9%)\n    - GDP Sales (previous: 2.9%)\n    - Initial Jobless Claims (consensus: 549K, previous: 547K)\n    - Jobless Claims 4-Week Avg. (previous: 651.00K)\n    - Natural Gas Storage (consensus: 49B, previous: 38B)\n    - PCE Prices (previous: 1.5%)\n    - Pending Home Sales (consensus: 4.7%, previous: -10.6%)\n    - Pending Home Sales Index (previous: 110.3)\n    - Real Consumer Spending (previous: 2.3%)\n\n^^^^2021-04-26",
        "created_utc": 1619431217,
        "id": "gvww79d",
        "permalink": "/r/RobinHood/comments/myu6ia/daily_discussion_thread_april_26th_2021/gvww79d/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619460017.0
    },
    {
        "author": "kkInkr",
        "body": "There are bunch of chip companies, why just focus on AMD, NVDA, INTC, TSM.\n\nADI, AMAT, ASML, ATEYY, AVGO, KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI, QCOM, QRVO, SIMO, SWKS, TER.\n\nThere's also some small ones: Pixelworks, Himax.\n\nThere's also the design part: CDNS, SNPS.",
        "created_utc": 1617547643,
        "id": "gtcnpap",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtcnpap/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617576443.0
    },
    {
        "author": "spyVSspy420-69",
        "body": "On mobile Reddit auto-generates usernames that follow this exact cadence. Word-word-number.",
        "created_utc": 1617885669,
        "id": "gtsy478",
        "permalink": "/r/stocks/comments/mmmlhm/is_another_family_office_blowing_up_jpm_dumps_9mm/gtsy478/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617914469.0
    },
    {
        "author": "ctophermh89",
        "body": "I really like fidelity a lot. I use it in cadence with yahoo finance app to sort of fill in the gaps of fidelty’s app (I only use my phone to invest). \n\nI think MSOS is a pretty awesome etf for the American market. I also am holding a lot of HITIF with the etf MSOS. Those two make up the bulk of my American weed sector in my portfolio.\n\nAs mentioned before, if you are going long term, only buy on red days, never sell if you believe in what you are investing in, and understand red days are constant. I take the “gotta catch em all” approach to weed, where I just keep adding shares at every downturn and learn to manage my tears.",
        "created_utc": 1618669408,
        "id": "guuqi7y",
        "permalink": "/r/weedstocks/comments/mso0h3/daily_discussion_thread_april_17_2021/guuqi7y/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1618698208.0
    },
    {
        "author": "ThisPomelo4",
        "body": "[From the penultimate quarter:](https://www.fool.com/earnings/call-transcripts/2020/10/14/asml-holding-nv-asml-q3-2020-earnings-call-transcr/)\n\n&gt;With 10 shipments this quarter, we have shipped 23 EUV systems year-to-date. \\[...\\] We're still planning to manufacture 35 systems this year, but due to the pace of customers' node ramps and their fab readiness, a few systems may end up being shipped early next year. But despite this potential shift of shipments to early next year, we are still targeting EUV revenue to approach EUR4.5 billion this year. \\[...\\] We are on-track with our EUV cycle time reduction plan to get to 20 weeks by the end of the year, enabling a capacity of 45 to 50 systems. With respect to demand for next year, we currently have an EUV systems backlog of EUR6.2 billion, exiting Q3 with around 65% of this backlog planned for shipment next year.  \n&gt;  \n&gt;\\[...\\]  \n&gt;  \n&gt;We are preparing also to be able to ship more, because, to your point, if you would really already follow the order intake and then add 12 months lead time, it's never going to work. So, you have to prepare for more because you would expect that there is a decent chance that you see some upside next year and you want to be ready. So, this is where the 12 months lead time is actually -- actually, that is more than 12 months, it's more like 18 months. But if you then prepare yourself, because you do expect this, then you could of course accept POs with a delivery time that's way within that 18 months. So, yes, we are preparing for more, and time will tell whether the customers need it in that timeframe 2021. I think they could, but time will tell. There's a real opportunity there.\n\n[From the most recent quarter:](https://www.fool.com/earnings/call-transcripts/2021/01/20/asml-holding-nv-asml-q4-2020-earnings-call-transcr/)\n\n&gt;As Roger mentioned, we shipped nine systems and recognized revenue on eight systems in Q4, bringing the total to 31 systems in 2020 with a revenue of EUR4.5 billion for the year. This translates to about 60% growth in EUV systems revenue, reflecting the expanding use of this technology in high volume manufacturing. Based on customers' growing EUV demand in advanced nodes, we currently expect the growth of around 30% over last year, translating to around EUR5.8 billion in EUV system revenue for 2021. We continue to improve the EUV manufacturing cycle time to enable a capacity in our factory to meet the growing EUV demand. We will continue to drive the EUV 0.33NA product roadmap, which is aligned to our customers' node cadence.\n\n[From the video interview for the most recent quarter:](https://www.asml.com/-/media/asml/files/investors/financial-results/q-results/2020/q4/video-transcript-q4-fy-2020-roger-dassen-3ef67y.pdf)\n\n&gt;We are making good progress in our manufacturing capacity. Primarily, as we said before, by driving down the cycle time. The one limiting factor that we have this year really is the orders that we placed into the supply chain. We had to adjust that during the COVID situation. So that will be the limiting factor for this year.\n\n[From the quarter before those two, in the middle of last year:](https://www.fool.com/earnings/call-transcripts/2020/07/15/asml-holding-nv-asml-q2-2020-earnings-call-transcr.aspx)\n\n&gt;Secondly, as you will appreciate, with the ramp that we're doing and with the increase that we're seeing in EUV, obviously that also means that from an inventory perspective, that leads to an uptick as well.\n\n[From the last report prior to the pandemic going global:](https://www.fool.com/earnings/call-transcripts/2020/01/22/asml-holding-nv-asml-q4-2019-earnings-call-transcr.aspx)\n\n&gt;In the short-term you may expect that inventory levels will continue to go up a little bit, that's a dynamic on the one hand. \\[...\\] Also, I would expect that in a one to two year timeframe, you might expect inventory levels to go down for a number of reasons. First off, at that stage we talk about 2021; there is a significant buildup of our capacity for EUV. But once you are there and once you are at those levels, then the further build up of inventory will no longer have an impact on your inventory levels. And secondly, as we mentioned before, the way we believe we will be able to get an increase in our capacity from the 35%-ish that we have for this year to the 45%, 50%, that we talked about for 2021, will primarily be the reduction of cycle time, and of course the reduction of cycle time will then kick in and further reduce working capital requirement.",
        "created_utc": 1617594607,
        "id": "gtf28c1",
        "permalink": "/r/options/comments/mi9kxb/playing_the_semiconductor_shortage/gtf28c1/",
        "score": 1,
        "subreddit": "options",
        "created": 1617623407.0
    },
    {
        "author": "saltedbeagles",
        "body": "I appreciate what you have to say, I read it to my high-school years popular grad song/speech  \n\nhttps://youtu.be/MQlJ3vOp6nI\n\nIt had the same proverbial wisdom and cadence.\n\nI'm 41 and just getting started, sadly my father hasn't worked a day since he was 41 from investing and tried really hard to transfer that knowledge to me but I'm stubborn \"I got this.\"",
        "created_utc": 1617789519,
        "id": "gto6b3k",
        "permalink": "/r/stocks/comments/mlux4z/for_the_youth_just_broad_strokes_what_ive_learned/gto6b3k/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617818319.0
    },
    {
        "author": "Socially8roken",
        "body": "I literally copy/pasted. I didn’t feel like it flowed right with original cadence",
        "created_utc": 1617971652,
        "id": "gtx9b06",
        "permalink": "/r/wallstreetbets/comments/mnf6e4/gme_megathread_for_april_09_2021/gtx9b06/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618000452.0
    },
    {
        "author": "kkInkr",
        "body": "ZTS, CDNS, SNPS, ANSS, TER",
        "created_utc": 1618724286,
        "id": "guxwrsz",
        "permalink": "/r/stocks/comments/msqx2g/5_stock_picks_for_the_next_5_years/guxwrsz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618753086.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Friday, the 23rd of April\n\n\n\n## Upcoming events for Friday, April 23rd\n\n - Stock splits:\n\n    - VXX @ **1:4**\n\n - Expected earnings:\n\n  ALV, AROW, AXP, AZZ, BCML, BOTJ, BRID, CBAN, CIVB, CIZN, CWBC, E, ESQ, ESXB, FHB, FSBW, GCBC, GNTX, HON, KMB, LFC, LSBK, MCBS, MOG.A, MOG.B, PBIP, PFIS, RF, SBSI, SLB, SXT\n\n - Ex-div:\n\n  ACI, CAT, CE, DHC, FAST, ILPT, OKE, OPI, RMR, RMRM, SLP, SVC, TRMT, USAC, VALU\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.4K)\n    - CFTC Copper speculative net positions (previous: 36.0K)\n    - CFTC Corn speculative net positions (previous: 543.3K)\n    - CFTC Crude Oil speculative net positions (previous: 492.7K)\n    - CFTC Gold speculative net positions (previous: 180.9K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -6.1K)\n    - CFTC Natural Gas speculative net positions (previous: -51.3K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -40.1K)\n    - CFTC Silver speculative net positions (previous: 36.4K)\n    - CFTC Soybeans speculative net positions (previous: 224.0K)\n    - CFTC Wheat speculative net positions (previous: 5.5K)\n    - Manufacturing PMI (consensus: 60.5, previous: 59.1)\n    - Markit Composite PMI (previous: 59.7)\n    - New Home Sales (consensus: 12.0%, previous: -18.2%)\n    - New Home Sales (consensus: 886K, previous: 775K)\n    - Services PMI (consensus: 61.9, previous: 60.4)\n    - U.S. Baker Hughes Oil Rig Count (previous: 337)\n    - U.S. Baker Hughes Total Rig Count (previous: 432)\n\n## Upcoming events for Monday, April 26th\n\n - Expected earnings:\n\n  ACI, AGNC, AIN, AMG, AMKR, AMP, ARE, ARLP, AXTA, BCLI, BOH, BRO, CATY, CBU, CCB, CDNS, CHKP, CNI, CVLG, DGICA, DGICB, DHIL, DORM, EBTC, EFSC, FBK, FBP, FCAP, FIX, FLXS, FNCB, FRAF, FRBA, HBT, HLX, HMST, HONE, HSII, HSTM, HTLF, IBTX, ILPT, JBT, JJSF, KOF, KREF, LII, LKFN, LXFR, LXRX, MASI, MEDP, MEDS, MKSI, MPB, MRBK, MSB, NBTB, NRIM, NTP, NWBI, NXPI, OMF, OTIS, OVBC, PCH, PEBK, PHG, PKG, PKX, PRK, PW, RBB, RMBI, RRC, SANM, SBAC, SCCO, SEB, SFBC, SSBI, SSD, SSNC, SUI, SVBI, TBI, TCF, TNET, TOWN, TSLA, TV, UHS, UHT, WIRE, WRI\n\n - Ex-div:\n\n  AZZ, CVLY, QIWI, SPNS\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.152%)\n    - 3-Month Bill Auction (previous: 0.025%)\n    - 5-Year Note Auction (previous: 0.850%)\n    - 6-Month Bill Auction (previous: 0.040%)\n    - Core Durable Goods Orders (consensus: 1.5%, previous: -0.9%)\n    - Dallas Fed Mfg Business Index (previous: 28.9)\n    - Durable Goods Orders (consensus: 1.8%, previous: -1.2%)\n    - Durables Excluding Defense (previous: -0.8%)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: -0.9%)\n\n^^^^2021-04-23",
        "created_utc": 1619172014,
        "id": "gvjt0ld",
        "permalink": "/r/RobinHood/comments/mwrur1/daily_discussion_thread_april_23rd_2021/gvjt0ld/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619200814.0
    },
    {
        "author": "Squamsk",
        "body": "I DONT KNOW BUT IM RETARDED (i dont know but I'm retarded) idk some military cadence I guess",
        "created_utc": 1617989451,
        "id": "gtyby7l",
        "permalink": "/r/wallstreetbets/comments/mnf6e4/gme_megathread_for_april_09_2021/gtyby7l/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1618018251.0
    }
]