[
    {
        "author": "beaverlyknight",
        "body": "Now this is podracing",
        "created_utc": 1615397793,
        "id": "gqgwra4",
        "score": 5939,
        "subreddit": "wallstreetbets",
        "created": 1615426593.0
    },
    {
        "author": "its_dizzle",
        "body": "Best part about it is the dude asking him if he'd buy at 40 in the hearing didn't believe him when he simply said, \"yes\". Wonder what that asshole is thinking now...",
        "created_utc": 1615239499,
        "id": "gq9bpjg",
        "score": 3275,
        "subreddit": "wallstreetbets",
        "created": 1615268299.0
    },
    {
        "author": "lovekat1",
        "body": " Americans! \n\nEuropeans have been holding GME at the $ 120 mark for almost 7 hours. And it's deceptively quiet now. We're going to the moon together in an hour and a half! \n\nGreetings from Frankfurt, Germany.",
        "created_utc": 1614777022,
        "id": "gpj2vy4",
        "score": 2261,
        "subreddit": "wallstreetbets",
        "created": 1614805822.0
    },
    {
        "author": "LonelySwinger",
        "body": "#It would be a shame if deep ITM call holders exercised right now. A real shame I tell you.",
        "created_utc": 1615409173,
        "id": "gqhpale",
        "score": 1772,
        "subreddit": "wallstreetbets",
        "created": 1615437973.0
    },
    {
        "author": "jaboyles",
        "body": "Yeah that's the craziest part I think. Dude turned $50,000 into $40,000,000 and it was barely even a gamble. He did his research and his thesis was rock solid. For fucks sake, he got those $12 calls for $20 a piece!! It seems so obvious now looking back doesn't it? Plus, he's actually a gamer and loves the company which is just an added benefit for him. He had to wait 2 years for these gains. That's the key to buying low; being first and fucking waiting.",
        "created_utc": 1615240261,
        "id": "gq9de1u",
        "score": 1348,
        "subreddit": "wallstreetbets",
        "created": 1615269061.0
    },
    {
        "author": "WallStreetBets_",
        "body": "I’m fighting for my fuckin life right now.",
        "created_utc": 1614805255,
        "id": "gpkti31",
        "score": 1028,
        "subreddit": "wallstreetbets",
        "created": 1614834055.0
    },
    {
        "author": "Relevant-Grape",
        "body": "And now they worth 9 fucking million 🤣",
        "created_utc": 1617222969,
        "id": "gsyeiw8",
        "score": 994,
        "subreddit": "wallstreetbets",
        "created": 1617251769.0
    },
    {
        "author": "Hibbo_Riot",
        "body": "Now imagine they realize that half of us watched that going, “interesting, I wonder what that tastes like” and a non zero number of us took a bite out of a crayon to find out.",
        "created_utc": 1615411247,
        "id": "gqhu32o",
        "score": 987,
        "subreddit": "wallstreetbets",
        "created": 1615440047.0
    },
    {
        "author": "SirLouisI",
        "body": "I am sorry about your loss.\nTake longer if you need to.  I lost around 150k last summer on short dated AMZN calls and i had all the same feelings and emotions.  Not sure about you but i have a 2 kids and a wife as well... i went from feeling financially secure to extremely insecure overnight.  \n\nI spent the next few months making emotional decisions trying to win it back.  BIG MISTAKE.  Do not do that.  \n\nTake time off, decide on a rational INVESTMENT strategy and get back in when you are ready.\n\nLosing significant sums of money is a life event... like getting fired, getting married, etc.  Acknowledge that, take time off, reflect... embrace how you are feeling now so you remember what it feels like next time you want to yolo.\n\nLets also accept the fact most of us are gambling... perhaps you (and me for that matter) need to think long and hard about (y)our motives for that yolo.  Get rich quick or slow and steady for retirement?  \n\nLastly, staying on WSB and other similar subs is unhealthy during your time off.  Seeing gain porn is the worst thing you can see right now... it will make you want to jump right back in.  FOMO is a real emotion and can cause us to make emotional rather than rational decisions.  \n\nWhen i had to get sober, i changed friends and stayed out of bars for a couple years. \n\nThese subs are our bars...",
        "created_utc": 1614847390,
        "id": "gpmugrk",
        "score": 872,
        "subreddit": "options",
        "created": 1614876190.0
    },
    {
        "author": "chrozz",
        "body": "Order filled for one more at $270 right when they hit us with a 1.27m share attack. I’m happy about it. Now I know ape are stronger and will survive through the attempts to end ape.",
        "created_utc": 1615409122,
        "id": "gqhp69a",
        "score": 827,
        "subreddit": "wallstreetbets",
        "created": 1615437922.0
    },
    {
        "author": "jonmarcus",
        "body": "If it goes above $1,000, I'll suck your dick. \n\nAnd I'm not gay, but I hope it really does because I'm super fucking long GME right now.",
        "created_utc": 1614824495,
        "id": "gplw7a7",
        "score": 810,
        "subreddit": "wallstreetbets",
        "created": 1614853295.0
    },
    {
        "author": "Secure-Ad1612",
        "body": "Cunty Congressman: “Your original price target was $20, would you even think of buying GME now at $45? Lolol”\n\nDFV: “Tha fuck do you think?”",
        "created_utc": 1615238205,
        "id": "gq98spu",
        "score": 799,
        "subreddit": "wallstreetbets",
        "created": 1615267005.0
    },
    {
        "author": "Giulio-Cesare",
        "body": "People waking up right now and checking their portfolio will never know about the rollercoaster.",
        "created_utc": 1615410858,
        "id": "gqht7a2",
        "score": 784,
        "subreddit": "wallstreetbets",
        "created": 1615439658.0
    },
    {
        "author": "Ragnaroktogon",
        "body": "I miss this sub being a bunch of people humbly referring to themselves as idiots and degenerates.\n\nNow it’s a bunch of actual idiots here. Now, I’m also a firm believer that with time, people will learn the culture and will calm down or leave. It’s just going to take a while because the sub grew so fast. It’s been insane to watch.",
        "created_utc": 1614783254,
        "id": "gpjep96",
        "score": 701,
        "subreddit": "wallstreetbets",
        "created": 1614812054.0
    },
    {
        "author": "macho_macaroni",
        "body": "They stay delta neutral. This means when they sell a call contract, they will by shares equal to the delta. For example, if they sell a contract with a delta of 0.5, they will buy 50 shares. That way, if the share price goes up a dollar, they will break even (-$50 on the call and +$50 on the shares). And vice versa if the price drops a dollar.\n\nHowever, you also have to take gamma into affect. Delta does not remain constant as the price fluctuates. Take the same example and assume gamma is 0.1. Let's say the price raises a dollar. The MM comes out even as explained. But because of the gamma, delta is now 0.6 and the MM is no longer delta neutral. They must buy another 10 shares. OK, fine, so they do that and they are neutral again. HOWEVER, if they have to do so in such a large volume that it actually raises the share price, it can have a compounding effect: buying shares to delta hedge raises the price, which raises the number of shares they need to hedge. This is a gamma squeeze.",
        "created_utc": 1614900022,
        "id": "gppn6bf",
        "score": 581,
        "subreddit": "wallstreetbets",
        "created": 1614928822.0
    },
    {
        "author": "bomalong",
        "body": "since tech is apparently no longer necessary for the future of humanity i will now be making stone tools for a living",
        "created_utc": 1614855655,
        "id": "gpn2zfe",
        "score": 556,
        "subreddit": "wallstreetbets",
        "created": 1614884455.0
    },
    {
        "author": "AaronDonald4MVP",
        "body": "My buddy bought 1 share at $340 and held out of spite. I seriously screenshotted $345 and told him \"Sell for zero profit now, or hold for greatness\" and the price immediately dropped to $220 lol.\n\nThis is probably my fault.",
        "created_utc": 1615397854,
        "id": "gqgwybb",
        "score": 535,
        "subreddit": "wallstreetbets",
        "created": 1615426654.0
    },
    {
        "author": "HoleyProfit",
        "body": "The biggest loss of a trader can become their greatest asset. Losing large sums of money re-wires your brain. It makes you more alert to risk.  More intelligent in assessing risks to take. \n\n&amp;#x200B;\n\nThe first time I lost a large sum of money I thought my life was over. When I look at it now, I doubt I'd have been able to ever sustain lasting success without taking a really big hit.  Go and read something like \"Market Wizards\", and you'll see this is a recurring theme amounts traders.\n\n&amp;#x200B;\n\nYou're welcome to DM me if you want.",
        "created_utc": 1614828795,
        "id": "gpm4qhy",
        "score": 535,
        "subreddit": "options",
        "created": 1614857595.0
    },
    {
        "author": "joshatron",
        "body": "I did this on a few stocks 2 weeks ago, but they kept on dipping and now I’m down 50%",
        "created_utc": 1614750994,
        "id": "gpi8fni",
        "score": 497,
        "subreddit": "smallstreetbets",
        "created": 1614779794.0
    },
    {
        "author": "imissaolchatrooms",
        "body": "Been doing this 30 years.  Now is the time to be active.  When it's all green lights is the time to pay less attention and relax.  When times are tough look amongst all the piles of shit for gold nuggets. I started feeding in cash yesterday.",
        "created_utc": 1614817645,
        "id": "gpljnma",
        "score": 490,
        "subreddit": "stocks",
        "created": 1614846445.0
    },
    {
        "author": "local_therapist",
        "body": "I wouldn't be surprised if there are now bots and shills in wsb calling everyone else bots and shills rn",
        "created_utc": 1614797015,
        "id": "gpkaglf",
        "score": 451,
        "subreddit": "wallstreetbets",
        "created": 1614825815.0
    },
    {
        "author": "nemyhlol",
        "body": "Anyone else normalized to huge daily swings now? GME is up 40% and I'm still bored waiting for shit to happen. This is like getting desensitized to normal porn and needing the weird Japanese stuff to get off.",
        "created_utc": 1615237231,
        "id": "gq96ktz",
        "score": 425,
        "subreddit": "wallstreetbets",
        "created": 1615266031.0
    },
    {
        "author": "TheMotherConspiracy",
        "body": "Just post her latitude &amp; longitude and the legend will hit her from wherever he's at right now.",
        "created_utc": 1615238404,
        "id": "gq998x3",
        "score": 397,
        "subreddit": "wallstreetbets",
        "created": 1615267204.0
    },
    {
        "author": "marsthemartiann",
        "body": ")))              (((ヽ. WHERE THE HEDGES AT NOW?\n\n|  \\                     |  \\\n\n|   ( \\      (.       /)     |     )\n\nヽ   ヽ `  ( ͡° ͜ʖ ͡°)  _ノ    /\n\n     ＼   |   ⌒Ｙ⌒   /  /\n\n         | ヽ     |      ﾉ ／\n\n         ＼トー仝ーイ\n\n              | ミ土彡/\n\n            ) \\      °   /(\n\n           (     \\      /     )         \n\n                  ѼΞΞΞΞΞΞΞΞΞΞΞΞD~ CUM in MELVIN/VLAD🐻\n\n       /  /     /      \\ \\   \\ }\n\n       ( (    ).           ) ).  ) }{\n\n      (      ).            ( |    | { {\n\n       |    /                \\    / { }\n\nGAMESTONK TO THE FUCKING 🌙",
        "created_utc": 1615409148,
        "id": "gqhp8dd",
        "score": 375,
        "subreddit": "wallstreetbets",
        "created": 1615437948.0
    },
    {
        "author": "pmMe-PicsOfSpiderMan",
        "body": "Now this is pod racing",
        "created_utc": 1614875297,
        "id": "gpo1y05",
        "score": 373,
        "subreddit": "wallstreetbets",
        "created": 1614904097.0
    },
    {
        "author": "Fit_Independent2105",
        "body": "I bought the dip. And then I bought the dip's dip. And then I bought the dippier dip. I'm gonna need a helluva lot of chips for all this dip I've got now.",
        "created_utc": 1614901108,
        "id": "gpppcdo",
        "score": 361,
        "subreddit": "stocks",
        "created": 1614929908.0
    },
    {
        "author": "fiscalplasticity",
        "body": "I swear if I see Benzinga, yahoo finance and MSNBC spam ads tomorrow saying “move over RKT and GME! CUM and ASS is what’s coming out of wallstreetbets mouth right now” \n\nI’ll die satisfied with what I’ve witnessed accomplished in my lifetime",
        "created_utc": 1614901079,
        "id": "gpppa7f",
        "score": 359,
        "subreddit": "Wallstreetbetsnew",
        "created": 1614929879.0
    },
    {
        "author": "HedgieBadStonkGood",
        "body": "I highly recommend doing your own DD. It’s not a good idea to just “follow the pack” when it comes to investing. Not only can it lead to you becoming a bag holder, but the SEC frowns upon the “we talk” you mentioned in your post. I do not mean this in any rude way but everyone makes their decisions themselves and is ultimately for themselves. We are not a pack here in WSB. We are individual investors who do not coordinate in any way on a stock. \n\nIf you see information that is scattered, like you mentioned, it is imperative to do your own research and figure out what is true and what is not. Not everyone who got in early on RKT did DD but the people who got in last week and knew about this definitely did. \n\nAs far as UWMC goes, I have seen a few posts about it but nothing close to the amount on RKT or GME. I plan on doing my own DD on UWMC tonight before deciding to go in tomorrow morning. \n\nI have no positions in UWMC as of now but I am intrigued enough to do some DD and possibly get in tomorrow. \n\nAnother major point to keep in mind, if you do get into something like RKT, make sure you have a PT in mind and do not be greedy. My EOW PT for RKT was hit today and I cashed out to secure my profits. Could it continue its run the rest of the week? Absolutely. Could it pullback and decline the rest of the week? Absolutely. If you plan on getting into UWMC, plan on how you will get out. Everyone likes to talk about how losses aren’t realized until you sell. But the same goes for gains. It’s great seeing green in your account but until you sell, it’s not real.\n\nAlso, this is a casino.",
        "created_utc": 1614733163,
        "id": "gphclk3",
        "score": 356,
        "subreddit": "wallstreetbets",
        "created": 1614761963.0
    },
    {
        "author": "thebullishbearish",
        "body": "And now we are all living in a van, down by the river.",
        "created_utc": 1614866442,
        "id": "gpnip7i",
        "score": 354,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1614895242.0
    },
    {
        "author": "angiexbby",
        "body": "i didn’t sell at $450 why would i sell now?",
        "created_utc": 1615398365,
        "id": "gqgyih0",
        "score": 342,
        "subreddit": "wallstreetbets",
        "created": 1615427165.0
    },
    {
        "author": "SquishedPeter",
        "body": "About 5 seconds after I hit \"add comment\" I laughed at my comment, then I thought... \"these fuckers will actually do it, won't they?\". \n\nAnd now my cat has made it to the top of /r/all and I've got an inbox full of thousands of cool pet pictures from people around the world. It's perfect.",
        "created_utc": 1614742961,
        "id": "gphvkjl",
        "score": 326,
        "subreddit": "wallstreetbets",
        "created": 1614771761.0
    },
    {
        "author": "TimelostExile",
        "body": "Now imagine how fucked you'd be if you bought the spike before it started dipping.",
        "created_utc": 1614751188,
        "id": "gpi8p32",
        "score": 292,
        "subreddit": "smallstreetbets",
        "created": 1614779988.0
    },
    {
        "author": "ShadeShow",
        "body": "I’m now up to 4 shares. I like the stock!",
        "created_utc": 1614812607,
        "id": "gpl9rvd",
        "score": 267,
        "subreddit": "wallstreetbets",
        "created": 1614841407.0
    },
    {
        "author": "Ragnaroktogon",
        "body": "Now that? That’s impressive. How’d you do that?",
        "created_utc": 1614784871,
        "id": "gpji9da",
        "score": 264,
        "subreddit": "wallstreetbets",
        "created": 1614813671.0
    },
    {
        "author": "yeet-or-yote",
        "body": "I didn’t sell at $40 why would I sell now",
        "created_utc": 1615398343,
        "id": "gqgyg5i",
        "score": 261,
        "subreddit": "wallstreetbets",
        "created": 1615427143.0
    },
    {
        "author": "ethandavid",
        "body": "This is the shit I love the most about WSB. 50 years from now when there are college courses on the gamification of finance I hope these are some of the screenshots. And we'll know they are full of shit if they don't include 1R0NYMAN",
        "created_utc": 1614890438,
        "id": "gpp1vtb",
        "score": 260,
        "subreddit": "wallstreetbets",
        "created": 1614919238.0
    },
    {
        "author": "vietbuilder",
        "body": "I joined WSB just to make some quick money off GME and now I'm a gambling addict. Thanks a lot you fucking retards.",
        "created_utc": 1615237529,
        "id": "gq97999",
        "score": 257,
        "subreddit": "wallstreetbets",
        "created": 1615266329.0
    },
    {
        "author": "agiatezza",
        "body": "Can we actually make $CAT (Caterpillar) trend, would be hilarious if it somehow makes it onto the news “Reddit crowd pivoting from GME and RKT into industrial machinery now”",
        "created_utc": 1614739501,
        "id": "gphoukk",
        "score": 253,
        "subreddit": "wallstreetbets",
        "created": 1614768301.0
    },
    {
        "author": "sensitivesnuggler88",
        "body": "Can you continue Simon's day? Ngl kinda intrigued now.",
        "created_utc": 1614872655,
        "id": "gpnvvpb",
        "score": 253,
        "subreddit": "wallstreetbets",
        "created": 1614901455.0
    },
    {
        "author": "trust-theprocess",
        "body": "Why wait, we should all go down on all our local gme employees right now, to boost morale",
        "created_utc": 1614872019,
        "id": "gpnufq2",
        "score": 247,
        "subreddit": "wallstreetbets",
        "created": 1614900819.0
    },
    {
        "author": "UbbeStarborn",
        "body": "I did not know he was already worth 120m, I didn't know it was possible but I have even less respect for Paper Portnoy now, that's some soft banana pussy shit.",
        "created_utc": 1615239788,
        "id": "gq9ccjc",
        "score": 245,
        "subreddit": "wallstreetbets",
        "created": 1615268588.0
    },
    {
        "author": "spacelyyy989",
        "body": "RKT IS A PUMP AND DUMP. IF YOU DIDNT BUY AT 20$ DO NOT BUY NOW!!!",
        "created_utc": 1614718936,
        "id": "gpgix8i",
        "score": 241,
        "subreddit": "wallstreetbets",
        "created": 1614747736.0
    },
    {
        "author": "BennyInThe18thArea",
        "body": "Guys I need it be green today, had to downgrade to single ply toilet roll - shits getting real now.",
        "created_utc": 1614857277,
        "id": "gpn4td4",
        "score": 240,
        "subreddit": "wallstreetbets",
        "created": 1614886077.0
    },
    {
        "author": "MebHi",
        "body": "My first wife was 'tarded. She's a pilot now.",
        "created_utc": 1614841571,
        "id": "gpmo0h6",
        "score": 239,
        "subreddit": "wallstreetbets",
        "created": 1614870371.0
    },
    {
        "author": "zjz",
        "body": "Reddit is broken af right now, it's not you",
        "created_utc": 1615853003,
        "id": "gr2hple",
        "score": 236,
        "subreddit": "wallstreetbets",
        "created": 1615881803.0
    },
    {
        "author": "ILikeMyJob69",
        "body": "now they worship him",
        "created_utc": 1615239321,
        "id": "gq9bbho",
        "score": 233,
        "subreddit": "wallstreetbets",
        "created": 1615268121.0
    },
    {
        "author": "joshgeek",
        "body": "Fun AND educational if you care enough to sort out spreads and wrap your head around the greeks. \n\n\nNumbers/math always came naturally to me but growing up very much lower middle class finance always seemed to be pointless to get into. I mean I was always broke. Now I'm telling myself, \"You fucking retard, that's the perfect reason to start yoloing what little you have. You've got nothing to lose!\"",
        "created_utc": 1614830492,
        "id": "gpm7tcl",
        "score": 232,
        "subreddit": "wallstreetbets",
        "created": 1614859292.0
    },
    {
        "author": "SuperNoise5209",
        "body": "Well, now I definitely wish I'd YOLO'd my entire IRA on this a couple of weeks ago. Smart money is keeping me from making stupid money.",
        "created_utc": 1615238082,
        "id": "gq98ikh",
        "score": 229,
        "subreddit": "wallstreetbets",
        "created": 1615266882.0
    },
    {
        "author": "Shaved-extremes",
        "body": "Wife still spending as if I make $5000 a day on stonks. How do i break it to her that she needs to get a job now",
        "created_utc": 1614901059,
        "id": "gppp8r9",
        "score": 229,
        "subreddit": "wallstreetbets",
        "created": 1614929859.0
    },
    {
        "author": "ISuckAtWallstreet",
        "body": "If someone dropped 1.5 million dollars they could buy every single RKT share that's up for sale right now. That's not a lot of money. This could get good.",
        "created_utc": 1614777257,
        "id": "gpj39up",
        "score": 225,
        "subreddit": "wallstreetbets",
        "created": 1614806057.0
    },
    {
        "author": "nerds-and-birds",
        "body": "I saw it dip below 200 and thought...I feel no desire to sell. None at all. I felt anger that such blatant manipulation will go unpunished, but didn’t sell a single share. Fuck those guys.\n\nLost 100k during that dip and am still holding every. Single. Share.\n\nBefore, I didn’t care about hedge funds vs retail and whatever. As long as I got money. But now I’m pissed and want to see them bleed.",
        "created_utc": 1615428622,
        "id": "gqisz1n",
        "score": 218,
        "subreddit": "wallstreetbets",
        "created": 1615457422.0
    },
    {
        "author": "XSOUL_1337",
        "body": "he was done long ago...\nnow its laughable\n\ncramer stand for something or fall for anything",
        "created_utc": 1617137710,
        "id": "gsud8sj",
        "score": 203,
        "subreddit": "wallstreetbets",
        "created": 1617166510.0
    },
    {
        "author": "swimmine",
        "body": "Experienced holders are now dead to $100+ movements.  It can change 10% in a day now and I think, is that it?",
        "created_utc": 1615849044,
        "id": "gr2bo83",
        "score": 201,
        "subreddit": "wallstreetbets",
        "created": 1615877844.0
    },
    {
        "author": "chatterthang",
        "body": "now draw 4 mf",
        "created_utc": 1615854954,
        "id": "gr2kzo3",
        "score": 201,
        "subreddit": "wallstreetbets",
        "created": 1615883754.0
    },
    {
        "author": "John_Bot",
        "body": "Imo: look at ARK.\n\nAll of ARK is just dying each day. The market hates speculative plays right now.\n\nBut ARK also had a month like January when it went up 20-25% \n\nI think we're getting crushed temporarily. But the good thing with speculative plays is that they roar back faster than anything else.\n\nI think you just have to hold on and things will pick up. It's painful for sure, though.",
        "created_utc": 1614803928,
        "id": "gpkqehi",
        "score": 200,
        "subreddit": "SPACs",
        "created": 1614832728.0
    },
    {
        "author": "Rudee023",
        "body": "It's a good thing that Citadel made it a point to let everyone know over and over again that they had absolutely, positively covered their short position last month. Otherwise they might be in a very bad spot right now.",
        "created_utc": 1615413101,
        "id": "gqhyblv",
        "score": 199,
        "subreddit": "wallstreetbets",
        "created": 1615441901.0
    },
    {
        "author": "Positive_Principle52",
        "body": "Wish I had more cash to buy all this dip, just need to hold strong and weather the storm. Was up around 25% last week, now down total 10% this week 😥",
        "created_utc": 1614872441,
        "id": "gpnve90",
        "score": 196,
        "subreddit": "CanadianInvestor",
        "created": 1614901241.0
    },
    {
        "author": "bongoissomewhatnifty",
        "body": "Literally exactly what I did in round one. But since my wife decided she loves it and drives it for work now, I need another.",
        "created_utc": 1614890790,
        "id": "gpp2qwv",
        "score": 194,
        "subreddit": "wallstreetbets",
        "created": 1614919590.0
    },
    {
        "author": "cmacpapi",
        "body": "I actually punched myself in the face over 40 times until I couldn't see straight just so I wouldn't be able to read the sell button on my phone. Now I'm braindead and deaf in one ear but still I hold.",
        "created_utc": 1615408084,
        "id": "gqhmpcb",
        "score": 192,
        "subreddit": "wallstreetbets",
        "created": 1615436884.0
    },
    {
        "author": "My_Not_RL_Acct",
        "body": "And they’re just going to keep bleeding. 3/19 is no joke boys, buy/hold now or forever regret you didn’t.",
        "created_utc": 1615237872,
        "id": "gq9814t",
        "score": 191,
        "subreddit": "wallstreetbets",
        "created": 1615266672.0
    },
    {
        "author": "PatGbtch",
        "body": "Ape in picture scratching his head like, “what the fuck just happened?” Went from sleeping under a bridge to have a tempurpedic bed now!\n\nDon’t worry fellow ape. We are all still trying to figure out what the fuck is happening.",
        "created_utc": 1615855775,
        "id": "gr2mix6",
        "score": 191,
        "subreddit": "wallstreetbets",
        "created": 1615884575.0
    },
    {
        "author": "Ironleg01",
        "body": "No surprise here. US - China divide will only increase and tech war will intensify further. I think good way to exploit it might be to invest in US domestic manufacturers. With that in mind I have positions in GM, Intel and similar companies that have US plants. This is also contrarian play as these and other similar companies are hated at the moment and are cheap. Well not so cheap now but we're cheap when I was entering long positions. Another good angle is to invest in US defense contractors. Defence budgets will only go up and those companies actually treat shareholders very well. Just today while my tech equities were killed, GD (have long position) announced 8% dividend increase. Nice. For anyone interested in this I highly recommend Ray Dalio's latest articles on world powers.",
        "created_utc": 1614816018,
        "id": "gplgjt1",
        "score": 190,
        "subreddit": "investing",
        "created": 1614844818.0
    },
    {
        "author": "Nahsor107",
        "body": "For now",
        "created_utc": 1617223098,
        "id": "gsyesws",
        "score": 190,
        "subreddit": "wallstreetbets",
        "created": 1617251898.0
    },
    {
        "author": "mrtibbles32",
        "body": "So many people called me a dumbass for holding gme, I held through an -85% loss and now they're texting me about how proud they are of me.\n\nNone of those bastards are getting a single fucking dollar from me.",
        "created_utc": 1615237393,
        "id": "gq96y9s",
        "score": 187,
        "subreddit": "wallstreetbets",
        "created": 1615266193.0
    },
    {
        "author": "_Duality_",
        "body": "I'm really glad y'all retards are fighting over RKT and GME—now there's ample proof in case we need it in the SEC or elsewhere that this sub cannot focus or coordinate shit.\n\nNow good luck with your gains on either or both.",
        "created_utc": 1614860498,
        "id": "gpn8xmw",
        "score": 185,
        "subreddit": "wallstreetbets",
        "created": 1614889298.0
    },
    {
        "author": "jdixon1974",
        "body": "I've stopped going to the /PLTR sub now. Every 2nd post is a picture of a rocket, suggestions of locking in large amounts of money and just general hot air about the company without any type of actual information.",
        "created_utc": 1614785105,
        "id": "gpjis3t",
        "score": 183,
        "subreddit": "stocks",
        "created": 1614813905.0
    },
    {
        "author": "SpeculateResponsibly",
        "body": "As someone who's only been investing for less than 3 months and who was a little nervous about starting off right before a correction, I feel a little relieved to be getting this out of the way now before I get too deep into the market. Plus it's a great opportunity to fix some of my averages.",
        "created_utc": 1614884170,
        "id": "gpomt9k",
        "score": 178,
        "subreddit": "stocks",
        "created": 1614912970.0
    },
    {
        "author": "Nafeeza23",
        "body": "I now own 1 share of GME!!!",
        "created_utc": 1614880910,
        "id": "gpof1l1",
        "score": 178,
        "subreddit": "wallstreetbets",
        "created": 1614909710.0
    },
    {
        "author": "ccav01",
        "body": "Shorting is roughly 20% of volume, and has been for weeks.  Shares to lend have been nearly non-existent for weeks.  Only 4.6 million shares short covered this week.  Daily utilization is nearly 100% of float.  Reported SI is 44% but is that possible?\n\nThey are shorting 7mm shares daily.  14 million so far this week, not counting prior weeks where they were forcing sideways movement/decreases by shorting...\n\nThese hedge players I read recently have been fined 58 times for violations which include under reporting shares shorted.  IOW, they will lie about their short position, and count the fine as cost of doing business.\n\nGoing through short volume numbers by week since 1/14 through 3/15 provides some interesting insight.  We know our starting point was 140% short interest.\n\nTotal long volume since 1/14 is 764603691 shares\n\nTotal (reported) short volume is 743764136 shares\n\nNow if we take the absurd position that EVERY long share sold was to cover a short...  I know it's impossible but just play along...\n\nTaking that position, we see that 20839555 shares short were covered.\n\nGME's float is 45MM shares.  140% SI would be  63MM shares short.\n\nSo using the numbers THEY reported, there would still be 43MM shares short, or 96% SI\n\nWSB has 9MM members.  Even if only 25% of members here own a absurdly conservative estimate of 2 shares, that is  4.5MM shares, or roughly 10% of float.\n\nWhen we subtract those numbers from the overall long totals and recalculate the previously ridiculously conservative prior estimate the outcome is 106% SI.\n\nHowever, my gut feeling is WSB probably owns 50-75% of float at this time which means that the actual number of shares short (as reported) actually increased anywhere from 1.6MM to 12.9MM, resulting in actual SI of somewhere around 146% to 169%.\n\nIf the HF's are underreporting, then that number could be insanely high.\n\nTLDR:  It's is numerically impossible the SI has decreased from Jan 14th and has actually risen anywhere to 146%-169%.",
        "created_utc": 1615935309,
        "id": "gr6dtdl",
        "score": 176,
        "subreddit": "wallstreetbets",
        "created": 1615964109.0
    },
    {
        "author": "Fit_Independent2105",
        "body": "I bought the dip. Then I bought the dip's dip.  Then I added some even dippier dip.  I'm gonna need a helluva lot more chips for all this dip I've got now.",
        "created_utc": 1614900426,
        "id": "gppnzdn",
        "score": 175,
        "subreddit": "StockMarket",
        "created": 1614929226.0
    },
    {
        "author": "irahulldubey",
        "body": "I don’t know if anyone is going to read it but I just want to put it out.\n\nComing from a poor country INDIA where the average monthly income is $137.89, it feels overwhelming to be a part of it.\n\nI used to work my ass off from 9 to 5 six days a week to earn $137 a month. Looking back now I realize that the price today of one GME is equal to my 2 months salary.\n\nMy 9 shares are worth more than my annual income. I have come a long way and I’m glad that I’m fortunate enough that I could get into GME with the money I can afford to lose. It’s hard to believe that the amount that was my annual income 2 years ago is now my play money.\n\nMakes me realize that how quickly things can change if you stay focused. Be grateful.\n\nApes strong together.",
        "created_utc": 1615836041,
        "id": "gr1n8eq",
        "score": 171,
        "subreddit": "wallstreetbets",
        "created": 1615864841.0
    },
    {
        "author": "OPINION_IS_UNPOPULAR",
        "body": "This just isn't going to happen. \n\nIf they really wanted to buy &gt; $1MM in GME, they wouldn't have bothered asking for your upvotes to do it.\n\nLook at their comment history and tell me you believe they'll live up to their word.\n\nHow many times does this have to happen before people stop falling for it?\n\nBanned for now under rule 7: No Bullshitting. PM modmail with proof for unban.",
        "created_utc": 1615923233,
        "id": "gr5o4lb",
        "score": 171,
        "subreddit": "wallstreetbets",
        "created": 1615952033.0
    },
    {
        "author": "FitPaleontologist519",
        "body": "Yea I’m basically a trading god now. I’ve seen Big Shot twice and WoW tjree times! My wife’s boyfriend is always down to rewatch them with me 😇",
        "created_utc": 1615848151,
        "id": "gr2a9fz",
        "score": 170,
        "subreddit": "wallstreetbets",
        "created": 1615876951.0
    },
    {
        "author": "wasupg",
        "body": "Pretty sure when you're called an idiot in this sub now it is derogatory while retard/degenerate is endearing. Thanks for the common sense retard.",
        "created_utc": 1614787448,
        "id": "gpjo368",
        "score": 167,
        "subreddit": "wallstreetbets",
        "created": 1614816248.0
    },
    {
        "author": "JoesStocksAccount",
        "body": "I mean, sure... but I started in late Jan and now i’m down on literally everything. ☹️",
        "created_utc": 1614884374,
        "id": "gponaw2",
        "score": 165,
        "subreddit": "StockMarket",
        "created": 1614913174.0
    },
    {
        "author": "Olympus921",
        "body": "100% of my portfolio now is GME",
        "created_utc": 1614719086,
        "id": "gpgj9nz",
        "score": 165,
        "subreddit": "wallstreetbets",
        "created": 1614747886.0
    },
    {
        "author": "1811pharmx",
        "body": "* First, $AAPL dropped to $140, and we were told this is a must-buy price and we'll never get it again. \n* Then, $AAPL went to $130, and were told this was a steal and it will never go below this price.\n* Next, $AAPL went to $120, and we were told this is black Friday pricing and you would need a room-temperature IQ to think otherwise.\n\n\nAnd now..... Now we're at $116.\n\nFuck",
        "created_utc": 1615237617,
        "id": "gq97gcz",
        "score": 165,
        "subreddit": "wallstreetbets",
        "created": 1615266417.0
    },
    {
        "author": "DrLongIsland",
        "body": "When I started investing, two or three years or so ago, I was sweating over a day with a loss above 2%, thinking I was doomed.    \n\nThen a friend of mine told me about WSB, about a couple of years ago.    \n\nNow I see a 30% loss in a day and I just think \"wow, that's some serious swing\".",
        "created_utc": 1614875723,
        "id": "gpo2xfc",
        "score": 163,
        "subreddit": "wallstreetbets",
        "created": 1614904523.0
    },
    {
        "author": "kevinmuff2",
        "body": "I took buffets suggestion and got into the stock market with the s&amp;p 500. Basically all my investments are there. I believe that in the long term... it should go up. Problem is, I basically got in at the peak, and it’s only been losses since. So I’m not just “losing gains” but I’m losing all my principle. Which is scary. \n\nSo I really got in at the exact wrong time. Which makes sense. Why would it be any other way. \n\nBut what do I do now? Just lose all my principle and wait for the long term like my original thought was??",
        "created_utc": 1614889888,
        "id": "gpp0kpb",
        "score": 162,
        "subreddit": "stocks",
        "created": 1614918688.0
    },
    {
        "author": "CryptoriousBIG",
        "body": "Losing almost $50k in 2 weeks is a terrible, gut wrenching feeling. That said, I've been here before. I tend to gravitate towards the higher reward plays and fully accept they come paired with much higher risk. We're seeing the risk side of that equation in full force right now. \n\nWhat I can't quite wrap my head around is why this dip/correction is cutting THIS hard into decent SPACs, especially the ones with outstanding DAs already on the table. Can't help but think that some institutional shorting might be taking place like some others have hypothesized. \n\nAt any rate I've definitely felt pretty blue over the past few days and am not myself at the moment. This sucks and when falls like this happen, it often feels like the end of the world. I've also learnt not to overreact. Selling at the bottom and chasing back in is not how money is made. That said, selling more at the top (or at least when you're feeling good about everything) is a lesson we all need to remind ourselves in times like these. \n\nI'm hanging tight for now. And while I can't believe how bad this SPAC crash is, day after day after day, I know it won't and can't go on forever.",
        "created_utc": 1614873408,
        "id": "gpnxlvj",
        "score": 159,
        "subreddit": "SPACs",
        "created": 1614902208.0
    },
    {
        "author": "GoJa_official",
        "body": "using an estimated average of 270.00 they afford about 2.2 mil shares to short. probably have been spreading it out rejecting peaks like 350/280, now 250 etc, likely even covering some on the lows to take profit and regroup for another short attack. Pair this with put/short call hedges and you get days like today and last wednesday.",
        "created_utc": 1615849675,
        "id": "gr2cnn8",
        "score": 157,
        "subreddit": "wallstreetbets",
        "created": 1615878475.0
    },
    {
        "author": "hobbes-n-calvin",
        "body": "Copied from r/stocks. Link to the original comment below. Tons of dd on r/stocks and other subreddits on how uwmc is tremendously undervalued, especially now with RKT at $30.\n\nI've responded a few times to these posts in the last week or so (maybe I responded to you before, sorry if I have) but uh, I agree. Its not gotten much love here on reddit, its hated in the SPAC subreddit and most threads about it have been pretty quiet here.\n\nThey have a market cap of 15 billion and as you noted have 7.5% of their market cap in straight cash! They have a forward P/E of 6.5 while RKT has a forward PE of 10. My brains a little tired and I didn't feel like doing the math to calculate their current P/E. Their share of the market sphere is picking up. For example, RKT is a consumer driven mortgage originator, RKT deals with people like you or I and attempts to fund and approve the loan. UWMC is a broker dealer, and deals primarily with the loan officers and lending companies directly. That share of the market sphere (broker dealers) peaked in 2008 and has subsequently fell and leveled off in 2014 at 14%. Its currently been rising for the last 7 years at a rate of 1-2% per year. Broker dealers like UWMC dealt with roughly 20% of the mortgage market in 2019 and will capture an estimated 21% in 2020 and return to the peak 33% by an estimated 2026. Their refinance volume obviously will shrink as it doubled with the low rates, but they should continue to capture more of the original home loans as broker dealers continue to regain market sphere, plus they are now looking to target jumbo loans adding more original loans to their books\n\nCommenced plans to restart jumbo offerings which are expected to go  live in March 2021 and will also materially increase purchase volume  during the remainder of 2021.\n\nThey have an industry leading close time (twice as fast as rocket, 3x as fast as industry average) and have one of the highest NPS scores in the industry. They have insane margins and their cost to originate the loans are much lower than the retail sector (RKT) They also pay a good dividend, which as price keeps dropping increases. It was up to 4.6% last time I calculated it.\n\nUnited Wholesale has invested heavily in technology. Findamortgagebroker.com, which aired a 2021 Super Bowl ad, was a massive investment. It intends to raise awareness of mortgage  brokers as a lending vehicle for homebuyers. Consumers will be able to  get referrals to a mortgage broker that will help the consumer decide  which product is best. Other technology investments include UTrack, a tracking application  that will tell the borrower, broker, and realtor the current status of a  loan. Blink+ is the company's loan origination system, which assembles  the documents and handles the nuts and bolts of putting together the  loan. Finally, EASE Docs handles the final documents for closing. The payoff for that technology is not only faster times to close but  lower costs to originate. In the fourth quarter, United Wholesale took  18 days to manufacture a loan compared to 56 days for the typical retail  lender. On the conference call, CEO Tim Forrester said that United  Wholesale's cost to originate a loan (including the broker's  compensation) was $5,800 per loan compared to the average retail cost of $8,872. This translates into lower borrowing costs. United Wholesale's  average loan rate was 2.74% in the fourth quarter compared to 2.89% for  the overall industry.  \n\nThey absolutely must have fantastic technology and workflow tools as they process loans that quickly but just go ask any of your friends or family whom are in the business what they think of them. One of my best friends is a loan officer who deals with UWMC directly multiple times a month, and he loves them, like, thrice as much as RKT whom he compares to a used car salesman (Tho RKT has good reviews online, not trying to trash them either, they're being beat down for whatever reason too)  and says the tech is so much cooler than anything else he uses. Their customers had an average credit score of 757 and a DTI of 36%. Not exactly clients I expect to be going defunct in a correction or pandemic.\n\nFinally, United Wholesale introduced a  quarterly dividend of $0.10 per share, which gives the company a 4%  dividend yield. This is higher than most of its competitors aside from New Residential, an originator with a different business model. The Street sees United Wholesale earning $1.40 next year, giving the company a price-to-earnings ratio of 7.1 times. United Wholesale's cost advantage may allow it to take share from other lenders\n\nObvious cant analyze a stocks upside without downside too.\n\nDownside - The massive amount of shares make every dollar a 1.5b increase in cap\n\nCounter - Does that matter in this market? Well until UWMC I thought not, but it gives people a reason to be bearish and somewhat understandably so.\n\nDownside - Refinances will go down in volume causing profit to shrink if/when rates up\n\nCounter - but I disagree that this will cause massive downside for the company. Refinance should level off as they increase original loan volume elsewhere which is their main goal, and rates are not intended to go up anytime soon\n\nDownside - Big banks space - People liken big banks to home loans (BOA/WFC etc)\n\nCounter - They should also be taking more and more market sphere from big banks and others, not losing it no?  Who wants to go deal with wells Fargo tho? People hate those motherfuckers and for good reason lol.\n\nDownside - Market crash / Housing crash\n\nThese really don't have a counter, wont be pretty for most companies should this happen and is not something that I really take into account when picking stocks in most sectors. I'm not countering the downsides to say they don't exist, I'm just interjecting why I think they're not a massive reason to be bearish, but maybe I'm blinded because I like the company and have been in it for awhile (and I made a good chunk of change before merger) - I am not a financial advisor and this is not financial advice and just the reasons I jumped into the stock, blah blah. Currently holding most my shares in my retirement account and recently added back in at 9.37 and 8.88 for another swing in webull. People online are saying this is heavily shorted, but highest I saw was 42% short interest (Someone said as high as 68% but I wasn't able to verify that) - Every time I type this up or paste this and modify it a little I get more bullish, double check their investor presentation and their recent SEC filings and... I want to buy more. At 8 dollars I just cant help myself, maybe I'll be broke soon, who knows.\n\nhttps://www.bamsec.com/filing/119312521027468?cik=1783398\n\nhttps://www.bamsec.com/filing/119312520296072?cik=1783398\n\nhttps://finviz.com/quote.ashx?t=uwmc\n\nEdit; Forgot, great advertising too. They're now on the Detriot Redwings helmets, they had a Superbowl commercial although it was very underwhelming and the company treats their employees rather well. They win awards for something in the sector year after year, 6 years running now I believe? Like what the fuck am I missing?? Late edit2; I just realized if you google uwmc helmets like for me trying to source the link above, you get things from UW university and UW hospitals, and so fourth. That's no help.\n\nhttps://www.reddit.com/r/stocks/comments/li2yau/uwmc_seems_extremely_undervalued_to_me/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf",
        "created_utc": 1614824853,
        "id": "gplwxav",
        "score": 156,
        "subreddit": "wallstreetbets",
        "created": 1614853653.0
    },
    {
        "author": "NH4CN",
        "body": "Oh it definitely had an impact on sentiment.\n\nI like this stock even more now",
        "created_utc": 1615418284,
        "id": "gqi98ac",
        "score": 148,
        "subreddit": "wallstreetbets",
        "created": 1615447084.0
    },
    {
        "author": "JackLittlenut",
        "body": "You owe over 1 million dollars. Honest question what do you do now. Completely restarting in another country sounds like your only option",
        "created_utc": 1614898863,
        "id": "gppktid",
        "score": 146,
        "subreddit": "wallstreetbets",
        "created": 1614927663.0
    },
    {
        "author": "npsimons",
        "body": "The funds who trade so quickly, the GD speed of light wasn't fast enough for them, hence why they try to build or rent office space as close as possible to the exchanges. Now let me see, where *did* I leave that spare $1MM or two so that I can compete on this \"level\" playing field . . .",
        "created_utc": 1615410663,
        "id": "gqhsrdn",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1615439463.0
    },
    {
        "author": "StarryNight321",
        "body": "The problem is, this is Reddit and most people did not have a diversified portfolio. A lot of us are heavily invested into tech, EVs, and renewables which have took disproportionate losses. ICLN is down 25% over the last month. If you didn't diversify, you're probably looking at a portfolio full of red, especially if you only got in during the peak in January and early February. Don't panic sell if you genuinely believe in a company's value but just wanted to point out that it's a fair mentality among a lot of people right now.",
        "created_utc": 1614811586,
        "id": "gpl7mx2",
        "score": 143,
        "subreddit": "stocks",
        "created": 1614840386.0
    },
    {
        "author": "fellinlovewitheffect",
        "body": "These companies are sticking around for the long term, but they are fucked\n\n50% of the time, my driver will steal my order. And I always tip well. Recently I’ve stopped using them completely because on a few occasions I have seen that the seal that the restaurant has put on my food bag has been ripped open and the food box clearly opened. Now when I order food I order direct from the restaurant, and I wish that was still the mainstream way.\n\nBut yeah, these companies are going to become true household names and won’t be going anywhere.",
        "created_utc": 1614790863,
        "id": "gpjw2tg",
        "score": 141,
        "subreddit": "wallstreetbets",
        "created": 1614819663.0
    },
    {
        "author": "BreezyWrigley",
        "body": "funds borrowed a fuckload of shares this morning. \n\nnow they are rapid selling them to try to crash price down and shake people out. there was great volume in the run-up today, and then like no volume in this crash in the last 30 min. \n\nthey are trying to trigger a larger/longer sell-off of retail shareholders with events like this so that they can adjust their short positions for less of a massive loss when the price is lower.",
        "created_utc": 1615398015,
        "id": "gqgxg6u",
        "score": 140,
        "subreddit": "wallstreetbets",
        "created": 1615426815.0
    },
    {
        "author": "lostknight0727",
        "body": "Sure they are dear, go play with Melvin now.",
        "created_utc": 1614754557,
        "id": "gpid245",
        "score": 140,
        "subreddit": "wallstreetbets",
        "created": 1614783357.0
    },
    {
        "author": "brutalpancake",
        "body": "So if I had $10 and lost half I have $5. But no worries - I made 20%, so now I have $6! Now gimme them fees",
        "created_utc": 1614808675,
        "id": "gpl1cfa",
        "score": 140,
        "subreddit": "wallstreetbets",
        "created": 1614837475.0
    },
    {
        "author": "xenaga",
        "body": "You started from 5 to 10k and hit 160k? In 1 year? Your doing great.\n\nMarkets are dead right now so everyone is down. This is better than putting money in a casino.",
        "created_utc": 1614887828,
        "id": "gpovpva",
        "score": 136,
        "subreddit": "wallstreetbets",
        "created": 1614916628.0
    },
    {
        "author": "Blitzkreig11930",
        "body": "Awesome, now go buy a ps5 from gamestop.",
        "created_utc": 1614895659,
        "id": "gppdzec",
        "score": 135,
        "subreddit": "wallstreetbets",
        "created": 1614924459.0
    },
    {
        "author": "Prohamen",
        "body": "So mixed news and results for the day; while we ended above my previous low estimate of $130, we did not close much higher than that (I recorded $132.37 at 4PM on the dot). With that said, I will update this again tomorrow morning based off the values after hours.\n\nSo below is an expansion of my previously posted theory that we are following the same trend. Note DFF is differential difference factor. The Difference factor is the a comparison of the value from the current run divided by the value from the January run. The DDF is a comparison of the day to day change for the current run divided by the day to day change for the January run.\n\nClosing Values From the January Run Up Compared to March Run Up\n\n1/11/21 / 19.94 || 2/22/21 / 46.00 || Difference Factor 2.31\n\n1/12/21 / 19.95 || 2/23/21 / 44.97 || Difference Factor 2.25 [Day2Day Change -0.01||-1.03; DDF 10300]\n\n1/13/21 / 31.40 || 2/24/21 / 91.71 || Difference Factor 2.92 [Day2Day Change 11.45||46.74; DDF 4.08 ]\n\n1/14/21 / 39.91 || 2/25/21 / 108.73 || Difference Factor 2.72 [Day2Day Change 8.51||17.02; DDF 2]\n\n1/15/21 / 35.50 || 2/26/21 / 101.74 || Difference Factor 2.87 [Day2Day Change -4.41||-6.99; DDF 1.59]\n\n1/19/21 / 39.36 || 3/1/21 / 120.41 || Difference Factor 3.07 [Day2Day Change 3.86||18.67; DFF 4.84]\n\n1/20/21 / 39.12 || 3/2/21 / 118.00 || Difference Factor 3.02 [Day2Day Change -0.24||-2.41; DFF 10.04]\n\n1/21/21 / 43.03 || 3/3/21 / 124.18 || Difference Factor 2.89 [Day2Day Change 3.91||6.18; DFF 1.58]\n\n1/22/21 / 65.01 || 3/4/21 / 132.37 || Difference Factor 1.59 [Day2Day Change 21.98||8.19; DFF 0.37](&lt;- we are here)\n\n1/25/21 / 76.79 || 3/5/21\n\n1/26/21 / 147.98 || 3/8/21\n\n1/27/21 / 347.51 || 3/9/21\n\nThe average difference factor is 2.63, the maximum is 3.07, and the minimum is 1.59. The standard deviation is 0.49.\n\nThe reason I say we are following the January pattern is because of two factors; 1) the difference factor is generally around the average difference factor 2) the day to day changes generally follow the same \"pattern\" as January (on days that had negative change in January, there was negative change now, and this is true for increases and stagnant days).\n\nPreviously I assumed a 10% margin of error because I was mostly doing back of envelope calculations only looking at key points. From here on out I will consider the margin of error equal to the standard deviation divided by the average difference factor, which is currently 18.51%. Unfortunately it seems that we are beginning to see a breakdown of my hypothesis, so the error is getting higher. Based off these values here are my estimates for the next few trading days.\n\n3/5/21 / $201.96 +/-$37.38\n\n3/8/21 / $289.19 +/-$53.53\n\n3/9/21 / $913.95 +/-$169.17\n\nPEAK VALUE Previous run / $483.00 || This run / $1270.29 +/-$235.13\n\nThe peak value should occure between opening bell March 8th and closing bell March 10th, based off what happened on the January run.\n\nI will be updating this as the next few days progress. The current outlook is that the hypothesis is breaking down, and my calculations have to account for that with a larger margin of error. Chances are that by Monday my model won't track the current trajectory at all. That being said, keep my calculations in mind and watch the stock!",
        "created_utc": 1614893686,
        "id": "gpp9iva",
        "score": 131,
        "subreddit": "wallstreetbets",
        "created": 1614922486.0
    },
    {
        "author": "DutchTurk_",
        "body": "A lot of new retail shorts entered the game. Today when the price dropped i saw at least 1000 messages on yahoo finance board. All the shorts where screaming. When price goes up they are silent, but when the price drops couple % they start screaming. We need to learn these guys a lesson. I'm planning to sell 30 Tesla shares and couple Amazon to buy more GME tomorrow. We have a long way to go and i know every investment now is a big profit over couple weeks. I never saw a community like GME. We are like 50 stock communities in one. If we jump the world will shake you will see earthquakes and tsunami everywhere. Thats with how many we are. If we hold together and buy more together nobody will able to stop us. But we need to remove our stop loss limits. Hedge funds are aiming on stop loss limits and when they hit these limits all these shares of the paperhands pussies enters the market. When pussies see this orders they panic and start to sell for lower price. Thats what happend today. I went to the garden to smoke a cigarette when i saw the drop and drink a cup of coffee. Came back was around $180 saw chaos on yahoo finance i laughed made another coffee made a short flight with flight simulator 2020 when i came back it was over 250 again. My mentality is if i die i die like a man. If it goes up nice if it stays here nice and if it goes down i buy more and more every month. First time Robinhood and hedge funds together tried to fuck us and they are warned. We took some scars and are still alive. This time nobody will be able to stop us. Together with hedge funds a lot of little retail shorters will be squeezed. There is no way back we kill or we die. One of us must die.",
        "created_utc": 1615419522,
        "id": "gqiboa2",
        "score": 130,
        "subreddit": "wallstreetbets",
        "created": 1615448322.0
    },
    {
        "author": "WasteReserve8886",
        "body": "It's kinda sad how the whole Gamestop thing killed WSB. Now it's full of lame \"activists\" and people trying to recreate Gamestop, but ultimately only to pump a stock to get rich on.",
        "created_utc": 1614878323,
        "id": "gpo8yqe",
        "score": 130,
        "subreddit": "smallstreetbets",
        "created": 1614907123.0
    },
    {
        "author": "Brooksee83",
        "body": "Hmm, GME shorters lose $818m on 2/25, now RKT shorters lose $813m. Both reported by Reuters.\n\nHmmmm.",
        "created_utc": 1614861796,
        "id": "gpnas9i",
        "score": 129,
        "subreddit": "wallstreetbets",
        "created": 1614890596.0
    },
    {
        "author": "Rev_5",
        "body": "This is going to be a repeat of yesterday. Huge dip in the beginning followed by smaller and smaller dips to mimic a sell off.   \n\n\nNobody who is holding share is selling off this close to the 19th, even if it is a made-up squeeze day, especially not if we held on that initial drop from 400 with RH trading restrictions. They have zero clue who they are fucking with.  \n\n\nI am living every Wall Street traders worst nightmare: being working class. What's the worst that can happen if I lose this money and it goes to 0? I'm a wage slave for the rest of my life? Like I wasn't already? Fuck off and give me my tendies, asshole.  \n\n\nYou should've let this ride to 1k in January, instead of dragging this out. Now I'm collecting interest mother fucker.",
        "created_utc": 1615909543,
        "id": "gr4taht",
        "score": 129,
        "subreddit": "wallstreetbets",
        "created": 1615938343.0
    },
    {
        "author": "Camposaurus_Rex",
        "body": "I follow Steve Van Metre pretty religiously and he's shown that past QE and papers from the FED have stated that deflation is the mostly likely path right now. If you have a chance, listen to lectures by Richard Koo, he was working with Japan during their market collapse in the 80's and he has amazing insight into expectations. Overall, the FED's goal is to drive bond interest rates to 0, which will cause stonks to fall. The Eurozone and Japan have been exporting deflation and our companies have not been able to pass on inflated prices of raw goods onto consumers lately, so this is hurting companies right now and consumer prices will fall soon (also deflationary). \n\nThe only way we get inflation is if the banks open their doors and start lending to everyone right now (which they won't, given the current unemployment rates). So all this QE money will stay locked away within the banks and stonk market (unless the GME bubble super pops!) until further notice. This also causes a dollar shortage (see M2 velocity &amp; remember companies not accepting dollars &amp; banks not issuing dollars last year?), which will also lead to a dollar rally and will cause yields to drop (and the stonk market).\n\nTLDR: Deflation is certain until banks ease lending restrictions. The FED has already stated what's going to happen, but people don't listen/understand what they're saying.",
        "created_utc": 1614890782,
        "id": "gpp2q8c",
        "score": 128,
        "subreddit": "wallstreetbets",
        "created": 1614919582.0
    },
    {
        "author": "indonesian_activist",
        "body": "I humbly accept the promotion dear gentleape, though I must admit, my motive is not altruistic but rather self serving. My mom wouldn't let me go to film school, and now I spend my days making movie memes for  🦍 🦍 🦍\n\n[https://www.reddit.com/r/wallstreetbets/comments/llt8oo/tomorrow\\_live\\_from\\_the\\_capitol\\_21821\\_12pm\\_et/](https://www.reddit.com/r/wallstreetbets/comments/llt8oo/tomorrow_live_from_the_capitol_21821_12pm_et/)\n\nThus my actions revolves around helping to ensure most of the  🦍 🦍 🦍 stay solvent enough to be around to upvote my next meme.",
        "created_utc": 1614869273,
        "id": "gpnobpx",
        "score": 121,
        "subreddit": "wallstreetbets",
        "created": 1614898073.0
    },
    {
        "author": "Captain_Sacktap",
        "body": "I don’t think RKT is a purposely crafted distraction, just a coincidence. The company had their IPO a few months ago and after gaining value for a couple weeks it crashed, and since then has drawn a few hedge funds who have spent the last few months shorting it. However, it has backfired on the shorts for a few reasons, the biggest being that RKT’s execs aren’t fucking around and have decided to actively fuck over the shorts. In late November, RKT announced they intend to do a massive stock buy back of $1 billion worth of shares during Q1. This has yet to happen so it’s likely to occur in the very near future; current float is about 100M, so they intend to buyback roughly 25% of all outstanding stock. Then, during their Q4 earnings report on 2/25, they announced a special dividend of $1.1/share is going to be paid out to all holders at the end of market 3/9. On top of that, the shorts got noticed by the retail investors, having overplayed their hand again and irresponsibly pushed to 40% short interest. So now the shorts are stuck in a shitty position. If they don’t settle up their positions by 3/9, they’ll wind up having to cover that dividend, and on top of that retail is buying the stock up like crazy. Bonus, RKT is roughly 70% institutional ownership, and those firms are more than happy to throw fuel on the fire to burn their competitors attempting to short them.",
        "created_utc": 1614738638,
        "id": "gphn6uv",
        "score": 121,
        "subreddit": "wallstreetbets",
        "created": 1614767438.0
    },
    {
        "author": "pdxp2b",
        "body": "Agree. I don’t follow any of the EV or space bullshit in this sub. I look at the next industry that no one is talking about. \n\nHuman capital is further along but still has so much realistic growth ahead of it; workday/paycom/etc. are really only the beginning of the possibilities and technologicification of the workplace and employment; they’re just trying to do it decently; the next iteration will be explosive and creative building off that. HR tech is like 50% built. \n\nAll that said about HR, Ed tech has 99% of an industry to grow. The actual industry itself has barely even begun to evolve. E-learning now officially legit forever—everyone from k-12 to higher education will be looking to not just survive but find long term solutions to thrive, impress and engage students and in higher Ed, highly paying students with high expectations. Who will land DOE contracts? Who will the major players be? All markets are open for taking. Good move Zoom could make would be Ed services expansion. Connect content providers to educational institutions. Students and teachers hate most of the software and platforms they’re using because they’re super old but accepted, or are ad hoc with lots of issues. \n\nOwn Adex, eac, more.",
        "created_utc": 1614829392,
        "id": "gpm5uls",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1614858192.0
    }
]