[
    {
        "author": "LifeInAction",
        "body": "I've been holding since it was actually $150, looks like I can now buy Nvidia once again for $150.",
        "created_utc": 1621605984,
        "id": "gyy0lzs",
        "permalink": "/r/stocks/comments/nhs698/nvidia_announces_fourforone_stock_split/gyy0lzs/",
        "score": 635,
        "subreddit": "stocks",
        "created": 1621634784.0
    },
    {
        "author": "Ulthanon",
        "body": "\\[Me\\] oh cool maybe I could grab a few shares before then, I wonder what they're--\n\n\\[NVDA\\]: six hundred bucks each, my man\n\n\\[me\\]: oh",
        "created_utc": 1621639803,
        "id": "gz00s03",
        "permalink": "/r/investing/comments/ni2mjv/nvidia_proposes_4for1_stock_split/gz00s03/",
        "score": 307,
        "subreddit": "investing",
        "created": 1621668603.0
    },
    {
        "author": "PersianMG",
        "body": "To think NVDA was trading at sub $200 during COVID crash.",
        "created_utc": 1621652093,
        "id": "gz0mjuk",
        "permalink": "/r/investing/comments/ni2mjv/nvidia_proposes_4for1_stock_split/gz0mjuk/",
        "score": 201,
        "subreddit": "investing",
        "created": 1621680893.0
    },
    {
        "author": "iBifteki",
        "body": "To be honest, I just bought good companies (strong growth guidance, strong debt ratio, free cashflow and profitability) that are already discounted by a minimum of \\~22-23% from ATH\n\n(Exception being Apple, ASML and NVIDIA, these are discounted by around \\~12%).\n\nI also bought on some growth that is discounted at 50%+, with great prospects.\n\nI simply don't see how this market could punish these already punished equities more.\n\nDespite what all the self-proclaimed Economics PhDs are saying on Reddit, I think inflation is great news, and it means the economy is finally standing back on its feet and people want to spend.\n\nI seriously doubt that suddenly all the circulating money supply will go to bonds of a historically indebted US treasury.\n\nEven if we keep dropping another 10%, I will just buy more and wait for the inevitable rise. Stonks just always go up, if they don't capitalism fails. If capitalism fails, we will have more problems to worry about rather than a few thousand $ lost.\n\nI seriously, cannot possibly see 10 grand not being worth at least 20 grand + if you put it in $TSM and wait 3 years.",
        "created_utc": 1620848491,
        "id": "gxw4val",
        "permalink": "/r/wallstreetbets/comments/nauo06/does_anyone_else_feel_nervous_as_hell_about/gxw4val/",
        "score": 192,
        "subreddit": "wallstreetbets",
        "created": 1620877291.0
    },
    {
        "author": "Dpad124",
        "body": "Other can answer with the more intangible items. From a financial perspective, let's take a look at the 10K's of each company (since this is the last filing of NVDA). Over the last fiscal year, here are some key stats:\n\nRevenue:\n\nNVDA: $16.7B / AMD: $9.7B (hrmmm this seems closer than 4x like you mention, more like 1.7x)\n\nGross Profit:\n\nNVDA: $10.3B / AMD: 4.3B (Interesting, it appears NVDA has better margins so now we are close to 2.5x)\n\nIncome Before Taxes:\n\nNVDA: $4.4B / AMD: $1.3B (Now we are all the way up to 3.4x, so getting close to 4x. This shows AMD has lower margins, and higher comparative expenses).\n\nNet Income:\n\nNVDA: $4.3B / AMD:$ 2.5B (Woah we dropped down to 1.72x. If we look, this is due to AMD having carryover losses and Tax carry forwards that reduced AMD's tax burden and net them returns instead of paying taxes hence why they have more net income than they earned).\n\nSo what can we conclude on this? Don't just look at revenue. A company can have an insane amount of revenue, but if they are inefficient or have too many operating expenses, they could potentially have  little to no revenue. Next, comparatively, if we ignore the losses and credits AMD took to boost their net income, NVDA is actually coming close to that 4x difference we are seeing in valuation. That and all the intangibles others are mentioning, and AMD's recent pull back, attribute to the difference.",
        "created_utc": 1620097300,
        "id": "gwv44a2",
        "permalink": "/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/gwv44a2/",
        "score": 188,
        "subreddit": "stocks",
        "created": 1620126100.0
    },
    {
        "author": "xsubkulturex",
        "body": "Compare growth, revenue and market cap of AMD with Nvidia and it'll give you an idea of how undervalued AMD currently is.",
        "created_utc": 1620132590,
        "id": "gwwfov4",
        "permalink": "/r/wallstreetbets/comments/n4ncpw/time_to_buy_the_dip_amd_short_dd/gwwfov4/",
        "score": 140,
        "subreddit": "wallstreetbets",
        "created": 1620161390.0
    },
    {
        "author": "chaosbutters",
        "body": "Actually it does. Itll make it look cheap to people, more people will buy and it will go to the moon. Does this change fundamentals? No. Does it change psychology of buyer and perception? Yes.\n\nNvidia is about to have a 3-12 month bull run fueled by 3000 series sales and what 4000 and 5000 series can offer in the fall/winter.",
        "created_utc": 1621642576,
        "id": "gz05snd",
        "permalink": "/r/investing/comments/ni2mjv/nvidia_proposes_4for1_stock_split/gz05snd/",
        "score": 97,
        "subreddit": "investing",
        "created": 1621671376.0
    },
    {
        "author": "FrozenClorox",
        "body": "Or maybe Nvidia is just overvalued.",
        "created_utc": 1620135177,
        "id": "gwwkrmu",
        "permalink": "/r/wallstreetbets/comments/n4ncpw/time_to_buy_the_dip_amd_short_dd/gwwkrmu/",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1620163977.0
    },
    {
        "author": "renjkb",
        "body": "Chips you mean TSM, AMD, QCOM, NVDA and INTC? :)",
        "created_utc": 1621632145,
        "id": "gyzlnjd",
        "permalink": "/r/StockMarket/comments/ni3055/buy_the_dip_they_say/gyzlnjd/",
        "score": 71,
        "subreddit": "StockMarket",
        "created": 1621660945.0
    },
    {
        "author": "murderbits",
        "body": "Fear of inflation is inducing a rotation out of growth. Tech (especially FAAAN/MG-ish stocks) are seeing  TREMENDOUS earnings reports and then either immediately staying flat or seeing a steep discount. AMD not only had a great quarter, but changed guidance from 37% growth for the year to 50% growth. The result? AMD is down 15% since the high on their earnings day. Same with MSFT, AAPL, GOOG, AMZN, and even NVDA. PLTR is going with the market.  \n\n\nAdditionally, PLTR has no reason for price to increase right now, outside of the market/sector drop. They are significantly over-priced. I don't think the price is likely to drop down to a saner value. I think it's more likely to hold and stick around 20-30 *until the fundamentals  rise to justify the price*.  Everyone suspects they should have a pretty good quarter. That'll be good. They'll need several of those consecutively for the market to respond. Every few new big contracts and news stories, they gain another analyst adding them to their coverage. Enough really great quarters of growth (say, another year worth) and the market will start responding.  \n\n\nThose of us invested now -- and those like Cathie Woods -- are playing the hunch and taking the risk that we are recognizing the potential of the company before the rest of the market has caught on to it. While they're waiting for results to move the price, we're betting on results. We could be wrong. Probably not, but we could be.  \n\n\nAnyway, I have been calling this for weeks. Nobody -- not even the CEO -- has implied that PLTR is a short term profit play. Everyone knows you hold PLTR for the long term, if you have conviction in the company. And yet, you have all these people going \"HURR DURR PLTR TO THE MOON ON EARNINGS DAY!\" and \"HURR PLTR 50/100/150 by END OF YEAR\".  \n\n\nFor weeks, I've been saying this: ***PLTR will drop to 20 before earnings and then it will moon... back to 24 or so, where we are today***.  \n\n\nWe've done the \"reached 19/20\" part. I expect good earnings on 5/11. I no longer think we'll see a lift back to 24 or 25 on earnings, though. Not in the current senseless market. I think we'll see it trade flat after earnings or possibly very slightly higher for a day... and then all the \"HURR DURR PLTR 50 BY END OF YEAR\" people will get impatient (despite being warned since the beginning) and start selling off... leaving us back down to around  wherever we are just before the earnings report.  \n\n\nIf you don't have conviction in PLTR, don't invest. If you do, leave your position alone and relax for a few years.  \n\n\n***11% of  portfolio is PLTR at 23.98***",
        "created_utc": 1620319609,
        "id": "gx6359m",
        "permalink": "/r/wallstreetbets/comments/n69r3w/not_trying_to_clickbait_here_wtf_is_happening_to/gx6359m/",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1620348409.0
    },
    {
        "author": "moolium",
        "body": "Looking at your two semi, I doubt NVDA. They already trade at a high multiple for their 300b valuation.  If they traded at a much lower multiplier (which will happen as the growth that's priced in now comes to fruition and shows) they would be marketed less as intc. \n\nTrillion dollar companies are generally backed by long term consistent growth,  but the Financials to support it.  Even if they quadruple Sales they are looking at half the revenue of most of these companies.  There will be a psychological barrier at that valuation to the market",
        "created_utc": 1621421636,
        "id": "gyojac8",
        "permalink": "/r/stocks/comments/ng2d39/next_set_of_trillion_dollar_companies/gyojac8/",
        "score": 66,
        "subreddit": "stocks",
        "created": 1621450436.0
    },
    {
        "author": "TheMadBeaker",
        "body": "Going to be interesting to see what happens with Nvidia",
        "created_utc": 1621798281,
        "id": "gz6zgsx",
        "permalink": "/r/options/comments/njdshw/expected_moves_this_week_nvidia_salesforce/gz6zgsx/",
        "score": 65,
        "subreddit": "options",
        "created": 1621827081.0
    },
    {
        "author": "peterock_",
        "body": "I used to work at NVIDIA, I got in at about 67 bucks.",
        "created_utc": 1621608452,
        "id": "gyy5yy1",
        "permalink": "/r/stocks/comments/nhs698/nvidia_announces_fourforone_stock_split/gyy5yy1/",
        "score": 60,
        "subreddit": "stocks",
        "created": 1621637252.0
    },
    {
        "author": "ThatVegasGuy77",
        "body": "I can’t believe they could keep NVDA thirty cents under 600 so those tens of thousands of 600c expired worthless",
        "created_utc": 1621627475,
        "id": "gyzbzuv",
        "permalink": "/r/wallstreetbets/comments/ni1fw5/weekend_discussion_thread_for_the_weekend_of_may/gyzbzuv/",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1621656275.0
    },
    {
        "author": "InternJedi",
        "body": "40% is like meme stonks level correction and TSLA. MSFT, DIS, even AMD or NVDA were doing alright.\n\n*Knock on wood a bazillion times.",
        "created_utc": 1620143701,
        "id": "gwx4zqr",
        "permalink": "/r/stocks/comments/n4r3k8/why_is_the_market_down_so_much_today/gwx4zqr/",
        "score": 58,
        "subreddit": "stocks",
        "created": 1620172501.0
    },
    {
        "author": "CharalamposYT",
        "body": "Jesus Christ that's impressive, gaming skyrocketed Nvidia",
        "created_utc": 1622061636,
        "id": "gzk4xnf",
        "permalink": "/r/stocks/comments/nlqtjo/nvda_nvidia_announces_financial_results_for_first/gzk4xnf/",
        "score": 53,
        "subreddit": "stocks",
        "created": 1622090436.0
    },
    {
        "author": "cutself",
        "body": "I remember back in 2016-2017 when Nvidia was all the rage and there weren’t 10 fucking million of you degenerates in this sub",
        "created_utc": 1621628577,
        "id": "gyzea5b",
        "permalink": "/r/wallstreetbets/comments/nhudws/nvidia_sets_4for1_stock_split_shares_rise/gyzea5b/",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1621657377.0
    },
    {
        "author": "Edhellas",
        "body": "Idiots in this thread, Jesus. Shortage issues? AMDs market share gains have slowed down due to shortages, they're selling every chip they can make.\n\nWhen supply catches up to demand (which isn't happening for another year at least), their sheets will still look great because they'll start chipping away at Intel and Nvidias market share. With the Xilinx merger they'll become the largest customer at TSMC. As they start transitioning to 5 nm, they'll be able to allocate 7nm to lower margin GPU products, a segment which is currently neglected due to shortages, both by Nvidia and AMD.\n\nBesides that, they just announced a $4b share buyback. AMD have never had this kind of free cash before. This is going to prevent any sub $70 targets, unless there's a very sudden macro cause, and even then they'll eat it up because they want to buy the shares at a decent price. The reason they're doing share buybacks and not investing in the company? They have no factories, so they don't need capital to increase production levels. They've already effectively maxed out on R&amp;D, and as Intel have proven over the last 4 years, you can't throw extra money at semiconductor R&amp;D to get better results.\n\nTheir product roadmap for the next 5 years is amazing and they have a proven track record of delivering.\n\nThey said themselves that their gpu lineup should get another 50%+ per/watt improvement next gen, and leakers who have been pretty reliable previously are pointing to much higher numbers.\n\nIn the CPU space, Intel's next two generations are no threat whatsoever, and AMDs iterative design approach means consistent gains in performance and power consumption every year. Intel's 10nm laptop CPUs can increase their performance by 10% for a 50% power consumption tradeoff. It proves how bad the state of their foundries really is.\n\nThe Xilinx merger is a big brain play if it goes through, which it should. It gives them the FPGAs necessary to chip away at Nvidias monopoly on machine learning. Xilinx already easily outperforms Nvidia here, but Nvidia has an ecosystem that needs to be broken. As we move towards smaller processing nodes, transistor size reductions will no longer be the way to get better performance. A mix of FPGAs, ASICs, and general compute units is the future. That's what AMD have recognised and why they're building an arsenal of integrated CPU and GPU products now. They're building the experience required to meet the demands of the future.\n\nI don't have much money so I've got 265 shares via CFDs on 5x leverage. Assuming the Xilinx merger is successful, $100-130 EOY is easily manageable imo. It will likely take a hit after the merger as Xilinx owners sell their converted shares, but that's to be expected. With the guidance AMD have for this year it's also plausible they may increase the buyback program depending on demand/shortages, which could alleviate Xilinx sellers.",
        "created_utc": 1621620039,
        "id": "gyyvyvd",
        "permalink": "/r/wallstreetbets/comments/nhx6hu/amd_100_by_end_of_year/gyyvyvd/",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1621648839.0
    },
    {
        "author": "FistyGorilla",
        "body": "I sold Nvidia at $40",
        "created_utc": 1620778670,
        "id": "gxso5iy",
        "permalink": "/r/stocks/comments/nabdwh/not_a_good_idea_to_sell_off_on_a_crash_day/gxso5iy/",
        "score": 38,
        "subreddit": "stocks",
        "created": 1620807470.0
    },
    {
        "author": "iggaguy",
        "body": "Soon to be 33 years old. Never had a girlfriend or sex. Will likely lose 30k on my NVDA put spread. Roast me.",
        "created_utc": 1620087832,
        "id": "gwul3ek",
        "permalink": "/r/wallstreetbets/comments/n45qyv/what_are_your_moves_tomorrow_may_04_2021/gwul3ek/",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1620116632.0
    },
    {
        "author": "lechugabear",
        "body": "It is no mystery why NVDA is always green and why AMD is always red. Just look at their website. Everything on NVDA's website is green. Even their logo is green. Green = up = money. \n\nNow look at AMD. Everything is either red or red-orange. Red = down = no money no honey. AMD's logo used to be green but now it is not. Now look where they are. Such simple DD can make you rich. \n\n$NVDA forever. (even though I'm a retard with ~20 shares at $95 of AMD... fuck)",
        "created_utc": 1621626718,
        "id": "gyzaek2",
        "permalink": "/r/wallstreetbets/comments/nhudws/nvidia_sets_4for1_stock_split_shares_rise/gyzaek2/",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1621655518.0
    },
    {
        "author": "[deleted]",
        "body": "But hey, let’s value Nvidia 1.5x larger than Intel with 1/7th of the revenues Intel has and half the margins. Oh yea let’s boost nvidia executive pay too. Nothing bad can happen right if we never get as big as intel?",
        "created_utc": 1621473594,
        "id": "gyrpgec",
        "permalink": "/r/ValueInvesting/comments/nghent/shareholders_vote_no_on_intel_executive/gyrpgec/",
        "score": 37,
        "subreddit": "ValueInvesting",
        "created": 1621502394.0
    },
    {
        "author": "Otaehryn",
        "body": "Didn't IBM sell Fishkill fab and go fabless? In this case they are working with TSMC or Global Foundries or someone else still left?\n\nEDIT: Apparently they are working with Samsung on new process which every chipmaker is doing. Announcing something 3-4 years in advance is vaporware to generate positive buzz. I don't doubt we will have 2nm chips sometime in future but when we do, 1-2 foundries will be making them and everyone big (nVidia, Apple...) will be designing chips.\n\nI own IBM stocks.",
        "created_utc": 1620395994,
        "id": "gx9vn4h",
        "permalink": "/r/stocks/comments/n6x0fa/ibm_has_revealed_a_new_chip_technology_that/gx9vn4h/",
        "score": 37,
        "subreddit": "stocks",
        "created": 1620424794.0
    },
    {
        "author": "grimetime01",
        "body": "I think too many people value NVDA based on graphics and gaming.  That is only a small part of the company’s future.  They’re positioned to be dominant in AI and automation, and that’s a big factor in why the price has been so high",
        "created_utc": 1621607911,
        "id": "gyy4rqm",
        "permalink": "/r/stocks/comments/nhs698/nvidia_announces_fourforone_stock_split/gyy4rqm/",
        "score": 36,
        "subreddit": "stocks",
        "created": 1621636711.0
    },
    {
        "author": "Gigidypaperhands",
        "body": "In case anyone needs a good laugh at my retardation\n\n&amp;#x200B;\n\n1. Bought GME @ $15, sold at $40\n2. Bought Hertz @ $1.20, sold at $2\n3. Bought NVDA @ $95, sold at $140\n4. Bought CLOV @ $10.31, still holding\n5. Bought NIO @ $50, still holding\n6. Bought PLTR @ $28, still holding\n7. Bought PENN @ $117, still holding",
        "created_utc": 1621602997,
        "id": "gyxuowx",
        "permalink": "/r/wallstreetbets/comments/nhoua8/daily_discussion_thread_for_may_21_2021/gyxuowx/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1621631797.0
    },
    {
        "author": "CrashTestDumb13",
        "body": "Um. My whole portfolio. I buy and hold everything for the long term. Unless if something fundamentally changes with any of my companies I have no plans to sell. But my biggest holdings are AMZN, NVDA, MA, and V.",
        "created_utc": 1620444267,
        "id": "gxcngiu",
        "permalink": "/r/stocks/comments/n7egrl/what_stocks_are_you_holding_long_term/gxcngiu/",
        "score": 33,
        "subreddit": "stocks",
        "created": 1620473067.0
    },
    {
        "author": "Miamime",
        "body": "When I was young I moved into a new apartment and had to sell some stocks to afford the security deposits, the moving people, etc. Sold BRK.B at like $78 and NVIDIA at like $15. Kill me.",
        "created_utc": 1621655311,
        "id": "gz0rwen",
        "permalink": "/r/investing/comments/ni2mjv/nvidia_proposes_4for1_stock_split/gz0rwen/",
        "score": 33,
        "subreddit": "investing",
        "created": 1621684111.0
    },
    {
        "author": "BackgroundSearch30",
        "body": "Yes on the strike price. If its 600 on the day of split, it will be 150 after the split and your contract will be at 400 shares rather than 100. If the premium is $20 on the day of the split, it will be 5 at the end of it. You'll still have the same value of the option, all other things being equal (i.e. theta decay still occurs at the normal rate, and IV can change as well).  \n\n\nThe whole point of doing this sort of split is because NVDA thinks its stock is unaffordable for the class of investors that it caters to. This increases the overall liquidity of their stock by allowing more people to trade whole shares, and allow more people to accumulate 100 share so they can afford to trade options contracts more easily.",
        "created_utc": 1621607153,
        "id": "gyy34bw",
        "permalink": "/r/options/comments/nht38i/nvidia_stock_split_and_option_effect/gyy34bw/",
        "score": 31,
        "subreddit": "options",
        "created": 1621635953.0
    },
    {
        "author": "Kind-Relationship559",
        "body": "After the 4-1 stock split it will make it look cheaper and more appealing to people. I’m in Nvidia for longgg",
        "created_utc": 1621981586,
        "id": "gzg1jj5",
        "permalink": "/r/stocks/comments/nl1d02/thinking_about_nvidia/gzg1jj5/",
        "score": 31,
        "subreddit": "stocks",
        "created": 1622010386.0
    },
    {
        "author": "WHistard42",
        "body": "I can expect a blowout in my checking account as I fork everything over to buy more NVDA",
        "created_utc": 1621621787,
        "id": "gyyztkq",
        "permalink": "/r/wallstreetbets/comments/nhudws/nvidia_sets_4for1_stock_split_shares_rise/gyyztkq/",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1621650587.0
    },
    {
        "author": "manitowoc2250",
        "body": "I don't think it's possible to make a bear case for the foreseeable future. Everything is designed with tech in mind now, crypto mining is eating up alot of the GPUs and CPUs. Now you have businesses with warehouses full of mining equipment that are also listed on the stock market. Not to mention China and the US are in a tech race. Personally I think until mining cryptos becomes unprofitable OR the semiconductor manufacturers get more plants online (why would they? They love the shortage, very profitable) then I don't think the semiconductor stocks will come down anytime soon. \n\nAs far as I know though Nvidia is trying to throttle it's GPUs mining capabilities through driver updates on newer cards, they say their gaming GPUs are ment for gamers, not miners. But like anything there's always a way around it",
        "created_utc": 1620388510,
        "id": "gx9hnh2",
        "permalink": "/r/stocks/comments/n6wkg1/what_is_the_bear_case_for_semiconductors/gx9hnh2/",
        "score": 29,
        "subreddit": "stocks",
        "created": 1620417310.0
    },
    {
        "author": "Money-Bull",
        "body": "Dude, that shows how little you know about $BB. They haven't been making phones for years. If you are going to say company is worth dick because they have outdated phones, have the decency to do some research first.\n\nI'll just point out a few of the reasons:\n\nQNX: the most secure and #1 automotive embedded OS used in over 175MM vehicles today, medical systems, droids and many other connected devices. Automakers using QNX: GM, Hyundai, Cadillac, Chevrolet, Buick, Chrysler, Porsche, Skoda, Bugatti, Lamborghini, Bentley, Holden, Land Rover, BMW, Mini, Honda, Acura, Nissan, Ford, Mercedes, Saab ,Xpeng, Mitsubishi, Mazda, Toyota, Jeep, Volkswagen, Audi, Kia, Renault, Nissan, Mitsubishi, Fiat, Lexus, Jaguar, [Plus.AI](https://Plus.AI), Peterbilt, Subary, Byton, Peugeot, LUCID, Daimler, FCA, NIO, SsangYong, Suzuki, Chery, Volvo, Scania, Baidu, Nvidia, Intel and more. This list is only for the auto industry. There are many other companies and OEMs using QNX.\n\nIf you are referring to IVY when you say phantomware. Although it isn't  launched yet, it's been in development for years in partnership with Amazon, they have design wins with 23 of the 25 EV companies already and if you look at page 13 of the following deck ([https://www.blackberry.com/us/en/pdfviewer?file=/content/dam/bbcomv4/blackberry-com/en/company/investors/BBAS-2021-Presentations.pdf](https://www.blackberry.com/us/en/pdfviewer?file=/content/dam/bbcomv4/blackberry-com/en/company/investors/BBAS-2021-Presentations.pdf)),  you'll see a preview of companies that are already integrating with IVY. IVY will also bring recurring monthly revenue as opposed to the one time license fee that QNX generates. Chen has also indicated that IVY will evolve into supporting smart cities.\n\nI would recommend that you actually read through the entire deck. \n\nWhat other products do they have in market today? How about:\n\n* Blackberry Alert - critical event management\n* Blackberry protect - Endpoint protection\n* Blackberry Persona - Behaviour and risk analytics\n* Blackberry Optics - thread detection &amp; response\n* Blackberry Gateway - network security and analytics\n* BlackBerry UEM - Endpoint control and management\n\nEach and every one of those offerings are wort researching but I'll let you do that if you are even interested in $BB. \n\n$BB are leaders when it comes to patents owned relating to AI/ML Cyber Security with 63% of patents. Next up is Carbon black with only 26% of patents. Crowdstrike only has 11%.\n\n$BB has government security certifications that no one else has obtained. (ex: NSA, CSfC, DoDIN and FedRAMP)\n\nAll 7 of the G7 Governments and 18 of the G20 governments are blackberry customers and I'm not talking about phones here.\n\nThey've been focusing on transformation for the last 8 years (which CEO John Chen is renowned for doing).\n\nNow they are ready for growth and are starting to market their products. \n\nWatch this video from this year's Needham virtual technology &amp; media conference to hear Tom Eacobacci's insight into how they will market their products [https://youtu.be/Ik7hYuH8sS4](https://youtu.be/Ik7hYuH8sS4)\n\nThese are only a few reasons why their future looks bright. You don't have to search much to find details on other factors like the Facebook settlement, patent sale for mobile related patents they no longer need, recent partnerships, IVY fund... ... ...\n\nStill think they are worth Dick? Reason why they are so undervalued is because people still think they make cell phones and fail to see the potential. To be honest, that is great news for us bulls because if everyone realized what $BB is up to, we wouldn't have the opportunity to buy it at these low prices. I guess I should say thank you?",
        "created_utc": 1622504695,
        "id": "h04wb5a",
        "permalink": "/r/wallstreetbets/comments/npa7k6/bb_unbiased_technical_analysis/h04wb5a/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1622533495.0
    },
    {
        "author": "TrouserSnake88",
        "body": "Worked on TSLA and AAPL, soooooo....... I’m back in NVDA!",
        "created_utc": 1621650318,
        "id": "gz0jigq",
        "permalink": "/r/investing/comments/ni2mjv/nvidia_proposes_4for1_stock_split/gz0jigq/",
        "score": 28,
        "subreddit": "investing",
        "created": 1621679118.0
    },
    {
        "author": "Fledgeling",
        "body": "NVDA $700 post split 🚀🚀 🚀",
        "created_utc": 1621620110,
        "id": "gyyw4dc",
        "permalink": "/r/wallstreetbets/comments/nhudws/nvidia_sets_4for1_stock_split_shares_rise/gyyw4dc/",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1621648910.0
    },
    {
        "author": "Dpad124",
        "body": "I don't own any shares currently; however, I may be moving capital over soon as I think the market is overselling them. They have a strong CEO and will likely continue gaining market share from NVDA and and INTC. In my opinion, I would consider them a good long play.",
        "created_utc": 1620098341,
        "id": "gwv60ck",
        "permalink": "/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/gwv60ck/",
        "score": 27,
        "subreddit": "stocks",
        "created": 1620127141.0
    },
    {
        "author": "chancho3",
        "body": "NVDA",
        "created_utc": 1621683079,
        "id": "gz1nv1k",
        "permalink": "/r/wallstreetbets/comments/nifw2m/most_anticipated_earnings_releases_for_the_week/gz1nv1k/",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1621711879.0
    },
    {
        "author": "peterock_",
        "body": "I did sell some, NVIDIA and Qualcomm were long plays for me. I paid off some debt, bought myself a fairlady Z Datsun and bought AMC (7 bucks) and Gamestop (50ish bucks).\n\nSo, I think I did ok.\n\nIf it pays off, I'll buy more Datsuns and Japanese classics. My car hobby turned into additional investments, they increase in value AND I get to enjoy them.",
        "created_utc": 1621617031,
        "id": "gyyp7um",
        "permalink": "/r/stocks/comments/nhs698/nvidia_announces_fourforone_stock_split/gyyp7um/",
        "score": 26,
        "subreddit": "stocks",
        "created": 1621645831.0
    },
    {
        "author": "Inside_Pochinki",
        "body": "Since we don't know whether off-worlders want to exploit humans/earth as a resource, as an anthropological study (think South American indians) or to welcome us to the universe in their version of a third (4th, 5th) world country is purely speculative.  Any technology they show us would be the equivalent of magic in our eyes. Like showing a 13th century knight a surface to air missle or a monk working on moveable type an iphone. It might take generations to understand it.\n\nSome talking points: \n\n1) If they don't want to eat us (there are easier ways to create protein than catching and processing a meat sack) but want to exploit resources, then perhaps they want to trade, buy extractive industries (mining, heavy equipment).\n\n2) If they don't have the concept of trade, and only take by force, then we're toast anyway. Buy bugout gear and live off the grid for as long as you can. Patriot Supply and Readywise are not publicly traded, but Coleman is as part of Newell Brands (NWL) and just had a stock split. Any of the gun manufacturers would likely do well, IF they were publicly traded. Only Ruger (RGR and Colt (Olin mnfg OLN) will do you any good before the market tanks due to the aforementioned bugout.\n\n3) If they are just studying us, and had an equivalent of a NSF grant to study indigenous species, and stupidly left some equipment behind, then, by all means, find out if Lockhead-Martin, GE, SpaceX etc, got access to it and quietly invest. If the DOD got the item first, go Lockhead-Martin or General Dynamics. Otherwise, if the item was IT related, especially storage, NVIDIA, Intel, etc. If it was communications, maybe a SPAC like FIVG, or Raytheon.\n\n4) If they turn out to be benevolent, and want us as a \"partner\" of some sort, then we go with the space tech and extractive models. a) Extracting elements from asteroids is substantially cheaper once you are out there, but you have to get people, resources, support and some medium of exchange out there. Buy SPCX, since Musk has the vision. b) You also will need a bunch of new psychiatrists since this won't be easy for anyone to deal with. c) Designers for all the alien themed clothing, cars and tchotchkes that will emerge. d) engineers and mathematicians to make sure space vehicles don't end up in the sun.  \n\nThanks for reading this far into the endless drivel. \n\nTL: DR\n\nIf we're not food or slaves, then buy rockets.\n\nGood luck.",
        "created_utc": 1621286662,
        "id": "gyhsxsh",
        "permalink": "/r/wallstreetbets/comments/nep3rh/what_stocks_should_someone_acquire_ahead_of/gyhsxsh/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1621315462.0
    },
    {
        "author": "EstimateOk8103",
        "body": "dont fk me NVDA",
        "created_utc": 1622059623,
        "id": "gzk06hv",
        "permalink": "/r/wallstreetbets/comments/nlq1js/what_are_your_moves_tomorrow_may_27_2021/gzk06hv/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1622088423.0
    },
    {
        "author": "Pastatube",
        "body": "NVDA TO 700 🚀🚀🚀",
        "created_utc": 1621618402,
        "id": "gyysbs9",
        "permalink": "/r/wallstreetbets/comments/nhudws/nvidia_sets_4for1_stock_split_shares_rise/gyysbs9/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1621647202.0
    },
    {
        "author": "gorays21",
        "body": "RTX 3060 is out of stock but NVIDIA stock is still in stock.....",
        "created_utc": 1621616038,
        "id": "gyymyud",
        "permalink": "/r/stocks/comments/nhs698/nvidia_announces_fourforone_stock_split/gyymyud/",
        "score": 24,
        "subreddit": "stocks",
        "created": 1621644838.0
    },
    {
        "author": "Rbank-",
        "body": "Amd is selling out all their cards as well. The gap between nvidia and amd performance wise has been getting smaller with the last 2 generations. \n\nAmd has also been gaining market share with their CPUs.\n\nNvidia may be a good buy, but so should AMD, ps5 and XSX aren’t going anywhere anytime soon.",
        "created_utc": 1621652283,
        "id": "gz0muxw",
        "permalink": "/r/wallstreetbets/comments/ni8zp2/nvidia_is_a_good_buy_right_now/gz0muxw/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1621681083.0
    },
    {
        "author": "RockeManTT",
        "body": "I don’t buy AMC I don’t buy GME. This sub used to be a place to get DD and the latest info on lesser known companies that might be on the move. Can mods give GME and AMC their own threads.. Fucking tired of this shit. And buy NVDA, AA, FAS, MGA. This is financial advice",
        "created_utc": 1622234189,
        "id": "gzsuikj",
        "permalink": "/r/wallstreetbets/comments/nn680g/weekend_discussion_thread_for_the_weekend_of_may/gzsuikj/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1622262989.0
    },
    {
        "author": "sreesid",
        "body": "It's not just AMD/Nvidia either. Apple is now a legitimate threat to Intel. They are getting rid of Intel in their Mac books, including the pros. Their M1 chips are ridiculous, both in terms of power and battery gains. That is a huge loss for Intel.",
        "created_utc": 1622254107,
        "id": "gztv8t7",
        "permalink": "/r/investing/comments/nn7zx6/intel_is_over_looked_by_amd_hype/gztv8t7/",
        "score": 23,
        "subreddit": "investing",
        "created": 1622282907.0
    },
    {
        "author": "TheApricotCavalier",
        "body": "NVIDIA is the weapon of choice for scientific computing, of which bitcoin mining is just one expression. They've done well in making themselves difficult to replace; eventually the monopoly will be broken, but they'll rake in ducats until then",
        "created_utc": 1621664147,
        "id": "gz1400y",
        "permalink": "/r/investing/comments/ni2mjv/nvidia_proposes_4for1_stock_split/gz1400y/",
        "score": 23,
        "subreddit": "investing",
        "created": 1621692947.0
    },
    {
        "author": "JoanOfSnarke",
        "body": "Man, I better throw away all my $NVDA so I can own some shares of Heinz Ketchup or some shit.\n\n/s",
        "created_utc": 1620748005,
        "id": "gxqozct",
        "permalink": "/r/wallstreetbets/comments/n9vcz9/oh_boy_inflation_is_coming_go_from_growth_to_value/gxqozct/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1620776805.0
    },
    {
        "author": "stonksrgud",
        "body": "Tons.\n\n\nGoogl, appl, amzn, arkx, brkb, BA, Dkng, fcx, Lyft, msft, NVDA, pfe, rcl, now, luv, TT, Uber, dis, wfc, wynn\n\nI don’t give financial advice, dont follow my trades.  I can barely tie my Velcro shoes",
        "created_utc": 1620358462,
        "id": "gx8fv5l",
        "permalink": "/r/wallstreetbets/comments/n6jequ/there_is_no_crash_coming_for_growth_stocks/gx8fv5l/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1620387262.0
    },
    {
        "author": "helanti",
        "body": "The risk with NVDA is crypto currencies may shift towards less computationally intensive options. Which is probably a good thing. However it will diminish graphics card business.",
        "created_utc": 1621437402,
        "id": "gypf9rz",
        "permalink": "/r/stocks/comments/ng2d39/next_set_of_trillion_dollar_companies/gypf9rz/",
        "score": 20,
        "subreddit": "stocks",
        "created": 1621466202.0
    },
    {
        "author": "Punisher_skull",
        "body": "I don't think demand would collapse. For one most people clamoring to get a gpu won't want a burnout mining card\n\nSecond I don't see mining going anywhere anytime soon\n\nThird amd has been consistent in crushing intel on gaming  and value in CPUs last year ish and probably will for a few more years. \n\nFourth amd has been getting closer and closer to matching/beating Nvidia in gpus. \n\nSo even if mining collapses amd still will probably keep taking more market share from Intel and Nvidia.",
        "created_utc": 1621086513,
        "id": "gy7q4el",
        "permalink": "/r/stocks/comments/ncyqua/risks_regarding_amd/gy7q4el/",
        "score": 20,
        "subreddit": "stocks",
        "created": 1621115313.0
    },
    {
        "author": "jgallo18",
        "body": "I’m assuming Nvidia is doing so well due to crypto mining utilizing primarily their GPUs. Would this make it a good time to purchase shares?",
        "created_utc": 1621637353,
        "id": "gyzw5fs",
        "permalink": "/r/investing/comments/ni2mjv/nvidia_proposes_4for1_stock_split/gyzw5fs/",
        "score": 20,
        "subreddit": "investing",
        "created": 1621666153.0
    },
    {
        "author": "ihavenipplefocker",
        "body": "NVIDIA long term is a strong play. You have earnings, stock split and ARM acquisition as three question marks with the ARM acquisition being the biggest in my opinion. If the ARM acquisition falls through it will cause a correction, whereas if it goes through I could see the stock pushing $800.",
        "created_utc": 1621984515,
        "id": "gzg7h14",
        "permalink": "/r/stocks/comments/nl1d02/thinking_about_nvidia/gzg7h14/",
        "score": 19,
        "subreddit": "stocks",
        "created": 1622013315.0
    },
    {
        "author": "imlaggingsobad",
        "body": "Me, a novice: *Three additional shares? That's like...free money right? I better buy some NVDA to take advantage of this.*",
        "created_utc": 1621653178,
        "id": "gz0ocks",
        "permalink": "/r/investing/comments/ni2mjv/nvidia_proposes_4for1_stock_split/gz0ocks/",
        "score": 19,
        "subreddit": "investing",
        "created": 1621681978.0
    },
    {
        "author": "Fitzroy86",
        "body": "WDC has nowhere the competitive advantages in storage that NVDA has in the GPU market. NVDA effectively is the GPU market with AMD being a teaser.",
        "created_utc": 1620836382,
        "id": "gxvay0i",
        "permalink": "/r/investing/comments/narr02/western_digital_the_next_nvidia/gxvay0i/",
        "score": 19,
        "subreddit": "investing",
        "created": 1620865182.0
    },
    {
        "author": "lilb2020",
        "body": "PAPERHANDS\n\nP - PLTR\n\nA - AAPL\n\nP - PANW\n\nE - ETSY\n\nR - RIOT\n\nH - HUBS\n\nA - AMZN\n\nN - NVDA\n\nD - DDOG\n\nS - SQ",
        "created_utc": 1621282495,
        "id": "gyhji49",
        "permalink": "/r/stocks/comments/nekijv/my_acronym_for_big_cap_tech_stocks_that_i_believe/gyhji49/",
        "score": 19,
        "subreddit": "stocks",
        "created": 1621311295.0
    },
    {
        "author": "mpmaley",
        "body": "So confused what nvda will do.  Most tech have been hurting after earnings even when beating.  With the stock split in wonder which way it will go.",
        "created_utc": 1621692534,
        "id": "gz21t7e",
        "permalink": "/r/options/comments/nihuna/most_anticipated_earnings_releases_for_the_week/gz21t7e/",
        "score": 19,
        "subreddit": "options",
        "created": 1621721334.0
    },
    {
        "author": "DarkElation",
        "body": "This is how I’m going to play nvidia as I missed the train.",
        "created_utc": 1621696141,
        "id": "gz28lbg",
        "permalink": "/r/wallstreetbets/comments/nifw2m/most_anticipated_earnings_releases_for_the_week/gz28lbg/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1621724941.0
    },
    {
        "author": "IBeefSupremeI",
        "body": "AMD has only relatively recently obtained such growth. With regards to personal computing, Intel has led on the central processor front for decades in terms of market share, partnerships with oems, and performance. At the same time, NVIDIA has dominated the consumer/professional/gaming graphics card segment, in terms of market share, technology, and performance. \n\nAfter building my AMD based PC in 2019, started really paying attention to parts, and news regarding AMD's products. Wife was convinced to buy in at a measly 30-40 a share, IIRC. And they have since performed beyond expectations. Their consumer products do not quite make the very top in terms of overall performance, but their value proposition in consumer products has yielded high growth in terms of adoption, and they are starting to secure deals with OEMs. \n\nTL;DR AMD is David vs Goliath on the two most important fronts AMD has. If you can consider them a David lol. But they're accelerating in terms of development and market share. I'm so long on AMD.",
        "created_utc": 1620097665,
        "id": "gwv4sof",
        "permalink": "/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/gwv4sof/",
        "score": 18,
        "subreddit": "stocks",
        "created": 1620126465.0
    },
    {
        "author": "narensankar",
        "body": "Reading other comments - I won’t comment on the valuation since different folks might have different risk tolerances. I am invested in AMD via bullish LEAP Puts. But I want to respond on some of the other technology or business related comments since that is my background. I have worked with both Intel and AMD as their partner as well as their competitor. They both have their strength and weakness. \n\nIntel biggest weakness currently is the fact that they own fabs that they need to keep busy. It is not easy for Intel to support third party usage of their fabs like for example competing with TSMC. Leading edge designs require lots of support from the fab to the chip designer in terms of libraries, models, tools etc. this is a multi year process and most designs of chips using leading edge processes are locked in around 4 years before MP. There is a lot that goes into decisions around wafer pricing, mask sets etc that makes it very difficult to move fabs once you are locked in. Some fabless design companies do try to accommodate multiple fabs but usually sacrifice either power, or die size or performance in order to do so. \n\nHence a leading edge CPU design like Zen4 won’t move fabs once the design is kicked off. This is usually a 3 to 4 year cycle from architecture study to first mass production. \n\nIntel is just starting to move in the direction of offering third parties to use their fabs. So getting to a point of being competitive to TSMC is probably 2 to 3 years away best case. Which means they need to keep their own chips flooding their fabs in order to amortize the capex. This limits how much they can take risks to compete with AMD or NVDA or for that matter Apple. So is Intel a threat to AMD - for sure yes. But will they blow AMD away anytime soon - no chance in hell. \n\nAlso the rest of the industry - Google, AMZN, MSFT, Dell, HP, BABA, Baidu, Tencent, Sony etc definitely want AMD to keep going strong since they never liked to be single sourced to Intel. Intel had monopoly pricing for the longest time and they squeezed most of the ODMs very hard. \n\nAs I mentioned before - AMD has been in this position before with the Opteron. And they blew the lead and dropped the ball on execution and gave up everything back to Intel. This is one of the main reasons now you have seen designs like Graviton emerge. But the current AMD team is much stronger and different from the one that blew up before. And so history repeating itself is low probability. But if that happens I believe the biggest beneficiary will be ARM and not Intel. \n\nIs NV a threat - perhaps yes - but again only on the margins for now. x64 still has too much of a software development advantage to be unseated by ARM in the general compute space. And NV historically has had limited success in moving their ARM CPU designs to the high performance arena. If the ARM acquisition goes through they will be more competitive but there is a significant portion of the server space - both cloud and on-premise that will stay x64 at least for the next decade. \n\nNow regarding issues on materials, crypto etc - there seems to be a misunderstanding. Crypto will keep moving to ASIC more and more. And as the pressure for power consumption becomes more critical for crypto success, the GPU will become less important. At least the GPU that is non compute and that drives a display. GPUs that are used for compute like for ML will become more important and any slack or drop in demand from crypto for GPUs will be more than compensated by the increase in demand for ML in the cloud. \n\nAnd regarding raw materials - the semiconductor supply chain is very complex. Most of the materials come from Japan, Korea, Taiwan and very little actually comes from China and the US. Especially in the leading edge nodes. Fabs are just one small portion of the equation. Things like substrates are critical and this was shown by the Fukushima disaster which bought the semiconductor industry to a standstill. So fears of moving materials back from China to US and hence giving Intel or others who have fabs an advantage is not true. Even Intel is dependent of companies like SPIL or AMAT or ASE or Nanya etc. Being fabless has become an advantage in the semiconductor space now compared to 20 years ago when Intel’s fab tech was head and shoulders above the rest of the industry. Having flexibility in targeting process nodes have given companies like AVGO, MRVL and NV huge advantages and have hampered Intel in expanding their footprint. For example Intel tried and failed to gain much in the networking space or the 5G space and it is still TBD it they will succeed in GPU and ML compute. They have killed many products in this space over the past 5 years. \n\nFull disclosure - I am long AMD, NV, ASML, AMAT, STM, ON and was short Intel before but now neutral on them.",
        "created_utc": 1621093002,
        "id": "gy82xj9",
        "permalink": "/r/stocks/comments/ncyqua/risks_regarding_amd/gy82xj9/",
        "score": 18,
        "subreddit": "stocks",
        "created": 1621121802.0
    },
    {
        "author": "som3crazydud3",
        "body": "Happy dance.  I'm excited for the extra liquidity and less capital intensive option plays as NVDA has been my go to stock this year.  Thanks for the info,  very helpful",
        "created_utc": 1621607312,
        "id": "gyy3gv3",
        "permalink": "/r/options/comments/nht38i/nvidia_stock_split_and_option_effect/gyy3gv3/",
        "score": 18,
        "subreddit": "options",
        "created": 1621636112.0
    },
    {
        "author": "walpole1720",
        "body": "Long live NVDA!  Huzzah!  Huzzah!\n\nJensen is my hero.",
        "created_utc": 1622067657,
        "id": "gzki0ae",
        "permalink": "/r/stocks/comments/nlqtjo/nvda_nvidia_announces_financial_results_for_first/gzki0ae/",
        "score": 18,
        "subreddit": "stocks",
        "created": 1622096457.0
    },
    {
        "author": "Antonceles",
        "body": "I was going to buy Nvidia for the share split and brought AMD instead. Super dumb. No regrets.",
        "created_utc": 1622487233,
        "id": "h03yu0b",
        "permalink": "/r/wallstreetbets/comments/np6tf9/amd_finally_breaking_out/h03yu0b/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1622516033.0
    },
    {
        "author": "bigguccisofa_",
        "body": "Netflix should be replaced with nvidia",
        "created_utc": 1621143464,
        "id": "gyanpe5",
        "permalink": "/r/StockMarket/comments/ndc383/faang_stock_performance_2021/gyanpe5/",
        "score": 17,
        "subreddit": "StockMarket",
        "created": 1621172264.0
    },
    {
        "author": "The_Contrarian01",
        "body": "Good morning contrarians!\n\nFutures are a bit higher this morning: Dow, S&amp;P, and Nasdaq all up about 0.3% as of 0620. Yesterday things were flat after a rally earlier in the day stalled.\n\nBond yields are ticking a bit lower. 10-year down to 1.569, perhaps an indication that investors are less worried about inflation. Disappointing new home sales yesterday likely contributed to that. The VIX is down to about 20, but not sure if that really means anything anymore.\n\nThere just isn’t that much to move markets today. Couple Fed speeches. Bank CEOs will testify before a joint session of Congress. Some earnings, but mostly not until after the close: Dick’s Sporting Goods, Abercrombie &amp; Fitch, American Eagle Outfitters, NVIDIA, Snowflake.\n\nPandemic reopening names and meme stocks are doing well, along with cryptos. This indicates a healthy appetite for risk taking.",
        "created_utc": 1622031995,
        "id": "gzi7xoa",
        "permalink": "/r/investing/comments/nlcd30/daily_general_discussion_and_spitballin_thread/gzi7xoa/",
        "score": 17,
        "subreddit": "investing",
        "created": 1622060795.0
    },
    {
        "author": "Rbelkc",
        "body": "With nvda stock split in July why wouldn’t it take off like Tesla and apple did after their announcement? I realize the split itself creates no intrinsic value but same for the other two and they rallied like crazy on the news.",
        "created_utc": 1621802546,
        "id": "gz78eck",
        "permalink": "/r/options/comments/njdshw/expected_moves_this_week_nvidia_salesforce/gz78eck/",
        "score": 17,
        "subreddit": "options",
        "created": 1621831346.0
    },
    {
        "author": "RandomlyGenerateIt",
        "body": "From the DL perspective (which is massive), as far as I'm aware, Nvidia is still untouchable, because a lot of software has been optimized specifically for it. I'm a bit out of touch lately but 3 years ago there were pretty much zero alternatives.",
        "created_utc": 1620372521,
        "id": "gx8yxnk",
        "permalink": "/r/investing/comments/n6rgw5/possible_overvalued_stocks_in_sp_500/gx8yxnk/",
        "score": 16,
        "subreddit": "investing",
        "created": 1620401321.0
    },
    {
        "author": "imlaggingsobad",
        "body": "Disney, Paypal, Nvidia, Tesla, Salesforce, Netflix",
        "created_utc": 1621428499,
        "id": "gyouydl",
        "permalink": "/r/stocks/comments/ng2d39/next_set_of_trillion_dollar_companies/gyouydl/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1621457299.0
    },
    {
        "author": "BubbyginkESO",
        "body": "I really don't think NVDA is overvalued. Its forward P/E is 40 - lower than AMZN's (45), not much higher than MSFT's (30), etc. It isn't like they have some kind of crazy 100+ forward P/E evaluation. Plus their forward P/E is justified from their insane growth, which has been happening even despite the chip shortage. There is a high demand for their current products that will only grow and they are getting into CPUs now. And even more forward looking, they are the overwhelming leader in AI with CUDA so I just don't see their growth slowing any time soon. IMO, their valuation is more than fair given their future growth trajectory.",
        "created_utc": 1622233999,
        "id": "gzsu402",
        "permalink": "/r/stocks/comments/nn2ox3/nvda_valuation_hold_or_sell/gzsu402/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1622262799.0
    },
    {
        "author": "slotracer43",
        "body": "No, don't sell the 100% return stock unless something has changed in the business. Winners win. Imagine selling Amazon, nVidia, Lulu, Chipotle, or whatever after a double instead of holding for the 10x, 15x, or 100x. My main gains have come from stocks purchased years ago which have increased in value many times over (and which i held through thick and thin). My main regrets are not the duds i bought (you can only lose 100% in an individual stock, and that doesn't happen often), but the ones I sold too early.  I thought I was a genius selling half my Chipotle with a 100% gain. Meanwhile the half i held has increased 16x...",
        "created_utc": 1621957501,
        "id": "gzeiqd4",
        "permalink": "/r/investing/comments/nklmfn/the_single_greatest_edge_an_investor_can_have/gzeiqd4/",
        "score": 15,
        "subreddit": "investing",
        "created": 1621986301.0
    },
    {
        "author": "shuckmyspoon",
        "body": "Hey guys here @ NVDA we've broken new all time highs for record earnings, we're controlling considerable market share, we're showing record growth which we expect to continue, and we're issuing a 4/1 stock split.   \n\n\nMarket: Meh, better sell off in droves and tank the stock.",
        "created_utc": 1622063506,
        "id": "gzk98ty",
        "permalink": "/r/wallstreetbets/comments/nlq1js/what_are_your_moves_tomorrow_may_27_2021/gzk98ty/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1622092306.0
    },
    {
        "author": "ceskanda",
        "body": "Made 15k+ from nvda trades this month and lost 15k+ from tsla trades. Perfectly balanced as all things should be.",
        "created_utc": 1621550693,
        "id": "gyvobcp",
        "permalink": "/r/wallstreetbets/comments/nh9y3g/what_are_your_moves_tomorrow_may_21_2021/gyvobcp/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1621579493.0
    },
    {
        "author": "crunchypens",
        "body": "He was gambling like most of the apes. If it hit he would have had crazy return on investment. Check out NVDA and what happened on Friday. If you bought 0dte 645c at open would have made a fortune.",
        "created_utc": 1622313329,
        "id": "gzw9nsm",
        "permalink": "/r/wallstreetbets/comments/nnn0oz/7k_loss_on_zerodays_my_wifes_bf_must_be_kelvin/gzw9nsm/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1622342129.0
    },
    {
        "author": "WidepeepoHappysad",
        "body": "yep, that's right! intel is left behind! and Nvidia is opverpriced!\n\nAMD rules!",
        "created_utc": 1622481893,
        "id": "h03nxdk",
        "permalink": "/r/wallstreetbets/comments/np6tf9/amd_finally_breaking_out/h03nxdk/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1622510693.0
    },
    {
        "author": "Premier_Legacy",
        "body": "Totally forgot NVDA had earnings today and it’s my second largest holding. Am I doing it right",
        "created_utc": 1622060758,
        "id": "gzk2vic",
        "permalink": "/r/wallstreetbets/comments/nlq1js/what_are_your_moves_tomorrow_may_27_2021/gzk2vic/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1622089558.0
    },
    {
        "author": "Kashm11r",
        "body": "Best semiconductor stock in my opinion, better value than Nvidia based on fundamentals.",
        "created_utc": 1621024050,
        "id": "gy541xo",
        "permalink": "/r/stocks/comments/ncdos3/is_amd_still_worth_buying/gy541xo/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1621052850.0
    },
    {
        "author": "buttintheclouds",
        "body": "Another reason may be because they are trying to get included in the DJIA which is a price weighted index. A share price of 600 makes NVDA basically ineligible due to their disproportionally high share price. At 150 they could be included.",
        "created_utc": 1621955945,
        "id": "gzef4as",
        "permalink": "/r/stocks/comments/nkkuqp/nvidia_stock_split/gzef4as/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1621984745.0
    },
    {
        "author": "Toothlesskinch",
        "body": "NVDA gonna break open after they announce that miners bought everything they could make, faster than they could make it.",
        "created_utc": 1621985325,
        "id": "gzg92fb",
        "permalink": "/r/wallstreetbets/comments/nkyn0w/what_are_your_moves_tomorrow_may_26_2021/gzg92fb/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1622014125.0
    },
    {
        "author": "the_golder_spoon",
        "body": "I completely agree with your opinion on that, also there are some promising growth stocks that pay dividends like nvidia for one example.",
        "created_utc": 1622482067,
        "id": "h03oa8w",
        "permalink": "/r/investing/comments/np7nrt/made_200k_this_year_going_to_just_go_knock_off_a/h03oa8w/",
        "score": 13,
        "subreddit": "investing",
        "created": 1622510867.0
    },
    {
        "author": "FalconsBlewA283Lead",
        "body": "NVDA making it hard to stick to my plan of not buying till post-earnings or post-split lol. Must stay disciplined...",
        "created_utc": 1621865766,
        "id": "gz9wktn",
        "permalink": "/r/stocks/comments/njtw5g/rstocks_daily_discussion_monday_may_24_2021/gz9wktn/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1621894566.0
    },
    {
        "author": "BearShirtToday",
        "body": "*poke nvda*. You ded bro?",
        "created_utc": 1622065474,
        "id": "gzkd622",
        "permalink": "/r/wallstreetbets/comments/nlq1js/what_are_your_moves_tomorrow_may_27_2021/gzkd622/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1622094274.0
    },
    {
        "author": "GYN-k4H-Q3z-75B",
        "body": "The split is nice and Nvidia is doing well, but my eyes are still on the ARM merger. If that gets the nod from regulators, Nvidia is golden. If it does not, growth becomes harder for Nvidia. The reason is that ARM as an architecture stands to expand into the desktop segment. Apple is transitioning, and Windows has the software support but is lacking the hardware. The merger would give Nvidia control over the architecture and companies like Apple and Qualcomm would have to pay royalties to Nvidia who could at the same time churn out their own ARM chips.",
        "created_utc": 1621983194,
        "id": "gzg4tye",
        "permalink": "/r/stocks/comments/nl1d02/thinking_about_nvidia/gzg4tye/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1622011994.0
    },
    {
        "author": "TheSayianPrincess",
        "body": "Nvidia just announced a 4 to 1 stock split too",
        "created_utc": 1621800949,
        "id": "gz750to",
        "permalink": "/r/options/comments/njdshw/expected_moves_this_week_nvidia_salesforce/gz750to/",
        "score": 13,
        "subreddit": "options",
        "created": 1621829749.0
    },
    {
        "author": "VMP85",
        "body": "Are people really going to freak out over another red day and look to flee companies like MSFT, AAPL, AMD and NVDA? As if long term, these companies aren't going to see solid returns?",
        "created_utc": 1620132688,
        "id": "gwwfvjf",
        "permalink": "/r/stocks/comments/n4k6cm/rstocks_daily_discussion_technicals_tuesday_may/gwwfvjf/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1620161488.0
    },
    {
        "author": "imsilver4fukyou",
        "body": "well thank god i didnt go in NVDA",
        "created_utc": 1622060610,
        "id": "gzk2j2c",
        "permalink": "/r/wallstreetbets/comments/nlq1js/what_are_your_moves_tomorrow_may_27_2021/gzk2j2c/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1622089410.0
    },
    {
        "author": "BearShirtToday",
        "body": "I’m gonna need NVDA to stop being a little bitch and drill like a real man",
        "created_utc": 1622064280,
        "id": "gzkazpt",
        "permalink": "/r/wallstreetbets/comments/nlq1js/what_are_your_moves_tomorrow_may_27_2021/gzkazpt/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1622093080.0
    },
    {
        "author": "ThatGrill4",
        "body": "Trying to decide if I should sell or hold my NVIDIA options before Thursday",
        "created_utc": 1621878863,
        "id": "gzapxv5",
        "permalink": "/r/options/comments/nk0ajr/historical_post_earnings_moves_mega_compilation/gzapxv5/",
        "score": 13,
        "subreddit": "options",
        "created": 1621907663.0
    },
    {
        "author": "Ultimate_Broseph",
        "body": "Yeah but your missing he's other point too about amd. It's not just apples M1 chip but they're losing market share to amd and nvidia just announced they are throwing their hats in the ring.\n\nAn analyst just downgraded intel to like 40~ish dollars this morning.",
        "created_utc": 1620668402,
        "id": "gxmrnhv",
        "permalink": "/r/wallstreetbets/comments/n90gsv/apple_during_dotcom_bubble_vs_tesla_now_margin/gxmrnhv/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1620697202.0
    },
    {
        "author": "SatriaDigja",
        "body": "Nvidia seems a better option for me. Strong trend ahead, smart acquisition (Mellanox, ARM), CEO with passion.",
        "created_utc": 1622237678,
        "id": "gzt1m9z",
        "permalink": "/r/stocks/comments/nn724o/ttd_or_nvda_which_one_is_better/gzt1m9z/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1622266478.0
    },
    {
        "author": "Master_Relative",
        "body": "RIP NVDA call holders",
        "created_utc": 1622060507,
        "id": "gzk2a89",
        "permalink": "/r/wallstreetbets/comments/nlq1js/what_are_your_moves_tomorrow_may_27_2021/gzk2a89/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1622089307.0
    },
    {
        "author": "BackgroundSearch30",
        "body": "Yep. You should be happy. There's no reason to believe that with the semiconductor shortage and pent up demand on NVDA products that this won't continue to have a solid future. Go take a look at AAPL and TSLA and see what happened to them over their stock split events. It might take a few months to resolve, but if you're a value investor in NVDA, this should be a good thing for you.",
        "created_utc": 1621607500,
        "id": "gyy3vho",
        "permalink": "/r/options/comments/nht38i/nvidia_stock_split_and_option_effect/gyy3vho/",
        "score": 12,
        "subreddit": "options",
        "created": 1621636300.0
    },
    {
        "author": "LazyHater",
        "body": "They plan to nerf their balance sheet and widen the gap between them and nvidia why",
        "created_utc": 1621444014,
        "id": "gypv84r",
        "permalink": "/r/wallstreetbets/comments/ngajkg/amd_announces_4b_share_buyback_program/gypv84r/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1621472814.0
    },
    {
        "author": "StrictDefinition4",
        "body": "NVDA looks good pre market earnings must be good this week and stock split should be confirmed soon",
        "created_utc": 1621943712,
        "id": "gzdqxqd",
        "permalink": "/r/stocks/comments/nklllm/rstocks_daily_discussion_technicals_tuesday_may/gzdqxqd/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1621972512.0
    },
    {
        "author": "FatDickGreg",
        "body": "NVDA over here having a fucking seizure",
        "created_utc": 1622060887,
        "id": "gzk36ig",
        "permalink": "/r/wallstreetbets/comments/nlq1js/what_are_your_moves_tomorrow_may_27_2021/gzk36ig/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1622089687.0
    },
    {
        "author": "AgyleArgyle",
        "body": "For the last 5 years NVDA has traded between a PE of 20 and 100. So the question to ask is does its TTM 52% revenue growth and 52% earnings growth make it worth its current multiple. Today’s TTM 86 PE is 2021s 43 PE with that kind of growth",
        "created_utc": 1621897616,
        "id": "gzbuuop",
        "permalink": "/r/StockMarket/comments/nkamjm/is_it_time_to_cash_out_nvda/gzbuuop/",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1621926416.0
    },
    {
        "author": "Skilledthunder",
        "body": "Quick, someone make a comment about the NVDA stock split. I didn't see it the first 16 times.",
        "created_utc": 1621602680,
        "id": "gyxu3ft",
        "permalink": "/r/wallstreetbets/comments/nhoua8/daily_discussion_thread_for_may_21_2021/gyxu3ft/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1621631480.0
    },
    {
        "author": "randomlygeneratedman",
        "body": "As someone in an industry that largely depends on video cards (game design), I can give a simple answer. NVDA has a relative monopoly on the space, and have been making partnerships to ensure that their cards are a standard for developers. AMD is beating Intel in the processor space, but demands have expanded much more towards the video card sector recently for various reasons, and I sort of feel like Intel is destined to be a Compaq that has been too slow to adapt.\n\nThat said, I think AMD can seriously challenge NVDA, but they need a serious focus on that area which is difficult.",
        "created_utc": 1620116482,
        "id": "gwvu7wu",
        "permalink": "/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/gwvu7wu/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1620145282.0
    },
    {
        "author": "hahdbdidndkdi",
        "body": "Dis? Interesting. Must be a cash like position?\n\nAlso selling nvda and Netflix and others to load up on the memes pltr and coin and others. 👌",
        "created_utc": 1621038096,
        "id": "gy5wbho",
        "permalink": "/r/stocks/comments/ncmkme/arks_daily_trade_information_05142021/gy5wbho/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1621066896.0
    },
    {
        "author": "DarkRooster33",
        "body": "Do you know a single thing about Amazon and Nvidia and their businesses ?",
        "created_utc": 1620147980,
        "id": "gwxfpn1",
        "permalink": "/r/stocks/comments/n4slni/warren_buffett_is_right_about_market/gwxfpn1/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1620176780.0
    },
    {
        "author": "StrictDefinition4",
        "body": "The NVDA buy before the split play is paying off",
        "created_utc": 1622229232,
        "id": "gzsjwme",
        "permalink": "/r/stocks/comments/nmtz3z/rstocks_daily_discussion_fundamentals_friday_may/gzsjwme/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1622258032.0
    },
    {
        "author": "TrouserSnake88",
        "body": "Sold all my NVDA like a month ago at $640 to buy the dip on my beat down growth stocks.... so I ain’t mad about buying back in today at $602....",
        "created_utc": 1621652818,
        "id": "gz0nraj",
        "permalink": "/r/investing/comments/ni2mjv/nvidia_proposes_4for1_stock_split/gz0nraj/",
        "score": 11,
        "subreddit": "investing",
        "created": 1621681618.0
    },
    {
        "author": "DarkRooster33",
        "body": "Simply said look at their businesses as well. Speculate forward.\n\nWhat is next for AMD, producing a better chip ? Their stock price rise seems to be more about can Intel shit itself even more.\n\nWhat is next for Nvidia, artificial intelligence ?\n\n'' On September 13, 2020, Nvidia announced that it had entered into a definitive agreement to purchase Arm Inc. from SoftBank Group Corp. (TSE:9984) for $40 billion.10 Arm is a U.K.-based semiconductor and software design company specializing in CPU architecture. Nvidia says the acquisition will help it to expand its AI capacities and advance a range of technologies from cloud computing and smartphones to self-driving cars and the internet of things (IoT).11 Nvidia noted in its annual FY 2021 filings that the transaction is expected to close some time in the first quarter of calendar year 2022.12 ''\n\nLooks like Nvidia has always been more universal and are pushing for something big, if they succeed that will be quite the money banger.\n\nWhich company would people rather buy for next 5 - 20 years ? Will AMD still be producing better chips than their last one ? Is AMD going to be around or are Intel, Apple and Nvidia going to push breakthrough things AMD can't possibly match ? AMD is quite scarier and riskier investment in that regard. Nvidia on the other hand has bigger stronghold with their GPUs and have a lot of speculative things that could pay off big time.\n\nDisclaimer, i own fuck ton of both equally.",
        "created_utc": 1620098851,
        "id": "gwv6wt1",
        "permalink": "/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/gwv6wt1/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1620127651.0
    },
    {
        "author": "Dpad124",
        "body": "Other can answer with the more intangible items. From a financial perspective, let's take a look at the 10K's of each company (since this is the last filing of NVDA). Over the last fiscal year, here are some key stats:\n\nRevenue:\n\nNVDA: $16.7B / AMD: $9.7B (hrmmm this seems closer than 4x like you mention, more like 1.7x)\n\nGross Profit:\n\nNVDA: $10.3B / AMD: 4.3B (Interesting, it appears NVDA has better margins so now we are close to 2.5x)\n\nIncome Before Taxes:\n\nNVDA: $4.4B / AMD: $1.3B (Now we are all the way up to 3.4x, so getting close to 4x. This shows AMD has lower margins, and higher comparative expenses).\n\nNet Income:\n\nNVDA: $4.3B / AMD:$ 2.5B (Woah we dropped down to 1.72x. If we look, this is due to AMD having carryover losses and Tax carry forwards that reduced AMD's tax burden and net them returns instead of paying taxes hence why they have more net income than they earned).\n\nSo what can we conclude on this? Don't just look at revenue. A company can have an insane amount of revenue, but if they are inefficient or have too many operating expenses, they could potentially have  little to no revenue. Next, comparatively, if we ignore the losses and credits AMD took to boost their net income, NVDA is actually coming close to that 4x difference we are seeing in valuation. That and all the intangibles others are mentioning, and AMD's recent pull back, attribute to the difference.",
        "created_utc": 1620097300,
        "id": "gwv44a2",
        "permalink": "/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/gwv44a2/",
        "score": 188,
        "subreddit": "stocks",
        "created": 1620126100.0
    },
    {
        "author": "iggaguy",
        "body": "Soon to be 33 years old. Never had a girlfriend or sex. Will likely lose 30k on my NVDA put spread. Roast me.",
        "created_utc": 1620087832,
        "id": "gwul3ek",
        "permalink": "/r/wallstreetbets/comments/n45qyv/what_are_your_moves_tomorrow_may_04_2021/gwul3ek/",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1620116632.0
    },
    {
        "author": "Dpad124",
        "body": "I don't own any shares currently; however, I may be moving capital over soon as I think the market is overselling them. They have a strong CEO and will likely continue gaining market share from NVDA and and INTC. In my opinion, I would consider them a good long play.",
        "created_utc": 1620098341,
        "id": "gwv60ck",
        "permalink": "/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/gwv60ck/",
        "score": 27,
        "subreddit": "stocks",
        "created": 1620127141.0
    },
    {
        "author": "IBeefSupremeI",
        "body": "AMD has only relatively recently obtained such growth. With regards to personal computing, Intel has led on the central processor front for decades in terms of market share, partnerships with oems, and performance. At the same time, NVIDIA has dominated the consumer/professional/gaming graphics card segment, in terms of market share, technology, and performance. \n\nAfter building my AMD based PC in 2019, started really paying attention to parts, and news regarding AMD's products. Wife was convinced to buy in at a measly 30-40 a share, IIRC. And they have since performed beyond expectations. Their consumer products do not quite make the very top in terms of overall performance, but their value proposition in consumer products has yielded high growth in terms of adoption, and they are starting to secure deals with OEMs. \n\nTL;DR AMD is David vs Goliath on the two most important fronts AMD has. If you can consider them a David lol. But they're accelerating in terms of development and market share. I'm so long on AMD.",
        "created_utc": 1620097665,
        "id": "gwv4sof",
        "permalink": "/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/gwv4sof/",
        "score": 18,
        "subreddit": "stocks",
        "created": 1620126465.0
    },
    {
        "author": "RADIO02118",
        "body": "[Some of the shitpost reviews](https://www.amazon.com/PNY-TCSV100MPCIE-PB-Nvidia-Tesla-v100/product-reviews/B076P84525/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&amp;reviewerType=all_reviews) on Amazon for Nvidia's Tesla V100 GPU are hilarious. Specifically the 1st one. 😂 \n\nContext: This is an $8K GPU meant for high powered computing (training neural networks, AI models etc) and not meant for \"gaming.\"",
        "created_utc": 1619962642,
        "id": "gwnsddf",
        "permalink": "/r/wallstreetbets/comments/n222v3/weekend_discussion_thread_for_the_weekend_of/gwnsddf/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1619991442.0
    },
    {
        "author": "PootSnootBoogie",
        "body": "Their earnings are ALWAYS like that. I think someone already said it, but their worth is in their patents and IP's, especially in AR and LiDAR. As they said in the earnings call, they're ramping up production to meet future demands. They're already also in on the Microsoft DoD contract.\n\nMVIS is mainly sitting around waiting to be acquired by a big dog that can maximize the profits off their tech. Rumors have been around forever, but lately most cases/theories are being made for Microsoft, Nvidia, and Google.\n\nMVIS earnings mean nothing. They always look like that. I sold before earnings and bought right back in after with no worries.",
        "created_utc": 1620064541,
        "id": "gwt50v7",
        "permalink": "/r/wallstreetbets/comments/n3zc2z/bought_more_mvis_while_its_dipping_for_the_may/gwt50v7/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1620093341.0
    },
    {
        "author": "Really_Very_Expert",
        "body": "Do I buy NVDA because of the chip shortage or is that retarded",
        "created_utc": 1620017082,
        "id": "gwqxtj6",
        "permalink": "/r/wallstreetbets/comments/n3ekxx/what_are_your_moves_tomorrow_may_03_2021/gwqxtj6/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620045882.0
    },
    {
        "author": "AltcoinTraderNy",
        "body": "Isn't NVDA, AMZN technically on sale ?.",
        "created_utc": 1620070856,
        "id": "gwtjym3",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwtjym3/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620099656.0
    },
    {
        "author": "ATLSox87",
        "body": "Why do gay bears always pick on AMD over Nvidia and Intel. The drop on AMD is so much more severe rn",
        "created_utc": 1620050163,
        "id": "gws7khy",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gws7khy/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620078963.0
    },
    {
        "author": "GeezWhizGuys",
        "body": "Guh. My semis are fuking me hard rn behind the Wendy's. AMD, LRCX, NVDA taking turns.",
        "created_utc": 1620093256,
        "id": "gwuw9i7",
        "permalink": "/r/wallstreetbets/comments/n45qyv/what_are_your_moves_tomorrow_may_04_2021/gwuw9i7/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620122056.0
    },
    {
        "author": "suprehm",
        "body": "What do you guys think about NVIDIA right now? They are the leader in AI training, and there is no one else who operates in that market currently. The stock just went below 595, was thinking about picking some up to hold till December.",
        "created_utc": 1620056404,
        "id": "gwslmic",
        "permalink": "/r/investing/comments/n3rl8q/daily_general_discussion_and_spitballin_thread/gwslmic/",
        "score": 5,
        "subreddit": "investing",
        "created": 1620085204.0
    },
    {
        "author": "Edibleglass69420",
        "body": "If you just use them to get leads and then do your DD on them they are definitely useful.  They usually recommend solid companies with lots of future growth it’s up to you to figure out what a good entry point is.  Long term 3-5 years like they suggest maybe that’s not that important either.  \n\nI’m trying to think about some of the companies I’ve looked into since I joined.  Shopify, Nvidia, Crowdstrike, Tesla, Amazon, Disney (before the Disney plus numbers hit) Taiwan semi conductor (before the chip shortage) Blizzard, Bandwidth, there were a lot more but these were the ones I either researched or bought shares of and during that time most of these beat any of the indexes\n\nPS. Most of their picks are well known on Reddit already",
        "created_utc": 1619893142,
        "id": "gwkhj6f",
        "permalink": "/r/stocks/comments/n2hzd3/i_analyzed_all_the_motley_fool_premium/gwkhj6f/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619921942.0
    },
    {
        "author": "Stock-Info-Bot",
        "body": "\nHello, I am a bot that pulls stock information and posts some data about the company. Look at the information below and hopefully, this will  help you out.\n\n\n\n\n**Company Name**: Amazon.com, Inc.\n\n\n\n\n\n**Company Website**:  http://www.amazon.com\n\n\n\n\n\n\n**Summary of Company**: Amazon.com, Inc. engages in the retail sale of consumer products and subscriptions in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It sells merchandise and content purchased for resale from third-party sellers through physical and online stores. The company also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Rings, and Echo and other devices; provides Kindle Direct Publishing, an online service that allows independent authors and publishers to make their books available in the Kindle Store; and develops and produces media content. In addition, it offers programs that enable sellers to sell their products on its websites, as well as its stores; and programs that allow authors, musicians, filmmakers, skill and app developers, and others to publish and sell content. Further, the company provides compute, storage, database, analytics, machine learning, and other services, as well as fulfillment, advertising, publishing, and digital content subscriptions. Additionally, it offers Amazon Prime, a membership program, which provides free shipping of various items; access to streaming of movies and TV episodes; and other services. The company serves consumers, sellers, developers, enterprises, and content creators. Amazon.com, Inc. was founded in 1994 and is headquartered in Seattle, Washington.\n\n\n\n\n**Approximate Stock Price**: $3466.0\n\n\n\n\n\n**Shares owned by institution by percentage**: 0.59%\n\n\n\n\n\n**Peg Ratio**: 1.86\n\n\n\n\n\n\n\n**Short Ratio**: 1.79\n\n\n\n\n\n\n**Stock Prices Fifty Day Average**: $3244.46\n\n\n\n\n\n\n**Short Interest**: 1,618,444,800\n\n\n\n\n\n\n**Profit Margins**: 0.06419\n\n\n\n\n\n\n\n\nShare Holders|Shares Owned|Value of Shares\n:--|:--|:--\nVanguard Group, Inc. (The)|32,435,650|$105,640,641,554\nBlackrock Inc.|27,524,749|$89,646,180,760\nState Street Corporation|15,954,486|$51,962,644,087\nPrice (T.Rowe) Associates Inc|15,635,541|$50,923,862,549\nFMR, LLC|15,472,297|$50,392,188,268\nGeode Capital Management, LLC|6,460,626|$21,041,806,638\nMorgan Stanley|6,252,720|$20,364,671,349\nNorthern Trust Corporation|4,913,827|$16,003,990,571\nNorges Bank Investment Management|4,567,893|$14,877,307,748\nBank Of New York Mellon Corporation|3,983,095|$12,972,661,598\n\n\n\n\n\n\n\nPercentage of Shares|Description of Each Percentage\n:--|:--|:--\n14.07%|% of Shares Held by All Insider\n58.92%|% of Shares Held by Institutions\n68.57%|% of Float Held by Institutions\n4818|Number of Institutions Holding Shares\n\n\n\n\n\n\n\nMutual Fund Holders|Number of Shares Held|Date Reported|Value of Shares\n:--|:--|:--|:--\nVanguard Total Stock Market Index Fund|12,019,851|2020-12-30 00:00:00|39,147,813,317\nVanguard 500 Index Fund|8,545,889|2020-12-30 00:00:00|27,833,362,260\nSPDR S&amp;P 500 ETF Trust|4,439,823|2021-03-30 00:00:00|13,737,167,547\nInvesco ETF Tr-Invesco QQQ Tr, Series 1 ETF|4,174,859|2021-03-30 00:00:00|12,917,347,734\nFidelity 500 Index Fund|3,862,206|2021-02-27 00:00:00|11,945,532,803\nFidelity Contrafund Inc|3,646,762|2021-02-27 00:00:00|11,279,179,592\nGrowth Fund Of America Inc|3,595,350|2021-03-30 00:00:00|11,124,300,528\nVanguard Institutional Index Fund-Institutional Index Fund|3,507,354|2020-12-30 00:00:00|11,423,206,463\nVanguard Growth Index Fund|3,382,310|2020-12-30 00:00:00|11,015,946,908\niShares Core S&amp;P 500 ETF|3,329,848|2021-03-30 00:00:00|10,302,816,099\n\n\n\n\n\n\n\n**Links About Amazon.com, Inc.**:\n\n\n\n\n\n\n**Yahoo Financial News**\n\nhttps://finance.yahoo.com/news/buffett-shares-lessons-for-new-retail-investors-190611968.html?.tsrc=rss \n\n\nhttps://finance.yahoo.com/m/49bc1aca-0a02-307b-8fec-a3932ae4bb6b/these-3-ipo-stocks-are.html?.tsrc=rss \n\n\nhttps://finance.yahoo.com/m/2a943705-60d5-38b1-be70-affd4c1c6dcf/got-%2410%2C000-and-10-years-to.html?.tsrc=rss \n\n\nhttps://finance.yahoo.com/m/5240fe41-bedf-31be-8cf0-cf4124d00ef8/why-amazon-is-still-planning.html?.tsrc=rss \n\n\nhttps://finance.yahoo.com/m/9d3fb52a-f2d0-31f8-a4d8-d6682f3b0837/these-3-under-the-radar.html?.tsrc=rss \n\n\nhttps://finance.yahoo.com/m/970fbebd-537a-3c48-8273-d8f122a3597f/a-big-quarter-from-betterhelp.html?.tsrc=rss \n\n\nhttps://finance.yahoo.com/m/8e01f0a0-9c5b-3ba2-b3f9-99d90bdc4aa5/nvidia-is-not-just-a-graphics.html?.tsrc=rss \n\n\n\n\n\n\n**Reddit Threads**\n\nhttps://www.reddit.com/r/amzn/comments/mk392g/join_if_you_need_stock_help/ \n\n\nhttps://www.reddit.com/r/amzn/comments/misyee/amazon_stock_price_silly_cheap/ \n\n\nhttps://www.reddit.com/r/amzn/comments/93etby/the_cimple_co_component_and_composite_video_audio/ \n\n\nhttps://www.reddit.com/r/amzn/comments/93emr2/glolux_75_watt_equivalent_led_light_bulb_1100/ \n\n\nhttps://www.reddit.com/r/amzn/comments/6isfud/amazons_acquisition_of_wholefoods_a_game_changer/ \n\n\nhttps://www.reddit.com/r/amzn/comments/51ewjj/dark_ages_engraved_volume_1_life_poetry_collection/ \n\n\nhttps://www.reddit.com/r/amzn/comments/3zvo91/here_is_the_simple_reason_to_be_bullish_on_amazon/ \n\n\n\n\n\n\n\n^Note: ^I ^am ^just ^giving ^finacial ^information. ^If ^you ^want ^to ^request ^information, ^please ^type ^! ^before ^the ^ticker ^symbol ^such ^as ^!GME",
        "created_utc": 1619906790,
        "id": "gwldc6j",
        "permalink": "/r/investing/comments/n2o4zl/amzn_q1_earnings_eps_1579_vs_954/gwldc6j/",
        "score": 5,
        "subreddit": "investing",
        "created": 1619935590.0
    },
    {
        "author": "drmcbrayer",
        "body": "Cmon NVDA give me a quick recovery to $615",
        "created_utc": 1619912408,
        "id": "gwlo97j",
        "permalink": "/r/wallstreetbets/comments/n222v3/weekend_discussion_thread_for_the_weekend_of/gwlo97j/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1619941208.0
    },
    {
        "author": "maxkingusa",
        "body": "Oil bailed me out today. My semis sucked wind.  This raping of AMD is unacceptable and it has leaked over to NVDA.",
        "created_utc": 1620073791,
        "id": "gwtqo5l",
        "permalink": "/r/wallstreetbets/comments/n45qyv/what_are_your_moves_tomorrow_may_04_2021/gwtqo5l/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620102591.0
    },
    {
        "author": "santielliott",
        "body": "They have GPUs. The Radeon cards. They're used in Macs. I'm not a fan. They're ok for budget gaming, but for any creative application NVDA is much more optimized. Cuda cores, AI denoising, direct transcoding, etc. They're also just less glitchy in general. That's why NVDA dominates the space. Just no real competition.",
        "created_utc": 1620097912,
        "id": "gwv58ot",
        "permalink": "/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/gwv58ot/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1620126712.0
    },
    {
        "author": "verdantskies",
        "body": "Hi. Just started to allocate/test a few funds and stocks here and there this year. Thoughts/reccs appreciated:\n\nVTI - 9K\n\nVUG - 6K\n\nVNQ - 2K\n\nVHT - 2K\n\nVXUS - 1K\n\nARKK - 1k\n\n\n20K mixing a few of everything - AAPL DIS MSF SQ ADBE COIN PINS AMD SKLZ NVDA NFLX NIO JD BABA DKNG ABBV NVTA",
        "created_utc": 1620068110,
        "id": "gwtdkne",
        "permalink": "/r/stocks/comments/lv5dlb/rate_my_portfolio_rstocks_quarterly_thread_march/gwtdkne/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1620096910.0
    },
    {
        "author": "midlifedisaster",
        "body": "I was chatting with my brother who understands all of this. I know how to buy and hold and that's about it. I told him that I just found out that nvda has been paying me dividends all this time. Oh boy he got angry about dividends!  Telling me about how dividends reduce the value of the stock and such. I told him that I bought nvda at $180 and have all of my dividends as cash in my account.  I had never noticed if the dividends affected the price on those dates.",
        "created_utc": 1619898691,
        "id": "gwkty86",
        "permalink": "/r/stocks/comments/n2ok5c/i_dont_understand_how_dividends_affect_a_stock/gwkty86/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1619927491.0
    },
    {
        "author": "RobotArtichoke",
        "body": "I was sad about INTC until I saw AMD and NVDA. Yikes.",
        "created_utc": 1620063341,
        "id": "gwt23ms",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwt23ms/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620092141.0
    },
    {
        "author": "TblackUman",
        "body": "I’ll admit ignorance to JYNT\n\nBut AMD &amp; Nvidia aren’t exactly in the same market sector of GME my guy but I’m still taking note lmao \n\nI agree that they are good companies too, I have small positions in the latter two myself but I’m pretty sure we will both see more growth in GME than in those three over the next few years",
        "created_utc": 1620048335,
        "id": "gws3kj7",
        "permalink": "/r/stocks/comments/n3uk2j/gamestop_completes_voluntary_early_redemption_of/gws3kj7/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1620077135.0
    },
    {
        "author": "Captain_Yolo_",
        "body": "Everyone talks about what a great company and value AMD is and  all of the excellent management.........meanwhile you have NVDA just fucking bulldozing through new ATHs this whole month......with a fucking dividend to boot.",
        "created_utc": 1619887717,
        "id": "gwk4ira",
        "permalink": "/r/wallstreetbets/comments/n222v3/weekend_discussion_thread_for_the_weekend_of/gwk4ira/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1619916517.0
    },
    {
        "author": "Dry_Pie2465",
        "body": "NVDA up 14% YTD. Maybe you just picked the wrong horse?",
        "created_utc": 1620075893,
        "id": "gwtvh4k",
        "permalink": "/r/wallstreetbets/comments/n415tn/apes_like_chips_116k_joining_udarkfiber_in_amd/gwtvh4k/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620104693.0
    },
    {
        "author": "bigoldebutthole",
        "body": "At least when you lose 30k on NVDA puts you’ll be so fucked that you’re no longer a virgin.",
        "created_utc": 1620088081,
        "id": "gwullxz",
        "permalink": "/r/wallstreetbets/comments/n45qyv/what_are_your_moves_tomorrow_may_04_2021/gwullxz/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620116881.0
    },
    {
        "author": "Staygangponyboy",
        "body": "If NVDA doesn't bounce off this floor of 595-6 we going to 550 quick.",
        "created_utc": 1620056060,
        "id": "gwsksx7",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwsksx7/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620084860.0
    },
    {
        "author": "Pastatube",
        "body": "NVDA to $705 plz 🚀🚀🚀",
        "created_utc": 1620014528,
        "id": "gwqu4go",
        "permalink": "/r/wallstreetbets/comments/n3ekxx/what_are_your_moves_tomorrow_may_03_2021/gwqu4go/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620043328.0
    },
    {
        "author": "frostedbutts_",
        "body": "with respect to their robotics and AI research it's probably not retarded to buy NVDA in general",
        "created_utc": 1620017662,
        "id": "gwqylrj",
        "permalink": "/r/wallstreetbets/comments/n3ekxx/what_are_your_moves_tomorrow_may_03_2021/gwqylrj/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620046462.0
    },
    {
        "author": "yeti_man82",
        "body": "Maybe DE, NVDA, MSFT, SQ, and PYPL.",
        "created_utc": 1619994790,
        "id": "gwpux6q",
        "permalink": "/r/stocks/comments/n1qa65/rstocks_daily_discussion_fundamentals_friday_apr/gwpux6q/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620023590.0
    },
    {
        "author": "Dry_Pie2465",
        "body": "NVDA is the long play",
        "created_utc": 1620074523,
        "id": "gwtsbse",
        "permalink": "/r/wallstreetbets/comments/n45xj8/why_you_should_short_the_intel_fab_play/gwtsbse/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620103323.0
    },
    {
        "author": "I_like_to_build",
        "body": "Can we just stop this quarters earnings and consider it done until next quarter.  I've bottom for enough massive cocks this quarter, and I'm like good for another three months.\n\nMy shit that crushes earnings... sells off and shits...  shit that shits earnings... sells off and shits...\n\nAt this point I'm I've got enough cash set aside I'd just like the whole market to correct so I can get back into AMAT, LRCX, NVDA, ASML with calls...\n\nWell everything except for VIAC, NHCL, and CCL... need those to stay up until October.  Also not sure AMD or INTC can dump anymore, hopefully they are already back to damn near actual fucking value... but then again I don't really do those numbers and shit because I'm a fucking degenerate gambler.",
        "created_utc": 1619884134,
        "id": "gwjvz2h",
        "permalink": "/r/wallstreetbets/comments/n2gwwf/most_anticipated_earnings_releases_for_the_week/gwjvz2h/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619912934.0
    },
    {
        "author": "RssnGopnik",
        "body": "Stick to what you know. PayPal, Cisco, T-Mobile, visa, master card, Apple, amd, Intel, nvidia",
        "created_utc": 1620097858,
        "id": "gwv553v",
        "permalink": "/r/options/comments/n4cxfn/helping_out_everyone_free/gwv553v/",
        "score": 3,
        "subreddit": "options",
        "created": 1620126658.0
    },
    {
        "author": "ShittyStockPicker",
        "body": "Quite possibly Nvidia",
        "created_utc": 1620097840,
        "id": "gwv53z8",
        "permalink": "/r/ValueInvesting/comments/n4cbe0/why_value_investing_is_not_dead/gwv53z8/",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1620126640.0
    },
    {
        "author": "Mookypooks",
        "body": "I just bought NVDA Instead",
        "created_utc": 1620049664,
        "id": "gws6h1f",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gws6h1f/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620078464.0
    },
    {
        "author": "thegovatwork",
        "body": "Yeah same happened with TSLA. Nailed earnings and tanked. It doesn't make me nervous. I think people expect these companies to do so well that when they do just well, it's just not enough, and they get out, plus there's a bunch of FUD out there, and it's easy to tank a stock by spreading it. But AMD is an outlier IMO. They've proven to do very well over the years, and they've become a huge player. Intel is in big trouble with Apple M1, and AMD has always been in between Intel and NVIDIA. In a few years we'll see the same shift from NVIDIA to AMD that we saw from Intel to AMD. It's a matter of time. Chips is a good market, these companies can adapt to the market and adapt over time.",
        "created_utc": 1620065286,
        "id": "gwt6tte",
        "permalink": "/r/wallstreetbets/comments/n415tn/apes_like_chips_116k_joining_udarkfiber_in_amd/gwt6tte/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620094086.0
    },
    {
        "author": "_name_unavailable",
        "body": "Semiconductor shortage, asia geopolitical volatility, competition with INTC and NVDA",
        "created_utc": 1620050814,
        "id": "gws8y9j",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gws8y9j/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620079614.0
    },
    {
        "author": "thenudedentist",
        "body": "I see AMD revenue at 9.7b for 2020 and NVDA at 10.7b for 2020 (according to wikipedia for both) which leads me back to my original question of why they are worth so much more?\n\nEdit: Correction, 10.9 b for NVDA but still not a big difference.  Your point about the future roadmap for growth does make a lot of sense.",
        "created_utc": 1620096698,
        "id": "gwv2zn6",
        "permalink": "/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/gwv2zn6/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620125498.0
    },
    {
        "author": "BuffaloFortress",
        "body": "I like pypl, sq, tdoc, amd, nvda, tsm, fcx, slv, gld, bhp, rio, vale, xle, cvx, xom, vlo",
        "created_utc": 1620047621,
        "id": "gws239p",
        "permalink": "/r/options/comments/n3uu4y/looking_for_good_cashsecured_puts/gws239p/",
        "score": 3,
        "subreddit": "options",
        "created": 1620076421.0
    },
    {
        "author": "ScroogeMcThrowaway",
        "body": "AMD killing me everyday. If it gave a small div like NVDA, might be a little more tolerable.",
        "created_utc": 1620086126,
        "id": "gwuhjrr",
        "permalink": "/r/wallstreetbets/comments/n45qyv/what_are_your_moves_tomorrow_may_04_2021/gwuhjrr/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620114926.0
    },
    {
        "author": "daynightcase",
        "body": "total 110% in 7 years. Most of my portfolio is in FAAMG. Even that is low lol i initially swing traded Amazon and Nvidia. So missed few run ups, for example i had few amazon at $630, sold at $900 and then it jumped to $1600 too fast right after I sold and couldn't catch. So jumped back at $1900. Same thing happened with Nvdia. Missed $300-$500 run up. Anyways NEVER ever sell if you believe in the company",
        "created_utc": 1619966768,
        "id": "gwo0yde",
        "permalink": "/r/investing/comments/n34we7/whats_your_average_return/gwo0yde/",
        "score": 3,
        "subreddit": "investing",
        "created": 1619995568.0
    },
    {
        "author": "Themailhag",
        "body": "Undervalued if their products are in high demand which depends on if they can push products that compete or beat others at or below others costs.  With Nvidia building cpus now, if those become the go to processor that could make intel pointless to a computer builder.  Intel was high end and amd was budget/value who became go to.  With intel trying to make gpus its almost looks like a lameduck attempt.  Their gpus basically have to be highly successful or they just blew alot of money on nothing while losing alot of cpu sales.  If nvidias cpus fail nobody will even blink",
        "created_utc": 1619928887,
        "id": "gwmgisc",
        "permalink": "/r/wallstreetbets/comments/n222v3/weekend_discussion_thread_for_the_weekend_of/gwmgisc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619957687.0
    },
    {
        "author": "xRegretNothing",
        "body": "This whole dd is a clusterfuck. Paragraph 4 even says nvidia is building a fab (???) LOL",
        "created_utc": 1619921914,
        "id": "gwm58o0",
        "permalink": "/r/wallstreetbets/comments/n2ojmq/cohu_the_plug_for_your_favorite_semiconductor/gwm58o0/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619950714.0
    },
    {
        "author": "lowrankcluster",
        "body": "Nvidia has gpu monopoly. Their profits are way higher than amd, for whom main revenue is still cpu.",
        "created_utc": 1620097018,
        "id": "gwv3laz",
        "permalink": "/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/gwv3laz/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620125818.0
    },
    {
        "author": "Jewish_Overlord",
        "body": "I bought an AMD GPU because for the same performance level as Nvidia it was $100 cheaper.",
        "created_utc": 1619911822,
        "id": "gwln68m",
        "permalink": "/r/wallstreetbets/comments/n222v3/weekend_discussion_thread_for_the_weekend_of/gwln68m/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619940622.0
    },
    {
        "author": "BMG_Burn",
        "body": "Nvidia opening their own fab?",
        "created_utc": 1619960193,
        "id": "gwnnfqs",
        "permalink": "/r/wallstreetbets/comments/n2ojmq/cohu_the_plug_for_your_favorite_semiconductor/gwnnfqs/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619988993.0
    },
    {
        "author": "Marshcatguy3",
        "body": "Buy NVDA and AMD over Intel",
        "created_utc": 1619968462,
        "id": "gwo4zzl",
        "permalink": "/r/stocks/comments/lv5dlb/rate_my_portfolio_rstocks_quarterly_thread_march/gwo4zzl/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619997262.0
    },
    {
        "author": "Staygangponyboy",
        "body": "NVDA  gonna fly",
        "created_utc": 1620054530,
        "id": "gwsh53z",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwsh53z/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620083330.0
    },
    {
        "author": "Summebride",
        "body": "As you've pointed out, for some stocks, the dividend is inconsequential.  People don't even think of their NVDA dividend since the daily swings are much larger anyway.  For some, especially the monthly payers, the dividend is everything, and you can basically see the share price move by around 1/30th every day.",
        "created_utc": 1619908672,
        "id": "gwlhcat",
        "permalink": "/r/stocks/comments/n2ok5c/i_dont_understand_how_dividends_affect_a_stock/gwlhcat/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619937472.0
    },
    {
        "author": "santielliott",
        "body": "Exactly. NVDA doesn’t really have any one to compete with on GPU because they’re the best. Just straight out. AMD still competing in the chip space with INTC and now AAPL with the arm chips",
        "created_utc": 1620097199,
        "id": "gwv3xhi",
        "permalink": "/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/gwv3xhi/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620125999.0
    },
    {
        "author": "thenudedentist",
        "body": "Are those the quarterly numbers? Looking at 2020 their net incomes are nearly the same, 2.5 for AMD vs 2.8 for NVDA.\n\nEdit: I see they are the quarterly ones. Thanks!",
        "created_utc": 1620096998,
        "id": "gwv3jxi",
        "permalink": "/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd/gwv3jxi/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620125798.0
    },
    {
        "author": "RegretTMRW",
        "body": "NVDA at 590 is a no brainer, right?",
        "created_utc": 1620062867,
        "id": "gwt0ymn",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwt0ymn/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620091667.0
    },
    {
        "author": "Dry_Pie2465",
        "body": "If earnings are so good why is NVDA up 14% ytd while AMD is up 15% ytd?",
        "created_utc": 1620075765,
        "id": "gwtv6ov",
        "permalink": "/r/wallstreetbets/comments/n415tn/apes_like_chips_116k_joining_udarkfiber_in_amd/gwtv6ov/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620104565.0
    },
    {
        "author": "TheIcebox1",
        "body": "1000%. 60 minutes ran a story on Intel yesterday, even covering how their tech is lagging behind around 60% and how the company is trying to “close the gap” within the next 3 years. They failed to state that 3 years from now, every other chip company will be up even more with their own advancements, pushing intel even further behind! I’m in the video editing space &amp; if you aren’t rocking with NVIDIA, you are all in on AMD. I feel like if we get some good news within the coming months (maybe car/ chip partnership, biden bill expanding chip production leading to new consoles coming out in bulk, etc.) AMD will finally make it to a proper valuation. I feel like the big wigs are covering their shorts right now hoping a majority sell off because of the downward trend, priming it for a pop. But then again, i’m just a chimp lmao 💎",
        "created_utc": 1620077943,
        "id": "gwu03rx",
        "permalink": "/r/wallstreetbets/comments/n415tn/apes_like_chips_116k_joining_udarkfiber_in_amd/gwu03rx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620106743.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "Adbe, nvda, amd, Goog, msft, ibm, pubm",
        "created_utc": 1620049499,
        "id": "gws63oz",
        "permalink": "/r/stocks/comments/n3vyl6/stock_for_asianamerican_heritage_month/gws63oz/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620078299.0
    },
    {
        "author": "ChuckMayr",
        "body": "Microsoft = safe play, I consider that to be similar in performance and risk to an ETF, no mooning, but also no bankruptcy\n\nGoogle = not sure how much more they can charge for ads, and how many more there can be on YT videos before people just gtfo\n\nAmazon = most undervalued imo, their growth is insane, here in EU there is no alternative. but they should diversify faster into grocery shopping and stuff like that, that's where competition is coming in right now.\n\nApple = my biggest position, they have all the cash to diversify into new fields and the brand helps to push sales on even very unremarkable products (Airpods Max)\n\nFacebook = can't justify investing in them right now, even though that's probably not very wise\n\nNetflix = no go for me, just like with Spotify, the business model has no moat and all the big players are just copying them right now but have billions and billions more to spend - they are gonna lose longterm to DIS, AMZN, AAPL\n\n&amp;#x200B;\n\nI hold all except FB and N.   \nI expect DIS, AMD and NVDA to be referred to as similar cash cows as FAANG soon.",
        "created_utc": 1619956437,
        "id": "gwngg4o",
        "permalink": "/r/stocks/comments/n2we74/which_faamg_stocks_do_you_think_have_the_most/gwngg4o/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619985237.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I have UNH HD MSFT AAPL NVDA ASML TSM LRCX CRWD SQ PYPL HON UNP... To name a few.  I try to stay around 20 stocks and under 5% in each.  My AAPL and MSFT are overweight though.  Together they're 20% of portfolio.",
        "created_utc": 1619895020,
        "id": "gwklw1o",
        "permalink": "/r/stocks/comments/n1umgf/i_started_investing_in_february/gwklw1o/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619923820.0
    },
    {
        "author": "rynithon",
        "body": "I take out at 5% to 200% so really it’s up to you. I also own Nvidia and it’s sitting at 300% return, I’m not selling that for at least 10 years for example.\n\nI just ask myself, do I feel this will continue going up based on x, y and z info and my overall opinion on a company or investment. In a bull market it’s hard because most the time just leaving it sitting will gain more. However, in the same time doing swing trades 5-15% makes more over a year so those ones are great.\n\nAlso, I wish I learned this before but short term tax rate is the same as ordinary income tax based on what you make. I was all afraid to short term trade, fearing a tax bill but it doesn’t freaking matter. Just pay your dues and move on. I treat it as a job so thus taxed like one. If I got a few million a year in income then I’ll care.",
        "created_utc": 1620019886,
        "id": "gwr1he7",
        "permalink": "/r/RobinHood/comments/n3m2d0/when_do_you_take_out_profits/gwr1he7/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1620048686.0
    },
    {
        "author": "beepitybop400",
        "body": "i bought a ton of 7/16, $80C on AMD near market close today. Since July 2020 it doesn't seem like the stock drops much lower than this. Good earnings, long period of stagnation. But on the flip side Nvidia is a direct competitor, tech is flip-floppy, and there's semiconductor shortages 🤷",
        "created_utc": 1620083288,
        "id": "gwubl71",
        "permalink": "/r/wallstreetbets/comments/n45qyv/what_are_your_moves_tomorrow_may_04_2021/gwubl71/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620112088.0
    },
    {
        "author": "Lalamann",
        "body": "Has the nVidia buying arm deal already been done? I thought that was still pending/not final yet.",
        "created_utc": 1620078598,
        "id": "gwu1kd7",
        "permalink": "/r/wallstreetbets/comments/n45xj8/why_you_should_short_the_intel_fab_play/gwu1kd7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620107398.0
    },
    {
        "author": "kkInkr",
        "body": "SMH, ADI, AMAT, ASML, ATEYY, AVGO, HIMX, INTT,  KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI,  PXLW, QCOM, QRVO, SIMO, SWKS, TER,\n\nbesides the usual AMD, INTC, NVDA, and TSM. Those 4 imo are outdated.  SMH is the ETF.\n\nCircuitry, CDNS, SNPS, ANSS, they are being ignored, but have dominant roles, imo.",
        "created_utc": 1619900068,
        "id": "gwkwyeo",
        "permalink": "/r/stocks/comments/n2705g/best_sector_for_the_next_5_years/gwkwyeo/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619928868.0
    },
    {
        "author": "AccountantOk111",
        "body": "I swear one step forward two steps back for semiconductor stocks I will still stay long on nvidia and others I own but annoying I mean look at amd blow out quarter and it's crushed",
        "created_utc": 1620075335,
        "id": "gwtu6tc",
        "permalink": "/r/wallstreetbets/comments/n45qyv/what_are_your_moves_tomorrow_may_04_2021/gwtu6tc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620104135.0
    },
    {
        "author": "thegovatwork",
        "body": "I know, right ? Even if this resets a bit further, I honestly the potential of the company is much greater than it currently is. Wait until the graphics card market takes on AMD and leaves NVIDIA behind just as they did with the CPU market. Apple M1 also changed the game, Intel is in big trouble. Anyhow, thank you for your service. I'm not experienced with options so I prefer shares, but either way, we're riding this together.",
        "created_utc": 1620077640,
        "id": "gwtzfe4",
        "permalink": "/r/wallstreetbets/comments/n415tn/apes_like_chips_116k_joining_udarkfiber_in_amd/gwtzfe4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620106440.0
    },
    {
        "author": "bagtf3",
        "body": "Amazon Google and nvda got a head start",
        "created_utc": 1620083489,
        "id": "gwuc0c7",
        "permalink": "/r/wallstreetbets/comments/n45qyv/what_are_your_moves_tomorrow_may_04_2021/gwuc0c7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620112289.0
    },
    {
        "author": "enkidy",
        "body": "🔥💥 KATIE WOOD &amp; ARKINVEST TRADING FOR APRIL 30, 2021\n\n ❇️ PURCHASED:\n $ TWTR\n $ TDOC\n $ DDD\n\n ❌ SOLD OUT:\n $ PCAR\n $ NVDA\n $ PYPL\n $ Z\n $ TREE",
        "created_utc": 1619882700,
        "id": "gwjslkk",
        "permalink": "/r/wallstreetbets/comments/n1zl10/time_to_delete_my_twitter_account/gwjslkk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619911500.0
    },
    {
        "author": "Eliran1991",
        "body": "By whom? Microsoft? Nvidia? Google? Apple? Ford? General Motors? More fake big names? all debunked.  \n\n\nI don't think you truly believe that yourself by now.",
        "created_utc": 1619872482,
        "id": "gwj92u1",
        "permalink": "/r/wallstreetbets/comments/n1uiek/mvis_is_bargain_of_the_century_right_now/gwj92u1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619901282.0
    },
    {
        "author": "som3crazydud3",
        "body": "Thanks for sharing.  I need an nvidia bounce badly, and if the ancients are saying it's so,  I'll take it!",
        "created_utc": 1620012642,
        "id": "gwqr7e4",
        "permalink": "/r/options/comments/n3hl1a/nvda_shortterm_bull_thesis_formulated/gwqr7e4/",
        "score": 1,
        "subreddit": "options",
        "created": 1620041442.0
    },
    {
        "author": "cscrignaro",
        "body": "Im confused. You're saying you want them to or are hoping they get into the microchip business and compete with apple, Nvidia, amd, Intel, and Tesla?",
        "created_utc": 1619917937,
        "id": "gwly9hp",
        "permalink": "/r/wallstreetbets/comments/n2gwwf/most_anticipated_earnings_releases_for_the_week/gwly9hp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619946737.0
    },
    {
        "author": "discovery999",
        "body": "Those stocks aren’t bad options. I own all of them except NVDA which I wish I never sold. I would at least spread things over 10 stocks and monitor their earnings every quarter since things can change. Adding stocks like HD, GOOGL, FB, COST, MA, V and SCHD will diversify yourself better and still manage to beat the S&amp;P 500.",
        "created_utc": 1620088645,
        "id": "gwumrbj",
        "permalink": "/r/wallstreetbets/comments/n4bkzx/is_this_investing_strategy_crazy_for_retirement/gwumrbj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620117445.0
    },
    {
        "author": "JimmieBain",
        "body": "I'm still trying to figure out if $NVDA is good at these prices. They seem to be executing extremely well but they're still expensive at the moment IMO. What is your take on this?",
        "created_utc": 1620039102,
        "id": "gwrnlwu",
        "permalink": "/r/StockMarket/comments/n3hjwl/nvda_shortterm_bull_thesis_formulated/gwrnlwu/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1620067902.0
    },
    {
        "author": "Staygangponyboy",
        "body": "NVDA is fucking me up bro",
        "created_utc": 1620055514,
        "id": "gwsjhke",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwsjhke/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620084314.0
    },
    {
        "author": "thegovatwork",
        "body": "Right on. AMD hasn't been hype for graphics cards, But the Intel NVIDIA combo is behind now, all in AMD is the way. Oh, and I'm an ape too, I just like the stock. We need some memes on AMD, that will help.",
        "created_utc": 1620078310,
        "id": "gwu0x4c",
        "permalink": "/r/wallstreetbets/comments/n415tn/apes_like_chips_116k_joining_udarkfiber_in_amd/gwu0x4c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620107110.0
    },
    {
        "author": "Ok-Reporter-4600",
        "body": "If you look and see red across a number of tickers:\n\nFngl, tsla, goog, msft, amzn, RKT, rblx, pltr, arka-z, moon, shop, snow, roku, crsr, twtr, intc, fb, f, sfix, nvda, sony, fsly crwd, ter, ddog, lulu, blink, spot, amd, work, dal, luv, ulta, mvis, spce, riot, mogo, jynt, on, mchp, gddy, all the meme stocks, all the weed stocks, ...\n\nYou might be excused for thinking the market is down.",
        "created_utc": 1620060783,
        "id": "gwsw0sl",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwsw0sl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620089583.0
    },
    {
        "author": "Staygangponyboy",
        "body": "yea this is gonna catapult soon, NVDA earnings coming up, think people.",
        "created_utc": 1620048356,
        "id": "gws3m2k",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gws3m2k/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620077156.0
    },
    {
        "author": "Aesir81",
        "body": "So puts on NVDA.  Got it.",
        "created_utc": 1620047855,
        "id": "gws2kgj",
        "permalink": "/r/options/comments/n3hl1a/nvda_shortterm_bull_thesis_formulated/gws2kgj/",
        "score": 1,
        "subreddit": "options",
        "created": 1620076655.0
    },
    {
        "author": "winteroffice74",
        "body": "Nvidia might be near an evergreen stock.\n\nhttps://news.stocktradersdaily.com/news_release/90/Nvidia+NVDA+Technical+Update_050221082909.html",
        "created_utc": 1619958694,
        "id": "gwnklgt",
        "permalink": "/r/stocks/comments/n353j6/dont_worry_about_nasdaq_keep_buying_it_will_be/gwnklgt/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619987494.0
    },
    {
        "author": "harrison_wintergreen",
        "body": "FZROX. Zero fees and total market exposure. in a taxable brokerage there can be some advantages to ETFs, so VTI might be good too. \n\n\nQQQ is not terrible but it's highly volatile, and misses out on other good sectors (no small cap, no healthcare, etc). the best performing stocks of the last 20 years are not always high tech/trendy. Monster Beverage and Tractor Supply have outperformed almost everything else, including Amazon/Apple/Tesla/Nvidia, etc. if you want to keep QQQ I'd balance it out with something else that's not super-focused by sector/industry.",
        "created_utc": 1619887660,
        "id": "gwk4dun",
        "permalink": "/r/stocks/comments/n21r5c/fund_for_child_to_leave_and_let_grow/gwk4dun/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619916460.0
    },
    {
        "author": "digitalwriternow",
        "body": "Nvidia is awesome",
        "created_utc": 1619891981,
        "id": "gwkesrd",
        "permalink": "/r/stocks/comments/lv5dlb/rate_my_portfolio_rstocks_quarterly_thread_march/gwkesrd/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619920781.0
    },
    {
        "author": "RD1227",
        "body": "NVDA tard",
        "created_utc": 1619912031,
        "id": "gwlnk3y",
        "permalink": "/r/wallstreetbets/comments/n22wgb/thanks_guys_i_closed_the_position_and_locked_in/gwlnk3y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619940831.0
    },
    {
        "author": "SatriaDigja",
        "body": "I wonder how much AWS contribution to AMZN valuation or market caps. Sometimes, investors buy the stock due to specific segment performance. For instance, in The last 5 years before pandemics (2015 to June 2020), the NVIDIA data center segment revenue grew around 9 folds, and the market cap grows 10 times. Coincidence?\n\nSo people overlook another segment even it gives more contribution to revenue. Do right now investors too focused on AWS thus give more weight to this segment?",
        "created_utc": 1619921898,
        "id": "gwm57ox",
        "permalink": "/r/investing/comments/n2o4zl/amzn_q1_earnings_eps_1579_vs_954/gwm57ox/",
        "score": 1,
        "subreddit": "investing",
        "created": 1619950698.0
    },
    {
        "author": "Professional-Feed-57",
        "body": "I have 600 NVDA and 200 TSLA.  Have traded them many times",
        "created_utc": 1619966445,
        "id": "gwo079r",
        "permalink": "/r/pennystocks/comments/n2z9d2/can_anyone_relate_to_my_positions/gwo079r/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1619995245.0
    },
    {
        "author": "Defiant_Dickhead",
        "body": "NVDA &gt; AMD",
        "created_utc": 1620006127,
        "id": "gwqftsf",
        "permalink": "/r/wallstreetbets/comments/n0kaye/amd_this_is_why_its_down_after_earnings_but_will/gwqftsf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620034927.0
    },
    {
        "author": "Adlai8",
        "body": "Thinking nvda may 31 calls. U?",
        "created_utc": 1620070981,
        "id": "gwtk8zd",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwtk8zd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620099781.0
    },
    {
        "author": "SheaButterShea",
        "body": "SEC forms slightly behind MMED we all saw that 100%\n\n3,400 coins on hand over half earning 4% interest\n\nMining 7 coins a day at 8k cost (could sell each coin for 57k) almost 50k a coin profit per day x7\n\nASIC miners overpriced so to retain shareholder value, bought GPUs from nvidia and huge power agreement (more news to come)\n\nEarnings May 12, coin has jumped up in price since December last posted earnings record date.",
        "created_utc": 1619982108,
        "id": "gwp5ee6",
        "permalink": "/r/wallstreetbets/comments/n3d5v1/hut_8_mining_yolo/gwp5ee6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620010908.0
    },
    {
        "author": "littlefiredragon",
        "body": "Fund holdings used to be great, until her increased selling of profitable bigger growth companies like GOOG and NVDA to buy dips on TDOC and TWTR. Largely why her funds missed last month’s tech rally.\n\nAt this point, I don’t see it going up much; I don’t think speculative stocks will see much rallying soon since that money has gone to crypto. I have trimmed positions in most ARK funds except ARKF and shifted into VTI/VXUS and oil that should see less downside.",
        "created_utc": 1620092399,
        "id": "gwuuhv9",
        "permalink": "/r/stocks/comments/n3z7jl/thoughts_on_arkk/gwuuhv9/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620121199.0
    },
    {
        "author": "rotflolmaomgeez",
        "body": "Nvidia makes a bit better GPUs as of right now, but AMD is solid. I'm following GPU reviews and they're catching up quickly.",
        "created_utc": 1619915912,
        "id": "gwlunes",
        "permalink": "/r/wallstreetbets/comments/n1wpyo/doubled_down_on_amd/gwlunes/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619944712.0
    },
    {
        "author": "Touchbutt316",
        "body": "Did you buy the breakout? Are you scaling into your position? What is your stop loss? How are you planning to manage your position? Lots of semies have been breaking out, why do you prefer nvda over the others?",
        "created_utc": 1619995451,
        "id": "gwpw865",
        "permalink": "/r/StockMarket/comments/n3hjwl/nvda_shortterm_bull_thesis_formulated/gwpw865/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1620024251.0
    },
    {
        "author": "buckfuter",
        "body": "22yrs old currently have 73k invested ballparking a retirement at 50 so 28-30 year timeline\n\nTFSA @ 35k \n60% AMZN\n17%MSFT\n8%GOOGL\n8%NDVA\n4% AAPL\n\nNon-registered @ 13k \n50% VFV\n50%VEQT\n\nRRSP @ 25k\n100% VFV\n\nI've been wondering about dividend investing, if I should be looking to start building up positions towards a passive dividend income. I tried my hand at stock picking, albeit poorly so now my non registered and RRSP are index only as a personal rule. I dont have a huge knowledge on investing, just kind of picking blue chips and indexes, plus NVDA because of hype at work and I like computers lol. Any opinions on changes to my TFSA composition or any other changes I should look into?",
        "created_utc": 1620008403,
        "id": "gwqjykt",
        "permalink": "/r/CanadianInvestor/comments/n2fcv4/rate_my_portfolio_megathread_for_may_2021/gwqjykt/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1620037203.0
    },
    {
        "author": "wingchun777",
        "body": "AMD may be a good example? It's been doing well in recent years but price just couldn't get out of the doldrums, compared to how Nvidia has been doing.",
        "created_utc": 1619972768,
        "id": "gwog2zj",
        "permalink": "/r/stocks/comments/n39rxd/i_find_earnings_and_estimates_arent_always_moving/gwog2zj/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620001568.0
    },
    {
        "author": "justsomeitguyhere",
        "body": "You are not wrong, however, apple didn't really develop a new cpu. They bought a architectural license from ARM (technically: NVDA) and got a bunch of support to build this chip for a really nice fee. So Intel lost to ARM not to apple. A lot of ppl here forget it is not Intel vs AMD, it's 3 parties (all the other alternatives basically hibernate or have died)\n\nAlso, x86 was really nice for intel, but they had to buy AMD64 licences from AMD to get into the 64 bits market. Intel lived a very long time because of FUD.\n\nIntel has been in trouble since 2017, when it turned out their [https://en.wikipedia.org/wiki/Speculative\\_execution](https://en.wikipedia.org/wiki/Speculative_execution) was causing security issues. Even though AMD had \\~50% of the same problems (since they where part of the architecture) ARM had none.\n\nNot financial advice, quite obvious IT explaining here",
        "created_utc": 1620076914,
        "id": "gwtxsom",
        "permalink": "/r/wallstreetbets/comments/n45xj8/why_you_should_short_the_intel_fab_play/gwtxsom/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620105714.0
    },
    {
        "author": "Jamber_Jamber",
        "body": "On first point - why is NVDA up 20% on the month?\n\nOn second point, didn't INTC give worse earnings and guidance on report and took even a more massive dip?\nIt all doesn't make sense.",
        "created_utc": 1620051457,
        "id": "gwsabok",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwsabok/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620080257.0
    },
    {
        "author": "Dworgi",
        "body": "Superset implies that it contains all of C++ and then some, which is inaccurate. \n\nCUDA is a programming language for Nvidia GPUs with some shared syntax from C++. That makes it a mostly disjoint set from C++ feature-wise, and even syntactically CUDA has no support for templates, for example. CUDA is basically C for GPUs.\n\nGrats on the internship.",
        "created_utc": 1620058592,
        "id": "gwsqu0u",
        "permalink": "/r/wallstreetbets/comments/n3db4o/how_to_profit_from_runaway_inflation/gwsqu0u/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620087392.0
    },
    {
        "author": "why_ntp",
        "body": "I’d love a good NVDA DD. They outsource fab to TSMC but by the time that becomes an, er, “issue”, INTC might be able to fab for them onshore.",
        "created_utc": 1620080205,
        "id": "gwu516p",
        "permalink": "/r/wallstreetbets/comments/n45xj8/why_you_should_short_the_intel_fab_play/gwu516p/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620109005.0
    },
    {
        "author": "Radish-Perfect",
        "body": "Nope I was wrong about this. Tsmc is opening a new fab to serve primarily nvidia",
        "created_utc": 1619964876,
        "id": "gwnwl4s",
        "permalink": "/r/wallstreetbets/comments/n2ojmq/cohu_the_plug_for_your_favorite_semiconductor/gwnwl4s/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619993676.0
    },
    {
        "author": "Erland_Brynjar",
        "body": "So your advice is “buy two massively overlapped ETFs”. Why? hype concentrated, harder to rebalance, less diversification - how is this any different to holding VUN and VGG? \n\nDiversification is the only free lunch, if you insist on XQQ (which is worse than ZNQ and recency bias, but we’ll ignore that), why not VUN and XQQ so that at least you’re diversified across small and mid caps and less concentrated in the XQQ overlap?\n\nOf course my advice is VUN alone, but even if I bought your argument XQQ is worth having, XQQ and VFV is just buying the same ETF twice:\n\nVFV vs XQQ: \n\n- AAPL 5.6 + 11.0\n\n- MSFT 5.2 + 9.1\n\n- AMZN 3.9 + 8.6\n\n- FB 2.1 + 3.9\n\n- GOOG.A/B 3.5 + 7.4\n\n- TSLA 1.5 + 4.0\n\n- NVDA 1.0 + 2.8\n\n- PYPL 0.9 + 2.3\n\n- INTC 0.8 + 1.8\n\n- CMCSA 0.8 + 1.9\n\n- NFLX 0.7 + 1.7\n\n- ADBE 0.7 + 1.8\n\nSo is the goal to water down XQQ or concentrate VFV on the FAANG stocks? \n\nEither way I still don’t get why this is meant to outperform or is “better”; at least with VGG they’d tilt back to the diversification they’d have had just buying VUN.",
        "created_utc": 1619968791,
        "id": "gwo5usr",
        "permalink": "/r/CanadianInvestor/comments/n2fcv4/rate_my_portfolio_megathread_for_may_2021/gwo5usr/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1619997591.0
    },
    {
        "author": "pravbr",
        "body": "What I do is I do some basic valuations and calculate buy prices and put it on a google sheet. I compare it to current prices, if it's lower I buy.\nMy investments are amzn, msft, fb, baba, nvda, nflx, tsm, amd, jd etc. Most of these are overvalued now except a few. I bought them last year. \n\nI do think what you are saying is true, I am heavy tech stocks.",
        "created_utc": 1619943186,
        "id": "gwmxsxs",
        "permalink": "/r/ValueInvesting/comments/n0rdby/position_sizing_or_deciding_portfolio_weights/gwmxsxs/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1619971986.0
    },
    {
        "author": "Miserable-Fact-6668",
        "body": "her uncle is the CEO of NVDA, probably gets all the insider info on AMD to one up them",
        "created_utc": 1619904910,
        "id": "gwl8nop",
        "permalink": "/r/wallstreetbets/comments/n222v3/weekend_discussion_thread_for_the_weekend_of/gwl8nop/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619933710.0
    },
    {
        "author": "RobotArtichoke",
        "body": "INTC p/e 12.8 AMD p/e 33.2 NVDA p/e 85.9 \n\n🤔",
        "created_utc": 1620063709,
        "id": "gwt2zh1",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwt2zh1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620092509.0
    },
    {
        "author": "Master_Relative",
        "body": "And NVDA",
        "created_utc": 1620068635,
        "id": "gwtestw",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwtestw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620097435.0
    },
    {
        "author": "Pltr_x2-4_Tsla",
        "body": "We don’t know the problem, nvidia says high demand, people say they don’t make enough.\n\neBay scalpers make money, it doesn’t look good.\n\nEven Newegg ripping people off",
        "created_utc": 1620005568,
        "id": "gwqetit",
        "permalink": "/r/wallstreetbets/comments/n3ekxx/what_are_your_moves_tomorrow_may_03_2021/gwqetit/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620034368.0
    },
    {
        "author": "ArdascesIV",
        "body": "But it’s very interesting, are there any particular ETF’s that track that metric? I think I missed the FANG boat, also stupidly didn’t listen to a genius professors advice to go all in on Nvidia five years ago.  \n\nI noticed that most of IBD’s top 50 pin to do really well overtime, but for some reason their etf really sucks.",
        "created_utc": 1620082512,
        "id": "gwu9y35",
        "permalink": "/r/stocks/comments/n47ocm/best_alternative_to_sp_500_for_long_term_growth/gwu9y35/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620111312.0
    },
    {
        "author": "pman6",
        "body": "how come nvda didn't get hit as hard\n\nthey're gonna suffer from the same shortage.",
        "created_utc": 1620092646,
        "id": "gwuv07o",
        "permalink": "/r/stocks/comments/n3rz7z/rstocks_daily_discussion_monday_may_03_2021/gwuv07o/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620121446.0
    },
    {
        "author": "franco9494",
        "body": "NVDA literally just he bought now dump",
        "created_utc": 1620053096,
        "id": "gwsdwkd",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwsdwkd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620081896.0
    },
    {
        "author": "kkInkr",
        "body": "SMH, ADI, AMAT, ASML, ATEYY, AVGO, HIMX, INTT,  KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI,  PXLW, QCOM, QRVO, SIMO, SWKS, TER,\n\nbesides the usual AMD, INTC, NVDA, and TSM. Those 4 imo are outdated.  SMH is the ETF.\n\nCircuitry, CDNS, SNPS, ANSS, they are being ignored, but have dominant roles, imo.",
        "created_utc": 1619900068,
        "id": "gwkwyeo",
        "permalink": "/r/stocks/comments/n2705g/best_sector_for_the_next_5_years/gwkwyeo/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619928868.0
    }
]