[
    {
        "author": "FullAd5316",
        "body": "The cadence of this shower thought is perfection. I feel like I’ve just been on a journey.",
        "created_utc": 1630556010,
        "id": "hb9yuig",
        "permalink": "/r/wallstreetbets/comments/pg1s3c/what_are_your_moves_tomorrow_september_02_2021/hb9yuig/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630584810.0
    },
    {
        "author": "boneywankenobi",
        "body": "Historically been digital globe who has the actual first mover advantage since they have down to 10cm resolution - not the best revisit but there aren't many applications that need daily cadence, and clouds get in the way anyhow.",
        "created_utc": 1630861749,
        "id": "hbpgh48",
        "permalink": "/r/SPACs/comments/piakdv/sftw_blacksky_a_few_questions/hbpgh48/",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1630890549.0
    },
    {
        "author": "enticingginger",
        "body": "My approach is regular monthly investment no matter what and if the market corrects, add a more than normal after a 10% drop from ath, even more at 20%, and so on. Let’s me keep the regular cadence and also take advantage of dips.",
        "created_utc": 1630670373,
        "id": "hbfpumo",
        "permalink": "/r/investing/comments/pgn3h8/investing_in_the_current_ath_market/hbfpumo/",
        "score": 2,
        "subreddit": "investing",
        "created": 1630699173.0
    },
    {
        "author": "OrangeDutchy",
        "body": "You're satellite propulsion, then maybe this will be of interest. Just saw it in the [Rocketlab ](https://www.reddit.com/r/RocketLab/comments/pgcnhz/rocket_lab_is_exploring_inorbit_refueling_of/?utm_medium=android_app&amp;utm_source=share) subRed\n\nJust a little pushback to your comment, only trying to change your prospective. Your first sentence, it cancels itself out. When I say moat you understood it as what I meant, an \"advantage\". So we could say first entrant, that's a narrow moat. Then I would argue what if they have a few narrow and medium sized moats to combine for a wide one? A medium moat that will narrow is their location. Until it's more common to launch in less rural areas then this is not nothing. Being able to launch east, near the Equator, with little air and marine traffic, that's beneficial.\n\n I agree they do not have first mover advantage when it comes to making small sats. That goes with their medium moat of having these three things, rocket manufacturing, satellite manufacturing, and their own private launch site. If you are in the business and don't have one of those three, you'll be paying a premium at some point. I realize $/kg is the king metric, but reusability and launch cadence are starting to become important. \n\nReally a quarter,  priced in? I've only been studying the market a few months and I even know how naive that is. A quarter means you value them at their total cash and assets alone, neglecting 15 years of experience and intellectual property. As for priced in 10 years, new space is a new sector, new sectors are hard to gauge growth. If it takes them 5years to build a Medium class rocket, they'd have 5 more years to expand that product. So in ten years what if they are half the value of Space X is currently$70-90billion? 40billion dollars would put them close to $100/share.\n\nThat's really great you got to meet him. I'm not even in your industry and I know I'd get a big kick out of meeting him, or Ellis, or Elon obviously.",
        "created_utc": 1630582610,
        "id": "hbaxwms",
        "permalink": "/r/wallstreetbets/comments/pfvn1p/61000_rklb_yolo_across_3_brokerages_and_5/hbaxwms/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630611410.0
    },
    {
        "author": "imunfair",
        "body": "It's probably a combination of all the relevant agencies, but even NOTAMs are distributed a couple days in advance, if they want cadence faster than that they'd have to permanently restrict relatively large areas of airspace as launch and debris zones.",
        "created_utc": 1630834479,
        "id": "hbo4f8w",
        "permalink": "/r/wallstreetbets/comments/phwes2/some_rocketlabrklb_information_for_the_big_brain/hbo4f8w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630863279.0
    },
    {
        "author": "typicalshitpost",
        "body": "$CDNS been doing very well for me",
        "created_utc": 1630835839,
        "id": "hbo5x0z",
        "permalink": "/r/wallstreetbets/comments/phgqi2/lets_talk_about_tsm_stock_taiwan_semiconductor/hbo5x0z/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630864639.0
    },
    {
        "author": "OrangeDutchy",
        "body": "I thought of a few questions. Who are the governing bodies, which one is top dog, and by how much? State Dept, NASA, someone else? My main thought is how do you get them to increase launch cadence? Is it heavily dependent on each individual rockets flight heritage?",
        "created_utc": 1630807847,
        "id": "hbn2yyy",
        "permalink": "/r/wallstreetbets/comments/phwes2/some_rocketlabrklb_information_for_the_big_brain/hbn2yyy/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1630836647.0
    },
    {
        "author": "jonathan34562",
        "body": "Please upvote this so I can answer the most common questions I am getting in one place.\n\n\n1) How did I get to this point in my life?\n\nI have a master degree in computer science and spent 8 years working as a programmer at lots of different companies.  Then I launched my own consulting company - quickly figured out that services work doesn't scale well - pivoted the business to a product startup and used the consulting to finance it.  All told, it took 20 years to get a really big exit - like net of over $200M.  \nThere is no shortcut that I know of - education, skills, experience,  lots of hard work for years and then luck.\nNow I get to do whatever I like, I am typing this from a private jet on the wifi coming back from vacation... I know, wtf. I pinch myself too.\n\n\n2) How can I invest like you?\n\nWell. I have a lot of money so I can make risky bets.  I don't do options though, only stocks. I put $50k into GME on a whim at $65 and sold when it hit $350.  That was a laugh.  \n\nBut seriously, I invest in stocks that I feel like I know. I use HUBS - they are in a great space and really appealing to SMB. I see them as the most viable competitor to Salesforce - go look at Salesforce's market cap. Classic Clayton Christensen - you will be eaten from below.\n\nI am not really much of an investor - just see things that make sense. I bought Amazon at $350 - should have put in more...\n\nI typically invest in tech stocks because I feel like I understand the business.\n\nMy stock account is just my plaything. My real investing is much more structured and done with my wealth advisor at a large brokerage.",
        "created_utc": 1630774469,
        "id": "hbl52oz",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hbl52oz/",
        "score": 794,
        "subreddit": "wallstreetbets",
        "created": 1630803269.0
    },
    {
        "author": "Ackilles",
        "body": "Shares in a strong growing company. No real rush to withdraw it. Major Salesforce competitor gaining ground constantly",
        "created_utc": 1630767611,
        "id": "hbkpoc4",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hbkpoc4/",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1630796411.0
    },
    {
        "author": "jonathan34562",
        "body": "They are playing very well in the SMB space and are steadily encroaching on Salesforce. I think HUBS will only get bigger and bigger.  They will be the second competitor to Salesforce within 5 years. Check out the market cap on Salesforce.",
        "created_utc": 1630767579,
        "id": "hbkpluz",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hbkpluz/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1630796379.0
    },
    {
        "author": "jonathan34562",
        "body": "I have known HUBS for a long long time but I only started using their software around 18 months ago and realized how compelling their software is for startups and SMB (especially compared to Salesforce).",
        "created_utc": 1630775677,
        "id": "hbl7ugh",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hbl7ugh/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1630804477.0
    },
    {
        "author": "hapa604",
        "body": "My company moved from Hubspot to Salesforce.  The latter just has a far superior product",
        "created_utc": 1630768308,
        "id": "hbkr6zb",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hbkr6zb/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1630797108.0
    },
    {
        "author": "wildup",
        "body": "Have you even used both of their services? Hubspot is very different than Salesforce. You're comparing apples and oranges.",
        "created_utc": 1630768073,
        "id": "hbkqoi2",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hbkqoi2/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1630796873.0
    },
    {
        "author": "GeneEnvironmental925",
        "body": "15 years.  Have been holding AAPL since 2006. My risk tolerance is above average but things don't feel that risky to me because I do my research. I like growth names but nothing crazy.  I have a large core of big tech. No China, though I was in NIO until earlier this year. I mostly buy-and-hold but sometimes the market dictates otherwise. Trading is for professionals, IMO.\n\nAAPL AMD AMZN AVPT BARK CELH CRM CRWD DIS F GOOG MELI PINS PYPL SOFI UPST\n\nThis is my portfolio but I also have 20% split across three biotechs that I can't post in this subreddit. That's my high r/r, but I also don't feel like they're that risky because I know what I own.  \n\nRead all the 10-K and 10-Q.  Listen to earnings calls and take notes.  Keep on top of national and world news. Look at options chains to get sentiment. Use Twitter for news and such. Learn how to read candlestick charts and spot reversals.  Don't panic sell. Don't listen to the noise online.\n\nI broke $1.5m this morning.",
        "created_utc": 1630605358,
        "id": "hbcdqig",
        "permalink": "/r/stocks/comments/pgeerx/rstocks_daily_discussion_options_trading_thursday/hbcdqig/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1630634158.0
    },
    {
        "author": "Foreign-Weekend",
        "body": "The portfolio is split into ETFs and select equities. Open to consolidate or diversify. Currently DCA'ing with a target to reach 20% cash (52% current). In my 30s. Thanks in advance!\n\n| Ticker | Percentage |\n|--------|------------|\n| VTI    |        14% |\n| MSFT   |        12% |\n| SCHD   |         8% |\n| CRWD   |         7% |\n| SPOT   |         7% |\n| V      |         6% |\n| VNQ    |         4% |\n| BABA   |         4% |\n| TDOC   |         4% |\n| DVN    |         4% |\n| PRTA   |         3% |\n| IEMG   |         3% |\n| HZNP   |         3% |\n| AAPL   |         3% |\n| DAL    |         3% |\n| UBER   |         3% |\n| F      |         3% |\n| NIO    |         2% |\n| OMF    |         2% |\n| C      |         2% |\n| AKBA   |         1% |\n| DM     |         1% |\n| CRM    |         1% |",
        "created_utc": 1630719799,
        "id": "hbipv9f",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hbipv9f/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630748599.0
    },
    {
        "author": "moneylivelaugh",
        "body": "Before everyone jumps in on HUBS I’ll share my unsolicited opinion. Salesforce (CRM) is the 800lb gorilla in the CRM space. I agree that Hubspot is probably a better tool and should eat away market share. That being said for larger organizations the lift and shift of salesforce is nearly impossible. Not impossible but nearly from a cultural perspective. Curious to understand how much Fortune 1000 market share belongs to HUBS",
        "created_utc": 1630781171,
        "id": "hblk2zz",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hblk2zz/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630809971.0
    },
    {
        "author": "jonathan34562",
        "body": "NextDoor isn't really about software. It is social, marketplace, ads, consumer, trendy.  More like Facebook.  Seems like mostly the \"stay off my lawn\" old folks users from my experience. \n\nNot something I really understand so I can't comment, sorry.\n\nNot sure if HUBS or Salesforce will get to different numbers first but I think Salesforce will have a hard time serving the lower end of the market and that is where HUBS will grow. And then once big enough and sophisticated enough, then HUBS will challenge Salesforce in the enterprise.  My startup did this too in a different market. It is Clayton Christensen stuff - eaten from below...",
        "created_utc": 1630812679,
        "id": "hbnbr1s",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hbnbr1s/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630841479.0
    },
    {
        "author": "Starzz_1",
        "body": "BABA - 5.38%\n\nGOOGL - 14.46%\n\nAMZN - 13.52%\n\nAPPL - 17.75%\n\nBIDU - 5.58%\n\nCRSR - 9.13%\n\nQQQ - 19.52%\n\nNVDA - 9.34%\n\nCRM - 5.32%\n\nI know it’s basically all tech, but I’m still young, not a huge portfolio and looking for more growth even if it means more risk.",
        "created_utc": 1630565460,
        "id": "hbacv36",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hbacv36/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630594260.0
    },
    {
        "author": "Appropriate-Grisham",
        "body": "I follow a RVP of Zscaler on LI and they apparently CRUSHED their Q4 numbers. The stock is running hot but I do suspect quite an earnings beat (no matter which way it goes this is a $100bn + market cap stock anyways in a couple of years- similar trajectory to salesforce and ServiceNow &amp; Gartner leader by a mile)",
        "created_utc": 1630850280,
        "id": "hboqvy1",
        "permalink": "/r/StockMarket/comments/pi63gb/whats_the_best_way_to_make_money_off_of_these/hboqvy1/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1630879080.0
    },
    {
        "author": "claytondpark",
        "body": "Crm back to $275 next week",
        "created_utc": 1630696009,
        "id": "hbhc17m",
        "permalink": "/r/wallstreetbets/comments/ph24jo/daily_discussion_thread_for_september_03_2021/hbhc17m/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630724809.0
    },
    {
        "author": "claytondpark",
        "body": "Tickers that I think will make big moves next week: TsLa/mRNA/crm",
        "created_utc": 1630700087,
        "id": "hbhl7xw",
        "permalink": "/r/wallstreetbets/comments/phcns0/weekend_discussion_thread_for_the_weekend_of/hbhl7xw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630728887.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "Jan-April 18.4% sold a lot of stuff in January and February\n\nBought adbe,crm, vug,vgt\n\nMay- August 9.86% just been buying and holding. Have bought baba,Etsy, ttwo and ntdoy",
        "created_utc": 1630764713,
        "id": "hbkji9w",
        "permalink": "/r/stocks/comments/phqq42/we_have_had_8_months_already_in_the_trading_year/hbkji9w/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630793513.0
    },
    {
        "author": "jonathan34562",
        "body": "Yeah good point. I think there are so many net new customers though. And other CRM players to move from. But you are right, converting Fortune 1000 will be tough.",
        "created_utc": 1630781374,
        "id": "hblkjmx",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hblkjmx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630810174.0
    },
    {
        "author": "jonathan34562",
        "body": "I think so.  I think they get bigger and bigger, then potentially start taking real business from Salesforce at some point.",
        "created_utc": 1630787533,
        "id": "hbly3cb",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hbly3cb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630816333.0
    },
    {
        "author": "boomerzoomers",
        "body": "Salesforce is going to ATH next week and I will be selling",
        "created_utc": 1630713355,
        "id": "hbidb7o",
        "permalink": "/r/wallstreetbets/comments/ph24jo/daily_discussion_thread_for_september_03_2021/hbidb7o/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630742155.0
    },
    {
        "author": "orgabool",
        "body": "AMZN\nSNOW\nZNGA\nTTD\nSE\nROKU\nRDFN\nLULU\nPINS\nZM\nLMND\nPYPL\nINTU\nABNB\nSKLZ\n\nTech is the only thing I'm interested in.\nMore or less equally weighted.\nProfile is moderate/high risk, buy and hold.\nTime horizon 5-10 years.\n\nPlan to add more bigger caps (GOOG, NVDA, CRM)  as paychecks come in. Will probably trim LMND and SKLZ.\n\nAny help or suggestion appreciated. Thanks",
        "created_utc": 1630497803,
        "id": "hb6e2cn",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hb6e2cn/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630526603.0
    },
    {
        "author": "sergeantturnip",
        "body": "Yep I agree with your point about DDOG it’s niche in nature where the big dogs can absolutely do something similar but their product development is amazing, sequential revenue growth is increasing while spending so little on sales and marketing compared to companies like snowflake etc. \n\nWhat makes me feel better about datadog is they are cloud provider neutral coming out with new integrations like crazy such as salesforce. They seem to be quite aggressive in their niche and their last earnings report was amazing imo. \n\nI only have 10 total positions all with top conviction",
        "created_utc": 1630523722,
        "id": "hb82261",
        "permalink": "/r/wallstreetbets/comments/pfqpl8/daily_discussion_thread_for_september_01_2021/hb82261/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630552522.0
    },
    {
        "author": "StonedTurtle420710",
        "body": "ROKU, BABA, ZM, AAPL, TSLA, SBUX, CRM.\n\nI make a killing on good plays, lol, keep to your AMC and GME.",
        "created_utc": 1630594432,
        "id": "hbbmkcc",
        "permalink": "/r/wallstreetbets/comments/pgergo/daily_discussion_thread_for_september_02_2021/hbbmkcc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630623232.0
    },
    {
        "author": "Acoconutting",
        "body": "Yeah.They just don't make a ton of revenue quite yet - feels like a correction incoming then maybe a good time to get in. Similar to Asana right now.\n\nI'm also a big fan of looking at actual products of these companies - Ie; Asana has a great product. Zoom has a great product. Salesforce is a good product.\n\nTheir product/offering is a little meh for the growth hope imo.",
        "created_utc": 1630777520,
        "id": "hblbzh0",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hblbzh0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630806320.0
    },
    {
        "author": "MonoDun",
        "body": "&gt; **HUBS. Its products and services aim to provide tools for customer relationship management, social media marketing, content management, lead generation, web analytics, search engine optimization, live chat, and customer support**  \n  \nNice run, OP caught the rocket around Jan/Feb 2021 is my guess, legit $33 billion market cap company like Salesforce, Zendesk, for me at least its to $$$ with other bigger players and the run up could be COVID related it could catch the elevator down when things return to normal. It went from $120 to $715 or YEAR RANGE\n$260.79 - $715.29.",
        "created_utc": 1630873231,
        "id": "hbq6ao1",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hbq6ao1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630902031.0
    },
    {
        "author": "mrponcho99",
        "body": "Do you think HUBS will be bought out by salesforce?",
        "created_utc": 1630855433,
        "id": "hbp26hf",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hbp26hf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630884233.0
    },
    {
        "author": "claytondpark",
        "body": "Anyone buy Tesla $730c 0dte near the lows today?! WOW... \n\nTsLa and crm look great for next week...",
        "created_utc": 1630699648,
        "id": "hbhk8fl",
        "permalink": "/r/wallstreetbets/comments/phcns0/weekend_discussion_thread_for_the_weekend_of/hbhk8fl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630728448.0
    },
    {
        "author": "claytondpark",
        "body": "Don't sleep on crm next week fellows, think it's gonna make a huge move! My fav pick for next week...",
        "created_utc": 1630701111,
        "id": "hbhnith",
        "permalink": "/r/wallstreetbets/comments/phcns0/weekend_discussion_thread_for_the_weekend_of/hbhnith/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630729911.0
    },
    {
        "author": "reddit_is_chicom",
        "body": "Security related,  largest azure/365 data management and backup growing 30% CAGR and trading at only 10.5x this year's revenue. Also going into AWS and salesforce.",
        "created_utc": 1630803858,
        "id": "hbmvbxv",
        "permalink": "/r/investing/comments/pgr364/any_recommendations_for_cybersecurity_stocks_that/hbmvbxv/",
        "score": 1,
        "subreddit": "investing",
        "created": 1630832658.0
    },
    {
        "author": "orgabool",
        "body": "AMZN\nSNOW\nZNGA\nTTD\nSE\nROKU\nRDFN\nLULU\nPINS\nZM\nLMND\nPYPL\nINTU\nABNB\nSKLZ\n\nTech is the only thing I'm interested in.\nMore or less equally weighted.\nProfile is moderate/high risk.\n\nPlan to add more bigger caps (GOOG, NVDA, CRM)  as paychecks come in.",
        "created_utc": 1630488047,
        "id": "hb60qpo",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hb60qpo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630516847.0
    },
    {
        "author": "claytondpark",
        "body": "Watch crm next week, good looking setup",
        "created_utc": 1630823551,
        "id": "hbnrpxc",
        "permalink": "/r/wallstreetbets/comments/phcns0/weekend_discussion_thread_for_the_weekend_of/hbnrpxc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630852351.0
    },
    {
        "author": "sqgeafvfasvefvfevfsa",
        "body": "Hubspot has great moat potential, and the crm market is huge and growing. There are so many directions they can go with their business. There’s a great demand for businesses to unify processes and tooling. We’ll see how it turns out, but I like the platform they’re building for their customers. The platform is everything, that’s the moat.",
        "created_utc": 1630778447,
        "id": "hble1tz",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hble1tz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630807247.0
    },
    {
        "author": "claytondpark",
        "body": "No just holding it's support/trend from it's recent bullish breakout move, grabbed some CRM 9/10 $275c (looks like it's gonna head back there next week, they were cheap)",
        "created_utc": 1630698107,
        "id": "hbhgrfr",
        "permalink": "/r/wallstreetbets/comments/ph24jo/daily_discussion_thread_for_september_03_2021/hbhgrfr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630726907.0
    },
    {
        "author": "The_Folkhero",
        "body": "You are a software guy, what do you think of the NextDoor app (KVSB)? \n\nhttps://www.fool.com/investing/2021/07/07/nextdoor-is-going-public-via-spac-what-you-need-to/\n\nAlso, what happens first, HUBS to 300 billion market cap or Salesforce to 500 billion market cap?",
        "created_utc": 1630787214,
        "id": "hblxe0h",
        "permalink": "/r/wallstreetbets/comments/phqhwz/did_i_do_this_right_turns_out_money_does_make/hblxe0h/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1630816014.0
    },
    {
        "author": "ruuds96",
        "body": "Microsoft and Salesforce",
        "created_utc": 1630686446,
        "id": "hbgphf1",
        "permalink": "/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy/hbgphf1/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1630715246.0
    },
    {
        "author": "Civil_Quantity_6984",
        "body": "Salesforce makes discord look like a toy",
        "created_utc": 1630702139,
        "id": "hbhpulv",
        "permalink": "/r/SPACs/comments/pgwqfb/ipof_discord/hbhpulv/",
        "score": -1,
        "subreddit": "SPACs",
        "created": 1630730939.0
    }
]