[
    {
        "author": "GroundSe7en",
        "body": "Credits to /u/ixamnis\n\n\" Here are some that I like. By no means an exhaustive list:\n\n**QQQ** \\- This one uses the NASDAQ 100 as its benchmark. Obviously it's an Indexed, non-managed ETF. XTF used to rate this one as a perfect 10.0 out of 10 rating, but recently dropped it to 9.9 out of 10. It has one of the highest rates of return over the past 10 years of any ETF. It does tend to be tech-heavy, especially with the FAANG +M stocks.  (Facebook, Apple, Amazon, Netflix, Google and Microsoft).  Other top holdings include TSLA, NVDA and ADBE.  (The rating dropped recently when the portfolio of the NASDAQ 100 was re-balanced).\n\n**VXUS** \\- Vanguard Total International Index Fund ETF - top holdings include BABA, Tencent, Samsung, Taiwan Semiconductors, Novartis, Toyota. This is a broad market fund investing only in companies overseas.  I'm not generally bullish on foreign markets, but this one is a very solid ETF with some companies that are likely to do extremely well for the foreseeable future.  XTF rates this one a perfect 10.0 out of 10.\n\nAt the suggestion of u/Here4TheCatPics, I'm also going to include **EFA** and **EEM**. These are Emerging Markets ETFs.  Both have some crossover in their top holdings with VXUS. **EFA** is rated 9.6/10 by XTF Analysts and **EEM** is rated only 5.7/10. **EEM** appears to be heavily invested in the Chinese market with Alibaba and TenCent the top two holdings. It also holds quite a bit of cash for an ETF. **EFA** appears to be more tilted toward the European market. \n\n**VOO**/**SPY** \\- **VOO** and **SPY** are non-managed funds indexed to the S&amp;P 500 Index. These funds are very popular on this subreddit, for good reason. They are well diversified, broad market funds investing in mostly US stocks. XTF rates these funds at 9.6 out of 10 because their return on investment over the long term is somewhat tempered by some of the blue chip stocks in the funds. But those stocks also help reduce volatility relative to some other ETFs. These are solid investments, but keep in mind that in the top 10 holdings there will be a lot of crossover between these funds and other broad market funds that hold US stocks like **QQQ**, **VTI**, **VTG**, **VOOG** and **SPYG**.  There are differences, of course, as well, but you always want to know where those duplications exist.\n\n**IWF** \\- This is a Russell 1000 indexed fund. It is one of my favorites that doesn't get talked about much. It does have a lot of crossover with the other funds mentioned above, but the mix is slightly different.  I would describe this fund as more aggressive than **VOO/SPY**, less volatile than **QQQ**.\n\n**IWM** \\- for someone looking to diversify a little bit, this is a great fund to look into. This fund is a non-managed, indexed fund that uses the Russell 2000 index as its benchmark. The big difference between the Russell 2000 index and many of the the other indexes is that the Russell 2000 index looks at small and mid-cap companies, rather than large-cap companies.  Thus, there is zero crossover between this one and the funds mentioned above. While this fund will move up and down with the market, it is often less volatile than the market overall. If you look at the charts, this fund has under-performed some of the other funds over the past few months while the market has been very volatile in an upward direction, but in a crash, this fund would probably outperform the rest of the market.  It has a 9.0/10 XTF rating.\n\nThere are also some sector funds you may want to look at:\n\n&amp;#x200B;\n\n**ICLN**/**TAN/FAN** \\- These funds are clean/renewable energy ETFs. ICLN is more broad while TAN focuses more specifically on solar energy and FAN specifically on wind generated energy. I think renewable energy companies are the future. There is no crossover in the top holdings of this fund with the top holdings of QQQ and most of the other broad market funds. Also, these are global, not just US based companies.  QCLN and PBW are also renewable energy funds, but they also contain a lot of TSLA, NIO and W.K. H.S. in their top holdings making them \"electric vehicle\" funds, as well.  No problem if you want to add that, but you'll find a lot of Tesla in some of the funds mentioned above.\n\n**ARK** group of funds: **ARKG**, **ARKF**, **ARKK ARKW**, **ARKQ**, **PRNT** and **IZRL**. These are managed funds investing in companies that invest in disruptive companies in their respective industries. Most posters on this subreddit are bullish on these funds. They are aggressive growth ETFs, but should be considered somewhat risky and volatile.\n\n* ARKG - Genomic Revolution\n* ARKF - Fintech\n* ARKK - Disruptive Companies (broader market)\n* ARKW - Internet/computer/technology  (Telsa is a top holding)\n* ARKQ - Robotics and artificial intelligence\n* PRNT - 3D printing technology\n* IZRL - disruptive companies based in Israel\n\nXL series of funds.  Similar to the ARK series, these tend to be more aggressive growth funds, however these are passively managed indexed funds with various benchmarks that usually are overloaded in the better companies within a sector:\n\n* **XLV** \\- Health Care\n* **XLK** \\- Technology\n* **XLY** \\- Consumer Discretionary\n* **XLF** \\- Financial\n* **XLU** \\- Utilities\n\nAt the suggestion of u/Shaun8030, I'm adding Cloud Computing as another sector to consider.  Some tickers in that sector include:  **WCLD**, **SKYY**, **CLOU**, **BUG** and **XIKT**. Of these **WCLD** has the best 52 week performance.  Top holdings in **WCLD** include **ZM**, **PLAN**, **CRM**, **CRWD**, **ZEN**, **WDAY**, **TENB**, **PCTY**, **DDOG**, **BL**.  Many of these are likely to also appear in **QQQ**, however, they would be in very small percentages as the Cap on these companies is much smaller.\n\nRead through the comments below. Many users have posted some other great suggestions, as well.\n\n***A nice portfolio might look something like this:***\n\n20% - Broad market US fund such as QQQ, VOO or IWF\n\n20% - VXUS - International\n\n20% - IWM - Small/Mid-cap broad market fund\n\n10% each in four sector funds of your choice\n\nHope this helps.\n\n&amp;#x200B;\n\n*I'm not a financial expert or advisor and this is not financial advice, just an opinion from a random internet person.  I do own shares in several, but not all of the funds listed above, including QQQ, IWF, some ARK funds, ICLN, VXUS, etc.*\n\n&amp;#x200B;\n\n**EDIT:**  WOW! Thanks for the awards and the positive comments.  I appreciate the feedback.  I hope this advice really helps some people.\"",
        "created_utc": 1623447021,
        "id": "h1g8hk1",
        "permalink": "/r/investing/comments/nxlekk/which_to_pick_schd_voo_vig_vti_vt_vym_vxus_veu/h1g8hk1/",
        "score": 68,
        "subreddit": "investing",
        "created": 1623475821.0
    },
    {
        "author": "stiveooo",
        "body": "cause its a good call, when the company makes good decisions investors rewards them, same reason why CRM tanked, cause they paid too much for that company they bought",
        "created_utc": 1622556871,
        "id": "h071fnr",
        "permalink": "/r/wallstreetbets/comments/npso9s/amc_sells_85_million_shares/h071fnr/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1622585671.0
    },
    {
        "author": "Chance-Progress-7356",
        "body": "The company is growing and therefore they are on a hiring spree. John Chen said during earnings call that they increasing the salesforce and foot on the ground by 23%",
        "created_utc": 1624730729,
        "id": "h34ngzd",
        "permalink": "/r/wallstreetbets/comments/o8bir8/blackberry_launched_bb_ivy_to_accelerate_smart/h34ngzd/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1624759529.0
    },
    {
        "author": "Jeff_APXT",
        "body": "AvePoint as a company has a great track record of inventing new technologies. For example, AvePoint recently introduced Policies and Insights which helps detect risky oversharing in Microsoft 365 within the last year for example. \r  \n\r  \nAvePoint has strong expertise in two areas: Microsoft 365 and business collaboration. AvePoint’s goal is to help organizations collaborate with confidence.  This is especially important as companies cope and build resilience for a hybrid workforce.  \n\nFuture ventures will likely not be focused in the consumer space, but either in solutions that:\r  \n\r  \n•\tHelp verticalize Microsoft 365 in other industries like its [new EduTech line of solutions](https://www.avepoint.com/edutech) which enables higher education to consolidate the online learning process and use M365 for an LMS . This product line also will focus on corporate learning with guided learning paths and employee development. \n\n\r  \nOR\r  \n\r  \n•\tIn those other collaboration platforms like Salesforce where the company recently introduced a backup solution, AvePoint will emphasize secure collaboration by delivering capabilities that enhance sharing of information across platforms.\r  \n\r  \nEven just by continuing to focus in Microsoft 365-- a jump from capturing the current 3% of that userbase to 10% is a $1 billion opportunity.",
        "created_utc": 1624666120,
        "id": "h31zk70",
        "permalink": "/r/SPACs/comments/o6dz0y/ama9_apxt_apex_technology_acquisition_corp_with/h31zk70/",
        "score": 14,
        "subreddit": "SPACs",
        "created": 1624694920.0
    },
    {
        "author": "FlyWannaBeRichGuy",
        "body": "Spoken like a true tard not in the space… They freaking use Loan Swap tech.  Rocket uses brilliant ranking tech and a CRM that runs circles around UWM.  They have the best lead aggregation strategies.",
        "created_utc": 1623932715,
        "id": "h22y5hg",
        "permalink": "/r/wallstreetbets/comments/o1vlhq/rkt_round_2_thanks_jp/h22y5hg/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1623961515.0
    },
    {
        "author": "John_Bot",
        "body": "This is awesome. Thanks man.\n\nHere's my question - As we know Avepoint is synonymous with Microsoft 365 at this point but with ventures in Sharepoint, Salesforce, among others are there any new horizons that Avepoint is trying to test their hand at next? Whether it could be applying their data security expertise to anti-cheat tools for video games or encrypted data messaging / cloud backup for consumer use?",
        "created_utc": 1624459182,
        "id": "h2rt9jw",
        "permalink": "/r/SPACs/comments/o6dz0y/ama9_apxt_apex_technology_acquisition_corp_with/h2rt9jw/",
        "score": 12,
        "subreddit": "SPACs",
        "created": 1624487982.0
    },
    {
        "author": "SippieCup",
        "body": "The partnership is that GameStop will pay for and use Microsoft's retail system and CRM. In return, GameStop then can sell the 2 year subscribe-to-own Xbox Series X/S Xbox All Access program at the same retail price as Microsoft is.\n\nI hardly consider that something will be able to make GS meet their market cap. GameStop did need modernization if their retail channels, but like.. The partnership is _not_ going to make GameStop successful.",
        "created_utc": 1624379281,
        "id": "h2o0u95",
        "permalink": "/r/wallstreetbets/comments/o5k4w3/gamestop_completes_atthemarket_equity_offering/h2o0u95/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1624408081.0
    },
    {
        "author": "SPACsTookMyHome",
        "body": "KPLT earnings aside from #s:\n\n* Working with salesforce e-commerce\n* they mentioned but did not elaborate on additional waterfall partnerships like they have with prime lenders affirm where they get the rejected customers and have the chance to loan to them instead.  I can only imagine who this is I mean there aren’t too many players in this space right? Would have to be a brick and mortar lender, klarna or afterpay? Just can’t see who else they could be talking about",
        "created_utc": 1623759536,
        "id": "h1u99e1",
        "permalink": "/r/SPACs/comments/o09gpd/announcements_x_daily_discussion_for_jun152021/h1u99e1/",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1623788336.0
    },
    {
        "author": "Jesus-I-Was-Evil",
        "body": "It makes no fucking sense for PLTR to be here. Wtf is this? Might as well throw Salesforce up or some shit.",
        "created_utc": 1624618820,
        "id": "h2zdqdr",
        "permalink": "/r/wallstreetbets/comments/o7knpd/daily_popular_tickers_thread_for_june_25_2021/h2zdqdr/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1624647620.0
    },
    {
        "author": "OutgoingHostility",
        "body": "I’m bullish on PYPL, BABA, and CRM. At the moment BABA’s the only one with a good entry point but LT these are all strong plays in my opinion.",
        "created_utc": 1624927976,
        "id": "h3dy86u",
        "permalink": "/r/stocks/comments/o9xb0g/safe_stocks_that_are_likely_to_outperform_the/h3dy86u/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1624956776.0
    },
    {
        "author": "DiamondBullResearch",
        "body": "Amazon as a SWE doesn't give you nearly as many perks as you think it goes compared to the other FAANG. They don't have free food or snacks (the banana is a meme for a reason). \n\nCompared to a place like Microsoft or Google, or Salesforce, or Indeed or really any other major tech company, the biggest appeal of Amazon is salary imo.",
        "created_utc": 1624495210,
        "id": "h2tyw39",
        "permalink": "/r/stocks/comments/o6mci7/what_if_you_invested_in_the_linkedin_top_10/h2tyw39/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1624524010.0
    },
    {
        "author": "jsntx",
        "body": "14x CRM 7/18 250c 🚀🚀🚀💰💰💰",
        "created_utc": 1623692050,
        "id": "h1r47f3",
        "permalink": "/r/wallstreetbets/comments/nzjc6w/daily_discussion_thread_for_june_14_2021/h1r47f3/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1623720850.0
    },
    {
        "author": "lattiboy",
        "body": "Pretty much exactly my thinking. I am mostly an options trader, but had recently had a good run and just last week had moved most my cash to some stocks I had faith in like Sony and CRM. Then the true meme madness started. I went almost all cash. \n\nI think the CPI will be the catalyst for a bad tech sell off along with a cascading meme crash, which god knows how that turns out. I’ve positioned myself accordingly (UVXY, SQQQ, and some puts on high PE tech and some meme stuff). \n\nIt’s as much a spidey-sense thing as sophisticated analysis. I just can’t buy anything because it all seems like a house of cards right now, even though the economy itself is kicking ass. \n\nPS I am just referencing my “play money”, not my larger IRAs and Vanguard ETFs. I don’t think this is going to be a generational crash, but I think for options traders it’s going to be an absolute bloodbath.",
        "created_utc": 1623269625,
        "id": "h172p7g",
        "permalink": "/r/stocks/comments/nvrnc7/rstocks_daily_discussion_wednesday_jun_09_2021/h172p7g/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1623298425.0
    },
    {
        "author": "lattiboy",
        "body": "Took 80% of my portfolio and bought shares of COST, CRM, APPS and SONY. I’m using the other 20% to do dumb, speculative horseshit. I feel this is best for my mental health. \n\nBought July calls for MU, SNAP, GPS, DRI and MSFT. \n\nI’m done waking up at 6AM for premarket and worrying about the daily nonsense. All of this is out of my hands and I can’t beat algorithms and professional traders.",
        "created_utc": 1622762277,
        "id": "h0i1lek",
        "permalink": "/r/stocks/comments/nr9bwp/rstocks_daily_discussion_options_trading_thursday/h0i1lek/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1622791077.0
    },
    {
        "author": "totally_possible",
        "body": "not a penny stock by any means, but $WORK is being bought out by $CRM and there might be a little bit of arbitrage left there",
        "created_utc": 1622975483,
        "id": "h0s5jkr",
        "permalink": "/r/pennystocks/comments/ntitd7/are_there_upcoming_mergers/h0s5jkr/",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1623004283.0
    },
    {
        "author": "Servalipp",
        "body": "My friend wanted to post this but he doesn't have enough reddit karma, so I am posting it for him.\n\nHello, I am still kind of new to investing so my portfolio might need to be changed a bit and I am looking for advice on what to change within my portfolio.Some current information that might help\n\n&amp;#x200B;\n\n**Time Horizon:** Very long 40+ years (Currently 16)\n\n**Risk Tolerance:** Medium\n\n**Preferred Investing Style:** Growth (Preferably Blue chip)\n\n**Amount of Capital Invested:** \\~$3350 (Currently adding $50 a week)\n\n**Time Invested In This Portfolio:** 7 months\n\n**Current Broker:** M1 Finance\n\n**Portfolio:**\n\nVOO - 20.19%\n\nVTI - 20.00%A\n\nAPL - 14.33%\n\nMSFT - 12.56%\n\nAMZN - 11.56%\n\nAMD - 3.52%\n\nTSM - 3.33%\n\nPYPL - 3.01%\n\nCRM - 2.93%\n\nV - 2.56%\n\nNVDA - 2.24%\n\nADBE - 1.91%\n\nMA - 1.86%\n\n**Questions I have:**\n\nI know VOO and VTI are basically identical; they just have different allocations of each stock. So is it ok to have both of them in my portfolio, or should I go \\~40% into one of the two to clean my portfolio a little?\n\nHow often should I re-balance my portfolio, so I get in the habit of not creating too many taxable events?\n\nI am very bullish on cloud computing and semiconductors long term but I feel I may be too heavily invested in those sectors. Should I decrease my allocation to these sectors in my portfolio and diversify more, or is it ok to make bets like this because of my time horizon?\n\nIs it ok to have basically my entire portfolio in large-cap tech stocks? Have I diversified enough with the 40% allocation of the two funds (VOO and VTI)?",
        "created_utc": 1624054222,
        "id": "h29dmy3",
        "permalink": "/r/stocks/comments/nppkp4/rate_my_portfolio_rstocks_quarterly_thread_june/h29dmy3/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1624083022.0
    },
    {
        "author": "tta2013",
        "body": "Gotta say, my CRM is lookin pretty good so far.",
        "created_utc": 1624548538,
        "id": "h2w7sn1",
        "permalink": "/r/stocks/comments/o6xg1n/rstocks_daily_discussion_options_trading_thursday/h2w7sn1/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1624577338.0
    },
    {
        "author": "wambamsamalamb",
        "body": "Geography, 9 national parks including Yosemite, Sequoia, Joshua Tree, Death Valley, &amp; Channel Islands. 20 national forests. Ocean and mountains to deserts and forests. Also borders OR, NV, and AZ and is 1of4 states that Borders Mexico. CA is rich in natural resources in the land &amp; sea. \n\nAgriculture, from the fields of Oxnard, through the Central Valley, all the way to lumber and Pot of NorCal, not to mention the wine industry. \n\nSome of the largest companies in the world are headquartered in CA, from the tech of Silicon Valley, to Entertainment and Art of Los Angeles-  DJ30 companies continually reside in CA. APPL, CVX, INTC, CSCO, V, CRM, DIS, AMGN. If CA was a country it’d have the 5th largest GDP! \n\nEducation, top public and private universities such as UC Berkeley, Cal Tech, Stanford, UCLA, USC and more. \n\nEntertainment, from Hollywood and Disney to the 5 MLB, 4 NBA, 3 NFL, 3 NHL, 3 MLS, and 1 WNBA (19 in total), CA is a world renown Tourist destination. Not to mention World class surfing, rock climbing, &amp; skiing. \n\nCA really does have it all! \n\nIt’s expensive as all hell, and crowded as anywhere else though. Healthcare, Infrastructure, homelessness, and forest fires could be addressed a little better though.",
        "created_utc": 1624846900,
        "id": "h3a0rbf",
        "permalink": "/r/stocks/comments/o8ywz4/investing_in_california_my_top_10/h3a0rbf/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1624875700.0
    },
    {
        "author": "Mojojojo3030",
        "body": "Your understanding, and apparently that of most people here, is missing that yes, it is Amazon, Yelp, Doordash, and Google Maps on the front end... but it is also Salesforce, compliance, and general SaaS on the back end, all vertically integrated into a \"picks and shovels\" monster.\n\nThere is nothing else like it, and at this rate there isn't going to be. Not only are SaaS sticky individually, but when they become this pervasive you NEED them or you cannot participate in the industry because nobody else can complete certain functions, transactions, or syncs with you. Everyone has worked somewhere where they say \"yes, this SaaS sucks, and there's nothing we can do about it\" and by all reports this one does not suck at all.\n\nAnd in typical SaaS fashion the ceiling on its revenue multiples is sky high (currently at \\~13x, some Saas hits the 50s x) and its overhead is microscopic (gross margin 94% and likely to drop). It is 88% institutional investment. 40% CAGR.\n\nIt's a reopening play, a data play, a legalization play, a regulation play, international markets, maybe future legal psychedelics... NY just legalized and hasn't even hit their revenue yet.",
        "created_utc": 1623481516,
        "id": "h1hrn1b",
        "permalink": "/r/investing/comments/nxhr9l/weedmaps_merger_vote_passed_sspk_will_change_into/h1hrn1b/",
        "score": 4,
        "subreddit": "investing",
        "created": 1623510316.0
    },
    {
        "author": "Unemployable1593",
        "body": "ok, i concur. dr strangelove is the better movie\n\nengage CRM-114",
        "created_utc": 1623557042,
        "id": "h1l5t7j",
        "permalink": "/r/wallstreetbets/comments/ny2hcb/fraternal_association_of_gambling_gentlemen_and/h1l5t7j/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623585842.0
    },
    {
        "author": "The_Folkhero",
        "body": "Yes, Adobe, Intuit and Salesforce are three of my biggest position long term holdings. I like to call them the \"baby FAANGs\".",
        "created_utc": 1624215733,
        "id": "h2gg5vs",
        "permalink": "/r/StockMarket/comments/o4bvag/would_you_buy_any_of_these_for_the_long_term/h2gg5vs/",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1624244533.0
    },
    {
        "author": "augusttrip2019",
        "body": "Lol. If you think Salesforce is a boomer stock you’re a moron.",
        "created_utc": 1623954899,
        "id": "h24boph",
        "permalink": "/r/wallstreetbets/comments/o1zllb/salesforce_crm_is_a_great_investment_right_now_dd/h24boph/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623983699.0
    },
    {
        "author": "gothicka112",
        "body": "MSFT doesn’t have the same upside % growth wise from where they stand currently. I think you’re undervaluing AVPT greatly. AVPT is seeing 30% YOY growth, using 250M cash post merger to acquire companies, and is expanding to other areas like salesforce etc. in the Microsoft ecosystem, they still have a lot of exposure to new customer base they don’t have yet, which organically will help them with significant growth. I have a strong feeling AVPT will be one of the few companies coming out of a SPAC to see great returns in the short and long term.",
        "created_utc": 1624799766,
        "id": "h37j1wz",
        "permalink": "/r/SPACs/comments/o8do30/apxt_yolo_upcoming_merger/h37j1wz/",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1624828566.0
    },
    {
        "author": "RareRationalFan",
        "body": "Biggest regret is not buying more Salesforce",
        "created_utc": 1623696899,
        "id": "h1rexz8",
        "permalink": "/r/wallstreetbets/comments/nzjc6w/daily_discussion_thread_for_june_14_2021/h1rexz8/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623725699.0
    },
    {
        "author": "Ken385",
        "body": "One is an adjusted CRM contract that delivers 110 shares and $47.34 cash.",
        "created_utc": 1622817376,
        "id": "h0klgw8",
        "permalink": "/r/options/comments/ns6iei/tos_option_chain/h0klgw8/",
        "score": 3,
        "subreddit": "options",
        "created": 1622846176.0
    },
    {
        "author": "ChillinCharcoal",
        "body": "Any semi-conductor stock will be a good play. $MSFT will be steady returns (not stratospheric) - $CRM would be similar. Payment plays like $PYPL and $SQ are good bets. I think $SOFI has a lot of potential. Previous commenter had some good picks where he noted might be pricey now like $SNOW and $RBLX. We are all focused on tech stocks, but I'd look into biotech like $ABBV or $GSK that have great dividends with good growth prospects. Diversify baby!",
        "created_utc": 1624723519,
        "id": "h3490nl",
        "permalink": "/r/stocks/comments/nppkp4/rate_my_portfolio_rstocks_quarterly_thread_june/h3490nl/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1624752319.0
    },
    {
        "author": "allinonworkcalls",
        "body": "you clearly have literally zero understanding of what salesforce does lol",
        "created_utc": 1622564931,
        "id": "h07jd5q",
        "permalink": "/r/wallstreetbets/comments/npso9s/amc_sells_85_million_shares/h07jd5q/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622593731.0
    },
    {
        "author": "moon_buzz",
        "body": "CRM on the daily trendline breakout",
        "created_utc": 1624453076,
        "id": "h2rhaw4",
        "permalink": "/r/wallstreetbets/comments/o69r01/daily_discussion_thread_for_june_23_2021/h2rhaw4/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624481876.0
    },
    {
        "author": "Altruistic_Nobody176",
        "body": "WDAY, CRM, F",
        "created_utc": 1622562520,
        "id": "h07dshd",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h07dshd/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622591320.0
    },
    {
        "author": "lattiboy",
        "body": "I think I’m most uneasy because even though the bond yield is terrible, these highly profitable tech companies like CRM and MSFT are flat or down. Retail, energy, and commodities too. Doesn’t really make sense. \n\nWhere is the excess liquidity going? Meme stocks? Private market? Coins? Honestly asking….",
        "created_utc": 1623189078,
        "id": "h12w99g",
        "permalink": "/r/stocks/comments/nv0tkm/rstocks_daily_discussion_technicals_tuesday_jun/h12w99g/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1623217878.0
    },
    {
        "author": "nbhu2kiiq",
        "body": "damn, my company is a huge consumer of microstrategy BI. Oh well, microsoft or salesforce will probably buy them out if that happens",
        "created_utc": 1624322025,
        "id": "h2ll58n",
        "permalink": "/r/investing/comments/o59p4v/michael_saylor_and_bitcoins_future/h2ll58n/",
        "score": 3,
        "subreddit": "investing",
        "created": 1624350825.0
    },
    {
        "author": "Farscape1477",
        "body": "There’s a ton of hype for ROKU, NVDA, ADBE.   Arguably lesser, but still strong, are PINS, CRM, ETSY.",
        "created_utc": 1624043206,
        "id": "h28q3yf",
        "permalink": "/r/stocks/comments/o2o96v/dont_regret_selling_your_stocks_early/h28q3yf/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1624072006.0
    },
    {
        "author": "mistah-hohey",
        "body": "Short term $BBIG - longer plays - ADVM - KLDO - SREV- GNUS.  Solid long term - VZ - KO - OKTA - CRM\n\nThat was easy.  Do ya own DD.  Not a cat.  Like these stocks.  Good luck!",
        "created_utc": 1623417357,
        "id": "h1ee588",
        "permalink": "/r/RobinHoodPennyStocks/comments/nx9m3r/looking_for_some_solid_moves/h1ee588/",
        "score": 3,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1623446157.0
    },
    {
        "author": "JonskMusic",
        "body": "Exactly. I don't get it. I mean... photoshop is/was ubiquitous but. its pricey for people. There are people who want to make content and can't afford 50 a month for Premiere etc. Also Adobe has been teasing some really cool AI stuff for years.... but where is it? They haven't really done anything huge in a while.. Creative Cloud is okay.. but its clunky and people don't like paying subscription and they don't like dealing with millions of passwords on an enterprise level etc. Adobe could be great.. but they need to do something big.... although every lawyer on the planet uses Acrobat and calls it Adobe. \"Do you have adobe?\"... Yet acrobat itself is kind of clunky as well.   \n\n\nBut who is their rival? If you look it up.. None of those companies have much to do with creating content: \"Adobe's top competitors include SAP, Salesforce, DocuSign, Dropbox, Getty Images, Shutterstock, Apple, Microsoft, IBM and Autodesk. Adobe is a software company developing digital marketing and media solutions.\"",
        "created_utc": 1623511752,
        "id": "h1iveuq",
        "permalink": "/r/StockMarket/comments/ny6vzo/adobe_poised_for_breakout_im_long_and_adding/h1iveuq/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1623540552.0
    },
    {
        "author": "baconography",
        "body": "\"CRM call volume above normal and directionally bullish\"\n\nWHY",
        "created_utc": 1622571278,
        "id": "h07xybn",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h07xybn/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622600078.0
    },
    {
        "author": "neothedreamer",
        "body": "I get excited about my portfolio.  Have some solid names like Aap, Msft, Amd, Fsly, BB, CS, Amzn, Baba, Cat, CLF, Adobe, Crm etc.  \n\nWas cool to see Msft hit the $2T mark.  I also think Amd is going to take off through the end of year. Baba came alive last week.\n\nI do have some spicier ones like Clne, Hnst, Sofi, Root, Rkt, Pltr Pton etc.\n\nI am a hybrid between long and swing.  Hold solid names but will periodically sell to lock in profit and buy on dips.  Also sell Cover calls on my holdings. Solid stocks do channel up and down. So why not buy at the bottom and sell at top?\n\nI have been destroying the benchmarks by the way.",
        "created_utc": 1624748402,
        "id": "h35l7ze",
        "permalink": "/r/investing/comments/o808c7/is_it_normal_to_not_get_excited_about_the_stocks/h35l7ze/",
        "score": 3,
        "subreddit": "investing",
        "created": 1624777202.0
    },
    {
        "author": "notbrokemexican",
        "body": "I love Salesforce. Expecting that they're going to acquire Monday.com to continuously bring the heat to Microsoft in the office space.",
        "created_utc": 1622884180,
        "id": "h0o27em",
        "permalink": "/r/stocks/comments/nsm4rj/reduce_aapl_from_10_to_5_up_my_msft_to_10_or_add/h0o27em/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1622912980.0
    },
    {
        "author": "bigrooster2022",
        "body": "&gt;That guy is literally committing financial manslaughter.. He’s all in on the hype/growth stocks\n\nAnd when one of his stocks drops 10% he thinks it's \"on sale\" - like woophee it's only trading for 20 times revenue now instead of 22 times revenue😂😂😂 -  I asked him if he has any stocks with a Price/Sales ratio under 10 and he said CRM (it's 9.87 lmao).",
        "created_utc": 1622765309,
        "id": "h0i7neo",
        "permalink": "/r/ValueInvesting/comments/nrf7jc/cathie_wood_and_yolo_growth_investors/h0i7neo/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1622794109.0
    },
    {
        "author": "trenderizer",
        "body": "On Dec 2018 2020, Druckenmiller told Bloomberg he was long 2/5/10 year treasuries, and liked SaaS stocks like $crm, $now. None made money. Of course, he may have changed his mind. The point is that following strategies from titans like Druckenmiller or PTJ is a terrible idea.\n\nBloomberg video (BNN): https://www.bnnbloomberg.ca/investing/video/druckenmiller-says-even-at-these-yields-i-like-treasuries\\~1567565",
        "created_utc": 1624623693,
        "id": "h2zkfe8",
        "permalink": "/r/CanadianInvestor/comments/o7knfi/daily_discussion_thread_for_june_25_2021/h2zkfe8/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1624652493.0
    },
    {
        "author": "BabySPACRibs",
        "body": "AH thanks for the clarification. That makes sense. That should definitely bring some attention given how deep they're in with MSFT, providing service to other big companies like Salesforce, not to mention how many other companies that actually use Avepoint under the radar.",
        "created_utc": 1624297028,
        "id": "h2k55qt",
        "permalink": "/r/SPACs/comments/o4mkdh/announcements_x_daily_discussion_for_jun212021/h2k55qt/",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1624325828.0
    },
    {
        "author": "Ghosts-of-Tom-Joad",
        "body": "The shills on CNBC were pitching CRM. Guess what? Your too late to the party. The smart people bought over 5 years ago when it was in the 70’s. The wheels of momentum are grinding to a halt. \n\nHowever I like the company and believe it has a brighter future. I will buy but think there is a better price to be had. Until then I’m approaching with caution It’s on my watch list. \n\nCongratulations to the long time bag holders on this one. Good work.",
        "created_utc": 1624921887,
        "id": "h3dmfzt",
        "permalink": "/r/wallstreetbets/comments/o9s4kb/what_are_your_moves_tomorrow_june_29_2021/h3dmfzt/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624950687.0
    },
    {
        "author": "Zachm512",
        "body": "Salesforce",
        "created_utc": 1624831950,
        "id": "h39a3a5",
        "permalink": "/r/stocks/comments/o93hw4/what_are_some_companies_you_love_but_hate_the/h39a3a5/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1624860750.0
    },
    {
        "author": "WestC0astTravels",
        "body": "Truth. Many on-premise houses ran Oracle in the past. They're now looking at moves to the cloud with on premise technologies becoming to out-dated, out of support, and slow. Oracles cloud products look like child's play when placed up against Workday. \n\nAnother big one would be Salesforce. Big time expensive, but big time powerful. Integrates well with other systems. And customer service / support, alongside automations and self help, are becoming more and more important as customer volume increases.",
        "created_utc": 1625021548,
        "id": "h3ine2q",
        "permalink": "/r/stocks/comments/oai5jy/what_are_your_highest_conviction_plays_for_the/h3ine2q/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625050348.0
    },
    {
        "author": "diaznutzinyomouf",
        "body": "Wouldn't worry about avepoint, even if it goes down it will be short lived. 200m revenue this year, zero debt,  30% CAGR, branching out with edutech and Salesforce, solid tech vets on board in a growing TAM? This isn't a magic flying truck. If you don't have the conviction then you shouldn't have bought it, might not be for you guy.",
        "created_utc": 1622886675,
        "id": "h0o4y5f",
        "permalink": "/r/SPACs/comments/nsjxzp/do_all_spacs_get_slaughtered_post_merger/h0o4y5f/",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1622915475.0
    },
    {
        "author": "Butterfliesinmybrain",
        "body": "i just hate using Salesforce so much I don't think I could invest",
        "created_utc": 1623751922,
        "id": "h1tzi7u",
        "permalink": "/r/wallstreetbets/comments/o0ap26/daily_discussion_thread_for_june_15_2021/h1tzi7u/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623780722.0
    },
    {
        "author": "capitanDracaris",
        "body": "I think not his tower but the towers next to the salesforce. Tall ass fancy apartment building. Used to deliver food there the worst tipper ever",
        "created_utc": 1623136601,
        "id": "h108lye",
        "permalink": "/r/StockMarket/comments/nussvj/work_from_home_salesforce_ceo_benioff_disagrees/h108lye/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1623165401.0
    },
    {
        "author": "tta2013",
        "body": "Went thru a few months worth of articles the past few weeks to decide whether I want to go in on Salesforce, SQ.\n\nGoing in on the Salesforce first and going long. I might go into SQ next.\n\nOh and Solar energy ETFs. I'm making a list.",
        "created_utc": 1623332883,
        "id": "h1a2ecu",
        "permalink": "/r/stocks/comments/nwjei1/rstocks_daily_discussion_options_trading_thursday/h1a2ecu/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1623361683.0
    },
    {
        "author": "schildog9",
        "body": "I'm long CRM. Does it take off post Slack acquisition?",
        "created_utc": 1624328346,
        "id": "h2lwowk",
        "permalink": "/r/investing/comments/o4qyop/daily_general_discussion_and_spitballin_thread/h2lwowk/",
        "score": 2,
        "subreddit": "investing",
        "created": 1624357146.0
    },
    {
        "author": "jsntx",
        "body": "I know what you mean. I'm still trusting my DD on CRM, but it's painful to see it attempting to take off and then pull back.",
        "created_utc": 1624513463,
        "id": "h2utylb",
        "permalink": "/r/wallstreetbets/comments/o6kpha/what_are_your_moves_tomorrow_june_24_2021/h2utylb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624542263.0
    },
    {
        "author": "donny1231992",
        "body": "Seems like not the play. Nke puts at open seem like the play. But it could go either way. I remember CRM gapped up after earnings report but then next day it still finished strong green. Sometimes a stock sells off after a gap up after earnings probably profit taking. It’s a gamble",
        "created_utc": 1624592791,
        "id": "h2yhobj",
        "permalink": "/r/wallstreetbets/comments/o78qyx/what_are_your_moves_tomorrow_june_25_2021/h2yhobj/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624621591.0
    },
    {
        "author": "gordonlabs",
        "body": "I’m sorta interested MNDY because Salesforce is interested in them.  I already bought last week at 205 and sold at 230.  Then bought yesterday 2:59 and sold eod for 3%.  Wondering if I should stay on them ?",
        "created_utc": 1624428929,
        "id": "h2qolcl",
        "permalink": "/r/wallstreetbets/comments/o5vul4/what_are_your_moves_tomorrow_june_23_2021/h2qolcl/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624457729.0
    },
    {
        "author": "jsntx",
        "body": "My moves, stay on CRM &amp; FUBO calls. Get some MNMD 7/16 5c. Avoid memes.",
        "created_utc": 1623718731,
        "id": "h1sp65z",
        "permalink": "/r/wallstreetbets/comments/nzvijb/what_are_your_moves_tomorrow_june_15_2021/h1sp65z/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623747531.0
    },
    {
        "author": "pdieff",
        "body": "WHO, HOW &amp; WHEN TO SHORT \n\nIf like me you think we’ll get a pull back but also see the Puts on the SPY are very expensive consider Puts on the higher quality tech stocks which have mooned lately;\n\nFB, MSFT, EBAY, ROP, CRM, INTU, DOCU etc Puts are way cheaper with much lower IV.  On top of that and as a hedge in case it keeps pumping the Calls in the SPY are actually very cheap vs the Puts.",
        "created_utc": 1625058940,
        "id": "h3k23h3",
        "permalink": "/r/wallstreetbets/comments/oau3cr/daily_discussion_thread_for_june_30_2021/h3k23h3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625087740.0
    },
    {
        "author": "Jeff_APXT",
        "body": "This is one of the most frequent questions we got during our PIPE roadshows and your answer is basically correct—it is far more effective to work with partners.\r  \n\r  \nMicrosoft has the biggest partner ecosystem in the industry. It has hundreds of thousands of partners across their various lines of business. Microsoft is very good at establishing a platform and relies on partners to complement and extend their offerings. \n\n\r  \nAvePoint is very good at inventing *with* Microsoft instead of inventing *versus* Microsoft. AvePoint sits on multiple Microsoft product councils, has 3 Microsoft Regional Directors on staff (a special designation Microsoft reserves for the most trusted 200 or so third-party voices on their solutions), and works closely with Microsoft to understand their development roadmap so our investments extend what Microsoft is doing and planning to do vs duplicating. \n\n\r  \nMicrosoft and every big cloud collaboration platform depend on a strong partner ecosystem. It’s very difficult to build a solution that meets the needs and use cases of every single type of organization and hundreds of millions of users while remaining simple and easy to use. Their business model is predicated on building solutions that cover 80 percent and having their partner ecosystem build the last mile. Again, that is how AvePoint has grown for 20 years.\n\n\r  \nAdditionally, AvePoint is investing in more vertical solutions like EduTech as well as additional collaboration platforms like Salesforce and Google Workspace. The AvePoint solution portfolio is very deep and broad. TJ talks a bit about the innovation process in this blog post: [https://www.avepoint.com/blog/tj-blog/avepoint-road-to-nasdaq/](https://www.avepoint.com/blog/tj-blog/avepoint-road-to-nasdaq/)",
        "created_utc": 1624666354,
        "id": "h31zyvb",
        "permalink": "/r/SPACs/comments/o6dz0y/ama9_apxt_apex_technology_acquisition_corp_with/h31zyvb/",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1624695154.0
    },
    {
        "author": "tendiesorrope",
        "body": "CRM is throbbing, cocked, and loaded",
        "created_utc": 1622545049,
        "id": "h06hnlp",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h06hnlp/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622573849.0
    },
    {
        "author": "ProfiledByMC",
        "body": "decent call on CRM [https://www.markovchained.com/profiles/view/reddit:Hani95](https://www.markovchained.com/profiles/view/reddit:Hani95)",
        "created_utc": 1623173838,
        "id": "h11wyng",
        "permalink": "/r/wallstreetbets/comments/nv9hbb/cannae_the_bill_foley_company_thats_literally/h11wyng/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623202638.0
    },
    {
        "author": "LivingTheHighLife",
        "body": "Hubspot (HUBS) the fancy man’s salesforce",
        "created_utc": 1622761967,
        "id": "h0i0y1l",
        "permalink": "/r/wallstreetbets/comments/nrmh2t/what_are_your_moves_tomorrow_june_04_2021/h0i0y1l/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622790767.0
    },
    {
        "author": "Tom_Inv",
        "body": "CRM, MSFT, QCOM (for Dividends)",
        "created_utc": 1624371634,
        "id": "h2nk7lc",
        "permalink": "/r/StockMarket/comments/o5msvv/buy_stocks_that_you_would_keep_forever_what_are/h2nk7lc/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1624400434.0
    },
    {
        "author": "zephyy",
        "body": "Anyone holding or looking at $DOCN and $HUBS?\n\nI use both and think they have great products, looking at my $CRM shares stagnating while $HUBS has blown up, but it also feels too high for me. Then again, I felt that way about NVDA at $400 a share.",
        "created_utc": 1624642898,
        "id": "h30oh7c",
        "permalink": "/r/stocks/comments/o7kagi/rstocks_daily_discussion_fundamentals_friday_jun/h30oh7c/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1624671698.0
    },
    {
        "author": "SpliTTMark",
        "body": "I kept buy the dip and I only had enough to buy 1 share of stocks at their lows\n\nI got 1 share of dkng at 41 I got sunrun at 39 I got twlo at 310 sq at 195 and Salesforce at 207",
        "created_utc": 1623970299,
        "id": "h25ad0e",
        "permalink": "/r/stocks/comments/o212za/cant_win_for_losing/h25ad0e/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1623999099.0
    },
    {
        "author": "PhotographDangerous5",
        "body": "Sold my CRM calls, holding 7/2 TWTR 61c and 7/2 MSFT 260c will most likely buy ZIM and PRPL with profit",
        "created_utc": 1623942405,
        "id": "h23i6g7",
        "permalink": "/r/wallstreetbets/comments/o1tjzv/daily_discussion_thread_for_june_17_2021/h23i6g7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623971205.0
    },
    {
        "author": "RareRationalFan",
        "body": "Which of these plays should I exit now (to buy back in 2-6 weeks)?\n\nAAPL, BABA, CRM, NIO, TSM",
        "created_utc": 1623183068,
        "id": "h12is5d",
        "permalink": "/r/wallstreetbets/comments/nvcwpz/what_are_your_moves_tomorrow_june_09_2021/h12is5d/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623211868.0
    },
    {
        "author": "handbookforgangsters",
        "body": "CRM - Salesforce",
        "created_utc": 1623455995,
        "id": "h1gozad",
        "permalink": "/r/stocks/comments/ng2d39/next_set_of_trillion_dollar_companies/h1gozad/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1623484795.0
    },
    {
        "author": "jeanneLstarr",
        "body": "SOFI.   ILMN.  CScO.  CRM",
        "created_utc": 1622599595,
        "id": "h09kq2t",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h09kq2t/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622628395.0
    },
    {
        "author": "norCsoC",
        "body": "Any option here on CRM Salesforce? \n\nApple 2.2 trillion evaluation has had its stagnation. Only positive news that increase price was the EV news. Otherwise, it’s dropped since that and even after incredible quarterly earnings.",
        "created_utc": 1622878972,
        "id": "h0nwldn",
        "permalink": "/r/stocks/comments/nsm4rj/reduce_aapl_from_10_to_5_up_my_msft_to_10_or_add/h0nwldn/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1622907772.0
    },
    {
        "author": "lattiboy",
        "body": "Fed is going to surprise with more hawkish stance on survey and begin tapering talks much faster. Would decimate high P/E stuff. I have puts on FB, MSFT, and CRM as well as a lot of VIX calls. \n\nIf I’m wrong I’m out a bit of money, but if I’m right it’ll be a bonanza. Straight gambling!",
        "created_utc": 1623861626,
        "id": "h1zi2a4",
        "permalink": "/r/stocks/comments/o10vqy/rstocks_daily_discussion_wednesday_jun_16_2021/h1zi2a4/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1623890426.0
    },
    {
        "author": "codemonkey14",
        "body": "My only positions are CRM and RBLX, with about 75% cash. I’m truly retarded",
        "created_utc": 1624506880,
        "id": "h2ukfbo",
        "permalink": "/r/wallstreetbets/comments/o6kpha/what_are_your_moves_tomorrow_june_24_2021/h2ukfbo/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624535680.0
    },
    {
        "author": "Chance-Progress-7356",
        "body": "If it wasn't for the IP licensing freeze, the revenues for the quarter would have been 200-225 million. Snowflakes did 228 million and they are 70 billion market cap\n\nBlackberry did 207 m just in Cybersecurity revenues. And it's the start they just integrated product line and they are hiring 23% more salesforce.",
        "created_utc": 1624733431,
        "id": "h34sqej",
        "permalink": "/r/wallstreetbets/comments/o7agdl/bb_earnings_are_out_conference_call_following_who/h34sqej/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624762231.0
    },
    {
        "author": "j-dawg1998",
        "body": "long crm for sure",
        "created_utc": 1622891023,
        "id": "h0oa1k1",
        "permalink": "/r/stocks/comments/nsm4rj/reduce_aapl_from_10_to_5_up_my_msft_to_10_or_add/h0oa1k1/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622919823.0
    },
    {
        "author": "TomatoCapt",
        "body": "Two good subscription model plays (ie nice recurring revenue):\n\nFive9 - stealing market share from old incumbents in the contract centre software space. 45% revenue growth last quarter. \n\nVeeva - life sciences CRM.  Fantastic financials.",
        "created_utc": 1622757497,
        "id": "h0hrfl5",
        "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/h0hrfl5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622786297.0
    },
    {
        "author": "baconography",
        "body": "I just can't trust CRM after many times getting sucked in. There's something wrong with CRM.",
        "created_utc": 1622575993,
        "id": "h088kt6",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h088kt6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622604793.0
    },
    {
        "author": "PitaPatternedPants",
        "body": "What was it called. I’ve used Hubspot, CRM Dynamics, and Salesforce. Salesforce is the best.",
        "created_utc": 1622557767,
        "id": "h073c2a",
        "permalink": "/r/stocks/comments/nmgwfh/salesforce_growth_accelerates_as_company_offers/h073c2a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622586567.0
    },
    {
        "author": "laramidian",
        "body": "who cares? it's owned by CRM now",
        "created_utc": 1622573547,
        "id": "h0836f0",
        "permalink": "/r/options/comments/nnmf4f/most_anticipated_earnings_releases_for_the_week/h0836f0/",
        "score": 1,
        "subreddit": "options",
        "created": 1622602347.0
    },
    {
        "author": "jsntx",
        "body": "Tomorrow sticking with CRM. No idea why it jumped and dumped early in the day.",
        "created_utc": 1623189504,
        "id": "h12x6qu",
        "permalink": "/r/wallstreetbets/comments/nvcwpz/what_are_your_moves_tomorrow_june_09_2021/h12x6qu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623218304.0
    },
    {
        "author": "kindler35",
        "body": "I work in marketing a fucking hate SalesForce. It is one of the most obnoxious CRMs I've ever had the displeasure to use. Overpriced trash that you wind up needing to hire people to manage properly. HubSpot's CRM-only offering is like 1/5th the price and has way better usability at any scale.\n\nBut yeah, they're really good at buying companies that are better than their core software. Slack is a really strong buy for them, and I don't get why it triggered a sell-off, even though Slack's new logo is clearly a swastika (look at it. Really look at the logo). \n\nBetter at business than they are at making stuff. So it's probably not a bad buy.",
        "created_utc": 1623961686,
        "id": "h24rqct",
        "permalink": "/r/wallstreetbets/comments/o1zllb/salesforce_crm_is_a_great_investment_right_now_dd/h24rqct/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623990486.0
    },
    {
        "author": "rockwellave",
        "body": "annual rate of return? inflation? wtf are you talking about. lol neither has anything to do with CRM stock performance",
        "created_utc": 1624146048,
        "id": "h2dhzz7",
        "permalink": "/r/stocks/comments/m4meb2/what_are_your_thoughts_on_salesforce_crm/h2dhzz7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624174848.0
    },
    {
        "author": "rockwellave",
        "body": "I manage other people's money for a living, and have traded the markets for two decades. Yes I can be arrogant to fools like you that joins reddit because you heard of meme stocks. \n\nso explain to me how inflation has anything to do with CRM? \n\nI'll wait...",
        "created_utc": 1624146864,
        "id": "h2dje93",
        "permalink": "/r/stocks/comments/m4meb2/what_are_your_thoughts_on_salesforce_crm/h2dje93/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624175664.0
    },
    {
        "author": "rockwellave",
        "body": "so you have no explanation on inflation and crm? how you manage to connect the two? lol",
        "created_utc": 1624147486,
        "id": "h2dkgkf",
        "permalink": "/r/stocks/comments/m4meb2/what_are_your_thoughts_on_salesforce_crm/h2dkgkf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624176286.0
    },
    {
        "author": "shabbatshalom44",
        "body": "Let’s play a fun little game. Since you’re so prescient, why don’t you take A cool million and open up a short position on salesforce. Then you can come back to me when it’s reverted to its mean and show me that you absolutely knew.",
        "created_utc": 1624149165,
        "id": "h2dnbrs",
        "permalink": "/r/stocks/comments/m4meb2/what_are_your_thoughts_on_salesforce_crm/h2dnbrs/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624177965.0
    },
    {
        "author": "rockwellave",
        "body": "moving the goal post? lol Dec 1 crm was at 245. today is at 242.\n\nthat's literally dead money since.",
        "created_utc": 1624148541,
        "id": "h2dm98t",
        "permalink": "/r/stocks/comments/m4meb2/what_are_your_thoughts_on_salesforce_crm/h2dm98t/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624177341.0
    },
    {
        "author": "HbRipper",
        "body": "Salesforce, I own some now and looking to add to my position",
        "created_utc": 1624223343,
        "id": "h2gvjfe",
        "permalink": "/r/StockMarket/comments/o4bvag/would_you_buy_any_of_these_for_the_long_term/h2gvjfe/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1624252143.0
    },
    {
        "author": "shabbatshalom44",
        "body": "Not to mention, this response displays your utter inability to partake in any sort of fundamental critical thinking. At no point was this argument about how well salesforce is doing. It was about the facts. I’m not sure whether you realize this, or whether you actually in your mind don’t even know when you’re moving the goalposts. I also don’t know which is worse.\n\n🤡",
        "created_utc": 1624149523,
        "id": "h2dnyln",
        "permalink": "/r/stocks/comments/m4meb2/what_are_your_thoughts_on_salesforce_crm/h2dnyln/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624178323.0
    },
    {
        "author": "Puzzleheaded_Mix_386",
        "body": "REIT's (BXMT), Insurance  (PRU), Quality tech (AMZN, AAPL, CRM)",
        "created_utc": 1624457398,
        "id": "h2rpkzn",
        "permalink": "/r/stocks/comments/o642ov/whats_your_industry_and_which_stocks_in_that/h2rpkzn/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624486198.0
    },
    {
        "author": "lattiboy",
        "body": "I should add that I’m investing actual money in this thinking, not just pontificating for fun. \n\nBesides my VIX calls I have August calls in CLF, BA, SPG, KO, F, PLAY, GPS, and KO. \n\nI also have a watch list of the companies I’m not buying, but may regret: DOCU, ADBE, APPS, FB, CRM\n\nWe’ll see soon enough!",
        "created_utc": 1624408435,
        "id": "h2pq1gu",
        "permalink": "/r/stocks/comments/o5iyhf/rstocks_daily_discussion_technicals_tuesday_jun/h2pq1gu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624437235.0
    },
    {
        "author": "DLew13",
        "body": "Yeah I’m pretty sure that’s NOT what he meant. Would like some clarification from u/zjz though. How stupid would it be if we only discuss memes? Like I can’t bring up CRM Salesforce or DOCU Docusign for example, that’s retarded. Any stock that falls under the rules should be welcomed.",
        "created_utc": 1624052205,
        "id": "h299nup",
        "permalink": "/r/wallstreetbets/comments/o2lk48/daily_discussion_thread_for_june_18_2021/h299nup/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624081005.0
    },
    {
        "author": "rockwellave",
        "body": "since crm announced the slack acquisition Dec 2020, the stock has gone sideways - learn to read a chart mate.",
        "created_utc": 1624107869,
        "id": "h2bizk8",
        "permalink": "/r/stocks/comments/m4meb2/what_are_your_thoughts_on_salesforce_crm/h2bizk8/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624136669.0
    },
    {
        "author": "rockwellave",
        "body": "here's the chart of crm since slack acquisition.... this is what traders call consolidation, and a trading range or sideways... \n\nhttps://www.reddit.com/user/rockwellave/comments/o3folv/crm/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf",
        "created_utc": 1624108133,
        "id": "h2bjf6y",
        "permalink": "/r/stocks/comments/m4meb2/what_are_your_thoughts_on_salesforce_crm/h2bjf6y/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624136933.0
    },
    {
        "author": "baconography",
        "body": "But it seems like Benioff can't even fool boomer CNBCers after multiple appearances to buy the stock after vastly overpaying for Slack.\n\nSalesforce was in the top 3 best-looking tech stocks for a few months, but now their debt load post-Slack acquisition has him starting to BS his way into being the next WeWork.",
        "created_utc": 1622572007,
        "id": "h07zm9c",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h07zm9c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622600807.0
    },
    {
        "author": "gaymeStonk",
        "body": "CRM has continued to be a STONG buy but has underperformed for a long while now. They just had earnings and not only were they good future outlook looks phenomenal. And given that it has finally broken out on the falling wedge.\n\nFull disclosure: I do hold a good amount of CRM",
        "created_utc": 1622571678,
        "id": "h07yv6f",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h07yv6f/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622600478.0
    },
    {
        "author": "Rare-Interview-8657",
        "body": "So you like CRM got it... lol",
        "created_utc": 1622577821,
        "id": "h08cksc",
        "permalink": "/r/wallstreetbets/comments/npso9s/amc_sells_85_million_shares/h08cksc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622606621.0
    },
    {
        "author": "rainman_104",
        "body": "Yep agreed.   It can just as easily end up like slack where those who bought on IPO date broke even after Salesforce acquired them.   \n\nI think Spotify is king of the hill though, and with streaming music there is a moat too.   It's not like anyone can start up a streaming service.   Those contracts don't magically land on you.",
        "created_utc": 1623115215,
        "id": "h0zatl2",
        "permalink": "/r/investing/comments/nu3wrs/should_spotify_be_given_a_spot_in_a_stock/h0zatl2/",
        "score": 1,
        "subreddit": "investing",
        "created": 1623144015.0
    },
    {
        "author": "stevoacp1",
        "body": "CRM 10/15 $270c. been consolidating for months. time to go to ATHs",
        "created_utc": 1623941326,
        "id": "h23fa4w",
        "permalink": "/r/wallstreetbets/comments/o1tjzv/daily_discussion_thread_for_june_17_2021/h23fa4w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623970126.0
    },
    {
        "author": "jsntx",
        "body": "&gt;Life is a game. Find the games you like to play. \n\n15x CRM 7/16 250c",
        "created_utc": 1624579326,
        "id": "h2xt4vx",
        "permalink": "/r/wallstreetbets/comments/o78qyx/what_are_your_moves_tomorrow_june_25_2021/h2xt4vx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624608126.0
    },
    {
        "author": "stevoacp1",
        "body": "BABA 10/15 $240c, BIDU 9/17 $210c, AMD 9/21 $90c, and CRM 10/15 280c. see you guys in a couple months",
        "created_utc": 1624563150,
        "id": "h2x4uuf",
        "permalink": "/r/wallstreetbets/comments/o6xtau/daily_discussion_thread_for_june_24_2021/h2x4uuf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624591950.0
    },
    {
        "author": "rockwellave",
        "body": "no I'm not Warren, I'm not as old as him but I've started my own firm.\n\nso what's inflation got to do with CRM since you brought it up.\n\nI'm waiting",
        "created_utc": 1624147578,
        "id": "h2dkmes",
        "permalink": "/r/stocks/comments/m4meb2/what_are_your_thoughts_on_salesforce_crm/h2dkmes/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624176378.0
    },
    {
        "author": "rockwellave",
        "body": "so annual return is 8% after inflation... what's that got to do with CRM?",
        "created_utc": 1624147763,
        "id": "h2dkxnz",
        "permalink": "/r/stocks/comments/m4meb2/what_are_your_thoughts_on_salesforce_crm/h2dkxnz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624176563.0
    },
    {
        "author": "shabbatshalom44",
        "body": "So CRM gets whales with way bigger margins? 🤔",
        "created_utc": 1624070801,
        "id": "h2a7txz",
        "permalink": "/r/stocks/comments/m4meb2/what_are_your_thoughts_on_salesforce_crm/h2a7txz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624099601.0
    },
    {
        "author": "Pressure_Test",
        "body": "My answer to **FAANG** is  **ZESCAPASCA**  (ZILLOW\tENPH\tSQ\tCVNA\tAMAZN\tPYPL\tADOBE\tSHOP\tCRM\tAMD)",
        "created_utc": 1623949380,
        "id": "h23yjsi",
        "permalink": "/r/wallstreetbets/comments/nqi9f6/daily_discussion_thread_for_june_02_2021/h23yjsi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623978180.0
    },
    {
        "author": "Dot1red",
        "body": "Salesforce to sell $8 B of bonds",
        "created_utc": 1624995972,
        "id": "h3h5y3w",
        "permalink": "/r/wallstreetbets/comments/oa56ol/daily_discussion_thread_for_june_29_2021/h3h5y3w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625024772.0
    },
    {
        "author": "wannabemustang",
        "body": "20 years old, Portfolio review\n\nI wanted to get opinions from strangers on the internet about my holdings. I am 20 years old and currently attending university. Additionally I am an E4 in the NG and employed part time at a grocery chain earning $15 hourly. I live at home still but plan to move back up to university next year.\n\nRETIREMENT: I deployed with my National Guard unit and put a bit of money towards my TSP. The TSP is nice because of the contribution matching and the fact that I never notice the missing money. Last I checked I have about 11k of value inside it with $900(?) from employer contributions. I’m back on drill status and putting 60% of my drill paychecks toward it. This is approximately $200 monthly with more from Annual training. In addition to this I started a ROTH IRA in 2020 while deployed and have $4,200 inside that. I have to put another $5k in it for FY2021 to max it out, which is top priority now.\n\nPORTFOLIO: Current value: 34.5k, 2.8k in unrealized gains. Pays 2.4k annually in dividends. I realize this is close to “yield chasing” and that I should aim to focus more on value. A year ago I had approximately 15k invested in F which wasn’t the smartest decision but I sold at 50% gains which net me a lot more money. I still hold about 1.5k in F. Larger positions I hold are T, ABBV, CRT, TWO, WBA, GSDB, DAL, NVDA, HUBS, CRM, These make up 15k. ETFs/Funds I hold are QYLD, RYLD, PDI, VNQ, and SWYJX. These make up 18.5k.\n\nAs far as my goals go I would like to hit 50k in net assets in my Schwab account. To do this I need to save another 10k. I am aiming to hit it by 2022 which is ambitious I know. It’s mostly a test to see how extreme I can get with saving and selling off stuff to downsize. If the market goes red of course it’s not going to be possible. If I can get close to 50k I am satisfied. I need to max out my ROTH IRA for the year and focus on more quality value stocks inside my portfolio. I realize that I am well “ahead” of my peers financially for this I have my deployment money, part time job, and some gift money to thank.",
        "created_utc": 1623514778,
        "id": "h1j1a6b",
        "permalink": "/r/investing/comments/ny2h96/daily_advice_thread_all_basic_help_or_advice/h1j1a6b/",
        "score": 1,
        "subreddit": "investing",
        "created": 1623543578.0
    },
    {
        "author": "njm204",
        "body": "ENPH",
        "created_utc": 1623032288,
        "id": "h0v4pmw",
        "permalink": "/r/stocks/comments/ntwior/solar_panel_stock/h0v4pmw/",
        "score": 87,
        "subreddit": "stocks",
        "created": 1623061088.0
    },
    {
        "author": "Powerful_Stick_1449",
        "body": "EnPhase and STEM are great renewable picks with ENPH making the inverters for these panels. I think on the battery front, EOS Energy has potential if they can ramp of commercialization of their batteries. They are much better suited for grid storage than lithium ion batteries.",
        "created_utc": 1623035682,
        "id": "h0vaxaq",
        "permalink": "/r/stocks/comments/ntwior/solar_panel_stock/h0vaxaq/",
        "score": 42,
        "subreddit": "stocks",
        "created": 1623064482.0
    },
    {
        "author": "IBCrazy17",
        "body": "Enphase, ENPH, and first solar FSLR are both good options as well. Enphase is making the inverters that go with solar panels, but tends to be a bit less volatile than the solar panel producers themselves in my limited experience.",
        "created_utc": 1623031894,
        "id": "h0v3zil",
        "permalink": "/r/stocks/comments/ntwior/solar_panel_stock/h0v3zil/",
        "score": 29,
        "subreddit": "stocks",
        "created": 1623060694.0
    },
    {
        "author": "RetardedInRetrospect",
        "body": "Gambled my stimmy on APPS and ENPH calls. Lost nearly all of it. I need CLNE to pull me back to even 🙏",
        "created_utc": 1623069892,
        "id": "h0wijkj",
        "permalink": "/r/wallstreetbets/comments/nu8oaz/daily_discussion_thread_for_june_07_2021/h0wijkj/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1623098692.0
    },
    {
        "author": "deGoblin",
        "body": "I love ENPH, they have so much potential. But it's uncomfortable seeing it the go-to solar stock.",
        "created_utc": 1623051020,
        "id": "h0vw8x1",
        "permalink": "/r/stocks/comments/ntwior/solar_panel_stock/h0vw8x1/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1623079820.0
    },
    {
        "author": "caseylolz",
        "body": "Enph and RUN are great IMO. The sunrun deal with Ford to install the home backup system for the lightning truck will be cool. Their assets and market leadership will only grow",
        "created_utc": 1623036967,
        "id": "h0vd3dq",
        "permalink": "/r/stocks/comments/ntwior/solar_panel_stock/h0vd3dq/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1623065767.0
    },
    {
        "author": "stocknudes",
        "body": "enph",
        "created_utc": 1623038739,
        "id": "h0vg27d",
        "permalink": "/r/stocks/comments/ntwior/solar_panel_stock/h0vg27d/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1623067539.0
    },
    {
        "author": "thelandonblock",
        "body": "ENPH, JPM, and sometimes COIN but I know coinbase will dip below $200 or even lower soon.",
        "created_utc": 1623092259,
        "id": "h0xwr52",
        "permalink": "/r/stocks/comments/nu88z0/rstocks_daily_discussion_monday_jun_07_2021/h0xwr52/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1623121059.0
    },
    {
        "author": "hiroshero",
        "body": "My current long holds, in my own so called etf.\n\n* PSFE\n* SoFi\n* PLTR\n* AAPL\n* AMD\n* NET\n* MSFT\n* CAT\n* ENPH\n* CRWD\n* COST\n* SQ\n* SBUX\n* NKE\n* V\n* DKNG\n\nThoughts?",
        "created_utc": 1622785168,
        "id": "h0j9pva",
        "permalink": "/r/stocks/comments/nppkp4/rate_my_portfolio_rstocks_quarterly_thread_june/h0j9pva/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1622813968.0
    },
    {
        "author": "CCCK24",
        "body": "I'll give you an example of what can go wrong when selling covered calls; earlier this year I was loaded to the tits on ENPH, APPS, DQ, SQ, MARA, and RIOT and I sold calls on all of them. Well anyway they corrected and the premiums did not cover my losses and to make matters worse I lost money buying back the calls to stop losses. So I lost money on the stocks and calls.",
        "created_utc": 1623085487,
        "id": "h0xgnhc",
        "permalink": "/r/smallstreetbets/comments/nuax1s/why_not_always_sell_cc_when_selling/h0xgnhc/",
        "score": 6,
        "subreddit": "smallstreetbets",
        "created": 1623114287.0
    },
    {
        "author": "andersennavy",
        "body": "I feel like ENPH is so overvalued now with their high PE ratio 😕",
        "created_utc": 1623037402,
        "id": "h0vdua4",
        "permalink": "/r/stocks/comments/ntwior/solar_panel_stock/h0vdua4/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1623066202.0
    },
    {
        "author": "Inferdo12",
        "body": "I have stock in ENPH, and looking to buy into JinkoSolar. Jinko is the largest solar panel manufacture in the world, Enohase makes Micro inverters for solar panels. Gonna hold long term",
        "created_utc": 1623036025,
        "id": "h0vbi62",
        "permalink": "/r/stocks/comments/ntwior/solar_panel_stock/h0vbi62/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1623064825.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "Ok 30 min call to open.... Here's what I would buy today.....\n\nENPH\n\nCCL\n\nAMC\n\nVLO\n\nMGM\n\nRTX\n\nHere's what I Would sell today:\n\nRKT\n\nTAP\n\nLE\n\nSNDL\n\nDIS",
        "created_utc": 1623071128,
        "id": "h0wkpm2",
        "permalink": "/r/wallstreetbets/comments/nu8oaz/daily_discussion_thread_for_june_07_2021/h0wkpm2/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623099928.0
    },
    {
        "author": "restlessleg",
        "body": "im down with tribe called CLNE\n\nwhales might have cashed out on its sudden influx, but retailers should be hoppin on them shares like flies. ENPH, PLUG, FSLR all great companies too and will be golden come next year. fossil fuels are toxic mules",
        "created_utc": 1623414269,
        "id": "h1e8ki4",
        "permalink": "/r/wallstreetbets/comments/nxcaz5/daily_discussion_thread_for_june_11_2021/h1e8ki4/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1623443069.0
    },
    {
        "author": "Fuck_CCIV",
        "body": "As someone that works in the industry, ENPH and SEDG are absolutely NOT the plays. The sector within solar with the most insane growth right now is utility scale solar farms, and the two listed above don’t even play in that sector.\n\nI’d recommend FSLR, NÉE, and ARRY.",
        "created_utc": 1623084640,
        "id": "h0xelf5",
        "permalink": "/r/stocks/comments/ntwior/solar_panel_stock/h0xelf5/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1623113440.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "ENPH Rocket ship taking off now..... ALL ABOARD!!!",
        "created_utc": 1623087965,
        "id": "h0xmlju",
        "permalink": "/r/wallstreetbets/comments/nu8oaz/daily_discussion_thread_for_june_07_2021/h0xmlju/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623116765.0
    },
    {
        "author": "IBCrazy17",
        "body": "TSLA, ENPH, FSLR, Vestas Wind, Solar Edge are all sustainable focused companies. If you want to diversify Microsoft has also pledged to go carbon negative in the near future.",
        "created_utc": 1623161023,
        "id": "h112pp2",
        "permalink": "/r/stocks/comments/nv1ni0/stocks_for_our_future/h112pp2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1623189823.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "CLOV, ENPH, MGM, WEN",
        "created_utc": 1623162168,
        "id": "h115b0q",
        "permalink": "/r/wallstreetbets/comments/nv1518/daily_discussion_thread_for_june_08_2021/h115b0q/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623190968.0
    },
    {
        "author": "NotChristina",
        "body": "Sold off some $ENPH (been holding since $29) to fund some $23 $CLF 8/20 calls. Picked up $20 SOFI 8/20 call on Friday too. I don't know why my $TWNK $15 is up 130% today but I ain't complaining.",
        "created_utc": 1623246416,
        "id": "h15hnfg",
        "permalink": "/r/wallstreetbets/comments/nvs38y/daily_discussion_thread_for_june_09_2021/h15hnfg/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623275216.0
    },
    {
        "author": "thelandonblock",
        "body": "My clean energy investors: how do you feel about STEM and ENPH? Is ENPH a good company to pair with NEE to invest in the future of clean energy?",
        "created_utc": 1623095497,
        "id": "h0y4e3d",
        "permalink": "/r/wallstreetbets/comments/nu8oaz/daily_discussion_thread_for_june_07_2021/h0y4e3d/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623124297.0
    },
    {
        "author": "soi_boiiiiiiiiiiii",
        "body": "Looking for honest and constructive criticism for my portfolio, as I feel there is something wrong with it. Pls can somebody tell me what they would add or remove?\n\nIn order of size:\n\nDIS / BRK.B / MSFT / AAPL / SQ / AMZN\n\nSE / BTC / BABA / JD / V / NKE\n\nTSM / HD\n\nDAL / NKLA / NCLH / DKNG / ENPH / TSLA /CRSR",
        "created_utc": 1623341885,
        "id": "h1anq6e",
        "permalink": "/r/stocks/comments/nppkp4/rate_my_portfolio_rstocks_quarterly_thread_june/h1anq6e/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1623370685.0
    },
    {
        "author": "Thetrader2896",
        "body": "I am a loser who has only his account attach to enph 190 leaps 2023. Did u play amc",
        "created_utc": 1622675567,
        "id": "h0dh5s2",
        "permalink": "/r/wallstreetbets/comments/mcn0xt/im_a_college_student_went_in_with_what_i_could/h0dh5s2/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622704367.0
    },
    {
        "author": "Summebride",
        "body": "The tech is non-proprietary coil switching, and others seem to be equally developed.  But more importantly its claim of offering effectively two gear ratios for an electric motor has an obvious unanswered risk: do EV's even need or care about that?  Electric motor already have excellent and versatile torque curves, so will they even feel the need to but something with such an incrementally small advantage?  \n\nFor solar I like STEM and ENPH.  Not sure how they compare to SIRC.  I'm with you, that mass scale adoption of solar roof and storage for North America is imminent.  Our grid can't support one tenth of the EV's we're claiming we want, so self generation will be essential.",
        "created_utc": 1622803151,
        "id": "h0jvgbn",
        "permalink": "/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/h0jvgbn/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1622831951.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "WEN, ENPH, MGM,",
        "created_utc": 1623162192,
        "id": "h115d11",
        "permalink": "/r/wallstreetbets/comments/nv1518/daily_discussion_thread_for_june_08_2021/h115d11/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623190992.0
    },
    {
        "author": "on-the-gang",
        "body": "Buy ENPH now",
        "created_utc": 1623081937,
        "id": "h0x851g",
        "permalink": "/r/wallstreetbets/comments/nu8oaz/daily_discussion_thread_for_june_07_2021/h0x851g/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623110737.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "Enphase is in high demand with the production of semiconductors. Intc gets theirs from Taiwan, ENPH doesn't. I'm trying to help everyone here make some good money but people aren't listening. Instead they want to go all in on meme stocks and then bitch for the next 3 days after..... Buy ENPH and MGM both are going to sky rocket over summer.",
        "created_utc": 1623073175,
        "id": "h0wojxx",
        "permalink": "/r/wallstreetbets/comments/nu8oaz/daily_discussion_thread_for_june_07_2021/h0wojxx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623101975.0
    },
    {
        "author": "MyPoopWontComeOut",
        "body": "ENPH is finally trying to come back to its true value. Get in now for long term gains.",
        "created_utc": 1623159627,
        "id": "h10zkmm",
        "permalink": "/r/wallstreetbets/comments/nv1518/daily_discussion_thread_for_june_08_2021/h10zkmm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623188427.0
    },
    {
        "author": "Ensemble_InABox",
        "body": "I love ENPH. Won’t comment on your question but ENPH is the best play in the alternative energy space. Margins are top notch, product road map is top notch, C team are excellent, and the space is growing.\n\nIt got super richly valued at the start of the year because people thought climate change was a big priority for Biden.",
        "created_utc": 1622575424,
        "id": "h087cx4",
        "permalink": "/r/investing/comments/nnehmw/enph_but_maybe_ill_sell_for/h087cx4/",
        "score": 2,
        "subreddit": "investing",
        "created": 1622604224.0
    },
    {
        "author": "thereisnospooongeek",
        "body": "ENPH- They have the best product in the market. Period. Don't believe me, Have a chat with the Solar installers in your region!",
        "created_utc": 1623059298,
        "id": "h0w4qiv",
        "permalink": "/r/stocks/comments/ntwior/solar_panel_stock/h0w4qiv/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1623088098.0
    },
    {
        "author": "Ill-Albatross-8963",
        "body": "I moved out of my position, ENPH was great... Micro invertors that compensate for shade and last 2-2.5X as long as typical inverters.  Great stuff with a bit of a bite at initial cost.  Otherwise panels are approaching an inflection point with regards to increased efficiency and it's a bit of a crap shoot with next gen tech.  Will be very largely dependent on subsidy which, should lift all ships \n\nStill a fan of ENPH just not at current prices... To much future built into the price for a long term hold for me\n\nI don't know enough about the battery tech but that's where the growers will be, vandium flow redox, lith iron etc Batts for back up...\n\nWill look at a few others have posted here for gems, but batteries is where the action will be in my opinion, which may or may not be worth much hah",
        "created_utc": 1623088395,
        "id": "h0xnn0n",
        "permalink": "/r/stocks/comments/ntwior/solar_panel_stock/h0xnn0n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1623117195.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "Man..... ENPH really needs some love right now.....",
        "created_utc": 1622739105,
        "id": "h0gjnvn",
        "permalink": "/r/wallstreetbets/comments/nr9r9t/daily_discussion_thread_for_june_03_2021/h0gjnvn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622767905.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "Buy XOM, ENPH - Thank me later....",
        "created_utc": 1622575456,
        "id": "h087fev",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h087fev/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622604256.0
    },
    {
        "author": "GenderFluidBull",
        "body": "I’m bag holding ENPH plz come back for me 😂",
        "created_utc": 1623071181,
        "id": "h0wkt1x",
        "permalink": "/r/wallstreetbets/comments/nu8oaz/daily_discussion_thread_for_june_07_2021/h0wkt1x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623099981.0
    },
    {
        "author": "trishul14",
        "body": "&gt;WEN, ENPH, MGM,\n\nwhy MGM?",
        "created_utc": 1623162891,
        "id": "h116znd",
        "permalink": "/r/wallstreetbets/comments/nv1518/daily_discussion_thread_for_june_08_2021/h116znd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623191691.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "ENPH is down today, in fact they were the worst performer in their sector last quarter but they are on the uptick now. XOM stopped borrowing their dividends and is now going to see a heavy cash flow coming. Watch the price of oil go up this summer and it will favor them XOM is one of the largest in the world.",
        "created_utc": 1622576209,
        "id": "h0891mi",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h0891mi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622605009.0
    },
    {
        "author": "sparkyladder",
        "body": "ENPH can you do something like hit $200 again plz",
        "created_utc": 1622585178,
        "id": "h08seux",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h08seux/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622613978.0
    },
    {
        "author": "brianjamesxx",
        "body": "$ENPH is fucking insane. Any red day is a fucking GIFT",
        "created_utc": 1623351101,
        "id": "h1ba7wz",
        "permalink": "/r/wallstreetbets/comments/nwjtth/daily_discussion_thread_for_june_10_2021/h1ba7wz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623379901.0
    },
    {
        "author": "pattiemcfattie",
        "body": "GEVO TDOC ENPH VIAC RBLX CRSR",
        "created_utc": 1622544327,
        "id": "h06grbq",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h06grbq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622573127.0
    },
    {
        "author": "relavant__username",
        "body": "ITT: ENPH overbought.. Only a 460% price increase in 1 year. and a P/E of 200+ according to Yahoo. Lol. See yall at the bagholding convention.",
        "created_utc": 1623068313,
        "id": "h0wg08m",
        "permalink": "/r/stocks/comments/ntwior/solar_panel_stock/h0wg08m/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1623097113.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "And looks like I was right...... Now for anyone else reading it.... Here are more good buys:\n\nWFC\n\nTRKA\n\nCCL\n\nENPH",
        "created_utc": 1622742799,
        "id": "h0gsn32",
        "permalink": "/r/wallstreetbets/comments/nr9r9t/daily_discussion_thread_for_june_03_2021/h0gsn32/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622771599.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "ENPH\n\nRTX\n\nMGM",
        "created_utc": 1622829097,
        "id": "h0lcotf",
        "permalink": "/r/wallstreetbets/comments/ns1gd8/daily_discussion_thread_for_june_04_2021/h0lcotf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622857897.0
    },
    {
        "author": "educationallightbulb",
        "body": "ENPH sheesh",
        "created_utc": 1623360702,
        "id": "h1bw998",
        "permalink": "/r/wallstreetbets/comments/nwwxw6/what_are_your_moves_tomorrow_june_11_2021/h1bw998/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623389502.0
    },
    {
        "author": "CallsOnAlcoholism",
        "body": "That’s an amazing entry you got on ENPH",
        "created_utc": 1623246639,
        "id": "h15i56j",
        "permalink": "/r/wallstreetbets/comments/nvs38y/daily_discussion_thread_for_june_09_2021/h15i56j/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623275439.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "Enphase------ might as well call it \"Entrapment.\" for fuck sake I have never lost as much in one stock as I have in this shit today..... ENPH WTF?? You're supposed to be one of the top performers in your sector!!!!! SMFH!",
        "created_utc": 1622747178,
        "id": "h0h3631",
        "permalink": "/r/wallstreetbets/comments/nr9r9t/daily_discussion_thread_for_june_03_2021/h0h3631/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622775978.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "OMG I'm dying reading this! BEST COMMENT TODAY HAHAHAHAHA \n\nOn a side note- ENPH, MGM and XOM seem like they're due for a huge week.",
        "created_utc": 1622829198,
        "id": "h0lcxal",
        "permalink": "/r/wallstreetbets/comments/ns1gd8/daily_discussion_thread_for_june_04_2021/h0lcxal/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1622857998.0
    },
    {
        "author": "TheDutchBee",
        "body": "Why ENPH?",
        "created_utc": 1623071291,
        "id": "h0wl06b",
        "permalink": "/r/wallstreetbets/comments/nu8oaz/daily_discussion_thread_for_june_07_2021/h0wl06b/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1623100091.0
    },
    {
        "author": "restlessleg",
        "body": "we all know the obvious plays.\n\ni just want to put these out there for when the great migration happens:\n\nTSLA - ENPH - DDD",
        "created_utc": 1622664648,
        "id": "h0csuaj",
        "permalink": "/r/wallstreetbets/comments/nquubf/what_are_your_moves_tomorrow_june_03_2021/h0csuaj/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1622693448.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "Today will be different...... today the last hour we will see a surge of buying because based off my calculations next week could be one of the greatest 5 day spans in the market..... mark my words and watch and see. BUY NOW!\n\nXOM\n\nCOP\n\nENPH\n\nHPQ\n\nMGM",
        "created_utc": 1622833742,
        "id": "h0lnvev",
        "permalink": "/r/wallstreetbets/comments/ns1gd8/daily_discussion_thread_for_june_04_2021/h0lnvev/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1622862542.0
    },
    {
        "author": "bmault",
        "body": "ENPH having a nice week",
        "created_utc": 1623413651,
        "id": "h1e7jh3",
        "permalink": "/r/wallstreetbets/comments/nxcaz5/daily_discussion_thread_for_june_11_2021/h1e7jh3/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1623442451.0
    },
    {
        "author": "dragoneyethai",
        "body": "Keeping my eye on SIG and ENPH!",
        "created_utc": 1623444177,
        "id": "h1g2ezx",
        "permalink": "/r/wallstreetbets/comments/nxosm3/weekend_discussion_thread_for_the_weekend_of_june/h1g2ezx/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1623472977.0
    },
    {
        "author": "wingchun777",
        "body": "https://app.sparticus.xyz/symbol-details/ENPH",
        "created_utc": 1623042784,
        "id": "h0vm7yi",
        "permalink": "/r/stocks/comments/ntwior/solar_panel_stock/h0vm7yi/",
        "score": -7,
        "subreddit": "stocks",
        "created": 1623071584.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "If you want to be rich today buy::::\n\nENPH\n\nWEN\n\nCLOV\n\nMGM\n\nTSLA\n\nXYL",
        "created_utc": 1623160280,
        "id": "h11101p",
        "permalink": "/r/wallstreetbets/comments/nv1518/daily_discussion_thread_for_june_08_2021/h11101p/",
        "score": -10,
        "subreddit": "wallstreetbets",
        "created": 1623189080.0
    },
    {
        "author": "SHOWTIME2283",
        "body": "Today's buys:\n\nHPQ\n\nCLNE\n\nNLOK\n\nMGM\n\nENPH\n\n&amp;#x200B;\n\nToday's sells:\n\nAMC\n\nBB\n\nDIS\n\nCVX\n\nAAL",
        "created_utc": 1622814397,
        "id": "h0keyyo",
        "permalink": "/r/wallstreetbets/comments/ns1gd8/daily_discussion_thread_for_june_04_2021/h0keyyo/",
        "score": -12,
        "subreddit": "wallstreetbets",
        "created": 1622843197.0
    },
    {
        "author": "Parallelism09191989",
        "body": "Made most of my money from SQ at $17 and ENPH at $19\n\nCurrently holding: CRSR, PLTR, WKHS and smaller positions in RIDE, AZRE, ICLN. \n\nNot sure id recommend WKHS right now, it’s extremely risky, I regret buying, but I don’t panic sell, so I’m selling CC’s against my shares at break even to collect premium. \n\nCRSR and PLTR seem like sure multibaggers, IMHO and premiums are juicy.\n\nI highly recommend learning options (to sell, NOT BUY), but you’ll want a year or two of gains before you have enough cash power to sell options. \n\nIm really loving EDR as a stock, but don’t own any sizable amount worth noting. I also love COIN as a long term boring hold and I also like PCT as another boring hold. \n\nI’m starting to scale down risk and invest in more quality long term multibaggers. The 3 I just mentioned, I feel are good long holds. Full disclosure, don’t own COIN or PCT, and I only hold like $500 in EDR.",
        "created_utc": 1622997198,
        "id": "h0t5f8p",
        "permalink": "/r/stocks/comments/ntmkjk/25_opening_a_roth_ira/h0t5f8p/",
        "score": -14,
        "subreddit": "stocks",
        "created": 1623025998.0
    }
]