[
    {
        "author": "sportsmook",
        "body": "Yellen don’t hold those keys anymore \n\nThey are all Jeromes now",
        "created_utc": 1623041730,
        "id": "h0vkqio",
        "permalink": "/r/stocks/comments/nu31dz/yellen_said_a_slightly_higher_interest_rate/h0vkqio/",
        "score": 185,
        "subreddit": "stocks",
        "created": 1623070530.0
    },
    {
        "author": "red_adept",
        "body": "game publishers don't want people re-selling their games.  They make no money that way.\n\nIn fact, that's the big thing about Digital downloads, steam keys and all that, you can't resell them.  Game companies LOVE that.",
        "created_utc": 1623266205,
        "id": "h16u7hy",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h16u7hy/",
        "score": 97,
        "subreddit": "investing",
        "created": 1623295005.0
    },
    {
        "author": "NadlesKVs",
        "body": "There is some confusion on whether that happened or not.\n\nWord on Twitter is they took over a Cloud Server that was based in California with a Subpeona and the Ransomer's held the Private Keys to the wallet on that server then they got the BTC on it that way.\n\nThere is people thinking that they may have gotten it from Coinbase with them trying to cash out since they are based in California. Supposedly the, \"Wallet\" was a Coinbase Wallet.\n\nAlso, I haven't seen anyone prove if it was the Ransomer or the person that hired the Ransomer. Darkside was just hired to do the job, manage the negotiations, and get the payment.\n\nAlthough, only the FBI and them know how much the ransom was originally and if it was ever split.\n\nPretty sure this has nothing to do with Price though. Almost everyone knew that BTC would dip eventually and it was barely surviving mid to high 30s recently.",
        "created_utc": 1623177178,
        "id": "h124xbm",
        "permalink": "/r/StockMarket/comments/nv4464/bitcoin_slides_7_after_us_government_was_able_to/h124xbm/",
        "score": 90,
        "subreddit": "StockMarket",
        "created": 1623205978.0
    },
    {
        "author": "BagFullOfKittenBones",
        "body": "There's rumors of involving NFTs into the GameStop business model. I'm going to assume it'll be NFTs of game registry keys. If the tech is viable, that means digital keys could be tied to NFTs, and bought/sold like physical copies. GameStop would get a residual fee each time the NFT is traded.",
        "created_utc": 1623282702,
        "id": "h17w7fx",
        "permalink": "/r/stocks/comments/nw5703/gamestop_releases_first_quarter_2021_financial/h17w7fx/",
        "score": 51,
        "subreddit": "stocks",
        "created": 1623311502.0
    },
    {
        "author": "Concealus",
        "body": "For the record, they had their private keys on a RENTED CLOUD SERVER. These guys weren’t geniuses. Bitcoin nor any wallet protocol was hacked, the suspects simply put were idiots with their wallet security.",
        "created_utc": 1623193983,
        "id": "h136i5y",
        "permalink": "/r/StockMarket/comments/nv4464/bitcoin_slides_7_after_us_government_was_able_to/h136i5y/",
        "score": 45,
        "subreddit": "StockMarket",
        "created": 1623222783.0
    },
    {
        "author": "Bintherereddat",
        "body": "Only American's could hand over the keys and walk away",
        "created_utc": 1623277452,
        "id": "h17lbud",
        "permalink": "/r/CanadianInvestor/comments/nw0tmz/bank_of_canada_says_real_estate_is_expected_to/h17lbud/",
        "score": 27,
        "subreddit": "CanadianInvestor",
        "created": 1623306252.0
    },
    {
        "author": "HotStockSlinger",
        "body": "They either got the keys off a server they took over or they are lying about recovering the money.  If they could actually crack the encryption and take the money there is no way they'd reveal that capability over a few million dollars.",
        "created_utc": 1623185612,
        "id": "h12okpv",
        "permalink": "/r/StockMarket/comments/nv4464/bitcoin_slides_7_after_us_government_was_able_to/h12okpv/",
        "score": 25,
        "subreddit": "StockMarket",
        "created": 1623214412.0
    },
    {
        "author": "Gigidypaperhands",
        "body": "Remember these keys to investing:\n\n1. Good jobs report = stocks go down\n2. Bad jobs report = stocks go up\n3. Company you dont own shares in beats earnings = stock goes way up\n4. Company you do own shares in beats earnings = stock drills\n5. Inflation is priced in until it is no longer priced in\n6. Janet Yellen speaks = red",
        "created_utc": 1622827392,
        "id": "h0l8rtn",
        "permalink": "/r/wallstreetbets/comments/ns1gd8/daily_discussion_thread_for_june_04_2021/h0l8rtn/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1622856192.0
    },
    {
        "author": "whttevrr",
        "body": "Thank fully there were rocket emojis... my eyes were glazing over and drool was dripping out of my mouth and onto my keybloard. My fingrrd are now slipping on the keys.\n\nDD:\nI boght mor:\n\n🧠 🤪🦍 ✋💎🤚 🚀🚀🚀 🌖\n\nfor\n\n💰💸🤑 🔥🥓🐔🥓🔥",
        "created_utc": 1623274086,
        "id": "h17dn3l",
        "permalink": "/r/wallstreetbets/comments/nw6lmm/a_quick_dd_on_clov_borrowing_fee/h17dn3l/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1623302886.0
    },
    {
        "author": "zachalicious",
        "body": "They can do that with your bank account too though. They can freeze all of your assets and seize property at any time. If anything this just shows that crypto markets are complying with regulations, and if you truly want security from seizure, you likely need to be using Monero and never store keys on something connected to the internet.",
        "created_utc": 1623185564,
        "id": "h12ogw1",
        "permalink": "/r/StockMarket/comments/nv4464/bitcoin_slides_7_after_us_government_was_able_to/h12ogw1/",
        "score": 20,
        "subreddit": "StockMarket",
        "created": 1623214364.0
    },
    {
        "author": "bonejohnson8",
        "body": "I almost married the wealthiest JAP you ever saw, billionaire scion, old Russian jeweler family. She was a lunatic, cutter, bulimic, borderline, the whole 9. We did a lot of drugs together, and I had a great patron for my addictions. \n\nHer parents sat me down and offered me the keys to the kingdom, I'd never want for money again, just put on these clothes and submit to a life of nepotism and take care of our crazy daughter. I was with her for 5 years and almost did it, but I had too much pride and turned it all down and left.\n\nShe married some dick that met at a Phish show a few years ago. Today she just barely survived a heroin overdose. She texted me some pictures of cats she's been drawing in coloring books. It's like talking to a shell of the person I remember. \n\nIt's fucking scary seeing how much money doesn't buy happiness.",
        "created_utc": 1622602766,
        "id": "h09qt64",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h09qt64/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1622631566.0
    },
    {
        "author": "Lewsor",
        "body": "&gt; Currently, a digital AAA title earns the publisher X amount of money - once. Per customer. Years down the line, the same title will be sold for a fraction of the price on their own platform... and that's it.\n\nWhy the focus on the amount of times a digital title can earn the publisher money? The incremental costs of producing additional copies of a digital game are near 0.\n\n&gt; A small percentage off tens of thousands of resales of an old or obsolete title that is no longer offered in the publisher's own catalogue vs. buying the game from the publishers' own old game discount bin for a few bucks... again, once? Might not make sense initially, but especially in the used / old game market those small revenue streams would add up: especially when compared to a scenario where users would not otherwise buy the game.\n\nI still don't see the incentive for a publisher to cannibalize their own sales. As an example, Fallout: New Vegas was released in 2010 on Steam and other digital platforms. It cost $59.99 then. \n\nToday, Fallout: New Vegas is available on Steam for $9.99. A person that wants a copy of the game can buy it today. The publisher will receive the same percentage cut of the $9.99 sale that they received from the $59.99 sale.\n\nLet's now assume that Gamestop has a digital NFT token that allows resale of digital games. Someone in 2010 buys the game for $59.99, and today sells its for $9.99. The publisher receives a cut of the $9.99 sale, in addition to the original $59.99 sale.\n\nThe problem here is, what's the difference to the publisher? They receive the same amount of money from the sales. The keys to sell a second copy of the game have already been generated and sent to Steam for resale, so there's no incremental cost there. The NFT resale is basically cannibalizing a new sale.\n\n&gt; drive up scarcity of used titles? Release special NFT collector's versions of certain titles which are unlikely to ever go down in price due to extreme rarity?\n\n&gt; Especially the latter: think Magic the Gathering and take the Black Lotus card as an example. If you could release a fixed amount of those into the wild and get a cut for each and every high-price resale of those decades down the line... wouldn't you?\n\nI can see the argument/value for NFT sales of collectible items intended to be artificially scarce. Maybe not a multibillion dollar market, but definitely a possible avenue for revenue growth.\n\n I don't see the argument for driving artificial scarcity for regular, non collectible digital games. Even in the pre digital games, the games that were scarce were driven by production costs, and not by publishers attempting to drive up prices by limiting availability.",
        "created_utc": 1623273003,
        "id": "h17b2pu",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h17b2pu/",
        "score": 15,
        "subreddit": "investing",
        "created": 1623301803.0
    },
    {
        "author": "Moneybags313131",
        "body": "\"THIS CLOVER IS ON FIREEEEE\" - Alica Keys",
        "created_utc": 1623245841,
        "id": "h15gejo",
        "permalink": "/r/wallstreetbets/comments/nvsynu/daily_popular_tickers_thread_for_june_09_2021/h15gejo/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1623274641.0
    },
    {
        "author": "BC_Jay",
        "body": "Someone tosses you the keys to a lambo you asking why or driving away",
        "created_utc": 1622547524,
        "id": "h06kxtv",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h06kxtv/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1622576324.0
    },
    {
        "author": "Thewolfofbearstreet",
        "body": "Thank god blackberry don’t sell phones anymore apes figures to big for the keys",
        "created_utc": 1622669413,
        "id": "h0d43wb",
        "permalink": "/r/wallstreetbets/comments/nquubf/what_are_your_moves_tomorrow_june_03_2021/h0d43wb/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1622698213.0
    },
    {
        "author": "BackThatThangUp",
        "body": "Where do they keep the monkey that hits the up and down arrow keys on the stocks I want to tear gas that little fucker",
        "created_utc": 1623164593,
        "id": "h11b0n6",
        "permalink": "/r/wallstreetbets/comments/nv1518/daily_discussion_thread_for_june_08_2021/h11b0n6/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1623193393.0
    },
    {
        "author": "gamethe0ry",
        "body": "And? Publishers don’t care, the standard has set on consumers buying one time keys, why would they miss out on extra revenue.",
        "created_utc": 1623268296,
        "id": "h16zden",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h16zden/",
        "score": 9,
        "subreddit": "investing",
        "created": 1623297096.0
    },
    {
        "author": "Fuck_CCIV",
        "body": "Damn I didn’t realize how many top artists are signed to UMG : \n\nAriana Grande, Taylor Swift, Kendrick Lamar, J Balvin, Megan Thee Stallion, Bob Dylan, Alicia Keys, Justin Bieber, Billie Eilish, Nicki Minaj, Post Malone, U2, Halsey, Coldplay, Elton John, Billy Joel, Adele, Shawn Mendes, Otis Redding, Pearl Jam\n\nKind of wish I held on my seven dollar warrants now",
        "created_utc": 1622765182,
        "id": "h0i7e7s",
        "permalink": "/r/SPACs/comments/nr8h4h/announcements_x_daily_discussion_for_jun032021/h0i7e7s/",
        "score": 8,
        "subreddit": "SPACs",
        "created": 1622793982.0
    },
    {
        "author": "works_best_alone",
        "body": "G2A does not sell used keys, for obvious reasons. They sell new keys.",
        "created_utc": 1623266782,
        "id": "h16vmni",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h16vmni/",
        "score": 8,
        "subreddit": "investing",
        "created": 1623295582.0
    },
    {
        "author": "CrankyMiddleAgeGuy",
        "body": "BA — The Keys are overrated. Expensive. Pretty, but everything is overpriced and you drive up to Miami-Dade county whenever you really need something (between 45 min and 3 hours depending on where in the Keys). \n\nBuenos Aires is inexpensive, the women are beautiful, the people are well educated, and Steak + Malbec is the National dish..... Exquisite dining is a fraction of the cost of Miami.",
        "created_utc": 1622607790,
        "id": "h0a00l1",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h0a00l1/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1622636590.0
    },
    {
        "author": "ubunturd",
        "body": "The QWERTY keyboard was designed to slow you down.\n\nWhen typewriters were introduced, typing too quickly would jam the keys. To prevent this from happening, QWERTY was introduced which placed common alphabets at a distance from each other and slowed typists down.",
        "created_utc": 1623136935,
        "id": "h108zcx",
        "permalink": "/r/wallstreetbets/comments/num03g/what_are_your_moves_tomorrow_june_08_2021/h108zcx/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1623165735.0
    },
    {
        "author": "suchinsight00",
        "body": "I didn’t realize you were a medium. Would you let me know where my late grandfather left his Buick keys?",
        "created_utc": 1623134765,
        "id": "h106hxd",
        "permalink": "/r/wallstreetbets/comments/nux7gs/dad_passed_away_last_year_inherited_a_225k/h106hxd/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1623163565.0
    },
    {
        "author": "Spac_a_Cac",
        "body": "\nPaysafe preps post-Spac refi\n \n\n02 Jun 2021\n\nFintech payments provider Paysafe has launched a refinancing of its remaining credit facilities, following its $9bn merger with a Bill Foley-controlled Spac, which closed in March. The merger and its accompanying PIPE allowed the firm to pay down debt and cut its leverage, and now it wants to lock in the benefits with a lower-cost refi.\n\nJP Morgan is sole physical bookrunner on the dollar and euro term loans, totalling $1.026bn between the currencies. This will be followed with an equal sized slug of bonds in dollar and euros, yet to be launched.\nTalk on both tranches is 300bp-325bp at 99.5, with a 25bp margin step-down if the firm hits 3.7 times net leverage, half a turn below its present level, according to the loan marketing materials.\nLenders have successfully pushed back on proposed margin ratchet terms — including Cerba, for example — but these are generally deals which started with more aggressive terms, such as multiple step-downs for each quarter-turn of leverage. Deals with 25bp for half a turn have largely sailed through.\n\"It's a real economic term and something investors can easily rally around,\" said a leveraged finance syndicate banker. \"Some of the other docs points can be a bit of a niche interest but this is universal.\"\nPaysafe earmarked €1.25bn-equivalent of its outstanding debt for repayment as part of the merger, which closed at the end of March. The company said in its introduction to equity market analysts that it would have net leverage of 3.6-3.8 times on its 2021 earnings following the transaction — suggesting it intends to activate the margin step-down quickly.\nIt will, however, be going on the acquisition trail as well. Outlining the deal to analysts, Foley said: “One of the keys to this transaction and value creation for our shareholders is the reduction of Paysafe’s leverage ratio to 3.6 times. As Paysafe continues to grow and generate cash flow, that leverage ratio will continue to come down creating even more opportunity to pursue accretive M&amp;A opportunities.”\nMoody’s estimated leverage at 5.2 times on March 2021 numbers, after backing out some of the company’s adjustments.\nBased on its expected 2021 Ebitda, the business was 6-6.2 times levered at the end of last year, with net debt of $2.99bn, incurred when Blackstone and CVC took the firm private in 2017. The sponsors scored a huge win with the transaction, paying £3bn for the company and selling it on at a valuation of $9bn.\nHowever, both firms will remain invested. They took $2.3bn off the table as part of the Spac deal, but rolled over $3.29bn, while the Spac itself put in $1.467bn.\nThe PIPE investment (private investment in public equity) closed at the same time injected a further $2bn, with cornerstones from Foley-affiliated entities Cannae Holdings and Trasimene Capital Management, and outside capital from Fidelity, Third Point, and Maplelane Asset Management.\nAlongside the term loan and bond refi, the company will have a new $305m revolver in place following the closing of the deal.\nSpac-driven M&amp;A activity is increasingly feeding through to leveraged credit markets and to CLO portfolios, as sponsor-owned companies become targets for SPAC acquisitions. The equity raised through this route usually deleverages the company, meaning loan repayments or refinancings tighter — in some cases, helping take out loans trading at low levels at par.\nPaysafe’s existing euro loan already had a margin of 325bp, the wide end of the new guidance, but it also had outstanding second lien debt of $200m and €214m in its original LBO capital structure, which paid 725bp and 700bp respectively and have now been repaid.",
        "created_utc": 1622755207,
        "id": "h0hm5nn",
        "permalink": "/r/SPACs/comments/nroa3p/paysafe_preps_postspac_refi/h0hm5nn/",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1622784007.0
    },
    {
        "author": "DancesWithMilfs01",
        "body": "CLNE to the moon. They don’t want you to have another anthem!! \n\nMajor keys!! 🐂💨🌝",
        "created_utc": 1623189138,
        "id": "h12wdzi",
        "permalink": "/r/wallstreetbets/comments/nvcwpz/what_are_your_moves_tomorrow_june_09_2021/h12wdzi/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1623217938.0
    },
    {
        "author": "Angry_Wanderlei",
        "body": "Dude it’s going to 5mil a share ive been collecting energy for days I’m off my meds and taking adderall I’m going to be the biggest motivational speaker since god himself I got the keys I invested my life into this stock it is hitting 1billy and I will save africa I will save the children as god is my witness himself I will change the world my book will be the biggest book ever just #2 under the Bible you don’t believe me it doesn’t matter I believe in myself and we all should we shall bleed the hedge funds dry then we shall give them welfare to take care of their kids we shall take over the world and bring peace and prosperity my family thinks I’m crazy all my friends won’t talk to me but I will turn my cheek when I’m rich and they shall all come for the ride so listen straight when we’re at the top we bring others up I want you to goto your worst enemy and buy his mother a house you are a life force of good will peace power a prosperity",
        "created_utc": 1623131742,
        "id": "h102snu",
        "permalink": "/r/StockMarket/comments/nuqqgs/when_people_see_literally_one_reddit_post_on_amc/h102snu/",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1623160542.0
    },
    {
        "author": "ConfidenceNo2598",
        "body": "It looks like the hackers stored the keys to the wallet on a cloud server which the FBI subpoenaed. No blockchain was hacked",
        "created_utc": 1623181952,
        "id": "h12g5db",
        "permalink": "/r/StockMarket/comments/nv4464/bitcoin_slides_7_after_us_government_was_able_to/h12g5db/",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1623210752.0
    },
    {
        "author": "NonSupportiveCup",
        "body": "Legitimizing the second-hand market should certainly not be overlooked. If the NFT idea follows the predictions which are currently floating around that would be a lot of potential but I suppose many people just don't see it.\n\nEdit: Maybe because most investors don't see how bad the Steam keys market actually can be.",
        "created_utc": 1623269559,
        "id": "h172j96",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h172j96/",
        "score": 5,
        "subreddit": "investing",
        "created": 1623298359.0
    },
    {
        "author": "murray_paul",
        "body": "a) Why would game publishers be interested in doing this, when it would reduce their revenues?\n\nb) Publishers already offer a rental-like model with monthly subscriptions.\n\nc) If publishers wanted to allow resale, they could do that through Steam/Epic keys right now.\n\nSo what does GameStop offer? \n\nThe cannot offer digital resale/rental without publisher agreement.\nDigital publishing for consoles is locked up by the console manufacturers. Digital sales for PCs are dominated by Steam and Epic.\n\nAnd ... what does offering digital resale/rental have to do with owning physical stores?",
        "created_utc": 1623264789,
        "id": "h16qosy",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h16qosy/",
        "score": 5,
        "subreddit": "investing",
        "created": 1623293589.0
    },
    {
        "author": "-Erasmus",
        "body": "Not exactly. Hitting too many keys right next to each other could jam the keys so they spread out the common letters and combinations. A good typist can actually go faster on QWERTY because they use different fingers for each area of the keyboard",
        "created_utc": 1623137200,
        "id": "h1099sw",
        "permalink": "/r/wallstreetbets/comments/num03g/what_are_your_moves_tomorrow_june_08_2021/h1099sw/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623166000.0
    },
    {
        "author": "lovestheasianladies",
        "body": "&gt;If you buy a physical copy, that game is your property\n\nI guess you don't understand how CD keys work. Those have only been a thing for like 30 years now.",
        "created_utc": 1623270920,
        "id": "h175xnt",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h175xnt/",
        "score": 4,
        "subreddit": "investing",
        "created": 1623299720.0
    },
    {
        "author": "ar_1five",
        "body": "No its the opposite. Even with smaller keys if they are physical you can feel them and press one only. With an onscreen keyboard you can’t do that. So you end up jamming extra keys.",
        "created_utc": 1623015599,
        "id": "h0u8lt2",
        "permalink": "/r/StockMarket/comments/ntnv11/i_miss_this_kind_of_legend_phones_now_a_days_bb/h0u8lt2/",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1623044399.0
    },
    {
        "author": "TaftsTummyforTaxes",
        "body": "Anytime I see this scene of Murphy catching the car keys I think of the hundreds of times they had to redo it because the keys kept bouncing off the rubber hands of the costume 🤣",
        "created_utc": 1622602875,
        "id": "h09r0y9",
        "permalink": "/r/wallstreetbets/comments/nq6p5x/id_buy_gme_for_a_dollar/h09r0y9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1622631675.0
    },
    {
        "author": "Dry-Representative75",
        "body": "With the Bag holders lies the keys 🗝🚀",
        "created_utc": 1622663981,
        "id": "h0cr8ik",
        "permalink": "/r/wallstreetbets/comments/nqi9f6/daily_discussion_thread_for_june_02_2021/h0cr8ik/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1622692781.0
    },
    {
        "author": "ar_1five",
        "body": "Any male with hands bigger than a 12y/o wants a physical keyboard. Tactile sense of the keys make it easier to type. Most guys i know still cant type on iphone including me simply because my thumbs are too big it just mashes 2 keys at once. You are probably a small person so you don’t realize this.",
        "created_utc": 1623015396,
        "id": "h0u86di",
        "permalink": "/r/StockMarket/comments/ntnv11/i_miss_this_kind_of_legend_phones_now_a_days_bb/h0u86di/",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1623044196.0
    },
    {
        "author": "LargeHotdog",
        "body": "Puts on Microsoft. I want a refund on my windows 10 pro keys. Every week I get a call at work that our software isn’t working. Only happens after windows 10 decides to update itself after I said NO.",
        "created_utc": 1622558731,
        "id": "h075dzk",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h075dzk/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622587531.0
    },
    {
        "author": "___alexa___",
        "body": "ɴᴏᴡ ᴘʟᴀʏɪɴɢ: [The Black Keys - Gold On The](https://www.youtube.com/watch?v=6yCIDkFI7ew) ─────────⚪───── ◄◄⠀[▶](https://www.youtube.com/watch?v=6yCIDkFI7ew)⠀►►⠀ 2:30 / 3:46 ⠀ ───○ 🔊 ᴴᴰ ⚙️",
        "created_utc": 1622565128,
        "id": "h07jtoj",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h07jtoj/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622593928.0
    },
    {
        "author": "Downtown-Duck-3542",
        "body": "I’ll second their order. And 2 for my friend, and when I say friend I mean me, and when I say 2 I mean just leave the bottle... actually just leave the keys, I can lock up.",
        "created_utc": 1622860290,
        "id": "h0n5qqo",
        "permalink": "/r/wallstreetbets/comments/nse1dg/weekend_discussion_thread_for_the_weekend_of_june/h0n5qqo/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622889090.0
    },
    {
        "author": "Kimaxw",
        "body": "Sounds like how people felt about housing in 2005, or stocks in 1929, 2000, 2007. Crashes occur after bubbles. Why do people believe what goes up will just keep going up despite all the historic examples to the contrary? Vegas home prices fell 85% from 2005-2008. Ghost towns popped up all over California as people dropped off their house keys at the bank. The idea that housing cannot crash 85% or more as the Everything Bubble collapses is simply denial",
        "created_utc": 1622577086,
        "id": "h08ayne",
        "permalink": "/r/wallstreetbets/comments/npjoel/housing_2007_again/h08ayne/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622605886.0
    },
    {
        "author": "tobyfatcat",
        "body": "There is a K Mart in the FL Keys! It will bounce back for sure!!! :(",
        "created_utc": 1623311380,
        "id": "h197vwe",
        "permalink": "/r/RobinHoodPennyStocks/comments/nw6mz6/how_do_i_stop_being_bad_at_stocks/h197vwe/",
        "score": 3,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1623340180.0
    },
    {
        "author": "t76turbo",
        "body": "They already have the ability to unlock and remote start the car with the watch (or iphone).  It's called 'Car Keys' and is very limited right now.  I think the first was the 2021 BMW 5 series.  But it is out there already.  I agree, should be some exciting stuff around the corner.",
        "created_utc": 1622756419,
        "id": "h0hp2o1",
        "permalink": "/r/wallstreetbets/comments/nrnkge/feel_bearish_about_aapl/h0hp2o1/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622785219.0
    },
    {
        "author": "___alexa___",
        "body": "ɴᴏᴡ ᴘʟᴀʏɪɴɢ: [DJ Khaled - I Got the Keys (](https://www.youtube.com/watch?v=SFLSOIufuhM) ─────────⚪───── ◄◄⠀[▶](https://www.youtube.com/watch?v=SFLSOIufuhM)⠀►►⠀ 2:46 / 4:09 ⠀ ───○ 🔊 ᴴᴰ ⚙️",
        "created_utc": 1623110525,
        "id": "h0z17mh",
        "permalink": "/r/wallstreetbets/comments/num03g/what_are_your_moves_tomorrow_june_08_2021/h0z17mh/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623139325.0
    },
    {
        "author": "262Chief",
        "body": "Somehow I am not seeing handing over the cannabis keys to a crew of Canadian $$$ Billion dollar companies, led by a Russian billionaire oligarch as the solution to the social equity piece.",
        "created_utc": 1623203435,
        "id": "h13p32i",
        "permalink": "/r/weedstocks/comments/nvcwq9/after_hours_discussion_thread_june_08_2021/h13p32i/",
        "score": 2,
        "subreddit": "weedstocks",
        "created": 1623232235.0
    },
    {
        "author": "GapOne2569",
        "body": "I'd paper hand like a little bitch. I got no loyalty to no ticker. \n\nCash out and fuck off down in the keys looking for bricks of random coke washed up.",
        "created_utc": 1623191150,
        "id": "h130pfw",
        "permalink": "/r/wallstreetbets/comments/nvcwpz/what_are_your_moves_tomorrow_june_09_2021/h130pfw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623219950.0
    },
    {
        "author": "Flying_madman",
        "body": "IDK, sometimes it seems like it keys in on things I've never even said. It's weird",
        "created_utc": 1622924653,
        "id": "h0q12tb",
        "permalink": "/r/wallstreetbets/comments/mrzztb/unpinned_daily_discussion_thread_for_april_16_2021/h0q12tb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622953453.0
    },
    {
        "author": "Kind_Committee8997",
        "body": "No. It's bad enough they hold the keys to most of the major manufacturing US companies rely on. Not contributing the sale of our independence.",
        "created_utc": 1623253921,
        "id": "h15zlvy",
        "permalink": "/r/stocks/comments/nvy2b3/chinese_grocery_app_dingdong_maicai_files_for_us/h15zlvy/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1623282721.0
    },
    {
        "author": "Stak215",
        "body": "Yes for specific things like expansions. Console game do not have CD keys.",
        "created_utc": 1623271146,
        "id": "h176htb",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h176htb/",
        "score": 2,
        "subreddit": "investing",
        "created": 1623299946.0
    },
    {
        "author": "RedditF1shBlueF1sh",
        "body": "If you have the private keys, you have the wallets. If you read the article or other comments, they had the private keys on a rented cloud server, which was subpoenaed",
        "created_utc": 1623200740,
        "id": "h13jsr0",
        "permalink": "/r/StockMarket/comments/nv4464/bitcoin_slides_7_after_us_government_was_able_to/h13jsr0/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1623229540.0
    },
    {
        "author": "legendoftheark",
        "body": "Big gorilla at the L.A. Zoo\nSnatched the glasses right off my face \nTook the keys to my BMW \nLeft me here to take his place\n\nI wish the ape a lot of success \nI'm sorry my apartment's a mess \nMost of all I'm sorry if I made you blue \nI'm betting the gorilla will, too\n\nThey say Jesus will find you wherever you go \nBut when He'll come looking for you, they don't know \nIn the mean time, keep your profile low \nGorilla, you're a desperado",
        "created_utc": 1622665310,
        "id": "h0cug4i",
        "permalink": "/r/wallstreetbets/comments/nquubf/what_are_your_moves_tomorrow_june_03_2021/h0cug4i/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622694110.0
    },
    {
        "author": "mrojek",
        "body": "Where do we apply for our yacht keys?",
        "created_utc": 1623171850,
        "id": "h11s5z5",
        "permalink": "/r/wallstreetbets/comments/nv1518/daily_discussion_thread_for_june_08_2021/h11s5z5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623200650.0
    },
    {
        "author": "eaenberg",
        "body": "Commenting so the bot keys out through?",
        "created_utc": 1622601829,
        "id": "h09p0cj",
        "permalink": "/r/wallstreetbets/comments/nqb8x6/up_140_on_amc_not_big_money_but_big_for_me_thank/h09p0cj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622630629.0
    },
    {
        "author": "Inquisitor1",
        "body": "&gt; What do they have to offer to your average gamer who’s favorite marketplace is steam? \n\nA pc that runs steam. Game keys that you put into steam. And let's not forget the FUCKING BIGGEST THING: steam gift cards. You have a nephew who hates epic game store as much as he hates deodorant? Need something you can wrap into pretty gifting paper? Steam gift card. Thanks to you he can get waifu simulator 3 on his favorite steam without anyone even knowing. Friends of mine went to Germany for vacation from a tiny european country, everyone gave them money to bring back steam gift cards from Germany's gamestops.\n\nAlso, remember how your favorite steam tried to sell movies? Steam isn't even very good at selling things it does sell. Discoverability is down the drain. Greenlight didn't work out, just like that nephew of yours. Shovelware dominates the whole thing. And that valve index, does it have same day delivery from steam? Price matching?",
        "created_utc": 1623323760,
        "id": "h19m11e",
        "permalink": "/r/stocks/comments/nw5703/gamestop_releases_first_quarter_2021_financial/h19m11e/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1623352560.0
    },
    {
        "author": "Belvador",
        "body": "Long term they’re a failing business I really don’t understand it either. Ive heard talk of GME and NFT’s but I mean people just buy discounted steam keys from 3rd party sites anyways, I don’t think it’s going to be the game changer they think it is. Their core business model of brick and mortar stores are absolutely failing. However they do have a huge stockpile of cash and are a household name so maybe they can do something with that.",
        "created_utc": 1623265416,
        "id": "h16s957",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h16s957/",
        "score": 1,
        "subreddit": "investing",
        "created": 1623294216.0
    },
    {
        "author": "keymone",
        "body": "&gt; base layer is essentially enough already and always will be, even if the entire world is on the Bitcoin standard\n\nno, it really won't. there's a limit of roughly 2000 transactions every 10 minutes and when you onboard countries and businesses, they will outbid every individual indefinitely. 0-conf won't save you if your every transaction never confirms and just expires after 72 hours.\n\n&gt; People can also trade wallets physically ... preloaded with a set amount of BTC, the private key generated automatically and without human access, and the private key hidden physically, such as covered by a scratch off material, or like the concept OpenDime uses\n\ni doubt this will be very popular. you never know that a person you purchased wallet from didn't make a copy of private keys or a seed. without an expert it's really hard to tell the physical device wasn't tampered with. you'd basically be required to immediately transfer everything out of that wallet, in which case you could just request another party to do that during purchase.\n\n&gt; at the end of the day, I think many will find that the most powerful use of Bitcoin as legal tender or otherwise, is to use it simple as a bank account that you control\n\nyes, that's the main value proposition - the most safe and secure asset that can't be debased from under your feet. and el salvador is a good country to adopt it because they gave up on their own currency long ago, so they are just giving people another option. let's hope it'll work out nicely.",
        "created_utc": 1623234962,
        "id": "h14y2w9",
        "permalink": "/r/investing/comments/nvok95/bitcoin_is_now_legal_tender_in_el_salvador/h14y2w9/",
        "score": 1,
        "subreddit": "investing",
        "created": 1623263762.0
    },
    {
        "author": "isellamdcalls",
        "body": "On the off chance I ever get rich should I move to the Keys or Buenos Aires?",
        "created_utc": 1622607597,
        "id": "h09zo8y",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h09zo8y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622636397.0
    },
    {
        "author": "fox050181",
        "body": "Because you memorize where the keys are so you don’t have to look to type and you can feel them. In class at work... etc. all these times were great!",
        "created_utc": 1622765951,
        "id": "h0i8xcl",
        "permalink": "/r/wallstreetbets/comments/nrqifx/new_sheriff_in_town/h0i8xcl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622794751.0
    },
    {
        "author": "GeorgeTultan",
        "body": "BABA\nOSTK\nDBX\nEXAS\nDNN\nRKT\nPENN\nAAPL\nREGN\nAMD\nMSTR\nPLTR\nFB\nFISV\nETSY\nNNDM\nWORK\nFNN\nSNAP\nPINS\nMU\nBSX\nCARR\nAMAT\nBAC\nNVDA\nD\nSPGI\nMRNA\nWFC\nKEYS\nPTON\nNOK\nAMC\nSKLZ\nERIC\nWKHS\nVOD\nT\nKR\nEXEL\nNVO\nHLF\nGSK\nMNST\nBMY\nGILD\nVIAC\nROKU\nDIS\nAON\nSHOP\nGOOG\nGOOGL\nThere’s a bunch more but that’s some of them... I’m sitting probably 50% in cash for the moment until I find a fun swing trade to hop on",
        "created_utc": 1622821739,
        "id": "h0kvkbe",
        "permalink": "/r/ValueInvesting/comments/ns6duu/has_anyone_here_done_their_own_stock_analysis_on/h0kvkbe/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1622850539.0
    },
    {
        "author": "NotSm4rt",
        "body": "Alexa play I Got The Keys by Jay-Z",
        "created_utc": 1623110436,
        "id": "h0z10wu",
        "permalink": "/r/wallstreetbets/comments/num03g/what_are_your_moves_tomorrow_june_08_2021/h0z10wu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623139236.0
    },
    {
        "author": "murray_paul",
        "body": "&gt; Honestly, I will leave you to look into the advantages of leveraging Blockchain technology with these types of real-life use scenarios.\n\nSo ... no answer.\n\nDigital resale could be happening right now. There is no technical problem with it. There is no need for blockchain, Steam could enable trading of game keys right now, if the publishers wanted to allow it.\n\nIt isn't happening because none of the people involved **want** it to happen. Why would publishers allow resale of their digital games? It wouldn't make them more money.",
        "created_utc": 1623268812,
        "id": "h170ofn",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h170ofn/",
        "score": 1,
        "subreddit": "investing",
        "created": 1623297612.0
    },
    {
        "author": "Magnahelix",
        "body": "*less (not keys...damn autocorrect)",
        "created_utc": 1623257001,
        "id": "h167el8",
        "permalink": "/r/wallstreetbets/comments/nw0a7k/why_such_a_low_amc_volume/h167el8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623285801.0
    },
    {
        "author": "cd7k",
        "body": "PC has Steam, Xbox has Microsoft Store, Sony has Playstation store - the latter two being integrated into the console, making it easy to purchase.  How do you see GameStop improving the customer experience?  Game keys like cdkeys etc...?  Genuinely curious.",
        "created_utc": 1622569858,
        "id": "h07uqja",
        "permalink": "/r/wallstreetbets/comments/npso9s/amc_sells_85_million_shares/h07uqja/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622598658.0
    },
    {
        "author": "brutal_farts",
        "body": "Yeah I didn’t understand that either. I can’t recall one person “turning in their keys”",
        "created_utc": 1622577555,
        "id": "h08bzj1",
        "permalink": "/r/wallstreetbets/comments/npgffv/crashes_occur_after_bubbles/h08bzj1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622606355.0
    },
    {
        "author": "NotTopherGrace",
        "body": "&gt;You use a computer but can you even explain how a transistor works? Maybe. Can you explain the physics of a solid state drive or all the kinds of digital communication?\n\nNo, but I'm not investing in that technology and touting how it differs from the current technology. You're saying that NFTs provide a better solution in this case, but can't answer basic questions about why that differs from the current technology. Publishers already issue CD keys that ensure a finite supply of games within their ecosystem, they can already ensure that their digital products are non-fungible because of this. \n\n&gt; You getting angry about random redditors not explaining technical aspects of encryption\n\nI asked you about centralization vs decentralization which is like the basic foundation of crypto and why NFTs are used, literally nobody asked you about encryption, and the fact that you think they did is even more damning.",
        "created_utc": 1623270406,
        "id": "h174nkm",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h174nkm/",
        "score": 1,
        "subreddit": "investing",
        "created": 1623299206.0
    },
    {
        "author": "TheRosineer710",
        "body": "Keys were stored in a fucking cloud server. They didn't hack a wallet. \n\n\nYou deff can't hack a hardware wallet unless you have the fucking wallet.",
        "created_utc": 1623197644,
        "id": "h13dsnn",
        "permalink": "/r/StockMarket/comments/nv4464/bitcoin_slides_7_after_us_government_was_able_to/h13dsnn/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1623226444.0
    },
    {
        "author": "Justin_ll",
        "body": "Say no more. Sounds like a great deal, where do I send the keys.",
        "created_utc": 1622729234,
        "id": "h0fvywf",
        "permalink": "/r/wallstreetbets/comments/nreb7h/looking_for_a_house_to_rent_for_a_short_period/h0fvywf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622758034.0
    },
    {
        "author": "NadlesKVs",
        "body": "Supposedly, it's still unproven as far as I'm aware.\n\nAlso, I was thinking that could be the person that hired Darkside. I don't think Darkside is that incompetent. They could have been incompetent enough to leave it on a hosted server with the keys though.",
        "created_utc": 1623241405,
        "id": "h157s41",
        "permalink": "/r/StockMarket/comments/nv4464/bitcoin_slides_7_after_us_government_was_able_to/h157s41/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1623270205.0
    },
    {
        "author": "Pizanch",
        "body": "\nBig Gorilla at the LA zoo\n\nSnatched my glasses off of my face\n\nTook the keys to my BMW\n\nLeft me here to take his place\n\nI wish the Ape a lot of success \n\nI'm sorry my apartment's a mess",
        "created_utc": 1622655581,
        "id": "h0c70k7",
        "permalink": "/r/wallstreetbets/comments/nqi9f6/daily_discussion_thread_for_june_02_2021/h0c70k7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622684381.0
    },
    {
        "author": "NotSm4rt",
        "body": "Alexa play I Got The Keys by DJ Khaled\n\n\nEdit;  thanks whore",
        "created_utc": 1623110496,
        "id": "h0z15jd",
        "permalink": "/r/wallstreetbets/comments/num03g/what_are_your_moves_tomorrow_june_08_2021/h0z15jd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623139296.0
    },
    {
        "author": "Dull-Archer7704",
        "body": "HEY I no read too good. what were the keys again, get out of what?",
        "created_utc": 1623255453,
        "id": "h163hqf",
        "permalink": "/r/wallstreetbets/comments/nvz2p3/you_are_all_being_ridiculous_with_these_endless/h163hqf/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1623284253.0
    },
    {
        "author": "LickMyTicker",
        "body": "As games increasingly become free to play and microtransactions take center stage... \n\nLook at Counter Strike and the skin economy in that game. \n\nRight now, valve holds the keys to the market place. What happens when a few games start supporting the decentralized approach that is NFT? Now it's all about supporting an API. Pulling in users who own NFTs to your environment by supporting them. Other publishers won't have a choice if they want to compete. \n\nThere will continue to be partnerships with NFTs, and gamestop has the clout. At this point it's all marketing. You can't stop  the NFT wave. It's going to continue to happen. It might evolve a little and look different, but it's happening.\n\nYou'll be able to sell licenses to a game as well as dlc that is in the form of an NFT that only gamestop has the exclusive rights to, and they can make it as artificially scarce as they want.",
        "created_utc": 1623269721,
        "id": "h172xpb",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h172xpb/",
        "score": -1,
        "subreddit": "investing",
        "created": 1623298521.0
    },
    {
        "author": "SmithRune735",
        "body": "You just made an argument for why no one wants a physical keyboard, the keys are too small!",
        "created_utc": 1623015476,
        "id": "h0u8chy",
        "permalink": "/r/StockMarket/comments/ntnv11/i_miss_this_kind_of_legend_phones_now_a_days_bb/h0u8chy/",
        "score": -2,
        "subreddit": "StockMarket",
        "created": 1623044276.0
    },
    {
        "author": "NonSupportiveCup",
        "body": "Stolen credit cards and mysteriously cheap steam keys exist.",
        "created_utc": 1623269711,
        "id": "h172wum",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h172wum/",
        "score": -5,
        "subreddit": "investing",
        "created": 1623298511.0
    },
    {
        "author": "Ironleg01",
        "body": "I think you are looking at it from purely logical perspective and discounting geopolitics. Just to come back to Huawei for a second. US could have said we don't use your 5G equipment and that's final. But that's not all they did. They forbid Google licensing Android to them, they forbid everyone from selling chips from them, they even made a big fuss about Seagate selling HDDs to them. It wasn't just about 5G equipment. They destroyed the whole company just to spite China. Now, yes BABA probably don't care about spying on US but say if their cloud business really takes off, and there are these tensions with China and US really wants to damage China in any way they could just say BABA is selling software to Chinese military to enslave muslim minorities or some such bullshit and we would see all sorts of bans and sanctions. Certainly say goodbye to your ADRs. Logical? No. Makes sense to weaken your biggest rival in any way in geopolitical sense? Yea. I would not think something like that is impossible.",
        "created_utc": 1622758156,
        "id": "h0ht0we",
        "permalink": "/r/stocks/comments/nrjfab/washington_to_bar_us_investors_from_59_chinese/h0ht0we/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1622786956.0
    },
    {
        "author": "commodoregoat",
        "body": "Most definitely. I plan on adding it too. Just that WDC is undervalued in comparison to Seagate.",
        "created_utc": 1623003755,
        "id": "h0tj8gv",
        "permalink": "/r/wallstreetbets/comments/ntqwp7/wdc_western_digital_is_being_driven_up_by_chia/h0tj8gv/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623032555.0
    },
    {
        "author": "Typical-Technician46",
        "body": "UH FELLOW APES? \n\nits me the sky, just letting you know, im pulling my panties to the side and ready to receive a rocket straight up the stink. \n\nonly WDC and stx permitted though.   \ntee hee",
        "created_utc": 1622727241,
        "id": "h0frb66",
        "permalink": "/r/wallstreetbets/comments/nr9r9t/daily_discussion_thread_for_june_03_2021/h0frb66/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622756041.0
    },
    {
        "author": "DegeerMD",
        "body": "I got banned for 30 days for posting a DD on Seagate 3 months ago. I made out pretty good not near as good you have done. I seem to always miss the good ones, maybe I just can't find the good ones when every post is gme amc and memes and nor am I allowed to post anything outside of what wsb wants to show",
        "created_utc": 1623122002,
        "id": "h0znqxr",
        "permalink": "/r/wallstreetbets/comments/num4iz/remember_when_yall_downvoted_me_for_shilling_clov/h0znqxr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623150802.0
    },
    {
        "author": "aurora4000",
        "body": "Do you think that $STX is being driven up too, and for the same reasons?",
        "created_utc": 1623002297,
        "id": "h0tg4sj",
        "permalink": "/r/wallstreetbets/comments/ntqwp7/wdc_western_digital_is_being_driven_up_by_chia/h0tg4sj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623031097.0
    },
    {
        "author": "Ironleg01",
        "body": "I think you are looking at it from purely logical perspective and discounting geopolitics. Just to come back to Huawei for a second. US could have said we don't use your 5G equipment and that's final. But that's not all they did. They forbid Google licensing Android to them, they forbid everyone from selling chips from them, they even made a big fuss about Seagate selling HDDs to them. It wasn't just about 5G equipment. They destroyed the whole company just to spite China. Now, yes BABA probably don't care about spying on US but say if their cloud business really takes off, and there are these tensions with China and US really wants to damage China in any way they could just say BABA is selling software to Chinese military to enslave muslim minorities or some such bullshit and we would see all sorts of bans and sanctions. Certainly say goodbye to your ADRs. Logical? No. Makes sense to weaken your biggest rival in any way in geopolitical sense? Yea. I would not think something like that is impossible.",
        "created_utc": 1622758156,
        "id": "h0ht0we",
        "permalink": "/r/stocks/comments/nrjfab/washington_to_bar_us_investors_from_59_chinese/h0ht0we/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1622786956.0
    },
    {
        "author": "Typical-Technician46",
        "body": "UH FELLOW APES? \n\nits me the sky, just letting you know, im pulling my panties to the side and ready to receive a rocket straight up the stink. \n\nonly WDC and stx permitted though.   \ntee hee",
        "created_utc": 1622727241,
        "id": "h0frb66",
        "permalink": "/r/wallstreetbets/comments/nr9r9t/daily_discussion_thread_for_june_03_2021/h0frb66/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622756041.0
    },
    {
        "author": "Ironleg01",
        "body": "I think you are looking at it from purely logical perspective and discounting geopolitics. Just to come back to Huawei for a second. US could have said we don't use your 5G equipment and that's final. But that's not all they did. They forbid Google licensing Android to them, they forbid everyone from selling chips from them, they even made a big fuss about Seagate selling HDDs to them. It wasn't just about 5G equipment. They destroyed the whole company just to spite China. Now, yes BABA probably don't care about spying on US but say if their cloud business really takes off, and there are these tensions with China and US really wants to damage China in any way they could just say BABA is selling software to Chinese military to enslave muslim minorities or some such bullshit and we would see all sorts of bans and sanctions. Certainly say goodbye to your ADRs. Logical? No. Makes sense to weaken your biggest rival in any way in geopolitical sense? Yea. I would not think something like that is impossible.",
        "created_utc": 1622758156,
        "id": "h0ht0we",
        "permalink": "/r/stocks/comments/nrjfab/washington_to_bar_us_investors_from_59_chinese/h0ht0we/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1622786956.0
    },
    {
        "author": "JoanOfSnarke",
        "body": "$MSFT is a good buy but doubt that huge market cap is gonna get moved that much by the gaming sector. \n\nI would find maybe smaller caps that are more focused on gaming. Some suggestions: STX, CRSR, BLIZZARD, WDC.",
        "created_utc": 1623427633,
        "id": "h1f0q6z",
        "permalink": "/r/options/comments/nxhpsb/first_time_buying_call_options_is_it_smart_to_buy/h1f0q6z/",
        "score": 5,
        "subreddit": "options",
        "created": 1623456433.0
    },
    {
        "author": "commodoregoat",
        "body": "Most definitely. I plan on adding it too. Just that WDC is undervalued in comparison to Seagate.",
        "created_utc": 1623003755,
        "id": "h0tj8gv",
        "permalink": "/r/wallstreetbets/comments/ntqwp7/wdc_western_digital_is_being_driven_up_by_chia/h0tj8gv/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623032555.0
    },
    {
        "author": "Typical-Technician46",
        "body": "UH FELLOW APES? \n\nits me the sky, just letting you know, im pulling my panties to the side and ready to receive a rocket straight up the stink. \n\nonly WDC and stx permitted though.   \ntee hee",
        "created_utc": 1622727241,
        "id": "h0frb66",
        "permalink": "/r/wallstreetbets/comments/nr9r9t/daily_discussion_thread_for_june_03_2021/h0frb66/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622756041.0
    },
    {
        "author": "SleepeMonke",
        "body": "Anyone see Seagate potential in the next month or so?",
        "created_utc": 1624629334,
        "id": "h2zumed",
        "permalink": "/r/investing/comments/o7jxs2/daily_general_discussion_and_spitballin_thread/h2zumed/",
        "score": 2,
        "subreddit": "investing",
        "created": 1624658134.0
    },
    {
        "author": "jetoak",
        "body": "I am considering investing for longer term gains in a personalized portfolio (and not pay too much attention day to day) and would like to get advice on if this is good or make any adjustments:\nFB, V, TGT, CVX , RVL, INMD, APPN, GS, PYPL, GNRC, DOCU, MSFT, NVDA, STX, FTNT\nThanks in advance",
        "created_utc": 1624907282,
        "id": "h3cpws5",
        "permalink": "/r/stocks/comments/o9gs5f/rstocks_daily_discussion_monday_jun_28_2021/h3cpws5/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1624936082.0
    },
    {
        "author": "thekookreport",
        "body": "I used to own it.  It’s a duopoly with Seagate and both companies are great at capital allocation.  When The market consolidated, everything changed",
        "created_utc": 1624335841,
        "id": "h2m910a",
        "permalink": "/r/wallstreetbets/comments/o5e1gn/wdc_western_digital_corporation_technical/h2m910a/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624364641.0
    },
    {
        "author": "cacy1800",
        "body": "You just guessed that this entire page is a trap for newbies I figured this out immediately and learned how to trade properly. Amd med stx are making me money you can to I would highly suggest amd.",
        "created_utc": 1624555049,
        "id": "h2wmm4o",
        "permalink": "/r/wallstreetbets/comments/o6xtau/daily_discussion_thread_for_june_24_2021/h2wmm4o/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624583849.0
    },
    {
        "author": "cacy1800",
        "body": "MED is showing a reversal and STX is about to reverse as well",
        "created_utc": 1624455848,
        "id": "h2rmgyw",
        "permalink": "/r/wallstreetbets/comments/o69r01/daily_discussion_thread_for_june_23_2021/h2rmgyw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624484648.0
    },
    {
        "author": "TheVision2020",
        "body": "Esgc!! Hot sector, largest Bollywood library, loads of institutional investors, way undervalued and operating under the radar so institutions can keep loading up. Your hidden gem. 2000x potential in 5 years easily attainable. if STX is able to streamline this merger... Buy out potential. consolidation occurring in streaming sector and everyone is trying to get a peace of the India pie.",
        "created_utc": 1624929457,
        "id": "h3e11sw",
        "permalink": "/r/investing/comments/o7nke8/indian_stocks_blue_chips_hidden_champions/h3e11sw/",
        "score": 1,
        "subreddit": "investing",
        "created": 1624958257.0
    },
    {
        "author": "skilliard7",
        "body": "I've found I've had best luck with a balance of passive and active investing. I start with a portfolio of index funds based on factor investing(mostly chasing value premium),  and devote a small percentage of my portfolio to at most a few individual stocks where I'm confident they are undervalued.\n\nI've had a lot of luck with this strategy so far. What I've learned from my early mistakes is:\n\n1. Don't own anything unless you have a very good reason for owning it. If your reason is \"their dividend is good\", \"their business is booming\", or \"they seem like a sustainable business\", just stick with index funds. You need a compelling reason the market is not valuing them fairly, something that isn't priced in. When I bought SLV, it was because I knew it was a temporary liquidity crunch and that fed actions would drive inflation fears. When I bought LUMN, it was because I took a deep look into their financials and determined they were undervalued. When I bought Western Digital &amp; Seagate, it was because I saw the potential for Chia to boost their earnings.\n\n2. Buy as if you can't sell for 5 years. It's possible that after you buy, the price starts dropping and doesn't recover. If that happens, will you be comfortable holding it? If the answer is no, then either don't buy, or keep it to a very small position.\n\n3. Don't buy a ton individual stocks to \"diversify\". 1 stock you are confident in accounting for 5% of your portfolio and a broad market index like VTI for the remaining 95% is safer than 40 manually picked stocks each representing 2.5%.",
        "created_utc": 1623681657,
        "id": "h1qh3bt",
        "permalink": "/r/investing/comments/nz9dxc/is_bogles_style_passive_investing_really_better/h1qh3bt/",
        "score": 1,
        "subreddit": "investing",
        "created": 1623710457.0
    },
    {
        "author": "randomizedasian",
        "body": "STX I might just all in.",
        "created_utc": 1624682863,
        "id": "h32r8ze",
        "permalink": "/r/wallstreetbets/comments/o7vagy/weekend_discussion_thread_for_the_weekend_of_june/h32r8ze/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624711663.0
    },
    {
        "author": "DegeerMD",
        "body": "I got banned for 30 days for posting a DD on Seagate 3 months ago. I made out pretty good not near as good you have done. I seem to always miss the good ones, maybe I just can't find the good ones when every post is gme amc and memes and nor am I allowed to post anything outside of what wsb wants to show",
        "created_utc": 1623122002,
        "id": "h0znqxr",
        "permalink": "/r/wallstreetbets/comments/num4iz/remember_when_yall_downvoted_me_for_shilling_clov/h0znqxr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623150802.0
    },
    {
        "author": "aurora4000",
        "body": "Do you think that $STX is being driven up too, and for the same reasons?",
        "created_utc": 1623002297,
        "id": "h0tg4sj",
        "permalink": "/r/wallstreetbets/comments/ntqwp7/wdc_western_digital_is_being_driven_up_by_chia/h0tg4sj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623031097.0
    },
    {
        "author": "Ironleg01",
        "body": "I think you are looking at it from purely logical perspective and discounting geopolitics. Just to come back to Huawei for a second. US could have said we don't use your 5G equipment and that's final. But that's not all they did. They forbid Google licensing Android to them, they forbid everyone from selling chips from them, they even made a big fuss about Seagate selling HDDs to them. It wasn't just about 5G equipment. They destroyed the whole company just to spite China. Now, yes BABA probably don't care about spying on US but say if their cloud business really takes off, and there are these tensions with China and US really wants to damage China in any way they could just say BABA is selling software to Chinese military to enslave muslim minorities or some such bullshit and we would see all sorts of bans and sanctions. Certainly say goodbye to your ADRs. Logical? No. Makes sense to weaken your biggest rival in any way in geopolitical sense? Yea. I would not think something like that is impossible.",
        "created_utc": 1622758156,
        "id": "h0ht0we",
        "permalink": "/r/stocks/comments/nrjfab/washington_to_bar_us_investors_from_59_chinese/h0ht0we/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1622786956.0
    },
    {
        "author": "Typical-Technician46",
        "body": "UH FELLOW APES? \n\nits me the sky, just letting you know, im pulling my panties to the side and ready to receive a rocket straight up the stink. \n\nonly WDC and stx permitted though.   \ntee hee",
        "created_utc": 1622727241,
        "id": "h0frb66",
        "permalink": "/r/wallstreetbets/comments/nr9r9t/daily_discussion_thread_for_june_03_2021/h0frb66/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622756041.0
    }
]