[
    {
        "author": "Chippopotanuse",
        "body": "One reason is that they aren’t static indexes. They are dynamic survivor bias indexes. What does that mean? \n\nIt means they replace losers with winners. Go look at the Dow or S&amp;P components from 1980 and see how the castoffs have fared. \n\nFor the Dow, changes used to be VERY rare. From 1959-1976 there were ZERO changes. \n\nNow? It changes its components several times\na year. \n\nIf it didn’t keep doing this, it wouldn’t “perform”\nNearly as well.\n\nLook at how shitty GE has done over the past three years. They used to be THE corporate bellwether of the US economy. But GE’s plunge didn’t hurt the Dow at all. It was removed as a component in the middle of 2018. \n\nIn March of 2015 the Dow added Apple to replace AT&amp;T (once so big and fearful it had to be busted up by regulators, but is now a dogshit dividend stock). That one change alone did wonders for the Dow average. \n\nIn Sept 2013, Nike, Goldman Sachs, and Visa replaced such dogs as Hewlett-Packard and Alcoa.\n\nIn 2009, Cisco Systems replaced GM.\n\nAnyways, you get the point. The Dow and S&amp;P, by definition, will always go up over time. They will simply drop dog sticks with no future and replace them with up and coming stalwarts. \n\nI’ve often looked, but have never found, a report that would show how the Dow and S&amp;P would have performed if they didn’t modify their components and always stack the decks. \n\nTLDR: the Dow and S&amp;P change the component stocks to always contain far more winners than losers. They will rise over time. They don’t reflect the more broad stock market as a whole, nor do they reflect how the average American family is doing economically. They just reflect a basket of “winning” stocks.",
        "created_utc": 1626608826,
        "id": "h5md3jc",
        "score": 47,
        "subreddit": "stocks",
        "created": 1626637626.0
    },
    {
        "author": "Extremely-Bad-Idea",
        "body": "HPQ has been disappointing investors for the last two decades.  Today's HPQ price is the same as was in April 2000.\n\nHPQ made several ill fated acquisitions over the years including Compaq, EDS, and 3Com.  HPQ always bought companies that looked promising on the surface, but consistently failed to deliver on the bottom line.  That pattern of bad decision making remains to this day.  Look how they failed to create two distinctive company names when they spun off HPE.  Both HPQ and HPE are named Hewlett Packard, LOL.  It is staggering how stupid their leadership is.\n\nHPQ is also married to its desktop, laptop, and printing businesses to the exclusion of almost everything else.  These are mature, low profit product lines.  It is not a growth business.  In short, HPQ has been dead money for 20 years and is going nowhere.",
        "created_utc": 1626498615,
        "id": "h5hhg1f",
        "score": 8,
        "subreddit": "stocks",
        "created": 1626527415.0
    },
    {
        "author": "Ironleg01",
        "body": "It won't, I follow PC stocks and sales numbers came out 3 days ago. Way worse numbers than last Q and HPQ, Dell, Lenovo been tanking non stop. Same with peripherals including Corsair just not to such large extent. A lot of hardware sales got pushed forward and the reckoning is due. People don't buy new hardware every month.",
        "created_utc": 1626211946,
        "id": "h531853",
        "score": 6,
        "subreddit": "stocks",
        "created": 1626240746.0
    },
    {
        "author": "Lumberjacklord",
        "body": "I honestly forgot that company existed , the laptop market is so competitive that it's a matter of time before the smaller brands get bought out. Also looking at their net income and it's a mess that's currently pointy down if trends continue. Also their stock price is suppose to be going up over time HPQ is going up and down which shows that they don't have a strong solid place in the market like Apple or Amazon.\n\n&amp;#x200B;\n\nThis is just my opinion.",
        "created_utc": 1626486659,
        "id": "h5gxgxb",
        "score": 5,
        "subreddit": "stocks",
        "created": 1626515459.0
    },
    {
        "author": "FinndBors",
        "body": "&gt; This ain’t like 2000\n\nIn a ton of valuation metrics they are worse than any other time in history other than 2000. And when people think of 2000, they think of pets.com being ridiculous. Those shit companies were not in any index and pets.com was 300-400 million market cap at its peak (which it held for a very short time). You can equate pets.com to companies like NKLA which make gravity powered trucks. NKLA was ~ 30B market cap at its peak -- and it's still worth 5B+. Pets.com actually had a business / revenue, tons of SPACs are little more than post series A companies, all of them worth well over a billion.\n\nThe \"real\" megacap tech companies of 2000 were hewlett packard, microsoft, ibm, csco, intel, sun, compaq, etc. Their P/E ratios are much closer to the FAANGs of today. And most of the peak P/E ratios happened after a series of bad earnings.\n\nThe only thing that is legitimately different now than before is low interest rates. Which is why inflation / fed reaction is a genuine serious fear.",
        "created_utc": 1626571480,
        "id": "h5kueqq",
        "score": 4,
        "subreddit": "stocks",
        "created": 1626600280.0
    },
    {
        "author": "SlowRyder",
        "body": "Thank you for the additional information.\n\n\\&gt;&gt;  *\"One million physical qubits is the minimum necessary to do Shor's algo. I advice investors to invest in qc AFTER such a breakthrough occurs, not BEFORE.\"*\n\nI've read before that most disagreements in investment threads are the result of the investors involved playing different games, and I fully agree. It sounds like you have a relatively conservative investment philosophy and prefer not to make big early stage bets (which is perfectly fine/logical).\n\nMeanwhile, Google, Amazon, Samsung, Lockheed Martin, Bosch, Hewlett Packard, Airbus, Softbank, Bill Gates, Michael Dell and numerous others are playing a different game and not heeding your advice to wait to invest until after such a milestone is met.\n\nThose waiting to buy into Tesla at or below their 2010 IPO-week low never got the chance (Tesla's valuation after the first trading day was $2.22bn...they had sold just 1,063 cars at that point and their critics/doubters were many). The returns for those who waited until they hit certain milestones were still decent, but they were orders of magnitude lower than those who got in during the week after IPO.",
        "created_utc": 1625506064,
        "id": "h45br9a",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1625534864.0
    },
    {
        "author": "FullMetalOnion",
        "body": "3D printing seems like a safe long term play, I bought HPQ years ago for its market share of 3D printers and I’m up around 70% all time",
        "created_utc": 1625532812,
        "id": "h46quqh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625561612.0
    },
    {
        "author": "JVInvesting",
        "body": "Hpq",
        "created_utc": 1626550200,
        "id": "h5jpokq",
        "score": 3,
        "subreddit": "investing",
        "created": 1626579000.0
    },
    {
        "author": "clb909909",
        "body": "I do read a lot yahoo, fidelity, schwab... also stockcharts, finviz, investopedia... and on and on and on... found lots of really good stocks... most are up in the stratosphere ... still trying to figure out exactly what a \"good entry point\" is.. i've jumped into a few that have done ok.. csco, hpq, msft, dhr ( only bought 1 share and don't remember why i thought it was risky ), others, not so well.. bb ( what was i thinking?!), cpng, coin (ugh!) . Hoping to make better choices. So much to learn... so little time. Thanks for your input.. appreciate it",
        "created_utc": 1626134736,
        "id": "h4zbwi7",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1626163536.0
    },
    {
        "author": "Pelo_del_perro",
        "body": "I've been been buying shares of HPQ Silicon. China produces something like 60% of the worlds Silicon using forced labour. Hpq is a Quebec based company that is developing a more environmentally sustainable process for producing Silicon.",
        "created_utc": 1627412805,
        "id": "h6qnhfw",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1627441605.0
    },
    {
        "author": "LambdaLambo",
        "body": "&gt; Those shit companies were not in any index and pets.com was 300-400 million market cap at its peak (which it held for a very short time). You can equate pets.com to companies like NKLA which make gravity powered trucks. NKLA was ~ 30B market cap at its peak -- and it's still worth 5B+\n\nThat kinda helps my point though. NKLA tanked but it has no correlation to the overall stock market, and the whole stock market went up in fact. Same with the entire SPAC bubble. Yes it was a bubble, but it popped and the market moved on its way without missing a beat. \n\n&gt; The \"real\" megacap tech companies of 2000 were hewlett packard, microsoft, ibm, csco, intel, sun, compaq, etc. Their P/E ratios are much closer to the FAANGs of today. And most of the peak P/E ratios happened after a series of bad earnings.\n\nEven then the PE ratios are not the same. MSFT in it's peak in 1999 had a PE ratio of ~82, it now has a PE ratio of ~35. \n\nI'm not gonna say that *every* company today is fine. Many are not (including NKLA). But the 2000 was endemic throughout the market (i.e. say \"internet\" and stock 10x'd at ipo). Today the market is much more varied and plenty of companies trading at high multiples do so because they're growth is very real.\n\nSorta unrelated but I personally believe tech got an insane boost from covid which is/will be driving huge digitalization efforts and  accelerate growth for many saas/cloud centric companies.",
        "created_utc": 1626578182,
        "id": "h5l7hzl",
        "score": 2,
        "subreddit": "stocks",
        "created": 1626606982.0
    },
    {
        "author": "maybeex",
        "body": "Hewlett Packard. It was the largest tech company in the world then a few bad mistakes and tanked. Your thought process is not wrong but there is no way to predict future. Also AIG tanked as well in 2008. You can't compare now and 2008 but things can go south and it can tank fast. Always put a stop loss if you are investing in tech stocks. Good luck. \n\nJust fyi, I have Amazon and apple stocks in my portfolio.",
        "created_utc": 1625182380,
        "id": "h3qr3cv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625211180.0
    },
    {
        "author": "ssachs04",
        "body": "Just finished reading the thread on HPQ before reading this one, and the parallels are striking. Another legacy company that was once king, brought down by bad management and inertia. Intel has a better chance of turning themselves around than HPQ simply because they are still in a more dynamic (and, yes, heed the warnings, HIGHLY CYCLICAL) market.\n\nThat said, Intel is not going away and the stock is relatively cheap. Plus they may be near the start of a cyclical uptrend and getting in at the base is tempting. But, the very large negative YOY earnings growth is hard to overlook. My (old fashioned) go to metrics, MACD and stochastics are telling me that the stock is neither under or over bought or sold. INTC is drifting as it usually does. \n\nTake away: Worth watching, but has a ways to go down (and show signs of reversal) before it's a buy.",
        "created_utc": 1626530198,
        "id": "h5il4io",
        "score": 2,
        "subreddit": "stocks",
        "created": 1626558998.0
    },
    {
        "author": "SanitariumJosh",
        "body": "I have a bunch of PYR 'cause I am optimistic on the technology, same with HPQ.",
        "created_utc": 1625705388,
        "id": "h4f5qkv",
        "score": 2,
        "subreddit": "investing",
        "created": 1625734188.0
    },
    {
        "author": "soggy4u",
        "body": "Yeah HPQ and PYR ought to be included as well as CMC imo.",
        "created_utc": 1625869731,
        "id": "h4n443q",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1625898531.0
    },
    {
        "author": "doggy_lovers",
        "body": "25% Net margins is very high for hardware company, companies like hpq/sony have about 10 percent margins, so apple basically adds 10-15% more for the products and billions of people pay for it because they like the brand, quality, ecosystem, etc.",
        "created_utc": 1627149847,
        "id": "h6e05or",
        "score": 2,
        "subreddit": "investing",
        "created": 1627178647.0
    },
    {
        "author": "AMediocreWhiteGuy",
        "body": "Nokia, GE and Hewlett-Packard are some of my better stocks at the moment.",
        "created_utc": 1625503676,
        "id": "h4570td",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625532476.0
    },
    {
        "author": "DynastyNA",
        "body": "I don’t think we are allowed to talk about this on this subreddit but I am obsesssed with $CWGYF (Carnegie clean energy)\n\nRealistically they probably won’t ever be shit but they are a renewable marine energy company based in Australia that developed a technology called CETO (which is a reference to some mythological figure) that uses machine learning to predict the strength/magnitude of tidal waves that will be arriving up to 30 seconds in the future. By accurately estimating the magnitude of the future tidal wave they can calibrate their CETO device to generate a lot more energy from the wave (I still don’t understand how that works)\n\nFor a micro cap penny stock I think their future outlook is actually pretty good. They have a contract to power one of Australia’s largest naval bases, they got a $50 million grant from Microsoft to help develop the CETO tech (and I think they get help from Microsoft’s ML devs too), and I know they have a contract with Hewlett-Packard. They also are debt free I am pretty sure and recently increased their cash reserves. \n\nI just love the fact I own 109k shares for like 200 dollars lol and the whole predicting future tidal waves thing I think is cool as fuck\n\nIf you wanna learn more about them this sub is very tiny but people talk about the company on r/CarnegieCleanEnergy",
        "created_utc": 1625897045,
        "id": "h4obvg7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625925845.0
    },
    {
        "author": "merlinsbeers",
        "body": "I forgot about HPQ/E. HPQ doesn't even have the good part any more.",
        "created_utc": 1626541264,
        "id": "h5j7g5o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626570064.0
    },
    {
        "author": "NotChristina",
        "body": "26.73%. Low cost basis on GME, sold off some shares for good profit. Bought PRTA as soon as a T1 halt ended (not even knowing the news lol), up 290%. Entered SPCE low and exited on the recent jump up. Profitable calls on SOFI, CLF, ASO, HPQ, TWNK.",
        "created_utc": 1625568079,
        "id": "h482rfj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625596879.0
    },
    {
        "author": "avalanchetaco",
        "body": "I'm responding through the view of a beginner TA Trader, so this is all just an opinion. For some reason HPQ has gone down in the time period of May 10, 2021 - May 12, 2021, and has continued down since then, and looks to be continuing in the direction of down, on going. It might go up temporarily when schools open in the fall, and in November, in preparing for Christmas, etc.  \n\nMaybe HP's main revenue comes from bulk orders of HP products from corporate businesses / corporate offices, and if they are, that could also be an indicator, as most corporate employees seem to want to work from home now, or not return to work at all. \n\nAnother potential reason, is with the growing adoption of ESG becoming a requirement in all organizations around the world, perhaps HP is struggling with this as well, in how it manufactures it's products, which in turn, is affecting it's value. \n\nPlus, generally and personally, I haven't thought about HP in a few years.",
        "created_utc": 1626533604,
        "id": "h5irjv8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626562404.0
    },
    {
        "author": "hendrix_srv",
        "body": "It's best to look at the full forward Rev / Earn projections, not just the forward PE. From Schwab:\n\n2020\t2021\t2022\t--\t--\n\n$2.19\t$3.49\\*\t$3.58\\*\t--\t\\*Mean Earnings Estimate\n\nThere is a big earnings jump projected for FY20-FY21, almost 75%; but projection is flat FY21-FY22 for both earnings and revenue.  HPQ's Q1 is calendar Q4, so they are now in 21Q3 so the expectation is that almost all of the projected Earn / Rev jump is already done.\n\nI think beyond that there is a legit question of what HPQ is going to do to grow it's business.  It sells PCs and  printers.  Surely the market for printers is shrinking and the market for PCs is mature to say the least.  It doesn't appear at face value to have a foot in anything likely to grow.",
        "created_utc": 1626494930,
        "id": "h5hbxlv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626523730.0
    },
    {
        "author": "Ironleg01",
        "body": "They will resume dividends, but if you are after dividends there are plenty of low PE, high yield options. Many utilities have great dividends and are low PE, banks too are very low PE and high dividend. Heck you even have tech (legacy) trading at low PE and paying high dividend like HPQ, HPE, IBM, etc. I would think that GM is fairly priced and is not a bargain deal at the moment.",
        "created_utc": 1626814183,
        "id": "h5x589h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1626842983.0
    },
    {
        "author": "MomolanZozolan",
        "body": "Keep an eye on CLVT &amp; CNP. They're getting bought up in the private exchanges/dark pools in very large amounts. \n\n(Others of note are HPQ, SAN &amp; FCN)",
        "created_utc": 1626111002,
        "id": "h4xy6og",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1626139802.0
    },
    {
        "author": "hendrix_srv",
        "body": "&gt;Is there anything that might cause the stock to continue to grow?\n\nI get tired of hearing that argument for not buying stocks that are growing like crazy.  It's already growing like a freakin' volcanic ash cloud.  People said that about AMZN, SBUX, MSFT, CMG, HD....the list goes on.   Meanwhile the same people are like \"I'm bullish on HPQ.  It has a long record of sucking ass but the forecast is for 2.7% growth next year and the dividend IS 2.5%!!!  Whooo hooo!!  Great value!!!\".",
        "created_utc": 1626563304,
        "id": "h5kezaf",
        "score": -1,
        "subreddit": "investing",
        "created": 1626592104.0
    },
    {
        "author": "RecklessWiener",
        "body": "SMH - semiconductors \n\nTop holdings:\n\nTSM\n\nNVDA \n\nASML \n\nINTC\n\nLRCX",
        "created_utc": 1625235808,
        "id": "h3t36xp",
        "score": 41,
        "subreddit": "investing",
        "created": 1625264608.0
    },
    {
        "author": "coolcomfort123",
        "body": "AMAT, LRCX, SWKS and QRVO.",
        "created_utc": 1625697144,
        "id": "h4ep9ez",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625725944.0
    },
    {
        "author": "GeezWhizGuys",
        "body": "That was me. Didn't check today, but NVDA and LRCX cooked my balls.  \n\nEDIT: oh fuck you!",
        "created_utc": 1626472781,
        "id": "h5g62sh",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1626501581.0
    },
    {
        "author": "apooroldinvestor",
        "body": "MSFT GOOGL AMZN AAPL NVDA LRCX ASML PYPL UNH .... Have beat the market for many years.\n\nUNH has returned 21% a year since 2000.  21 years it has beat the market.",
        "created_utc": 1625179706,
        "id": "h3qlq1c",
        "score": 6,
        "subreddit": "stocks",
        "created": 1625208506.0
    },
    {
        "author": "reddit-is-sus666",
        "body": "MU, ASX, QCOM, SWKS, AMAT, LRCX, AMD, and a few other that are around the 30 or less PE are all going to see strong growth. The sector of semiconductors has a lot of companies but they can all be successful and have huge business due to the size of the market. Semiconductors/microchips whatever you wanna call them are literally in everything we buy now except food/water (hopefully? Lol). \n\n\n\nI'm long Gas/Oil (XOM, COP) and Semiconductors the next couple years. Steel is a great play too, my favorite being CLF or NUE. I know the hype with electric vehicles but there are so many more aspects to oil/gas than cars. Gas/oil is going to be needed in large quantities for a decent amount of time ahead of us.",
        "created_utc": 1626364897,
        "id": "h5aeiwo",
        "score": 5,
        "subreddit": "options",
        "created": 1626393697.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Yeah but if you're long term 10+ years MSFT NOW is cheap as are most good companies.\n\nI like ASML and LRCX and NVDA of course.  PYPL and also UNH HUM and scientific medical companies.  Healthcare is great. People are living longer and healthcare is a huge expense that will only make more and more money as years go by.",
        "created_utc": 1625425912,
        "id": "h41wkuj",
        "score": 5,
        "subreddit": "stocks",
        "created": 1625454712.0
    },
    {
        "author": "Beagleoverlord33",
        "body": "Abbv is probably my favorite dividend  stock that pays a higher yield. Plenty of good choices if you want smaller yield with some growth. I like AMAT LRCX LOW MSFT AAPL QSR FANG",
        "created_utc": 1625262711,
        "id": "h3uu9iu",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625291511.0
    },
    {
        "author": "apooroldinvestor",
        "body": "MSFT NVDA GOOGL AAPL AMZN LRCX ASML CRWD. You just buy and hold, dont sell.",
        "created_utc": 1626316358,
        "id": "h589i75",
        "score": 4,
        "subreddit": "stocks",
        "created": 1626345158.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Not if you buy MSFT AAPL PYPL GOOGL NVDA UNH HD LRCX ASML etc ....",
        "created_utc": 1625954361,
        "id": "h4qu9j4",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625983161.0
    },
    {
        "author": "coolcomfort123",
        "body": "TSM, AMD, LRCX, AMAT, SWKS and QRVO are good long term semi stocks.",
        "created_utc": 1625512368,
        "id": "h45o6vx",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625541168.0
    },
    {
        "author": "ajandl",
        "body": "They are both equipment suppliers (so same as ASML and AMAT) and have each of them supply first in class solutions to critical steps.\n\nAMAT and LRCX are often considered direct competitors, along with TEL (but that's listed on the Nikkei).",
        "created_utc": 1626346651,
        "id": "h59f6tr",
        "score": 3,
        "subreddit": "investing",
        "created": 1626375451.0
    },
    {
        "author": "omarc1492",
        "body": "650C on LRCX",
        "created_utc": 1626093522,
        "id": "h4wwtq3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626122322.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "hahah holy shit you're insane\n\ni'm going to go off top of my head\n\nCRWD, NET, ZS\n\nTGT, NKE, SBUX (its in your username!), GPS, LB, RH, DPZ, MCD, list goes on...\n\nNVDA is big tech but lets go with MU, LRCX, AMAT\n\nlol",
        "created_utc": 1626209167,
        "id": "h52v8o0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626237967.0
    },
    {
        "author": "apooroldinvestor",
        "body": "MSFT NVDA UNH HD PYPL LRCX to name a few.  You don't need Vanguards help.",
        "created_utc": 1625179967,
        "id": "h3qm9i0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625208767.0
    },
    {
        "author": "puregoblinvomit",
        "body": "My absolute fav, LRCX is more than 50% of my portfolio now, not on purpose but it just absolutely killed it last year. Also demand for NAND memory is only going to get stronger this year into next.",
        "created_utc": 1625435720,
        "id": "h42frb8",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625464520.0
    },
    {
        "author": "reddit-is-sus666",
        "body": "There's aren't many undervalued Semiconductor stocks based on the avg PE ratio in the sector, but AMAT is one of them. The others I have picked out are:\n\nASX\n\nII-VI\n\nKLAC\n\nLRCX\n\nMU\n\nQCOM\n\nSWKS\n\nTER\n\nTSM\n\n\n\n\nAMD is my favorite overall but after the recent run I'd wait for a better entry/try to swing some puts since it has never stayed up after a run",
        "created_utc": 1626018054,
        "id": "h4tfu9c",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1626046854.0
    },
    {
        "author": "georgiosauce",
        "body": "ASML only makes one type of machine really. Applied materials and lam research are the biggest companies for the rest of the fabrication process. KLA Tencor makes a lot of metrology equip for fabs as well. There are other big players but I don’t think they’re public, if they are they might be held by other companies",
        "created_utc": 1625428784,
        "id": "h4228ud",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625457584.0
    },
    {
        "author": "APComet",
        "body": "Nvda? Doubt. Idk about lrcx so no comment",
        "created_utc": 1625902770,
        "id": "h4oihid",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625931570.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I don't.  I believe that FANMAG will continue to perform well.  As will semiconductor equipment stocks ASML LRCX etc.  Healthcare UNH .\n\nMost stocks appreciate long term.",
        "created_utc": 1625625772,
        "id": "h4b8lo1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625654572.0
    },
    {
        "author": "jaw0",
        "body": "Lam Research (LRCX) &amp; ASML make the machines that make the chips.",
        "created_utc": 1625147156,
        "id": "h3oke6p",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625175956.0
    },
    {
        "author": "CrimsonKindle",
        "body": "LRCX has been on a tear and they keep revising guidance upwards",
        "created_utc": 1625684412,
        "id": "h4dw3an",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625713212.0
    },
    {
        "author": "apooroldinvestor",
        "body": "20 stocks only. $10k into LRCX ASML NVDA from 2000 etc would be worth millions now.",
        "created_utc": 1625603112,
        "id": "h49zkbv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625631912.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Doesn't embarrass me! I'm right. $10k in NVDA LRCX ASML SHW etc have produced WAY more than the sp500! Check out portfolio visualizer.\n\nDid you see how tech did again today?",
        "created_utc": 1625618157,
        "id": "h4au4x0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625646957.0
    },
    {
        "author": "apooroldinvestor",
        "body": "How about ASML and LRCX?!",
        "created_utc": 1625511211,
        "id": "h45lw9l",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625540011.0
    },
    {
        "author": "greenappletree",
        "body": "&gt;LRCX &amp; ASML\n\nPerformance these two companies seems to be very similar.  However, ASML looks like its more focus, more moat?  I like both though.",
        "created_utc": 1625150494,
        "id": "h3orlat",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625179294.0
    },
    {
        "author": "apooroldinvestor",
        "body": "You need MSFT AAPL PYPL NVDA ASML LRCX GOOGL.",
        "created_utc": 1625414263,
        "id": "h418tth",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1625443063.0
    },
    {
        "author": "Quirky-Touch7616",
        "body": "Applied materials \nAsml \nTsmc \nLam research",
        "created_utc": 1625451123,
        "id": "h435blm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625479923.0
    },
    {
        "author": "smokeyjay",
        "body": "yeah, I sold off my TSM and consolidated my semi play into LRCX in order to trim my portfolio.  LRCX has greater room for growth imo.\n\nHaving multiple semi names seems excessive.  Go buy an ETF in that case.",
        "created_utc": 1625687851,
        "id": "h4e3yh5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625716651.0
    },
    {
        "author": "ajandl",
        "body": "Don't forget LRCX and KLA",
        "created_utc": 1626315777,
        "id": "h588dtz",
        "score": 1,
        "subreddit": "investing",
        "created": 1626344577.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Bonds are terrible investments NOW.  There are better alternatives like MSFT JNJ PG etc.\n\nEven solid semiconductor equipment companies like LRCX and ASML.\n\nThere's risk of losing money and also risk from losing potential return.  Risk is how you see it.",
        "created_utc": 1625512222,
        "id": "h45nwch",
        "score": 0,
        "subreddit": "stocks",
        "created": 1625541022.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Why etfs? What if I hold a percentage in good stocks like LRCX PYPL MSFT etc? I don't consider good companies gambling really. LRCX and ASML make equipment that fascilitate semiconductors which are here to stay and to me will continue growing and growing.",
        "created_utc": 1625957820,
        "id": "h4r0lr7",
        "score": 0,
        "subreddit": "stocks",
        "created": 1625986620.0
    },
    {
        "author": "s0uly",
        "body": "AMD, NVDA, TSM, ON, AMAT, ASML, LRCX, MU\n\nOr SMH/SOXX",
        "created_utc": 1625720270,
        "id": "h4fw2nh",
        "score": 0,
        "subreddit": "stocks",
        "created": 1625749070.0
    },
    {
        "author": "apooroldinvestor",
        "body": "MSFT is the best along with NVDA LRCX ASML CRWD.  I'm also into healthcare stocks like UNH.  And I have a medical equipment mutual fund doing well in my IRA.  \n\nDon't listen to negative people.  The market always goes up regardless of corrections.",
        "created_utc": 1625507849,
        "id": "h45f9uu",
        "score": 0,
        "subreddit": "stocks",
        "created": 1625536649.0
    },
    {
        "author": "smokeyjay",
        "body": "Great comment.  I hold lrcx because i expect the semi demand to extend for a few more years but whose to say when it goes bust.\n\nDo you own any semis?",
        "created_utc": 1625735617,
        "id": "h4gdzrn",
        "score": 0,
        "subreddit": "stocks",
        "created": 1625764417.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Cause you don't know how to invest. Msft Google nvda ASML LRCX etc.",
        "created_utc": 1626548863,
        "id": "h5jn1iy",
        "score": -2,
        "subreddit": "stocks",
        "created": 1626577663.0
    },
    {
        "author": "dafazman",
        "body": "AAPL, MSFT, AMZN, NVDA, LRCX",
        "created_utc": 1625870972,
        "id": "h4n6fvi",
        "score": -2,
        "subreddit": "stocks",
        "created": 1625899772.0
    },
    {
        "author": "VATruckerJJ",
        "body": "So basically, short CHPT, PLUG, BLNK, MPWR. Because it make sense that it would go up, gotta apply the wsb inversion",
        "created_utc": 1625267587,
        "id": "h3v3xjq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625296387.0
    },
    {
        "author": "zdonowitz",
        "body": "Sell the profit so you are back to your initial investment. Do whatever u want with the profits. But i have to say, there’s really no reason to sell Apple or Microsoft ever",
        "created_utc": 1625526060,
        "id": "h46eiwq",
        "score": 743,
        "subreddit": "stocks",
        "created": 1625554860.0
    },
    {
        "author": "Philanthropy-",
        "body": "I’m so close to giving up and just putting everything (with the exception of amazon and Microsoft) into an S&amp;P 500 index fund bc I have come to the conclusion that there is no way I can beat the market",
        "created_utc": 1625543377,
        "id": "h4799a0",
        "score": 195,
        "subreddit": "stocks",
        "created": 1625572177.0
    },
    {
        "author": "Machiavelli127",
        "body": "My version of MAGA: MSFT, AMZN, GOOG, AAPL",
        "created_utc": 1625441999,
        "id": "h42qx94",
        "score": 183,
        "subreddit": "stocks",
        "created": 1625470799.0
    },
    {
        "author": "amg-rx7",
        "body": "Apple Amazon Microsoft Nvidia PayPal Square Costco Walmart plus a few good EFTs",
        "created_utc": 1625437049,
        "id": "h42i7nt",
        "score": 172,
        "subreddit": "stocks",
        "created": 1625465849.0
    },
    {
        "author": "Yo_IDK_Dude",
        "body": "Without putting any thought into this at all… Microsoft",
        "created_utc": 1625265002,
        "id": "h3uyved",
        "score": 145,
        "subreddit": "stocks",
        "created": 1625293802.0
    },
    {
        "author": "Isunova",
        "body": "$MSFT is a stock a hold forever.",
        "created_utc": 1625431503,
        "id": "h427m94",
        "score": 138,
        "subreddit": "stocks",
        "created": 1625460303.0
    },
    {
        "author": "BrandedStrategy",
        "body": "I am not disagreeing with you but I would like to ask when do we consider a stock ethical? Here are a few examples...\n\nNike, Mars, Kraft, Apple, Google, Microsoft and Tesla (just to name a few) have all been accused and used child labour to keep operating costs low and profits high.\n\nTesla was accused of instigating a coup in Bolvia for their lithium.\n\nThe US government + energy companies invade countries, mine the oceans and frack the country to keep oil prices low.\n\nBig Pharma (in the US) monopolize life-saving drugs i.e. insulin, inhalers preventing many people from being able to afford healthcare. \n\nMcdonalds + Big sugar investing in studies to convince people that their products are not bad for you. Obesity is a huge problem, heart disease is one of the biggest killers.",
        "created_utc": 1625485732,
        "id": "h44caz7",
        "score": 115,
        "subreddit": "stocks",
        "created": 1625514532.0
    },
    {
        "author": "AyyyyyyyLemao",
        "body": "Pentagon plans to divide the work between Amazon and Microsoft per Bloomberg",
        "created_utc": 1625592687,
        "id": "h49c8n1",
        "score": 105,
        "subreddit": "stocks",
        "created": 1625621487.0
    },
    {
        "author": "discovery999",
        "body": "VUG, VOO, AAPL, GOOGL, MA, IEP, MSFT, AMZN, FB",
        "created_utc": 1625432475,
        "id": "h429j4f",
        "score": 90,
        "subreddit": "stocks",
        "created": 1625461275.0
    },
    {
        "author": "Oraclequest",
        "body": "$MSFT is great investment, great dividend, better returns.\n\nIt's a long term bet for sure.",
        "created_utc": 1625432396,
        "id": "h429dmd",
        "score": 89,
        "subreddit": "stocks",
        "created": 1625461196.0
    },
    {
        "author": "gupbiee",
        "body": "Make it free is my general policy. But with stocks like AAPL and MSFT I'd just hold cuz at the moment they're kinda too big to fail (or tank for the immediate future)",
        "created_utc": 1625537450,
        "id": "h46z84g",
        "score": 87,
        "subreddit": "stocks",
        "created": 1625566250.0
    },
    {
        "author": "FlameoHotman-_-",
        "body": "This has to be an unpopular opinion...and for the record, I distrust the CCP as much as the next person, but these crackdowns may not be entirely bad. Let's look at some examples:\n\n\\- So in this case, Didi's operation got suspended because \"Didi had illegally collected users' personal data.\"\n\n\\- Alibaba got fined because of monopolistic practices.\n\n\\- Ant Group's IPO got slashed because the CCP wanted to regulate Ant Group like an actual bank.\n\nTo be honest, these sound pretty reasonable to me. Facebook was in trouble for collecting data without content too. Remember the whole Cambridge Analytica scandal? But now everyone is hot for FB stocks.\n\nMicrosoft has been fined millions by the EU for monopolistic practices as well. But everyone loves Microsoft stocks nonetheless. \n\nAnd as to Ant Group, they are a massive financial service company that can offer customers credit. How come they don't get to be regulated like a bank? My point is that these actions make sense and good regulations is beneficial for investors too in the long run.",
        "created_utc": 1625412759,
        "id": "h415r1e",
        "score": 76,
        "subreddit": "investing",
        "created": 1625441559.0
    },
    {
        "author": "FaatmanSlim",
        "body": "Been holding MSFT For a while now. While it goes through periods like last week, where the stock pops 1-2% a day, this stock is a bit more of a slow burn. If you look back at the past 4-5 years, it as beaten other FAANG stocks at how fast it has grown, but at times, its growth can seem downright glacial.\n\nThis is not a \"get rich quick\" stock, but I feel it's definitely a long-term growth stock if you look out a few years into the future.",
        "created_utc": 1625432788,
        "id": "h42a4ii",
        "score": 65,
        "subreddit": "stocks",
        "created": 1625461588.0
    },
    {
        "author": "quickclickz",
        "body": "That was public information in March and then in May...\n\nhttps://www.bloomberg.com/news/articles/2021-03-05/microsoft-s-10-billion-pentagon-deal-at-risk-amid-amazon-fight\n\nhttps://www.fool.com/investing/2021/05/10/pentagon-considers-dropping-microsoft-jedi-effort/\n\nshe made her purchase in May.... when the information was already public.",
        "created_utc": 1625597132,
        "id": "h49m3tb",
        "score": 64,
        "subreddit": "options",
        "created": 1625625932.0
    },
    {
        "author": "Jr4044",
        "body": "Surprised MSFT takes so much scrolling to find",
        "created_utc": 1625442974,
        "id": "h42sk27",
        "score": 63,
        "subreddit": "stocks",
        "created": 1625471774.0
    },
    {
        "author": "BGoode348",
        "body": "Msft for sure.",
        "created_utc": 1625274503,
        "id": "h3vgk3w",
        "score": 59,
        "subreddit": "stocks",
        "created": 1625303303.0
    },
    {
        "author": "one8e4",
        "body": "Lawyers will win. \n\nTime to see if the law firms Amazon and Microsoft use are listed",
        "created_utc": 1625591358,
        "id": "h4999pr",
        "score": 55,
        "subreddit": "stocks",
        "created": 1625620158.0
    },
    {
        "author": "Dav1d13",
        "body": "AAPL/MSFT/GOOGL/AMZN and go back to my daily life, knowing that I am in good shape!",
        "created_utc": 1625160913,
        "id": "h3pf3j1",
        "score": 51,
        "subreddit": "stocks",
        "created": 1625189713.0
    },
    {
        "author": "360NoScopeDropShot69",
        "body": "The legend of Joco the shrimp man, Bry drinks his piss if Spy closes green, Chinese dam puts, Microsoft 200, Tesla battery day \n\nThere's a ton",
        "created_utc": 1625441327,
        "id": "h42pseo",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1625470127.0
    },
    {
        "author": "BornAcanthocephala10",
        "body": "Microsoft",
        "created_utc": 1625279465,
        "id": "h3vp4dw",
        "score": 45,
        "subreddit": "stocks",
        "created": 1625308265.0
    },
    {
        "author": "warrior5715",
        "body": "Yes, msft is enron.... “Bingo”",
        "created_utc": 1625448901,
        "id": "h432072",
        "score": 39,
        "subreddit": "stocks",
        "created": 1625477701.0
    },
    {
        "author": "Spork_Warrior",
        "body": "Just because they are advertising for a job that leverages Microsoft doesn't mean that's the only platform they use.\n\nCompanies like Palantir tend to have agreements with all major cloud providers and they have expertise in multiple platforms.",
        "created_utc": 1625251198,
        "id": "h3u4e34",
        "score": 39,
        "subreddit": "stocks",
        "created": 1625279998.0
    },
    {
        "author": "Dgarciarieckhof23",
        "body": "MSFT no doubt",
        "created_utc": 1625280295,
        "id": "h3vqhn6",
        "score": 38,
        "subreddit": "stocks",
        "created": 1625309095.0
    },
    {
        "author": "KyivComrade",
        "body": "DAAMN has been treating me well so far. \n\n\n\nDisney, Apple, Amazon, Microsoft and Netflix.",
        "created_utc": 1625562586,
        "id": "h47wy88",
        "score": 38,
        "subreddit": "stocks",
        "created": 1625591386.0
    },
    {
        "author": "Podcastsandpot",
        "body": "Apple, Tesla, Nvidia, Amazon, Microsoft, Square",
        "created_utc": 1625436337,
        "id": "h42gwdm",
        "score": 37,
        "subreddit": "stocks",
        "created": 1625465137.0
    },
    {
        "author": "The0Walrus",
        "body": "NVDA, DIS, MSFT",
        "created_utc": 1625442442,
        "id": "h42robt",
        "score": 37,
        "subreddit": "stocks",
        "created": 1625471242.0
    },
    {
        "author": "JaegerBrick",
        "body": "She sits on relevant committees that affect choosing vendors for various government contracts. There is no law punishing insider trading for US government officials. She likely did nothing criminal under the current law. She also made a ton on $MSFT a few months ago. We can say her husband made the trades, but at the end of the day she is the one on the relevant budget committees and her name is on the trades.",
        "created_utc": 1625591570,
        "id": "h499qm8",
        "score": 37,
        "subreddit": "options",
        "created": 1625620370.0
    },
    {
        "author": "cen0812",
        "body": "AAPL, MSFT, and VOO.",
        "created_utc": 1625438093,
        "id": "h42k3xl",
        "score": 36,
        "subreddit": "stocks",
        "created": 1625466893.0
    },
    {
        "author": "Sik-Kunt",
        "body": "She bought before the split was announced and before the government cancelled the MSFT Jedi contract. As if she already knew. Because she did.",
        "created_utc": 1625599335,
        "id": "h49qz6s",
        "score": 34,
        "subreddit": "options",
        "created": 1625628135.0
    },
    {
        "author": "financiallyanal",
        "body": "Gates has argued tech companies deserve a lower multiple due to obsolescence risk. People price some of these things like they’ll all have the durability of Coca Cola and margins of Microsoft. Very few discuss the reality of businesses not lasting forever, but I agree it’s critical.",
        "created_utc": 1625512633,
        "id": "h45oply",
        "score": 33,
        "subreddit": "SecurityAnalysis",
        "created": 1625541433.0
    },
    {
        "author": "Burgerb",
        "body": "I have that dilemma: I bought things like TTD, SHOP, NVDA, MSFT and others.  Stocks have multiplied and I want to take gains and put them in an Index fund.  However, I'm worried about the Tax implications when I sell.  What should I do?",
        "created_utc": 1625171016,
        "id": "h3q2jdm",
        "score": 33,
        "subreddit": "investing",
        "created": 1625199816.0
    },
    {
        "author": "seattletechy",
        "body": "I am surprised it didn’t take off after the Xbox/Microsoft integration last week.  Just to give you a perspective it takes almost 2-3 years to convince a company of Microsoft’s size to agree for an integration such as this one.  They have 100s of millions users.  While Paysafe is starting with the Xbox team Microsoft’s payments stacks serves the entire company including  Azure, office, windows and Teams.  Now imagine the size of the customer base Paysafe has.",
        "created_utc": 1625361862,
        "id": "h3z8ngq",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1625390662.0
    },
    {
        "author": "baskinginthesunbear",
        "body": "Paysafe is fucking useless to deal with from a merchant standpoint. Incredibly poor processes and controls. Constant fuck-ups. Zero accountability. Honestly surprised a company as big as Microsoft wants to deal with them.",
        "created_utc": 1625408936,
        "id": "h40y7aa",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1625437736.0
    },
    {
        "author": "bagelwhore_x0",
        "body": "Killing it! I’m at like 20% profit all time and I’m ready to just stick with trading blue chip stocks and msft is my favorite. It’s the most predictable imo. I missed out on it tho this week chasing some other stocks and now I learned my lesson not to stray from my bestie Microsoft",
        "created_utc": 1625252893,
        "id": "h3u8ct0",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1625281693.0
    },
    {
        "author": "averagebensimmons",
        "body": "I see so many mentions of AMD and APPL and I'm like hey you know there is MSFT?",
        "created_utc": 1625444726,
        "id": "h42vgpk",
        "score": 28,
        "subreddit": "stocks",
        "created": 1625473526.0
    },
    {
        "author": "lilaznjocky",
        "body": "Anything that is well diversified tbh. MSFT Amazon. They have their hands in everything, and they can’t have everything fail. Just wait to get 100 shares and sell covered calls on the way up.",
        "created_utc": 1625431497,
        "id": "h427lun",
        "score": 27,
        "subreddit": "stocks",
        "created": 1625460297.0
    },
    {
        "author": "Captain_Yolo_",
        "body": "Told my parents I'm finally taking the position at Microsoft. I'm tired of not making a difference.\n\n\nAs third shift janitor I promise to make sure those urinals are licked clean and the floors polished to a mirror finish 👌",
        "created_utc": 1625272323,
        "id": "h3vcn3n",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1625301123.0
    },
    {
        "author": "MyParanoidEyes",
        "body": "MSFT, GOOGL, VISA, Amazon, the big guns",
        "created_utc": 1625424318,
        "id": "h41tdwk",
        "score": 26,
        "subreddit": "stocks",
        "created": 1625453118.0
    },
    {
        "author": "Rclarkttu07",
        "body": "Doing the same with $25 each week split into apple Amazon and Tesla. Also buy 1 msft a month and one VTI. Hoping to sell my AMC shares to spread out if it ever takes off again.",
        "created_utc": 1625603775,
        "id": "h4a14ty",
        "score": 23,
        "subreddit": "investing",
        "created": 1625632575.0
    },
    {
        "author": "coolcomfort123",
        "body": "msft is on fire, it just keep going up.",
        "created_utc": 1625233776,
        "id": "h3syq7d",
        "score": 22,
        "subreddit": "stocks",
        "created": 1625262576.0
    },
    {
        "author": "WolfPackWSB",
        "body": "Yup that was me in October 2020 buying GME @ $11 and averaged all the way down to $7.87 after Microsoft said they would give GME a % of every digital sale on the Xbox console!! Put every penny I could $13,700 then another $138/week after that.. Made my 2 year old daughter a Millionaire",
        "created_utc": 1625663518,
        "id": "h4cm300",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1625692318.0
    },
    {
        "author": "Pdicky69",
        "body": "$NET is on a fundamental basis is over valued. They expect rev to be $500M+ this year but they trade at $33B. It’s been on of my biggest picked winners. \n\nHere is a quick breakdown of what the popular services they offer, highly scaleable and a HUGE TAM.\n\nhttps://www.freelancer.com/articles/web-development/cloudflare\n\nHowever I sold off at $75, $85 levels due to price action getting ahead of the fundamental business. I’ve exited about 50% of my position. I still have 200 shares because I believe, it could do some long term stuff well and be a $100B company. But I can’t allocate so much of my portfolio in this company vs a FB/AMZN/GOOG (where I get growth, balance sheet safety, and moat)\n\nFrom here, if you want to get in on the action. You have to believe they do a few things…\n1) surprise HEAVILY on revenue growth and forward guidance\n2) grow more into their cyber security suite of tools beyond just basic stuff like their widely used DDOS prevention (a ton of websites use them for this) and firewall \n3) Content delivery network investment trend continues and profit margins aren’t competed away with bigger boys entering the game (ie GOOG, MSFT, AMZN)\n4) website speeds overwhelmingly determine ranking on google and mobile searches\n\nCloudflare and Fastly are the two more popular services for websites and apps to use as they offer ease of use to speed up website access for users and support to prevent website downtime. Folks have frequently complimented on how easy cloudflare is to use.",
        "created_utc": 1625514830,
        "id": "h45t0z8",
        "score": 22,
        "subreddit": "stocks",
        "created": 1625543630.0
    },
    {
        "author": "Shadow23z",
        "body": "Msft",
        "created_utc": 1625160818,
        "id": "h3peviw",
        "score": 21,
        "subreddit": "stocks",
        "created": 1625189618.0
    },
    {
        "author": "defenstrate5731",
        "body": "Investing in ETFs, specifically the S&amp;P ones you’re going to come out in top. That’s why actively trading/day trading/swing trading people hate on is because you typically won’t be the market. \n\nPersonally, I have about 30% in VOO and rest in individual stocks, but big names like MSFT, FB,DIS, JPM, etc.  \n\nIf you’re lazy and don’t really want to do the research, stick to ETFs like VOO, VTI, VTSAX, etc.",
        "created_utc": 1625249575,
        "id": "h3u0irf",
        "score": 20,
        "subreddit": "investing",
        "created": 1625278375.0
    },
    {
        "author": "teslas_love_pigeon",
        "body": "Don't disturb the retards with your facts please.\n\nNext think you're going to tell me is that Palantir doesn't have deals with Facebook, Google, Microsoft, and Amazon and they are just listing react, vscode, and aws in job ad.",
        "created_utc": 1625255630,
        "id": "h3uenb0",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1625284430.0
    },
    {
        "author": "RunningJay",
        "body": "Let's take MSFT at 20%. Let's say you put $5000 in and you're now at $6000.  I always like to keep the capital invested and take only profit so I'd sell 4x MSFT, or if I was more confident only 3x @ \\~$832.95.\n\nNow technically you're not taking profits exactly, you're just taking cash off the table.\n\nWith AAPL, same theory, if you invested $1000, you're currently at $1500, so sell $500 worth to return to your original capital investement.\n\n&amp;#x200B;\n\nWhatever you do with that $ better out-perform MSFT or AAPL, otherwise, just leave it there.",
        "created_utc": 1625536498,
        "id": "h46xj51",
        "score": 20,
        "subreddit": "stocks",
        "created": 1625565298.0
    },
    {
        "author": "doggy_lovers",
        "body": "Microsoft in the 1990s was the most valuable company in the world switching spots with GE, it is currently the only company that was in the top 10 list in 1990 and is currently still top 10 right now (at #2 spot behind apple). It was the #1 company by marketcap in 2019 and march 2020.\n\nMoreover, It has never fallen out of the top 10 list for more than 20+ years even with failure of Ballmer, tech bubble crash, Nokia, etc. Now with the new ceo, I dont see it going out of the top 10 especially since it is so far ahead from #10 spot which is Alibaba at 600 billion market cap. (Microsoft is worth 2.1 trillion).\n\nBack in the 1990s #1 spot had 200 billion valuation compared to 100 billion for #10 spot. So now the Top 5 companies are much more valuable compared to the bottom 5 of the list. Unlike the 1990s the top companies were not investing to the future and focus on short term profits.\n\nMicrosoft continues to invest in the future with the cloud technology, ai, vr/ar tech as well as is extremely diversified with equal 33% weight in 3 different classified segments.(the other trillion companies aren't as diversified). Finally, it is one of two companies (other being JNJ) with triple AAA credit rating, higher than the US government. It faces less regulatory risk than tech giants competitors allowing for easy acquisitions thanks to its stellar balance sheet.\n\nSource: https://en.wikipedia.org/wiki/List_of_public_corporations_by_market_capitalization#2012",
        "created_utc": 1625340104,
        "id": "h3y6e91",
        "score": 19,
        "subreddit": "stocks",
        "created": 1625368904.0
    },
    {
        "author": "FlyersTime",
        "body": "Amazon \nNvidia\nMicrosoft \nApple \n\nThat’s all you fucking need",
        "created_utc": 1625662084,
        "id": "h4cjmmm",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1625690884.0
    },
    {
        "author": "harrison_wintergreen",
        "body": "ELI5: \n\n- Burry believes (as he wrote): \"passive investing has removed price discovery from the equity markets\". https://www.bloomberg.com/news/articles/2019-09-04/michael-burry-explains-why-index-funds-are-like-subprime-cdos\n\n- price discovery is the process of estimating a reasonable fair value for a stock. \n\n- because relatively few people are buying/selling stocks based on their fair value, prices for stocks are often being determined mainly by cash-flows. see Tesla or dogecoin for examples. Tesla sells under 1% all vehicles worldwide but is somehow worth *more than all the other carmakers combined* because lots of people were buying Tesla stock and not because of any financial status of Tesla. dogecoin started LITERALLY as a joke but somehow was more valuable than companies like Ford Motors only because a ton of cash flowed into Dogecoin. this is all sheer insanity by traditional stock valuation guidelines. asset bubbles are nothing new, but Burry believes it's being exacerbated by passive investing. \n\n- Burry believes this situation of prices being based on cash flows is similar to what happened in the housing bubble, when multi-zillion Collateralized Debt Obligations (CDOs) were being priced not by a reasonable estimate of their fair value but by cash-flows. \n\n- when flows reverse and lots of people want out of index funds, it will get ugly because so many stocks are linked/benchmarked to major stock indexes *including lower volume stocks*. consider VTI: the top holdings (Apple, Microsoft, Johnson &amp; Johnson) might have a billion shares in total and hundreds of millions of dollars trading each day. but the smallest company stocks might have only a few million shares and a few million dollars trading each day. if too many people want to sell all at the same time, it will drive prices down sharply because these stocks are so often sold as a bundle/unit. as Burry puts it: \"The theater keeps getting more crowded, but the exit door is the same as it always was\"\n\n&gt;since the guy predicted 2007-2008 crash.\n\nhe also predicted the dot-com bubble.",
        "created_utc": 1625611801,
        "id": "h4ai1k1",
        "score": 19,
        "subreddit": "stocks",
        "created": 1625640601.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "seriously ppl.\n\njust buy big tech calls.\n\n if 2020 hasnt taught you this... or the bounce from Feb/March correction, or May pull back... not sure what will.\n\nyeah you can buy meme shit and pray that this week is when it decides to do meme shit vs pump &amp; dump by ppl\n\nor you can buy AAPL, MSFT, GOOGL, AMZN, FB, and NVDA calls and make actual fucking money and be able to sleep at night.\n\n* poor? do AAPL/MSFT/FB monthlies + leaps on dips.\n\n* got $ to blow? GOOGL and NVDA calls apparently doesnt know when to stop mooning\n\n* adventurous ppl can do AMZN monthlies and try to time AMZN's year-long channel of low 3000s to 3500s.",
        "created_utc": 1625257131,
        "id": "h3ui223",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1625285931.0
    },
    {
        "author": "StonksInvesteur",
        "body": "MSFT 300 calls, anyone?",
        "created_utc": 1625571987,
        "id": "h487i74",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1625600787.0
    },
    {
        "author": "gcko",
        "body": "Almost same. \n\nHolding AAPL, MSFT, DIS, VCR all the way to retirement unless something major happens to these companies. \n\nOh and at least a couple shares of GME I bought at $69 which I will eventually transfer into my children’s college fund. It’ll make a good story.",
        "created_utc": 1625441988,
        "id": "h42qwkq",
        "score": 18,
        "subreddit": "stocks",
        "created": 1625470788.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Like MSFT?",
        "created_utc": 1625422990,
        "id": "h41qp81",
        "score": 18,
        "subreddit": "stocks",
        "created": 1625451790.0
    },
    {
        "author": "hardtoexplainnnnn",
        "body": "MSFT was going up like this back in january-february. same with the other tech stocks. all tech stocks seem to be rising a lot again lately too. i think the tech bull run is back.",
        "created_utc": 1625432779,
        "id": "h42a3tw",
        "score": 17,
        "subreddit": "stocks",
        "created": 1625461579.0
    },
    {
        "author": "TheFilterJustLeaves",
        "body": "Probably fucked. MSFT doesn’t pump. It is the blob slowly eating everything in its path.",
        "created_utc": 1625345803,
        "id": "h3yh6y5",
        "score": 16,
        "subreddit": "options",
        "created": 1625374603.0
    },
    {
        "author": "NigelRL",
        "body": "I bought MSFT puts so it will go higher 🚀",
        "created_utc": 1625609358,
        "id": "h4ad1hv",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1625638158.0
    },
    {
        "author": "CountTheForDown",
        "body": "Tech has fooled me a couple of times over the past couple of weeks. The most recent indicator  of the mega tech is msft. There's about a 15 buck difference between one peak to the next. It just hit the next 15 on friday.\n\nFrom what I saw in mid fed, no matter how great an earnings was it was a blood bath. No reason to expect different now.",
        "created_utc": 1625451161,
        "id": "h435dnr",
        "score": 16,
        "subreddit": "options",
        "created": 1625479961.0
    },
    {
        "author": "justsomescrub",
        "body": "Not so much diversifying as just straight up killing it. Operating income rose 189% from 2019 to 2020 with eps up 604%. Q1 2021 operating income is up 266% and eps is up 232% from Q1 2020 and it isn't *just* higher margins; Total revenue in 2020 was up 45% from 2019 and Q1 2021 total rev Is up 92% compared to Q1 2020. Oh and the XLNX acquisition or whatever pending china approval.\n\n  \nAND there are some tasty insider whispers IF TRUE insinuating next gen GPU performance above and beyond what they expect from Nvidia. FULL STOP. Not at bargain price points, or for certain niche applications just straight up expecting to have the best GPUs on the market next gen. Nvidia having something spicy up their sleeve non-withstanding; you never know with Nvidia.   \n\n  Add in plans to buy back 4 billion worth of shares over the next 4(?) Years with cash on hand and plans for 3nm production by 2024 and everything I hear about AMD makes me think up up up. They have new deals with Samsung for their phones and google/amazon for servers, to add to the pile of deals like making chips for Sony and Microsoft consoles. The future looks bright.\n\nI put 90% of my account in AMD last month when they were hovering around 80$ without a single worry and I haven't unwound my position yet. Hoping for 2021 guidance to be adjusted from 50% to 75% growth to set this thing off again. Or merger approval, whatever comes first.",
        "created_utc": 1625268525,
        "id": "h3v5p9o",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1625297325.0
    },
    {
        "author": "Jdog43349",
        "body": "Yeah cause Android isnt just as big as Apple, right? And Google doesnt own YouTube, right? \n\nDont listen to this guy, buy Google AND Microsoft.",
        "created_utc": 1625342689,
        "id": "h3ybbv1",
        "score": 15,
        "subreddit": "stocks",
        "created": 1625371489.0
    },
    {
        "author": "Mesmeryze",
        "body": "microsoft just been solid as a rock through the hard times sincr 2 years ago my god",
        "created_utc": 1625242013,
        "id": "h3ti1bl",
        "score": 15,
        "subreddit": "stocks",
        "created": 1625270813.0
    },
    {
        "author": "Guy_Who_Made_Money",
        "body": "Amazon may split, Ford may do a reverse split, Microsoft may merge with Apple, Disney is going to sell off the Mickey Mouse Family IP to focus on Marvel, EA is merging with Take Two, Nokia may actually make money.          \nNow buy those rumors I made up.",
        "created_utc": 1625363069,
        "id": "h3zak3h",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1625391869.0
    },
    {
        "author": "half0tempo",
        "body": "My 5 shares of MSFT are so solid, I transitioned to a lazy portfolio VOO and VXUS. But kept my 5 MSFT shares I bought during the heat of the pandemic. Never will let go.",
        "created_utc": 1625252960,
        "id": "h3u8ibm",
        "score": 15,
        "subreddit": "stocks",
        "created": 1625281760.0
    },
    {
        "author": "brbcripwalking",
        "body": "Imagine being a boomer\n\nCasually fucking buy MSFT at $0.10, AMZN at $1.73, and buy AAPL at $0.80 on some Forrest Gump shit.\n\nPull yourself up by the bootstraps youngin what do you mean you can't afford a home?",
        "created_utc": 1625186528,
        "id": "h3qz1jm",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1625215328.0
    },
    {
        "author": "Boomtown626",
        "body": "I haven’t sold a share of MSFT or aapl. Not have a sold a share of my yolo plays. What I’m selling are my reopening plays, my clean energy plays that don’t appear to be keeping up with the sector, and my long shot penny stocks. \n\nThe kicker: I’m only selling when I find something better - either a new position or building weight in the positions I’m most confident in.",
        "created_utc": 1625535521,
        "id": "h46vrg2",
        "score": 14,
        "subreddit": "stocks",
        "created": 1625564321.0
    },
    {
        "author": "creemeeseason",
        "body": "I've owned Microsoft since 2018. If I had a 20% stop loss it would have triggered in March of 2020, among other times (at $160 or so). Instead, I just held and it always came back up and is at $277 today. \n\nJust hold, especially with solid companies.",
        "created_utc": 1625332382,
        "id": "h3xrn7l",
        "score": 14,
        "subreddit": "stocks",
        "created": 1625361182.0
    },
    {
        "author": "Icommandyou",
        "body": "SPY and MSFT doing great. Memes down.\n\nNature is healing itself.",
        "created_utc": 1625256108,
        "id": "h3ufr4u",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1625284908.0
    },
    {
        "author": "FalconsBlewA283Lead",
        "body": "MSFT is such a machine",
        "created_utc": 1625254708,
        "id": "h3uci55",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625283508.0
    },
    {
        "author": "apooroldinvestor",
        "body": "20% of my portfolio is MSFT AAPL.  Am I ok?",
        "created_utc": 1625548835,
        "id": "h47h2yz",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625577635.0
    },
    {
        "author": "zxc123zxc123",
        "body": "Hi. I'm from the Intel side! I think AMD side shouldn't worry too much about INTC. It's a big old ship that's getting bombarded from all sides. The fact that it's a big ship means it's changes will take time. I'm giving Gelsinger a chance to right the ship, but it will take a long while to undo BSwan's bad moves, get the right people, develop the chips, and catch up to AMD. \n\nA plus side for everyone is that the semi-space is a growing area with electronification, digitization, and \"5G-cloudification\" of everything along with the increasing importance of AI &amp; tech in business and government. Semis are so important in fact, that at this point US Gov should really be looking at INTC/NVD/TI more like they did Ford/GM 100 years ago: as a strategic industrial/military resource. \n\nReal threat to AMD isn't INTC. INTC was the big market share holder in the past and isn't likely gaining any ground any time soon. What AMD and all the trad chip manufacturers should fear is FAAAM &amp; BAT. Apple has started designing it's own chips. They aren't going back to using outsourced chips. If history says anything it's that Apple will continue to cut others out as they continue to in-house their chips for their entire lineup while improving their chips just like how they kept improving their computers, just like how the iphone kept improving until NOK/MOT were beat, just like how a good chunk of the watch market is Apple watches, just like how Ipads have taken away from of the laptop space, just like how Apple TV keeps chipping away at cable, just like how the app store and Apple's eco system keeps growing, etcetcetc. There is nothing AMD/NVD/INTC can do to stop Apple. And Apple is just the first. MSFT also doing the same. Google, Facebook, and Amazon might follow suit. China's Tencent and Alibaba will likely copy what the US companies do as soon as Pooh Bear gets done man handling them.",
        "created_utc": 1625258081,
        "id": "h3uk775",
        "score": 13,
        "subreddit": "investing",
        "created": 1625286881.0
    },
    {
        "author": "ACELUCKY23",
        "body": "$MSFT, $AAPL AND $NVDA. I like $AMD, but I don’t plan to hold that as “forever” at the moment. \n\nPlease avoid meme stocks if possible, those are not meant to be long term investments.",
        "created_utc": 1625442592,
        "id": "h42rx5g",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625471392.0
    },
    {
        "author": "Sweaty-Bumblebee4055",
        "body": "All in on that AMD run before it turns into NVDA and gonna throw it all in on MSFT",
        "created_utc": 1625538228,
        "id": "h470kgk",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1625567028.0
    },
    {
        "author": "iceberg_crumble",
        "body": "Hey man hopefully you’re using other DD than this job post. I work in the SI and SaaS space - super common to have an alliance manager that runs the cloud relationship, especially given they both (MSFT and PLTR) have big gov contracts. \n\nI doubt the role is new - prob turnover or titling change.  Just google this title and you’ll see all major SaaS companies have this role or something similar if it can be integrated/sold with O365.",
        "created_utc": 1625574665,
        "id": "h48bc8w",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1625603465.0
    },
    {
        "author": "Perdix_Icarus",
        "body": "AMZN, MSFT and GOOGL are at ATH and looks like AAPL would also join them there soon.",
        "created_utc": 1625581920,
        "id": "h48om67",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625610720.0
    },
    {
        "author": "manofculture003",
        "body": "If you invested $1000 in Microsoft back in Dec 1999, in Oct 2016 you would have had $1000",
        "created_utc": 1625590254,
        "id": "h496s19",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1625619054.0
    },
    {
        "author": "heatd",
        "body": "MSFT and AAPL are 11% of SPY and 20% of QQQ",
        "created_utc": 1625549600,
        "id": "h47i36q",
        "score": 13,
        "subreddit": "stocks",
        "created": 1625578400.0
    },
    {
        "author": "maz-o",
        "body": "Nope this is called timing the market and you know how the saying goes. \n\nI’m never selling my MSFT.",
        "created_utc": 1625156419,
        "id": "h3p4fun",
        "score": 12,
        "subreddit": "stocks",
        "created": 1625185219.0
    },
    {
        "author": "left_turn_signal",
        "body": "\"The bulk of the Pelosis' money comes from investments in stocks and real estate. Operating through Financial Leasing Services, his San Francisco investment firm, Paul Pelosi owns stock in companies including Microsoft, AT&amp;T, Cisco Systems, Disney, Johnson &amp; Johnson and a variety of tech stocks.\nReal estate investments include a four-story office building at 45 Belden St. in the Financial District, office buildings on Battery and Sansome streets near the Embarcadero, a building housing a Walgreens drugstore near Ocean Beach and other commercial property in San Anselmo.\nOther investments include a St. Helena vineyard worth between $5 million and $25 million, a $1 million-plus townhome in Norden (Nevada County), and minority interests in the Auberge du Soleil resort hotel in Rutherford, the CordeValle Golf Club in San Martin, and the Piatti Italian restaurant chain.\"\n\nLook at the date of that article 2007. \n\n(https://www.sfgate.com/politics/article/Pelosi-s-husband-prefers-a-low-profile-2660253.php)",
        "created_utc": 1625593216,
        "id": "h49df75",
        "score": 12,
        "subreddit": "options",
        "created": 1625622016.0
    },
    {
        "author": "6151rellim",
        "body": "That is scary to think. If I had a large sum to invest tomorrow I’d be right on the fence between Microsoft or Amazon.",
        "created_utc": 1625297154,
        "id": "h3wd7xz",
        "score": 12,
        "subreddit": "stocks",
        "created": 1625325954.0
    },
    {
        "author": "Marquis77",
        "body": "Nope. VMware does well with on prem virtualization but they are leagues behind AMZN/MSFT in terms of cloud capabilities.",
        "created_utc": 1625593358,
        "id": "h49dqjq",
        "score": 12,
        "subreddit": "stocks",
        "created": 1625622158.0
    },
    {
        "author": "_igg",
        "body": "Been in a coma for a year, did MSFT hit 200 yet?",
        "created_utc": 1625191614,
        "id": "h3r8q2u",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1625220414.0
    },
    {
        "author": "GoldDecision7",
        "body": "Good job MSFT, AMD, and AAPL. I might actually financially recover from joining this place.",
        "created_utc": 1625247693,
        "id": "h3tw1c9",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1625276493.0
    },
    {
        "author": "Shacrone",
        "body": "sir I don't know why you think pltr can be compared to msft",
        "created_utc": 1625334683,
        "id": "h3xw3yo",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625363483.0
    },
    {
        "author": "klumpbin",
        "body": "Yes. Amazon, Microsoft and google are all on the verge of bankruptcy, so you’ve essentially missed the boat /s",
        "created_utc": 1625548742,
        "id": "h47gyhr",
        "score": 11,
        "subreddit": "StockMarket",
        "created": 1625577542.0
    },
    {
        "author": "1foxyboi",
        "body": "SPY pays one, so does QQQ. \n\nAAPL MSFT too\n\nI would say not having a single dividend in a portfolio is the strategy outside the norm",
        "created_utc": 1625440295,
        "id": "h42nztf",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625469095.0
    },
    {
        "author": "DoesntUnderstandJoke",
        "body": "I’m amazing at selling covered calls. Msft 265c for $1.16. Now At $13. \n\nNice negative 10 bagger 📈😣🔫",
        "created_utc": 1625253307,
        "id": "h3u9apz",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1625282107.0
    },
    {
        "author": "throwitup1124",
        "body": "Go look at the top ten companies 10, 20, 30 years ago and see where they’re at today. In order to outperform the index, you’re suggesting that these companies will continue to outperform over the long term. MSFT, AAPL, FB, GOOGL, V market caps are already at mega levels and it’s a big assumption that they will continue to get bigger. While I do think they will continue to grow in the short/mid-term, I’d be cautious on just owning the top ten.",
        "created_utc": 1625173751,
        "id": "h3q8ts1",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625202551.0
    },
    {
        "author": "schittluck",
        "body": "MSFT all the way",
        "created_utc": 1625268165,
        "id": "h3v50zu",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625296965.0
    },
    {
        "author": "ShortPutAndPMCC",
        "body": "But have you seen the returns of just “blindly” investing in solid stocks like Microsoft, Google, Amazon, NVDA, AMD, SEA, TSMC, etc? They beat my returns easily and I’ve been following their price for 13 months. Makes me wonder why I followed them so long and didn’t buy, but learnt options for only 5 months and decided to go into it just because I thought I could make it work.",
        "created_utc": 1625563738,
        "id": "h47y4eh",
        "score": 11,
        "subreddit": "options",
        "created": 1625592538.0
    },
    {
        "author": "BobandSteve",
        "body": "I'm just gonna say, if fucking covid couldn't cause the crash of all crashes idk if its just gonna spontaneously happen.\n\nWhy would there be a correction to tech? What would make Apple or Microsoft lose 20% of market cap when they bring in a shit ton of cash. It can happen but I dont really buy inflation as the reason",
        "created_utc": 1625435036,
        "id": "h42eheb",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625463836.0
    },
    {
        "author": "uselessadjective",
        "body": "Sorry dont agree, PE ratio of AMD is still 20  It used to be 70-80 till last year.\nCompartively nVidia's PE ratio is 80. AMZN and GOOGLE also in 50s.\n\nOut of all Tech stocks only AMD is undervalued right now. \n\nHave been holding all below stocks from last 4 years\n\nMSFT\nFB\nAMD\nNVIDIA\nTWTR\nAMZN\n\nAMD is gonna fly very soon.",
        "created_utc": 1625346445,
        "id": "h3yidwv",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625375245.0
    },
    {
        "author": "ACELUCKY23",
        "body": "I feel like $MSFT is a stock everyone should have some money invested in at the moment. It’s been very impressive as of late and I don’t see things changing for some time.",
        "created_utc": 1625243749,
        "id": "h3tmk4g",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625272549.0
    },
    {
        "author": "TotheMoongirl21",
        "body": "I bought the shares when Microsoft was $231 and still holding. This is my long term not selling stock.",
        "created_utc": 1625258646,
        "id": "h3ulgpa",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625287446.0
    },
    {
        "author": "Qarantyl",
        "body": "Why is apple super expensive and msft only fair value, MSFT is trading at higher multiples than AAPL right now. I would say msft's 45x free cash flow is actually very overvalued. Its a great company but everyone seems to have such a hard on for it right now around here.",
        "created_utc": 1625638261,
        "id": "h4bs4lx",
        "score": 10,
        "subreddit": "stocks",
        "created": 1625667061.0
    },
    {
        "author": "ImmySnommis",
        "body": "About half is wrapped up in MSFT, GOOG, AAPL and COST. Another quarter or so is in DE, PSTH and TSM. The test is a smattering of speculative stuff that's kinda just for fun - stuff like SPCE, NIO, MYRG, and some SPACs.",
        "created_utc": 1625422968,
        "id": "h41qnnw",
        "score": 10,
        "subreddit": "investing",
        "created": 1625451768.0
    },
    {
        "author": "Sheeple81",
        "body": "Does this mean Microsoft is a meme stock?",
        "created_utc": 1625251595,
        "id": "h3u5c5o",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625280395.0
    },
    {
        "author": "CokeRapThisGlamorous",
        "body": "This thread is likely due to the JEDI contract news that broke today, announcing that MSFT will not be the Pentagon's sole cloud provider. AMZN and MSFT have risen/dropped as a result. I imagine Pelosi's position would make her privy to this news in advance of the general public. Could be a reach that this is the reasoning for the move though.",
        "created_utc": 1625600624,
        "id": "h49tuct",
        "score": 10,
        "subreddit": "options",
        "created": 1625629424.0
    },
    {
        "author": "Sweaty-Bumblebee4055",
        "body": "AMD MSFT WISH let’s GO",
        "created_utc": 1625576659,
        "id": "h48el9w",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625605459.0
    },
    {
        "author": "Overall-Jaguar-445",
        "body": "ARKK-10.96%\n\nNVDA-35.68%\n\nQQQ-31.08%\n\nMSFT-22.28%",
        "created_utc": 1625598462,
        "id": "h49p0xw",
        "score": 9,
        "subreddit": "stocks",
        "created": 1625627262.0
    },
    {
        "author": "YourInnate",
        "body": "It's a matter of perspective and big picture stuff. If you bough a SPY leap the day before the market crashed last year from covid, and bought 100 shares the day before the crash in covid, the LEAP would be worth more today.\n\n2-5% a month seems super low, but options are a grind. When in doubt, zoom out. 2-5% a month is 25-60% a year. Consider the indexes historically return 10%, doubling that on your bad years and quintupling it on your good years seems like a good trade.\n\nAnother note, this past year has been a historic bull run/recovery for most of the stock market. You can't compare throwing money into microsoft or google and watching it appreciate vs selling options on the same underlying. Likewise, if you had been selling RIOT/MARA puts the first 4 months of the year, you could've been making 10% a week. \n\nEverything in the market is perspective. If you think 2-5% a month is too slow/boring... You might consider roulette.",
        "created_utc": 1625587456,
        "id": "h490gmj",
        "score": 9,
        "subreddit": "options",
        "created": 1625616256.0
    },
    {
        "author": "BigBrianBrand",
        "body": "Alibaba is the best Buy and Hold example that fits your question. \n\nIt has perceived government regulation risk. Similar to what Facebook has been through these last 3 years. As long as the financials continue to grow, the stock will eventually skyrocket. \n\nEtsy, VRTX, nVidia, Apple, Facebook, Amazon, Google, Tesla, and Microsoft are also moderate risk picks in terms of their current price",
        "created_utc": 1625176385,
        "id": "h3qeph1",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625205185.0
    },
    {
        "author": "Actual-Ad-7209",
        "body": "Adding to the already named equipment manufacturers, I'd mention Infineon, STMicroelectronics and NXP Semiconductors.",
        "created_utc": 1625129831,
        "id": "h3nvecr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625158631.0
    },
    {
        "author": "Nosefuroughtto",
        "body": "I find it odd to consider Amazon like Standard Oil. SO derived it’s monopolistic power through acquisitions of rival refineries and distributors; purely horizontal integration, followed by outright price fixing.\n\nAmazon is absolutely massive, but the growth method and diversity of markets they participate in distinguishes them from old trust oriented monopolies. I’m terms of AWS, the majority of growth was organic, and would not have ran afoul of antitrust law back in its hay day, such as when US v. Aluminum Co. of America was prevailing law.\n\nAn attempt to break up Amazon by business segment would probably fail due to the shift since the 70’s from Per Se Antitrust violations to the Rule of Reason. They aren’t dominating any given sector to the point that a court could likely prove anti-consumer behavior, which has increasingly become the prime factor.\n\nOnline shopping has a fairly rich market with Walmart, Home Depot, Best Buy, wayfair, etc.; physical stores obviously have Walmart and target being dominant; subscription services are still beaten by Netflix and Google, with Disney catching up fast; AWS competes with Oracle, Microsoft snd Google.\n\nOverall I think the justifications for breaking up Amazon are weak in light of the method of growth, the fact that they aren’t shutting out competitors in any given industry right now, and our much more consumer viewpoint focus on antitrust enforcement.",
        "created_utc": 1625846036,
        "id": "h4lpzte",
        "score": 86,
        "subreddit": "stocks",
        "created": 1625874836.0
    },
    {
        "author": "Carrot_Tiny",
        "body": "Y’all are too quick to believe MSM, quote was taken out of context. It will crash from BILLIONS. \n\nBurry has been pro GME since 2019, fucker even sent a letter to GameStop directly telling them the best action to take in order to reach where GameStop now currently is. He has been balls deep in all of this for far longer than any of us.\n\nCassandra may be hot take central but when it comes to financial numerical values he knows his shit better than any. \n\nAn oracle cursed to never be believed yet always right.",
        "created_utc": 1625158164,
        "id": "h3p8km6",
        "score": 40,
        "subreddit": "Wallstreetbetsnew",
        "created": 1625186964.0
    },
    {
        "author": "cuittle",
        "body": "Short $ORCL? Got it",
        "created_utc": 1625456694,
        "id": "h43dp31",
        "score": 34,
        "subreddit": "investing",
        "created": 1625485494.0
    },
    {
        "author": "Wenzu-u-rozi",
        "body": "You say that as if you checked with the oracle of truth\n\nI guess gamestop lied to the sec after the vote count when they reported 140% short interest, right?",
        "created_utc": 1625433548,
        "id": "h42bm7v",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1625462348.0
    },
    {
        "author": "approachingX",
        "body": "Careful guys we got a genius here! He said it first - market will either go up or down or maintain these levels today! Fucking oracle!",
        "created_utc": 1625740534,
        "id": "h4gjbo9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1625769334.0
    },
    {
        "author": "Coffin-Feeder",
        "body": "I have snorted this DD. Thank you WSB oracle.",
        "created_utc": 1625716070,
        "id": "h4fpl3q",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625744870.0
    },
    {
        "author": "Banana_Pi-",
        "body": "It’s not much but day 1 of running credit spreads for SPY. Made $6 so… I’m basically the Oracle from Omaha",
        "created_utc": 1625583761,
        "id": "h48sfqu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625612561.0
    },
    {
        "author": "beelo50",
        "body": "Thank god my wife works at ORCL",
        "created_utc": 1625678168,
        "id": "h4dhuuh",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625706968.0
    },
    {
        "author": "Jaysler87",
        "body": "Oracle is that you?",
        "created_utc": 1625192103,
        "id": "h3r9njv",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625220903.0
    },
    {
        "author": "HulksInvinciblePants",
        "body": "&gt;Good thing you can share your wisdom then, oh eternal oracle of the market.\n\nHmmm. I'm don't recall trying to predict when the market will crash and I post quite a bit, when I'm qualified to do so. My advice this time was making users aware of how bad this post was and how illiterates most this sub is. \n\n&gt;Surely you know more then Dalio, what books have you written?\n\nL. Ron Hubbard and Cosby wrote books too. That's a pretty low bar. \n\n&gt;Gold is a old-school store of value by definition and as we saw in 2020 (amongst others) a great asset during times of uncertainty and crashes. Buy it during calm times, sell during fearful times.\n\nYeah, that's not accurate. Gold is not a hedge, its a portfolio diversifier. It's market correlation is 0.02, which is an unattached, positive number...not the large negative correlation you would hope for from a hedge. It did absolutely nothing during the dot-com bubble and probably hurt most investors that held during 2020.",
        "created_utc": 1625837302,
        "id": "h4l7k4r",
        "score": 5,
        "subreddit": "investing",
        "created": 1625866102.0
    },
    {
        "author": "Empland",
        "body": "#Fomo into ORCL @86.5 😎",
        "created_utc": 1625680191,
        "id": "h4dmi2c",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625708991.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$ORCL my safe haven!",
        "created_utc": 1625751862,
        "id": "h4h0u01",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625780662.0
    },
    {
        "author": "SteeplesInSeattle",
        "body": "You must be a Wall Street Oracle, here take my money",
        "created_utc": 1625588415,
        "id": "h492m7g",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625617215.0
    },
    {
        "author": "Tarrifying",
        "body": "Silly ORCL, going above $80 again",
        "created_utc": 1625326029,
        "id": "h3xfd12",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625354829.0
    },
    {
        "author": "Pioneer160",
        "body": "VZ, T, NVDA, ORCL, MA, DIS, FB driving it up.",
        "created_utc": 1625161990,
        "id": "h3phm69",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625190790.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$ORCL almost past the sell off! Let's go!",
        "created_utc": 1625751572,
        "id": "h4h0995",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625780372.0
    },
    {
        "author": "GirlOutWest",
        "body": "Yeah saw that flight announcement coming on a Thursday right after market close... yup I'm a God damn oracle",
        "created_utc": 1625192591,
        "id": "h3rakic",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625221391.0
    },
    {
        "author": "Inquiring_Barkbark",
        "body": "where is DeepVeinThrombosis\n\nwe need the oracle",
        "created_utc": 1625829854,
        "id": "h4kvu15",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625858654.0
    },
    {
        "author": "IvanGlez14",
        "body": "Nop, yesterday it was a great day for me. I Bet money on Oracle some days ago and sold them yesterday and Fuck yeah! Today i just notice it was a bad day so i sold everything. I lost like 1-1.5% of my capital but all ok, i won yesterday more than i lost today.",
        "created_utc": 1625758682,
        "id": "h4hfl3a",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625787482.0
    },
    {
        "author": "Boxman212",
        "body": "I was an oracle in 2000.  I had a website development company with 100 employees along with online yellow pages if anyone here even knows what that means.  I knew all the latest tech etc.  I lost 200k by 2001 in the market from day trading with etrade.  The Nasdaq did not come back up to the 2000's level for 13 yrs.  I learned my lesson the hard way but it was the best lesson I've ever learned.  I glad I learned that in my 20s.",
        "created_utc": 1625451210,
        "id": "h435gc5",
        "score": 3,
        "subreddit": "investing",
        "created": 1625480010.0
    },
    {
        "author": "dajmynd_hends",
        "body": "Can $ORCL move already?",
        "created_utc": 1625226993,
        "id": "h3smgfc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625255793.0
    },
    {
        "author": "isc1200s",
        "body": "I expect $ORCL to pullback on Tuesday before it continues on an upward trend. The RSI indicates the stock is overbought. \n\nI'll be looking for this as my entry point. \n\nBullish 👍",
        "created_utc": 1625389865,
        "id": "h409br8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625418665.0
    },
    {
        "author": "Hiei154",
        "body": "Oracle going to 100 soon. Huge breakout",
        "created_utc": 1625705272,
        "id": "h4f5i4x",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625734072.0
    },
    {
        "author": "Proffesssor",
        "body": "The Oracle of Omaha used to rave about how WMT was run. Think he stopped praising it about 15 years ago. Wondering what changed my self.",
        "created_utc": 1625174635,
        "id": "h3qatjt",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625203435.0
    },
    {
        "author": "DKB08",
        "body": "I don't know anyone in IT who likes Oracle other than one guy who is near retirement.",
        "created_utc": 1625123090,
        "id": "h3nnv73",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625151890.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$ORCL Oracle foretold that the stock will go back to ATH by end of next week $81 -&gt; $85",
        "created_utc": 1625239864,
        "id": "h3tcotv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625268664.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$SPY (because tech it king), $ORCL (for hybrid and digital return to work play), $NCR (for upcoming tech to allow banks to do coin transactions so people don't have to use other platforms), $AMCX (because it's a real company with upward momentum, semi linked to memes, and has low liquidity so can jump hard)",
        "created_utc": 1625245811,
        "id": "h3trhp6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625274611.0
    },
    {
        "author": "langhartdev",
        "body": "Oh thank you for your vision great oracle",
        "created_utc": 1625749515,
        "id": "h4gwea3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625778315.0
    },
    {
        "author": "tmoney_99",
        "body": "Nobody talking about ORCL?",
        "created_utc": 1625679483,
        "id": "h4dkvwt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625708283.0
    },
    {
        "author": "Hornysnek69",
        "body": "Instead of buying on a discount I bought 24 ORCL 90 calls smh",
        "created_utc": 1625587845,
        "id": "h491br0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625616645.0
    },
    {
        "author": "dugg08302010",
        "body": "Somewhere far off the oracle of Omaha is dying laughing his ass off at wsb 😂😂😂🤣🤣🤣",
        "created_utc": 1625162149,
        "id": "h3phzcc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625190949.0
    },
    {
        "author": "mba111",
        "body": "ORACLE is mooning hard today",
        "created_utc": 1625156683,
        "id": "h3p51sn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625185483.0
    },
    {
        "author": "LeDudeDeMontreal",
        "body": "Got me very confused..\n\nI thought Oracle did pretty well over the last 6 months!",
        "created_utc": 1625446870,
        "id": "h42yx2u",
        "score": 2,
        "subreddit": "investing",
        "created": 1625475670.0
    },
    {
        "author": "Ninswitchsu",
        "body": "Workplace technology. Holding some calls on $ORCL and $CSCO.",
        "created_utc": 1625689917,
        "id": "h4e8o9h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625718717.0
    },
    {
        "author": "Aokay1er",
        "body": "If I'm understanding your analysis and using it to analyze a different ticker. Do you think ORCL will go down again back to 75-76 or is it on an uptrend. \n\nI know different ticker and I do hold positions in SOFI, but I'm curious to hear your opinion on this. Thanks.",
        "created_utc": 1625720238,
        "id": "h4fw11w",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625749038.0
    },
    {
        "author": "DomeCollector",
        "body": "GOOGL calls, NFLX calls, ORCL holding calls and don’t think will make it anywhere, and KO calls, SPCE straddle, kinda all I can think of atm",
        "created_utc": 1625635335,
        "id": "h4bobje",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625664135.0
    },
    {
        "author": "realister",
        "body": "Anyone know what’s the news with Oracle it’s been pumping non stop and now at 52 week high. Just a random pump?",
        "created_utc": 1625844250,
        "id": "h4lm1ls",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625873050.0
    },
    {
        "author": "KOBA-fight-4-Ape",
        "body": "Leave it and eat a cookie \n\nThe Oracle knows",
        "created_utc": 1625367471,
        "id": "h3zhkfo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625396271.0
    },
    {
        "author": "aimaguru",
        "body": "Yeah I'm not the oracle for ya when it comes to trying to time the market :)   \n\n\nI've been mostly right on my directional plays but wrong too many times to count on \"oh I'll just sell here and up my position on the way down\" or \"this is DEFINITELY never going higher than this\" (cries in AMC)  \n\n\nOne framework I've seen (maybe rementioned on Fatty's DD) is would you be more upset about selling at X and it runs up to \\[price target\\] or holding and it dropping to \\[your worst case thesis\\].   \n\n\nPersonally (my risk tolerance and thesis re: ATOS, not necessarily yours) is that I like the stock enough and am enjoying the IV selling calls enough that, although I'd love a quick 4-10x pop, I'm okay with holding for the longer term, averaging down, and waiting for phase 3 and/or an acquisition down the line.",
        "created_utc": 1625146056,
        "id": "h3oi6m0",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1625174856.0
    },
    {
        "author": "Hornysnek69",
        "body": "ORCL bb yes",
        "created_utc": 1625665541,
        "id": "h4cpuhr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625694341.0
    },
    {
        "author": "dajmynd_hends",
        "body": "$ORCL I LOVE YOU &lt;3",
        "created_utc": 1625666123,
        "id": "h4cr0vu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625694923.0
    },
    {
        "author": "Moe_Greene_",
        "body": "Wednesday Options Volumes:\r  \n\r  \n$AAPL 3048K (81% call 19% put)\r  \n**$TSLA 1033K (41% call 59% put)**\r  \n**$AMC 884K (55% call 45% put)**\r  \n$T 680K (95% call 5% put)\r  \n**$NIO 615K (66% call 34% put)**\r  \n**$AMD 526K (74% call 26% put)**\r  \n**$PLTR 502K (66% call 34% put)**\r  \n$AMZN 484K (70% call 30% put)\r  \n$MSFT 423K (59% call 42% put)\r  \n**$WISH 347K (84% call 16% put)**\r  \n**$BABA 311K (60% call 40% put)**\r  \n$FB 309K (70% call 30% put)\r  \n$F 287K (67% call 33% put)\r  \n$CCL 266K (76% call 24% put)\r  \n$MU 247K (71% call 29% put)\r  \n$ORCL 243K (78% call 22% put)\r  \n$HYG 241K (4% call 96% put)",
        "created_utc": 1625725331,
        "id": "h4g2pvo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625754131.0
    },
    {
        "author": "CodeMaitre",
        "body": "ORCL One Year and 6 Month Chart - [https://imgur.com/S6dI2gg](https://imgur.com/S6dI2gg)\n\nIt has pretty much made its move, you'd be buying in the \"sell\" area statistically. You're correct, the buy zone is  always below regression trend (average) line in the middle, so you'd want to snag it if it goes back down to 75-80. Although its true downward potential is the blue -1 deviation line, so 70-73. Deviations change a little bit day to day as more price data is added but right now you'd be buying into an uptrend which is not very safe. You'd basically be betting to get the cherry on top running up to +1 deviations at 88-91.",
        "created_utc": 1625753301,
        "id": "h4h3vfm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625782101.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$ORCL just going for it today!",
        "created_utc": 1625579074,
        "id": "h48iybw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625607874.0
    },
    {
        "author": "IAintInTheClub",
        "body": "The Great Philosopher and Oracle of our time, Ronald 'Tater' White,  once opined \"You can't fix stupid\"",
        "created_utc": 1625159119,
        "id": "h3pauh4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625187919.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "ORACLE $85C 9/17 are the way, sell off after earnings not justified and just closed a big deal german bank",
        "created_utc": 1625392244,
        "id": "h40bqif",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625421044.0
    },
    {
        "author": "idkfawin32",
        "body": "dude the sheer number of pump and dumps in the past 2 weeks has forced me to learn how to do DD.  Screw these fake plays go in ORCL with me. Absolute monster in the making, pays dividends, not overbought like every other tech stock. P/E ratio is excellent, price is showing good momentum and has room to run past 100 in the next month or two.",
        "created_utc": 1625388189,
        "id": "h407mqw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625416989.0
    },
    {
        "author": "SocialIQof0",
        "body": "[https://www.cnbc.com/2020/08/30/how-warren-buffett-made-billions-became-oracle-of-omaha.html](https://www.cnbc.com/2020/08/30/how-warren-buffett-made-billions-became-oracle-of-omaha.html)\n\nThere's the answers for you.",
        "created_utc": 1625332861,
        "id": "h3xskjp",
        "score": 1,
        "subreddit": "investing",
        "created": 1625361661.0
    },
    {
        "author": "Hornysnek69",
        "body": "Not worthy, small positions Only bought ORCL and ASTR they mooned hard. Also bought 3k of BA calls but that’s flat",
        "created_utc": 1625244806,
        "id": "h3tp4bf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625273606.0
    },
    {
        "author": "Toys_R_Them",
        "body": "Most of the new growth has been in tech, and tech rarely pays dividends, outside of some stalwarts like MSFT and ORCL.\n\nA lot of those dividend payers are energy companies and REITs, who also underperformed for various pandemic-related reasons.\n\nA portfolio that high in dividends is typically recommended for older people, who need current income and downside protection in case of economic swings, and could care less about potential growth of their portfolio decades from now.",
        "created_utc": 1625527071,
        "id": "h46gcpx",
        "score": 1,
        "subreddit": "investing",
        "created": 1625555871.0
    },
    {
        "author": "Hiei154",
        "body": "Oracle breaking the fuck out. 100$ next week easily. Still time to get in",
        "created_utc": 1625851536,
        "id": "h4m298w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625880336.0
    },
    {
        "author": "Hiei154",
        "body": "Oracle is gonna run like amazon once it gets JEDI",
        "created_utc": 1625847295,
        "id": "h4lssgt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625876095.0
    },
    {
        "author": "Hiei154",
        "body": "ORCL at all time high breaking out. 1/10 market cap of Amazon with half of its income. Huge growth incoming once JEDI is granted to Oracle. PT 100$ next week.",
        "created_utc": 1625848604,
        "id": "h4lvq3q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625877404.0
    },
    {
        "author": "Hornysnek69",
        "body": "ORCL, NEGG",
        "created_utc": 1625684472,
        "id": "h4dw87v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625713272.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$ORCL mo' fuckin' bussin'!! $90 here we come!!",
        "created_utc": 1625680082,
        "id": "h4dm91p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625708882.0
    },
    {
        "author": "Buttmunch_1990",
        "body": "100% SOFI is trading at a discount right now. The Oracle of Omaha would tell you this is a great price!",
        "created_utc": 1625579273,
        "id": "h48jcx8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625608073.0
    },
    {
        "author": "HowdySon",
        "body": "I’m I the only one that bought ORCL after the Twitter mention?",
        "created_utc": 1625618979,
        "id": "h4avows",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1625647779.0
    },
    {
        "author": "garlicnoodle18",
        "body": "Add ORCL to buy. Curling on MacD and mfi still under 50 on the daily",
        "created_utc": 1625236297,
        "id": "h3t4b0i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625265097.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "oracle gonna be $85 by the end of next week, unusual option buy up yesterday followed by a run today after it being sold off after earnings when its using it cash flow for growth, divi run up opportunity on the 29th too. Like the company and my $85 are banking on it doing well.",
        "created_utc": 1625255900,
        "id": "h3uf9nm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625284700.0
    },
    {
        "author": "Hoppus87",
        "body": "Anyone in ORCL?",
        "created_utc": 1625234161,
        "id": "h3szjm7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625262961.0
    },
    {
        "author": "dajmynd_hends",
        "body": "$ORCL is makin it!🚀🚀🚀\nI hope so 🙄",
        "created_utc": 1625154297,
        "id": "h3oznlu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625183097.0
    },
    {
        "author": "Tiny-Control-4132",
        "body": "Those AMD calls ate all my apple and oracle profit for today fuk",
        "created_utc": 1625687977,
        "id": "h4e4994",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625716777.0
    },
    {
        "author": "FalconGhost",
        "body": "What is the bottom o oracle",
        "created_utc": 1625579206,
        "id": "h48j81a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625608006.0
    },
    {
        "author": "Aokay1er",
        "body": "Need oracle to dump",
        "created_utc": 1625835239,
        "id": "h4l3ti9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625864039.0
    },
    {
        "author": "Hiei154",
        "body": "ORACLE IS BREAKING OUT",
        "created_utc": 1625845174,
        "id": "h4lo34f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625873974.0
    },
    {
        "author": "Vovochik43",
        "body": "I like Oracle, their Cloud offering is going well and they still pay a correct dividend for a tech stock. I see it as a long play position.",
        "created_utc": 1625480978,
        "id": "h4472yf",
        "score": 1,
        "subreddit": "investing",
        "created": 1625509778.0
    },
    {
        "author": "idkfawin32",
        "body": "For a moment I thought this was going to be a bearish post on the company “Oracle” which I have been becoming excited to invest in",
        "created_utc": 1625508682,
        "id": "h45gwp8",
        "score": 1,
        "subreddit": "investing",
        "created": 1625537482.0
    },
    {
        "author": "Triple3alpha",
        "body": "SCHD/ORCL, have your cake and eat it too (dividend givers with growth)",
        "created_utc": 1625158366,
        "id": "h3p9266",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625187166.0
    },
    {
        "author": "ElkFalse6637",
        "body": "They were upgraded before the ER same way than ORCL . Market has lost its logic and is about emotion with unrealistic expectations and tend to punish people doing great and reward the thrill of the moment . This where it comes a retard is laughing all the way to the bank while the Savvy crashes against the wall .\nDisclaimer: I own small position of MU 350 shares ..",
        "created_utc": 1625188959,
        "id": "h3r3pom",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625217759.0
    },
    {
        "author": "idkfawin32",
        "body": "My picks of the week are ORCL, COP, GDYN, CSC, BA, FIGS, and ESTE\n\nOf which ORCL looks like the best one to buy shares in and FIGS and ESTE look like the best to buy calls in.",
        "created_utc": 1625388691,
        "id": "h40853b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625417491.0
    },
    {
        "author": "TechniCruller",
        "body": "Buy the run on ORCL",
        "created_utc": 1625237017,
        "id": "h3t5z10",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625265817.0
    },
    {
        "author": "Hornysnek69",
        "body": "24x orcl 90",
        "created_utc": 1625609313,
        "id": "h4acy7l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625638113.0
    },
    {
        "author": "baconNlegs",
        "body": "Any news on ORCL? Up 9% in 5 days",
        "created_utc": 1625673025,
        "id": "h4d6494",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625701825.0
    },
    {
        "author": "Hornysnek69",
        "body": "My ORCL calls doubled today. Too bad I sold all but 2 for a 40% gain",
        "created_utc": 1625679871,
        "id": "h4dlrqm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625708671.0
    },
    {
        "author": "Imasayitnow",
        "body": "Missed the NEGG thing but 82.50 ORCL calls bailed my last few weeks out. If it's tech, and it's huge, it's printing (mostly, CRM didn't work out as well)",
        "created_utc": 1625686194,
        "id": "h4e02kb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625714994.0
    },
    {
        "author": "[deleted]",
        "body": "Fuck you ORCL",
        "created_utc": 1625752930,
        "id": "h4h334s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625781730.0
    },
    {
        "author": "Hornysnek69",
        "body": "Forgot about ORCL",
        "created_utc": 1625669706,
        "id": "h4cynrf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625698506.0
    },
    {
        "author": "Hornysnek69",
        "body": "Orcl only goes up",
        "created_utc": 1625669997,
        "id": "h4czamz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625698797.0
    },
    {
        "author": "wrex619",
        "body": "Puts on ORCL?",
        "created_utc": 1625859716,
        "id": "h4mjq2i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625888516.0
    },
    {
        "author": "Hiei154",
        "body": "ORCL at all time high breaking out. 1/10 market cap of Amazon with half of its income. Huge growth incoming once JEDI is granted to Oracle. PT 100$ next week.",
        "created_utc": 1625849831,
        "id": "h4lyic1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625878631.0
    },
    {
        "author": "Hiei154",
        "body": "ORCL at all time high breaking out. 1/10 market cap of Amazon with half of its income. Huge growth incoming once JEDI is granted to Oracle. PT 100$ next week.",
        "created_utc": 1625849266,
        "id": "h4lx83g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625878066.0
    },
    {
        "author": "GeorgeWashingtonTFP",
        "body": "What says orcl is getting contract?",
        "created_utc": 1625851306,
        "id": "h4m1r50",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625880106.0
    },
    {
        "author": "Hornysnek69",
        "body": "ORCL AINT stopping",
        "created_utc": 1625579069,
        "id": "h48ixzj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625607869.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "$85 oracle calls printing money today🤑🤑🤑",
        "created_utc": 1625237890,
        "id": "h3t80nw",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625266690.0
    },
    {
        "author": "InvestmentOracle",
        "body": "I can't stand anyone who brands themself as an 'oracle'.",
        "created_utc": 1625478169,
        "id": "h4448oz",
        "score": 0,
        "subreddit": "investing",
        "created": 1625506969.0
    },
    {
        "author": "Ninswitchsu",
        "body": "$ORCL, fuck yes! There's gotta be some banger news in the background!",
        "created_utc": 1625677322,
        "id": "h4dfxkk",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625706122.0
    },
    {
        "author": "contrejo",
        "body": "I know someone that knows nothing about investing that put money in Doge coin because of the hype and made money. Sold it and put in AMC at 30. Thinks he's an oracle.",
        "created_utc": 1625485204,
        "id": "h44bom9",
        "score": 0,
        "subreddit": "investing",
        "created": 1625514004.0
    },
    {
        "author": "OfficialTestikills",
        "body": "I personally invest heavily in Web3 crypto's and crypto projects that help run and keep these crypto's decentralised. \n\nWhat's a web3 crypto? These aren't to be confused with junk like Bitcoin that thinks it is a store of value or will become the new financial system, web3 crypto is literally creating the next stage in internet where you don't need to worry about your companies information / personal information / classified documents being stored on a server that is owned and managed by other companies. Web3 splits this up between 100's of validators that all talk to each other and keep this decentralised and secure from attacks. \n\nThere's also ones creating the future of finance. No longer do you need to get bent over by huge interest rates and banks fucking people over whenever they feel like it. DEFI is run by liquidity pools, people like you and I who store our money with the service and as a result get a percentage of the interest rates. These rates always remain low and competitive and go to the people rather than the big banks.\n\nThen you have oracles that power the decentralisation. Oracles gain info from many sources and feed it to the protocol to offer decentralised information. For easy laymans terms, if I wanted a weather oracle, it would gather weather data from 1000's weather stations and news outlets, work out the average forecast and feed that to my protocol. This means my protocol is giving the users the most accurate non-biased information. Just as a high-level. \n\nSo how do you make money from this? Well, let's look at Ethereum just as an example. Every single protect that runs on Ethereum has to pay \"gas\" fees on each transaction, this is paid in Ethereum. Ethereum already has 1000's of applications including VISA and MasterCard that constantly have a demand for Ethereum in order to operate and pay these gas fees. You as the investor holds the Ethereum they need and this creates supply and demand. Additionally, each time a company pays their gas fees, the gas is \"burnt\" (meaning Ethereum used to pay for the transaction is burnt) creating deflation. \n\nEthereum is just one project, and not one that I personally even invest in that much, but it's one that I'm sure most people have heard of.   \nIf you want to look at getting some crypto while it's currently on a low and has huge potentially to be the future of a new decentralised internet feel free to use my exchange code. Swyftx is aussie based exchange and you get 20% off fees with my code, plus I get a kick back [https://trade.swyftx.com.au/register/?ref=brentboydskinner](https://trade.swyftx.com.au/register/?ref=brentboydskinner)\n\n&amp;#x200B;\n\nMessage me if you want to know more",
        "created_utc": 1625700460,
        "id": "h4ew1mj",
        "score": -1,
        "subreddit": "investing",
        "created": 1625729260.0
    },
    {
        "author": "Hiei154",
        "body": "Oracle going to moon. Huge breakout that noone knows about",
        "created_utc": 1625705315,
        "id": "h4f5laf",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1625734115.0
    },
    {
        "author": "ShirleySerious1",
        "body": "The Oracle.",
        "created_utc": 1625779296,
        "id": "h4ipvpt",
        "score": -1,
        "subreddit": "StockMarket",
        "created": 1625808096.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "Oracle Calls killing it today🤑This is about the time most people fomo in🤔",
        "created_utc": 1625675331,
        "id": "h4dbdy8",
        "score": -3,
        "subreddit": "wallstreetbets",
        "created": 1625704131.0
    },
    {
        "author": "Hiei154",
        "body": "Oracle breaking out. Buy this if you missed out on Amazon and MSFT",
        "created_utc": 1625842406,
        "id": "h4li09q",
        "score": -4,
        "subreddit": "wallstreetbets",
        "created": 1625871206.0
    },
    {
        "author": "Scottieboo71",
        "body": "LSPD stickers for my laptop came in today!!!   I teach Finance at a college and I have a friendly stock market challenge with a few on them every year.  Laptop has my core holdings Apple, Oracle, CNR, TD, SU, ENB, ENGH (that one was difficult to get), and now LSPD's flame logo goes on.  Missing because it isn't a good look is GSY love the returns but can't brag about owning that in front of students living off of Kraft Dinner and Mr Noodle.  And not even the real KD, it's Giant Tiger Brand Kraft Dinner.  Aka Shitty Kitty KD.",
        "created_utc": 1625510447,
        "id": "h45kdkh",
        "score": -6,
        "subreddit": "CanadianInvestor",
        "created": 1625539247.0
    },
    {
        "author": "KyivComrade",
        "body": "Good thing you can share your wisdom then, oh eternal oracle of the market. Surely you know more then Dalio, what books have you written? \n\n\n\n\nGold is a old-school store of value by definition and as we saw in 2020 (amongst others) a great asset during times of uncertainty and crashes. Buy it during calm times, sell during fearful times.\n\n\n\n\nDividends is the only one I'd agree with since the dividend will be shrunk or cut as stockprices plummet.",
        "created_utc": 1625835651,
        "id": "h4l4jfz",
        "score": -9,
        "subreddit": "investing",
        "created": 1625864451.0
    },
    {
        "author": "InitialConclusion7",
        "body": "Apple (AAPL) - 6.10%\n\nMicrosoft (MSFT) - 2%\n\nGoogle (GOOGL) - 0.50%\n\nVisa (V) - 0.50%\n\nFacebook (FB) - 0.50%\n\nPalantir Technologies (PLTR) - 0.80%\n\nAlibaba (BABA) - 1%\n\nPayPal (PYPL) - 0.5%\n\nSquare (SQ) - 3%\n\nNVIDIA (NVDA) - 1.50%\n\nAdvanced Micro Devices (AMD) - 3%\n\nCanadian Solar (CSIQ) - 3%\n\nEnphase (ENPH) - 3%\n\nTesla (TSLA) - 10%\n\nNIO (NIO) - 1.25%\n\nShopify (SHOP) - 3%\n\nPinterest (PINS) - 0.50%\n\nEtsy (ETSY) - 2.25%\n\nLemonade (LMND) - 0.50%\n\nTilray (TLRY) - 0.50%\n\nSoFi Technologies (SOFI) - 1%\n\nRedfin (RDNF) - 2%\n\nARKK - 0.50%\n\nTAN - 1.60%\n\nQQQ - 12%\n\nVOO - 4%\n\nIWB - 4%\n\nVTI - 3.20%\n\nDIA - 2.40%\n\nVHT - 2.30%\n\nBitcoin (BTC) - 5%\n\nEthereum (ETH) - 1.5%\n\nCardano (ADA) - 1.5%\n\nCash - 10%",
        "created_utc": 1627815883,
        "id": "h7avh47",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627844683.0
    }
]