[
    {
        "author": "assuasivedamian",
        "body": "Original meme stock? What boomer shit is this....\n\nIts no like no one remembers AMD or JNUG",
        "created_utc": 1614807912,
        "id": "gpkzm1z",
        "score": 175,
        "subreddit": "investing",
        "created": 1614836712.0
    },
    {
        "author": "NotBeforeMyCovfefe",
        "body": "Any time a specific stock gets a sub, Im out. There are exceptions for subs that focus on products like AMD, but a sub for the stock is a bad sign.",
        "created_utc": 1614786138,
        "id": "gpjl37s",
        "score": 134,
        "subreddit": "stocks",
        "created": 1614814938.0
    },
    {
        "author": "nevetando",
        "body": "Are there some tech stocks that are overvalued? yes. \n\nis all of tech overvalued? no.\n\nBut the whole sector is suffering because of a few. Just take a deep breath and relax. if you own any solid, diversified, mainstay tech (apple, Microsoft, even intel and AMD) you are going to be fine in the long run. \n\nIf you are in emerging tech, new companies, growing companies... well, godspeed. it is going to be bumpy. \n\nHistory favors tech though. but like all things, it goes in and out of favor with the people.",
        "created_utc": 1614881504,
        "id": "gpogfr3",
        "score": 100,
        "subreddit": "stocks",
        "created": 1614910304.0
    },
    {
        "author": "educated-emu",
        "body": "Also the additional question people ask...\n\nWell if the hedge funds are trading stocks then why can't they sell those shares to cover the short positions.\n\nThis is where the illegal morally but legal system comes into play.\n\nThe hedge fund have been borrowing non existance shares from clearing house and using those to short the system. So they actually don't own any stock to close their short positions. when you see people say that they have shorted 137% of the market it means they can't even buy back all real shares in the market to close positions. So they are bleeding every day a lot of money.\n\nOne of the rules is that when they borrow a stock they will promise to return the stock in x days to the borrower and each day it costs 0.5% in interest of the stock value.\n\nSo now they have x days to drive the stock price down enough to cover their interest payments and make a profit. And remeber they do this every day, hundreds of thousands of transactions all with different parameters as things get worse.\n\nNow this is managable on a small scale but when you have it on the scale if GME its not possible. They do this every day trying to push the price down. And remember interest is a % so when the price starts to rise that is 0.5 turns into 0.5 of the current stock price. So if we hold our positions they just keep bleeding amd when the short positions are called they need to go and buy real stock at the real price. So if we hold and don't sell the price keeps going up as the more they buy the more the price rised.\n\nDiaclaimer: I have no idea what I talk about, read up about naked short selling and also about fake share issuers for trading and cry because rules don't apply for the rich.",
        "created_utc": 1614866968,
        "id": "gpnjond",
        "score": 96,
        "subreddit": "Wallstreetbetsnew",
        "created": 1614895768.0
    },
    {
        "author": "conti555",
        "body": "I think people are taking the DCF valuation theory too seriously. Thinking back to 2018, AMD, Nvidia, Google etc were all soaring despite the 10 year treasury reaching over 3%. What percentage of the market values companies purely in DCF anyway?\n\nI think this is more a broader correction around fears that the Fed will not live up to it's word on 'average inflation targeting' and will have to raise rates sooner and quicker than normal. I personally can't see this happening, as the Fed has shown itself to be extremely dovish and is trying to recover the real economy first (jobs ans solvency issues). \n\nThere is also the huge debt problem they now have from all the money printing they've done, the easiest way for them to solve that is to inflate it away as quickly as possible, so long term high inflation seems like something they would try for. I can't see the USA going into any kind of austerity to pay it off.",
        "created_utc": 1614894009,
        "id": "gppa9gs",
        "score": 49,
        "subreddit": "investing",
        "created": 1614922809.0
    },
    {
        "author": "Yokies",
        "body": "AMD",
        "created_utc": 1614780769,
        "id": "gpj9km4",
        "score": 46,
        "subreddit": "stocks",
        "created": 1614809569.0
    },
    {
        "author": "RandomlyGenerateIt",
        "body": "That better be true, because I bought a bunch of AAPL/AMD/NVDA on margin on that first \"dip\", and now it doesn't feel so much like \"free money\" anymore...",
        "created_utc": 1614811378,
        "id": "gpl776l",
        "score": 46,
        "subreddit": "stocks",
        "created": 1614840178.0
    },
    {
        "author": "Haiwan2000",
        "body": "Sorry guys, I had to sell all my shares...of AMD. All in on GME!",
        "created_utc": 1615226446,
        "id": "gq8hjx2",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1615255246.0
    },
    {
        "author": "Chuckcompany2",
        "body": "GME gang, why u mad at RKT gang if that thing is giving sweet tendies, GME is not gonna happen tomorrow, relax and let the RKT gang collect some tendies that maybe later will go to GME.\n\nGeez the salt.\n\nDisclaimer: i don't own RKT shares, this is not financial advice.\n\nDisclaimer 2: i do have AMD and PLTR shares thst won't fucking move , damn i feel like an idiot.",
        "created_utc": 1614764613,
        "id": "gpio0xg",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1614793413.0
    },
    {
        "author": "floppingsets",
        "body": "Nah something fishy is def going on. There has been silence all week about them going up. The action suggests they never covered it’s just a matter of how much manipulation you get away with. This is the problem when an app like robinhood sells orderflow info. These guys know where the stop losses are amd can act accordingly. How the sec hasn’t done a thing yet especially allowing selling amd no buying the first time around was absolutely astonishing.\nInstead this week they go after ATT for misleading guys who shorted the stock lol like do they just work for hedge funds.",
        "created_utc": 1615405408,
        "id": "gqhgh3m",
        "score": 29,
        "subreddit": "stocks",
        "created": 1615434208.0
    },
    {
        "author": "JPOWsFluffer",
        "body": "AMD, my favorite company, you massacred my portfolio 😭",
        "created_utc": 1614816823,
        "id": "gpli324",
        "score": 28,
        "subreddit": "options",
        "created": 1614845623.0
    },
    {
        "author": "ThermalFlask",
        "body": "I've been holding some AMD for quite a while now and hoping for returns. Hovering around modest losses for a while but I have faith in its long term prospects",
        "created_utc": 1614799216,
        "id": "gpkfi7w",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1614828016.0
    },
    {
        "author": "No-Pay3755",
        "body": "What are you holding? In the long run stonks go up. I’ve had plenty of companies that I wish I held on to but sold for small gains. NVDA at $9 that I sold in the $20’s 200 shares of AMD that I couldn’t wait to unload at $5.25 only to see it rip. 365 shares of AAPL at $65 that split many times since I sold it. I would have had 10,000+ shares by now but I sold at $85. I would have done better if I didn’t login at all sometimes. Hang tight. They will turn around. If you have to sell, just sell enough so you can sleep at night.",
        "created_utc": 1614802064,
        "id": "gpkm4mo",
        "score": 25,
        "subreddit": "stocks",
        "created": 1614830864.0
    },
    {
        "author": "MasterCookSwag",
        "body": "AMD is a meme stock that ended up turning itself around, there’s a lot of people on Reddit that rode AMD down from the $30s to the sub $3 range, where it traded for years before the company turned itself around.  Many might be too young to remember it but there was a lot of bag holders for years with AMD.",
        "created_utc": 1614817618,
        "id": "gpljlpj",
        "score": 24,
        "subreddit": "investing",
        "created": 1614846418.0
    },
    {
        "author": "deboor71090",
        "body": "Added a couple shares on the dip yesterday (168) amd they've already made 40% 😂 Thats why you buy that god damn dip even when it averages you up a little\n\nEdit for positions 16.5 at 142 average",
        "created_utc": 1615316838,
        "id": "gqd09tf",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1615345638.0
    },
    {
        "author": "moldiewart",
        "body": "\"Great low buying point for AMD\"\n\nI said to myself 14 days in a row.",
        "created_utc": 1614883020,
        "id": "gpok2hv",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1614911820.0
    },
    {
        "author": "Networkishard00",
        "body": "I made a yolo call on non existant earnings report. On trading view it says AMD earning report is today so i yolo'd 10k into 3/5 calls $80. Started googling around and searching for it... yeah i dont think its today boyos. Made a bet thinking their was a catalyst but its not even there. lmao. beans and rice for awhile",
        "created_utc": 1614893412,
        "id": "gpp8wmi",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1614922212.0
    },
    {
        "author": "gotslayer",
        "body": "Bought 7.92 shares on the dip. All I have to throw into it. Lets hit 400 today so I can double my money. Hold amd buy. 🚀👩‍🚀🚀👨‍🚀🚀👩‍🚀🚀 🌙🌚🌔🌖🌛🌜🌙",
        "created_utc": 1615404720,
        "id": "gqheuj1",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1615433520.0
    },
    {
        "author": "zentraudur",
        "body": "Hertz was a joke that people actually ended up going in on. I wouldn’t call it a meme stock like amd, gme, or Tesla.",
        "created_utc": 1614808538,
        "id": "gpl114m",
        "score": 21,
        "subreddit": "investing",
        "created": 1614837338.0
    },
    {
        "author": "HolderofFour",
        "body": "Remember when AMD got halted because normies thought it was AMC. Lmao",
        "created_utc": 1614821673,
        "id": "gplqlmj",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1614850473.0
    },
    {
        "author": "Chuckcompany2",
        "body": "I just have to say, to all of you retard colleagues, through the losses we hold together,  as we are all brothers and sisters in whatever stock we are in.\n\nI wish you guys recover from rkt drop of today, and that this tendieloss don't affect your spirit.\n\nBig money doesn't want small money to win, so everytime one of us lose, we all lose.\n\nMay today's red day be remembered as the day we reunited.\n\nWe are all poortards, PLTR,GME,AMC,RKT, APHA,TLRY,SNDL....\n\nDisclaimer: i don't hold nor ever had any RKT calls puts or stocks. My main assets are slowlybleeding AMD and PLTR.\n\nMay the stonks be with you all",
        "created_utc": 1614805922,
        "id": "gpkv239",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1614834722.0
    },
    {
        "author": "lenapedog",
        "body": "I miss the holy trinity of TSLA, AMD, and SPY here.",
        "created_utc": 1615339951,
        "id": "gqeckgs",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1615368751.0
    },
    {
        "author": "Sugabones",
        "body": "FUCKING AMD JUST FUCKING SUCCEED YOU STUPID FUCK",
        "created_utc": 1615391313,
        "id": "gqgfz2l",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1615420113.0
    },
    {
        "author": "Inquisitor1",
        "body": "You can't get a next gen console either for anywhere near msrp. Consoles use amd. Consoles don't come even close to PC.",
        "created_utc": 1614879875,
        "id": "gpoclh1",
        "score": 20,
        "subreddit": "stocks",
        "created": 1614908675.0
    },
    {
        "author": "Honztastic",
        "body": "BRUH IM SO RETARDED AND SMOOTH BRAIN, I DONT EVEN HAVE LIVE MARKET UPDATES.\n\nIM SEEING SHIT 5 MINUTES OLD.\n\nI cant even react to your shit live, what makes you think I can panic sell when you want?\n\nI held at 280 from January. I bought at 43 amd averaged down. Im here for your yachts motherfuckers.\n\n💎🤲",
        "created_utc": 1615400020,
        "id": "gqh37f3",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1615428820.0
    },
    {
        "author": "noadjective",
        "body": "Yeah :( I literally started investing end of January, I am not even sure when I will break even. I invested in AMD, CRSR, PRNT, AAPL, ARKK, ARKW.\n\nI'm so worried I am not sure how much money I am going to lose :(",
        "created_utc": 1614795311,
        "id": "gpk6hdp",
        "score": 19,
        "subreddit": "stocks",
        "created": 1614824111.0
    },
    {
        "author": "mishka__",
        "body": "AMD - Advanced Money Destroyer\n\nAMC - Advanced Money Creator",
        "created_utc": 1615828602,
        "id": "gr16h2g",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1615857402.0
    },
    {
        "author": "touchmysweatythighs",
        "body": "The fact that AMD isn’t 100$ is a crime",
        "created_utc": 1615860668,
        "id": "gr2vthb",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1615889468.0
    },
    {
        "author": "Redditor45643335",
        "body": "AMD you're gunna have to start paying a dividend if you want to trade like a boomer stock.",
        "created_utc": 1614722689,
        "id": "gpgrkdi",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1614751489.0
    },
    {
        "author": "Why_Istanbul",
        "body": "No because r/amd is or should be about AMD consumer products. PLTR doesn’t sell consumer products",
        "created_utc": 1614789712,
        "id": "gpjtcb2",
        "score": 18,
        "subreddit": "stocks",
        "created": 1614818512.0
    },
    {
        "author": "mr_blockchain_",
        "body": "Here's some DD:\n\n1. there is speculation that hedge funds are rotating into Big Tech this week\n2. AMD is one of the most undervalued tech stocks on a fundamental level\n3. what I wrote here: [from a trading platform](https://www.reddit.com/r/wallstreetbets/comments/m5tffe/what_are_your_moves_tomorrow_march_16_2021/gr2b1il?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n4. what this guy wrote: [another guy's DD post](https://www.reddit.com/r/wallstreetbets/comments/m189zy/it_is_time_to_return_to_tradition_reintroducing/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n5. AMD is also a meme stock - providing potential for social media mass-buy event\n6. Sue Bae \n7. the play:\n   1. $83 end of March calls\n   2. $90 mid-year calls\n   3. $100 end of year calls",
        "created_utc": 1615849736,
        "id": "gr2cr0d",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1615878536.0
    },
    {
        "author": "calamitymic",
        "body": "Current gen ryzen chips are touted to be better than current gen intel. GPU game is gaining on nvidia. Ai software starting to utilize amd gpu. I think they are ready to take more market share. \n\nHaven’t bought the dip but I’m waiting for slight buying pressure. Then, I’m gonna go in dry as fuck because I need them to feel pain when I insert myself.\n\nTLDR: I’m bull dick bullish on AMD",
        "created_utc": 1614866733,
        "id": "gpnj8yg",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1614895533.0
    },
    {
        "author": "Currie32",
        "body": "There are three main aspects of a company that I try to evaluate: (1) How large it might become (2) How quickly it will grow to that size (3) How expensive it is relative to points 1 and 2.\n\nTo understand how large the company might become, I'll read the company's earnings reports and presentations. This informs me of the company's current and potential long-term plans. I also want to know how large the industry is, so I'll look at the market caps of other companies in the industry. If you google \"addressable market of company x\", there might be a report about that. If you don't find it for the company in question, then try googling its closest competitors. Preferably, the industry is very large or the company is one of the smaller ones as this suggests there can be a long runway of growth.\n\nHow quickly the company will grow might be the easiest of these three points to evaluate. I tend to look for consistent high growth (&gt;40%) and strong forecasted growth. This isn't a requirement as companies like [AMD](https://theportfoliolab.com/summary/AMD) have experienced poor historical growth, but their current future looks good (I own some shares in AMD). Nonetheless, I still see it as a positive. As I tend to invest in unprofitable, smaller companies ($5-10B), I pay more attention to revenue and gross profit growth, rather than net income. I use this [correlation](https://theportfoliolab.com/compare) feature as a guide for which metrics to focus on by measuring the correlation between market cap and revenue, gross profit, net income for the company's industry.\n\nTo evaluate how expensive the company is, I'll compare its growth vs price-to-X ratio, where X is usually revenue or gross profit. I prefer to pay more attention to gross profit than revenue as that includes gross margin in the calculation. I think companies that perform a similar service, but at a higher margin (more efficient), should have a higher valuation. Price-to-gross profit growth ratio (similar to [PEG ratio](https://www.investopedia.com/terms/p/pegratio.asp)), is useful as it balances gross profit growth and price-to-gross profit ratio. I see expansiveness as a relative concept, so I'll use this [distribution](https://theportfoliolab.com/compare) feature to compare companies within an industry.\n\nSo to summarise: (1) Large and growing market (2) high, consistent gross profit growth (3) low price-to-gross profit ratio",
        "created_utc": 1614851081,
        "id": "gpmy8tr",
        "score": 17,
        "subreddit": "stocks",
        "created": 1614879881.0
    },
    {
        "author": "eujc21",
        "body": "So I’m looking at my AMD, and I love AMD. I’ve always wanted to have AMD stock. But I will sell my AMD and move it to GME to buy a fucking EPYC server. Because I love AMD.",
        "created_utc": 1614800897,
        "id": "gpkjg5b",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1614829697.0
    },
    {
        "author": "GrassOrAss954",
        "body": "Chasdaq could open +5% and AMD still be -5%. Su Bae, why have thou forsaken me?",
        "created_utc": 1615256014,
        "id": "gqa7k20",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1615284814.0
    },
    {
        "author": "qqeyes",
        "body": "There's always money in the ~~banana stand~~ $AMD",
        "created_utc": 1615505190,
        "id": "gqmq45q",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1615533990.0
    },
    {
        "author": "zSprawl",
        "body": "AMD is my jam baby! Been holding since $3 a share. Let’s do it!",
        "created_utc": 1614791703,
        "id": "gpjy1j5",
        "score": 15,
        "subreddit": "stocks",
        "created": 1614820503.0
    },
    {
        "author": "DGNick2021",
        "body": "One week ago:  nice just averaged down a little and picked up some AMD at $84.\n\nThree days ago: wow AMD on sale at $82.  Pick up a few shares and average down again.\n\nToday: AMD below $80.  I’m running out of cash to average down but here we go again.",
        "created_utc": 1614875679,
        "id": "gpo2tni",
        "score": 15,
        "subreddit": "investing",
        "created": 1614904479.0
    },
    {
        "author": "BubbleTeaExtraSweet",
        "body": "Thinking of selling my AMD to get more GME. I'm sorry Mama Su, i'll be back for you once i'm on the moon with GME",
        "created_utc": 1617030279,
        "id": "gsozy2s",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1617059079.0
    },
    {
        "author": "iseeemilyplay",
        "body": "It dropped from 350 to 198 in like 5 minutes of trading. Then shot back up to 250 or so amd was relatively (for gme) stable rest of the  night",
        "created_utc": 1615411375,
        "id": "gqhudp9",
        "score": 14,
        "subreddit": "stocks",
        "created": 1615440175.0
    },
    {
        "author": "Tiny_Ad_2905",
        "body": "Apple, AMD, NVDIA, NIO and Tesla bleeding meanwhile GME winning, we love to see it",
        "created_utc": 1614887183,
        "id": "gpou5me",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1614915983.0
    },
    {
        "author": "Zeki_Boy",
        "body": "Are we giving this a push in the last 5trading mins? Sold some AMD for this",
        "created_utc": 1614889513,
        "id": "gpozok6",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1614918313.0
    },
    {
        "author": "thewaterb0yyyy",
        "body": "AMD was a good man. A decent man",
        "created_utc": 1615255791,
        "id": "gqa7596",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1615284591.0
    },
    {
        "author": "HeadMucketyMuck",
        "body": "HOLD GME, \nHOLD AMD, \nHOLD RBLX. \nBUY GME DIPS\nRinse and repeat",
        "created_utc": 1615502523,
        "id": "gqmks0w",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1615531323.0
    },
    {
        "author": "CarelessCupcake",
        "body": "AMD $100k a share is not a meme.",
        "created_utc": 1615931109,
        "id": "gr65659",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1615959909.0
    },
    {
        "author": "captainstrange94",
        "body": "Lol bro companies like amd, nvidia, amzn have lost gains going back to july 2020.",
        "created_utc": 1615234617,
        "id": "gq90isn",
        "score": 14,
        "subreddit": "stocks",
        "created": 1615263417.0
    },
    {
        "author": "lyleberrycrunch",
        "body": "Yeah CNBC was blabbering nonstop about oil and value picks and I’m like sure maybe those stocks can run up another 10 maybe 25% but where will they go from there? AMZN can justify a 75 (and dropping) PE, same with AMD at 40 PE now. Can XOM, CCL, or even eventually financials stocks justify their PEs if they keep rising? I will keep investing in growth regardless of what these dorks on all these financial news channels/sites tell me. Tech is down 1 month oh no the horror. I read the earnings reports, interest rates won’t spook me",
        "created_utc": 1614898228,
        "id": "gppjhen",
        "score": 14,
        "subreddit": "stocks",
        "created": 1614927028.0
    },
    {
        "author": "Knicks94",
        "body": "AMD $90 coming soon",
        "created_utc": 1615821204,
        "id": "gr0pokn",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1615850004.0
    },
    {
        "author": "point_of_you",
        "body": "I'm surprised anyone thinks buying Lululemon for above $300 a share is a good deal. \n\nAAPL and AMD do seem undervalued",
        "created_utc": 1614795365,
        "id": "gpk6lzd",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1614824165.0
    },
    {
        "author": "jmgreen823",
        "body": "I got bent over hard on some recent AMD calls. AMD doesn't seem to trade with any correlation to the broader market. I would feel confident with leaps, but anything short term feels like a gamble.",
        "created_utc": 1614799743,
        "id": "gpkgqo1",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1614828543.0
    },
    {
        "author": "SLIMEbaby",
        "body": "NET 4/16 85c\n\nAMD 4/16 90c\n\nTGT 4/16 200c\n\nBABA 4/16 300c\n\nTJX 4/16 70c\n\nXOM 3/19 55p\n\nSQ 4/16 300c\n\nTSLA 4/16 800c",
        "created_utc": 1615329049,
        "id": "gqdrfar",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615357849.0
    },
    {
        "author": "tacofury-inc",
        "body": "AMD CALLS IS DA WAY TOMORROW",
        "created_utc": 1615508671,
        "id": "gqmwqx0",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615537471.0
    },
    {
        "author": "Esvbig",
        "body": "HOLD THE LINE APES AMD KEEP BUYING",
        "created_utc": 1615393240,
        "id": "gqgkwhr",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615422040.0
    },
    {
        "author": "conncurr24",
        "body": "PLTR and AMD are beautiful",
        "created_utc": 1615316061,
        "id": "gqcykan",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615344861.0
    },
    {
        "author": "hom6872",
        "body": "This is getting a little ridiculous.  Amazon about to drop below $3k?  Other names like Apple and AMD getting crushed.  This isn’t even worth it anymore.",
        "created_utc": 1614799222,
        "id": "gpkfiqf",
        "score": 13,
        "subreddit": "stocks",
        "created": 1614828022.0
    },
    {
        "author": "Krios625",
        "body": "Also invested in semiconductors with SMH, don't worry about anything serious. AMD and Nvidia had incredible quarters and their stock dropped, so it's more of an irrational market. Never forget that the stock market rewards the patient",
        "created_utc": 1614801066,
        "id": "gpkju1i",
        "score": 13,
        "subreddit": "stocks",
        "created": 1614829866.0
    },
    {
        "author": "new-chris",
        "body": "These new AMD Server processors beat intel at their own game I bet they start taking more share over the next few qtrs",
        "created_utc": 1615870885,
        "id": "gr3cira",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615899685.0
    },
    {
        "author": "wallthrowawaystreet",
        "body": "AMD, after this stint, we are through. Fool me a dozen times, shame on me.",
        "created_utc": 1614819425,
        "id": "gplmi64",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1614848225.0
    },
    {
        "author": "reginaldvs",
        "body": "I'm honestly shocked AMD is falling. I built my first AMD PC last year and Ryzen is killing it. Not to mention, their Radeon division is competitive with NVIDIA. But anyways, Is it because of the chip shortage? Who knows.",
        "created_utc": 1614824970,
        "id": "gplx68v",
        "score": 13,
        "subreddit": "options",
        "created": 1614853770.0
    },
    {
        "author": "Google_-_Ultron",
        "body": "Currently balls deep in AAPL and AMD calls hoping to get that tech love too",
        "created_utc": 1615430519,
        "id": "gqiwkm1",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615459319.0
    },
    {
        "author": "chusifer24",
        "body": "christ is amd going bankrupt? this shit down every goddamn day",
        "created_utc": 1615239523,
        "id": "gq9brhb",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615268323.0
    },
    {
        "author": "areweinnarnia",
        "body": "do it! over the years I've just invested in stuff I like from companies I believed in - Jack in the box after I had their dollar tacos for the first time, AMD and Nvidia when I did my first pc build, Nintendo in the Wii U era when everyone thought the Wii U was shit and that a mobile game catching pokemon would never work.  \nMy only regret is that I didn't have more then a couple hundred in each of them.",
        "created_utc": 1615243926,
        "id": "gq9l32v",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615272726.0
    },
    {
        "author": "conncurr24",
        "body": "My whole portfolio is ALLY, PLTR, TSM, and AMD . I’m already down like $7000. How Fuk am I?",
        "created_utc": 1615249336,
        "id": "gq9vd5m",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615278136.0
    },
    {
        "author": "oregon_forever",
        "body": "Most tech stocks are sitting exactly at their long term support (AMD, AMZN, AAPL) not to mention QQQ exactly at $300. They are not going to allow it to go further down because it would crash the whole market. Load up on tech calls and thank me later when you get rich.",
        "created_utc": 1615253126,
        "id": "gqa2azt",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615281926.0
    },
    {
        "author": "ExceptionallyGreat",
        "body": "Sold my AMD $83 calls at the top, should have bought them back on that dip. Bought NIO $46 calls instead, hopefully tomorrow will be a better day for NIO.",
        "created_utc": 1615850820,
        "id": "gr2eewp",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615879620.0
    },
    {
        "author": "MrBojangerangs",
        "body": "I am a professional bag holder for Nio, hylean and AMD \n\nAma",
        "created_utc": 1614826207,
        "id": "gplzp4m",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1614855007.0
    },
    {
        "author": "Blackboxeq",
        "body": "First Nvidia.. then AMD... then PS5.... now Xbox bundles.  is nothing in stock anymore?",
        "created_utc": 1615327164,
        "id": "gqdnfxt",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615355964.0
    },
    {
        "author": "spellbadgrammargood",
        "body": "alirhgt left my AMD position to buy more GME lets go boyssss",
        "created_utc": 1615388045,
        "id": "gqg8jn6",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615416845.0
    },
    {
        "author": "tokenblakk",
        "body": "AAPL and SPY weeklies, LUV and AMD weeklies, AMC weekly FD, a long dated OTM NIO call, and a VXX weekly for some flavor 🤌🏾👨🏾‍🍳",
        "created_utc": 1615864548,
        "id": "gr32w5d",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615893348.0
    },
    {
        "author": "a-smooth-brain",
        "body": "Before you buy AMD do this instead: \n\nGo on Google and search for your closest market maker and wire them the money instead.",
        "created_utc": 1617122253,
        "id": "gstf20d",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1617151053.0
    },
    {
        "author": "VaultBoy3",
        "body": "Ok I'm ready for AMD $100 now",
        "created_utc": 1617230222,
        "id": "gsytenw",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1617259022.0
    },
    {
        "author": "vba77",
        "body": "AMD TO THE MOON. Do your DD",
        "created_utc": 1615415825,
        "id": "gqi484c",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615444625.0
    },
    {
        "author": "CratesOfSocks85",
        "body": "BUY AMD BEFORE ITS TOO LATE 🚀🚀",
        "created_utc": 1615502484,
        "id": "gqmkp6o",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615531284.0
    },
    {
        "author": "vegasnick2241",
        "body": "Ayo I'm getting the stimmy Wednesday. $1400 into Amd? AAPL? Weed? Pltr? What's the move",
        "created_utc": 1615767818,
        "id": "gqyo2d0",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615796618.0
    },
    {
        "author": "EmpValentine",
        "body": "My portfolio is a collection of PRPL, CRSR, AMD, ENPH, PLUG. I added RKT yesterday at $32.53 during the first dip. I even got 35C's for RKT because I thought it was FINALLY being fairly valued. \n\nSo if any of you want to know what positions I open in order to reverse it let me know.",
        "created_utc": 1614867663,
        "id": "gpnl0ky",
        "score": 11,
        "subreddit": "investing",
        "created": 1614896463.0
    },
    {
        "author": "Betabagels",
        "body": "AMD releases a new graphics card and the stock tanks. Guess AMD was from the school of NOK and BB",
        "created_utc": 1614825885,
        "id": "gplz19s",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1614854685.0
    },
    {
        "author": "spyaintnobitch",
        "body": "Gonna pick up AMD at $8 at this rate",
        "created_utc": 1614824493,
        "id": "gplw74o",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1614853293.0
    },
    {
        "author": "PotatoWriter",
        "body": "rotation into AMD and TSM. My conductor is getting a semi thinking about semiconductor",
        "created_utc": 1615263298,
        "id": "gqakh1w",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615292098.0
    },
    {
        "author": "maxkingusa",
        "body": "So basically Cathie said... if you liked these stocks 2 months ago, you should looooove them today.  She sees bigger gains now that they had these drops.  On one hand you want to puke up your lunch but on the other hand.... we should want this drop in tech and the chance to buy back the key growth companies.  \n\nI bought AAPL, NVDA, AMD, AVGO, XLE and DB (to add some more financials and energy to my portfolio).  This keeps me balanced and I can wait out the pain that tech is providing.  \n\nMy biggest gains that I have held are from VIAC, SBUX, HP, JPM, STOR, LUMN, SPY, and a host of others.\n\nLet's see if adding to tech this week will pay off.",
        "created_utc": 1615237290,
        "id": "gq96pxs",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615266090.0
    },
    {
        "author": "NKisAlive",
        "body": "Bought AAPL and AMD dips",
        "created_utc": 1615230685,
        "id": "gq8rgbj",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615259485.0
    },
    {
        "author": "DestroyerOfPussy69",
        "body": "AMD is undervalued",
        "created_utc": 1614824703,
        "id": "gplwme4",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1614853503.0
    },
    {
        "author": "floppingsets",
        "body": "Everyone goes to the Amazon example. I’d like to hear another one. Uber amd lyft lose 30% on every ride. I feel like some business are jobs that don’t scale. If there was no Amazon to point to nobody would be investing in these companies. The funny thing is covid causes Uber amd Lyft to lose less money cause there are no rides.",
        "created_utc": 1614747148,
        "id": "gpi2rpn",
        "score": 11,
        "subreddit": "stocks",
        "created": 1614775948.0
    },
    {
        "author": "vee_xx",
        "body": "I’m in for holding AMD long. 13 shares at $90 &amp; unfortunately my $90 calls last week expired worthless.",
        "created_utc": 1614751294,
        "id": "gpi8uc4",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1614780094.0
    },
    {
        "author": "Young8Kobe",
        "body": "Thoughts on AMD reaching $90 by the end of month?",
        "created_utc": 1615866039,
        "id": "gr35ekk",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615894839.0
    },
    {
        "author": "RobotBrunch",
        "body": "AMD SOXL NVIDIA\n\nAll great stocks to own",
        "created_utc": 1614820835,
        "id": "gployh1",
        "score": 11,
        "subreddit": "stocks",
        "created": 1614849635.0
    },
    {
        "author": "CroissantDuMonde",
        "body": "PLTR at 22 = strong buy\nTSLA at 570 = strong buy\nAAPL at 116 = strong buy\nAMD at 75 = strong buy\n\n\nThis is not financial advice, I just invest for longer than 1 week horizon.",
        "created_utc": 1615229994,
        "id": "gq8puvy",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615258794.0
    },
    {
        "author": "betaraywill",
        "body": "AMD is such bullshit.\n\nAdvanced money destroyer is back",
        "created_utc": 1615389360,
        "id": "gqgbged",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615418160.0
    },
    {
        "author": "LordBinLorry",
        "body": "AMD makes no sense to sit where it is and it's crazy that the intel charm offensive is still so effective.\n\nDon't get me wrong, Gelsinger is a great add but man they have such a huge mountain to climb.",
        "created_utc": 1617145190,
        "id": "gsusb5x",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1617173990.0
    },
    {
        "author": "VaultBoy3",
        "body": "More AMD until we hit pre-dip prices",
        "created_utc": 1615512363,
        "id": "gqn3trm",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1615541163.0
    },
    {
        "author": "VirtualParzival",
        "body": "Their chips sell out INSTANTLY when they hit the market, months after release.  That's all I needed to know.  Already bought in some long options, will probably buy in more.  \n\n\nOn a side note I've build new PC's for years, this year is the first time I've favored AMD over Intel for CPU and I am in love.  It's a better product at a lower price.",
        "created_utc": 1614867092,
        "id": "gpnjx24",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614895892.0
    },
    {
        "author": "pete17100",
        "body": "crazy how gme is stable 115-120 is really the new 40, anyway appl, amd on sale if yall got extra tendies",
        "created_utc": 1614881187,
        "id": "gpofowr",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614909987.0
    },
    {
        "author": "AntiochusIV",
        "body": "I dreamed a dream in time gone by\n\nOf AMD and TSLA tendies",
        "created_utc": 1615242821,
        "id": "gq9iupo",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1615271621.0
    },
    {
        "author": "javeliner10000",
        "body": "To the fellow retard that was my server at BWW I hope your amd stock kills it here soon! From the bro that is balls deep in gme",
        "created_utc": 1614828522,
        "id": "gpm47sd",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614857322.0
    },
    {
        "author": "HereToPartyHardy",
        "body": "Just reinstalled Robinhood after buying 100 shares of AMD and deleting the app back in August. I can’t wait to see how much money I’ve made!",
        "created_utc": 1615566944,
        "id": "gqpee7j",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1615595744.0
    },
    {
        "author": "whatshisuserface",
        "body": "i need AMD to be memed all the way to $120",
        "created_utc": 1615432746,
        "id": "gqj0mob",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1615461546.0
    },
    {
        "author": "DestroyerOfPussy69",
        "body": "Someone needs to write up some good AMD DD once the front page stops being spammed with retard stocks. I've only done short form DD in daily threads so far. There's a lot of positives to pick through so it shouldn't be difficult.",
        "created_utc": 1614826711,
        "id": "gpm0omc",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614855511.0
    },
    {
        "author": "sveltepants",
        "body": "why is AMD always so gay",
        "created_utc": 1617121792,
        "id": "gste0g6",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1617150592.0
    },
    {
        "author": "tameimpala25",
        "body": "It is absolutely insane to me that AMD just isn’t breaking out yet. It’s been consolidating for literally 6 months",
        "created_utc": 1615827855,
        "id": "gr14s9x",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1615856655.0
    },
    {
        "author": "NKisAlive",
        "body": "I think imma go balls deep in FB, AMD, and CRSR and throw my phone in a river.",
        "created_utc": 1614899502,
        "id": "gppm4dj",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614928302.0
    },
    {
        "author": "betercallsaul",
        "body": "AAPL and AMD seemed like good buys last week, and here they are leading another dip this week.",
        "created_utc": 1615234357,
        "id": "gq8zx03",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1615263157.0
    },
    {
        "author": "predated0",
        "body": "I have seen Phillips, Trotec and Plasmamade being mentioned in active testing. Besides that, Microsoft and Ansys are closely following the project.   \n\n\nSource: (you probably need to translate it through Google, but you can simply ctrl+f the above names)\n\n[https://www.ed.nl/eindhoven/tu-e-onderzoek-biedt-sportscholen-hoop-apparaten-verwijderen-aerosolen-uit-lucht\\~a0ea76e3/](https://www.ed.nl/eindhoven/tu-e-onderzoek-biedt-sportscholen-hoop-apparaten-verwijderen-aerosolen-uit-lucht~a0ea76e3/)  \n\n\nAs for sales, it's not for sale yet. People have been researching and developing this technology recently. The biggest issue is that purifiers are extremely costly and can cause more harm than good if they arent installed properly. They want to spend a lot of money on marketing to properly educate people how and where to install it, so I doubt its going to cost 45k$, probably more towards 50-60k$, but that is still a massive difference.\n\nAs for how it will end up performing on the stock market, I doubt the stock will keep rising, but I am fairly certain that it will at the very least spike once it is proven to have any positive results on covid, let alone that a lot of aging purifiers can be replaced with higher end hardware for the same cost.  \n\n\nAs for which ticker belongs to the company providing the new technology, I have no clue exactly, but according to other comments, there is vyst(for cheap play), LLC, trox, carr, jci(carr and jci might already be too late to invest), xiaomi, haier and midea(last three for china market). Not to forget the prototype companies Phillips, Trotec and Plasmamade ofcourse.",
        "created_utc": 1615174311,
        "id": "gq699lr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615203111.0
    },
    {
        "author": "OliveSorry",
        "body": "I like ansys at its current levels- i am an engineer and have experience with their products. However i am waiting for it to stop falling before i buy",
        "created_utc": 1614796583,
        "id": "gpk9gji",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614825383.0
    },
    {
        "author": "Stonker100",
        "body": "PTC Therapeutics should get picked up by ark genomics! Gene therapy about to be approved in may",
        "created_utc": 1614783263,
        "id": "gpjepzv",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1614812063.0
    },
    {
        "author": "suhdanny",
        "body": "QCOM. It currently trades at a historic low in terms of its P/S ratio and also is cheap compated to other chip companies in terms of P/E. The growth potential is huge regarding 5G, AR/VR, autonomous driving ... etc. It’s been on a downhill since the earning’s report, but I think this stock deserves at least a double of current price.",
        "created_utc": 1614782760,
        "id": "gpjdmyd",
        "score": 12,
        "subreddit": "stocks",
        "created": 1614811560.0
    },
    {
        "author": "Psychological_Dot541",
        "body": "$GSAT = buyout target \n\n   QUALCOMM- and -ERICSSON \n\nAPR 2, 2019:\nFormer Qualcomm boss pivots toward 5G startup XCOM.\n\nSEP 17, 2020: \nEricsson, Qualcomm, and U.S. Cellular announce first ever successful extended range 5G NR millimeter Wave (mmWave) data call in the U.S. on a commercial network.\n\nOCT 9, 2020:\nEricsson selected for U.S .DOD 5G testing.\n\nNOV 11, 2020:\nEricsson stock growth is tied to 5G expansion.\n\nFEB 9, 2021: \nQualcomm includes Globalstar's Band n53 in its new 5G X65 modem. The X65 is Qualcomm's flagship 5G modem and adds global 5G band support for n53.\n\nFEB 17, 2021:\nGLOBALSTAR ANNOUNCES STRATEGIC ALLIANCE WITH XCOM LABS.",
        "created_utc": 1614746978,
        "id": "gpi2hsu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614775778.0
    },
    {
        "author": "maddogenglish",
        "body": "Finally a warm day in Colorado so I'm going golfing tomorrow. I would appreciate it if PLTR, SNDL, QCOM, FCEL, QQQ and CAM bring in some ![img](emote|wsb_emojis|tendies) while I am away. Please make that happen.",
        "created_utc": 1614737247,
        "id": "gphkh88",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614766047.0
    },
    {
        "author": "Psychological_Dot541",
        "body": "5G is a fiercely competitive market. The United States will beat Huawei to establish the global standards and commercial market for security reasons - ergo the most prominent U.S. company is in Globalstar given that it already has trusted partners in both Qualcomm (and Ericsson by association) - both of which bring integrated services to 190+ countries.",
        "created_utc": 1614748269,
        "id": "gpi4hvy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614777069.0
    },
    {
        "author": "Flam3Shot_",
        "body": "With all due respect, I do not agree with your statement about there being direct competitors for most companies between the NASDAQ and NYSE. Strong, long lasting companies like Apple, Microsoft, Nvidia, Qualcomm, etc. hardly have any competition whatsoever in reference to the companies listed in the NYSE (unless you count stagnant/dying firms like Oracle or Nokia, but that’s really stretching it). Only thing I can really think of is Facebook v Twitter and some e-commerce stuff like Alibaba v Amazon. Either way, the examples are seldom. \n\nThat said, I appreciate your advice immensely. Thank you :)",
        "created_utc": 1614747255,
        "id": "gpi2xv4",
        "score": 1,
        "subreddit": "investing",
        "created": 1614776055.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  3rd of March\n\n\n\n## Upcoming events for Wednesday, March  3rd\n\n - Stock splits:\n\n    - CLWT @ **3:2** (Payable date: 03/02/2021)\n\n - Expected earnings:\n\n  ACU, AEGN, AEO, AMPE, APT, ASM, ATTO, BBSI, BDR, BF.A, BF.B, BKCC, BKTI, BLCT, BMA, BQ, BXC, CECE, CETX, CFMS, CIX, CLMT, CMTL, CNR, CORR, CTRM, CULP, CZZ, DAKT, DLTR, DPW, DSGX, DY, ENIC, EQX, EVGN, EYE, EYEG, FLMN, FTHM, GHLD, GIFI, GMRE, GPRK, GRP.U, HBB, HDSN, HGEN, HPR, HRTG, IMTX, ISEE, ITRN, JILL, KERN, KIDS, KRON, LINC, MDRR, MESO, MLR, MRVL, MTLS, MYRG, NAV, NC, NEWT, NFH, NM, NMCI, NWPX, OGEN, OKTA, OM, ONCR, OPTN, OSW, OXSQ, PASG, PCOM, PDCO, PNRG, PW, RAIL, RCMT, RDHL, RMNI, RNET, RPTX, RRGB, SBBP, SBOW, SD, SID, SINA, SLNO, SMHI, SNOW, SPKE, SPLK, SPRB, SQM, STKL, SUPV, TAC, TAST, TCOM, TPCO, TPVG, TSHA, UFPT, USDP, VNET, VRM, VRTV, WB, WEN, WHLR, WMC, WPG, WTI, YEXT\n\n - Ex-div:\n\n  ALL, AWI, EQH, ES, ESBK, FANG, FWRD, GLOG, LEA, LZB, MBCN, MOS, NLSN, PTEN, QCOM, RMBI, SSTK, VNOM\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 177K, previous: 174K)\n    - Beige Book\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: 0.249M)\n    - Crude Oil Inventories (consensus: -0.928M, previous: 1.285M)\n    - Cushing Crude Oil Inventories (previous: 2.807M)\n    - Distillate Fuel Production (previous: -0.953M)\n    - EIA Refinery Crude Runs  (previous: -2.589M)\n    - EIA Weekly Distillates Stocks (consensus: -3.035M, previous: -4.969M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 4.6%, previous: -14.5%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Kaplan Speaks\n    - Gasoline Inventories (consensus: -2.300M, previous: 0.012M)\n    - Gasoline Production (previous: -1.295M)\n    - Heating Oil Stockpiles (previous: 0.093M)\n    - ISM Non-Manufacturing Business Activity (consensus: 60.0, previous: 59.9)\n    - ISM Non-Manufacturing Employment (previous: 55.2)\n    - ISM Non-Manufacturing New Orders (previous: 61.8)\n    - ISM Non-Manufacturing PMI (consensus: 58.7, previous: 58.7)\n    - ISM Non-Manufacturing Prices (previous: 64.2)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -11.4%)\n    - MBA Purchase Index (previous: 264.9)\n    - Markit Composite PMI (consensus: 58.8, previous: 58.7)\n    - Mortgage Market Index (previous: 790.6)\n    - Mortgage Refinance Index (previous: 3,848.1)\n    - OPEC Meeting\n    - Services PMI (consensus: 58.9, previous: 58.3)\n\n## Upcoming events for Thursday, March  4th\n\n - Stock splits:\n\n    - MYBF @ **105:100** (Payable date: 03/15/2021)\n    - TR @ **103:100** (Payable date: 04/02/2021)\n    - TROLB @ **103:100** (Payable date: 03/26/2021)\n\n - Expected earnings:\n\n  ABUS, ACOR, ADCT, AE, AFIB, AGS, AHCO, AIV, AJX, AKUS, ALXO, AMC, AMTI, ANIK, AQN, ARGX, ASPS, AT, ATC, ATEC, ATHA, AUTL, AVGO, AVGR, BALY, BCOW, BJ, BPMP, BSGM, BURL, BYFC, BZUN, CBIO, CBMB, CCCC, CDAK, CELP, CERT, CHMA, CHMI, CHUY, CIB, CIEN, CIR, CLLS, CLPT, CLXT, CNQ, COHN, COO, COST, CRAI, CRD.A, CRD.B, CRVS, CTSO, CVV, CZNC, DBVT, DMTK, DNN, DRRX, DSSI, DXYN, DYN, EGLE, ELOX, ENZ, ESGC, ETON, EVC, EVFM, EVLO, EYPT, FBRX, FCRD, FIZZ, FLGT, FMTX, FOUR, FPRX, FRGI, FTSI, FULC, GAU, GBLI, GCP, GDYN, GMS, GOL, GPL, GPMT, GPS, GRAY, GSAT, GSL, GWRE, GWRS, HCM, HEAR, HOLI, HRMY, IDT, IMAX, IMMR, INMB, INVE, INZY, ISDR, ISIG, ITOS, JAMF, JG, JW.A, JW.B, JYNT, KBNT, KDMN, KR, KYMR, LRMR, LTRN, MANU, MAXN, MAYS, MCS, MDLA, MEG, MEI, MIK, MLVF, MMX, MOSY, MTCR, MWK, MYSZ, NCMI, NEW, NKSH, NKTX, NNA, NRP, NTCO, NTST, NVIV, NX, OBLN, OBSV, ODC, OPEN, OPNT, ORIC, ORTX, PACK, PBLA, PCVX, PHI, PLYA, PQG, PRPL, PSTX, PVAC, QTT, QUMU, RFL, RLH, RVMD, SALM, SCM, SCOR, SCPE, SDC, SDGR, SENS, SFE, SHG, SHIP, SIGA, SMLP, SMSI, SOHO, SOLY, SPPI, SQFT, SRG, SRLP, STLA, STON, SWBI, SYN, SYRS, TARA, THRY, TLS, TMBR, TOMZ, TRIN, TTC, TTOO, TWI, VBIV, VERI, VLGEA, VNRX, VRAY, VSEC, VTRS, VYNE, WPP, WRAP, WVE, XFOR, YPF\n\n - Ex-div:\n\n  AFB, AGR, AJG, AMNB, BAC, BBL, BLK, BOTJ, BRKR, BRKS, CASS, CHRW, D, DAN, DEA, DRD, EPC, FLIR, FLO, FNB, FRME, GBDC, GPC, HSII, ICBK, KMB, KNX, LIN, MBWM, NAVI, NCB, NUW, NVS, OC, PCH, PEP, PTVCA, PTVCB, RF, RIO, SAFT, SCL, SEE, SLM, TEX, TFX, TGNA, TR, TRST, TT, UFCS, WEN, WING, WY\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.035%)\n    - 8-Week Bill Auction (previous: 0.040%)\n    - Challenger Job Cuts (previous: 79.552K)\n    - Continuing Jobless Claims (consensus: 4,300K, previous: 4,419K)\n    - Durables Excluding Defense (previous: 2.3%)\n    - Factory Orders (consensus: 2.1%, previous: 1.1%)\n    - Factory orders ex transportation (previous: 1.4%)\n    - Initial Jobless Claims (consensus: 750K, previous: 730K)\n    - Jobless Claims 4-Week Avg. (previous: 807.75K)\n    - Natural Gas Storage (consensus: -333B, previous: -338B)\n    - Nonfarm Productivity (consensus: -4.7%, previous: -4.8%)\n    - OPEC Meeting\n    - Unit Labor Costs (consensus: 6.6%, previous: 6.8%)\n\n## Upcoming events for Friday, March  5th\n\n - Stock splits:\n\n    - APH @ **2:1** (Payable date: 03/04/2021)\n\n - Expected earnings:\n\n  AAMC, AIM, ALUS, ANAT, ARDX, ATLC, ATLO, AYRO, BH.A, BHAT, BIG, BORR, BPTH, BRID, CCNC, CEI, CHEK, CLPS, CMPI, COE, COMS, CRH, DS, DXPE, EML, EXN, FENC, FGBI, FHTX, FSEA, FSTX, GGAL, GLP, GSX, HIBB, HMG, HURC, HUSA, IMRA, INBX, INTT, IPDN, ITCB, KB, KMPH, KVHI, MIST, NBAC, NWLI, OFS, OLB, ONCY, PCSA, PDLB, PLPC, PMVP, PNBK, PPSI, PRPO, PSO, PTMN, RUTH, SAMG, SPLP, STRR, STTK, SUP, TGS, UBOH, VET, VSTA\n\n - Ex-div:\n\n  ANAT, BF.A, BF.B, CCBG, CDK, CNS, EVRG, EXC, FAF, FDX, GE, HBB, HL, HTGC, HWC, JBT, JKHY, JOE, KSU, LUMN, LYB, NC, OAS, OMP, PATK, PBIP, RTLR, STRA, SVBI, SYX, TPL, TROX, UGP, VALE\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 5.3%, previous: 5.4%)\n    - Average Hourly Earnings (consensus: 0.2%, previous: 0.2%)\n    - Average Weekly Hours (consensus: 34.9, previous: 35.0)\n    - CFTC Aluminium speculative net positions (previous: 4.7K)\n    - CFTC Copper speculative net positions (previous: 75.4K)\n    - CFTC Corn speculative net positions (previous: 529.8K)\n    - CFTC Crude Oil speculative net positions (previous: 511.8K)\n    - CFTC Gold speculative net positions (previous: 215.7K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.4K)\n    - CFTC Natural Gas speculative net positions (previous: 28.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -31.3K)\n    - CFTC Silver speculative net positions (previous: 47.6K)\n    - CFTC Soybeans speculative net positions (previous: 239.8K)\n    - CFTC Wheat speculative net positions (previous: 27.4K)\n    - Consumer Credit (consensus: 12.00B, previous: 9.73B)\n    - Exports (previous: 184.20B)\n    - Government Payrolls (previous: 43.0K)\n    - Imports (previous: 252.30B)\n    - Manufacturing Payrolls (consensus: 12K, previous: -10K)\n    - Nonfarm Payrolls (consensus: 180K, previous: 49K)\n    - Participation Rate (previous: 61.4%)\n    - Private Nonfarm Payrolls (consensus: 194K, previous: 6K)\n    - Trade Balance (consensus: -67.50B, previous: -66.60B)\n    - U.S. Baker Hughes Oil Rig Count (previous: 305)\n    - U.S. Baker Hughes Total Rig Count (previous: 397)\n    - U6 Unemployment Rate (previous: 11.1%)\n    - US Federal Budget (previous: -430.0B)\n    - Unemployment Rate (consensus: 6.3%, previous: 6.3%)\n\n^^^^2021-03-03",
        "created_utc": 1614769221,
        "id": "gpisq8x",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1614798021.0
    }
]