[
    {
        "author": "vrijheidsfrietje",
        "body": "The solution would be for Jack Ma to adopt the kid and rename him Mini-Ma.",
        "created_utc": 1620475226,
        "id": "gxdnyky",
        "score": 878,
        "subreddit": "wallstreetbets",
        "created": 1620504026.0
    },
    {
        "author": "heycals",
        "body": "How does that kid look older than Ma?",
        "created_utc": 1620444058,
        "id": "gxcn43c",
        "score": 399,
        "subreddit": "wallstreetbets",
        "created": 1620472858.0
    },
    {
        "author": "vrijheidsfrietje",
        "body": "A rich person with a bizarre and memey sense of humor like Elon Musk might in this case. I don't see Jack Ma doing that. We're in the wrong timeline :')",
        "created_utc": 1620478192,
        "id": "gxds6sn",
        "score": 177,
        "subreddit": "wallstreetbets",
        "created": 1620506992.0
    },
    {
        "author": "Ohmstheory",
        "body": "Kid is like....\n\nHE JACK MA FACE",
        "created_utc": 1620456915,
        "id": "gxd4g4j",
        "score": 150,
        "subreddit": "wallstreetbets",
        "created": 1620485715.0
    },
    {
        "author": "harsh876",
        "body": "He was taken from his parents when young because of how similar he look and was taken on different gigs and publicity events, now that he’s older he’s been essentially abandoned\n\nArticle:\n\nhttps://www.whatsonweibo.com/six-years-after-becoming-a-viral-hit-little-jack-ma-is-not-doing-well-at-all/",
        "created_utc": 1620473518,
        "id": "gxdlsjt",
        "score": 149,
        "subreddit": "wallstreetbets",
        "created": 1620502318.0
    },
    {
        "author": "Janto_2021",
        "body": "#look ma, it's Frodo Baggins",
        "created_utc": 1620421700,
        "id": "gxbh9il",
        "score": 145,
        "subreddit": "wallstreetbets",
        "created": 1620450500.0
    },
    {
        "author": "idma",
        "body": "I honestly never bothered to check out PLTR because I knew there was way too much volatility, I just took a look, holy crap, talk about whiplash. \n\nIt didn't even establish a MA until after it spiked up then spiked down",
        "created_utc": 1620342394,
        "id": "gx7kz2h",
        "score": 140,
        "subreddit": "wallstreetbets",
        "created": 1620371194.0
    },
    {
        "author": "Kaita316",
        "body": "Are we sure that Jack Ma didn’t reincarnate?",
        "created_utc": 1620453676,
        "id": "gxd0pgh",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1620482476.0
    },
    {
        "author": "invader2",
        "body": "Very cheap company. Would easily trade for double without the risks. \n\nI’ve been wanting to start a position but I can’t bring myself to buy it. Risk of accounting fraud. The fact that VIEs are illegal in China and there’s no guarantee share holders have any rights. Also the fact that jack ma stole alipay from alibaba shareholders 10 years ago.",
        "created_utc": 1620220046,
        "id": "gx0sran",
        "score": 40,
        "subreddit": "ValueInvesting",
        "created": 1620248846.0
    },
    {
        "author": "CrashTestDumb13",
        "body": "Um. My whole portfolio. I buy and hold everything for the long term. Unless if something fundamentally changes with any of my companies I have no plans to sell. But my biggest holdings are AMZN, NVDA, MA, and V.",
        "created_utc": 1620444267,
        "id": "gxcngiu",
        "score": 33,
        "subreddit": "stocks",
        "created": 1620473067.0
    },
    {
        "author": "donrane",
        "body": "Yea, not sure Jack Ma is in an environment that´s suitable for children.",
        "created_utc": 1620481377,
        "id": "gxdxcnm",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1620510177.0
    },
    {
        "author": "squarerabbits",
        "body": "You're right that's fucked up\n\nhttps://www.vice.com/en/article/5dpe7n/jack-ma-doppelganger-quits-livestreaming",
        "created_utc": 1620453422,
        "id": "gxd0el8",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1620482222.0
    },
    {
        "author": "Neuchacho",
        "body": "He looks like Jack Ma.",
        "created_utc": 1620472502,
        "id": "gxdkkil",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1620501302.0
    },
    {
        "author": "Milkingcowcat_Morphy",
        "body": "https://www.ellemen.com/spotlight/a35606550/xiao-ma-yun/\nI knew the story when I was in China , because he was a “super star” back to that time. There are many reports cover this story, one important reason that he got abandoned is that, since last year, there has been such a “correct bad values on internet” action in China. There are also more examples except him, for instance, the “eating broadcasts” were extremely popular before, now is forbidden to show up on the internet in China. \nbtw, source is in Chinese..",
        "created_utc": 1620462868,
        "id": "gxdalz2",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1620491668.0
    },
    {
        "author": "GeezWhizGuys",
        "body": "Jack MA's mother is Ma Ma.",
        "created_utc": 1619912845,
        "id": "gwlp26x",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619941645.0
    },
    {
        "author": "freeBobbyDAYVID",
        "body": "mini ma",
        "created_utc": 1620445650,
        "id": "gxcpnsg",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1620474450.0
    },
    {
        "author": "icvy",
        "body": "but that kid is a real sad. Chinese media hype him up due to his resemblance to Jack Ma, then some company signs him as a \"celebrity\", after milking him for months/years, they throw him aside.",
        "created_utc": 1620455029,
        "id": "gxd2b2t",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1620483829.0
    },
    {
        "author": "cambeiu",
        "body": "Just remember: [996](https://www.marketwatch.com/story/alibabas-jack-ma-calls-the-996-chinas-72-hour-work-week-a-huge-blessing-2019-04-15)",
        "created_utc": 1620005706,
        "id": "gwqf2e8",
        "score": 10,
        "subreddit": "StockMarket",
        "created": 1620034506.0
    },
    {
        "author": "erasuli",
        "body": "Yeah it’s better to buy shares than to buy options. It’s difficult to time the market. I was holding sndl options and the expired like a week before the stock blew up.\n\nAli baba is extremely undervalued. It’s a gift at this price. But no one can really predict when it will take off. It took off once people found out that jack ma was ok and then again when the communist government hit Ali baba with a fine.\n\nIt will go up, hopefully soon. But it might require some patience.",
        "created_utc": 1620351026,
        "id": "gx81x6g",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1620379826.0
    },
    {
        "author": "Cloverfied",
        "body": "He talked about any or all \"revolutions\", noting Ford's industrial revolution in turning factories into production engines, have many car companies start and fail within a short time period.  He displayed a list of car companies throughout the early 1900's and noted that he wanted to show all the car companies that started up making cars with their name that started with the letter \"M\" but then found that there were so many within the letter \"M\" that he decided to take just the car companies that started with just \"Ma\" and had a large populated list of companies that started and failed in the automobile manufacturing business.\n\nHis opposition doesn't come from a new market being created, his opposition is in choosing who the winners of that market are going to be.  The ones that will return profits to investors over a period of time - hopefully enough time to return the investor's capital and then some.\n\nBuffet doesn't \"not understand\" speculation.  He understands it just fine, his thesis is to invest in good companies that offer returns to shareholders based on the capital they have at risk.  He believes that in a world of thousands upon thousands of companies there is no need to take undue risks and that over a long period of time, making investments in quality companies with good management will return more profits than making a gamble on companies with a large amount of potential outcomes.  He believes his ability, or anyone's for that matter, to \"pick\" a winner based off so many unknown variables is completely at question and warns anyone to steer clear of said behavior.",
        "created_utc": 1619905002,
        "id": "gwl8vyx",
        "score": 10,
        "subreddit": "CanadianInvestor",
        "created": 1619933802.0
    },
    {
        "author": "NeoMatrixBug",
        "body": "Ma man, Diamond 💎hands to making world better and fairer to oppressed.",
        "created_utc": 1620307155,
        "id": "gx5arev",
        "score": 10,
        "subreddit": "Wallstreetbetsnew",
        "created": 1620335955.0
    },
    {
        "author": "Parking-Aside-6166",
        "body": "Ma tilray gang how are you holding up? 🚀🚀🚀",
        "created_utc": 1620396724,
        "id": "gx9x8kd",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1620425524.0
    },
    {
        "author": "Parking-Aside-6166",
        "body": "Ma tilray gang, dont you start selling now, we’re in it for the big win \n13—-&gt;16—&gt;20—&gt;30 ——&gt;60$ 🚀🚀🚀",
        "created_utc": 1620399755,
        "id": "gxa45l2",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1620428555.0
    },
    {
        "author": "NachzehrerL",
        "body": "YSK that people have done terrible things to that child just because he looks like Jack Ma, by terrible I mean injecting the boy with slow-growth hormone type of terrible. \n\nhttps://www.whatsonweibo.com/six-years-after-becoming-a-viral-hit-little-jack-ma-is-not-doing-well-at-all/",
        "created_utc": 1620454906,
        "id": "gxd25w9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620483706.0
    },
    {
        "author": "judi_hench",
        "body": "Huh? That's not really a reply to what I've said. You did the same with the guy above who articulates my point much better.\n\nI think clover will go up in the mid/long term with the MA age and expansion plan, but it's got a long hangover effect of spacmania and the seek insurance thing is a valid concern. I also think that since gme everything has become a \"omg short interest\" fiasco with people buying stocks expecting a repeat. It ain't going to happen every again, risk adjustment across the board already occurred (look at the jump in clov to 17).\n\n\n\nSo in summary, it is about making bets, but not about parroting useless shite like you have done. Buy shares if you think it'll go up, average down it it tanks post earnings. Don't expect a squeeze, gamma slides occur but less frequently than people would have you believe",
        "created_utc": 1620462609,
        "id": "gxdacsf",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620491409.0
    },
    {
        "author": "EP40BestInDaLee",
        "body": "When the pimps in the crib ma pop it in my ass, pop it in my ass",
        "created_utc": 1620018961,
        "id": "gwr0as9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620047761.0
    },
    {
        "author": "Crisn232",
        "body": "wellll HELLLOO Mr. Powells! I am dr. Ma and this... this is mini-Ma!",
        "created_utc": 1620482389,
        "id": "gxdz5ms",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620511189.0
    },
    {
        "author": "dennis8542",
        "body": "Lmao I say that yesterday too... I ma go cry to 💤😂",
        "created_utc": 1620116204,
        "id": "gwvtwk0",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620145004.0
    },
    {
        "author": "M-Catalyst",
        "body": "I have a bullish outlook on both as well even if I am not currently long on either atm. SQ looks to have a double bottom on the daily chart and the 50 MA has held up these past few weeks which makes me think a minor beat on earnings would at the very least not drop below $240 in the very near short term. You never know obviously but the risk imo isn't substantial if one wanted to swing trade a call even holding through earnings for unexpected results. For holding stock I don't see it worth it atm as I see an entry at around 225 to be feasible as it tends to fall thru it's 50 MA for a few days before pivoting back up. The chart basically fuckin looks like the NASDAQ. W shaped recovery lol. Think it won't get that close to it's recent low of $202. Sorry for the wall of text, even if I'm not in these plays I just seem to enjoy theory crafting lol",
        "created_utc": 1619881691,
        "id": "gwjq7ar",
        "score": 6,
        "subreddit": "options",
        "created": 1619910491.0
    },
    {
        "author": "SojoX",
        "body": "the risk and benefit of chinese stocks is its government. It's a government with absolute authority and highly centralized. Jack Ma and Ant Finance  just examples of the government show corporations who's the ruling class. Well, the government can help companies go to the moon too with its almost unlimited resources",
        "created_utc": 1620106599,
        "id": "gwvitp0",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620135399.0
    },
    {
        "author": "t33po",
        "body": "Never forget Jack Ma. Still dissapeared. If the Bezos of China can be erased, anyone can be. Happy Chinese stock speculation! NIO plays by the rules tho👀👀👀",
        "created_utc": 1620105980,
        "id": "gwvi066",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620134780.0
    },
    {
        "author": "nightastheold",
        "body": "Bought BABA weeklies at close. I think Jack Ma is going to be spotted riding a jet ski",
        "created_utc": 1620072595,
        "id": "gwtnyb1",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620101395.0
    },
    {
        "author": "chainerection",
        "body": "\"In The Air Tonight\" is ma favourite song of his.",
        "created_utc": 1620125457,
        "id": "gww4gr4",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620154257.0
    },
    {
        "author": "powerbutts",
        "body": "Jack Ma in a little trouble himself.",
        "created_utc": 1620481008,
        "id": "gxdwppy",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620509808.0
    },
    {
        "author": "gettendies",
        "body": "They lobotomized Jack Ma amd he was one of their own!",
        "created_utc": 1620182330,
        "id": "gwzch16",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620211130.0
    },
    {
        "author": "ThePelvicWoo",
        "body": "NASDAQ found support on the rising 100 day MA in March, yesterday it tested the 50 day and bounced. It's still stuck in a range and has been for a couple months now .\n\nSuch a boring market to trade in",
        "created_utc": 1620229306,
        "id": "gx1deis",
        "score": 4,
        "subreddit": "stocks",
        "created": 1620258106.0
    },
    {
        "author": "Inferdo12",
        "body": "Didn't jack ma retire?",
        "created_utc": 1620010537,
        "id": "gwqnp4b",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1620039337.0
    },
    {
        "author": "therealoptionisyou",
        "body": "I have been using 100 and 200 moving average crossing to filter stocks that might be recovering after dipping. The downside of this approach is that if the crossing doesn't happen today (I think) it won't show in the results. Also there are noises like stable stocks that fluctuate around the MA. I'm using TradingView.\n\nPlease let me know if anyone has a better approach!",
        "created_utc": 1619875288,
        "id": "gwjdapy",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1619904088.0
    },
    {
        "author": "eyeball29",
        "body": "I was going to mention cryptocurrencies as a whole, as they are popping up as usable currencies all over the place. You can buy computer parts on Newegg, local shops are taking it up, credit card companies are delving into it so you can pay \"wherever Visa and Mastercard are accepted\". I think this takes a lot of steam out of the fallback onto gold theory.",
        "created_utc": 1619996331,
        "id": "gwpxwbm",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620025131.0
    },
    {
        "author": "paper_bull",
        "body": "Fuck jack ma is one ugly mofo.",
        "created_utc": 1620453727,
        "id": "gxd0rlm",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620482527.0
    },
    {
        "author": "kingsword",
        "body": "Am I retraded to drop 30% on SPY $450, Mar 2022? Dropping another 20% on $MA and $CLNE too. Hold my hands papa jpow",
        "created_utc": 1620012062,
        "id": "gwqq9xs",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620040862.0
    },
    {
        "author": "midtnrn",
        "body": "SPY was over extended off 50 day MA. I'm guessing we correct back down to 400-405 range over the next week.",
        "created_utc": 1620141949,
        "id": "gwx0oyp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620170749.0
    },
    {
        "author": "ShiddyInvestor",
        "body": "7 ma dude",
        "created_utc": 1620446761,
        "id": "gxcre1q",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620475561.0
    },
    {
        "author": "Koop-a-loop",
        "body": "IMO, wait until it reclaims the 200 MA or finds some sort of support",
        "created_utc": 1620329035,
        "id": "gx6pu74",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620357835.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "It’s all growth. If you like growth you gotta buy some value/hybrids right now like MasterCard or Visa. Even Facebook or GOOGL could fall in that category. The market will treat the financials better though, for now at least. Travel spend increase will push them up another 15-25% this year alone.",
        "created_utc": 1620336395,
        "id": "gx77sgq",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620365195.0
    },
    {
        "author": "ZhangtheGreat",
        "body": "The following stocks in my portfolio need to get their heads out of their asses and start gaining again: TSLA, MA, MSFT, DIS, MRNA, INTC, EBAY. Please call me when you’re showing some positive momentum for once ![gif](emote|free_emotes_pack|disapproval)",
        "created_utc": 1620318509,
        "id": "gx60j92",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620347309.0
    },
    {
        "author": "tell442",
        "body": "Anyone else ever have TD sell the wrong tax lot? I submitted LIFO and it sold FIFO.\n\nJust got off the phone with them they claim they would correct it.\n\nI had SHAK shares from last June it sold instead of ones i wanted to sell i bought in March when it broke the 100 day ma",
        "created_utc": 1620396005,
        "id": "gx9vo0l",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620424805.0
    },
    {
        "author": "invader2",
        "body": "What about when jack ma stole alipay from alibaba shareholders? \n\nOr the risk of accounting fraud.\n\nI agree that on paper it looks super cheap. I can’t bring myself to buy it tho.",
        "created_utc": 1620219442,
        "id": "gx0rmdo",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1620248242.0
    },
    {
        "author": "QuietStormMk",
        "body": "Go collect your stimmy peasant, ma last posts are for you and your wife and her mother",
        "created_utc": 1620285564,
        "id": "gx4ir9v",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620314364.0
    },
    {
        "author": "b4ttlepoops",
        "body": "GME may not have had a good day... but look at the year to date returns/ 1 yr return! It’s on sale guys! \n\nSymbol:\tGME\nName:\tGameStop Corp.\nLast Trade:\t160.73\nChange:\t-1.47\nChange %:\t-0.91%\nPrev Close:\t162.20\nOpen:\t159.00\nHigh:\t161.49\nLow:\t151.80\nVol:\t3.97M\nAvg Vol:\t24.98M\n1yr Target:\t41.79\n50-day MA:\t154.31\n200-day MA:\t61.96\nEPS:\t-3.31\nMkt Cap:\t11.38B\nYtd Return:\t753.13%\n1yr Return:\t2833.03%\nShort Rate:\t0.65%\nBeta:\t-1.82\nInst. Own:\t1.09%\nDiv &amp; Yield:\t1.52 (43.80%)\n Created by StockMaster https://itunes.apple.com/us/app/id591644846 https://www.stockideal.com/app/index.html",
        "created_utc": 1620174111,
        "id": "gwyvexi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620202911.0
    },
    {
        "author": "OutOf12One",
        "body": "I agree in that threat but I think with TAM of $50B plenty of room. This will likely be a threat down the line but not anytime soon. Also not sure if you caught that former CEO of MasterCard is on the Board so plenty of connections and likely sticks if affirm decides to enter their space.",
        "created_utc": 1620108417,
        "id": "gwvl4vp",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1620137217.0
    },
    {
        "author": "StockNewbs",
        "body": "Jack ma",
        "created_utc": 1620075934,
        "id": "gwtvkif",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620104734.0
    },
    {
        "author": "RobotArtichoke",
        "body": "500 mA \n\nHope you don’t need your phone for a while",
        "created_utc": 1619978679,
        "id": "gwowfbi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620007479.0
    },
    {
        "author": "AstronautCurrent408",
        "body": "ma man",
        "created_utc": 1620387905,
        "id": "gx9gqic",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620416705.0
    },
    {
        "author": "RidexThexWave",
        "body": "ARKK 5/21 100p. Closing the week below the bottom channel trendline and seems to have bounced off the 200-MA which should equal some short term pain. May be a little early but I won't be late!",
        "created_utc": 1620413771,
        "id": "gxb0g8o",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620442571.0
    },
    {
        "author": "FappyDuPlenty",
        "body": "Hey everyone, I have the same story you probably see on a daily basis...Got into investing with the retail craze that hit at the beginning of 2021.  Started off with the growth stocks, had some highs had some lows but I've settled into a more sustainable and hopefully less stressful portfolio and I would love if I could get some feedback.  See below for my tickers:\n\nMost of these are going to be long term positions but I'm planning on swing trading AMD, INTC, NVDA, Z\n\n* AAPL (9.77%)\n* AGNC (4.89%)\n* ALLY (2.05%)\n* AMAT (5.86%)\n* AMD (9.15%) \n* AMZN (8.75%)\n* FB (1.38%)\n* GOOG (12.37%)\n* HD (2.08%)\n* HRZN (4.4%)\n* INTC (2.94%)\n* LOW (1.67%)\n* MA (4.82%)\n* MSFT (7.72%)\n* NVDA (2.32%)\n* O (2.59%)\n* OMF (2.16%)\n* PSEC (6.25%)\n* QYLD (1.73%)\n* SHW (2.31%)\n* V (3.26%)\n* Z (1.53%)\n\nThanks for taking a look! Do I have too many tickers, should I sell some of those and move that money into something like VTI, QQQ, etc?",
        "created_utc": 1620406057,
        "id": "gxaizo3",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620434857.0
    },
    {
        "author": "UnderstandingNew7083",
        "body": "This is allowed on WSB?? Wtf is going on? I’ve seen 2 pro GME posts in my feed this morning. \nEND GAME. TURN UP THE MA FUKN VOLUME",
        "created_utc": 1620299874,
        "id": "gx4yjlp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620328674.0
    },
    {
        "author": "TopBuyer777",
        "body": "In 418 call ma that expire today . I should get a double easily",
        "created_utc": 1620229132,
        "id": "gx1cyxv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620257932.0
    },
    {
        "author": "chasingthecontrails",
        "body": "I used to travel tons for work so it was worth it for me. They also have the best service compared to my visa or mastercard(s)",
        "created_utc": 1620243377,
        "id": "gx2baoh",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1620272177.0
    },
    {
        "author": "Captain-Whoopass",
        "body": "Max pain for rate hike is 200 day MA so 360 as of today",
        "created_utc": 1620180082,
        "id": "gwz7yqg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620208882.0
    },
    {
        "author": "dehmos",
        "body": "Ma boy. Am so proud of you",
        "created_utc": 1619878504,
        "id": "gwjj4re",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619907304.0
    },
    {
        "author": "spyaintnobitch",
        "body": "I have no idea why there isn't a legit market-based real world casino. Or is there? I want to bet on SPY 0 dates with titties in ma face",
        "created_utc": 1620094937,
        "id": "gwuzkwg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620123737.0
    },
    {
        "author": "bofasaurus",
        "body": "Jack ma missing was the best thing to happen to the discussion thread",
        "created_utc": 1620096764,
        "id": "gwv33ye",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620125564.0
    },
    {
        "author": "MadCritic",
        "body": "UNH! Its chart simply gives me peace. \n\nBRK-B. Can't go wrong with it, diversified within itself.\n\nDIS. Your childhood, your dad's childhood, your future kid's childhood. Also Pixar, Marvel, and Star Wars. Got theme parks + streaming service.\n\nO. Real estate stock that pays monthly dividend. Good for having cash on hand.\n\nMasterCard and Visa!",
        "created_utc": 1620074041,
        "id": "gwtr8jv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620102841.0
    },
    {
        "author": "EdwardDiGi",
        "body": "Well I think biden administration has to deal with China, until now nothing has changed but the issues on the table are numerous:\n\n\\- Meng Wanzhou release from Vancouver should start the appeasement process\n\n\\- Lift of Iran sanctions, to benefit oil and investments between China and Iran\n\nIf US succeeds in that Chinese may start to open themselves more to Western investors, and confidence will start to come back\n\nJack Ma was becoming too powerful, and was a threat for political stability in the country. With new rules getting in place and time to understand them, plus trade tensions going away little by little, I guess China can be a good place to be in the stock market",
        "created_utc": 1620047317,
        "id": "gws1h25",
        "score": 2,
        "subreddit": "investing",
        "created": 1620076117.0
    },
    {
        "author": "death_by_paper_cut",
        "body": "Yeah tell that to Jack Ma",
        "created_utc": 1620165380,
        "id": "gwycssq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620194180.0
    },
    {
        "author": "Donkeycow15",
        "body": "Hoes pay ma bills",
        "created_utc": 1619988262,
        "id": "gwphway",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620017062.0
    },
    {
        "author": "tacofury-inc",
        "body": "Look MA! We got a gatekeeper!",
        "created_utc": 1619988493,
        "id": "gwpicst",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620017293.0
    },
    {
        "author": "Rattlessnakes",
        "body": "If you ain’t from ma hood",
        "created_utc": 1620474167,
        "id": "gxdmkzv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620502967.0
    },
    {
        "author": "StarShip2SpaceCake",
        "body": "Saw u/JoeyFoster222's meme and this nonsense was birthed like a jar to spawn\n\n\nHave a fantastic weekend you funky motherfuckers\n\n\nAnd remember to call ma dukes on Sunday, she'd love to hear from ya! 🍄⚡✌️",
        "created_utc": 1620447122,
        "id": "gxcrxz9",
        "score": 2,
        "subreddit": "shroomstocks",
        "created": 1620475922.0
    },
    {
        "author": "cplange1",
        "body": "&gt;NASDAQ found support on the rising 100 day MA in March, yesterday it tested the 50 day and bounced. It's still stuck in a range and has been for a couple months now .\n\nThe reason I'm not using the 50 is that it hasn't generally respected the 50.  The lows tend to respect the 100-day during dips which tends to correspond closely with the trend line I drew.\n\nI don't think we're looking at a major meltdown--there's nothing so catastrophic we'd hit correction that I know of, but I think there may be a modest pull back to consolidate after earnings as well as take profits (there could also be some rebalancing as well)",
        "created_utc": 1620229869,
        "id": "gx1eswr",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620258669.0
    },
    {
        "author": "arbiter12",
        "body": "Ma dude got lucky and thinks he's a genius.\n\nI'd like to say it happens to the best of us but really, it happens only to the worst.",
        "created_utc": 1620397850,
        "id": "gx9zrb1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620426650.0
    },
    {
        "author": "somekindofgiuse",
        "body": "Grandissimo! Io che potevo permettermi solo 36 azioni mi sento povero... Ma non per molto",
        "created_utc": 1620401334,
        "id": "gxa7twx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620430134.0
    },
    {
        "author": "tockstocks",
        "body": "No worries. I'm actually home sick right now (not Covid, just sinus infection) so I don't have much else to do, anyway. :)\n\n1. They sent our practice a cold call email with the features and it seemed cool looking, so I tried it out. I tend to try lots of demos mostly just to see what is out there, but I never really have plans to make a full switch because we like ECW. It was more curiosity than a desire to switch, really. If it had been a platform that could have integrated directly into our EMR, that would have been better. \n2. We pay a quarterly licensing free for ECW and had/have some setup costs with new features. Overall, the expense is roughly $15k + $5k per provider, per year. I think the biggest hurdle is that it isn't using practice data, but insurance claim data. In theory, that should be the same, but it is definitely not in practice. We are also rather unique in that we don't participate with Medicare, so we have very few MA patients and wouldn't be able to use this for 95% of our patients. That point was probably my biggest reason for not adding one extra tool, even though it is free. At some point, there is just too much data and you can't expect employees to navigate it efficiently, so we stick with basic measures and just try to do really well on them. \n3. Nobody else has offered to pay us to use a service, so that is unique. Athena has a free EMR version, but it is ad-supported so our visit notes would look like they're sponsored by a drug company, which isn't a good look! The financial incentive selling points seem to be the ability to easily qualify for Medicare Meaningful Use, but we don't participate so that benefit doesn't help us. \n4. I have had more pitches for a direct contracting service in the last two months than I've had in 14 years, so I feel like a ton of companies are trying to jump on what they are as easy money. We are a part of an ACO, but are not subject to capitation. I think FFS is going away, but not until something like Medicare for All is passed. Not sure of the timeline there, but I'd expect 2023 to be the point where smaller primary cares actually start moving towards something like that. Our ACO has put December 2022 as their \"you must promise to at least consider a capitation model\" deadline, but we are not required to switch at that point. \n\nLastly, because we don't take Medicare, I don't think we are exactly Clover's target market right now and may not be the best perspective on their sales pitch. All the commercial insurances are already doing their own similar thing, so they'll be competing with existing products from BCBS/Cigna/UHC/etc. if they ever mean to expand past Medicare.",
        "created_utc": 1620245868,
        "id": "gx2h847",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620274668.0
    },
    {
        "author": "jsfsmith",
        "body": "&gt; The leader of Alibaba is in an open conflict with his totalitarian government.\n\nDaniel Zhang has problems with the CCP? This is news to me. \n\nIf you're talking about Jack Ma, he hasn't been involved with running Alibaba for years.",
        "created_utc": 1620405040,
        "id": "gxaglcq",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620433840.0
    },
    {
        "author": "Tongaduder",
        "body": "Du ma what kind of viet does this shit?",
        "created_utc": 1620428953,
        "id": "gxbvzuu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620457753.0
    },
    {
        "author": "Freaking_Donk_2020",
        "body": "Bought BaBa right from the IPO. JACK MA might as well be richest man on earth but china ain't having it! He got kidnapped for like a month. Smh",
        "created_utc": 1620456477,
        "id": "gxd3yl4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620485277.0
    },
    {
        "author": "Investing8675309",
        "body": "I think there’s a lot of garbage in KWEB. Would rather pick and choose and roll the dice - like I think Tencent, BABA, and probably JD are good bets. Besides, with Tencent you basically get a Chinese VC firm with Pony Ma managing your money. Don’t get me wrong, I respect the approach of KWEB and index investing and it makes sense, just feel like I have enough friends in China that I have confidence in a few specific targets.",
        "created_utc": 1620224857,
        "id": "gx12w0r",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620253657.0
    },
    {
        "author": "jsfsmith",
        "body": "There's a lot of misinformation about the VIE structure that's worth clearing up here. It is true that all of Alibaba's assets are privately owned by the founders of the company. However, those founders also hold BABA / HKG:9988, because the VIE has an exclusive contract to the profits of Alibaba. If you look up their 20-F SEC filing, you can see the exact number of shares owned by Jack Ma, Joseph Tsai, etc. \n\nThere is no such thing as \"Chinese Alibaba stock.\" It does not exist. It is only listed outside of China via the VIE structure. As such, the VIE is essentially Alibaba's main / only source of capital. Also, both the NYSE listing (BABA) and the HKEX listing (9988) are for the same Cayman Islands VIE. While the VIE does absolutely introduce a degree of uncertainty, Alibaba needs their foreign shareholders just as much as the foreign shareholders need Alibaba. It is in their best interests to keep the peace and keep shenanigans to a minimum.",
        "created_utc": 1620297320,
        "id": "gx4vaz9",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620326120.0
    },
    {
        "author": "competitivebunny",
        "body": "Mod this ma— *wait*",
        "created_utc": 1620257648,
        "id": "gx37sgu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620286448.0
    },
    {
        "author": "chainerection",
        "body": "I see ma doppel ganger.\n\nYeahh,Fuck you tim go up to 150",
        "created_utc": 1620133788,
        "id": "gwwhz82",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620162588.0
    },
    {
        "author": "Homeless_Emperor_Xi",
        "body": "Jack Ma is not the CEO. Please do your research before parroting FUD.",
        "created_utc": 1620070817,
        "id": "gwtjvbi",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1620099617.0
    },
    {
        "author": "ZhangtheGreat",
        "body": "I overpurchased CP today. If the price goes back up, I’m going to unload a few shares for a quick gain. I’m also going to yell at MA for wiping out all my gains over the last month; it better not be losing ground to other credit cards!",
        "created_utc": 1620079890,
        "id": "gwu4djt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620108690.0
    },
    {
        "author": "midtnrn",
        "body": "I too have been burned by Tesla. Yesterday I was actually expecting a bounce. It was sitting around 20 and 50 day MA and knowing 700 was a prior support level all the ingredients were there for a bounce.",
        "created_utc": 1619872262,
        "id": "gwj8rmd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619901062.0
    },
    {
        "author": "Nerdicane",
        "body": "MVIS is pure pump and dump. They have no product to market. They’re hoping to get bought by someone bigger.\n\nYahoo finance has, as of april 14th, FAMI having a 2% Short interest. The share offering accounts for the dip in price. So, theoretically, the short interest went from 2% to 130% and it didn’t affect the price. \n\nNot to mention this wasn’t a company the was overvalued or failing to begin with, which is usually what draws short attention. They’re just a tiny mushroom grower in China. Why would financial institutions target that?\n\nWhich brings me to the biggest factor for me, China. Every company in China is owned by China. They just allow business owners to think they own their company. Just ask Jack Ma. Or you could if he wasn’t still missing after 3 months. IF he shows back up I’m sure he’ll be much more pro-CCP. But I’m sure when he’s replaced , the new guy will certainly be. \n\nMy philosophy is this: if there are inconsistent signals and it’s the CCP, stay the fuck away.",
        "created_utc": 1619875894,
        "id": "gwje9pj",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1619904694.0
    },
    {
        "author": "CRASH_THE_WORLD",
        "body": "Dioporco ma allora c'è ne sono di italiani ritardati e io che pensavo di essere l'unico",
        "created_utc": 1619856264,
        "id": "gwir47k",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619885064.0
    },
    {
        "author": "zeroIsAllorNothing",
        "body": "HaHa! Dangerous times, always. \nBtw, that’s the lower line on a Bollinger Band. As Volatility rises the bands widen, since they are plus minus 2Sigma from the MA. I don’t display them to prevent optical clutter. Thx.",
        "created_utc": 1620060759,
        "id": "gwsvysc",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1620089559.0
    },
    {
        "author": "HJ-InvestingYT",
        "body": "Absolutely agree with your points. I do however think the capital intensive nature of the industry can be a benefit to the company as it creates a barrier to entry for potential competitors. \n\nCurrency risk for me is the biggest concern I think, though my working assumption is in the long term these currencies should stabilise as the total economy grows. \n\nAs you mentioned, the TPG and MasterCard investments were a fantastic piece of business too. Looking forward to see where this one goes long term, the numbers look like investors will be compensated heavily for the additional risk!",
        "created_utc": 1620473841,
        "id": "gxdm6nl",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620502641.0
    },
    {
        "author": "semiprotacoeater",
        "body": "I’d never invest in baba, Jack Ma is an idiot.",
        "created_utc": 1620478205,
        "id": "gxds7h5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620507005.0
    },
    {
        "author": "ExaltedNecrosis",
        "body": "Yeah, that original statement is completely wrong. Even in the US, 40% of in-person transactions are cash. In Mexico, it's 90%. It's 82% in Austria and Germany.\n\nThere is still so, so much room to grow for companies that provide credit, debit, or online payments. That's why I'm super bullish on V, MA, SQ, PYPL, MELI, etc. It doesn't matter how much of the digital payments pie each of these has when the pie itself is going to grow by huge amounts in the future. Cash is still king in most of the world, but it's trending towards digital payments each year.",
        "created_utc": 1620396591,
        "id": "gx9wxyh",
        "score": 2,
        "subreddit": "investing",
        "created": 1620425391.0
    },
    {
        "author": "Vegetable-Cold1253",
        "body": "A du ma lol",
        "created_utc": 1620425125,
        "id": "gxbofbm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620453925.0
    },
    {
        "author": "Churner_throwaway-",
        "body": "Amazon Microsoft Visa MasterCard Bank of America JPMorgan Goldman Sachs Peloton AKA my portfolio",
        "created_utc": 1620443423,
        "id": "gxcm22d",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620472223.0
    },
    {
        "author": "Low-Nefariousness912",
        "body": "Damn this dude “bonbon” lives on this shit. Get some fresh air ma du!",
        "created_utc": 1620437058,
        "id": "gxcaw09",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620465858.0
    },
    {
        "author": "puu222",
        "body": "Baba on the streets, Jack Ma in your sheets.",
        "created_utc": 1620348011,
        "id": "gx7w2xg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620376811.0
    },
    {
        "author": "NPRjunkieDC",
        "body": "Binance is Chinese. Read some posts on Reddit with horror stories . Their customer service sounds like Chinese Communist Party with Jack Ma",
        "created_utc": 1620339354,
        "id": "gx7ei6r",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620368154.0
    },
    {
        "author": "FragrantWarthog6",
        "body": "That “child” is just Jack Ma using Benjamin Button bioengineering to escape the authorities.",
        "created_utc": 1620457206,
        "id": "gxd4rhp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620486006.0
    },
    {
        "author": "xrparmy",
        "body": "Puts on jack ma",
        "created_utc": 1620382557,
        "id": "gx99qh5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620411357.0
    },
    {
        "author": "coastereight",
        "body": "I think the S&amp;P is due to touch the 50 day MA. The market will probably go lower this month but I'm hoping we see some shift back to growth and the Russell 2000.\n\nNot financial advice.",
        "created_utc": 1620329281,
        "id": "gx6qfcd",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620358081.0
    },
    {
        "author": "Plenty-Grape-1840",
        "body": "Nie ma szans",
        "created_utc": 1620319229,
        "id": "gx628fp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620348029.0
    },
    {
        "author": "Otherwise-Cash183",
        "body": "It has to be oversold for sure.\n\nSure the housing market might hit a bad streak but why dump that moneyprinter now?\n\nBesides it's always the little guy who gets rammed from behind so they would only have somewhat meager returns until shit gets back on track. Did Visa and Mastercard stop existing after 2008? Nope they made money and they still do. Rocket has solid finances even if they might fuck people on fees. This isn't Lehman brothers.",
        "created_utc": 1620305341,
        "id": "gx57bge",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620334141.0
    }
]