[
    {
        "author": "mistaowen",
        "body": "Anyone with a slight idea when this shit will ease? Only 26% of Nasdaq above 200 day MA….money has been pouring out for awhile now, basically 10 companies held indexes up past few months. Outflow has been insane with almost no buying.",
        "created_utc": 1638570494,
        "id": "hn4gmf4",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1638599294.0
    },
    {
        "author": "Hegemon90",
        "body": "They want to make sure everyone knows they are the boss. Jack Ma kinda forgot. *insert GOT meme*",
        "created_utc": 1638570829,
        "id": "hn4hdbe",
        "score": 3,
        "subreddit": "stocks",
        "created": 1638599629.0
    },
    {
        "author": "sd_pinstripes",
        "body": "fuck me, fuck mastercard, fuck jpow",
        "created_utc": 1638369776,
        "id": "hmstm2y",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638398576.0
    },
    {
        "author": "avl0",
        "body": "Shouldn't ma v and pypl be pretty good with inflation?",
        "created_utc": 1638363450,
        "id": "hmsh510",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638392250.0
    },
    {
        "author": "sd_pinstripes",
        "body": "if ma dumps again, i long rope",
        "created_utc": 1638363132,
        "id": "hmsgl0x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638391932.0
    },
    {
        "author": "Tribulation95",
        "body": "Yea, but there's so many graphs and charts and numbers. Over there with the VWAP, RSI, IC, BLT, MA, NAACP, etc. Me see movement me throw money.",
        "created_utc": 1638378589,
        "id": "hmtf1q1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638407389.0
    },
    {
        "author": "commieconfidential",
        "body": "I feel like V and MA are these bear traps that catch everyone looking for free money\n\nSource: don't look at my account",
        "created_utc": 1638379251,
        "id": "hmtgq0r",
        "score": 1,
        "subreddit": "options",
        "created": 1638408051.0
    },
    {
        "author": "Brief-Garbage",
        "body": "Fintechs are coming out with cheaper fees every day now, it's not a duopoly for Visa and Mastercard (+ PayPal/AMEX). \n\nThey need to reduce their fees or they'll lose business - neither is good for earnings growth, and their  moat is reducing.",
        "created_utc": 1638379277,
        "id": "hmtgsha",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638408077.0
    },
    {
        "author": "sycophantasy",
        "body": "Jack Ma returns from the grave like Gandalf the Fucking White and BABA shoots up to $690 a share.",
        "created_utc": 1638379818,
        "id": "hmti5yd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638408618.0
    },
    {
        "author": "FelixJuggl3r",
        "body": "Our journey toward the 100D MA is going well.",
        "created_utc": 1638390474,
        "id": "hmu9v2f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638419274.0
    },
    {
        "author": "segaman1",
        "body": "Delta airlines, PayPal, Visa and mastercard are in deep red right now for me, getting worse..",
        "created_utc": 1638389871,
        "id": "hmu88ov",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638418671.0
    },
    {
        "author": "surfinbird",
        "body": "🎶Blood in the streets and it’s up to ma ankles 🎶",
        "created_utc": 1638392420,
        "id": "hmuf4qp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638421220.0
    },
    {
        "author": "SKIman182",
        "body": "there's the 5% pullback and 50 day MA plus september peak support..... this is when you buy the dip",
        "created_utc": 1638391208,
        "id": "hmubtv8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638420008.0
    },
    {
        "author": "forcedaspiration",
        "body": "Yes Sir.  Jack Ma was a beacon of freedom, had iron nuts, and now he is in a Gulag.  CCP think's oppressing your most exceptional citizens is how you create a first quality nation.  They are drunk on power and arogance.",
        "created_utc": 1638399761,
        "id": "hmuxwy8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638428561.0
    },
    {
        "author": "PrudentAd3789",
        "body": "No. Last time it reversed at 100 MA. So better watch this one",
        "created_utc": 1638399618,
        "id": "hmuxkjm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638428418.0
    },
    {
        "author": "JRshoe1997",
        "body": "V, MA, LMT are the best rn. I would wait a bit on WMT for its valuation to come down more",
        "created_utc": 1638406955,
        "id": "hmve2xz",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638435755.0
    },
    {
        "author": "spiderman_44",
        "body": "Long-term V investor here, slowly building PYPL however V and MA still have the competitive moat for now",
        "created_utc": 1638420002,
        "id": "hmw705o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638448802.0
    },
    {
        "author": "inverse_wsb",
        "body": "Ma",
        "created_utc": 1638435218,
        "id": "hmwtldd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638464018.0
    },
    {
        "author": "PersonalBrowser",
        "body": "It's tough, yes they have a large moat, but the internet and mobile payments and digital wallets changes a lot. There are a lot of growth stocks out there that reduce friction beyond what VISA / MA offer. That being said, I think they still have the edge in the medium term.",
        "created_utc": 1638445410,
        "id": "hmx5x19",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638474210.0
    },
    {
        "author": "CommunicationOld9321",
        "body": "Time to be a Boomer and put I limit sale ...I ma go to a casino get some excitement",
        "created_utc": 1638445646,
        "id": "hmx68y2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638474446.0
    },
    {
        "author": "slowand-old",
        "body": "Sources: Jack Ma is beside himself. Driving around downtown China begging (thru texts) Jinping’s family for address to Xi’s home",
        "created_utc": 1638417470,
        "id": "hmw1zvg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638446270.0
    },
    {
        "author": "NoleScole",
        "body": "MA is innovative? They just partnered with companies so that people can have payment cards where they can instantly convert their coins to traditional fiat currency",
        "created_utc": 1638427596,
        "id": "hmwjs1d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638456396.0
    },
    {
        "author": "annnnnnd_its_gone",
        "body": "who wish Jack Ma can move to America? I think BABA will moon after",
        "created_utc": 1638492051,
        "id": "hn07g15",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638520851.0
    },
    {
        "author": "Huey_Long_Schong",
        "body": "Alibaba business works as intended, it's just Jack Ma refused to give Xi head and now Xi's coming for all of his honey",
        "created_utc": 1638491851,
        "id": "hn0704t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638520651.0
    },
    {
        "author": "RH_Fucked_My_Account",
        "body": "Visa or Mastercard?",
        "created_utc": 1638480663,
        "id": "hmzg8r9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638509463.0
    },
    {
        "author": "stockBot9000",
        "body": "Ma trick knee is acting up... 1% gap up tomorra.",
        "created_utc": 1638477008,
        "id": "hmz6hqc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638505808.0
    },
    {
        "author": "Mistletokes",
        "body": "Where in MA? Sup from Weymouth",
        "created_utc": 1638492628,
        "id": "hn08pi3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638521428.0
    },
    {
        "author": "SonOtoh",
        "body": "Baba is a great business but it doesn't matter when China and the US inch closer to economic and conventional war. \n\nI entered Nio at $7 and exited at $45. I love the company but I will not invest in Chinese business after Jack Ma disappeared, China saber rattling over Taiwan and openly threatening Australia for speaking out about the Ugyhr holocaust. \n\nYou have to look beyond fundamentals sometimes and unfortunately this is a classic case of that.",
        "created_utc": 1638633690,
        "id": "hn7g1qc",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638662490.0
    },
    {
        "author": "thejumpingsheep2",
        "body": "Paypal is good long term. They fill the gaps that the main processors (V, MA, etc) miss and they cover international areas where banking isnt easy. V and Paypal basically compliment each other.\n\nBlock is no. Though I use their software (switched recently from Turbotax), and think its good and priced nicely, I think their brick and mortar franchise is doomed and there is plenty of competition for online as well.\n\nSQ remains over priced imho and investors greatly over estimate its business. Most dont realize that there are hundreds of merchants who offer the same thing SQ does and did offer the same service long before SQ came around. SQ just made it slightly easier and had marketing power the smaller processors didnt. This is why many non-tech savvy people dont know about the alternatives.\n\nThough for the record I had absolutely no problem using a normal merchant when I ran my businesses and practically all of them offered a strip you can use with your computers (pre smartphone) as well as traditional machinery and a online API. This was as far back as 2000... When Blackberries became a thing you could also get a swipe thing for them.\n\nA normal merchant services offers far lower fees than SQ does. This is why I just dont get why anyone uses it. Its purely lack of knowledge. The only possible reason one might prefer SQ for merchant services is if you have stupidly low volume... to the tune of maybe a couple hundred a day. In this case, sure... SQ makes sense. Otherwise, you would be a fool not to get a normal merchant. Just call Costco for theirs. This is why I just dont get how SQ is growing... are businesses really that dumb? I just dont get it...",
        "created_utc": 1638475805,
        "id": "hmz3cur",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638504605.0
    },
    {
        "author": "DarkStarOptions",
        "body": "I agree completely.  I bought some Feb 22 210.00 Call options today.  I’ll be in these for about 6-8 wks.  I also just outright bought some for my kids IRAs.  V may not have the dominance it had for the next 10 years as compared to the prior 10 years, but even if it returns 50% less over the next ten years as compared to the prior decade, you are looking at 700% return.  That’s how good Visa, MasterCard, and Amex are",
        "created_utc": 1638487062,
        "id": "hmzw76c",
        "score": 1,
        "subreddit": "options",
        "created": 1638515862.0
    },
    {
        "author": "sd_pinstripes",
        "body": "ma green ah = another red day",
        "created_utc": 1638411561,
        "id": "hmvoq0z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638440361.0
    },
    {
        "author": "maz-o",
        "body": "https://www.investopedia.com/terms/p/price-earningsratio.asp\n\nSQ P/E: 195\n\nPYPL P/E: 43\n\nV P/E: 33\n\nMA P/E: 37",
        "created_utc": 1638433078,
        "id": "hmwr100",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638461878.0
    },
    {
        "author": "RokenCorsair",
        "body": "$MA\n\nWhat do you guys think? Been quite beat down.",
        "created_utc": 1638460630,
        "id": "hmy052o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638489430.0
    },
    {
        "author": "solovino__",
        "body": "Sell $NIO ASAP. Not a fan of $SNAP, but never dig into them enough to recommend selling. $MSFT and $META are good long term holds in my opinion. Gonna take a while to double your investment (assuming you bought today) but strong financially and bright future. \n\n$NIO is insanely overvalued. There’s no argument here. All EV and renewable stocks, wouldn’t suggest hopping in. P/Es are inflated so high it’s a guarantee we’ll see lower prices (a lot lower!) soon. History has shown.\n\nI like undervalued gems. \n\n$SMCI, $ASO, $VIRT, $ERIC, and $MTZ are my small cap stocks for long term hold. Each have their reasons as to why I’m holding but more importantly, their financials are strong. P/S approximately 1 (tough to find this ratio in today’s market. Gotta dig.) P/E ratios are low relative to competitors. Some have little long term debt. Good ROEs. Increasing revenue. Just safe to hold and DCA down during times like this for me. \n\nLarge cap stocks I’m holding long are $TMUS, $VZ, $AAPL, $V, $MA, and waiting for $PYPL to hit $130 to hop in. But guess what? If it doesn’t hit, I’m not jumping in. Simple as that. Plenty of stocks out there, no reason why you should jump in a stock that hasn’t convinced you yet.\n\nOr if you don’t wanna bother and have a strong stomach to handle red days, buy $TQQQ. \n\nLast thing. Rule of thumb: if it’s being newly mentioned highly on Wall Street bets, and media outlets, most likely it’s too late.",
        "created_utc": 1638459716,
        "id": "hmxxvb5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638488516.0
    },
    {
        "author": "SnipahShot",
        "body": "I held MA for a really short amount of time and I own a MA card, but honestly, not sure about the long term future of these companies.\n\nI have my bank's app which allows me to transfer money to others based on phone number and directly from my bank account. Last time I was at the dentist, I paid using that. Same as last time I purchased something from a website I am not familiar with, don't have to risk putting in my credit card number. \n\nI don't know what both V and MA doing in terms of innovation but NFC in credit cards is not safe either, they can be charged even while you are walking in the street. Pretty sure they can also be copied.\n\nI don't really use my PayPal account but I think it would be a superior payment technology in the future than both credit card giants.",
        "created_utc": 1638457555,
        "id": "hmxspt5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638486355.0
    },
    {
        "author": "Donkeycow15",
        "body": "You ma-ma-ma-make me happy",
        "created_utc": 1638566574,
        "id": "hn48rip",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638595374.0
    },
    {
        "author": "xflashbackxbrd",
        "body": "I'm buying MA (and selling visa for now to lock in loss for taxes) and i plan to buy amat once it gets back around 130 in the next few weeks ahead of the fomc",
        "created_utc": 1638584478,
        "id": "hn5a8sg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638613278.0
    },
    {
        "author": "Pumpedandbleeding",
        "body": "Which darknet market is taking visa cash or MasterCard?",
        "created_utc": 1638631182,
        "id": "hn7amuo",
        "score": 1,
        "subreddit": "investing",
        "created": 1638659982.0
    },
    {
        "author": "BreakerOneTwo",
        "body": "Ive tried debit, visa and mastercard. None of them work. Called scotia about it and they said scotiabank doesn't support crypto purchases at this time.",
        "created_utc": 1638630571,
        "id": "hn79dae",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1638659371.0
    },
    {
        "author": "polpotwasright",
        "body": "It's more a hedge against what a government can do to ruin the value of its currency via foolish loan programs or money printing or what have you. It's an avoidance of owning nothing but a pile of Zimbabwe 1Trillon bills. But yeah, it's the Western countries which have the least need for Bitcoin. Say what you will about US monetary policy, but we're still a long ways from burning cash for heat. There's a bigger need for it if you're in a third-world country with bigger fears than 10% inflation, or maybe you want to hold Bitcoin if you're in an authoritarian country and have genuine fears the government may come to seize your other assets.\n\n&gt;You will likely not be able to go to a shop and buy a bag of rice using BTC in a country that actively doesn't want to support BTC usage.\n\nCouldn't agree more, and I've said elsewhere that Western countries are probably still a long ways off from adopting it, if ever. Shop owners don't just say \"ok I'll take it,\" especially with it as volatile as it is--your day's profits would be ruined by a 5% drop in the bitcoin market. The only way I see adoption happening in the West is through technology and not just more people owning bitcoin. There's a technological need for a debit card that would do instant conversions to USD along with being a much cheaper middle-man than Visa or Mastercard. \n\nGranted, crypto does other stuff beyond being a hopeful currency. Gaming/NFTs I think will be the first real-world use case for it.\n\nBut when Buffet calls Bitcoin \"rat-poison\" because it has no utility, he's not totally wrong, either. It's $60k of basically theoretical value. I'm big into the space, but it's also the antithesis of value investing, which I also do and the dichotomy hurts my head sometimes.",
        "created_utc": 1638563803,
        "id": "hn41z9r",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638592603.0
    },
    {
        "author": "lettercarrier86",
        "body": "I use a combination of fibs, 50/200 MA, RSI, and MACD. \n\nFib levels usually hold up and are decently respected, at least on the longer time frames.",
        "created_utc": 1638572645,
        "id": "hn4lfa1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638601445.0
    },
    {
        "author": "wsb202009",
        "body": "PYPL, V, MA, SQ are really good stocks, but under valued today\n\nIPAY, JETS, XLF are the good etfs way down\n\nIWM, VOO and QQQ are the index etfs down.",
        "created_utc": 1638562340,
        "id": "hn3ydtw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638591140.0
    },
    {
        "author": "SaulidSnake",
        "body": "90 day MA confirmed, switch to callls?",
        "created_utc": 1638559295,
        "id": "hn3quze",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638588095.0
    },
    {
        "author": "hexydes",
        "body": "&gt; Since the scuppered listing, Ma, who also founded ecommerce platform Alibaba, has all but disappeared from public view. Cheng Wei, Didi chief executive, and Jean Liu, president, have also been maintaining low profiles as they seek a resolution with Chinese regulators.\n\nThis is why I won't invest in China. When a country can just make their citizens disappear, without any sort of due-process, it's not a country to be trusted.",
        "created_utc": 1638557938,
        "id": "hn3nj2r",
        "score": 1,
        "subreddit": "investing",
        "created": 1638586738.0
    },
    {
        "author": "the_lone_gr1fter",
        "body": "Nasdaq will hopefully bounce off the daily 180 MA.  🙏",
        "created_utc": 1638559796,
        "id": "hn3s3hk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638588596.0
    },
    {
        "author": "Beginning-Teaching88",
        "body": "You get a fucking cake delivered by Ma himself",
        "created_utc": 1638582515,
        "id": "hn567iy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638611315.0
    },
    {
        "author": "MeldMeldMeld",
        "body": "Why do ppl favour visa more than ma?",
        "created_utc": 1638589336,
        "id": "hn5k1b6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638618136.0
    },
    {
        "author": "Year3030",
        "body": "MA has laws against asking for your current salary. In fact, if anyone asks ever you should just deny to tell them, you don't have to.",
        "created_utc": 1638588774,
        "id": "hn5iwrq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638617574.0
    },
    {
        "author": "Laputa_swift",
        "body": "You deserve a blow job from Jack Ma for the level of dedicated confidence displayed here.",
        "created_utc": 1638589255,
        "id": "hn5jvfb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638618055.0
    },
    {
        "author": "d4v1d87",
        "body": "Between V, MA and AXP which one do you think have more potential to grow long term and why? Should I buy only one of this or is it better to buy for example 50% V and 50% MA?",
        "created_utc": 1638609344,
        "id": "hn6eoay",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638638144.0
    },
    {
        "author": "water_conversation",
        "body": "CCP told Didi not to list in us and they did anyways. Jack ma already went to CCP not camp so I think they like baba just a little better.  I wouldn't say just because Didi has to delist that baba has to as well",
        "created_utc": 1638580375,
        "id": "hn51taa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638609175.0
    },
    {
        "author": "NPRjunkieDC",
        "body": "I sent a message this week to mods on this subreddit. \nSince beetcoin transactions surpassed PYPL and in a few years maybe MC it was time to allow us to mention but reply was no.\n\nThese are my COIN related ETHE + HUT + BITF + SMU/RF + MA/RA + FR/TTF + GR/EE + MI/GI + BKKT",
        "created_utc": 1638536968,
        "id": "hn2a03m",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638565768.0
    },
    {
        "author": "Chromewave9",
        "body": "I do find that hilarious. Musk would be executed within an hour if he were in China acting the way he does in the United States. Jack Ma got comfortable and forgot his place so the Chinese government wanted to make an example out of him. Seems like Ma got a taste of freedom and didn't realize he isn't the one truly with power. \n\nFinancials are great and it might get to a point where it is impossible to ignore but you just never know how radical this situation can get. This is one of the weird stocks where the financials are doing well but the risk heavily outweighs the reward and that's why people are pulling their money away.",
        "created_utc": 1638509289,
        "id": "hn18er8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638538089.0
    },
    {
        "author": "interrobangbros",
        "body": "AAPL?\n\nI know V and MA pay dividends but I’d hardly call them dividend stocks. Their yields are each &lt;80bps. It’s a pittance. \n\nI own both and I’m finding it difficult to craft a case that either will continue to beat SPY and QQQ from their current market cap.",
        "created_utc": 1638507494,
        "id": "hn157rg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638536294.0
    },
    {
        "author": "interrobangbros",
        "body": "Anyone have a bull case for why V or MA can beat SPY or QQQ the next 5+ years?",
        "created_utc": 1638506192,
        "id": "hn12r2w",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638534992.0
    },
    {
        "author": "Zanky-",
        "body": "MA",
        "created_utc": 1638505687,
        "id": "hn11qew",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638534487.0
    },
    {
        "author": "BountyHunter_666",
        "body": "MA has stopped being CEO long time ago. Do your dd. People keep associating him with baba, but aside from ANT group he has nothing to do with baba anymore..",
        "created_utc": 1638510824,
        "id": "hn1azf6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638539624.0
    },
    {
        "author": "sjssjs1",
        "body": "The Chinese government can do anything they want with the Chinese businesses. They are under it’s control. It’s obvious from the news.  It’s very bad for business. They don’t want listings on the US stock exchange because of security and privacy reasons. Regardless of Baba’s fundamentals the Government is in control of the business not MA. Who wants to own a share of a business like that.",
        "created_utc": 1638665818,
        "id": "hn9jteq",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638694618.0
    },
    {
        "author": "Fitzroy86",
        "body": "If we're going back to the 3's I'm holdin onto ma diiiiiiiCK WOOOOOO",
        "created_utc": 1638499429,
        "id": "hn0o2qn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638528229.0
    },
    {
        "author": "sonofalando",
        "body": "Where is Jack Ma![img](emote|t5_2th52|4260)",
        "created_utc": 1638500850,
        "id": "hn0rb14",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638529650.0
    },
    {
        "author": "Delavan1185",
        "body": "Depends on the kind of correction the bear expects.\n\nFor example:\n1.  It's entirely possible a US correction happens and a rotation into China happens for a few months, just based on cyclicality - China started drawing down months ago on regulatory fears, so valuations are attractive. \n\n2. MA and V have been pulling back for about a year, due to a variety of factors, and are sitting at trend support on the log-scale, 10-year+, monthly charts. Financials and payments are often a good leading indicator of cycles - so we could be looking at a rotation out of tech and speculative investments but the beginnings of a rebound in MA/V (and maybe PYPL but that's a mixed tech/finance stock). Anticipated rising interest rates will benefit traditional mortgage banks at the expense of investment banks.\n\n3. For broader-market permabears scared of China - Utilities have been relatively flat for about a year now as well. They are also a safer, more income-focused sector for downturns, and have relatively inelastic demand, which protects them from downturns to a moderate extent.",
        "created_utc": 1638495980,
        "id": "hn0g6ny",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638524780.0
    },
    {
        "author": "stangerthings",
        "body": "That’s what you get for betting on Jack Ma honestly. Dude has half a brain.",
        "created_utc": 1638497077,
        "id": "hn0ipd2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638525877.0
    },
    {
        "author": "Empty_Sink_4597",
        "body": "There is a lot of support here around the 100 day ma but if it breaks through it could get ugly",
        "created_utc": 1638548115,
        "id": "hn2yl4m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638576915.0
    },
    {
        "author": "HotStockSlinger",
        "body": "We need to modernize nursery rhymes like  🎶BABA of Jack Ma, do u ever go up? No sir, no sir, your calls are fucked🎶",
        "created_utc": 1638556553,
        "id": "hn3k2lr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638585353.0
    },
    {
        "author": "mrchakra7",
        "body": "SQ, SNAP, TWTR, PYPL, V, MA have hit 52-week lows in the past week...",
        "created_utc": 1638557170,
        "id": "hn3lm55",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638585970.0
    },
    {
        "author": "Purpleorangez",
        "body": "This is what happens when you put your trust in Jack Ma without ever hearing him speak.",
        "created_utc": 1638546789,
        "id": "hn2vb2o",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638575589.0
    },
    {
        "author": "Jeff_Bezels",
        "body": "BABA's stock lost its energy when they let Ma go.",
        "created_utc": 1638545820,
        "id": "hn2swv2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638574620.0
    },
    {
        "author": "jaboyles",
        "body": "OH MA GAWD",
        "created_utc": 1638546887,
        "id": "hn2vjw4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638575687.0
    },
    {
        "author": "interrobangbros",
        "body": "Anyone have a bull case for why V or MA can beat the market over the next 5+ years?\n\nI own both and I’m finding it difficult to craft a case that either will continue to beat SPY and QQQ from their current market cap. They have both trailed SPY and QQQ over the past 1- and 3-year periods and they’ve only beaten SPY over the last 5 years, trailing QQQ pretty handily.",
        "created_utc": 1638543865,
        "id": "hn2o9hs",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638572665.0
    },
    {
        "author": "Phantom_Journey",
        "body": "Did we ever find Jack ma?",
        "created_utc": 1638530188,
        "id": "hn1zymi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638558988.0
    },
    {
        "author": "stiol",
        "body": "Jack Ma fucked with whinne the pooh",
        "created_utc": 1638530193,
        "id": "hn1zyur",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638558993.0
    },
    {
        "author": "TalkingBackAgain",
        "body": "BABA will no doubt come back. It’s not as if it’s an empty shell or worthless assets.\n\nThe question is: *when* will they come back. And that is something only Jack Ma knows.",
        "created_utc": 1638664055,
        "id": "hn9fsh5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638692855.0
    },
    {
        "author": "JadendayZero",
        "body": "The moment Jack Ma was missing is when everyone should have dumped. Best decision ever made",
        "created_utc": 1638516624,
        "id": "hn1jhab",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638545424.0
    },
    {
        "author": "EnginThis",
        "body": "&gt; it projects pretty significant (276%) upside\n\nPlease send this post link to China CCP and copy to Jack Ma!",
        "created_utc": 1638706013,
        "id": "hnbdktz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638734813.0
    },
    {
        "author": "Empty-Entertainer-42",
        "body": "There is an old saying in my country, Italy, \" fidarsi è bene ma non fidarsi è meglio\"",
        "created_utc": 1638722204,
        "id": "hnc859v",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638751004.0
    },
    {
        "author": "SKIman182",
        "body": "SPY reclaimed it's 50 day MA at 453.31, in the last 15 mins of the trading day, after being under 450 TWICE in the previous hour. I don't care what FUD bears will throw around, but that's bullish as fuck.",
        "created_utc": 1638734964,
        "id": "hnd69at",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638763764.0
    },
    {
        "author": "commieconfidential",
        "body": "The whole sector is oversold but that won't stop it from going down.  \nSource: My $V and $MA calls.",
        "created_utc": 1638749677,
        "id": "hne87qt",
        "score": 1,
        "subreddit": "options",
        "created": 1638778477.0
    },
    {
        "author": "Big_Egg_7434",
        "body": "I just bout MA and theses prices are basement bargain prices!!! I’m a buy buy buy….",
        "created_utc": 1638356919,
        "id": "hms7lw1",
        "score": 1,
        "subreddit": "options",
        "created": 1638385719.0
    },
    {
        "author": "NodeDotSwift",
        "body": "Your entire argument is appeal to authority (and “manipulation”), you address none of the substantive facts he posted.\n\nBTW: Being delisted isn’t that rare, one of my positions (AAMC) got delisted by the NYSE yesterday with no explanation other than “regulatory concerns” and no indication of when or where it will trade next.\n\nYou also ignore that the risks aren’t just Chinese regulators seeking to eliminate foreign influence, but also Jack Ma. This cretin was caught trying to steal Alipay from shareholders a decade ago, and leopards can’t change their spots.\n\nWill he steal again? Will he get disappeared again? Will he care about some shell company in the Cayman Islands and it’s ADRs ever if the PRC tells him to cut them off?",
        "created_utc": 1638374953,
        "id": "hmt5w8m",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638403753.0
    },
    {
        "author": "tunawithoutcrust",
        "body": "Idk I think there's a real chance for a melt up scenario given the number of companies in both major indexes trading below their 200 day MA.  It's currently 28% of companies trading above, if it goes to support we could see a spike, who knows.",
        "created_utc": 1638403229,
        "id": "hmv5kuz",
        "score": 1,
        "subreddit": "investing",
        "created": 1638432029.0
    },
    {
        "author": "mlord99",
        "body": "both were bought by my colleague who is an value investor -- i want pins for 30$ though 😂 zillow is a pass for me...\n\ni picked up a lot of vrtx, ma, v and telekom (t/vz) over last couple of months...",
        "created_utc": 1638402509,
        "id": "hmv3wza",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638431309.0
    },
    {
        "author": "A_hole702",
        "body": "![gif](emote|free_emotes_pack|upvote)![gif](emote|free_emotes_pack|upvote)![gif](emote|free_emotes_pack|upvote)This ma fucker right boi. ![gif](emote|free_emotes_pack|upvote)![gif](emote|free_emotes_pack|upvote)![gif](emote|free_emotes_pack|upvote)",
        "created_utc": 1638402830,
        "id": "hmv4ntz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638431630.0
    },
    {
        "author": "TimelyTint",
        "body": "Bearish as fuck if we close near the 50 day MA",
        "created_utc": 1638390229,
        "id": "hmu9755",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638419029.0
    },
    {
        "author": "Informal_Koala4326",
        "body": "It’s genuinely difficult to even respond to such a long winded and incoherent statement. You essentially retracted your generalization about “blue state governors” plural to now refer to only the governor of WA. Sure?\n\nThe thing I really want to focus on is your weakest argument which is the edit you put on this comment. You said you would “show me how I was wrong” in the edit. Apparently showing me how I am wrong is just you typing that “there were all sorts of restrictions” without any specifics or sources. You listed a bunch of shit, most of which is irrelevant to any political decisions by state governors. \n\nMissed sporting events? This season in the bluest state in the US everything is full capacity indoors and out. This goes for almost all blue states. During the time period sporting events were missed - it was happening in BOTH red and blue states prior to high vaccine levels.\n\nCancelled fairs? Apparently this is a big political issue? Biggest fair in MA was packed this year and not cancelled. Also do you think the governor decides on fair cancellations to virtue signal? That one is honestly kind of funny.\n\nMandatory masks? Ironically this one you are the most off on. 6 states currently have mandatory mask laws. 3 are blue. 2 are red. One is purple. But yes - clearly “blue state governors” virtue signaling.\n\nHomeowner laws? I legit don’t even get this point. Not aware of any “homeowner laws” related to covid restrictions coming from any blue state governors, at least the ones I’ve listed.",
        "created_utc": 1638403698,
        "id": "hmv6o06",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638432498.0
    },
    {
        "author": "Zealousideal_Rent_17",
        "body": "My name is cocaine Cramer buy dis pypl ma what a moron 🤡 short these stock and u will get paid 🦍",
        "created_utc": 1638406285,
        "id": "hmvcjya",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638435085.0
    },
    {
        "author": "Informal_Koala4326",
        "body": "Notice how you keep referencing the same capacity restriction in WA. The majority of blue states have had no capacity restrictions during this timeframe. None have had “lockdowns” which was the main point of your initial argument. It’s just laughable to see someone fear mongering about “blue states” “virtue signaling” and politicians trying to control through fear. When places like CA, NY, MA, NJ the most populous “blue” states have had absolutely none of this happen.\n\nYou’re on Reddit ranting about blue state lockdowns when we are out at the bar full capacity chilling. It makes me laugh out loud seeing fear mongering like this when I’ve been to concerts full capacity unmasked for most of the past year.",
        "created_utc": 1638396137,
        "id": "hmuoxa9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638424937.0
    },
    {
        "author": "Omnipotent-Ape",
        "body": "Jack Ma was the main reason to invest in Baba.  He's been ghosted and there's no coming back.  Some kind of money laundering charge will be made up and Baba will go full commie.  Not soon, but as things get worse in China it will happen.",
        "created_utc": 1638393597,
        "id": "hmui8s0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638422397.0
    },
    {
        "author": "deafultadmin222",
        "body": "Where ma Santa 🚀",
        "created_utc": 1638396259,
        "id": "hmup8fc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638425059.0
    },
    {
        "author": "DrMotorsage",
        "body": "Those price targets were sensible when everyone thought the CCP would be content just to remove Ma and slap the company on the wrist with a large-sounding but proportionately not very scary fine, but otherwise they would let BABA conduct business as usual. Those things happened, all right, but to add insult to injury Winnie the Pooh then ripped into the company with a turbocharged chainsaw.\n\nIt will get worse before it gets better. I wouldn't be surprised if BABA hits double digits soon.",
        "created_utc": 1638408029,
        "id": "hmvgka5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638436829.0
    },
    {
        "author": "xeneize93",
        "body": "Dimon is pure evil and Jack Ma is in Europe",
        "created_utc": 1638411779,
        "id": "hmvp8bq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638440579.0
    },
    {
        "author": "DamascusWaygu",
        "body": "MA",
        "created_utc": 1638413661,
        "id": "hmvtlzl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638442461.0
    },
    {
        "author": "TheAngryMilliner2",
        "body": "This seems like an ideal time to build up positions with V and MA. The same day news of the Amazon-V brouhaha emerged MA dropped along with V.\n\nThings might be changing with emerging fintech companies but the fact of the matter is V and MA are both behemoths that are expecting some rosy quarters in the immediate future.\n\nBeen snagging calls on both dated for three to six months out.",
        "created_utc": 1638423390,
        "id": "hmwd5lp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638452190.0
    },
    {
        "author": "myrmonden",
        "body": "I look at lot longer time period to see previous resistance levels\n\nor general key markers.\n\nFor example Visa and Mastercard are both interesting dips now as they are back pre share cost before corona 2020",
        "created_utc": 1638476283,
        "id": "hmz4lcd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638505083.0
    },
    {
        "author": "DNGR_S_PAPERCUT",
        "body": "Ma jin caw",
        "created_utc": 1638480202,
        "id": "hmzf0d9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638509002.0
    },
    {
        "author": "Emotional-Bowler-961",
        "body": "V PYPL MA",
        "created_utc": 1638477701,
        "id": "hmz8cnb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638506501.0
    },
    {
        "author": "juaggo_",
        "body": "Moving average is basically an indicator used in TA. MA fluctuates constantly and it tells information about a stock’s price during a certain time (i.e. 200 SMA)",
        "created_utc": 1638478476,
        "id": "hmzaf7e",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638507276.0
    },
    {
        "author": "DontForgetTheDivy",
        "body": "You can sign up here for free: [https://www.cnbc.com/investingclub/](https://www.cnbc.com/investingclub/)  He will email alerts of every move he's going to make with the trust before he does it.\n\nCurrent holdings are: ABT, ABBV, AMD, GOOGL, AMZN, AEO, AAPL, BA, AVGO, CVX, CSCO, COST, DIS, DD, LLY, EL, F, HON, LIN, MRVL, MA, FB, MSFT, MS, NLOK, NUE, NVDA, PYPL, CRM, UNP, UPS, WMT, WFC, WYNN\n\nI'm not a super fan or anything, but I listen to anyone for ideas and make my own decisions.",
        "created_utc": 1638642178,
        "id": "hn80frg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638670978.0
    },
    {
        "author": "SonicOnMeth",
        "body": "I disagree, things like cashapp and other peer-peer networks could put a big dent in V and MA. They are great companies but i think they have abused their market dominance position for years and we will have to see if peer-peer solutions gain traction.",
        "created_utc": 1638618200,
        "id": "hn6oyek",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638647000.0
    },
    {
        "author": "-C20H24O3",
        "body": "Bruh… I just signed in a truck driver at work whose last name is “Ma” \n\nSwear I almost begged him to please save my BABA positions",
        "created_utc": 1638415385,
        "id": "hmvxjc2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638444185.0
    },
    {
        "author": "MonteCristo2021",
        "body": "A lot of stocks have already corrected 10-20% CAT, Visa, Mastercard, FedEx.....",
        "created_utc": 1638454313,
        "id": "hmxlf5t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638483113.0
    },
    {
        "author": "abrahamlincoln20",
        "body": "AT&amp;T, though most of the growth would probably come from the spun off WBD, but you get them both if you buy now. Even cheaper than Intel.",
        "created_utc": 1638347148,
        "id": "hmrw4ck",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638375948.0
    },
    {
        "author": "Interfecto",
        "body": "Nope, I was listening to a podcast and the host mentioned the doc, so I watched it and now I’m sad 🏎☹️",
        "created_utc": 1638348666,
        "id": "hmrxxt3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377466.0
    },
    {
        "author": "LeafsAreCryBabies",
        "body": "The problem is that though these companies are probably going to be really profitable in the next few years, one would most likely need to hold them after merger.\n\nThe crypto market could enter a bear market in a few months so I feel that would limit profit on the SPAC.\n\nWith that said, another blow off top for this bull run in crypto may be profitable for this SPAC  for those who invest now. \n\nFood for thought",
        "created_utc": 1638347626,
        "id": "hmrwoo5",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638376426.0
    },
    {
        "author": "sleepyguy007",
        "body": "Yeah I figured. ... Used to live there.  I actually live in LA now and it's starting to get that bad.  I feel like I need this sub just to figure out how to get the money to not have to deal with these issues sadly",
        "created_utc": 1638345681,
        "id": "hmru9yq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374481.0
    },
    {
        "author": "StockTipsTips",
        "body": "You have needs and wants. Inflation is when you have less spending power with the same paycheck. Now let’s assume prices skyrocketed. You would economize on your needs and scale back on your wants. If enough people cut back on buying wants you have a situation where the same amount of companies are competing for what remains behind on decreased business. Stonks go down.",
        "created_utc": 1638349856,
        "id": "hmrzbsv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638378656.0
    },
    {
        "author": "badasschap",
        "body": "It means GOLDMAN SACHS - MARKET HAS NOW PRICED IN A MAMMOTH C.7 MB/D NEGATIVE DEMAND HIT OVER THE NEXT THREE MONTHS, WITH NO OFFSETTING OPEC+ RESPONSE",
        "created_utc": 1638346283,
        "id": "hmrv1l7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375083.0
    },
    {
        "author": "tisgamebeterhavep0rn",
        "body": "He busted a couple of times by now and it's just sleeping soundly",
        "created_utc": 1638346758,
        "id": "hmrvmvq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375558.0
    },
    {
        "author": "Sallys_Thigh_Gap",
        "body": "I was up 12% like 2 weeks ago and then BABA and a few more growth stocks collapsed and now I'm down 2% overall.\n\nI'm worried I'm down overall and we're in a massive bull market :/",
        "created_utc": 1638346782,
        "id": "hmrvnzc",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638375582.0
    },
    {
        "author": "Upper-Equivalent3651",
        "body": "Well, the QE fucked a lot of things up, wouldnt you say?\n\nJust taking a look at treasuries and you cry. There was a time when you got interests for the risk you are taking the loaner goes bust. Now it seems all rules are out of the window.\n\nOne look at treasuries of Greece and my eyes go blank.\n\nNot even talking about sanctions. Fucked a lot of things up too. Or when people just do their own sanction thing (yes, clearstream, euroclear and whatever you call yourselves, I am talking to YOU!)\n\nAh well. You win one, you lose one.",
        "created_utc": 1638347943,
        "id": "hmrx2bm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376743.0
    },
    {
        "author": "wolfiasty",
        "body": "PRPB, you Beauty of a Princess.\n\nCONX, you Shiny Star in the sky.\n\nCRHC, you Fabulous Black Horse.\n\nHalf of CCIV gains in paper loss. Can we start December rally now pretty please ?",
        "created_utc": 1638348804,
        "id": "hmry3t2",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638377604.0
    },
    {
        "author": "xcheezeplz",
        "body": "That's what oil does, it's not algos, the price is literally influenced by a cartel deciding what it should be. Now mix in market uncertainties and what else would you expect? \n\nUsually it only takes 2 times getting fucked trading oil before people swear it off.",
        "created_utc": 1638348207,
        "id": "hmrxdt7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377007.0
    },
    {
        "author": "Crater_Animator",
        "body": "Shoulda waited till mid-end December. Volatility is super high right now, and we're heading  for a little correction or more.",
        "created_utc": 1638348152,
        "id": "hmrxbey",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638376952.0
    },
    {
        "author": "Phantom_Journey",
        "body": "Yeah, I sold a ton of VIX calls Wednesday at 20. I bough puts at 24 and 28. Didn’t cashed out when 5K up. I closed it flat. Now I’m back in for a month this time, waiting for some change. It’s.. fucking annoying.",
        "created_utc": 1638348966,
        "id": "hmryanq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377766.0
    },
    {
        "author": "SomeKindOfSorbet",
        "body": "But Intel doing bad for the last year doesn't mean it's going to for the next 2 years. I'm making this call for now, not for a year in the past.",
        "created_utc": 1638346951,
        "id": "hmrvvqi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638375751.0
    },
    {
        "author": "Redditsome22",
        "body": "[Pie graph](https://ibb.co/wwc9QhN?fbclid=IwAR1z1gj0gQ7T8nUUHXUVERiWjmndFdjXWnYv6Y-Y_BAsgDVGgiYFoKHRegU)\n\n&amp;#x200B;\n\nI have done a lot of repositioning into positions currently on what I considered a discount all of those flew high, too fast and burnt to the ground and beyond. went deep into BABA - currently 178avg and PYPL 211 avg - currently sadly sitting at an unrealized xx% loss. Also loaded on what was a speculative position last year with higher conviction now - bought quite a few CRSP at what I believe to be the bottom at the 78 range - currently avg at 102+-.{Not even mentioning my stupid PLTR,BB position - gambles going wrong atm, believing in the hype and the reason I bought hasnt changed still hence why i havent sold}\r  \n\r  \nAlthough I have sizeable losses here these positions have elevated my positions amazingly.\r  \n\r  \nHolding a sizeable position with xxx% returns on AMD and NIO and very bullish on SE - recently added to my position at 280\r  \n\r  \nbought into the AMC hype with a 14 avg and sold of 80% at around the 60 mark\r  \n\r  \n\r  \n\r  \nSquare shouldve been scalped and rebought 205-280 range and back is ridiculous but oh well\r  \n\r  \nsold JD into strenght to buy into my weaker positions - had a big position before. still bullish but seeing more upside elsewhere atm.\r  \n\r  \nI dont have any us mega caps- I know winners stay winners usually but I am looking for hopefully bigger returns albeith I run risk of big losses, clearly, as well - such as sizeble position in a clinical trial biotech AGTC - currently at a big loss aswell but that was expected. Lets see what happens here. stock at all time lows.\r  \n\r  \n\r  \n\r  \nfor example although im sitting at a 10avg with my SKLZ position the downside is limited here imo, and potential huge hence why I have been adding to my position lately a lot bellow 10\r  \n\r  \n\r  \n\r  \nI do recommend people look into CPNG and let me know their thoughts. I am torn between adding to this position or keeping it small.",
        "created_utc": 1638358232,
        "id": "hms9b17",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638387032.0
    },
    {
        "author": "trail34",
        "body": "Ugh. I see this a lot, but it makes no sense. What’s better…\n\n1) profiting $1000 and paying $350 in taxes, netting you $650?\n\n2) profiting $1000 and purposely losing $1000, paying $0 in taxes, and netting you $0?\n\n3) profiting $1000 and purposely losing $2000, getting a $350 tax refund but you’re now at -$750 net?\n\n\nPeople are always so afraid of paying taxes. But I’d rather pay taxes and still have a profit than negate all my winnings by purposely selling stuff for less than I paid.",
        "created_utc": 1638360073,
        "id": "hmsbuca",
        "score": 1,
        "subreddit": "investing",
        "created": 1638388873.0
    },
    {
        "author": "dutch9494",
        "body": "If you’re looking for high risk high reward NAKD might be your thing. It’s basically this lingerie company that got beaten to its knees by the pandemic and is now being used to transform in to CENNTRO in order to take that private company to the Nasdaq.",
        "created_utc": 1638358202,
        "id": "hms99l7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638387002.0
    },
    {
        "author": "yachtykek",
        "body": "seriously tho, this shit is too easy. calls on big tech. buy on da dips. fuck with tesla aka forrest gump every now and then. getting rich in the stock market for dummies",
        "created_utc": 1638360128,
        "id": "hmsbx3c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388928.0
    },
    {
        "author": "rjenks29",
        "body": "Now.",
        "created_utc": 1638360147,
        "id": "hmsby25",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638388947.0
    },
    {
        "author": "Fine-Ad6513",
        "body": "kind of unfair equivalence because the Nokia business has been disrupted in the last 15 years severely. They couldn't get an alternative to a good smartphone. They try to catch up with 5G now but they are still behind. Now with Baba I agree that they might face more antagonism, but how exactly do you see the online retail business being disrupted in the 10-20 years to come in China? Also, antagonists need time to build an infrastructure.",
        "created_utc": 1638361709,
        "id": "hmse9a6",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638390509.0
    },
    {
        "author": "Diamondhands4dagainz",
        "body": "I can’t bet on it because I don’t know when the rates will rise. JPOW could come in today and say “Fuck it we’re gunna raise rates next week”. Cunt is a loose cannon now",
        "created_utc": 1638361190,
        "id": "hmsdgqw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389990.0
    },
    {
        "author": "hurricane_floss",
        "body": "Find a stock you like, I like PayPal right now.. and then just slide money into my massive bag.",
        "created_utc": 1638351589,
        "id": "hms1asd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638380389.0
    },
    {
        "author": "Superddone20222",
        "body": "lol the entire world is green. sorry bears you guys had your 2 out of 3 days but now the party is over.",
        "created_utc": 1638354233,
        "id": "hms4c9e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383033.0
    },
    {
        "author": "DodgeBeluga",
        "body": "This. Nothing in China is above Xi now that he’s got another official term and put him self as peer of Deng.",
        "created_utc": 1638356565,
        "id": "hms75nu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638385365.0
    },
    {
        "author": "Super_NiceGuy",
        "body": "Well it does look like a bubble but it is impossible to say if it is and if that is the case then when it will pop. There are just so much going on right now that it can be pumped for many different reasons, some legitim and some retardness. I think it is way over priced but on the other hand my knowledge fits in a pinch.",
        "created_utc": 1638352321,
        "id": "hms256p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638381121.0
    },
    {
        "author": "MrPacksAlot",
        "body": "Yeah it’s now a flagrant foul",
        "created_utc": 1638352298,
        "id": "hms2475",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638381098.0
    },
    {
        "author": "TruncateReed",
        "body": "waiting for a dip is like waiting until your school sweetheart is getting a divorce to get it after all. if you had the balls back then, you wouldn't have to wait now. never look back, never regret missed opportunities: because while you regret them, you are already missing new ones.",
        "created_utc": 1638353909,
        "id": "hms3ym0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638382709.0
    },
    {
        "author": "Brief-Garbage",
        "body": "I think they are in a bubble, but can see an actual use case for them in e.g. licencing or gaming.\n\nRight now though, there are a whole bunch of gaming tokens being released for games that haven't been released yet and have 0 users. This is peak bubble, speculating that this game is going to actually have users, and that the users will want items in it badly enough to pay $10k for in game items. \n\nThey also need to deal with existing games made by all the best developers, and that are free to play. Why on earth would a game that requires everyone to buy $1000 items take off if 99.9% would rather play Fortnite or COD for free? These NFTs are in for 99.9999% drops to come close to regular games if they want mass market appeal.",
        "created_utc": 1638352173,
        "id": "hms1yv7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638380973.0
    },
    {
        "author": "parttimeschizo",
        "body": "What? No way, each dose costs about $20 and while they might be “free”, they are subsidized through taxation obviously. Now, regardless of what the data shows good or bad, do they have a profit motivation to keep their mass vaccination campaign going, yes or no?",
        "created_utc": 1638353029,
        "id": "hms2y8g",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638381829.0
    },
    {
        "author": "sinncab6",
        "body": "Lol created in January but right you have other accounts but you must just use this one for WSB?\n\nEither way dont try bullshitting everyone like you are some elite old school wall street bets guy when you like 90% of the people on here now myself included found out about this sub then.  The difference is I used GME for what it was worth a quick pump and dump, and not a social cause that the shittiest ran company on the planet towards customers and employees alike was going to cause the great proletariat uprising and usher in a utopian society like you Jim Jones following kool aid kids believe.",
        "created_utc": 1638351183,
        "id": "hms0u9p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379983.0
    },
    {
        "author": "Nearby_Paint_2196",
        "body": "Im not cocky enough to say we’re in anything like a Great Depression right now.  It’s possible we are, who knows.",
        "created_utc": 1638351130,
        "id": "hms0s3t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379930.0
    },
    {
        "author": "Bull_City_Bull_919",
        "body": "Stop trading now. Setting yourself up for failure more so. If you’re over working by charting &amp; examining everything you’re receiving diminished returns because you’re cooked brother. Walk away for a week or two",
        "created_utc": 1638354292,
        "id": "hms4et8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383092.0
    },
    {
        "author": "Phaeax",
        "body": "Need pump the market now with free monies and load up on puts at ATH so can dump",
        "created_utc": 1638355110,
        "id": "hms5e88",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383910.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Market really be like “so you say there’s *more money now*",
        "created_utc": 1638356734,
        "id": "hms7dct",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638385534.0
    },
    {
        "author": "marker853",
        "body": "Wendys burgers were different 20 years ago. They are absolute shit now.",
        "created_utc": 1638356023,
        "id": "hms6huc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638384823.0
    },
    {
        "author": "stockninja39",
        "body": "PSA: handies are now $15 because inflation or just because I want to charge this much 🖕",
        "created_utc": 1638356821,
        "id": "hms7hfy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638385621.0
    },
    {
        "author": "jason-landry",
        "body": "The stock market is like legalized gambling. You win some, and you loose some. I have been investing for 30 years. There have been many ups and downs, but for the most part, you WILL make money if you play your cards right. Do not quit now! Make sure you diversify your portfolio. Diversification could mean: Stocks, Bonds, ETFs, Mutual Funds, physical Gold &amp; Silver, Crypto, CASH! \n\nThe S&amp;P 500 Index is a good fund if you're into mutual funds. You should also look at international stock funds, small cap and mid size funds too. Twenty or thirty years from now you'll look back at the advice that you have been given and hopefully be smiling. Make sure to read a lot on the topic of investing, and read periodicals like *Barron's* for some great info. All the best in your investing journey.",
        "created_utc": 1638355131,
        "id": "hms5f43",
        "score": 1,
        "subreddit": "investing",
        "created": 1638383931.0
    },
    {
        "author": "TheOriginalBushToad",
        "body": "TGT, AMZN, KSS, XRT, UPS.  Santa rally starts now!",
        "created_utc": 1638357031,
        "id": "hms7qyl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638385831.0
    },
    {
        "author": "Tersiv",
        "body": "Great write up. Now show us your % performance..",
        "created_utc": 1638355966,
        "id": "hms6fft",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638384766.0
    },
    {
        "author": "freakymreaky",
        "body": "Intel was a great company at 2000 and you could easily see intel sticking around for next 20 years, which it has and it more than quadrupled revenue etc. But stock price? Thats another story. Same thing is happening with NVDA and TSLA right now. Both will be around in 2041 most likely and their profit and revenue will 3X, 4X but I dont see stock price going higher.",
        "created_utc": 1638356298,
        "id": "hms6tpr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638385098.0
    },
    {
        "author": "Fahim_2001",
        "body": "I knew it was going to be green today, this shit is becoming so predictable now.",
        "created_utc": 1638356926,
        "id": "hms7m8p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638385726.0
    },
    {
        "author": "MADEUPDINOSAURFACTS",
        "body": "The person below explained it well but if you are familiar with stocks, they work exactly the same way.  $IWM is trading at $152 and I short 100 shares there thinking its the top, and it rallies to $300 am I making money or losing money?\n\nConversely, $IWM is trading at $152 and I buy 100 shares there and it is now trading at $300, am I making money or losing money?\n\nSame applies to options.",
        "created_utc": 1638361574,
        "id": "hmse1nb",
        "score": 1,
        "subreddit": "options",
        "created": 1638390374.0
    },
    {
        "author": "zabi_01",
        "body": "Anyone investing in GME now is just putting their money on fire",
        "created_utc": 1638361055,
        "id": "hmsd9ne",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389855.0
    },
    {
        "author": "VisualMod",
        "body": "/u/qwert1225 is now special.",
        "created_utc": 1638358755,
        "id": "hmsa0hy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387555.0
    },
    {
        "author": "Ratchet_as_fuck",
        "body": "I was planning on buying shares and selling OTM covered calls, the premium is so high on options right now!",
        "created_utc": 1638360122,
        "id": "hmsbwtp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388922.0
    },
    {
        "author": "Dwarfguy",
        "body": "At least I still have my youth and my health... for now",
        "created_utc": 1638358258,
        "id": "hms9c7y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387058.0
    },
    {
        "author": "AnAssholesBestFriend",
        "body": "Market yesterday: Nooooo non-transitory inflation and Omicron, i hate you!!!!\n\nMarket 5 minutes after close and this AM: wtf i love inflation and covid now",
        "created_utc": 1638359702,
        "id": "hmsbbi8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638388502.0
    },
    {
        "author": "quintanarooty",
        "body": "You forgot \"the price of a gallon of milk is now $300\"",
        "created_utc": 1638361947,
        "id": "hmsems9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390747.0
    },
    {
        "author": "VisualMod",
        "body": "/u/realister is now special.",
        "created_utc": 1638358621,
        "id": "hms9tz7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387421.0
    },
    {
        "author": "RoPrime12",
        "body": "Right, but look at realistic growth. Everyone is in euphoria now. How likely is it that they will not grow 40%? I would argue pretty high, as the tech industry go an enourmous bump since March 2020.",
        "created_utc": 1638360097,
        "id": "hmsbvkf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638388897.0
    },
    {
        "author": "TGD187",
        "body": "My January 22 170C AAPL will print, won't they?! Fucking bought them during the Gamestop craze and watched them dump since then, tendies seem to be on the menu now.",
        "created_utc": 1638358359,
        "id": "hms9gzn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638387159.0
    },
    {
        "author": "Spirit_Panda",
        "body": "&gt;**Extended lockup period agreed upon by investors\n\nHow exactly is this an NPV positive thesis? \n\n&gt;**Large percentage of Institutional investors\n\nNot sure why you think this is a good thing lol. It actually exposes the stock to violent selloffs.\n\n&gt;**0% redemption per today's filing\n\nSPAC squeezes are actually based on high redemption % which reduces the float. 0% redemption is actually bad for a squeeze thesis because dilution is at maximum. \n\n&gt;**High short interest with high borrow rates (less incentive to short due to massive upside)\n\nOk.\n\n&gt;**Great company with a huge market\n\nLol tell me their plan to become profitable again? Have you even looked at their financials?\n\nGood Lord man. This is the state of financial market participants now.",
        "created_utc": 1638360946,
        "id": "hmsd3q2",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638389746.0
    },
    {
        "author": "Gordon_Betto",
        "body": "Good. Now sell it and enjoy a lifelong story-tell story with a happy end.",
        "created_utc": 1638360976,
        "id": "hmsd5b9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389776.0
    },
    {
        "author": "neotoxgg",
        "body": "Now do it with stocks that are down ytd",
        "created_utc": 1638359347,
        "id": "hmsatp3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638388147.0
    },
    {
        "author": "SStauning",
        "body": "VALE the mining company? You're kidding, right? I mean, a Gamma squeeze on that dog... now that's funny.",
        "created_utc": 1638361888,
        "id": "hmsejgi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390688.0
    },
    {
        "author": "EarningsBitch",
        "body": "Friendship with SPY ended, now SOXL is my best friend",
        "created_utc": 1638361155,
        "id": "hmsdevm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389955.0
    },
    {
        "author": "elonhole",
        "body": "Marlet on friday: nooo fucking omicron😵\nMarket on monday: shit I love omicron now🤑\nMarket on tuesday: noooo fuck, inflation is non-transitory😵\nMarket today: wait I love inflation wtf🤑",
        "created_utc": 1638361136,
        "id": "hmsddvz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638389936.0
    },
    {
        "author": "EnginrA",
        "body": "Yeah thats my face right now",
        "created_utc": 1638361759,
        "id": "hmsec2u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638390559.0
    },
    {
        "author": "golden_bear_2016",
        "body": "Damn wtf, we back to Kangaroo market now??",
        "created_utc": 1638352906,
        "id": "hms2t6g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638381706.0
    },
    {
        "author": "SnipahShot",
        "body": "PayPal lost a lot of its value, people will be selling now to reduce their taxes probably.",
        "created_utc": 1638352956,
        "id": "hms2v9j",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638381756.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "&gt;How is this not all over the newswires\n\nIt is.\n\nBut you're falling victim to irrational hyperbole and exaggeration.\n\nMany of us have been saying since the start of this bull market that when the inflows stopped, there would be a correction, so be ready for that.\n\nTheir job is not to keep the market trading mostly-sideways, their job is to support the real economy. Now that companies are doing better, getting strong revenues... it doesn't really matter if the market does a hard correction. It isn't needed for there to have been a \"mistake.\" They communicate what is necessary to try to keep people calm, until the time comes for a change, and then the change is made. There is nothing in \"promote effectively the goals of maximum employment, stable prices, and moderate long-term interest rates\" about stonks always going up. If they had tapered a year ago, as you seem to be suggesting, before employment had recovered then companies might not have done the same amount of hiring. That was the goal all along, and they've been saying that all along. If you've been listening to them. A lot of people have been responding with continuous cynicism, instead of listening, and those people are less prepared to rotate their investments on time.\n\nIt is up to each of us, as traders and investors, to be prepared for things like this, and to make sane choices.",
        "created_utc": 1638349358,
        "id": "hmryr70",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638378158.0
    },
    {
        "author": "CoffeeAndDachshunds",
        "body": "Yeah, I'm a huge bear, but the correct answer for investing some money is always \"now\".",
        "created_utc": 1638350036,
        "id": "hmrzj84",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638378836.0
    },
    {
        "author": "mrtmra",
        "body": "Congrats, you are the one winner who made money out of 11million of us. Now let me fk your wife.",
        "created_utc": 1638351998,
        "id": "hms1rno",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638380798.0
    },
    {
        "author": "tortoisepump",
        "body": "ATVI a steaming pile of shit right now. Currently $58.  Worth a some calls if it hits $52 which was their March 2020 low? Or is this dumpster fire beyond saving?",
        "created_utc": 1638349655,
        "id": "hmrz3gn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638378455.0
    },
    {
        "author": "RedditPropagandaTool",
        "body": "I've speculated (I purposefully don't use the word investing) with a very small sum in EUR P2P lending since 2019. After Covid, my losses are about equal to the profits, and even worse if you count taxes. Right now, I'm withdrawing everything.\n\nHow it works is that you basically just send money to some Latvian bank account, there is no regulation, and there is no guarantee that you will ever get any of your money back. It's all hopes and promises.\n\nThe buyback obligation is false advertising, because it counts for nothing if the company defaults (which happens all the time).\n\nWorst of all, when there is a crisis, everything stops, and right when you need the money to invest in the stock market (in bear market), you instead have your cash tied up in some Eastern European account.",
        "created_utc": 1638351299,
        "id": "hms0z0i",
        "score": 1,
        "subreddit": "investing",
        "created": 1638380099.0
    },
    {
        "author": "i-bet-you",
        "body": "You’re probably a real broke mother fucker by now",
        "created_utc": 1638348794,
        "id": "hmry3cm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377594.0
    },
    {
        "author": "sinncab6",
        "body": "Yeah there's no firm time table for HBO max getting folded in until that happens this is just going to waffle in its range just like Viacom.\n\nFar better places you can stick your money in now but whenever HBO max ends up there I'm all over it but right now Season 468 of Gold Rush and Deadliest catch ain't really moving the needle",
        "created_utc": 1638347395,
        "id": "hmrwf0f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376195.0
    },
    {
        "author": "rifaplax21",
        "body": "Finally some good fucking news for NIO. It's been a busy month for them. Successful expansion (albeit small) to Norway. Partnership with Shell. All time high deliveries (slightly higher than previous high). This is going to be a slow cooker but I'm feeling good about the long haul now.",
        "created_utc": 1638347952,
        "id": "hmrx2px",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376752.0
    },
    {
        "author": "WhenMoonsk",
        "body": "What’s with all the Russian talk now",
        "created_utc": 1638346257,
        "id": "hmrv0fg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375057.0
    },
    {
        "author": "T1m3Wizard",
        "body": "Tsk tsk. Now she won.",
        "created_utc": 1638346715,
        "id": "hmrvkxl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638375515.0
    },
    {
        "author": "Attorney-Outside",
        "body": "yes very much, maybe Thursday will be red since we've been zig-zagging for a week now",
        "created_utc": 1638347332,
        "id": "hmrwcb8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376132.0
    },
    {
        "author": "ravioli_bruh",
        "body": "$20 trillion market cap incoming now that it's an ev company",
        "created_utc": 1638346376,
        "id": "hmrv5qa",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638375176.0
    },
    {
        "author": "StopTheBan420",
        "body": "Been up since 6 am working, now I gotta get up at 6 again and I’m scared to go to sleep and miss the alarm. Fuckkk also bears r fukkk",
        "created_utc": 1638346100,
        "id": "hmrutan",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374900.0
    },
    {
        "author": "Jerome_BRRR_Powell",
        "body": "Superstonk was cool for a while, than it got lame af and now its sad...\n\nFolks thinking a single share can give them generational wealth, selling it for 1m +....",
        "created_utc": 1638345654,
        "id": "hmru8s0",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638374454.0
    },
    {
        "author": "Veolt1",
        "body": "So I guess now would be the time to start buying the dip unless it constantly goes down till it's clear what omicron is capable of.",
        "created_utc": 1638346051,
        "id": "hmrur34",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1638374851.0
    },
    {
        "author": "Rodrigo87",
        "body": "What's worse. Losing 500k but have no debt or getting a loan for 50k, losing that and now you have debt.",
        "created_utc": 1638345721,
        "id": "hmrubsq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374521.0
    },
    {
        "author": "whatshisuserface",
        "body": "The years 2100, covid did a few cycles in the Greek alphabet and is now at omega-29, PLTR is slowly but surely approaching $23",
        "created_utc": 1638346157,
        "id": "hmruvx3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374957.0
    },
    {
        "author": "Chgralac73",
        "body": "Jack Ma was selling Baba stock to west and buying Chinese media companies. gov did not like it. they are now going more into ok we got oligopoly going on, lets go standard oil on them and allow small startups to get bigger. tencent and alibaba were essentially forcing anyone else to partner/sell equity to them.\n\nits like in us. facebook should have never been allowed to buy instagram and whatsupp\n\nthat being said what happens to stock people already own? i mean nio is really attractive with being able to switch battery out",
        "created_utc": 1638354464,
        "id": "hms4m4r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383264.0
    },
    {
        "author": "Specific-Dot6556",
        "body": "I've always been told the market tries to price in future potential so it my guess is it may pop on negative news since demand is strong now and once they fix any issues from the negative news then demand should theoretically be even higher. Although that's making the assumption the company will resolve those issues. Takes severe optimism imo.",
        "created_utc": 1638356076,
        "id": "hms6k32",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638384876.0
    },
    {
        "author": "SDI_Sunset",
        "body": "are happy bears trending now?",
        "created_utc": 1638345803,
        "id": "hmruflm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374603.0
    },
    {
        "author": "Jazzlike-Actuary382",
        "body": "While the general consensus is that the average taxes will increase, we don't know which taxes. They could increase sales taxes and lower income taxes for example, making a Roth a bad investment now.\n\nAnother possibility is maybe in the future there will be a basic income since lots of jobs could get automated and income taxes could be reduced to 0 to incentivize work for those who want to live on more than the basic income.\n\nThat's why it's prudent to diversify with taxes and have both Roth and traditional accounts. I personally contribute only to Roth because company matches to Roth 401k are considered traditional so if you have a Roth 401k you're already diversified. Your contributions are post-tax but the company's are pre-tax.",
        "created_utc": 1638346409,
        "id": "hmrv77m",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638375209.0
    },
    {
        "author": "Spiritual-Truck-7521",
        "body": "I just want to see if I'm still on reddit or alive to get this reminder now.",
        "created_utc": 1638345647,
        "id": "hmru8ge",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374447.0
    },
    {
        "author": "SlogCorp",
        "body": "I don't get them. I don't hate them, I just don't understand it. And I've tried. So they're not a play for me that's for sure. NFTs are the first thing that has made me feel old. Just turned 40, been feeling fine about it. Tried to read up on NFTs and now I need a walker.",
        "created_utc": 1638345698,
        "id": "hmruaqv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638374498.0
    },
    {
        "author": "kgg42",
        "body": "First the Russians interfered with the election, now they’re interfering with our subreddit 🥴",
        "created_utc": 1638346037,
        "id": "hmruqh8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638374837.0
    },
    {
        "author": "McKoijion",
        "body": "Welp, here we go. A few months ago (even after it plunged following Jack Ma's statements), Alibaba was still one of the 10 most valuable companies on the planet. Now it has gone the way of Tibet, the Uyghurs, Tiananmen Square, Hong Kong, hopefully not Taiwan, etc. Moral of the story: don't piss off dictators. \n\nhttps://finance.yahoo.com/news/china-plans-ban-loophole-used-073233461.html",
        "created_utc": 1638348901,
        "id": "hmry7xk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377701.0
    },
    {
        "author": "ApartPersonality1520",
        "body": "If you click on the video you can clearly see he is autistic. \n\nProbably reading this right now",
        "created_utc": 1638349292,
        "id": "hmryoe9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638378092.0
    },
    {
        "author": "Just_Crazy",
        "body": "Best time to invest is 20 years ago. Second one is now",
        "created_utc": 1638347813,
        "id": "hmrwwsf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638376613.0
    },
    {
        "author": "AnotherDegenerateFK",
        "body": "The liquor is calling the shots now, Randy",
        "created_utc": 1638348425,
        "id": "hmrxn62",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377225.0
    },
    {
        "author": "wolfiasty",
        "body": "Now for our holdings to go green as well.",
        "created_utc": 1638349970,
        "id": "hmrzgil",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638378770.0
    },
    {
        "author": "Upper-Equivalent3651",
        "body": "Grats! Great bet.\n\nFor now.",
        "created_utc": 1638348064,
        "id": "hmrx7i2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638376864.0
    },
    {
        "author": "DoctorPumpAndDump",
        "body": "This market keeps fucking me. I bought SPY calls last Wednesday before the market closed and sold for a huge loss on Friday and switched to puts which i also sold for a massive loss on Monday. Then yesterday i bought puts right before market close and now futures keep going up for no reason.",
        "created_utc": 1638350455,
        "id": "hms00et",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638379255.0
    },
    {
        "author": "Jericho3434",
        "body": "35 years? Is that a thing now?",
        "created_utc": 1638348596,
        "id": "hmrxunj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638377396.0
    },
    {
        "author": "zzzerocool",
        "body": "Yep, Disney + isn't much of a Netflix competitor. Disney+ plus Hulu is. I think they're in an awkward spot where they share ownership of Hulu until 2024 with Comcast where they can then buy them out for fair value. I wonder the exact details, it sounds like Disney is hesitant to go all in on Hulu because it will cost them more in the end to own it. That's actually what Comcast is legally feuding with them now about, they're saying that Disney is sandbagging with slow expansion of Hulu in foreign markets so they won't have to pay Comcast as much. I wonder if that's limiting how much Disney wants to invest in Hulu original content right now as well.",
        "created_utc": 1638350773,
        "id": "hms0djn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638379573.0
    },
    {
        "author": "MrSteveC",
        "body": "Beef was a better quality back then, now more additives to the mix. Stop going in the front door for your protein. Behind the dumpster outback pure protein served.",
        "created_utc": 1638356367,
        "id": "hms6wpy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638385167.0
    },
    {
        "author": "Andrew_the_giant",
        "body": "Youre just realizing this now?",
        "created_utc": 1638355563,
        "id": "hms5xnl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638384363.0
    },
    {
        "author": "wearahat03",
        "body": "Have you done a DCF valuation for that? \n\nBecause if they doubled their revenue just 2 years, with constant margins, their profits would go from 8bn to 32bn which would put them at 26PE in just 2 years\n\nNo one is expecting NVDA to double revenues every year, if they were expected to, their valuation would be far higher than it is now",
        "created_utc": 1638350871,
        "id": "hms0hgd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638379671.0
    },
    {
        "author": "Garpcui",
        "body": "Just wait till the first Omicron case is announced in the USA (any day now). I guarantee you are gonna cry that day.",
        "created_utc": 1638355008,
        "id": "hms59pr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383808.0
    },
    {
        "author": "James383Magnum",
        "body": "Hey everyone:\n\nI currently have a large portion of my portfolio in TDB627. Over the last few years, I have been slowly selling this off to buy individual stocks. I would like to sell my units in this to buy  individual stocks and ETFs. My time horizon is 29 years.\n\nMy investing strategy is to buy and DRIP stocks/ETFs/etc that pay consistently growing dividends and also provide good long-term total returns (10% per year or better). I am also trying to diversify by having equal weighting in every sector.\n\nThe diversifying part is where I am having trouble. Right now, the sectors I don't have exposure to are: Energy, Consumer Discretionary, Basic Materials, and Healthcare. I have yet to find an individual company in these sectors that I like enough to buy stock in. I have found energy to be a particularly tricky sector.\n\nIs there an ETF that has equal-sector weighting, and has performed well over the long-term? Or would I be better served by buying an S&amp;P 500 or TSX60 ETF?\n\nThanks!",
        "created_utc": 1638355390,
        "id": "hms5q6o",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1638384190.0
    },
    {
        "author": "thetasbitch",
        "body": "LISTEN CLOSE POORS:\n\nIf you made put spreads out of your puts yesterday, instead of holding overnight because you were out of day trades, you would at least have some profit right now. Instead your puts are dead.",
        "created_utc": 1638354430,
        "id": "hms4kmq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638383230.0
    },
    {
        "author": "AngryBirdCasualGamer",
        "body": "I think a similar scheme lead to the collapse of Greensill Capital recently.  They provided loans for various things to do with supply chain management.\n\nSteel Magnate Sanjeev Gupta was taking the loans from Greensill then aggressively acquiring companies and assets into his “empire” then immediately using those assets to acquire further loans from Greensill at values inflated wayyy above actual book value.\n\nIn effect he was buying companies, getting control of their assets, immediately securing loans against the assets and then using those loans to buy further companies / assets. etc. \n\nIt’s funny because Gupta is still going but Greensill collapsed because the bigger banks it was using for its own finance decided it was being too risky and froze its accounts leading to its collapse.  \n\nGupta kinda did what you’re asking about but it’s all pretty dodgy and it appears as though he has gotten away with it, at least for now.",
        "created_utc": 1638356882,
        "id": "hms7k94",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638385682.0
    }
]