[
    {
        "author": "official_new_zealand",
        "body": "Or sell \"custom\" ready mades that are built to spec to  run different AAA titles at different frame settings and resolutions for different budgets, your 12 year old cousin wants to play fortnite? here is a $500 PC with integrated ryzen graphics, a single stick of ram, but a nice case with some led lights, he'll be happy, if you want to play cyberpunk with full raytracing but don't have the time to build your own, or can't be bothered waiting for packages from newegg, then spend $2k and get an RTX3080 equiped machine off the shelf.\nThere is a market for pre-built machines that don't completely suck, not everyone wants to build their own (but they're forced to) absolutely no gamer wants to buy a Hewlett Packard from a big box retailer, because you can't game on that crap.\n\nLook at what mightyape here in New Zealand are doing. This is absolutely an area of future growth that gamestop (/ ebgames) has ignored.\n\nhttps://www.mightyape.co.nz/computers/gaming-rigs-gear/gaming-pc/gaming-pcs?q=stock~instock\n\nStocking parts and selling retail isn't a direction I'd want the company to head in, those who build pc's piece by piece don't usually buy their parts from brick and mortar retailers, they research online, then purchase online. The shit on a retailers shelf sits in the same dusty box for years.",
        "created_utc": 1610336647,
        "id": "giu55b3",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1610365447.0
    },
    {
        "author": "NoAtmosphere2271",
        "body": "Converge Technology Solutions ($CTS.V) is not a penny stock but it might as well be. I have no clue what they do but their trading multiples make absolutely zero sense. Their market cap is less than this years revenue, and their last quarter was profitable. Share price of 6 something when it should be at least double. It’s uplisting to the TSE is set for February 17th and I would recommend hopping onboard this choo choo train before it hits double digits. Institutional ownership sits at a mere 3.8%. Insiders have bought ~950K shares in the past 12 months and own ~12.3%. They haven’t sold a single share and the biggest holder is the CEO at 8.13%. The company has made something like 17 acquisitions in North America since October 2017 and have plans to expand into Europe in the future. If you need any more convincing, go look at the list of their platinum sponsors for next weeks #ConvergeConnect21 conference.. You might recognize some of the companies: IBM, Redhat, Google Cloud, Microsoft, Dell, VMware, AWS, PureStorage, Cisco, and Snowflake. Lenovo and PaloAlto are two of the gold sponsors. Hewlett-Packard and Intel are two of the silver sponsors. This is a Constellation Software-like company in the making- MASSIVE. Their latest bought financing closed today fully subscribed for a mere 80+ million dollars. Guess what they plan to do with it that money- M&amp;A. Did I forget to mention that they are very likely to break a billion in revenue this year? Oh yeah and they’re still on the venture exchange! \n\nTLDR: CTS.V - strong buy before Q4 earnings (don’t know when they are), or at least before uplisting to TSE in mid Feb. Thank you.",
        "created_utc": 1610760719,
        "id": "gjepge1",
        "score": 17,
        "subreddit": "CanadianInvestor",
        "created": 1610789519.0
    },
    {
        "author": "xkulp8",
        "body": "Bought Compaq years ago. Then it became HP, then HP split into HPE and HPQ, then I got some DXC in the spinoff, then I got PRSP in the next spinoff.\n\nSo I have 5 shares of PRSP.\n\nAt least *something* might make money for me out of the old CPQ.",
        "created_utc": 1609875388,
        "id": "gi7npln",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609904188.0
    },
    {
        "author": "Universal-Omnicide",
        "body": "Breaking News: Goldman'sSachs must invest list for 2021\n\nGE \n\nAT&amp;T\n\nBAYER\n\nIBM \n\nHewlett Packard",
        "created_utc": 1609789494,
        "id": "gi3lmu6",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1609818294.0
    },
    {
        "author": "TAUTJ",
        "body": "I used to work for DXC Technologies (after the spin merge with HPE). They were hot garbage then. Have things improved since?",
        "created_utc": 1609724835,
        "id": "gi0sdx5",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1609753635.0
    },
    {
        "author": "Ask_me_4_a_story",
        "body": "Well for one he is upset that Wall Street is less a bunch of rich white guys having lunch together in NYC and more spread out and its not easy to game the system anymore. If any of you are wondering how Jim Cramer got rich I read the book so you dont have to do it. His book is called Addicted to the Street and this fucker made all his money by doing what Martha Stewart got put in prison for. I'm not even exaggerating thats 100% what he did. Typical section from the book. \n\nJim Cramer: Hey what are you guys over there at Lehman Brothers saying about Hewlett Packard? \n\nLehman Brothers assholes: You know what, we are thinking about dropping our rating. Why, what you got?\n\nCramer: Nothing really, I might drop my rating too. Lets do it on Thursday, I'll put in the short today. You guys?\n\nLB: Yeah, we can short today and then release our move from buy to sell on Thursday. Sounds good. Talk to you then.\n\nAnd thats how that fucker made money. I shit you not. Read the book, its all insider trading and he is not even ashamed about it. Fuck that guy",
        "created_utc": 1610987393,
        "id": "gjqdgua",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1611016193.0
    },
    {
        "author": "Waldo149",
        "body": "I use multiple\nBrokers so when one is having a problem you can use another plus unlimited day trades if your using three or more if your under 25k. Unlimited meaning at least one a day. \n\nAllows you to not blow up every account at one time. Hopefully lol\n\nBut I find myself sharing similar investments amongst them. \n\nNok 50 calls\n\nHpe 500 calls\n\nGme shares\n\nThey each allow different securities to be bought as well. \n\nSome allow pink slips and otc penny stocks e trade. And others allow warrants if you get into spacs and other types of investments",
        "created_utc": 1611937784,
        "id": "gl95tng",
        "score": 4,
        "subreddit": "stocks",
        "created": 1611966584.0
    },
    {
        "author": "Waldo149",
        "body": "Read up on HPE. Seriously. Earnings in a month. Low iv cheap options right now. \n\nThey are trading below covid levels and have gone to a more cloud business suite solution. They have buy ratings. Really under rated right now. I got 500 contracts between may and Jan 15-17$. \n\nSome quick googling and looking at past announcements in October. Shows really good indication. \n\nThey also have upped earnings and forecast. \n\nWith iv this low and volume to pick up closer to earnings I don’t really see to much downside\n\nEdit: 🚀🚀🚀",
        "created_utc": 1612113817,
        "id": "glhx9u1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1612142617.0
    },
    {
        "author": "Lisno7",
        "body": "HPE 3/19 $16c",
        "created_utc": 1611114318,
        "id": "gjwpqim",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1611143118.0
    },
    {
        "author": "Waldo149",
        "body": "Today is good entry for a lot of stocks with the general stock market being down. \n\n\nI have been getting into HPE here recently with the pt increase as well as eps increase with ther new cloud business subscription service they are offering. \n\nAm I missing somethigg by. Volume picks up weeks before earnings each earnings and it is still trading at pre covid levels with out even including the consolidation they did.\n\nPositions 500 calls from may to Jan 2022",
        "created_utc": 1611936692,
        "id": "gl92ttz",
        "score": 3,
        "subreddit": "stocks",
        "created": 1611965492.0
    },
    {
        "author": "jamzkourt",
        "body": "Hpe is killing your vibe .... nice diamond hands tho , I can’t hold for more than an hour",
        "created_utc": 1610245918,
        "id": "giq0ru9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1610274718.0
    },
    {
        "author": "giant_g2",
        "body": "I mostly agree with your tech statement. I think there's also a risk for the tech platforms that rely on data for their income. The new admin might actually pass some privelacy protections that would make a dent.\n\nThe exceptions I see to my feeling on this are MSFT and HPE/HPQ. MSFT is pretty diverse and doesn't rely on personal data for the bulk of their income. HPE/HPQ seem to have been ignored compared to other hardware companies. I think the hype around chipmakers drew most of the money and some the intermediaries seem left behind.",
        "created_utc": 1610740750,
        "id": "gjdmiea",
        "score": 2,
        "subreddit": "stocks",
        "created": 1610769550.0
    },
    {
        "author": "SillyfkiNGo0se",
        "body": "True, but aws and amazon should be 2 different companies, like hp and hpe. Its ridiculous to be able to host a competitors website, store their data and have access to them all the while coming out with knock offs called amazon basics using their data",
        "created_utc": 1609908762,
        "id": "gi9s6q6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1609937562.0
    },
    {
        "author": "Alarmed-Tooth-7945",
        "body": "HPE AND SNDL",
        "created_utc": 1611771759,
        "id": "gkzcdu2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611800559.0
    },
    {
        "author": "Triposer",
        "body": "HPE.",
        "created_utc": 1612059687,
        "id": "glfq4mf",
        "score": 2,
        "subreddit": "options",
        "created": 1612088487.0
    },
    {
        "author": "Winged-Dove3202",
        "body": "GE looks like a solid, any thoughts on HPE?",
        "created_utc": 1611981789,
        "id": "glc3oyw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612010589.0
    },
    {
        "author": "Waldo149",
        "body": "Yea let me find it. Since this gme phase been hard finding the dds on wsb they either get downvoted or don’t make the cut for long if they aren’t meme. \n\nIf you head over there and search I just checked there is actually only one uo that’s somewhat recent. Few days old. But he doesn’t have to much information. \n\nJust talking about the computer aspect of hpe. \n\nI think what’s going to change them is the covid restructuring they did mixed with going to the cloud to offer their services subscription based or per use.\n\nWith that was their boost in October when they announced that I’m pretty sure. \n\nThey also recently raised guidance for this year which is good. \n\nLike I said I have tried to find something to really turn me off other then they have competitors In the market. But it’s also a growing market and they have a foot in the door already.",
        "created_utc": 1611939053,
        "id": "gl99bl2",
        "score": 2,
        "subreddit": "stocks",
        "created": 1611967853.0
    },
    {
        "author": "zheng_ole",
        "body": "HPE moon mission loading",
        "created_utc": 1611771357,
        "id": "gkzb8ml",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611800157.0
    },
    {
        "author": "Waldo149",
        "body": "Yes. Thank you I have been hoping to get back to some sort of normalcy need more née DD I have been trying to write one for HPE. Need to get around to it",
        "created_utc": 1612113682,
        "id": "glhwz9g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612142482.0
    },
    {
        "author": "Winged-Dove3202",
        "body": "What's your thoughts on HPE?",
        "created_utc": 1611981114,
        "id": "glc2hkz",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1612009914.0
    },
    {
        "author": "Forsaken-Pangolin-57",
        "body": "So I’m pretty out of my depth here. It’s a work project, but I’m essentially first trying to determine whether they were over or undersubscribed. Oversubscribed meaning that more ParentCo shares are tendered than new company shares are offered than exchange is done on a pro-rata basis. Usually, some sort of 8K or company press release state that the offer is oversubscribed. There’s a handful I’m looking at that don’t explicitly state it one way or the other, and I’m just trying to determine what happened in these deals (GE and Wabec, HPE and Micro Focus, HPE and DXC, Starwood and ILG, Nabors and C&amp;J Energy Services, Tyco and Pentair). Doing this to look at employee equity when deals are undersubscribed.",
        "created_utc": 1610741389,
        "id": "gjdnugm",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1610770189.0
    },
    {
        "author": "Wippwipp",
        "body": "Sold HPE and bought GME, who's with me?",
        "created_utc": 1611872064,
        "id": "gl5lcmc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611900864.0
    },
    {
        "author": "Waldo149",
        "body": "For meme plays yes. I would also tell people to start checking your Hpe leaps. \n\nThey have done a lot with their business model and have even raised forecasts I see them being the next sleeping giants. \n\nI have been in all the meme stocks still hold early calls and shares. \n\n\nJust bought 500 leaps on Hpe 15-17 strike and from\nMay to Jan.",
        "created_utc": 1611929725,
        "id": "gl8jjio",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1611958525.0
    },
    {
        "author": "Waldo149",
        "body": "Hpe leaps are really cheap with earnings in a month iv is really low and they are trading at precovid levels still",
        "created_utc": 1612014895,
        "id": "gld882l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612043695.0
    },
    {
        "author": "Charles472",
        "body": "HPE",
        "created_utc": 1611771021,
        "id": "gkza9c7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611799821.0
    },
    {
        "author": "Ironleg01",
        "body": "Ok, super brief summary: HP split into HPQ and HPE. HPQ kept the legacy crap like PC and printers, HPE kept servers and cloud. Over time HPE spun off much of legacy crap like IT support and acquired some very good companies like Cray (super computers) and Silver Peak (SD WAN). Now HPE is leading on prem cloud provider (not competing with AWS) with best software defined WAN solution and also selling super computers. In this overvalued market you get tech company with great products, around 4% dividend and 15 p/e ratio. Even if it doesnt take off you can't loose with this low valuation.",
        "created_utc": 1610886718,
        "id": "gjks32t",
        "score": 1,
        "subreddit": "stocks",
        "created": 1610915518.0
    },
    {
        "author": "sketchydragon22",
        "body": "I’m very young (16) and I have a question that is more general.  I currently have 60 shares of HPE bought at 12.72 last year.  Price finally recovered due to covid and down sales.  Along the way I have received $40 in dividends from it roughly so I will have turned a minimal profit if I sell now if you count that.  I’m not crazy about the pick and if I had it liquidated I know exactly what I’d put the money into.  Should I hold to try and sell for a 14-15$ PT in the (3-6 months I’d imagine +1/2 Quarters dividends) for ~10% gain or should I sell and RE-invest in stocks that I’m much more enthusiastic about and I feel have higher upside.  Any input helps and for reference my risk tolerance is very high because I don’t invest everything and have few expenses.",
        "created_utc": 1610927945,
        "id": "gjnz1xx",
        "score": 1,
        "subreddit": "investing",
        "created": 1610956745.0
    },
    {
        "author": "EDGEdaily",
        "body": "Agreed! From what I’ve read, it seems like VS has already built their tech and now in the process of being deployed to the market.\n\nOne of their first clients is HP - Hewlett Packard (one of the biggest computer brands in the world).\n\nI’m curious how the roll out to the public goes as well!",
        "created_utc": 1611151594,
        "id": "gjy0yz5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1611180394.0
    },
    {
        "author": "at_lexitus",
        "body": "I want to start investing in March this year and I did a lot of research recently. \n\nI am already 40 so I am a little late to the game. I am thinking of diversifying my investments in two major areas: Buying physical gold (30-50%) and buying stocks and ETFs (50-70%). \n\nBuying physical gold might sound very conservative but given the gold price development and the huge uncertainty that is surrounding us these days I believe this is not a bad idea (and there is no tax on buying or selling gold). \n\nI am considering the following stocks:\nPayPal: With its recent development and the new crypto payment feature I am quite sure that it will be a safe bet. My goal would be to hold.  \nCorsair: A great and stable hardware provider now trying to get into the Esports business (which I think will be huge in the future). My goal would be to hold and monitor. \nTaiwan Semiconductor: The biggest producer of semiconductors. In my opinion a safe bet. My goal would be to hold. \nDocuSign: Many companies now getting into eSignature (accelerated big time through the pandemic). 2021 will be a big year for DocuSign. My goal would be to monitor throughout the year and decide based on what happens. \nHewlett Packard Enterprise: Not 100% convinced about this one. I see it as a rather risky penny stock option with good potential (they are into 5G and IoT so I believe they have potential). \nClearway Energy Inc: Second risky penny stock options. Their are planning to expand to China so the potential is quite big. \nCoinBase: I am buying into CoinBase as soon as their IPO happens sometime this year. In my opinion a no brainer. \n\nMy strategy for stocks might seem a bit weird as it is pure tech related. But I am expert in the tech space with 15+ years of professional experience. So this area is my playground and I have very good insights and understanding of the sector. I don‘t want to buy stocks from other industries I have no clue about. \n\nFor ETFs I am thinking about these:\nI fell in love with the ARK stuff and the more I research the more I like them. So I am thinking of ARKG (Genomic revolution) and ARKK (Innovation) or ARK IZRL (Israel Innovative Technology). I believe that Israeli companies will have additional potential in 2021 as they will be the first one to come out of the pandemic (also their startup scene is incredibly strong). \n\nDo you think it is smart to buy physical gold?\nDo you think it is a bad idea if all 2 or 3 of my ETFs would be ARK*?!\nDo you think this is a good overall portfolio strategy and how would you rate it?\n\nSorry for the wall of text and all the questions. If you have made it until hear I would really love to hear your thoughts, any feedback or criticism is highly appreciated :)",
        "created_utc": 1610042105,
        "id": "gig4l6p",
        "score": 1,
        "subreddit": "investing",
        "created": 1610070905.0
    },
    {
        "author": "Waldo149",
        "body": "Hpe leaps lads. I’ll post dd here keeps getting deleted in wsb since it’s not gme ! \n\nCompany has done a lot and raised forecasts for upcoming earnings and iv is super low.",
        "created_utc": 1611929850,
        "id": "gl8ju5k",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1611958650.0
    },
    {
        "author": "Waldo149",
        "body": "Am I missing something with HPE. I have been going over their financials and their team. On top of that they are trading at pre covid levels and have increased earnings forecast and positive outlook with their new subscription based cloud platform. \n\nWhy are the options so cheap. Iv is low leaps at least 90 days out and a few dollars oout of the money is what i tend to look at. \n\nHey have earnings next month. March. Wouldn’t you then assume there would be an iv spike towards earnings. Increasing option prices? \n\nI get there is a lot of focus right now on the media and the meme stocks. Maybe that’s playing a roll on people moving money between companies.",
        "created_utc": 1611880453,
        "id": "gl652dg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1611909253.0
    },
    {
        "author": "Waldo149",
        "body": "Most these guys will find the exit on their own. I’m just giving it time. Long time lurker. Here. Made an account to post on this Reddit. Never even really did that. \n\nThe pump and dumps will fail. Retards see easy money here when it’s anything but. They don’t realize more retards on this sub LOSE money then GaIn money. \n\nWe want loss porn \n\nPositions Hpe 500 calls 15-17 strike may-Jan",
        "created_utc": 1612018911,
        "id": "gldew9o",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1612047711.0
    },
    {
        "author": "jcole1996",
        "body": "HPE gearing up",
        "created_utc": 1611775912,
        "id": "gkzm85q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611804712.0
    },
    {
        "author": "therandycandybk",
        "body": "HPE definitely the play",
        "created_utc": 1611114771,
        "id": "gjwqino",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1611143571.0
    },
    {
        "author": "Alarmed-Tooth-7945",
        "body": "HPE",
        "created_utc": 1611771752,
        "id": "gkzcd4f",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1611800552.0
    },
    {
        "author": "PlaneReflection",
        "body": "Seeing nothing happening AH with PAYX makes me feel bad for all the people Cramer will put down because he won't pump their EV.",
        "created_utc": 1609802653,
        "id": "gi4d6iz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1609831453.0
    },
    {
        "author": "CumShot911",
        "body": "OMI PAYX XLNX AEP",
        "created_utc": 1610662686,
        "id": "gja1rfh",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1610691486.0
    }
]